{"TopicId":90109,"ForumId":32,"TopicTitle":"Are there virtual space agencies recruiting?","CreatedByName":"serolrom","CreatedById":127826,"CreatedDateTime":"2014-11-12T13:57:50Z","PageNum":1,"Articles":[{"CreatedByName":"serolrom","CreatedById":127826,"CreatedDateTime":"2014-11-12T13:57:50Z","Content":"\n\u003Cp\u003EI hope I am not repeating this question, you can be sure I have searched in the forum, but in case this has been commented, I might have searched with the wrong terms...\u003C/p\u003E\u003Cp\u003EI was wondering if KSP has virtual agencies like those you see in Flight Simulator. Two examples (that I have nothing to do with; I fly for another one, but as I am not advertising, I\u0027ve chosen two random ones):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.britishairwaysvirtual.co.uk/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.britishairwaysvirtual.co.uk/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.vacanada.org/v6/en/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.vacanada.org/v6/en/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThese virtual airlines have their website, routes, pilot roster, etc. Pilots perform flights and register them. It adds to the roleplay side of a simulator.\u003C/p\u003E\u003Cp\u003EMany KSP players identify themselves with a name they give to their very own fictional space agency, but do you know of any of these virtual agencies like my examples in the context of KSP?\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-11-12T15:07:27Z","Content":"\n\u003Cp\u003EThe names KASA and KSA pop up in my mind - I\u0027m not sure where to find KASA, but KSA has a very active Twitter account: \u003Ca href=\u0022https://twitter.com/KSA_MissionCtrl\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://twitter.com/KSA_MissionCtrl\u003C/a\u003E \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-12T15:21:43Z","Content":"\n\u003Cp\u003ENot so much agencies as companies, you can find them over in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/52-Rocket-Builders\u0022 rel=\u0022external nofollow\u0022\u003ERocket Builders subforum\u003C/a\u003E. (If I understand what you\u0027re looking for correctly.)\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-11-12T15:47:14Z","Content":"\n\u003Cp\u003EMines is KSPA but I\u0027m not recruiting. Here are others \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/77362-Do-you-have-a-space-agency-for-KSP\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/77362-Do-you-have-a-space-agency-for-KSP\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-13T01:12:48Z\u0022 title=\u002211/13/2014 01:12  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 13, 2014\u003C/time\u003E by Tortoise\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"serolrom","CreatedById":127826,"CreatedDateTime":"2014-11-12T16:35:18Z","Content":"\n\u003Cp\u003EThanks for pointing me in the direction I was looking for.\u003C/p\u003E\u003Cp\u003EI am not (by now) interested in joining a virtual agency, but as I said, coming from flight simulation world, I am used to the strong foundation that exists in the world of virtual airlinies, and got curious if something like that exists in KSP.\u003C/p\u003E\u003Cp\u003EMy conclusion so far is that there is collaborative work, mainly in the rocket building industry. And as I guessed, there are also many space agencies, but not in the same sense as those in the flighs simuation, but just individual ones. Of course it is not a bad thing, it reflects the actual way people enjoy KSP.\u003C/p\u003E\u003Cp\u003EHowever, I am curious about how a virtual space agency (the way I mean) would work. I might even think of creating one in the future. By now, I am not experienced enough, and I don\u0027t currently have the time and energy required for that.\u003C/p\u003E\u003Cp\u003EIf some of you guys do, let me throw this idea, in case some virtual enterpreneur wants to give it a try.\u003C/p\u003E\u003Cp\u003EThink of it as a website with a pilot roster and some infrastructure. Like in the rocket builder section, there could be some \u0027standard\u0027 rockets for players to download, although they could make their own rockets if they wish. Some of these websites allow budget management, so the cost of rockets could be taken into consideration. \u003C/p\u003E\u003Cp\u003EStandard missions could be registered by pilots, earning flight hours, etc. Such as \u0027station refuel\u0027, deliver food to Mun, etc. \u003C/p\u003E\u003Cp\u003EDoesn\u0027t it sound cool? I think it does. But yeah, easier said than done. \u003C/p\u003E\u003Cp\u003EThanks again for the info!\u003C/p\u003E\n"}]}