{"TopicId":90531,"ForumId":32,"TopicTitle":"Nearly 3 years playing KSP and the same old failures happen","CreatedByName":"Boris_T_Roach","CreatedById":27512,"CreatedDateTime":"2014-11-17T08:44:28Z","PageNum":1,"Articles":[{"CreatedByName":"Boris_T_Roach","CreatedById":27512,"CreatedDateTime":"2014-11-17T08:44:28Z","Content":"\n\u003Cp\u003EEvening all\u003C/p\u003E\u003Cp\u003EFor some fun, I designed a small flying RoV science craft for use at Laythe, did all the test flights, made sure it could be launched on a medium sized booster, docked with a standard\u003C/p\u003E\u003Cp\u003Einterplanetary ship carrying a crewed lander and a rover.\u003C/p\u003E\u003Cp\u003EGot to Laythe low orbit, released the drone, set the orbit up so that it would be in the vicinity of an island when it got to 8000m , started on atmospheric entry... and forgot to retract its solar panels.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh well back to LKO and another couple of days building another ship....\u003C/p\u003E\u003Cp\u003EBoris\u003C/p\u003E\u003Cp\u003EYou see KSP beginners... even the veterans cant get it right all the time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-11-17T08:59:05Z","Content":"\n\u003Cp\u003EI forgot to put the landing gear down on my shuttle. All that hard work getting the empty ship back (probe core controlled at that point) and hoping to recover some funds from it... up in smoke as it cratered my runway and smashed the spaceplane hangar to pieces. It\u0027s maddening when the simple mistakes cause the most grief. Open solar panels, not enough batteries, forgotten comms device, crooked landing gear, landing legs retracted, and staging errors are all things I still make mistakes with.\u003C/p\u003E\u003Cp\u003EAnd yes, decoupling the SRB\u0027s and ripping the wings off of the shuttle because I staged too early... Not fun.\u003C/p\u003E\n"},{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2014-11-17T09:04:17Z","Content":"\n\u003Cp\u003EI had a capsule loaded soil samples and scientific data slam into Kerbin the other day. The poor Kerbalnauts did not realize this until reentry and sadly all that data was lost. Oh, and three Kerbals who will be honored and remembered, what\u0027s his name and the other two. I am going to have to give the Kerbals working in the VAB a stern talking to. This was not the first time they have forgotten to install an important or vital piece of equipment.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-11-17T09:23:23Z","Content":"\n\u003Cp\u003EAnd the old \u0022I\u0027ve welded my hatch shut with the thermometer\u0022 gag never gets old.\u003C/p\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2014-11-17T09:35:51Z","Content":"\n\u003Cp\u003EForgetting a com device is my favorite.\u003C/p\u003E\n"},{"CreatedByName":"Johno","CreatedById":1491,"CreatedDateTime":"2014-11-17T09:55:27Z","Content":"\n\u003Cp\u003EOkay, perfect orbit. NAILED IT. We\u0027ll be coming up on rendezvous in 3 . . 2 . . 1 . . Excellent. Circularisation burn complete. Almost there. And a little nudge with the RCS . . . \u003C/p\u003E\u003Cp\u003EWaitaminnit, I have lots of RCS tanks. Why isn\u0027t it . . . \u003C/p\u003E\u003Cp\u003ENo RCS thruster blocks . . . *facepalm*\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-11-17T09:59:46Z","Content":"\n\u003Cp\u003EI\u0027ve been here for a year. Started a new save to test out a large number of new mods... promptly killed Jeb not through the intricacies of said mods, but because I forgot to move the parachute out of the same stage as the liftoff engine on my first rocket.\u003C/p\u003E\u003Cp\u003E*bows to the audience, then goes into a corner to weep in shame*\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-17T10:03:12Z\u0022 title=\u002211/17/2014 10:03  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 17, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-11-17T10:13:16Z","Content":"\n\u003Cp\u003EPutting your abort actions into the staging action group also never gets old...\u003C/p\u003E\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2014-11-17T11:50:37Z","Content":"\n\u003Cp\u003EComing back from my first minmus mission in my new career save. Midway burn to get a perfect reentry (dre installed). Decoupling my last stage ...and watching my radial parachutes float away from my pod. Push jeb! Push!! Obviously you can\u0027t alter the course that fast with an eva-push on a trajectory from minmus...\u003C/p\u003E\u003Cp\u003Emy favourite is the mun mission with a perfect flyby and free return trajactory. Aaand noticing I forgot solar panels on my final stage. I could watch my probe drifting perfectly useless past the mun and getting burned in kerbins atmosphere cause I couldn\u0027t open my chutes (regardless that there was no science on it anyway).\u003C/p\u003E\u003Cp\u003EI als crashed a lander because I saw an easter egg during my decent and forgot about the whole landing thing while trying to determine it\u0027s exact location on the map. That one was just stupid \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2014-11-17T12:19:49Z","Content":"\n\u003Cp\u003EMy favourite mistake is having my ship oriented so that the solar panels are parallel to the direction of sunlight and going on a nice long time warp to drain the batteries. Mercifully it means that I will recover power in around 100 days. Still not ideal.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-17T12:39:36Z","Content":"\n\u003Cp\u003EPlaying for three years now, too. Still make the same silly mistakes, like forgetting the (ladder|chutes|electrical system).\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2014-11-17T13:32:32Z","Content":"\n\u003Cp\u003EThe only reason I won\u0027t turn off \u0022revert to vehicle assembly\u0022 is the sheer number of times I\u0027d be launching and realize at 5km up \u0022Oh! I forgot that Fine Print needs docking ports on its surface bases\u0022 and have to go back just to slap on a few. Still barely made any funds from that mission. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rdwulfe","CreatedById":107690,"CreatedDateTime":"2014-11-17T13:42:10Z","Content":"\n\u003Cp\u003ELights, I always forget lights!\u003C/p\u003E\u003Cp\u003EOccasionally, comms. \u003C/p\u003E\u003Cp\u003EAnd.... sometimes RCS control surfaces. Remember the fuel. Usually.\u003C/p\u003E\n"},{"CreatedByName":"Hary R","CreatedById":111339,"CreatedDateTime":"2014-11-17T14:20:10Z","Content":"\n\u003Cp\u003EA little year of playing and still put my parachutes in the same stage as the main engine.\u003C/p\u003E\n"},{"CreatedByName":"hellion13","CreatedById":66719,"CreatedDateTime":"2014-11-17T15:07:50Z","Content":"\n\u003Cp\u003EI once built a rocket that had 136 kerbals on it. It was supposed to be an all at once instant colony on the MÃƒÂ¼n. Except I\u0027d forgotten launch clamps and the damned thing collapsed and detonated on the pad killing my entire colony...\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-11-17T15:11:12Z","Content":"\n\u003Cp\u003EI\u0027ve been here for almost 3 years and i still can\u0027t build a cargo SSTO. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I\u0027ll admit that.\u003C/p\u003E\n"},{"CreatedByName":"Excalibur","CreatedById":12839,"CreatedDateTime":"2014-11-17T15:31:18Z","Content":"\n\u003Cp\u003EI\u0027ve been playing since mid-2011. Just started a new career in 0.25 after a bit of time away from KSP and I now have both Jeb and Jeb\u0027s rescue craft lying in pieces on the Mun.\u003C/p\u003E\u003Cp\u003EMust remember to pause the game during terminal landing burn when I run to the kitchen to make a cuppa! Oh and must remember not to do the same when I attempt to land the rescue ship. Perma-death and no quickloads really do add an edge to the game when the above happens!\u003C/p\u003E\u003Cp\u003EI\u0027d say most of my mistakes these days are down to pilot error and not engineering flaws (not minor ones anyway); I\u0027ve lost too many missions to blocked hatches/no solar panels etc!\u003C/p\u003E\u003Cp\u003EOh and Zekes I still struggle to make heavy-lift SSTOs too, though I blame that on my PC not really being fast enough for high-part counts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-17T15:43:29Z\u0022 title=\u002211/17/2014 03:43  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 17, 2014\u003C/time\u003E by Excalibur\u003C/strong\u003E\n\u003Cbr\u003EClarity\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-11-17T15:32:48Z","Content":"\n\u003Cp\u003EFortunately I have a mental checklist of basic features now, so most of my rockets make it up without major features missing. Unfortunately, one item on that list (antennae) tends to not get checked nearly as often as it should. I also tend not to include RCS at all, just because it\u0027s such a hassle and because I am awesome at docking without it.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-17T17:13:37Z","Content":"\n\u003Cp\u003EOK, plane looks good, stability derivatives are mostly green, landing gear\u0027s on, I\u0027ve added an rtg, Launch.\u003C/p\u003E\u003Cp\u003EPlane spawns on the runway and waitaminute, I need intakes! *Revert to SPH*\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-11-17T17:16:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003E I also tend not to include RCS at all, just because it\u0027s such a hassle and because I am awesome at docking without it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo RCS? Just punch the ship in the right direction.... XD\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-11-17T17:57:22Z","Content":"\n\u003Cp\u003EACK! I just made a completely stupid move and I\u0027m ashamed of myself. Built a wonderful Kerbin Explorer airplane (not designed to go to space at all, just to gather my missing science on Kerbin) and made the biggest mistake I\u0027ve done yet.\u003C/p\u003E\u003Cp\u003EI remembered to have my parachutes onboard, and they were set properly to my abort stage.\u003C/p\u003E\u003Cp\u003EI had landing gear, and they were even on straight. Plus, they were the Firespitter amphi-plane floats, so I could land on water, too.\u003C/p\u003E\u003Cp\u003EHad all of my science equipment.\u003C/p\u003E\u003Cp\u003EPlenty of batteries, and a good amount of solar panels, too.\u003C/p\u003E\u003Cp\u003ECould EVA, and had the EVA seat behind the cockpit, so a second Kerbal could sit there and get my in-flight EVA reports.\u003C/p\u003E\u003Cp\u003EHad an antenna wiggling in the breeze.\u003C/p\u003E\u003Cp\u003EPlenty of fuel (electric charge for my electric propeller) and plenty of wings.\u003C/p\u003E\u003Cp\u003EAnd I even remembered to put struts on it.\u003C/p\u003E\u003Cp\u003EWhat\u0027d I forget?\u003C/p\u003E\u003Cp\u003EThe bloody engines. Yep, you read it here first, folks. Mad, the spaceplane pilot, just forgot to install an engine on an airplane. I felt so stupid after remembering all of my usual \u0022what did I forget this time\u0022 checklist, got it out onto the runway and thought, \u0022Gee, why do I have a bare spot right behind the rudder? Oh, well, we\u0027ll just hit x, then space, then throttle up... Why am I not going anywhere. Got plenty of power. What the heck!? I\u0027m a bloody moron. Propellers, Mad, propellers. Plane don\u0027t fly without propulsion.\u0022\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2014-11-17T17:59:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rusty6899\u0022 data-cite=\u0022Rusty6899\u0022\u003E\u003Cdiv\u003EMy favourite mistake is having my ship oriented so that the solar panels are parallel to the direction of sunlight and going on a nice long time warp to drain the batteries. Mercifully it means that I will recover power in around 100 days. Still not ideal.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, except invariably I do this when I\u0027m lined up for landing, with Pe just below the surface. *Poof*\u003C/p\u003E\n"},{"CreatedByName":"OgreMagi","CreatedById":103767,"CreatedDateTime":"2014-11-17T18:58:30Z","Content":"\n\u003Cp\u003Eyea done a few myself, had a probe on a solar mission forgot to OPEN THE SOLAR PANELS and drained the batteries/mechJeb/probe on 100x time funny with no power you cannot open the solar panels......\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2014-11-17T19:48:12Z","Content":"\n\u003Cp\u003EStarted messing around with Kethane, and sent my first drill probe to the Mun. Due to a minor miscalculation, I failed to put enough solar panels on it.\u003C/p\u003E\u003Cp\u003EIt wasn\u0027t until I landed on the Mun and deployed the drill that I realized this... at which point it was too late. It couldn\u0027t build up enough electricity to let me retract the drill, but wasn\u0027t losing enough to retract it automatically... so now I\u0027ve got a rogue drill just releasing Kethane into the atmosphere. Had to terminate it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-11-17T21:28:13Z","Content":"\n\u003Cp\u003ERCS thrusters. I\u0027m actually pretty good at docking on rocket power alone, now, because I keep getting all the way to Laythe and finding that there are no RCS thrusters on my fancy new plane.\u003C/p\u003E\u003Cp\u003EAlso, solar panels. I forget them on the first launch of every single small ship I make, then wonder why the thing is dead five minutes after reaching orbit.\u003C/p\u003E\n"}]}