{"TopicId":91502,"ForumId":32,"TopicTitle":"What it\u0027s absulute minimum to run smothly KSP on Laptop","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-11-28T20:10:46Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-11-28T20:10:46Z","Content":"\n\u003Cp\u003EMy Laptop had Ubuntu Linux i know that there are linux version of KSP, i prefer my desktop but it\u0027s cpu cooling failed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy ASUS K50I Had only on 1 GM ram, it has 512 MB of NVIDIA CUDA GPU but i wonder does is enough to run KSP, i want some gamig (speaking honest i would want play Europa Universalis 4 (i love playing spian) i wonder does is Linux version of EU1,2,3;-), i bought some cool dlc at super cool discount price but it\u0027s not have linux version and i bet it would not run one 1 GB ram. \u003C/p\u003E\u003Cp\u003EAnyboy know how much cost RAM for ASUS?\u003C/p\u003E\u003Cp\u003EBut retuning to subject does my laptop i bought it mainly to typing during lectures could run KSP???\u003C/p\u003E\n"},{"CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2014-11-28T20:20:54Z","Content":"\n\u003Cp\u003EThat laptop is a little underpowered for KSP. The GPU memory is kind of low and your main killer is the 1GB of RAM. Although stock KSP will probably work OK, you will not be able to install many (or any) mods with the game with that little amount of memory.\u003C/p\u003E\u003Cp\u003ERAM varies in cost. No one can give you an exact price without knowing the type of RAM you will need. My guess, for a laptopm RAM usually cost about $30-40~ bucks or so. Maybe less depending on if that\u0027s an older laptop with smaller memory requirements. If you want the ultimate KSP experience, I think you should build a decent desktop. Gaming on laptops isn\u0027t that great.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2014-11-28T20:40:34Z","Content":"\n\u003Cp\u003Eif you do manage to get it going on your laptop, its performance will be pretty shoddy. If you\u0027re determined, tho, just turn down all the graphics settings, including light probes, etc, and you may be able to get some small ships into orbit.\u003C/p\u003E\u003Cp\u003EIf it were my computer, I\u0027d look to upgrade soon.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2014-11-28T20:42:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sedativechunk\u0022 data-cite=\u0022sedativechunk\u0022\u003E\u003Cdiv\u003EThat laptop is a little underpowered for KSP. The GPU memory is kind of low and your main killer is the 1GB of RAM. Although stock KSP will probably work OK, you will not be able to install many (or any) mods with the game with that little amount of memory.\u003Cp\u003ERAM varies in cost. No one can give you an exact price without knowing the type of RAM you will need. My guess, for a laptopm RAM usually cost about $30-40~ bucks or so. Maybe less depending on if that\u0027s an older laptop with smaller memory requirements. If you want the ultimate KSP experience, I think you should build a decent desktop. Gaming on laptops isn\u0027t that great.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know that on windows is possble thus i never tried to boost memory using Flash Drive I Wonder does is possible to make something simlar for UBUNTU i\u0027m newbie when it comes to Linux\u003C/p\u003E\n"},{"CreatedByName":"Miro Beero","CreatedById":67935,"CreatedDateTime":"2014-11-29T04:17:04Z","Content":"\n\u003Cp\u003EI run on a i5 2 ghz laptop machine with 4 gigs of ram.\u003C/p\u003E\u003Cp\u003ENo issues.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2014-11-29T04:41:36Z","Content":"\n\u003Cp\u003EI\u0027ve ran KSP on Acer 5755G (i7), and Acer 4755G (i5), both with similar video cards (nVidia GT540M) and similar memory (8 gig ram). The only problem with the 4755G was the fact that there was a lot of stuttering or moments with very low FPS, compared with the 5755G. According to a tech, it was because the video card in the 4755G was more prone to overheating compared to the 5755G. But overall, KSP worked well.\u003C/p\u003E\n"}]}