{"TopicId":91525,"ForumId":32,"TopicTitle":"Do you have any abandoned ships?","CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-11-29T01:02:27Z","PageNum":1,"Articles":[{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-11-29T01:02:27Z","Content":"\n\u003Cp\u003EThis was an old thread, and rather than necro I\u0027d rather just start a new thread.\u003C/p\u003E\u003Cp\u003EI really only have one notable example, back in .23, I think it was - The Laythe Expedition was my successful attempt to put 2 kerbals on Laythe and return them. It was long ago, and the only thing left of it is the Laythe Lander\u0027s upper stage - sittling in an elliptical orbit, alone above Laythe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mGvAtGy.jpg\u0022 alt=\u0022mGvAtGy.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spartwo","CreatedById":58131,"CreatedDateTime":"2014-11-29T01:10:29Z","Content":"\n\u003Cp\u003EThis one never rendezvoused with the return stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www./convkey/03b0/1t1b11ppl8f26vbfg.jpg\u0022 alt=\u00221t1b11ppl8f26vbfg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEve always ends in abandonment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www./convkey/d1b4/v270l0m32ehi9cefg.jpg\u0022 alt=\u0022v270l0m32ehi9cefg.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe crew of this one was rescued.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www./convkey/1705/9a8eft7qne5edj1fg.jpg\u0022 alt=\u00229a8eft7qne5edj1fg.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2014-11-29T01:18:32Z","Content":"\n\u003Cp\u003EI had one, back in v0.23.5, one Kerbal named \u0022Calgel\u0022, he wanted to look at sunspots ... likely dead as stone by now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ocfOBkEl.png\u0022 alt=\u0022ocfOBkEl.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2014-11-29T01:18:46Z","Content":"\n\u003Cp\u003ENot worth a screenshot, but in my .25 career save the first Duna lander is in a solar orbit. It had only just enough fuel to get somewhat close to Kerbin during the return trip, where I had a craft rendezvous with it and rescue the crew. The lander itself is still out there, and it never fails to creep me out that years later, that KER tape is still spinning.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-29T02:28:51Z","Content":"\n\u003Cp\u003EPlenty.\u003C/p\u003E\u003Cp\u003EMy .25 mucking around save includes a little probe rover on the Mun. Perfectly fine, but my AntennaRange options means it needs a relay to be controlled, and since the lander that dropped it returned home it hasn\u0027t had any such relay.\u003C/p\u003E\u003Cp\u003EIn that same save I also have a broken warp drive ship on a solar escape trajectory. More interestingly, there\u0027s a cloud of a couple of dozen bits of debris from that all on extremely elliptical orbits - periapses well within Moho\u0027s and apoapses about twice as far as Eeloo.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-11-29T04:58:56Z","Content":"\n\u003Cp\u003ELanded a probe on an asteroid once, then installed remote tech. Now it is stuck in a stable orbit around kerbit, but no way to control it. Will have to extend my coverage there and get a kerbal to force its antenna opened at one point. In the meanwhile, it is just flying around in high speed screaming at kerbin for a while before disappearing over the distance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-29T06:00:29Z\u0022 title=\u002211/29/2014 06:00  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 29, 2014\u003C/time\u003E by RainDreamer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-11-29T05:06:54Z","Content":"\n\u003Cp\u003EWell...\u003C/p\u003E\u003Cp\u003EI abandoned my first Mun lander.\u003C/p\u003E\u003Cp\u003EAnd my first Mun rescue mission.\u003C/p\u003E\u003Cp\u003EAnd my second Mun rescue mission.\u003C/p\u003E\u003Cp\u003EThe third time was the charm for \u0022not tipping over like an idiot\u0022.\u003C/p\u003E\u003Cp\u003EIn my current game, I made a couple one-way probes to the Mun and Minmus, which are still there. Some transfer stages are either in elliptical Kerbin orbits, or in at least one case, in a solar orbit. Had it been short of fuel, my Apollo-style LEM would\u0027ve been abandoned, but it had plenty of fuel left to crash itself into the Mun after delivering its science and Kerbal back to the CSM.\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2014-11-29T05:59:29Z","Content":"\n\u003Cp\u003EThese guys went to Laythe \u0026amp;... well I guess they liked it there, they\u0027ve been there over a year already.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/qeiriB\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm8.staticflickr.com/7572/15903078905_5cbcfc064b_c.jpg\u0022 alt=\u002215903078905_5cbcfc064b_c.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd this sad wreck is slowly sinking into the Mundust, it appears.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/qe8jPk\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm9.staticflickr.com/8680/15901105961_915ac589e0_c.jpg\u0022 alt=\u002215901105961_915ac589e0_c.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2014-11-29T06:25:49Z","Content":"\n\u003Cp\u003EI have a new abandoned ship - the Laythe Crew Module of the Infinity Laythe base (Project R). After the crew undocked it from the Infinity, it was left in a 100 by 106 km orbit - as a sort of emergency lifeboat, for crews who may get stuck in LKO. It has no parachutes, no remote probe core, no power source. It has just a bit of fuel and RCS left from orbit and docking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/znUipId.jpg\u0022 alt=\u0022znUipId.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sedativechunk","CreatedById":112761,"CreatedDateTime":"2014-11-29T09:18:33Z","Content":"\n\u003Cp\u003EOkay, so this ship pictured here is currently an \u0022abandoned ship\u0022 on Eve. It\u0027s actually my interstellar tugboat, a massive ship with expendable fuel tanks enough to provide up to 25,000 m/s of delta V with all the fuel tanks attached, 12 nuclear engines attached, and it also has TAC life support (enough to support three kerbals for 7,000 days in space), a cargo bay (so they have somewhere to hang out), and a spacious science lab. it takes me about 16 massive engines from the KW rocketry pack that produce 11,000 pounds of thrust each to get it into Kerbin\u0027s orbit.\u003C/p\u003E\u003Cp\u003EA botched mission on Eve stranded two of my kerbals on the planet with limited resources in a lander vessel. One brave kerbal decided to land the tugboat (actually named \u0022solarflare x-103\u0022) in a one-way trip on Eve so the stranded kerbals would have somewhere to survive and food to eat for the coming years. My kerbals are actually still living on it, I\u0027ve attempted to rescue them twice (including with a helicopter) but failed miserably. I guess the ship isn\u0027t abandoned perse, but it will never fly again despite having several tons of fuel and working engines left. It is pictured below on it\u0027s descent to Eve, only photo I have at the moment of it on Eve.\u003C/p\u003E\u003Cp\u003EAnother reason I bring this ship up... it\u0027s predecessor model the x-102 was slightly smaller and carried much less fuel. On a return trip from Moho, it ran out of fuel. I had to do an orbital rendevous around the sun (yes, it was extremely difficult/time consuming). This vessel is stuck in an orbit around Kerbol forever. This particular one is truly abandoned. Perfectly good ship inside with resources left, just no fuel or purpose to bring it back to kerbin. Other than that, I have abandoned ships and terrain vehicles on the Mun and Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s23.postimg.org/mjr3sy0y3/2014_11_14_00013.jpg\u0022 alt=\u00222014_11_14_00013.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BrotatoSalad","CreatedById":119211,"CreatedDateTime":"2014-11-29T16:44:16Z","Content":"\n\u003Cp\u003EA Duna lander which remains in low orbit for future kerbals to use instead of bringing another one to save fuel, and several crew rotation ships which never docked because it was a one-way trip for the ship, and I transferred the kerbals by floating over there with the jetpack.\u003C/p\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2014-11-30T00:07:20Z","Content":"\n\u003Cp\u003EI abandon my science trucks when they are done collecting the biomes.\u003C/p\u003E\u003Cp\u003ESo I have one on Minmus, and one on Mun.\u003C/p\u003E\u003Cp\u003ERest of the planets/moons do not have enough biomes (\u0027til 0.90) so that I did not need anymore than 2.\u003C/p\u003E\u003Cp\u003EIt\u0027s very rare that I leave unused spacecraft in the game for memory reasons... it adds up.\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2014-11-30T00:17:44Z","Content":"\n\u003Cp\u003EI have many abandoned ships from before I had reusable launchers and probe cores.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-11-30T00:33:52Z","Content":"\n\u003Cp\u003EI have a few abandoned spaceplanes thanks to FAR, when I find that no, they cannot slow down in the atmosphere and land at a sensible non-lethal speed I move the crew over to other craft that (I hope) can \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-11-30T03:57:30Z","Content":"\n\u003Cp\u003EI have a few spread around the Kerbin system:\u003C/p\u003E\u003Cp\u003EA lonely Lander around Ike.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FwztBO7.jpg\u0022 alt=\u0022FwztBO7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAbandoned Transfer Stage around Kopernicus (mod added planet)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wcJ5gxu.jpg\u0022 alt=\u0022wcJ5gxu.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA probe left on Eve (that apparently wants to float above the water...)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QVTEJxv.jpg\u0022 alt=\u0022QVTEJxv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese are only a few, I have some more probes and landers left around... They have actually been there considerably longer, just the MET\u0027s were reset by a mod at some point...\u003C/p\u003E\n"},{"CreatedByName":"AbortButton","CreatedById":106908,"CreatedDateTime":"2014-12-01T02:37:10Z","Content":"\n\u003Cp\u003EI have three landers all in Minmus\u0027s flats. I call it the boneyard.\u003C/p\u003E\n"},{"CreatedByName":"Steambirds","CreatedById":62753,"CreatedDateTime":"2014-12-01T03:00:05Z","Content":"\n\u003Cp\u003EMore than I would like to admit.\u003C/p\u003E\n"},{"CreatedByName":"kinnison","CreatedById":68083,"CreatedDateTime":"2014-12-01T03:10:08Z","Content":"\n\u003Cp\u003EMainly just spent boosters. Some fine print probes I left as abandoned \u0022debris\u0022\u003C/p\u003E\u003Cp\u003ESince I just started a new game for .25 I don\u0027t have anything that has gone interplanetary\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2014-12-01T03:18:09Z","Content":"\n\u003Cp\u003EI have a rather large and expensive white elephant station which will eventually slam into Minmus after its transfer engines stopped working en-route, or maybe it\u0027ll pick up a random assist somewhere and be flung off into the void.\u003C/p\u003E\u003Cp\u003EIt was on it\u0027s way to become an orbiting science base when the engines stopped working in transit, I mean, they\u0027re still there but I can\u0027t activate them, still on the staging list, still attached, plenty of fuel (fuel isn\u0027t locked) etc just... unresponsive? (the ship is otherwise fine).\u003C/p\u003E\u003Cp\u003EAt least it was unmanned, to bad the crew transfer vehicle was already on the way so they\u0027re going to have a pretty boring two week wait in Minmus orbit while a replacement is sent out.\u003C/p\u003E\n"},{"CreatedByName":"Ithicatic","CreatedById":100646,"CreatedDateTime":"2014-12-04T19:37:06Z","Content":"\n\u003Cp\u003EI\u0027ve got several mostly intact crashed ships, and one truly abandoned ship. Abandoning the KIPS v2 \u003Cem\u003EEndeavour\u003C/em\u003E was the only one I actually felt regret for abandoning. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/yuxHq\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-12-04T20:13:14Z","Content":"\n\u003Cp\u003EGot plenty of craft in low Kerbin orbit or around Mun/Minmus/etc that I just never bothered to de-orbit after completing contracts with them. They\u0027re there in case I need some emergency funds from the recovery awards.\u003C/p\u003E\u003Cp\u003EOr that\u0027s my excuse, anyway.\u003C/p\u003E\n"},{"CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2014-12-04T20:16:22Z","Content":"\n\u003Cp\u003ERemember, they\u0027re never abandoned, just \u0027temporarily decommissioned\u0027. You never know when an old lander or space station will come in handy.\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2014-12-06T06:38:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlyingPete\u0022 data-cite=\u0022FlyingPete\u0022\u003E\u003Cdiv\u003ERemember, they\u0027re never abandoned, just \u0027temporarily decommissioned\u0027. You never know when an old lander or space station will come in handy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI left my the lander I used for Duna in orbit and just brought the habitat module home. Also the craft I used for asteroid captures are sitting in parking orbits. In fact the first asteroid capture vehicle was the drive module for my Duna mission. If it\u0027s at all usable I hang on to it.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-12-06T07:19:21Z","Content":"\n\u003Cp\u003EI deliberately scuttled the U.K.S. \u003Cem\u003EAmbassador\u003C/em\u003E in a graveyard orbit at the end of her useful life (I play with Dang It installed, which lets parts wear out over time). Most of her small components were removed and taken back to Kerbin beforehand, but I left a bit of life support in case a future mission needs it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://oi62.tinypic.com/2cifndl.jpg\u0022 alt=\u00222cifndl.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-06T07:21:36Z\u0022 title=\u002212/06/2014 07:21  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 6, 2014\u003C/time\u003E by Mitchz95\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2014-12-06T08:04:39Z","Content":"\n\u003Cp\u003EI have a few. Mainly as there is no way to get them back easily. Mainly highly damaged rovers with one still working as intended on the MÃƒÂ¼n.\u003C/p\u003E\n"}]}