{"TopicId":91682,"ForumId":32,"TopicTitle":"Why does using mods make the game crash?","CreatedByName":"Unknow0059","CreatedById":127534,"CreatedDateTime":"2014-11-30T23:32:31Z","PageNum":1,"Articles":[{"CreatedByName":"Unknow0059","CreatedById":127534,"CreatedDateTime":"2014-11-30T23:32:31Z","Content":"\n\u003Cp\u003ENo, i\u0027m not having problems with my game. It\u0027s just something that came up in my mind, and i wanted to know why.\u003C/p\u003E\u003Cp\u003EOf course, some things simply don\u0027t have answers, i wish this isn\u0027t the case.\u003C/p\u003E\n"},{"CreatedByName":"mike9606","CreatedById":90275,"CreatedDateTime":"2014-12-01T00:15:11Z","Content":"\n\u003Cp\u003ESometimes certain mods conflict with each other, and other times the mods use up too much memory.\u003C/p\u003E\n"},{"CreatedByName":"Jim Kernan","CreatedById":84207,"CreatedDateTime":"2014-12-01T00:22:20Z","Content":"\n\u003Cp\u003EIn my experience it\u0027s mainly hitting the 32 bit memory limit. Mods are addictive and it always seems I can never have just one. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-12-01T00:33:25Z","Content":"\n\u003Cp\u003EEither botched mod installations, conflicting mods, or you ran into the 3.5 GB limit imposed by 32-bit KSP. The last can be ameliorated by using OpenGL or a texture management mod. 64-bit solves the memory issue completely (assuming your computer has enough RAM installed), but you either have to install Linux, or deal with the instability of the Windows version, and the number of mods which are disabled for Windows x64.\u003C/p\u003E\n"},{"CreatedByName":"kaboom1212","CreatedById":108158,"CreatedDateTime":"2014-12-01T04:20:38Z","Content":"\n\u003Cp\u003Eas other have already said.. it\u0027s mostly just running out of RAM. Whenever I check my crash logs it\u0027s always usually the case \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-12-01T05:08:15Z","Content":"\n\u003Cp\u003EMemory limit.\u003C/p\u003E\n"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2014-12-01T06:32:35Z","Content":"\n\u003Cp\u003EMemory limit made me stop playing my main career game 3 weeks ago or so.\u003C/p\u003E\u003Cp\u003EThen tried playing RSS and I can\u0027t crashes right away from out of memory\u003C/p\u003E\u003Cp\u003EO yeah... We need 64 bits asap (imho). Unless you play stock in which case no issues whatsoever.\u003C/p\u003E\n"},{"CreatedByName":"Higgs","CreatedById":121852,"CreatedDateTime":"2014-12-01T06:48:33Z","Content":"\n\u003Cp\u003E32 bit support memory limits stink, but unity is not very friendly \u0026lt;by and large, yes i know SOME seems to run 64 bit on windows just fine, i for one, am not one of those lucky folk\u0026gt; with 64 bit windows. Until Unity devs make a stable supported 64 bit unity engine, we are by and large \u0026lt;see prior sentence\u0026gt; stuck in 32 bit, which, has that fun 4 gig limit. i know, other stated it too, but, i wanted to chime in too lol\u003C/p\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2014-12-01T06:49:19Z","Content":"\n\u003Cp\u003EForcing DX11 or OpenGL helps a lot, but with some graphical issues ( minor, in DX11\u0027s case ). Ditching parts you don\u0027t use no matter where they come from also helps considerably...\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2014-12-01T07:04:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Francois424\u0022 data-cite=\u0022Francois424\u0022\u003E\u003Cdiv\u003EMemory limit made me stop playing my main career game 3 weeks ago or so.\u003Cp\u003EThen tried playing RSS and I can\u0027t crashes right away from out of memory\u003C/p\u003E\u003Cp\u003EO yeah... We need 64 bits asap (imho). Unless you play stock in which case no issues whatsoever.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s already 64 bit, just buggy.\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-12-01T07:22:09Z","Content":"\n\u003Cp\u003EConflicting mods don\u0027t cause crashes; mods themselves can cause crashes through their code, but even that is incredibly rare, since the things that cause crashes (unhandled exceptions) almost never happen because they are handled by the game engine rather than crashing out. It takes serious talent to break the game enough that it actually crashes rather than lagging or ending up with a bad state that requires a restart.\u003C/p\u003E\u003Cp\u003EMost common cause is hitting the memory limit in 32-bit KSP, or running into funky pointer (memory addressing) issues with 64-bit KSP.\u003C/p\u003E\n"},{"CreatedByName":"InterCity","CreatedById":98462,"CreatedDateTime":"2014-12-03T13:26:49Z","Content":"\n\u003Cp\u003EFrom my numerous crash logs (I love tinkering with my installation, modding it and I\u0027m on linux) I can say that the causes are the following:\u003C/p\u003E\u003Cp\u003E1) Out of memory - either the 32 bit limit or the hardware limit. Mods (especially those like B9, KW Rocketry , MKS...) tend to shred through the available memory.\u003C/p\u003E\u003Cp\u003E2) Mod conflicts - Sometimes, the mods use the same thing in the same time, which is not allowed. We have ModuleManager for this, luckily.\u003C/p\u003E\u003Cp\u003E3) Sloppy programming - This is the reason the game crashes 50 times before I successfully mod it myself and the reason why I haven\u0027t published any mods so far (My warp drive has probably more bugs than an ant hill combined with windows vista \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ) \u003C/p\u003E\u003Cp\u003EThe solutions?\u003C/p\u003E\u003Cp\u003E1) Less mods/texture manager/Delete parts what you don\u0027t need. By reducing the number of features, you also reduce the memory needed.\u003C/p\u003E\u003Cp\u003E2) ModuleManager. Solves 99% of mod conflict problems.\u003C/p\u003E\u003Cp\u003E3) RTFM. Or go to \u003Ca href=\u0022http://stackoverflow.net\u0022 rel=\u0022external nofollow\u0022\u003Estackoverflow.net\u003C/a\u003E. Or wiki. That usually helps if the mod is yours. Google is your friend as well. If it\u0027s not yours... contact the modder and pray to the entity above that the modder is reasonable (most of them are, so there\u0027s no need to pray too hard).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-03T13:30:13Z\u0022 title=\u002212/03/2014 01:30  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 3, 2014\u003C/time\u003E by InterCity\u003C/strong\u003E\n\u003C/span\u003E\n"}]}