{"TopicId":92027,"ForumId":32,"TopicTitle":"0.90.0 is coming! Shall I...","CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2014-12-05T18:30:45Z","PageNum":1,"Articles":[{"CreatedByName":"justidutch","CreatedById":99185,"CreatedDateTime":"2014-12-05T18:30:45Z","Content":"\n\u003Cp\u003ESince it sounds like the game is changing a significant amount, I am tempted to ditch my current career and wait it out until the 0.90.0 release. Is this a good idea?\u003C/p\u003E\u003Cp\u003EDon\u0027t get me wrong, I\u0027m not gonna stop playing altogether, I\u0027ll probably just do crazy things in sandbox mode to pass the time.\u003C/p\u003E\n"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2014-12-05T18:33:37Z","Content":"\n\u003Cp\u003EIt depends, 0.90.0 is probably not going to be here for at least a week, probably closer to 2 weeks. So if you want to spend 1-2 weeks playing sandbox, I guess you could, or you could finish out your career save.\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2014-12-05T18:54:56Z","Content":"\n\u003Cp\u003EI don\u0027t play career, only sandbox. I probably wont upgrade as well since it dosent add much to SANDBOX (it does to career, don\u0027t yell at me) Ill see what comes in the next update.\u003C/p\u003E\n"},{"CreatedByName":"NFUN","CreatedById":78715,"CreatedDateTime":"2014-12-05T19:02:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022montyben101\u0022 data-cite=\u0022montyben101\u0022\u003E\u003Cdiv\u003EI don\u0027t play career, only sandbox. I probably wont upgrade as well since it dosent add much to SANDBOX (it does to career, don\u0027t yell at me) Ill see what comes in the next update.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEditor enhancements are as applicable to sandbox as to career, if not more so. Maybe the stability will also be upgraded, allowing for even more Whackjovian glory!\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-12-05T19:06:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022montyben101\u0022 data-cite=\u0022montyben101\u0022\u003E\u003Cdiv\u003EI don\u0027t play career, only sandbox. I probably wont upgrade as well since it dosent add much to SANDBOX (it does to career, don\u0027t yell at me) Ill see what comes in the next update.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*COUGH* MKIII Parts *COUGH*\u003C/p\u003E\u003Cp\u003EI haven\u0027t played Career mode in a while. The one save I had was corrupted, and now Sandbox is where I do everything.\u003C/p\u003E\u003Cp\u003ESo join the HYPETRAIN!\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-12-05T19:11:58Z","Content":"\n\u003Cp\u003EI actually don\u0027t know.\u003C/p\u003E\u003Cp\u003EMy current install is excessively modded and personally customized. I would want to keep all of those mods around, so I just might keep playing .25 for a while.\u003C/p\u003E\u003Cp\u003EOn the other hand, I am just a few play sessions away from being ready to go interplanetary. And well, all the interplanetary destinations are getting biomes in .90! It would be great if I could upgrade before heading out there.\u003C/p\u003E\u003Cp\u003ESo yeah, I\u0027ll have to see how it goes. How fast I progress, how fast mods update, how curious I happen to feel. I\u0027ll know it when I make the decision.\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-12-05T19:15:46Z","Content":"\n\u003Cp\u003EI tend to find that as the excitement builds for an upcoming patch, I find myself playing more KSP, not less. If I didn\u0027t already have a Career Mode save in progress, I\u0027d be starting one now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-12-05T19:18:55Z","Content":"\n\u003Cp\u003EI didn\u0027t even really get a chance to start in 0.25, so...\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2014-12-05T21:20:55Z","Content":"\n\u003Cp\u003EI find myself holding strong on the idea that I will finish out a save by completing all missions, current and planned, before moving on... Right up until the option to dump it and upgrade is in front of me. The closer the new content comes, the more shortcuts I take, and the more I go \u0022eh, I don\u0027t REALLY need to do a Jool-5 mission\u0022, and the less I find myself satisfied with the gameplay. For me, then, it\u0027s better to just wrap it up and get ready for the new features.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-12-05T22:33:11Z","Content":"\n\u003Cp\u003ECareer became kinda broken for me in .24, as the contracts are just pointless and make no sense. I have already long abandoned my save. However I will defiantly be starting a new one when .90 and its \u0027Fine Print\u0022 thing comes out.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2014-12-05T22:38:56Z","Content":"\n\u003Cp\u003EWait, 0.90 will break career saves? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-12-05T23:00:02Z","Content":"\n\u003Cp\u003EIf possible, I will be transferring my current Career mode game into a new, shiny 0.90, one. That way, I won\u0027t lose my flags, spacecraft, etc., and I get to try out all the 0.90 deliciousness! \u003Cspan style=\u0022font-size:8px;\u0022\u003ELet\u0027s just pray nothing breaks...\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"DrD","CreatedById":103953,"CreatedDateTime":"2014-12-05T23:08:32Z","Content":"\n\u003Cp\u003EMay I ask, how do you define \u0022finish?\u0022\u003C/p\u003E\u003Cp\u003EI\u0027m in a career game that I\u0027m enjoying quite a lot but I\u0027m not sure when I should consider it finished. \u003C/p\u003E\u003Cp\u003EI\u0027ll be very tempted to start over in 0.90 but like others I\u0027ll have to wait until my must-have mods are compatible.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-12-05T23:18:25Z","Content":"\n\u003Cp\u003E\u0022Finished\u0022 for Career mode would pretty much be having the tech tree unlocked, at least in terms of progression. From a more considerate angle, it would be getting all of your various Kerbals back to Kerbin. May as well do both if you can.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-12-05T23:39:42Z","Content":"\n\u003Cp\u003E\u003Cem\u003EFine Print\u003C/em\u003E is going to make the biggest impact; the folks who aren\u0027t already using it are in for a pleasant surprise.\u003C/p\u003E\n"},{"CreatedByName":"Phoenix84","CreatedById":26027,"CreatedDateTime":"2014-12-05T23:41:37Z","Content":"\n\u003Cp\u003EI vote for (E)...\u003C/p\u003E\u003Cp\u003ERun both versions simultaneously while I wait for mods to update.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2014-12-05T23:49:05Z","Content":"\n\u003Cp\u003EI vote for bring all your Kerbals back home and just use robotic exploration\u003C/p\u003E\n"},{"CreatedByName":"MGCJerry","CreatedById":95202,"CreatedDateTime":"2014-12-06T01:08:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Phoenix84\u0022 data-cite=\u0022Phoenix84\u0022\u003E\u003Cdiv\u003EI vote for (E)...\u003Cp\u003ERun both versions simultaneously while I wait for mods to update.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with this. Just because new comes out, doesn\u0027t mean you have to replace what you got now.\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-12-06T01:11:32Z","Content":"\n\u003Cp\u003EMy .22 save has several dozen kerbs stranded. Have tried to complete a full rescue of all of them but game instability steps in on a regular basis to screw things up. I\u0027ve converted the save to .25 successfully but am hesitant to attempt closure untill I am confident I can complete it without crashing. So... They shall remain adrift...\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-12-06T01:12:12Z","Content":"\n\u003Cp\u003EI voted the later option, though I may be a bit biased.\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-12-06T01:16:14Z","Content":"\n\u003Cp\u003EYes, there is an option missing. Test new version, then attempt Kerbal returns to KSC.\u003C/p\u003E\n"},{"CreatedByName":"DrD","CreatedById":103953,"CreatedDateTime":"2014-12-06T01:48:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003E\u0022Finished\u0022 for Career mode would pretty much be having the tech tree unlocked, at least in terms of progression. From a more considerate angle, it would be getting all of your various Kerbals back to Kerbin. May as well do both if you can.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell with the OP admin building I unlocked all tech quite early. I\u0027ve landed on all biomes on Mun and Minimus. I\u0027ve not seen all the anamolies on Kerbin but have on the Mun. Some Kerbals are in space yet on a space station. Others are on their way to Duna to orbit (no lander.)\u003C/p\u003E\u003Cp\u003EI think I\u0027d like to land on Duna as I\u0027ve never been interplanetary before. At that point I think I\u0027ll be done (after they get back from Duna of course.)\u003C/p\u003E\u003Cp\u003EI do hope they make the career more progressive, I feel like I\u0027m playing in sandbox except every now and then I have to send science from one of my mun or minimus satellites or plant yet another flag to get money.\u003C/p\u003E\u003Cp\u003EAnd now the obligatory I will still love the game even if they don\u0027t change it at all.\u003C/p\u003E\n"},{"CreatedByName":"Troubletcat","CreatedById":130757,"CreatedDateTime":"2014-12-06T03:09:00Z","Content":"\n\u003Cp\u003EI\u0027ll just keep playing my current career for now since, what am I going to do, NOT play KSP? And sandbox mode simply doesn\u0027t interest me anymore now that career mode exists.\u003C/p\u003E\u003Cp\u003EBut I\u0027m not going to try and \u0022finish\u0022 it or anything like that. I will try and bring all my Kerbals home before I switch to 0.90 and make a new save though. I\u0027d feel bad leaving them to starve.\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2014-12-06T04:52:23Z","Content":"\n\u003Cp\u003EWell. I\u0027ll try and finish up my Duna and Eve runs. Hopefully I\u0027ll finish before then. If not. Oh well. Time to bash new features and get my orange suits back.\u003C/p\u003E\n"},{"CreatedByName":"Victus","CreatedById":104706,"CreatedDateTime":"2014-12-06T13:41:07Z","Content":"\n\u003Cp\u003EWill this update finally do something for performance? I can\u0027t play this game at 5fps on an i5 4670k anymore.\u003C/p\u003E\n"}]}