{"TopicId":9224,"ForumId":32,"TopicTitle":"KSP needs a way to turn off radial mount snap-to when building crafts","CreatedByName":"frankgg","CreatedById":20071,"CreatedDateTime":"2012-04-06T11:13:41Z","PageNum":1,"Articles":[{"CreatedByName":"frankgg","CreatedById":20071,"CreatedDateTime":"2012-04-06T11:13:41Z","Content":"\n\u003Cp\u003EThe one thing that drives me nuts when trying to build spacecraft in this game is when I\\\u0027m trying to build a stack of fuel tanks and that stack is close to another stack (say off a tri-coupler) then KSP always wants to snap my next fuel tank to the tank to the side of it (radial mounting) instead of under the tank above it like I want to do 99.9% of the time... I then have to keep turning my view and hunt for the 1 pixel area that will allow me to snap that fuel tank to the one directly above it.\u003C/p\u003E\u003Cp\u003ECould the developers please include a way to momentarily disable radial mounts snap-to\\\u0027s so it is easier to snap a fuel tank (or whatever) to the part directly above or below it?\u003C/p\u003E\u003Cp\u003EIt could be as simple as making a modifier key like holding down the tab or shift key disables radial mounting snap-to\\\u0027s, or if you want to get all fancy you could add a button (like the symmetry button) that you could toggle to get the effect.\u003C/p\u003E\u003Cp\u003EThank you for reading my ramblings.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2012-04-06T13:48:53Z","Content":"\n\u003Cp\u003EI\\\u0027ve had this problem before too.. \u003C/p\u003E\u003Cp\u003EOne thing that I think may help is if you could assemble part of the rocket stack to the side and then attach it to the rocket\u003C/p\u003E\n"},{"CreatedByName":"E. F. Kranz","CreatedById":12617,"CreatedDateTime":"2012-04-06T15:46:04Z","Content":"\n\u003Cp\u003EBut... that\\\u0027d take all the fun out of it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bluejayek","CreatedById":18471,"CreatedDateTime":"2012-04-06T17:27:27Z","Content":"\n\u003Cp\u003EDefinitely.... One thing that I think would also be nice is a way to select a specific snap point on a fuel tank or such that you are attaching. Then, while selected, it would only snap to corresponding snap to points nearby. This should also make it much easier to build fuel tank stacks, as you could drag that blue point directly over the other, rather then trying to get it right draging the center of the tank. \u003C/p\u003E\n"}]}