{"TopicId":92638,"ForumId":32,"TopicTitle":"Asteroid Designation System","CreatedByName":"LongbowEOD","CreatedById":22817,"CreatedDateTime":"2014-12-12T17:33:49Z","PageNum":1,"Articles":[{"CreatedByName":"LongbowEOD","CreatedById":22817,"CreatedDateTime":"2014-12-12T17:33:49Z","Content":"\n\u003Cp\u003EI came up with this system so I could tell, at a glance, the class and impactor status of my tracked asteroids. Any asteroids that enter Kerbin\u0027s SOI get a prefix to their systematic designation (like IMU-344 or whatever). The prefix includes the class, and what I call the Kerbin Trajectory Qualifier (KTQ), which is either X for impact, V for flyby and escape, or O for stable orbit. The KTQ can change if I send an ARM out and change the asteroid\u0027s orbit.\u003C/p\u003E\u003Cp\u003ESo, for example, in my current career game I tracked an asteroid, IMU-344. Class E, and on an impact trajectory with Kerbin! So I renamed it in the tracking station to EX-IMU-344. I sent a redirect mission to it, nudged it out of the path of Kerbin, and renamed it (again) to EV-IMU-344. The plan is to capture it in Kerbin orbit and rename it (you guessed it) to EO-IMU-344 (or whatever pet name I come up with for a third mun).\u003C/p\u003E\u003Cp\u003EAnybody else do anything similar/different?\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-12-12T17:49:39Z","Content":"\n\u003Cp\u003EI renamed my tracked asteroids somewhat along the lines of real ones. A number in order, followed by the name of a notable Kerbal. So the first one was 1 Jebediah.\u003C/p\u003E\u003Cp\u003EI might use a different pool of names next time though, but will stick with the same general scheme. It just feels nicer to visit a named object rather than an anonymous rock.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-12-12T17:50:10Z","Content":"\n\u003Cp\u003EI would just love it if the game added a \u0022-[X]\u0022 suffix or \u0022[X]-\u0022 prefix, where [X] was the asteroid class.\u003C/p\u003E\n"}]}