{"TopicId":92914,"ForumId":32,"TopicTitle":"KSP 0.90 \u0027Beta Than Ever\u0027 Grand Discussion Thread!","CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-12-15T13:22:29Z","PageNum":32,"Articles":[{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2015-03-30T01:23:52Z","Content":"\n\u003Cp\u003EOn hard difficulty, getting the funding for upgrading even just the R\u0026amp;D can be a very arduous task. I finally had to use custom settings so I could have the harder difficulty options without the gigantic increase in building upgrade costs. I soon discovered that the only real increase to difficulty is in fact the upgrade costs. I hope they can incorporate something a little less artificial by the time 1.0 releases.\u003C/p\u003E\n"},{"CreatedByName":"Tanner Rawlings","CreatedById":58414,"CreatedDateTime":"2015-03-30T02:16:07Z","Content":"\n\u003Cp\u003EThe timing couldn\u0027t have been more perfect, I\u0027m just about to finish putting together my new gaming computer and so I\u0027ll be able to enjoy crashing into the mÃƒÂ¼n\u003C/p\u003E\n"},{"CreatedByName":"SalehRam","CreatedById":138066,"CreatedDateTime":"2015-03-30T09:00:31Z","Content":"\n\u003Cp\u003EBasically, and after a while playing with the 0.90 career, I find the buildings upgrades a bit frustrating experience to work with...\u003C/p\u003E\u003Cp\u003EEven with grinding contracts I find a stopping \u0022frustrating\u0022 point where I cannot do anything because, if I need to do x thing, I have to have y tech, and to have y tech, I have to upgrade z building, and to upgrade z building, I have to have $$$ amount of money... and to have $$$ I have to do that contract and so on the loop kills my brain...\u003C/p\u003E\u003Cp\u003ESo, what I did lately, I just started the new career, and pressed Alt\u002BF12 and just cheated with the only enough amount of money to upgrade all the buildings, then started the career normally as I do...\u003C/p\u003E\u003Cp\u003EWithout doing that, I will get bored, in a feeling of I\u0027m wasting time grinding stuff in a useless way to \u0022JUST\u0022 be able to actually start playing normally...\u003C/p\u003E\u003Cp\u003EThat\u0027s how I find it anyway, so I might be wrong, I might be exaggerating or I might be right where other people share the same with me...\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-03-30T12:14:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SalehRam\u0022 data-cite=\u0022SalehRam\u0022\u003E\u003Cdiv\u003ESo, what I did lately, I just started the new career, and pressed Alt\u002BF12 and just cheated with the only enough amount of money to upgrade all the buildings, then started the career normally as I do...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHave you tried instead customizing the \u0022difficulty\u0022 (what I call \u0022grind\u0022) settings to better match your preference? When doing tests in career mode, I just crank all the good stuff to the max and all the bad stuff to the min and can unlock pretty much everything I want before launching a single vessel. And if not, Just set up a few strategies to get tons of what I want (science-\u0026gt;money gets you a lot of cash when your science returns are set to the max setting).\u003C/p\u003E\u003Cp\u003EI\u0027m not suggesting you put everything to the max, but tweaking them to your exact liking could let you avoid the alt-f12 menu.\u003C/p\u003E\n"},{"CreatedByName":"Corw","CreatedById":7116,"CreatedDateTime":"2015-03-30T12:34:45Z","Content":"\n\u003Cp\u003ECouldn\u0027t he just go for science career and ignore money?\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-03-30T13:33:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Corw\u0022 data-cite=\u0022Corw\u0022\u003E\u003Cdiv\u003ECouldn\u0027t he just go for science career and ignore money?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI assume he wants to have to pay hundreds of thousands of dollars for ships, but not pay several millions for building upgrades. It\u0027s not that strange an idea, actually.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2015-03-30T14:06:00Z","Content":"\n\u003Cp\u003EI use the science funding mod so I get money for science returned. I\u0027m not forced to do contracts that way and it greatly helps with overcoming the \u0022grind\u0022 of contracts just to get money for upgrades. One trip to the mun can get net close to a million funds if not more depending on how much science you gather (I just do one or two biomes at a time.)\u003C/p\u003E\n"},{"CreatedByName":"Mr. Scruffy","CreatedById":38540,"CreatedDateTime":"2015-03-30T14:50:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gronank\u0022 data-cite=\u0022gronank\u0022\u003E\u003Cdiv\u003EI\u0027ve had some fairly exciting times with 0.90. I started a new career as I always do when a new patch is out. The upgradeable buildings really contributes in making a game out of KSP. I really enjoyed making difficult decisions on mission parameters to stay within restrictions. Until reaching tier 2. Tier 1 is really about scraping by, once you reach T2 you got everything you need and more and the pressure and excitement is gone.\u003Cp\u003EKSP has always had a bit of a problem with the end game for me, but I see no reason for the building upgrading to become irrelevant so quickly. I basically think there should more building upgrades, like 15 instead of 3 tiers for launch pad and assembly buildings, so that you get more granularity than really tight/more than enough/literally more than any computer can handle.\u003C/p\u003E\u003Cp\u003EAn example: I was building a rocket in the T1 assembly building, and my part count went up to 32. Over the limit, fair enough. I had to remove something. But to upgrade the building, I needed hundreds of thousands credits and when I did, I got 255 as the new max limit. Right then and there I needed the limit raised by like 5 parts, not 225.\u003C/p\u003E\u003Cp\u003EIt is not a request for more grind either but for more rewarding grind, instead of the long term goal of grinding millions to get that thing you\u0027re never going to think about again once you get it, you get short term goal of just getting enough capacity to barely do what you\u0027re trying to do for the moment and the next ting is probably going to require further investment.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree - alot.\u003C/p\u003E\n"},{"CreatedByName":"SalehRam","CreatedById":138066,"CreatedDateTime":"2015-03-30T17:28:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EHave you tried instead customizing the \u0022difficulty\u0022 (what I call \u0022grind\u0022) settings to better match your preference? When doing tests in career mode, I just crank all the good stuff to the max and all the bad stuff to the min and can unlock pretty much everything I want before launching a single vessel. And if not, Just set up a few strategies to get tons of what I want (science-\u0026gt;money gets you a lot of cash when your science returns are set to the max setting).\u003Cp\u003EI\u0027m not suggesting you put everything to the max, but tweaking them to your exact liking could let you avoid the alt-f12 menu.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ECouldn\u0027t he just go for science career and ignore money?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I tried customizing the settings to a point where it is good at the beginning, but during mid/end tech tree, it just becomes a sandbox (which it will be anyway), but however, I still want to worry about funding source for missions, and I still want to keep doing science experiments around for a while before they become useless (due to tech tree is done), for me I found out that keeping settings on default and using the science and funding strategies, then insta-upgrade the buildings make me just relaxed to do whatever I want in career mode... this is at least is good for me now for the play style I am intending to do, later I might just start all over again from scratch without tweaking or cheating or anything.\u003C/p\u003E\u003Cp\u003EI thought about science mode, but then, no contracts or strategies there... while I want to have them in the play style I have, I found the above best for me...\u003C/p\u003E\n"},{"CreatedByName":"Snikersnee","CreatedById":145105,"CreatedDateTime":"2015-07-02T15:41:57Z","Content":"\n\u003Cp\u003EQuick question, how would they repair landing legs? Can they break but still be intact somehow?\u003C/p\u003E\n"},{"CreatedByName":"Ival70","CreatedById":75336,"CreatedDateTime":"2015-07-02T15:51:23Z","Content":"\n\u003Cp\u003EUnlike most parts in KSP, which have 2 states of damage (not-broken and completely obliterated) landing legs have 3 states (not-broken, damaged, and completely obliterated). you can repair landing legs (as well as rover wheels) when they are in the damaged state.\u003C/p\u003E\u003Cp\u003ENow, to keep this thread from going off topic and being closed; I like that .90 is still available for download from the KSP website. It gives new players a chance to try out KSP pre-1.0. I still occasionally boot it up and fly my old outdated crafts.\u003C/p\u003E\n"}]}