{"TopicId":93280,"ForumId":32,"TopicTitle":"Career pilot assist wackiness","CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-12-17T03:34:28Z","PageNum":1,"Articles":[{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-12-17T03:34:28Z","Content":"\n\u003Cp\u003EFirst of all, forgive me if this has already been discussed. I know there will be a lot of threads about various things, but I couldn\u0027t see any about this.\u003C/p\u003E\u003Cp\u003EThe new assist abilities given to pilots seem to behave strangely. I expected them to work identical or similar to MechJeb in the sense that it calculates the halfway point between the current orientation and the desired orientation and applies torque in the opposite direction at that halfway point, resulting in smooth and precise movement (depending on ship stability).\u003C/p\u003E\u003Cp\u003EHowever, the pilot assist seems to just apply torque in the direction of the desired node and upon reaching that node applies the opposite direction, making the ship sway back and forth, though usually only once.\u003C/p\u003E\u003Cp\u003EIs this intentional? Is the precision of the assist based on the pilot\u0027s experience? Or are Squad\u0027s methods just not as good as r4m0n\u0027s?\u003C/p\u003E\u003Cp\u003EAs a side note; often the vector holds are very unstable and just shake erratically.\u003C/p\u003E\u003Cp\u003EThis is all using the Mk1 pod.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T06:50:51Z\u0022 title=\u002212/17/2014 06:50  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by Bobe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-12-17T03:58:29Z","Content":"\n\u003Cp\u003EI haven\u0027t left the atmosphere yet since the update, so I haven\u0027t tried. But based on what you\u0027re describing, I\u0027m guessing they just didn\u0027t code that as elegantly. It probably just torques over toward that vector most of the way, though they could have a \u0022dead zone\u0022 right near the target vector. Now I\u0027m curious and might have to play with it.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-12-17T08:35:57Z","Content":"\n\u003Cp\u003EDoes it get better with higher level pilots?\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-12-17T10:32:50Z","Content":"\n\u003Cp\u003EThe pilot assist is bugged. With the exceptions of \u0022stability assist\u0022, using the pilot to hold a heading results in a continual power drain and if you have RCS on then mono-prop is constantly pumped out of all ports. It\u0027s just like how mechjeb used to be ages ago. It\u0027s not a pilot skill thing, same is true in sandbox with 5 start pilots. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/DX3AOil\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/DX3AOill.jpg\u0022 alt=\u0022DX3AOill.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(test craft in sandbox)\u003C/p\u003E\u003Cp\u003EIt\u0027s odd that stability assist mode (default) doesn\u0027t bleed resources while all the others do.\u003C/p\u003E\u003Cp\u003EAnyway, there\u0027s a thread in support about this now - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/103461-Power-and-RCS-are-drained-very-fast-when-using-Pilot-controls\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/103461-Power-and-RCS-are-drained-very-fast-when-using-Pilot-controls\u003C/a\u003E and \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI\u0027m just about to go write up a bug report\u003C/span\u003E here\u0027s the \u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/3861\u0022 rel=\u0022external nofollow\u0022\u003Ebug report\u003C/a\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T10:56:33Z\u0022 title=\u002212/17/2014 10:56  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by katateochi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"electronicfox","CreatedById":43373,"CreatedDateTime":"2014-12-17T11:01:45Z","Content":"\n\u003Cp\u003EI\u0027ve also noticed this issue, although my main annoyance is how smaller crafts seem to vibrate when I wanna hold a heading. Its like it just keeps swaying slightly around the target heading and tries to correct itself really fast.\u003C/p\u003E\n"},{"CreatedByName":"Xaver","CreatedById":46640,"CreatedDateTime":"2014-12-17T11:02:05Z","Content":"\n\u003Cp\u003EIf you want you can call it a bug. But i am sure thats the law of controll system Engineering. Like when you have cruise control in your car. You will need an well-fitting equation to get those things stable.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-17T11:44:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bobe\u0022 data-cite=\u0022Bobe\u0022\u003E\u003Cdiv\u003EIs this intentional? Is the precision of the assist based on the pilot\u0027s experience? Or are Squad\u0027s methods just not as good as r4m0n\u0027s?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe it is intentional. Squad has always put the emphasis on manual control by the player, I think the PID for SAS is deliberately a bit sloppy to encourage the player to do the maneuvers themselves. Stock SAS is good for \u003Cem\u003Estaying\u003C/em\u003E pointed, less so for \u003Cem\u003Egetting\u003C/em\u003E pointed.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-12-17T14:47:38Z","Content":"\n\u003Cp\u003ESo, ordering the pilot to point somewhere and than issuing a hold order works as before - without wasting resources I mean?\u003C/p\u003E\n"}]}