{"TopicId":93974,"ForumId":32,"TopicTitle":"Naming Policy, The Art of Naming your Rockets.","CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2014-12-21T10:48:27Z","PageNum":1,"Articles":[{"CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2014-12-21T10:48:27Z","Content":"\n\u003Cp\u003EHello fellow Kerbalnauts!\u003C/p\u003E\u003Cp\u003EAfter some time I have come the conclusion that a naming system must be made for everything I have created in KSP. It derives from a simple \u0027family-tree\u0027 system I noticed somewhere else while exploring the internet, a long story short I have made a few modifications to it and come up with my own solution.\u003C/p\u003E\u003Cp\u003EInstructions of use:\u003C/p\u003E\u003Cp\u003EWe start out at what \u0027Genre\u0027(1#) of video-game we have in mind.\u003C/p\u003E\u003Cp\u003EAfter we have made our choice we determine a number of generic topics found in common amongst all the sub-genre\u0027s.(2#)\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EFrom this selection we already have quite a few options to name our rockets from.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i357.photobucket.com/albums/oo19/TimePeriod/Naming_zpsed5322e3.png\u0022 alt=\u0022Naming_zpsed5322e3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo further explain how this is used to its fullest, we can derive an even larger amount of names found within each individual sub-genre. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i357.photobucket.com/albums/oo19/TimePeriod/Namingoption1_zpsc19e542a.png\u0022 alt=\u0022Namingoption1_zpsc19e542a.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn grand total, we can find a humongous amount of names within each sub-genre.\u003C/p\u003E\u003Cp\u003ESo don\u0027t come around and say \u0022I can\u0027t figure out what to call my rocket\u0022\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2014-12-21T10:51:54Z","Content":"\n\u003Cp\u003ESomething cool, like pioneer or trailblazer.\u003C/p\u003E\u003Cp\u003EI often say for my landers \u003Cem\u003Evaguely latin/russian sounding name of planet\u003C/em\u003E - glob.\u003C/p\u003E\u003Cp\u003EFor my orbiters, I\u0027ll have latiny sounding name \u002B grunt.\u003C/p\u003E\u003Cp\u003EI\u0027m big into russian names.\u003C/p\u003E\n"},{"CreatedByName":"Moss","CreatedById":106413,"CreatedDateTime":"2014-12-21T11:13:08Z","Content":"\n\u003Cp\u003ECan\u0027t go wrong with Slavic mythology for various names of deities and the like.\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-12-21T12:14:34Z","Content":"\n\u003Cp\u003EMy smaller craft are named after atomic and subatomic particles: \u0022Photon 1\u0022 or \u0022Neutrino 1\u0022, and my interplanetary ships are named after stars (there is currently only one: Andromeda). My bases and stations are named after roman-kerbal God sounding names: Centaurus, Sion.\u003C/p\u003E\n"},{"CreatedByName":"Mr_Brain","CreatedById":33487,"CreatedDateTime":"2014-12-21T12:35:45Z","Content":"\n\u003Cp\u003EI am not sure how the OP\u0027s instructions are going to help with naming rockets. Are you suggesting to name rockets after, in your example, a melee weapon from another video game?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-12-21T13:46:02Z","Content":"\n\u003Cp\u003EI prefer more whimsical names, like those used for boats, \u003Ca href=\u0022http://10000boatnames.com/index.php?option=com_displayltr\u0026amp;task=res\u0026amp;letter=K\u0026amp;Itemid=20\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003Ehere\u0027s a list of boats starting with the letter K\u003C/strong\u003E\u003C/a\u003E for Kerbal \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"EladDv","CreatedById":118368,"CreatedDateTime":"2014-12-21T14:29:05Z","Content":"\n\u003Cp\u003Elol i just name my planes as E (S(STO)/(nothing-regular) /B(bomber)-(serial number) and other like First Erbit and baby steps or stuff like Kopernicus and Kepler for some ships\u003C/p\u003E\n"},{"CreatedByName":"TheBrisbyMouse","CreatedById":80175,"CreatedDateTime":"2014-12-21T14:37:34Z","Content":"\n\u003Cp\u003EWhenever I can\u0027t think of a name, I just grab my handy little(not at all little!) Webster\u0027s Dictionary, flip to a random page, and find the best sounding word on it.\u003C/p\u003E\u003Cp\u003EI also have a craft named Ultramicroscopicsilicovolcanoconiosis. Just for the lulz.\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2014-12-21T14:40:42Z","Content":"\n\u003Cp\u003EShip name: \u003Cem\u003E(whatever it is)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E...I never get confused as to what it is. I sometimes name ships after they\u0027ve gotten into orbit, or name projects (e.g, my duna mothership in one save was the Red Lumal, Lumal being a kerbal whom I think discovered was BadS, after a rocket crash. I had one called the Green Halnie, but the launch failed, and Halnie died. In his honour, I decided to get creative with the next ship name. \u0022Green Halnie II\u0022)\u003C/p\u003E\u003Cp\u003EOther than that, I don\u0027t really name things in the VAB. Generally\u003Cem\u003E \u0022solar module\u0022\u003C/em\u003E or\u003Cem\u003E \u0022green halnie satellite\u0022\u003C/em\u003E works fine for me. Sometimes I get creative. The first spacestation in every save I do is called Endurance.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-12-21T14:41:57Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.randomlists.com/random-words\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003ERandom word generator.\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHmmm...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E equal\u003Cp\u003E cobweb\u003C/p\u003E\u003Cp\u003E absent\u003C/p\u003E\u003Cp\u003E secretary\u003C/p\u003E\u003Cp\u003E like\u003C/p\u003E\u003Cp\u003E arrogant\u003C/p\u003E\u003Cp\u003E rinse\u003C/p\u003E\u003Cp\u003E greasy\u003C/p\u003E\u003Cp\u003E gray\u003C/p\u003E\u003Cp\u003E wrestle\u003C/p\u003E\u003Cp\u003E cultured\u003C/p\u003E\u003Cp\u003E zealous\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmmm...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/8TZgFx5.jpg\u0022 alt=\u00228TZgFx5.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2014-12-21T14:52:38Z","Content":"\n\u003Cp\u003EI do it the Russian/Soviet way. I have a second mission to Eve? I name the ship Eve-2. The Russians did Venera, Mars, Luna.\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2014-12-21T14:59:18Z","Content":"\n\u003Cp\u003EI\u0027ve been basing my launchers and upper stages after some of the 20 Major Arcana cards of the Tarot. The Magician II - Temperance is an inexpensive light satellite launcher, while the Emperor IV Heavy with Empress second stage and Strength upper stage (skipper-powered upper stage) can lift around 80 tons to LKO.\u003C/p\u003E\u003Cp\u003EMostly it has to do with the type of engines they have.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-12-21T15:25:40Z","Content":"\n\u003Cp\u003EKerbin local crew (6man) transport ships are named like \u003Cstrong\u003ECrew Craft\u003C/strong\u003E {number}{modification} like \u003Cstrong\u003ECrew Craft 3A\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EKerbin local crew (3man) transport ships are named like \u003Cstrong\u003ECrew Craft Light\u003C/strong\u003E {number}{modification} like \u003Cstrong\u003ECrew Craft Light 1\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EInterplanetary ships \u003Cstrong\u003EOSS\u003C/strong\u003E {number}{first planet they visited} like \u003Cstrong\u003EOSS 6 Eeloo\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELanders \u003Cstrong\u003ELander\u003C/strong\u003E {planet(oid)} or {technology} like \u003Cstrong\u003ELander E2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EUnmanned craft named by it\u0027s purpose and serial number, like \u003Cstrong\u003EScanSat 3B 1\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-12-21T15:25:41Z","Content":"\n\u003Cp\u003EI try to think of an acronym that has a bad connotation in English but which perfectly describes the function of the ship. For instance, the LOSER (Laythe Observation Seaplane for Exploration and Recon), the JERK (Jool Excursion Ride for Kerbals), the MADNESS (Modular And Deployable New Extraplanetary Ship System), etc.\u003C/p\u003E\u003Cp\u003EThese are what the Kerbals themselves call their ships. And in Old Kerbish, these acronyms have entirely different meanings, like the names of mythological beings, forms of Kerbin wildlife, and favorite snack recipes that have no direct corresponding word in English. But it\u0027s one of the strange coincidences of the universe (noted in the Hitchhiker\u0027s Guide) that an admirable acronym in Old Kerbish, when literally translated into English, results in a disreputable word.\u003C/p\u003E\n"},{"CreatedByName":"Torque","CreatedById":73361,"CreatedDateTime":"2014-12-21T21:02:37Z","Content":"\n\u003Cp\u003EI name mine after Canadian mammals, the size of the rocket corresponds with the size of animal. Early 1.25m rockets are in the Marmot class of rockets, 2.5m Rockets are the Lynx class and 3.75m rockets are Bison Class.\u003C/p\u003E\u003Cp\u003EAny missions that are of a major significance get a color modifier to their name. First mun mission, Grey Marmot. First Duna mission, Red Lynx. And major changes to the construction of a rocket gets a number variation at the end, so my now standard launch system in 1.25m for payloads less then 20t is the Marmot 4 Launcher.\u003C/p\u003E\n"},{"CreatedByName":"Rainbowtrout","CreatedById":60253,"CreatedDateTime":"2014-12-21T21:31:37Z","Content":"\n\u003Cp\u003EI often name rockets for their function or appearance. Except when the aim of the craft is to go up, and it\u0027s just a 1.25 meter stack. Up-going Tree?\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-12-21T21:40:00Z","Content":"\n\u003Cp\u003EVarious exploration projects have theme names, usually based off of history or mythology. Moho missions are likely to be part of Project Discontinuity, Eve/Gilly will fall under Morning Star/Evening Star/Inanna, Duna/Ike Nergal, Eeloo Ereshkigal, etc.\u003C/p\u003E\u003Cp\u003EGeneric launchers (and more rarely payloads) tend to pull names out of the Cthulhu Mythos, but this also gets converted into alphanumerics. So one built around 3 Mainsails will get called Shantak-3 (S3), and one built around a single LV-T30, uprated with extra fuel to squeeze out maximum payload will get called Lloiger-1U (L1U).\u003C/p\u003E\u003Cp\u003EBut there are ones that break these rules (eg: Wanderer and Trapezohedron exploration craft, Snatlus II launcher, etc)\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-12-21T21:40:24Z","Content":"\n\u003Cp\u003EMy latest attempt at the Soviet UR-700 is named the \u003Cem\u003EFlattery\u003C/em\u003E since it\u0027s getting me nowhere at the moment.\u003C/p\u003E\n"},{"CreatedByName":"psyper","CreatedById":90641,"CreatedDateTime":"2014-12-22T14:49:31Z","Content":"\n\u003Cp\u003EFor all of my different craft I name them after towns and villages in the UK. I have Avon, Bedford, Cambridge, Dover, Exeter etc (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94911-Interplanetary-Mining-Corporation-Craft-Transporters-SSTO-s-and-more\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/94911-Interplanetary-Mining-Corporation-Craft-Transporters-SSTO-s-and-more\u003C/a\u003E) /shameless plug.\u003C/p\u003E\u003Cp\u003EFor each space station or outpost (mun or planetary base) I\u0027ve used the surnames of the astronauts, Cosmonauts etc that have expeditions to the ISS - Shepherd, Krikalev, Gidzenko, Usachev, Voss, Helms, Culbertson, Tyurin, Dezhurov, Onufrienko \u0026amp; Waltz so far. \u003C/p\u003E\u003Cp\u003EI\u0027ve also contemplated river names, large cities around the world, bridges etc etc.\u003C/p\u003E\u003Cp\u003EIts also worth noting that when europe colonised the new world they called a lot of their settlements after the towns they left behind which is why you have so many english town names in new england and the eastern seaboard. It stands to reason that you could do the same when colonising the kerbal system.\u003C/p\u003E\n"},{"CreatedByName":"Spaps","CreatedById":83083,"CreatedDateTime":"2014-12-22T15:05:41Z","Content":"\n\u003Cp\u003ENamed my spacestation KOSS - Kerbin Orbital Science Station, and my first Mun missions Pollux (I, II...). All my sattelites are called [object]Sat [number], for example: KerbinSat I, MunSat IV. Pretty straightforward, isn\u0027t it?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-22T15:13:09Z","Content":"\n\u003Cp\u003EI used to do punny names mostly, but since starting the Iain Banks\u0027 Culture series I\u0027ve adopted his style of naming.\u003C/p\u003E\n"},{"CreatedByName":"spinomonkey","CreatedById":102142,"CreatedDateTime":"2014-12-22T16:36:31Z","Content":"\n\u003Cp\u003EAll my vessels start as \u0022X1, X2...\u0022 until they prove themselves as useful. Then I find a name that relates to the mission, \u0022Mun Skipper\u0022 for Mun Vessel, \u0022Tinderbox\u0022 for Fuel Station. That sort of thing haha\u003C/p\u003E\n"},{"CreatedByName":"TrabantDeLuxe","CreatedById":132222,"CreatedDateTime":"2014-12-22T16:57:22Z","Content":"\n\u003Cp\u003EIn my current save I use:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E-\u003Cem\u003Eik\u003C/em\u003E for everything unmanned. Should it go to another planet, or moon, that celestial body\u0027s name is incorporated: \u003Cem\u003EMunatik\u003C/em\u003E, \u003Cem\u003EMinmusnik\u003C/em\u003E, and \u003Cem\u003EEvenik \u003C/em\u003Ehave all been launched. Scansat sattelites are always called \u003Cem\u003EMapnik\u003C/em\u003E, prefixed with the body they are mapping. Useless satellites to complete contracts are called kontraktniks. I believe I\u0027m currently at \u003Cem\u003EKontraktnik Mk.VI\u003C/em\u003E.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E-\u003Cem\u003Ekhod\u003C/em\u003E for anything with kerbals inside that intend go places. \u003Cem\u003EMinmuskhod Mk.I\u003C/em\u003E was a kerballed minmus orbiting mission. \u003Cem\u003ETaxikhod\u003C/em\u003E is a craft used to shuttle kerbonauts to a space station in LKO. And yes, I\u0027ve got a \u003Cem\u003EVoskhod\u003C/em\u003E.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cem\u003E-grad \u003C/em\u003Efor space station. Currently, I\u0027ve only got \u003Cem\u003EKerbograd Mk.I\u003C/em\u003E.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIn my next save I\u0027m thinking about using Royal Navy ship\u0027s names from eras gone by. HMS Dreadnought, HMS Terror and HMS Invincible all sound pretty bad ass to me. As a side note, flags are always called after the most boring, sleepy town that I can think of at that moment. In a semi-latinised fashion. All caps. Prefixed with \u0022novum\u0022. NOVVM GANZEDYKVM is somewhere in the mÃƒÂ¼n\u0027s east farside crater.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-22T17:24:18Z","Content":"\n\u003Cp\u003EI either build my craft, then look at it to see what it resemble, then name it according to that; or I have a theme in my mind and a name before hand, then build it that way. All my craft begins with a protoype tag before it is successfully used in a mission.\u003C/p\u003E\u003Cp\u003EOnce vehicles are in orbits/otherwise doing missions, I name them functionally, like my relay satellites for kerbins are KRS - # . Simple, but good enough to keep track of things.\u003C/p\u003E\n"},{"CreatedByName":"KingofDerby","CreatedById":126050,"CreatedDateTime":"2014-12-22T17:29:39Z","Content":"\n\u003Cp\u003EIn one save, I named rocket type after dead kerbals. So a Bill 2 command module and support system on a Jeb ascent stage, with a Bob Launcher.\u003C/p\u003E\u003Cp\u003EMy last save was going to use the dead for naming Minmus Base launchpads. The earliest rocket types were re-purposed missiles, with names appropriate. Went through many Mks of them before making a new launcher from scratch, with all types and parts having names beginning with S to keep them uniform.\u003C/p\u003E\n"}]}