{"TopicId":96647,"ForumId":32,"TopicTitle":"How do you Name your Vessels/missions?","CreatedByName":"Steambirds","CreatedById":62753,"CreatedDateTime":"2015-01-14T11:11:05Z","PageNum":1,"Articles":[{"CreatedByName":"Steambirds","CreatedById":62753,"CreatedDateTime":"2015-01-14T11:11:05Z","Content":"\n\u003Cp\u003ESo forums, here\u0027s a question: How do you guys name your vessels/missions? I personally like to choose the first noun that pops into my head when looking at my rocket, and then I slap a roman numeral onto the end for the mission number. Although all of my test craft are given greek/roman names and then alpha, beta, etc.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2015-01-14T12:16:31Z","Content":"\n\u003Cp\u003ERandom things that come to my head. They are usually nonsensical. \u003C/p\u003E\u003Cp\u003EFor example, my mission to Moho involved a ship christened the \u0022Moho Mofo\u0022.\u003C/p\u003E\n"},{"CreatedByName":"nekogod","CreatedById":103186,"CreatedDateTime":"2015-01-14T12:19:46Z","Content":"\n\u003Cp\u003EIt depends really, planes usually get bird names, falcon this, eagle that kestrel whatever etc \u003C/p\u003E\u003Cp\u003ERockets usually get a name based on the function, ie Orbiter or Sky Lab or Duna explorer etc\u003C/p\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-01-14T12:21:33Z","Content":"\n\u003Cp\u003EUntitled spacecraft mostly for LKO ^)\u003C/p\u003E\u003Cp\u003EStill I have\u003C/p\u003E\u003Cp\u003EMun-1, Mun-2... Mun-N\u003C/p\u003E\u003Cp\u003EMinmus-1, Minmus-2...\u003C/p\u003E\u003Cp\u003EDuna-1, Duna-2\u003C/p\u003E\u003Cp\u003Eetc\u003C/p\u003E\u003Cp\u003EAnd I only have one Eve-4\u003C/p\u003E\n"},{"CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2015-01-14T12:45:27Z","Content":"\n\u003Cp\u003EIf it\u0027s a small craft just to satisfy a contract, I might call it \u0026lt;part\u0026gt; test craft. Il delete the file after its done it job. For \u0027bigger\u0027 missions I try to give it a name, I had a Duna craft called Copernicus, my mun and minmus bases are both called \u0027eden\u0027 \u003C/p\u003E\u003Cp\u003EI have a \u0027Dave station\u0027 too! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-01-14T13:03:08Z","Content":"\n\u003Cp\u003EFor spacecrafts models, I name them after a theme I find interesting. My comsats and relay beacons are named after things related to sound, such as the lowest level relay beacon is called \u0022Whisper\u0022, the higher one is called \u0022Echo\u0022, etc. I may also name them with one of their outstanding feature, such as my mun lander, which has a huge, black heat shield on top of it for reentry on Kerbin, so I named it \u0022Blackcap\u0022. It is memorable enough for me to remember what each model should do.\u003C/p\u003E\u003Cp\u003EFor missions and flight though, I have flight codes to allow me to keep track of many flights at once. For crafts orbiting a body, I name them in the following format:\u003C/p\u003E\u003Cp\u003E[Orbiting body initials] - [Coded purpose of craft] - [Craft model name] - [#of copies if there are more than one]\u003C/p\u003E\u003Cp\u003EAn example: \u0022K - RB - Whisper - 4\u0022 tells me it is the 4th Whisper model relay beacon orbiting Kerbin.\u003C/p\u003E\u003Cp\u003EFor craft in interplanetary transits, I do the same, but instead of [Orbiting body initials] I replace it with [initials of target body/Initials of origin body] to keep track which ways things are going.\u003C/p\u003E\u003Cp\u003EAn example: \u0022Mu/K - Ldr - Blackcap\u0022 tells me it is a Blackcap model lander going from Kerbin to Mun.\u003C/p\u003E\u003Cp\u003EThere is a lot of benefits for keeping a system when you need to know where things are at all time. Especially when you are using Kerbal alarm clock and you have a lot of alarm listed for many crafts.\u003C/p\u003E\n"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2015-01-14T13:14:18Z","Content":"\n\u003Cp\u003EI usually name them things like \u0022moon bros\u0022 or \u0022pole burner series\u0022\u003C/p\u003E\u003Cp\u003EMy pole burner series has about 3 crafts that complete orbit specification contracts.\u003C/p\u003E\n"},{"CreatedByName":"Warscribe","CreatedById":58388,"CreatedDateTime":"2015-01-14T13:44:14Z","Content":"\n\u003Cp\u003EI have a chart.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/YrY1bC0.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/YrY1bC0.jpg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Musil","CreatedById":132791,"CreatedDateTime":"2015-01-14T13:51:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Warscribe\u0022 data-cite=\u0022Warscribe\u0022\u003E\u003Cdiv\u003EI have a chart.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was intimidating. \u003C/p\u003E\u003Cp\u003EAs a rule, I name my Mun missions \u0022Archer\u0022 and then a number. Because Apollo... see, see? Minmus missions are sometimes called \u0022Janus\u0022.\u003C/p\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2015-01-14T14:01:30Z","Content":"\n\u003Cp\u003EI second naming my planes after birds.\u003C/p\u003E\u003Cp\u003EVery obvious and easy!\u003C/p\u003E\u003Cp\u003EUsually I try to give them a name that\u0027s fitting, not just a cool-sounding one. \u003C/p\u003E\u003Cp\u003EMy Colibri-series of planes, for instance, are named thus because they lack proper landing gear but hover great as do real Colibri birds.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-01-14T14:29:35Z","Content":"\n\u003Cp\u003EInconsistently.\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-01-14T14:45:35Z","Content":"\n\u003Cp\u003E\u0022Hm, what I should call this probe..\u0022\u003C/p\u003E\u003Cp\u003E\u0022Fortitude? Nah... Swift? Nah... Discovery? Okay, that sounds good.\u0022\u003C/p\u003E\u003Cp\u003EI just think of things that sound interesting and pick the best one from there.\u003C/p\u003E\n"},{"CreatedByName":"Finnan","CreatedById":130706,"CreatedDateTime":"2015-01-14T15:04:28Z","Content":"\n\u003Cp\u003EPlanet / Mission / Number\u003C/p\u003E\u003Cp\u003Eie: Minmus Contract 2 \u003C/p\u003E\u003Cp\u003EThe second satellite build under contract orbiting Minmus.\u003C/p\u003E\n"},{"CreatedByName":"Travisfv","CreatedById":63966,"CreatedDateTime":"2015-01-14T15:53:50Z","Content":"\n\u003Cp\u003EI like birds, so I usually go with bird names. I did use Glacier recently for my first VTOL.\u003C/p\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2015-01-14T15:57:57Z","Content":"\n\u003Cp\u003EUnmanned probes are named after their purpose, like \u0022Minmus Temperature Sat\u0022, but manned missions are either named after famous authors or scientists. \u003C/p\u003E\u003Cp\u003EIf there\u0027s a chance for a pun, I gladly put that in. My manned mission to Dres is for instance called \u0022KSS Dresselhaus\u0022 (after the famous physicists M. and G. Dresselhaus).\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-01-14T16:18:20Z","Content":"\n\u003Cp\u003Esattelites usually go \u0022celestial body/ class / sat / greek letter\u0022\u003C/p\u003E\u003Cp\u003Efor example, the first sattelite designed to collect science put in orbit over the Mun is \u0022Mun S-sat alpha\u0022. The second communication sattelite in orbit over Kerbin would be \u0022Kerbin C-sat Beta\u0022\u003C/p\u003E\u003Cp\u003EFor mission crafts I usually go for vaguely appropriate references to mythology or an adjective describing the type of mission.\u003C/p\u003E\u003Cp\u003EFor example: my Eve return vehicle was called Orpheus (because it was going to hell and back) and an SSTO spaceplane personnel carrier was called Charon (because it ferried people between space and KSC). If I ever make a sun-diving probe it would probably be called Icarus.\u003C/p\u003E\u003Cp\u003EMy first long-range SSTO spaceplane was the KSS (Kerbal Space Ship) Dauntless and the first inter-planetary one was the KSS Intrepid. I\u0027m considering naming one of my future Mk III super-heavy SSTO\u0027s the KSS F*CK YEAH! because of the amount of headaches the design process is giving me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-14T16:20:59Z\u0022 title=\u002201/14/2015 04:20  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 14, 2015\u003C/time\u003E by Cirocco\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2015-01-14T16:35:06Z","Content":"\n\u003Cp\u003EShip Type/use;\u003C/p\u003E\u003Cp\u003ECTV - Crew Transfer Craft\u003C/p\u003E\u003Cp\u003ESDV - Satellite Delivery Vehicle\u003C/p\u003E\u003Cp\u003EThen the specified operational altitude\u003C/p\u003E\u003Cp\u003E100K - 100 kilometres\u003C/p\u003E\u003Cp\u003EMu100K - MÃƒÂ¼n 100km\u003C/p\u003E\u003Cp\u003EThen if it\u0027s a CTV/plane the number of passengers\u003C/p\u003E\u003Cp\u003EAnd if it\u0027s a plane it\u0027s max safe speed.\u003C/p\u003E\u003Cp\u003EStations are named after Greek gods.\u003C/p\u003E\u003Cp\u003EWarships are named after Roman gods.\u003C/p\u003E\u003Cp\u003EAnd Interplanetary vessels are named after historical vessels or Constellations.\u003C/p\u003E\n"},{"CreatedByName":"CptRichardson","CreatedById":269,"CreatedDateTime":"2015-01-14T17:10:48Z","Content":"\n\u003Cp\u003EMunollo 1\u003C/p\u003E\u003Cp\u003EKerburn 5\u003C/p\u003E\u003Cp\u003EThe Jebidiah Kerman (piloted by Jebidiah Kerman on a five year voyage to explore the strange new worlds)\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2015-01-14T17:13:47Z","Content":"\n\u003Cp\u003ESingle stage interplanetary crew or passenger planes - Astroliner\u003C/p\u003E\u003Cp\u003ESingle stage interplanetary small private planes - Astro-Cruiser\u003C/p\u003E\u003Cp\u003ECustom space shuttles - Astro-Shuttle\u003C/p\u003E\u003Cp\u003EInterplanetary rockets - Explorer\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-14T17:17:22Z\u0022 title=\u002201/14/2015 05:17  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 14, 2015\u003C/time\u003E by Overfloater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2015-01-14T17:47:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003ERandom things that come to my head. They are usually nonsensical. \u003Cp\u003EFor example, my mission to Moho involved a ship christened the \u0022Moho Mofo\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHaha, nice. I often do the same thing. Just the other day I made an electric plane to get to the top of Mt. Kraken, and while making it I thought of Rahsaan Roland Kirk\u0027s Bright Moments album, Track 6... so I named it \u003Cstrong\u003E\u003Cem\u003EBoogie Electric\u003C/em\u003E\u003C/strong\u003E.\u003C/p\u003E\n"},{"CreatedByName":"ZeroGravitas","CreatedById":116576,"CreatedDateTime":"2015-01-14T18:05:25Z","Content":"\n\u003Cp\u003EI like to do this logically so I can always find and reuse designs for future missions.\u003C/p\u003E\u003Cp\u003EXXX - YYY - abcdefg - ZZ\u003C/p\u003E\u003Cp\u003EXXX - Simply the flight number, to make sure sorting ship files by name puts them chronological order.\u003C/p\u003E\u003Cp\u003EYYY- 3 letter code defining the ships mission location.\u003C/p\u003E\u003Cp\u003E For flights:\u003C/p\u003E\u003Cp\u003E First letter is the body, e.g. K for Kerbin, E for Eve. Where 2 bodies share a letter (Mun and Minmus, Duna and Dres) then second letter is included in lower case.\u003C/p\u003E\u003Cp\u003E Second capital designates the \u0027altitude\u0027. L for low, H for high, S for sub (as in sub-orbital).\u003C/p\u003E\u003Cp\u003E Third letter defines whether the flight is atmospheric (A) or orbital (O)\u003C/p\u003E\u003Cp\u003E e.g. \u003C/p\u003E\u003Cp\u003E KLA = Kerbin Low Atmosphere, \u003C/p\u003E\u003Cp\u003E DuHO = Duna High Orbit\u003C/p\u003E\u003Cp\u003E For surface craft\u003C/p\u003E\u003Cp\u003E First letter is for the body again.\u003C/p\u003E\u003Cp\u003E Second \u0027letter\u0027 is Su - for surface\u003C/p\u003E\u003Cp\u003E Third letter is either R for rover, L for lander (immobile), B for base (long term manned), M for mining craft\u003C/p\u003E\u003Cp\u003E e.g.\u003C/p\u003E\u003Cp\u003E ESuL = Eve Surface Lander\u003C/p\u003E\u003Cp\u003E MiSuM = Minmus Surface Lander\u003C/p\u003E\u003Cp\u003Eabcdefg - A name for the craft series which will be used by each vessel using this design; either from an animal, mythical creature, Ian M. Banks ship name, historical scientist etc etc.\u003C/p\u003E\u003Cp\u003EZZ - The number of the craft using this design, in roman numerals.\u003C/p\u003E\u003Cp\u003ESo some examples.\u003C/p\u003E\u003Cp\u003E001 KLA Thales I\u003C/p\u003E\u003Cp\u003E002 KLA Thales II\u003C/p\u003E\u003Cp\u003E003 KLA Pythagoras I\u003C/p\u003E\u003Cp\u003E004 KHA Democritus I\u003C/p\u003E\u003Cp\u003E005 KHA Democritus II\u003C/p\u003E\u003Cp\u003E006 KSO Democritus III\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E023 KHO Al-Kindi I\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E042 MuSuL Copernicus II\u003C/p\u003E\u003Cp\u003Eetc\u003C/p\u003E\u003Cp\u003EFor launchers I save them as sub-assemblies, with an ancient god\u0027s name followed by their payload limit.\u003C/p\u003E\u003Cp\u003Ee.g. \u003C/p\u003E\u003Cp\u003EEnki 14t\u003C/p\u003E\u003Cp\u003EAntu 6t\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-01-14T18:11:29Z","Content":"\n\u003Cp\u003EOne of my most successful heavy launchers, which I named the Phoenix launcher was so named due to some issues during operational status which almost forced a new design and launcher to replace it but I ended up redesigning the launcher to the point that it works nearly every time, even when jeb is piloting\u003C/p\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2015-01-14T18:11:57Z","Content":"\n\u003Cp\u003EI usually name them according to what their function will be. Example: low kerbin orbit satellites designed to be communications arrays are usually callled \u0022LKO-ComSat,\u0022 and munar satellites are usually called \u0022MunSat.\u0022\u003C/p\u003E\u003Cp\u003EManned vessels are usually along the lines of \u0022Munar Lander,\u0022 or \u0022Duna Explorer\u0022 and don\u0027t really get a \u0022name,\u0022 per say, unless the mission becomes super successful (I once had a satellite above Eve that I managed to bring back. Was originally called \u0022EveSat\u0022 but later became \u0022Little Peeper\u0022 since it took so many pictures and returned home).\u003C/p\u003E\u003Cp\u003EAs far as space stations go, I\u0027ve only ever built one per save file in LKO and it has ALWAYS been called the \u0022KISS\u0022 (K.erbal I.nternational S.pace S.tation) in commemoration with Kerbal Kind Kissing the Stars.\u003C/p\u003E\n"},{"CreatedByName":"JimmyAgent007","CreatedById":74761,"CreatedDateTime":"2015-01-14T18:12:56Z","Content":"\n\u003Cp\u003EFor the longest time all my ships had the name Death Trap in them somewhere.\u003C/p\u003E\n"},{"CreatedByName":"gmpd2000","CreatedById":37101,"CreatedDateTime":"2015-01-14T18:19:28Z","Content":"\n\u003Cp\u003EI just put the acronym as a name.\u003C/p\u003E\u003Cp\u003EExample:\u003C/p\u003E\u003Cp\u003EJool System Explorer Probe : JSEP or JSE .\u003C/p\u003E\n"}]}