{"TopicId":97358,"ForumId":32,"TopicTitle":"Orbital debris","CreatedByName":"Delrey","CreatedById":131343,"CreatedDateTime":"2015-01-21T14:57:24Z","PageNum":1,"Articles":[{"CreatedByName":"Delrey","CreatedById":131343,"CreatedDateTime":"2015-01-21T14:57:24Z","Content":"\n\u003Cp\u003EHow do you guys feel about orbital debris? I just started having probe cores on my orbital injection stages to deorbit.\u003C/p\u003E\u003Cp\u003EI have a good amount of stuff floating around already; some large stages in LoKO.\u003C/p\u003E\u003Cp\u003EDo you just terminate them in the tracking station? Does the asteroid grabber work on these?\u003C/p\u003E\u003Cp\u003EDel\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-01-21T15:00:11Z","Content":"\n\u003Cp\u003EI\u0027ve been adding probe cores to spent stages for quite a long while now. When I was a beginner I just threw them everywhere and really cluttered up Kerbins orbit.\u003C/p\u003E\n"},{"CreatedByName":"Zuqq","CreatedById":133985,"CreatedDateTime":"2015-01-21T15:01:34Z","Content":"\n\u003Cp\u003EI know a lot of people will spend the time to de-orbit spent stages. I personally slack, and terminate through the tracking station the majority of the time. Or I will drop the stage on a ballistic orbit before my insertion burn. Im unsure if the asteroid grabber works on them, but it should be easy enough to make a tug.\u003C/p\u003E\n"},{"CreatedByName":"DBT85","CreatedById":114980,"CreatedDateTime":"2015-01-21T15:05:26Z","Content":"\n\u003Cp\u003EI try and build vessels in such a way that parts either a) fall back to kerbin or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E slam into the planet I\u0027m heading to.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-01-21T15:07:45Z","Content":"\n\u003Cp\u003EI just turn the debris slider way down in the settings. AintNobodyGotTimeFoDat.avi\u003C/p\u003E\n"},{"CreatedByName":"micha","CreatedById":113840,"CreatedDateTime":"2015-01-21T15:09:41Z","Content":"\n\u003Cp\u003EI design my missions to actively avoid orbital debris - probably thanks to watching Scott Manley on YouTube and his oft-stated dislike of the same.\u003C/p\u003E\u003Cp\u003EI ditch launch stages prior to entering orbit - that way they crash back onto the planet I\u0027m launching from. Yes, this sometimes means ditching a stage with a bit of fuel left over (argh! the waste!). Anything which does make orbit is either there to stay (ie, a station or satellite), or to eventually come back down.\u003C/p\u003E\u003Cp\u003ESimilarly for transfer stages to other moons/planets - they\u0027re either there for the entire return trip, or they get staged after an initial landing burn.\u003C/p\u003E\u003Cp\u003EAnything which does get left over accidentally stays there as a reminder. Haven\u0027t played a single game for long enough to run into performance issues yet.\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-01-21T15:13:15Z","Content":"\n\u003Cp\u003EI frequently get within 5 km of debris during a standard launch.......I wonder what that says about me.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2015-01-21T15:15:12Z","Content":"\n\u003Cp\u003Eas mentioned before in this thread: I tend to design my ships so that any spent stages are jettisoned while either still on a sub-orbital path or in such a way that they crash/stay on the target planet. Mind you, while I actively avoid spent stages in a LKO, I have for less problems with putting spent stages in a \u0022graveyard orbit\u0022 i.e an orbit around the sun. The odds of those ever encountering anything or doing any harm are so astronomically low that I can happily ignore them.\u003C/p\u003E\n"},{"CreatedByName":"nadreck","CreatedById":89087,"CreatedDateTime":"2015-01-21T15:20:29Z","Content":"\n\u003Cp\u003EI try to recover all my larger booster stages so I design in probe cores and parachutes. When a craft that was fullfilling a satellite contract or station contract is done its job and if I seen no future use for it, I get rid of it either by crashing if possible or by removing it in the tracking station. Any flags that are not the primary biome identifier (ie contract or experience flags) get deleted from there as well. Occasionally I delete something I didn\u0027t mean to in tracking station (parked craft on Kerbin usually).\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2015-01-21T15:37:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI just turn the debris slider way down in the settings. AintNobodyGotTimeFoDat.avi\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDitto. In the interest of role-playing my own game, and in attempting to reconcile my personal aesthetics of \u0022fun\u0022 and \u0022authenticity,\u0022 I try to design my lifters to drop the first stage will still on a negative-perigee trajectory, or one with a perigee of under about 10 km. That said, the first thing I do with a new save is turn the debris slider down to 50 ... My game lags when it\u0027s tracking too many spent stages, stack separators and dead early probes/satellites.\u003C/p\u003E\u003Cp\u003EAlso, I just noticed the other day after a KSP crash-to-desktop that my Tracking Station now shows 0 debris being tracked. I don\u0027t remember setting that to zero. Must be a new glitch in my save.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-01-21T15:50:35Z","Content":"\n\u003Cp\u003EHonestly, I haven\u0027t ever progressed enough (yet, I\u0027m working on it) to the point where debris is a huge problem. Most of the first stages on my rocket end up suborbital anyway, and the rest of them are all one piece deals, so I\u0027d have to launch plenty of rockets before my particular system clutters up Kerbin space just yet.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Speed","CreatedById":72133,"CreatedDateTime":"2015-01-21T16:09:16Z","Content":"\n\u003Cp\u003EI never care to deorbit them after a launch, so I have a nice ring of junk around kerbin. I have had plenty of spent orbital stages zip past me during launch, but even if you pass within 2 kilometers the chance of actually hitting something is still very small. Whenever I feel like it\u0027s getting a bit too messy I launch a nuclear grabber vessel and salvage everything I can. \u003C/p\u003E\u003Cp\u003EEverything is more fun in space. Even being a waste collector!\u003C/p\u003E\n"},{"CreatedByName":"boxman","CreatedById":61559,"CreatedDateTime":"2015-01-21T16:24:51Z","Content":"\n\u003Cp\u003ESince debris is a problem in real life i dont see the problem in having a bit of debris around. Of course if I can avoid it in a realistic manner I often do so. \u003C/p\u003E\u003Cp\u003EBut otherwise I just dont deal with it unless it becomes a problem like causing lag. Adding a probe core and thrust/rcs to everything is just not realistic imo.\u003C/p\u003E\u003Cp\u003EAlso that debris can be a nice reminder of previous missions or failures.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-01-21T16:34:25Z","Content":"\n\u003Cp\u003EI am planning to make a SSTO tank/engine grabber. Big fuel tanks and engines are expensive!\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2015-01-21T16:51:29Z","Content":"\n\u003Cp\u003EIf it\u0027s small, cheap or too far away I terminate it.\u003C/p\u003E\u003Cp\u003EAs for big launch stages, I tend to make them barely unable to get to orbit so I can recover them on the ground.\u003C/p\u003E\n"},{"CreatedByName":"Toastedbuns","CreatedById":135947,"CreatedDateTime":"2015-01-21T16:56:01Z","Content":"\n\u003Cp\u003EI terminate it most of the time. No point keeping it cluttered up.\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2015-01-21T16:57:35Z","Content":"\n\u003Cp\u003EProbe cores \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eand parachutes!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EJettison as much as you can before orbit.\u003C/p\u003E\u003Cp\u003EYes, grabbers work. I have special de-orbiters, that are a probecore, grabber, small engine, and parachutes. \u003C/p\u003E\u003Cp\u003ERECOVER IT ALL!\u003C/p\u003E\n"},{"CreatedByName":"Itsdavyjones","CreatedById":57605,"CreatedDateTime":"2015-01-21T17:18:51Z","Content":"\n\u003Cp\u003EMost of my rockets leave no debris, and if i have a stage that has enough D/V to be in orbit after the final burn, I use it as much as possible before shutting it off prematurely and use the rest to get the last bit into orbit. Otherwise, i try to crash them into other bodies.\u003C/p\u003E\n"},{"CreatedByName":"fchurca","CreatedById":64090,"CreatedDateTime":"2015-01-21T17:22:37Z","Content":"\n\u003Cp\u003EI\u0027m experimenting with SSTO lifters now. I have some legacy debris orbiting around, which I\u0027ll try to take care of with ion-powered deorbiters.\u003C/p\u003E\n"},{"CreatedByName":"Chewy","CreatedById":115853,"CreatedDateTime":"2015-01-21T17:40:11Z","Content":"\n\u003Cp\u003EI\u0027ve never given much consideration to debris, other than that I try to get funds for any liquid fuel launch stages by putting parachutes on them and decoupling them prior to circularizing (those engine costs add up). Most of my persistent debris is ejected procedural fairings, even though I usually eject fairings as soon as I\u0027m out of the atmosphere on a suborbital trajectory (because I don\u0027t want to use extra fuel to push the weight of the fairing), I use interstage fairings for rocket cargo bays often enough to clutter up the sky quite a bit.\u003C/p\u003E\u003Cp\u003EHas anyone ever thought of making a mod that would simulate debris collisions for non-active vessels? That would make me think twice about littering LKO with abandon.\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-01-21T17:58:19Z","Content":"\n\u003Cp\u003EI try realistically to keep skies clean, but my major concern is FPS.\u003C/p\u003E\n"},{"CreatedByName":"TrooperCooper","CreatedById":110599,"CreatedDateTime":"2015-01-21T18:55:14Z","Content":"\n\u003Cp\u003EI put a stack of TNT on my lifters, countdown triggered by their decouple-stage. Less boring than deleting stuff through the tracking station. Yummy explosions. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gmY2qIv.jpg\u0022 alt=\u0022gmY2qIv.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Itsdavyjones","CreatedById":57605,"CreatedDateTime":"2015-01-21T19:47:18Z","Content":"\n\u003Cp\u003ENow if only explosions made hundreds of pieces of small debris, then you would deorbit.\u003C/p\u003E\n"},{"CreatedByName":"Johnny Wishbone","CreatedById":118096,"CreatedDateTime":"2015-01-21T19:49:43Z","Content":"\n\u003Cp\u003ECareer mode or sandbox, how do you manage all the debris from your space program? The spent boosters, derelict transfer stages, debris from collisions (accidental or on purpose), etc that litter the orbits around your planets and moons. Or are you space eco-friendly and clean up after yourself?\u003C/p\u003E\u003Cp\u003EDo you:\u003C/p\u003E\u003Cp\u003E 1) Leave it there. My CPU can handle it.\u003C/p\u003E\u003Cp\u003E 2) De-orbit it for recovery or destruction using in-game resources like probe cores or piloted ships.\u003C/p\u003E\u003Cp\u003E 3) Destroy it using the tracking station\u0027s \u0022terminate\u0022 button.\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-01-21T19:52:59Z","Content":"\n\u003Cp\u003EIn my earlier KSP days, I\u0027d leave orbit trash everywhere. One day I had a piece of debris fly past my station, no more that a few meters from hitting it and ripping it apart. Since then, I\u0027ve been a bit more careful.\u003C/p\u003E\n"}]}