{"TopicId":99022,"ForumId":32,"TopicTitle":"Is KSP dying?","CreatedByName":"bartekkru99","CreatedById":76625,"CreatedDateTime":"2015-02-07T20:12:13Z","PageNum":3,"Articles":[{"CreatedByName":"Proot","CreatedById":98932,"CreatedDateTime":"2015-02-08T07:22:07Z","Content":"\n\u003Cp\u003EKSP is not dying at all. In fact is so full of possibilities that makes me scared. But, of course, the success of the \u0022product life\u0022 depends on SQUAD... I would have liked a small graphic boost before the final release, but the real challenge for SQUAD is to continue expanding, completing and perfecting the Kerbin system. Maybe even grow to new systems, far beyond Kerbol. Because this game actually never ends, only (after literally years of play) suffers the lack of new targets. New adventures.\u003C/p\u003E\u003Cp\u003ESo no, KSP is not dying at all. Hundreds of features can be added yet. If SQUAD knows how to surround himself with the right people, they can turn this game into an historic milestone, even far beyond what it already is. A goose that lays golden eggs.\u003C/p\u003E\u003Cp\u003EBut above all a game fun as hell for all of us. An experience shared by several generations. Not many games, what the hell, not even many activities in our lives that can achieve it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-08T07:24:11Z\u0022 title=\u002202/08/2015 07:24  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 8, 2015\u003C/time\u003E by Proot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mr Tegu","CreatedById":76643,"CreatedDateTime":"2015-02-08T07:53:25Z","Content":"\n\u003Cp\u003EKSP II anyone?\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-02-08T08:53:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EThere is a rather disturbing trend. From after 0.25 to now, the overall trend line is drawn with a negative slope\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFunny, July 2014 to September 2014 was also a downward trend. And April to June before that. And January to March.. It\u0027s almost as if it\u0027s going up and down. If only there were some thing to connect the \u0027up\u0027 bits in \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/0.23\u0022 rel=\u0022external nofollow\u0022\u003Eearly January\u003C/a\u003E, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/0.23.5\u0022 rel=\u0022external nofollow\u0022\u003EApril\u003C/a\u003E, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/0.24\u0022 rel=\u0022external nofollow\u0022\u003EJuly\u003C/a\u003E, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/0.25\u0022 rel=\u0022external nofollow\u0022\u003Elate September\u003C/a\u003E, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/0.90\u0022 rel=\u0022external nofollow\u0022\u003EDecember\u003C/a\u003E..\u003C/p\u003E\u003Cp\u003ESaying that the recent downward trend is significant means nothing if it happens between \u003Cem\u003Eevery single recent release\u003C/em\u003E. I personally don\u0027t see any downward trend that Steam KSP hasn\u0027t seen before.\u003C/p\u003E\n"},{"CreatedByName":"Ringkeeper","CreatedById":88438,"CreatedDateTime":"2015-02-08T10:16:58Z","Content":"\n\u003Cp\u003Ei can only say, how i feel at the moment.\u003C/p\u003E\u003Cp\u003EThe game is alpha, every now and then a patch comes. Most of the times, mods break or the save can\u0027t be used otherwise. I build already so many bases, stations and whatever that i just can\u0027t do it anymore at the moment. And there is also no ingame need for them. Yes, with Mods like MKS/OKS the have a bit of a purpose, but thats endgame. In the beginning you get so many contracts \u0022send a base/station to X\u0022 that you cluster your orbits with useless crap.\u003C/p\u003E\u003Cp\u003EAnd there is yet no real good autoupdater for mods. Mods are spread out over X pages. 64bit not stable enough or mods don\u0027t support it and on 32bit your just too limited.\u003C/p\u003E\u003Cp\u003ESo i just check the game for couple days after a patch and wait for the day the major stuff is fixed.\u003C/p\u003E\n"},{"CreatedByName":"KerBlam","CreatedById":134309,"CreatedDateTime":"2015-02-08T10:28:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ringkeeper\u0022 data-cite=\u0022Ringkeeper\u0022\u003E\u003Cdiv\u003E The game is alpha \u003C/div\u003E\u003C/blockquote\u003E The Game is in Beta\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ringkeeper\u0022 data-cite=\u0022Ringkeeper\u0022\u003E\u003Cdiv\u003E And there is yet no real good autoupdater for mods \u003C/div\u003E\u003C/blockquote\u003E CKAN works wonderfully, in most cases. It\u0027s a WIP like anything else, but it functions.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ringkeeper\u0022 data-cite=\u0022Ringkeeper\u0022\u003E\u003Cdiv\u003E 64bit not stable enough or mods don\u0027t support it and on 32bit your just too limited.\u003C/div\u003E\u003C/blockquote\u003E Windows 64bit is not supported. Linux 64 works great. Your choice of OS is the issue \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Disclaimer: I dislike Windows with a vengeance so you can\u0027t expect anything more from me )\u003C/span\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Moonfrog","CreatedById":76295,"CreatedDateTime":"2015-02-08T12:33:40Z","Content":"\n\u003Cp\u003EI think people play for a while, then take a break. I think is quite common with games, alot of the community have already played the game for years, probably done nearly everything they wanted to do. Real question we should ask, is how many new members are we getting into the community? I used to post alot more when i first got the game, but now, most questions are already answered that i know, theres so many youtube videos, that everything could be accused of being a copy by now. Just become saturated with media, that all that is left is to play the game. Look at the threads, u will not got to space today, and how big they are. May be people buying ksp and playing it, but not on the forums, there is a lack of what to do on the forums, is there a question that has not already been asked yet? I think its just saturation. When people heard of overhall and resources in version 1 that is coming, i bet alot of people are going, hmm should i continue iwth my carreer mode or wait. I think alot of people start fresh with a new version. What would be really cool and good judge, would be a persisitant multiplayer server, then each day u would log on and see someones space station or rocket flying about \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E maybe in version 2.0\u003C/p\u003E\n"},{"CreatedByName":"Kedwin Hubble","CreatedById":124939,"CreatedDateTime":"2015-02-08T13:31:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bartekkru99\u0022 data-cite=\u0022bartekkru99\u0022\u003E\u003Cdiv\u003EI And finally no KSP Youtuber is treated like a god and guarded by an army of angry fanboys, that insult you after say something about him.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EScott Manley is pretty godly.\u003C/p\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2015-02-08T13:46:54Z","Content":"\n\u003Cp\u003EEh, less forum activity doesn\u0027t mean the game is dying. It\u0027s time for midterm exams, and a lot of the playerbase is in school. You don\u0027t want them to launch rockets when they should be studying, do you now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E ?\u003C/p\u003E\u003Cp\u003EAs for me, I used to be active on the forum, now I...skim through the Addons section from time to time, but that\u0027s about it. Chalk it up to three factors:\u003C/p\u003E\u003Cp\u003E1) hardly feeling like playing KSP during the past few months (burned out)\u003C/p\u003E\u003Cp\u003E2) having to focus on university work\u003C/p\u003E\u003Cp\u003E3) I found /r/kerbalspaceprogram and like it more than the forum\u003C/p\u003E\u003Cp\u003E*shrugs*\u003C/p\u003E\n"},{"CreatedByName":"sporkafife","CreatedById":38208,"CreatedDateTime":"2015-02-08T14:01:43Z","Content":"\n\u003Cp\u003ENo, of course KSP isn\u0027t dying. I\u0027ve been playing since the update that added C7\u0027s spaceplane parts (I can\u0027t remember the version number) and while I don\u0027t play the game as much as I did then, I still play it plenty. And I play it loads when a new update comes out. Think of it like a relationship. At first it\u0027s like \u0022wooow, so exciting, must do EVERYTHING\u0022 and you spend every minute thinking about, whereas after a while it matures and becomes something longer lasting. Although you still get that frenzy of love every time something new and exciting happens (a new update!)\u003C/p\u003E\u003Cp\u003EAs for the community, this must be the 4th or 5th time I\u0027ve seen the \u0022KSP community is dying/changing and I don\u0027t like it\u0022 thread. Is it changing? I don\u0027t know. But at the end of the day, communities do change over time. Squad now has a consistent weekly schedule to their community interactions, which wasn\u0027t true for a long time. I remember us all waiting weeks between hearing anything, and when we did it would be a cryptic post from Novasilisko on an update thread!\u003C/p\u003E\u003Cp\u003E(THIS NEXT PART IS MY OPINION, PINCH OF SALT REQUIRED) The fact that the forums activity has mostly changed from \u0022look at this awesome thing I did\u0022 to \u0022let\u0027s split in half to bash/defend the latest decision by Squad\u0022 is probably why it doesn\u0027t seem to have as deep interaction any more. I\u0027m not even going to get in to where my opinion lies on the matter, but I\u0027ll just say this: there have been plenty of \u0022controversial\u0022 decisions made by Squad throughout development (even going back to changing the desktop icon in 0.14.something!) and it has always been fine.\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2015-02-08T14:29:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003ESteam has some very awesome statistics for just this kinda thing:\u003Cp\u003E\u003Ca href=\u0022http://steamcharts.com/app/220200\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcharts.com/app/220200\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo no, it\u0027s not dying\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice! Thanks for the link to that.\u003C/p\u003E\u003Cp\u003EHere\u0027s a thing about line graphs... People look at the last segment of the line and try to draw conclusions about the whole graph. I copied the average monthly data into Excel and added moving averages, which sometimes helps people cancel out the noise (the variance) and look at overall trends. Yeah, I know some statistics professors out there hate moving averages, but us finance majors like them, so STFU. Note that this does \u003Cstrong\u003Enot represent the total \u003C/strong\u003EKSP population since a very significant portion of players bought the game from the online store.\u003C/p\u003E\u003Cp\u003EEdit: Sorry about the first graph title. It should read \u0022Since March 2013\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xJIx1ug.png\u0022 alt=\u0022xJIx1ug.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RjoRtsK.png\u0022 alt=\u0022RjoRtsK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe conclusion I draw from this is that KSP experienced the greatest player growth \u003Cstrong\u003Eon Steam\u003C/strong\u003E in the first year it became available in the Steam store. Over the past year, the Steam player base has remained stable.\u003C/p\u003E\u003Cp\u003ESo, based on actual \u003Cstrong\u003Edata\u003C/strong\u003E, does anyone care to argue that KSP is dying? I don\u0027t see a downward trend here at all.\u003C/p\u003E\n"},{"CreatedByName":"KerBlam","CreatedById":134309,"CreatedDateTime":"2015-02-08T14:34:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sporkafife\u0022 data-cite=\u0022sporkafife\u0022\u003E\u003Cdiv\u003EThe fact that the forums activity has mostly changed from \u0022look at this awesome thing I did\u0022 to \u0022let\u0027s split in half to bash/defend the latest decision by Squad\u0022 is probably why it doesn\u0027t seem to have as deep interaction any more.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m relatively new here and I\u0027ve noticed this.. It\u0027s a bit of a shame. It is a game after all, we should all be having fun and making wack stuff that explodes other stuff and taking mad screenies and being rep-santa. \u003C/p\u003E\u003Cp\u003EMy favourite posts are the ones where someone has made some crazy contraption fly, or completed some insane mission, like the guy that drove around Eve... It inspires me to try other things. I don\u0027t particularly like these threads where it\u0027s \u0027SQUAD did something bad IMO\u0027 or \u0027Is KSP dead?\u0027... It\u0027s not very positive, and it\u0027s not at all inspirational.\u003C/p\u003E\u003Cp\u003EMods: Maybe there could be a sub-forum where people can have a whinge about SQUAD or KSP (and the rest of us can ignore it). \u003C/p\u003E\u003Cp\u003EIt could be called \u0027The place for super important opinions that really really matter\u0027 or something. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgc.allpostersimages.com/images/P-488-488-90/15/1555/6P9DD00Z/posters/complaint-department.jpg\u0022 alt=\u0022complaint-department.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-02-08T14:52:40Z","Content":"\n\u003Cp\u003EI\u0027d like to see the \u0027average players\u0027 better defined in those graphs; Does it mean those who bought and own it, or those who played it that day, or those who are actively playing it at that moment the data was generated? That other graph, the Google trends graph, I believe is showing current hits/popularity on a search term at a given \u0027now\u0027 moment.\u003C/p\u003E\u003Cp\u003ELOL... where would KSP stand if \u0027relative strength\u0027 were calculated?\u003C/p\u003E\u003Cp\u003EAlso, cpast made mention about a change in the number of data points after various dates; Often historical values for such things get boiled down to an average - from hourly to daily to monthly.\u003C/p\u003E\n"},{"CreatedByName":"Fleb","CreatedById":63851,"CreatedDateTime":"2015-02-08T15:05:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022swiftgates24\u0022 data-cite=\u0022swiftgates24\u0022\u003E\u003Cdiv\u003EYep guys. KSP is dying. Close forums, uninstall from PC. The forums are empty, no one plays it on Steam. Devs have given up on it, there won\u0027t be any updates for awhile.\u003Cp\u003E/sarcasm\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh no! It can\u0027t be true! :.( \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rogvivi","CreatedById":125045,"CreatedDateTime":"2015-02-08T15:27:57Z","Content":"\n\u003Cp\u003EI played the ksp demo for the first time when the game was around 0.24, bought it right away. 10 minutes later I was already lurking these forums, amazed at the sheer amount of content and positivity, checking all the mods, youtube videos etc... I saw how in two releases the game went from early access to beta, then ??? , then 1.0. The game has this sheer amount of untapped potential, killing x64 killed some of it for me tho.\u003C/p\u003E\u003Cp\u003E I would say most people might, like me, believe that ksp isn\u0027t ready for 1.0 yet, so we wait and see. We know lot\u0027s of stuff will change for 1.0 so, Do I start a new career dealing with my mod list, my settings, my ram, my balance etc? Do I wait for 1.0, check how that turns out? And where do we go from there?\u003C/p\u003E\u003Cp\u003E All in all I\u0027d say the community is far from dying.\u003C/p\u003E\n"},{"CreatedByName":"KerBlam","CreatedById":134309,"CreatedDateTime":"2015-02-08T15:28:50Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EIs KSP \u003C/span\u003E\u003Cspan style=\u0022color:#ff0000;\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003Edead?\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://funnyasduck.net/wp-content/uploads/2014/03/funny-pictures-mouse-playing-dead-cat-animated-gif.gif\u0022 alt=\u0022funny-pictures-mouse-playing-dead-cat-animated-gif.gif\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-08T15:31:17Z\u0022 title=\u002202/08/2015 03:31  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 8, 2015\u003C/time\u003E by KerBlam\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2015-02-08T15:41:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://www.google.co.uk/trends/explore#q=%22kerbal\u002Bspace\u002Bprogram%22\u0022 rel=\u0022external nofollow\u0022\u003EMake of this what you will.\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt all depends on the search terms you use:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.google.co.uk/trends/explore#q=%22kerbal%20space%20program%22%2C%20ksp%2C%20%2Fm%2F0h68f9g\u0026amp;cmpt=q\u0026amp;tz=\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.google.co.uk/trends/explore#q=%22kerbal%20space%20program%22%2C%20ksp%2C%20%2Fm%2F0h68f9g\u0026amp;cmpt=q\u0026amp;tz=\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2015-02-08T16:40:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerBlam\u0022 data-cite=\u0022KerBlam\u0022\u003E\u003Cdiv\u003EI\u0027m relatively new here and I\u0027ve noticed this.. It\u0027s a bit of a shame. It is a game after all, we should all be having fun and making wack stuff that explodes other stuff and taking mad screenies and being rep-santa. \u003Cp\u003EMy favourite posts are the ones where someone has made some crazy contraption fly, or completed some insane mission, like the guy that drove around Eve... It inspires me to try other things. I don\u0027t particularly like these threads where it\u0027s \u0027SQUAD did something bad IMO\u0027 or \u0027Is KSP dead?\u0027... It\u0027s not very positive, and it\u0027s not at all inspirational.\u003C/p\u003E\u003Cp\u003EMods: Maybe there could be a sub-forum where people can have a whinge about SQUAD or KSP (and the rest of us can ignore it). \u003C/p\u003E\u003Cp\u003EIt could be called \u0027The place for super important opinions that really really matter\u0027 or something. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgc.allpostersimages.com/images/P-488-488-90/15/1555/6P9DD00Z/posters/complaint-department.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgc.allpostersimages.com/images/P-488-488-90/15/1555/6P9DD00Z/posters/complaint-department.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think maybe the quality of General Discussion has gone down a little because of arguments, but the rest of the forum still has a lot of vitality. For example, the Spacecraft Exchange is still turning out stuff that continues to amaze me.\u003C/p\u003E\n"},{"CreatedByName":"Fengist","CreatedById":78435,"CreatedDateTime":"2015-02-08T16:52:26Z","Content":"\n\u003Cp\u003EAs I have said in other posts, one of the biggest problems with KSP is once you conquer your latest idea, there\u0027s nothing more to do. Once you grasp the mechanics of landing on the Mun, doing so again is less challenging so you move on to bigger and more complex ideas. Once you conquer those, there\u0027s nothing to do until you come up with yet another idea. Here\u0027s a perfect example: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/105372-Eve-A-ground-based-circumnavigation-13-m-s\u0022 rel=\u0022external nofollow\u0022\u003EI recently circumnavigated Eve by land\u003C/a\u003E. Now that I\u0027ve finished, there\u0027s no further use for that vehicle. Eve is an amazing planet, but let\u0027s face it, it doesn\u0027t even have an anomaly. Other than conquering it\u0027s atmosphere, gravity and in my case, size, there\u0027s no reason to go there again and even less of a reason to go to any one particular place on Eve. \u003C/p\u003E\u003Cp\u003EGo look at the challenges forum. It\u0027s a collection of ideas to be conquered. Once you accept a challenge and conquer it, there\u0027s no reason to do it again unless you want to improve your performance. And those ideas have restrictions. In it\u0027s present form, KSP is a game of creation. While building a small colony on the Mun is within it\u0027s reach, building a Dyson Sphere is not. Because the game is limited by part count, in-game physics and what your machine can handle, there is a limit to the ideas you can come up with. \u003C/p\u003E\u003Cp\u003EIn it\u0027s latest incarnation, career mode did increase KSP\u0027s staying power for a while. But once you open the entire tech tree and realize the missions are just randomly repeating themselves, you\u0027ve conquered even that and there\u0027s no further reason to continue. Only one thing keeps veteran KSP players going and that\u0027s their imagination. Once the mechanics are conquered, they have to pretend this or pretend that in order to create a reason for playing KSP. One look at the mission reports forum and you\u0027ll see what it takes to keep playing KSP. While many KSP players have very vivid imaginations, let\u0027s face a fact here. Many of us, gave up pretending in our childhood.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe one thing lacking in KSP is long term playability.\u003C/strong\u003E KerBlam\u0027s post above with the image of the cat and mouse is an excellent example of what I\u0027m talking about. Once that cat caught the mouse and thot it dead, it had no further reason to chase it. When the cat realized the mouse was alive, the chase was on again. Humans are no different. It\u0027s not about the having, it\u0027s about the getting. Once we \u0027have\u0027 there\u0027s no reason to \u0027get\u0027 it again. And though I\u0027m hopeful of the upcoming resources release, unless there\u0027s something I\u0027m missing, even it doesn\u0027t create any long-term goals.\u003C/p\u003E\u003Cp\u003EWhile I don\u0027t have an answer, Squad needs to find a reason for players to keep going: a reason to build that Mun base and keep going back to it to expand, modify, update. As it is now, we build... and abandon. And if that reason isn\u0027t found, I fear it will be relegated to those of us creative enough to keep finding new ways to challenge ourselves.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2015-02-08T16:59:26Z","Content":"\n\u003Cp\u003EIs this topic still going? We\u0027ve established already that the interest fluctuations are consistent between versions and have an upward trend of increasing interest. People move on, and come back later. That\u0027s the nature of gaming, really. Trying to turn it into some sort of panic or make it out as something to worry about is making mountains out of molehills.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-02-08T17:53:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sporkafife\u0022 data-cite=\u0022sporkafife\u0022\u003E\u003Cdiv\u003EThe fact that the forums activity has mostly changed from \u0022look at this awesome thing I did\u0022 to \u0022let\u0027s split in half to bash/defend the latest decision by Squad\u0022 is probably why it doesn\u0027t seem to have as deep interaction any more.\u003C/div\u003E\u003C/blockquote\u003EThere have always been both types of posts, since I got here at least, and people have been complaining about/criticizing KSP since Harv first posted on the Orbiter forums about it (can you believe his original idea was 2d and that he thought the average player was too stupid to understand orbital mechanics? Look where it is now, be glad the people in that thread talked some sense into him.)\u003Cp\u003EThe community has grown, that\u0027s why your perception of \u0022camps\u0022 is heightened. More people to have an opinion. Also, as has been said, go check out the other forums here instead of GD, there\u0027s still plenty going on.\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2015-02-08T18:12:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EEarly-adopters will be predominantly geeks who find the new stuff earliest.\u003Cp\u003ESuch geeks will want to know how the system works, will practice all aspects of how it works now and watch the way it develops.\u003C/p\u003E\u003Cp\u003EThey work together, to develop findings and publish instructional or exceptional documents and videos.\u003C/p\u003E\u003Cp\u003E*At some point most programmes are handed-over to gamers instead of geeks.\u003C/p\u003E\u003Cp\u003E*They want defined progress, \u0027score\u0027, hand-holding and instant-gratification because games aren\u0027t meant to be hard work.\u003C/p\u003E\u003Cp\u003E*They work alone, post \u0022I WON THE GAME\u0022 documents and \u0022Let\u0027s play\u0022, look at me!, videos.\u003C/p\u003E\u003Cp\u003E*Gamers are a majority and pay a lot. That\u0027s why software companies make pretty explosions.\u003C/p\u003E\u003Cp\u003E*They move-on early, having \u0022WON\u0022 enough and seen all the explosions they want.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst: KSP is seriously geeky in itself and likely to attract more geeks than gamers even after launch.\u003C/p\u003E\u003Cp\u003ESome of Squads choices fall both ways:\u003C/p\u003E\u003Cp\u003EI\u0027m surprised by the \u0022No Steam Achievements\u0022. These seem tailor made for KSP (and are already backfitted under \u0022XP\u0022). Score one for the geeks.\u003C/p\u003E\u003Cp\u003EOn the other hand, Steam wants deltaV either to be a deep, dark, secret (or else have you compute them by hand). We\u0027ll see once the engineering report is included in 1.0\u003C/p\u003E\u003Cp\u003EHave you even *tried* the new career mode? They not only avoid hand-holding, they chop off your hands and won\u0027t let you upgrade back to andriod hands until you at least orbit Kerbin manually.\u003C/p\u003E\u003Cp\u003EDoes anybody here want *less* pretty explosions? It seems to be a direct contradiction between hand-holding, win-buttons, and pretty explosions. Keeping pretty explosions means they are at least doing something right.\u003C/p\u003E\u003Cp\u003ELastly, I think the \u0022gamers\u0022 are more likely to keep trudging on to put a flag on every planet/moon. The geeks might take their time playing with rocket designs, but it doesn\u0027t follow that they will spend more time with the game. They *are* more likely to mention it elsewhere and try to drum up support (because it is such a geeky game), but the time doesn\u0027t follow.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fengist\u0022 data-cite=\u0022Fengist\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EThe one thing lacking in KSP is long term playability.\u003C/strong\u003E KerBlam\u0027s post above with the image of the cat and mouse is an excellent example of what I\u0027m talking about. Once that cat caught the mouse and thot it dead, it had no further reason to chase it. When the cat realized the mouse was alive, the chase was on again. Humans are no different. It\u0027s not about the having, it\u0027s about the getting. Once we \u0027have\u0027 there\u0027s no reason to \u0027get\u0027 it again. And though I\u0027m hopeful of the upcoming resources release, unless there\u0027s something I\u0027m missing, even it doesn\u0027t create any long-term goals.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPart of the thrill of KSP is that you can always design a new rocket, although these posts show that geeks aren\u0027t going to play this game forever. I\u0027ve put off going to other planets partly because of release timing and contracts consuming my time and partly because of playing in the sandbox coming up with better rocket designs. For pretty much any (PC) game, I\u0027d look to the modding community for long term playability anyway. My guess is that nuturing colonies (possibly intersteller ones) will be the end-game for KSP.\u003C/p\u003E\u003Cp\u003EOh, and counter point:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLYu7z3I8tdEmjsTPxZMAsU8_d30ctM1Hm\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E Yes, Scott Manley has published 33 hours worth of youtube just of him playing a game of KSP. These aren\u0027t his tutorials, just a playthrough. Presumably he has enough followers (who watch 33 hours of him playing) to keep going.\n"},{"CreatedByName":"WOODY01","CreatedById":129358,"CreatedDateTime":"2015-02-08T18:49:26Z","Content":"\n\u003Cp\u003EThere is nothing unusual happening and nothing out of norm for an EA game.\u003C/p\u003E\u003Cp\u003EFor long time community members topics on game features being added or not is usually something worth discussing for them while others they have nothing else to add they have not already.\u003C/p\u003E\u003Cp\u003ELong term community members are most likely ready to take a break, lose interest in the game and the forums. Nothing out of the ordinary here or suggesting the KSP forum or game is dying.\u003C/p\u003E\u003Cp\u003EIt is within social norms for a people in a community like this and similar situations to grow apart or interact with each other less. We are not exactly good friends and family here, just people sharing an interest and discussing it on a faceless forum. \u003C/p\u003E\u003Cp\u003EAs for the Stats posted that is a sign of a game keeping players interest. Check out Steam Stats and compare the stats for successful games and unsucessful games. \u003C/p\u003E\u003Cp\u003EI purchased Sunless Sea in EA and the numbers during EA were lower than KSP\u0027s and the forums on the devs site and Steam were much less active. That game on release made it to Steam\u0027s top 5 in sales when released. The both forums for Sunless Sea would get a spike in activity when updates were released then of course dwindle. \u003C/p\u003E\u003Cp\u003EJudging by other games I have had with similar to difficulty and content likely to draw in an enthusiast(ex: Silent Hunter 3) this game and community have a long vibrant life ahead of it. We will get a large influx to this community when the game leaves EA, bringing new modders and other people who will become longtime community members.\u003C/p\u003E\u003Cp\u003EKSP has a long life ahead of it and it\u0027s death is not nigh\u003C/p\u003E\n"},{"CreatedByName":"DuoDex","CreatedById":107061,"CreatedDateTime":"2015-02-08T19:13:59Z","Content":"\n\u003Cp\u003EWelp, I feel like writing a wall of text now. I\u0027ve only been on the forums about a year, but I\u0027ve noticed what a lot of people have been saying. There\u0027s a big buildup in hype before the release, then a crash as everyone goes and plays KSP instead of coming on the forums. Then, the hype starts for the next release. Probably what\u0027ll happen with this release is because its a \u0022longer dev cycle\u0022 the downward trend will continue until it\u0027s just the regulars. (I consider myself a regular). Then we\u0027ll get a MASSIVE buildup in hype for 1.0 with the forums maybe even crashing.\u003C/p\u003E\u003Cp\u003EPlus, we\u0027re going up against an excessively large userbase here. When KSP was still 0.17 or so, the amount of traffic the forums get regularly now would have been huge. It\u0027s just that there\u0027s two groups-the regulars and the hypers. The hypers come on before release, but the regulars are already there. The only difference is that there used to be no hypers.\u003C/p\u003E\u003Cp\u003EHowever, some of the more overarching points people have made are valid as well. I liked how geeky the game was. It might just be me, but it seems to be much less so now. Squad has disgustingly decided to cater to the tastes of those \u0027gamers\u0027 drawn here by the lure of Beta instead of those who were here since 0.13 or whatever. (Been playing since 0.21 and proud of it!) KSP is not a game, it\u0027s an imperfect simulation that\u0027s fun to screw around in.\u003C/p\u003E\u003Cp\u003EBut let it be for better or for worse, KSP is not dying. It\u0027s just changing course like it has been since the very first public alpha. What makes people worried now is that it\u0027s changing course in a different way then it has been before.\u003C/p\u003E\n"},{"CreatedByName":"obi_juan","CreatedById":89945,"CreatedDateTime":"2015-02-08T19:35:03Z","Content":"\n\u003Cp\u003EI still playing some very old games:\u003C/p\u003E\u003Cp\u003ESid Meier\u0027s Alpha Centauri (1999)\u003C/p\u003E\u003Cp\u003EHomeworld (1999)\u003C/p\u003E\u003Cp\u003EHomeworld 2 (2004)\u003C/p\u003E\u003Cp\u003EAnd I know that I will play KSP for several years, because is a unique game... Will the community reduced by the time, yes I am sure of that... But I play to relax so I will play for several years.\u003C/p\u003E\u003Cp\u003EPS: Now I am waiting to Homeworld HD\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2015-02-08T19:58:56Z","Content":"\n\u003Cp\u003EKSP is still quite popular. While browsing game torrents on kickass I saw KSP 0.90 on the second page with over 900 seeds which is quite a lot. Athough it may be true that the community is becoming wider but less deep. I remember Kasuha being one of the most helpful people with innovative ideas and techniques but it seems he\u0027s no longer active. Neither am I actually, since I\u0027m experiencing my 2nd KSP burnout plus I\u0027m waiting for some mods to update and hopefully a better support of larger scale modding (i.e. solution tothe RAM problems). I\u0027ll probably go back to KSP in a few months.\u003C/p\u003E\n"}]}