{"TopicId":99259,"ForumId":32,"TopicTitle":"Engineers will calculate delta-V?","CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-02-10T07:06:57Z","PageNum":6,"Articles":[{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-02-10T20:03:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EBut you\u0027re not critiquing, or there\u0027s some critique but with a lot of Squad bashing on top, like when you explained that nukes in the game use two propellants because Squad are a bunch of ignorants, despite the .cfg explaining exactly why nukes are the way they\u0027re.\u003C/div\u003E\u003C/blockquote\u003EI was unaware of the comment. As for the rest of my criticism, I feel like I\u0027ve praised them as often as I\u0027ve criticized, you just simply prefer to see nothing but vitriol. I suppose it\u0027s the same with me and the \u0022fanboys\u0022; all I see is slavish praise, ignorance of and failure to offer actual criticism, and a desire to ruin a promising game by promoting arcadey elements and \u0022disaster simulation\u0022. Everyone blows these things out of proportion to support their own viewpoint (see below).\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EEvery time I see one of your posts, I expect some gratuitous Squad bashing, and honestly, that kind of \u0022critique\u0022 is the most easy to ignore.\u003C/div\u003E\u003C/blockquote\u003EThen ignore it.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EAlso, I don\u0027t think you\u0027re being fair with Harvester, I believe that the fact that this game has realistic orbital mechanics, instead of the starships-fly-like-planes mechanic like every other game has, shows that he isn\u0027t quite underestimating everybody\u0027s intelligence\u003C/div\u003E\u003C/blockquote\u003EPerhaps I am being a bit harsh on Harv, but that original post on the Orbiter forums, being upheld as a paragon of what KSP \u003Cem\u003Eshould be\u003C/em\u003E, kind of sticks with me. Not to mention that the base KSP paradigm of hiding information from the player just seems ... sadistic.\u003Cp\u003EI should also point out that there are definitely a few games out there that use realistic orbital mechanics, so your \u0022\u003Cstrong\u003Elike every other game\u003C/strong\u003E\u0022 statement is wrong.\u003C/p\u003E\u003Cp\u003EAlso, r_rolo1 hit the nail on the head.\u003C/p\u003E\u003Cp\u003EE: Anyway, on topic, I stand by my description of a mechanic tying delta-V readouts to pilot \u0022experience\u0022 as dumb, and I certainly hope Squad doesn\u0027t make a dumb decision to implement a dumb mechanic. It\u0027s a basic element of spaceflight, required information, and the fact that maneuver nodes show the delta-V required but fail to show the delta-V remaining is similarly dumb.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-10T20:07:29Z\u0022 title=\u002202/10/2015 08:07  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 10, 2015\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-02-10T20:06:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lincourtl\u0022 data-cite=\u0022lincourtl\u0022\u003E\u003Cdiv\u003EThe space shuttle was not capable of deploying its landing gear remotely; needed a human to do that. Even after the Columbia breakup, it still needed a human to connect an umbilical between two patch bays before it could be done remotely.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure that is true, but even if it is, replace Shuttle with Buran. Same point. I know that one flew unmanned.... even if it was once.\u003C/p\u003E\n"},{"CreatedByName":"FleetAdmiralJ","CreatedById":73364,"CreatedDateTime":"2015-02-10T20:06:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RobotsAndSpaceships\u0022 data-cite=\u0022RobotsAndSpaceships\u0022\u003E\u003Cdiv\u003E1. Fixing the tech tree, reducing the grind by adding better contract system, and adding more variety to it. \u003Cp\u003E2. No stable ones currently exist.\u003C/p\u003E\u003Cp\u003E3. I\u0027m talking about the original one that was presented to us by Squad\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1) I guess whether (and even how) the tech tree needs to be fixed is up to interpretation. I mean, in reality, most of the tech tree would already be \u0022discovered\u0022 before the Kerbals even launched into space if one is worried strictly about realism. It\u0027s not like we didn\u0027t know what batteries or ladders or wings were before the Mercury program. But then having half the tech tree unlocked from the start kind of defeats the purpose of having one in the first place. And of course, this doesn\u0027t mention the fact that I\u0027m sure many people have different ideas of how the tech tree could be changed.\u003C/p\u003E\u003Cp\u003ENow, one area I *MIGHT* agree with you on is making it easier to customize the tech three, or perhaps give different tech tree options at the start of the game. Although if one is talking about doing things mods haven\u0027t done, one could argue this has already been done with TechManager and the CTT\u003C/p\u003E\u003Cp\u003E2) So we\u0027re going from mods to \u0022stable\u0022 mods (however one defines that). So that begs the question, are/were there any mods on your previous list (KCT, asteroid mods, etc) that might not be exactly considered to be stable (but generally work)?\u003C/p\u003E\u003Cp\u003E3) I\u0027m not fully up on the old resources plan (I started playing right after all of that bru-ha-ha, apparently) though I did find this diagram: \u003Ca href=\u0022http://i.imgur.com/08hdJyj.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/08hdJyj.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhich seems more complex than my picture of Kethane or Karbonite admittedly. It also looks very complex, which I\u0027m sure many players would like. My brain was starting to melt looking at all the arrows, though. Though I suppose that doesn\u0027t say how it would have played implemented in the game. Of course, they shelved it because they felt that how it was turning out wasn\u0027t fun to play as well.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-02-10T20:12:04Z","Content":"\n\u003Cp\u003EAlright, folks, I think that\u0027s quite enough.\u003C/p\u003E\u003Cp\u003EBeing as it seems we\u0027re unable to keep an on-topic discussion going without veering wildly off-track, it\u0027s likely time to let this one sit for a while.\u003C/p\u003E\u003Cp\u003E/thread.\u003C/p\u003E\n"}]}