{"TopicId":99947,"ForumId":32,"TopicTitle":"Is ksp graphically outdated or on par.","CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2015-02-17T19:48:46Z","PageNum":5,"Articles":[{"CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2015-02-19T11:32:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ouion\u0022 data-cite=\u0022ouion\u0022\u003E\u003Cdiv\u003EI feel the graphics are kinda outdated as to other indie games like space engineers or The Forest. So is KSP graphically outdated or on par?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do not think KSP graphics are outdated. They are simple, I can agree on that, and they are not that bad, I do think they fit the \u0022Kerbal way\u0022 of the game nicely. Space Engineers graphics to be honest, are nothing special, sure they good for a block construction game, but then again it\u0027s not a Farcry or something like that. The Forest I never play it, saw some videos and...well... nothing amazing too, they are good for the game.\u003C/p\u003E\u003Cp\u003EIf you tell me, that KSP could be a bit better in terms of graphics, sure. We could have better textures, wind effects, clouds and stuff like that. But to be perfectly honest, I do hope Squad do not make the graphics a priority. For me the biggest priorities in the game are bug fixes (high priority!) and a stable 64bit.\u003C/p\u003E\u003Cp\u003EThe game is already slow and too much CPU dependent and memory dependent. Unity engine need to be better and take better advantage of the many stuff video cards can do today (and I am not even consider Windows 10 and DX 12)\u003C/p\u003E\u003Cp\u003ETo be honest, screw the graphics, get me better physics that make sense, fix the bugs, get the game stable for future updates and releases, then we can worry about graphics. We already saw that it is possible, there are mods out there that do amazing things, but when I have a PC that I can play graphical intense games in a \u0022good\u0022 way and KSP engine is so bad that when I get a few mods the frame rate drops like hell, then I say, no more graphical stuff to be nice, lets fix this problem. \u003C/p\u003E\u003Cp\u003EFor me the answer is 64bit version and Unity making a better management of resources. After all, in today\u0027s technology the CPU\u0027s of our PC\u0027s (do not matter if you using mac or linux or whatever) are less important then a a good video card. \u003C/p\u003E\u003Cp\u003EThe same PC build with a 1GB VRAM behaves one way. Put a 3 or 4GB VRAM card on the same PC and you have almost a 90% new PC.\u003C/p\u003E\u003Cp\u003EOf course a CPU is important, even more if games use that for advantage. Look for example Bioshock: the game looks great, it is a 64 bit game, great graphics and runs pretty well in this old PC with a HD7750 video card!\u003C/p\u003E\u003Cp\u003EIn contrast, KSP 32bits give me so much work to play that sometimes I just want to scream!!!!\u003C/p\u003E\u003Cp\u003EGame play, bug fixes, stable game first. Graphics latter...much latter... not in a hurry.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-19T11:35:56Z\u0022 title=\u002202/19/2015 11:35  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 19, 2015\u003C/time\u003E by Kar\u003C/strong\u003E\n\u003Cbr\u003EReason for editing? Because I wanted to. :P\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-02-19T12:23:44Z","Content":"\n\u003Cp\u003EI just can\u0060t play stock. It\u0060s too ugly.\u003C/p\u003E\u003Cp\u003EOutdated or not, the graphics need a lot of work before they can be considered ready for release IMHO.\u003C/p\u003E\u003Cp\u003EFor an idea of what would be OK I\u0060d suggest loading up EVE, Planetshine, distant object enhancement, and ambient light adjuster.\u003C/p\u003E\u003Cp\u003EAfter that try some of astronomers visual packs.\u003C/p\u003E\u003Cp\u003EOf course if you do that then your game is more likely to throw memory exceptions which is another topic entirely...\u003C/p\u003E\n"},{"CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2015-02-19T16:13:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EI just can\u0060t play stock. It\u0060s too ugly.\u003Cp\u003EOutdated or not, the graphics need a lot of work before they can be considered ready for release IMHO.\u003C/p\u003E\u003Cp\u003EFor an idea of what would be OK I\u0060d suggest loading up EVE, Planetshine, distant object enhancement, and ambient light adjuster.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStock isn\u0027t too ugly. It is simple. Like I said, game play, bug fixes and a stable 64bit is much more important.\u003C/p\u003E\u003Cp\u003EDo you want great graphics and crashes all the time or do you prefer the \u0022ugly\u0022 stock graphics and be able to play hours and hours with no loss of frame rate and no crashes?\u003C/p\u003E\u003Cp\u003EYou mention EVE Online. EVE Online do not have the capacity or the support that KSP have. EVE is around for over 10 years now and CCP is a solid company. I started playing EVE in 2003 and the graphics at that time were already very good, but been a MMO you had a lot of lag issues and in a system for example like Jita the game got so slow that was impossible to get into the system. \u003C/p\u003E\u003Cp\u003EToday EVE had a lot of changes in game play and in graphics, and even today you have issues of lag because of graphics and loss of frame rates when too much people flying around. Of course if you to null space is different.\u003C/p\u003E\u003Cp\u003ESquad is a small company and KSP is their first game. I think is commendable and amazing what Squad managed to pull for their first game. Even the Dev\u0027s already said they are learning while making KSP. They fix something or bring something new and more bugs appear. \u003C/p\u003E\u003Cp\u003ENow, of course I would love to see KSP with great graphics, stock parts with shinny textures, planets with storms, clouds, rain, etc. I would love to see the shores of KSC and see the sea waves hitting the shores, but to get to that point I think Squad needs to work in the game play itself and refine KSP to be stable. \u003C/p\u003E\u003Cp\u003ENext release they already gave us a few tips of what to come, more stuff into the game, new aerodynamic model and so on. \u003C/p\u003E\u003Cp\u003EI believe by the end of this year, maybe sooner, KSP will rock with new stuff, better stability and new graphics.\u003C/p\u003E\u003Cp\u003ELet them work slowly and well instead of rushing and make things worse or hard to fix. This is what happens with big companies like \u0022cough cough ea\u0022 that do not care about gaming itself or the players, the only thing they care about is to get that sequel number 4 or 5 of the same game before Christmas and collect huge paychecks. When we, the fanbase, get those games, then it is 1 year of patches and updates to fix things that should be fixed in the development of a game.\u003C/p\u003E\u003Cp\u003ERushing the real people that makes a game is the worst thing for us, not for a company, they just see numbers $$$, this also forces a cut in the creativity of many Dev\u0027s working for big companies. \u003C/p\u003E\u003Cp\u003EI am really glad Squad isn\u0027t like that.\u003C/p\u003E\u003Cp\u003ETo quote one of the greatest:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E When will Doom 3 be released ? - Some gaming reporter in a interview\u003Cp\u003E When it\u0027s ready to release - John Romero - ID Software \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-19T16:21:54Z\u0022 title=\u002202/19/2015 04:21  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 19, 2015\u003C/time\u003E by Kar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-02-19T16:36:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hary R\u0022 data-cite=\u0022Hary R\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs for the game engine... They are a lot of game out there on unity that are far more appealing graphically then KSP, Yes Unity can do way better:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve actually played Stranded Deep, and it\u0027s actually not all that stunning graphically, and is on a truly miniscule scale. It\u0027s really just you, a completely uncustomizable character (basically, two arms), about thirty models, some nice shader effects, some exploits, and a tiny tech tree. That\u0027s about it.\u003C/p\u003E\u003Cp\u003ECan\u0027t comment on the other game. Graphics looked kinda Borderlands-y...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kar\u0022 data-cite=\u0022Kar\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETo quote one of the greatest:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EWhen will Doom 3 be released ? - Some gaming reporter in a interview\u003C/p\u003E\u003Cp\u003EWhen it\u0027s ready to release - John Romero - ID Software \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDaikatana says hi. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hary R","CreatedById":111339,"CreatedDateTime":"2015-02-20T05:03:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Renegrade\u0022 data-cite=\u0022Renegrade\u0022\u003E\u003Cdiv\u003EI\u0027ve actually played Stranded Deep, and it\u0027s actually not all that stunning graphically, and is on a truly miniscule scale. It\u0027s really just you, a completely uncustomizable character (basically, two arms), about thirty models, some nice shader effects, some exploits, and a tiny tech tree. That\u0027s about it.\u003Cp\u003ECan\u0027t comment on the other game. Graphics looked kinda Borderlands-y...\u003C/p\u003E\u003Cp\u003EDaikatana says hi. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENever said it was stunning, I said unity can do better than what KSP have... with some work,(hey, I didn\u0027t say that it put KSP on a lower side of even Unity games either), but I admit Unity will never be something like say...cryengine or any other modern game engine. But still KSP with Unity can have better graphics.\u003C/p\u003E\u003Cp\u003EWell anyway, I didn\u0027t play any AAA game in a while so i don\u0027t even know what are the standard of game graphic now day... can\u0027t say my opinion even count...\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-20T07:21:25Z\u0022 title=\u002202/20/2015 07:21  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 20, 2015\u003C/time\u003E by Hary R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"samstarman5","CreatedById":12469,"CreatedDateTime":"2015-02-20T05:57:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MartGonzo\u0022 data-cite=\u0022MartGonzo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThat\u0027s easy to say when you\u0027ve played it extensively\u003C/p\u003E\u003Cp\u003Ewhat about people deciding whether to buy the game when it\u0027s released?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople looking only for pretty graphics are not going to enjoy KSP because they won\u0027t be able to wrap their minds around the actual mechanics.\u003C/p\u003E\u003Cp\u003EMaybe there is some touching up that can be done, and there is going to be more yet to come as far as aesthetics after 1.0 is released(or even with 1.0), but as KSP stands now for those who are able to enjoy the game and fathom getting a ship into Kerbin orbit, it looks just fine.\u003C/p\u003E\n"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-02-20T09:43:17Z","Content":"\n\u003Cp\u003EHonestly, I think the graphics are pretty good for a game as complicated as KSP, and I dont think it would matter much either, compared to gameplay, but that\u0027s just what I think.\u003C/p\u003E\n"},{"CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2015-02-20T10:14:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Columbia\u0022 data-cite=\u0022Columbia\u0022\u003E\u003Cdiv\u003EHonestly, I think the graphics are pretty good for a game as complicated as KSP, and I dont think it would matter much either, compared to gameplay, but that\u0027s just what I think.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly.\u003C/p\u003E\u003Cp\u003ELook for example the Call of Duty series. When it came out it had a huge success, then we saw 2,3,4,5,6,9999999 versions. With each version better graphics and little more content. Do not take me wrong, I like CoD, but lost my interest around the squeals 2 and 3. After that is more of the same.\u003C/p\u003E\u003Cp\u003EThere are many other examples out there, most games in th FPS style for example lose perspective on their content but hey, it is a new brand game with amazing graphics and explosions and so on. But what about the content?\u003C/p\u003E\u003Cp\u003EKSP for me, it is all about the game play, the mechanics of the game, and to be honest, the difficulty (even if I do not find it difficult cause I can understand the \u0022real\u0022 physics behind it) most people that are used to play space games (that I love btw) games like the X series (not the last on it sucks), Elite (now that one spent hours and hours playing on 80\u0027s) and so on. \u003C/p\u003E\u003Cp\u003ETalking about Elite, just see when Elite was released back in the 80\u0027s where people where making text base games, and these guys came with a game with a infinity space to explore, thousands of stations and a cheated \u00223D\u0022 looks. That game was in black and white, made of with lines with no textures and sold thousands of copies! Why? Because was amazing. Oh and it fit on a 720kb floppy disk! \u003C/p\u003E\u003Cp\u003EKSP graphics at this moment of development are more then enough for the game. I am much more concerned in bug fixes and better new content and more game play. I really do not care about graphics at this stage. \u003C/p\u003E\u003Cp\u003ELet Squad refine the game, probably add more content with expansions or DLC\u0027s or whatever they decide and then we can worry about the graphics. We already saw that is possible, there are mods that make KSP really amazing in terms of graphics, but at this time of development I do not think KSP can handle an increase of graphics before it gets stable enough for it.\u003C/p\u003E\u003Cp\u003EThe memory problems of KSP and the way KSP uses memory it\u0027s the major limitation for KSP.\u003C/p\u003E\n"},{"CreatedByName":"Yuming","CreatedById":57851,"CreatedDateTime":"2015-02-20T13:11:29Z","Content":"\n\u003Cp\u003EThe graphics are fine for me. I have a computer that pretends it\u0027s a toaster for any other game, and I have to run on min settings for those anyway. With KSP, I can play on decent settings as long as my ships do not get too large (or medium:P). I\u0027m a minimalist anyway.\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-02-20T15:13:56Z","Content":"\n\u003Cp\u003EKSP is a fun, cartoonish game and I think graphics fit that theme well for the most part. It would be weird if the graphics looked like whatever the most recent iteration of Modern Warfare is. \u003C/p\u003E\u003Cp\u003EThe only problem I have with KSP\u0027s appearance is the skybox. It is too bright and too low res and it just ends up being a major eyesore for me. It fails miserably at conveying the majesty of space. If that was fixed, I don\u0027t think I would have any complaints. I also wouldn\u0027t mind if the galaxy weren\u0027t perfectly aligned with Kerbin\u0027s equator. Ideally I would like it if they could do stars and planets \u0022Stellarium-style\u0022 so you could zoom in and have stars remain as points of light, but I imagine that would be quite a large task.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-02-20T15:34:55Z","Content":"\n\u003Cp\u003EKSP\u0027s graphics are sub-standard. The graphics don\u0027t need to be stunning, but right now they\u0027re really bland and uninspiring, completely \u0022un-majestic\u0022. Part of this is simply the size of the planets but they\u0027re still totally uninteresting from space or the ground; no clouds where appropriate, two or three color textures, lack of surface features, just ... bland.\u003C/p\u003E\u003Cp\u003EThere\u0027s a lot of stuff that stands out in the game, though, most especially bac9 and Porkjet\u0027s contributions. Would that everything were that high-quality and well-thought out.\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-02-20T15:42:33Z","Content":"\n\u003Cp\u003EEh, it\u0027s not that great. Graphics aren\u0027t what make a game, but it\u0027s a lost opportunity, considering space is really majestic and stuff.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.scientificamerican.com/sciam/cache/file/0A2C232A-1E73-497D-BBC990D98F9AD53B.jpg\u0022 alt=\u00220A2C232A-1E73-497D-BBC990D98F9AD53B.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EExploring the planets should look great, and visually stunning. Lucky for us, that\u0027s what mods are for.\u003C/p\u003E\u003Cp\u003EIt just goes to show that space is great though, even \u003Cem\u003Ewithout\u003C/em\u003E mods KSP still looks awe-inspiring in certain situations. Just look at the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24533-Show-off-your-awesome-KSP-pictures%21/page501\u0022 rel=\u0022external nofollow\u0022\u003E\u0022Show off your awesome KSP pictures\u0022\u003C/a\u003E thread for proof. While the atmospheric mods make KSP look so much cooler, it looks alright even with stock graphics, too. AND without melting my GPU.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TPe8cLm.jpg\u0022 alt=\u0022TPe8cLm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E(some mod parts)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KkapCbe.jpg\u0022 alt=\u0022KkapCbe.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BmiwnlD.png\u0022 alt=\u0022BmiwnlD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOf course, with realism and atmosphere mods, KSP looks \u003Cem\u003ESO\u003C/em\u003E much better. Just to provide a pic for comparison:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dQdbod7.png\u0022 alt=\u0022dQdbod7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow, say to me with a straight face that last one doesn\u0027t look so much more epic. Original KSP graphics are nice, but they \u003Cem\u003Ecannot\u003C/em\u003E hold a candle to all the expertly made mods out there. \u003C/p\u003E\u003Cp\u003Etl;dr space looks great and KSP looks meh\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-20T15:56:32Z\u0022 title=\u002202/20/2015 03:56  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 20, 2015\u003C/time\u003E by Norpo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-02-20T15:45:50Z","Content":"\n\u003Cp\u003EI just like to fantasize over the idea of a crossover between Space Engine and KSP. KSP2, anyone? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-02-20T16:10:58Z","Content":"\n\u003Cp\u003EThe graphics are passable for a game with such a massive scale, but I agree with everyone else that it does need a little bit of polish in terms of clouds, etc.\u003C/p\u003E\n"},{"CreatedByName":"Corw","CreatedById":7116,"CreatedDateTime":"2015-02-20T16:46:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norpo\u0022 data-cite=\u0022Norpo\u0022\u003E\u003Cdiv\u003EEh, it\u0027s not that great. Graphics aren\u0027t what make a game, but it\u0027s a lost opportunity, considering space is really majestic and stuff.\u003Cp\u003E\u003Ca href=\u0022http://www.scientificamerican.com/sciam/cache/file/0A2C232A-1E73-497D-BBC990D98F9AD53B.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.scientificamerican.com/sciam/cache/file/0A2C232A-1E73-497D-BBC990D98F9AD53B.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EExploring the planets should look great, and visually stunning. Lucky for us, that\u0027s what mods are for.\u003C/p\u003E\u003Cp\u003EIt just goes to show that space is great though, even \u003Cem\u003Ewithout\u003C/em\u003E mods KSP still looks awe-inspiring in certain situations. Just look at the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/24533-Show-off-your-awesome-KSP-pictures%21/page501\u0022 rel=\u0022external nofollow\u0022\u003E\u0022Show off your awesome KSP pictures\u0022\u003C/a\u003E thread for proof. While the atmospheric mods make KSP look so much cooler, it looks alright even with stock graphics, too. AND without melting my GPU.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/TPe8cLm.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/TPe8cLm.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(some mod parts)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/KkapCbe.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/KkapCbe.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/BmiwnlD.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/BmiwnlD.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOf course, with realism and atmosphere mods, KSP looks \u003Cem\u003ESO\u003C/em\u003E much better. Just to provide a pic for comparison:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/dQdbod7.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/dQdbod7.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENow, say to me with a straight face that last one doesn\u0027t look so much more epic. Original KSP graphics are nice, but they \u003Cem\u003Ecannot\u003C/em\u003E hold a candle to all the expertly made mods out there. \u003C/p\u003E\u003Cp\u003Etl;dr space looks great and KSP looks meh\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOnly problem is I can\u0027t see landing site from clouds \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-02-20T18:30:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norpo\u0022 data-cite=\u0022Norpo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.scientificamerican.com/sciam/cache/file/0A2C232A-1E73-497D-BBC990D98F9AD53B.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.scientificamerican.com/sciam/cache/file/0A2C232A-1E73-497D-BBC990D98F9AD53B.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe graphics in that game look terrible~ No HDR, no lens flares, no motion blur, and only an idiot director would even THINK of putting a color other than grey or brown in. What\u0027s that hideous blue orb on the horizon?? It\u0027s completely unrealistic! The only thing good about that is that the HUD is very subtle.\u003C/p\u003E\u003Cp\u003E/trollface\u003C/p\u003E\u003Cp\u003ESeriously though, the last one is very nice (especially the atmosphere on the horizon), although I actually prefer the stock sun. The stock sun may not be super realistic, but it looks nice. (and I think it\u0027s closer to the real sun than the one in the last shot - although I generally avoid looking at the damn thing. Evil daystar must die!)\u003C/p\u003E\u003Cp\u003EOf course, the reviewers would murder it. Has way too many colors that aren\u0027t grey or brown, and and it needs a 600-element lensflare to obstruct the screen. Also I seriously doubt it supports all the attachments necessary to make a gun a gun, like various types of grips, attachments, sights/acogs/scopes, and paint jobs. On the bright side, however, movie critics will like it, it has a nice \u003Ca href=\u0022http://theabyssgazes.blogspot.ca/2010/03/teal-and-orange-hollywood-please-stop.html\u0022 rel=\u0022external nofollow\u0022\u003Eteal/orange\u003C/a\u003E thing going there. \u003C/p\u003E\u003Cp\u003EHeh.\u003C/p\u003E\n"},{"CreatedByName":"A-Stax32","CreatedById":113992,"CreatedDateTime":"2015-02-20T18:46:28Z","Content":"\n\u003Cp\u003EAs far as indie games go ...\u003C/p\u003E\u003Cp\u003EAt least it\u0027s got better graphics than Minecraft! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EHonestly though, I do feel like KSP could have better graphics but I also think that its current state is good because for those who want amazing and very real graphics, there are mods out there that do that. Whereas for those who don\u0027t really mind the cartoony state of KSP or want to load their game up on other mods and can\u0027t afford to be using high memory visual mods KSP\u0027s graphics are fine.\u003C/p\u003E\n"},{"CreatedByName":"Barklight","CreatedById":57723,"CreatedDateTime":"2015-02-20T20:49:45Z","Content":"\n\u003Cp\u003EGiven the available tools, I think KSP\u0027s graphics are alright. Not bleeding edge, but they don\u0027t need to be. As mentioned before, a lot of community mods make the graphics options open up quite a bit and things can really start looking impressive. I could be surprised with a graphics overhaul on an update after 1.0, but I don\u0027t know if we\u0027ll see much on that front until the Unity engine itself which Squad uses is improved and (possibly) stabilized for x64, which would allow more memory utilization for more high resolution textures.\u003C/p\u003E\u003Cp\u003EDon\u0027t forget that to Squad, 1.0 means feature-complete. Not finished release. After 1.0, all of their intended mechanics are in the game and can be experienced by the players. That\u0027s when the polish and fine tuning really starts, since they will have more resources available as they move away from feature development and towards polishing their product and improving what they already have.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2015-02-20T21:13:45Z","Content":"\n\u003Cp\u003EMany of the games that have switched to unity 5 have had to adapt to the way it handles light differently and, in some cases, reworked assets to take better advantage of it.\u003C/p\u003E\u003Cp\u003EI don\u0027t see a graphics update occuring until U5 is implemented.\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-02-20T22:14:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thomas988\u0022 data-cite=\u0022Thomas988\u0022\u003E\u003Cdiv\u003EI just like to fantasize over the idea of a crossover between Space Engine and KSP. KSP2, anyone? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had that same idea a while back and made this: \u003Cimg src=\u0022http://i.imgur.com/p86gua6.jpg\u0022 alt=\u0022p86gua6.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-02-20T22:33:12Z","Content":"\n\u003Cp\u003EIf the current ugly skybox was replaced with a more realistic one (oinker\u0027s skybox), the game would look a lot better.\u003C/p\u003E\u003Cp\u003EThat, plus refurbished atmosphere (no need for resource eating clouds for now, but that awful white horizon can be changed) and better textures for some parts would make the game look a lot better. It\u0027s a small effort that would turn out great.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2015-02-20T22:49:24Z","Content":"\n\u003Cp\u003EI think what\u0027s needed most is a new skybox, more realistic planet textures (while retaining the cartoony charm) and optional clouds.\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2015-02-20T22:55:05Z","Content":"\n\u003Cp\u003ECouldn\u0027t agree more on the skybox, it\u0027s terrible.\u003C/p\u003E\u003Cp\u003EThe ground texture I think is pretty good now especially compared to the earlier versions, but that water.....\u003C/p\u003E\u003Cp\u003EThere\u0027s really no excuse for such awful tiling.\u003C/p\u003E\n"},{"CreatedByName":"skyace65","CreatedById":71431,"CreatedDateTime":"2015-02-20T23:10:54Z","Content":"\n\u003Cp\u003EI think the game looks fine. But some more terrain decoration would be great, and maybe some better lighting, but you\u0027d need to wait for unity 5 for that.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2015-02-21T01:00:15Z","Content":"\n\u003Cp\u003ENot sure if this counts, but they really need to fix water lag too.\u003C/p\u003E\n"}]}