{"TopicId":201759,"ForumId":107,"TopicTitle":"KAL-1000: How to make it play on every keypress?","CreatedByName":"eekee","CreatedById":211180,"CreatedDateTime":"2021-04-16T10:38:17Z","PageNum":1,"Articles":[{"CreatedByName":"eekee","CreatedById":211180,"CreatedDateTime":"2021-04-16T10:38:17Z","Content":"\n\u003Cp\u003E\nHere\u0027s a full description of the dead end I\u0027ve gotten into:\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m packing self-refuelling gear into Mk2 cargo bays. It\u0027s a big drill and a small converter; a combination I\u0027ve found to be useful in a different vehicle (with maximally-levelled crew). In the bays of a spaceplane in flight the drill has to sit horizontally, so it\u0027s mounted on a big hinge. I\u0027m trying to use KAL-1000 controllers to coordinate deployment and pack-away: bays opening and closing, hinge angle changing, and drill extending and retracting. Having got tired of doing simpler sequences (no hinge) manually, this is an obvious job for sequencers. Because I can\u0027t control drill deployment with analog tracks, I have two controllers: one to deploy, one to pack away. When I test this, each controller works fine the first time it\u0027s used. However, after first use, play position of each is stuck at the end position and it does not work.\n\u003C/p\u003E\n\u003Cp\u003E\nMy question is: How do I make a controller play from the beginning on every keypress?\n\u003C/p\u003E\n\u003Cp\u003E\nI tried to do it with another pair of controllers controlling the first pair and each other. It might work, but I\u0027m very confused now.\n\u003C/p\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2021-05-25T19:52:04Z","Content":"\n\u003Cp\u003E\nI guess you have set the action group to \u0022Play Sequence\u0022 of the KAL. Most people set their KAL play forward and the play position to the start of the sequence in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E (or \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E). So when the group is triggered the first time then the KAL play the sequence as expected. But then the play position is at the end of the sequence, and when the group is triggered again there is nothing to do because the KAL is already at the end of the sequence (and it is still set to play forward).\n\u003C/p\u003E\n\u003Cp\u003E\nLong story short: add \u0022Set Play Position to Start\u0022 to the action group(s), I guess that will solve your issue. (I would also add \u0022Set Play Direction to Forward\u0022, but that\u0027s just me.)\n\u003C/p\u003E\n"}]}