{"TopicId":107824,"ForumId":50,"TopicTitle":"Vocabulary!","CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2015-05-06T04:29:40Z","PageNum":1,"Articles":[{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2015-05-06T04:29:40Z","Content":"Hey guys! Doing a little thing on the side where I take some terms we use here on the forums and try to break them down for new users. When I first came here I had no clue what \u0022TWR\u0022 or \u0022Delta V\u0022 meant. Now I do though and I figured I would give back to the community by doing this series and post. So click the videos below, read the stuff and remember to like and subsribe to keep up with more KSP stuff on my channel in the future! \n\nAlso I\u0027m taking suggestions on things I might be able to explain to new comers to the game to help them out. Also, any feedback is welcome, please keep it constructive! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n**Delta V**\n\nWhat is Delta V? Delta comes from Latin meaning \u0022change of\u0022 or \u0022change in\u0022 V stands for velocity. Velocity is a direction, so an example of velocity is 2km/s East. Delta V represents your ability to go from 0km/s up to that 2km/s. \n\nBased off the engines thrust, and efficiency and also the amount of fuel, and weight of the craft at hand we can calculate the amount of \u0022delta v\u0022 \n\nSo if a craft has 2km/s of delta V, that basically means that it can go from 0km/s all the way up to a maximum speed of 2km/s assuming no speed is lost and the burn is perfect! \n\nWarning: 1st minute of video is rambling since my first video doing this.\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/e4eUp3K_rs8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n**Thrust-To-Weight-Ratio**\n\nThrust to weight ratio, or TWR. Weight is just a measure of the amount of gravity on an object, that\u0027s how we get our units of tons, and pounds. Your TWR is basically saying at the current weight of your craft and current strength of the engine we can cancel out x amount of gravity\u0027s influence over the craft.\n\nPicture the Saturn V rocket standing on a massive digital scale. Now lets say this rocket weighs in at 100 tons (just for ease) Lets also say that the Saturn V has a TWR of exactly 1. That means, that before it burns off any fuel, its engine will cancel out all gravity and that digital scale will say the rocket weighs nothing. Why? Because the engine has canceled gravity out. \n\nNow lets say the rocket still weighs 100 tons. This time the TWR is 0.50 that means that if the engine fires the digital scale will say 50 tons. Why? Because 0.50 (TWR) is half of 1, a TWR of 1 will cancel gravity. So half of 100 tons is 50 tons. \n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/wbY-HVvFmDU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E"}]}