{"TopicId":132880,"ForumId":50,"TopicTitle":"Building with FAR 101","CreatedByName":"SuicidalInsanity","CreatedById":143878,"CreatedDateTime":"2016-02-25T01:21:47Z","PageNum":1,"Articles":[{"CreatedByName":"SuicidalInsanity","CreatedById":143878,"CreatedDateTime":"2016-02-25T01:21:48Z","Content":"\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nBuilding with FAR 101 – Barebones Basics\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nFirst off, I\u0027\u0027d like to thank tetryds, both for advice and corrections he provided in the course of writing this tutorial, as well as the awesome \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/132564-ww2-bad-t-2-ww2-bda-ai-dogfight-tournament-open/\u0026amp;page=1\u0022\u003EBAD-T tournament\u003C/a\u003E he is running that led me to write this tutorial in the first place, that it might be of some use to those who want to enter but might not be familiar with FAR . With that out of the way, lets begin.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nFerram Aerospace research is a mod that aims to bring real-world aerodynamics and aerodynamic principles and mechanics to KSP. As a result, building an aircraft is now a bit more complex than in the rather more forgiving stock aero model, as planes must now be built to take into account various real-world aerodynamic design considerations. This will not be a comprehensive overview, it won\u0027t tell every trick in the book on how to make a competitive performance dogfighter, but it should adequately cover the basics sufficiently to build a successful subsonic aircraft that avoids plowing into the ground seconds after launch.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nLets start by building a basic airframe:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022muSu1b1.png\u0022 class=\u0022ipsImage\u0022 height=\u0022321\u0022 src=\u0022http://i.imgur.com/muSu1b1.png\u0022 width=\u0022748\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThis consists of a KAX D-25 radial engine, a structural fuselage, an inline cockpit, a liquid fuel tank, and a tail adapter.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nNow, before we add some wings, we should first know where the Center of Mass (CoM) is. This is important, as it will greatly affect wing placement and aircraft balance later on. On the sample craft, the CoM is here:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022mvyvaAi.png\u0022 class=\u0022ipsImage\u0022 height=\u0022294\u0022 src=\u0022http://i.imgur.com/mvyvaAi.png\u0022 width=\u0022726\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nAlso activated are the Center of Thrust and Center of Lift indicators. Now, the CoL indicator here looks different from stock; there\u0027s no arrow. In FAR, the CoL functions similarly, but not identically, to Stock. In stock, it indicated the net direction of lift provided by lift forces from the wings and other lift surfaces, in FAR, its simply the Aerodynamic Center. It can still be used to get a rough approximation of craft balance, but for learning precisely how a craft is balanced requires the FAR editor readouts, covered later.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nSo lets add some wings:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022NrJGKqk.png\u0022 class=\u0022ipsImage\u0022 height=\u0022360\u0022 src=\u0022http://i.imgur.com/NrJGKqk.png\u0022 width=\u0022732\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nWith wings on, it\u0027s looking more like a plane, but there\u0027s still some work to do. Control surfaces need to be added, and the plane balanced – as seen the CoL is slightly ahead of the CoM; this plane will want to pitch up, potentially leading to a stall and possibly crash. For a successful, easy to fly craft, the CoL should be behind the CoM, the aircraft should want to naturally pitch slightly downwards while in flight without control surfaces.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nTo correct the imbalance, there are a few available courses of action: The mass of the craft could be shifted forward, the wings moved farther back, or the empennage lengthened to shift the tailplanes back and offer better leverage on the craft once control surfaces are added.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nA quick craft re-arrangement later, and :\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u00227b95dG3.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/7b95dG3.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nA bit unorthodox, perhaps, but serviceable. The wings were moved back, and the structural fuselage behind the engine was moved to behind the fuel tank, which puts all the heavy things at the front of the craft. As a bonus, the main wings are now on the CoM, which will help with performance, as the main wing is the point the craft will want to pitch up or down; the closer the CoM is to this axis, the less leverage needed to affect pitch. Additionally, the main wing is also located on the fuel tank, which means as the craft files and the tank is drained of fuel, the overall CoM of the plane will more-or-less remain where it is. Knowing where the Dry and Wet CoM on the craft is good to know. If the CoM shifts too much as fuel is used up, it may result in the plane becoming unstable.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nTo control the aircraft, control surfaces are needed. Lets add some:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022JJ389aH.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/JJ389aH.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThe craft now has a pair of ailerons, a pair of elevators, and a rudder. The ailerons are located at the main wing tips, and provide Roll authority, the elevators are on the horizontal tailplane and will control Pitch, and the rudder on the vertical one will control Yaw. keep in mind the principle of leverage; ailerons/elevons (control surfaces that control both Roll and Pitch) that are located near the fuselage will be less effective at rolling the craft then if they were placed further down the wing, likewise, the further from the CoM the elevators are the more efficient they are at pitching the craft. Elevators placed inline with the CoM won\u0027t have any effect at all (i.e. if the ailerons in the picture were set to control pitch, they would have negligible effect due to how close to the CoM they are).. By default, a newly placed control surface will be set to respond to Pitch, Roll, and Yaw commands; while leaving control surface inputs default generally speaking won\u0027t keep you from flying, it may cause the craft to do weird things, since the rudder will be trying to pitch or roll the plane, the ailerons will be trying to adjust the craft\u0027s Yaw, and so forth. To adjust the control surface\u0027s inputs, right click on it to get a context menu:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u00226Ei4kIG.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/6Ei4kIG.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nStd. Ctrl is the control settings needed here. Flp/splr controls flap and spoiler settings, covered later, and curWingMass is how much the wing weighs, with Mass-Strengt... 1 is the wing/control surface structural strength, also covered later.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nClicking on the Std. Ctrl button opens a new menu:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022dvp6iwO.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/dvp6iwO.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nA few more options than in stock, no? Pitch %, Yaw %, and Roll % are pretty explanatory, these control that respective input. The 100 means that at present this surface will fully deploy in response to an input. This number can be changed from -100 to 100. having a Pitch at less than 100 means the surface will only deploy partially in response to an input, and a negative setting will have the surface deploy upside down, useful for things like front canards and so forth.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nAoA% is the Angle of Attack percent. Instead of reading a P/Y/R input, it reads the crafts current AoA while in flight, and dynamically deflects the surface in response to it. This can be set from 200 to -200; useful for things like wing slats or having a plane that could automatically pull out of a dive, that sort of thing.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nBrake Rudder sets if the control surface can be used for affecting Yaw like an A.I.R.B.R.A.K.E.S. part – perfect if you want to make a Ho-229 /B-2 type flying wing, this lets you maneuver without vertical rudders.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nCtrl Dflect is important. This determines, in degrees, how far a control surface deflects. The lower the number, the less deflection, and the slower the pitch/roll/yaw effect propagates in flight. Because FAR models aerodynamic stress failures, or in other words, too aggressive a maneuver and the wings rip off, being able to adjust the control surfaces so they don\u0027t result in a 15 G turn and Rapid Unplanned Disassembly of the craft is vital. The other, less immediately fatal thing adjusting Control Deflection will do is help prevent stalls from overaggressive maneuvering. Too much control authority for your elevators and you risk pitching the craft\u0027s AoA too far from prograde, resulting in at best higher drag, or worse, throwing the aircraft into a stall. A lifting surface stalls when its cL falls too low; in other words, when a lifting surface stalls, it drastically reduces the amount of lift it generates; too little lift, and the craft falls out of the sky.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nNow, what about the Flp/Splr setting? Lets take a look:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022BfIQEyV.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/BfIQEyV.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nClicking the Flap setting will designate the control surface as a Flap; flaps are useful for take off and landing, when extended, flaps provide greater lift at lower speed; they also cause more drag. Flaps shouldn\u0027t be extended much or at all in normal flight. When a control surface is a flap, extending/retracting can either be done via right click menu while in flight, or via action groups.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nClicking the spoiler button actives that surface as a spoiler. In KSP, spoilers are basically airbrakes; they are automatically added to the Brake action group, and when the brakes are activated, the spoiler will deploy. Be careful when placing spoilers; place a spoiler in the wrong place or upside down, and you may discover that rather than a brake it is instead acting like a flap or an elevon and affecting the craft\u0027s flight differently than intended.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nNow, lets talk about Mass-Strength. Mass strength adjusts both the mass and the strength of a wing. The stronger the wing, the more aerostress it can take before catastrophically failing. The slider goes from 0.05, for a wing that is basically made out of paper mache and prayers to 4.0 for a wing made out of adamantium. For a a spaceplane, a wing setting of 0.4 or so should generally be sufficient, for a subsonic stunt/sport craft doing acrobatics at low altitude, a higher wing strength is recommended, something like .6 or so for a light weight craft. Keep in mind, that a wing strength that works for turns at 100m/s might not be sufficient for puling out of a dive at 240 m/s. While there is nothing wrong with a higher wing strength, keep in mind that stronger wings are heavier; the standard Wing Connector A, with a strength of 0.05, weighs 15 kg, the same wing at 4.0 strength weighs 1237 kg!\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nWith a basic plane built (yes, it still needs things like landing gear, but those are unneeded for now), its time to see how well it will fly (theoretically). To do this, open up the FAR editor window in the SPH/VAB by clicking on the FAR icon in the toolbar. When this is done, it brings up this:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022cbAIVts.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/cbAIVts.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThis is the Flight analysis graph, which will display some information on the flight characteristics of the craft in various flight regimes. Currently here it is set to AoA analysis, which will show how the craft will handle at various angles of attack. It can also be set to show how the craft will perform at various mach numbers by clicking on the Switch to Mach Sweep button. The numbers at the bottom adjust the parameters to be tested. By default it is set to examine the craft from 0 to 25 degrees AoA, at an airspeed of mach 0.2\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThe side bar buttons are craft and environment settings. Want to know how the craft will fly on Laythe? Select it from the celestial bodies menu. You can also see how the craft will fly when flaps and/or spoilers on the craft are deployed. Lets see how the example craft will fare:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022XkWJcxd.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/XkWJcxd.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThe mach value has been adjusted to 0.35, (around 120m/s), and the upper AoA limit has been increased to 50 degrees. The graph displays a number of lines:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThe green line what the craft\u0027s lift/drag ratio is as the craft sweeps from 0-50degrees AoA. Looks like the craft will get the best lift for the lowest drag at around 5 degrees AoA.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThe Blue line is coefficient of Lift – how much raw lift does the craft generate. The blue line goes steadily up until about 35 degrees AoA, and then starts falling. As the line goes up, the more lift the craft is generating. The tip of the cL curve at 35 degrees is important, this is the point the craft will begin to stall.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThe red line is drag. As AoA increases, more wing surface area is exposed to oncoming air, generating more drag. Here, the line increases until about 40 deg. Of note is the area around the intersection of the red and blue lines. At 35 degrees, L/D increases slope slightly, and at 40 degrees it begins to plateau, combine that with the the correlating decrease in cL and it shows the aircraft stalling at 35 degrees and coming to a full stall at 40, pitching the aircraft that far up should be avoided. With stalls, main wings are the easiest to stall out, other lifting surfaces like tailplanes are a bit harder.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThe final line, the yellow line, is a measure of craft stability. The lower the line, the more the craft will want to return to a neutral state. Here it steadily goes down, looks like the craft will automatically recover from an AoA induced stall of the wings and bring the nose back down to a prograde vector. The value of the line factors into this; the steeper the slope of the line, the more aggressive the return to a neutral state. the more aggressive this movement, the higher the G force the airframe is subjected to, the more G\u0027s, the stronger the wings will need to be.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nThe second page of the FAR editor window that is important is the Data/Stability Derivatives. This page can be access from the drop down menu in the upper left currently reading Static Analysis going to it, and:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u00228X2fT6O.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/8X2fT6O.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nA bit scary and technical, isn\u0027t it? Lets walk through it. At the top there is a planet selector (again, if you want to know how the plane will do on Laythe/Duna/Eve, or for the suicidally insane, Jool). The next is altitude, in kilometers, from sea level. As atmospheric density and temperature change, so to does aero performance. The last is speed, in mach, for the same reason; higher mach results in different aerodynamic considerations and fun engineering challenges like dealing with the trans-sonic region supersonic drag, which won\u0027t be covered here. Lastly, flap/spoiler settings can be set.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nOn to the numbers. The Calculate Stability Derivitives button has already been clicked, so the stats have data to them. The first set of numbers at the top are technical data about the craft. Of note is the wing area, which can be used to determine the craft\u0027s wing loading. The higher the wing loading, the more mass per square meter the wing is supporting, and the stronger the wings have to be, but higher wing loading also means less drag. Lower wing loading means the craft has more drag, but is also potentially more maneuverable, dependent on control surface settings. Also of note is the level flight numbers,which tell the the chosen mach speed in m/s, AoA, and the coefficient of lift for level flight at the selected planet, altitude, and speed – in this case, the craft needs to have an AoA of ~2.4 degrees when flying at ~119m/s (the input mach 0.35) for level flight at sea level. The coefficient of Lift can also be used in conjunction with the static analysis graph, go back and look, and the cL of .157 shown here will correlate with the blue line on the graph.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nNext up are the Longitudinal and Lateral Derivatives, each of these reference a particular type of movement about an axis. These should be green, any numbers in red indicate the craft will exhibit an unwanted behavior, and the higher the green number, the less that particular kind of negative craft behavior is a concern. In particular, lets look at Mw. This number tells how much a craft will pitch up in neutral flight. The number is -.114, which means the craft will very slowly pitch down in normal fight, which is to be expected with the CoM head of the CoL. But what if we moved it?\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022de7SJM8.png\u0022 class=\u0022ipsImage\u0022 height=\u0022335\u0022 src=\u0022http://i.imgur.com/de7SJM8.png\u0022 width=\u0022685\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nLets see what happened:\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022QP8usBh.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/QP8usBh.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nMw is now red, with a value of 0.08. the craft will now want to pitch up in normal flight. It wont pitch up very fast, but it is still a motion that will have to be actively corrected through trimming the elevators or applying active inputs to them every so often.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nAs with higher numbers being good when green, higher numbers when red is bad, the higher the number, the worse the detrimental effect. When a number is red and very low, it isn\u0027t the end of the world, and can easily be corrected by the control authority the plane has. For numbers bigger than around 0.5 - 1.0, a redesign of the craft is suggested to reduce the number, or even better, make the value in question green. In many cases this will be minor tweaks to wing and control surface placement. In the case of large numbers (3.0 - 4.0 and above) major structural redesign will be necessary.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-25T01:38:23Z\u0022 title=\u002202/25/2016 01:38  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 25, 2016\u003C/time\u003E by SuicidalInsanity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Combatsmithen","CreatedById":146407,"CreatedDateTime":"2016-02-25T14:05:56Z","Content":"\n\u003Cp\u003E\nThanks! This should help me in BAD-T\n\u003C/p\u003E\n"},{"CreatedByName":"Rodhern","CreatedById":144074,"CreatedDateTime":"2016-03-20T20:55:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222428522\u0022 data-ipsquote-contentid=\u0022132880\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456363308\u0022 data-ipsquote-userid=\u0022143878\u0022 data-ipsquote-username=\u0022SuicidalInsanity\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/25/2016 at 2:21 AM, SuicidalInsanity said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nBuilding with FAR 101 – Barebones Basics\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n ... In particular, lets look at Mw. This number tells how much a craft will pitch up in neutral flight. The number is -.114, which means the craft will very slowly pitch down in normal fight, which is to be expected with the CoM head of the CoL. ...\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFirst, thank you for the tutorial. I hope you decide to write further installments. I could for one use a good AoA% example.\n\u003C/p\u003E\n\u003Cp\u003E\nSecondly, you current coverage is very appropriate for an \u0022101\u0022, so I do not want to try and \u0027correct\u0027 your information, I just want to add to it.\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, while the above statement about slowly pitching down in \u0027normal flight\u0027 is correct and appropriate in the given example, there is a potential gotcha. The pitfall has two important facets to it.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nMost people can agree what the yellow (CoM) ball means. If you read some of the FAR threads around you might notice that people have a lot more trouble defining the meaning of the blue (CoL) ball in FAR. I do not know what it means either, but I do know that not knowing sometimes causes me a few surprises.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Mw number is found on the derivatives tab because it is a derivative. That means it is a number describing the extent of an effect caused whenever the flight conditions change by a tiny bit. Ok, what I am trying to say is that while a negative Mw is good, fine, stable and all it may not necessarily imply that your plane exhibits a \u0027controls at neutral\u0027 pitch down force in regular cruise flight.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nTo illustrate the second bullet I created a (slightly contrived) counter example:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CruisePitch-Hangar.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.act-consult.net/Rodhern/Games/KSP/Temp1/CruisePitch-Hangar.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis plane the has the blue (CoL) ball behind the yellow (CoM) ball and a negative Mw. But because I tilted the front wings up by 5 degrees it will pitch up all by itself at regular speed (even more so at high speed and not so much at low speed).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022CruisePitch-Flight.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.act-consult.net/Rodhern/Games/KSP/Temp1/CruisePitch-Flight.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNotice how in regular cruise (in this case at 85 m/s at sea level) the control surfaces must be trimmed to keep the nose down (and by kept down I mean kept level).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-20T23:51:39Z\u0022 title=\u002203/20/2016 11:51  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 20, 2016\u003C/time\u003E by Rodhern\u003C/strong\u003E\n\u003Cbr\u003Eminor edit\n\u003C/span\u003E\n"},{"CreatedByName":"KerbonautInTraining","CreatedById":145373,"CreatedDateTime":"2016-03-21T19:17:32Z","Content":"\n\u003Cp\u003E\nIncreasing mass doesn\u0027t directly increase L/D, it increases the speed at which it will occur. \n\u003C/p\u003E\n\u003Cp\u003E\n(Source: My glider instructor)\n\u003C/p\u003E\n"},{"CreatedByName":"RunaDacino","CreatedById":233327,"CreatedDateTime":"2024-05-23T05:55:18Z","Content":"\n\u003Cp\u003E\nI\u0027m putting this here, necropost as it is, as I\u0027ve made the most striking discovery for high-performance/fighter design.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLeading edge flaps/slats/etc. If using procedural wings, put the control surfaces all along the leading edge of your wing. Don\u0027t have to be big, just use them as a replacement for your leading edge when neutral. Set all their control input to 0, set them as flaps and go wild.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLining my delta-winged V tail fighter\u0027s leading edge with leading edge flaps have reduced her landing speed from stalling out around 120 m/s to gently touching down at 60 m/s by allowing me to fly with a pretty high \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nI didn\u0027t realize how utterly critical they are to delta winged designs so - here you are!\n\u003C/p\u003E\n"}]}