{"TopicId":175014,"ForumId":50,"TopicTitle":"Stock Science Campaign With 1 Manned Mission (outside of LKO)","CreatedByName":"TheTripleAce3","CreatedById":188116,"CreatedDateTime":"2018-05-16T19:17:44Z","PageNum":1,"Articles":[{"CreatedByName":"TheTripleAce3","CreatedById":188116,"CreatedDateTime":"2018-05-16T19:17:44Z","Content":"\n\u003Cp\u003E\nThis is just how I do it, if I wanted to do it faster, I would\u0027ve gone manned more, and this is isn\u0027t really in detail but it is the easiest way I found to complete a science save.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Rush straight up the rocketry line (and get struts too, basic stuff) until you get 2.5m engines and corresponding fuel tanks.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Do a manned Minmus mission (even to just one biome if you want!)\n\u003C/p\u003E\n\u003Cp\u003E\n3. Unlock solar panels and 0.625m probes (Okto is best for early stuff until you get Okto2, which is the best tiny probe for Kerbnet purposes), along with batteries and make sure you have the HG-5 antenna.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Start launching a lot of probes with the following equipment: 2x Goo, 2x barometers, 2x Temperature gauges, and a small 1.25m fuel tank w/ Terrier engine on the lander (with obvious landing legs). Use Communotron 16S on first stage of rocket (it helps in my experience) and have an Experiment Storage unit on top of the probe core along with a deploy-able Communotron 16 (with partial transmissions on, use while HG-5 is extended) and land directly facing Kerbin, one at the poles (be careful to maintain signal!), and one at 135 degrees east. An orbiter with 4 HG-5 antennae will help for comms. This should net you enough science to get you the Accelerometer and RA-15 relay antenna after multiple missions and landings.\n\u003C/p\u003E\n\u003Cp\u003E\n5. Land a few more landers with RA-15 antenna on the Mun and prepare a Heavy Launch Vehicle (I used Twin-Boar for side boosters with 1 orange tank on top of each and a central Mainsail with 2 Orange tanks and a smaller 2.5M tank). You should also have a 1.25m fairing unlocked. Make three probes, one of which is a lander and 2 orbiters. Use HG-55 antenna with one RA-2 relay on the top node for the orbiters, while giving the lander an RA-15. Make a heavy lander with any core and a few parachutes and all available instruments aside from the Science jr..\n\u003C/p\u003E\n\u003Cp\u003E\n6. Launch to Eve, put one orbiter in extreme eccentric orbit of Eve (polar preferably) and one on a Gilly trajectory. Use up all fuel left in the booster to de-orbit the lander and prepare for entry (heatshields actually not required for this approach) and make sure you land w/ daylight and an orbiter overhead w/ connection to Kerbin (quicksaves are a good idea). By the time you land, your Gilly orbiter should be on its way to Gilly. Set up as high an orbit as possible and get whatever science you can. Gilly is just a bonus for this mission.\n\u003C/p\u003E\n\u003Cp\u003E\n7. You should now have enough science to get the Gravity Scanner or Atmospheric Analysis instrument. Incorporate Graviolis into your orbiters and launch some new probes to the Mun and Minmus with RA-15s, a Communotron 16, Experimental storage unit, and Surface Scanning Module (plus solar panels and batteries, obv). Get into extremely eccentric polar orbit of any planet you\u0027ve been to with at least one of these probes and start taking mass Gravioli scans. Transmit the scans back to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n8. Launch vehicle from #6 to Duna and repeat previous steps. Use LT-2 landing legs for lander. Send one orbiter to Ike polar orbit and one to Duna polar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n9. Repeat steps from #6 onward to get to Jool, Dres, and Eeloo. Graviolis and RA-100 antenna will need to be used for Jool mission but will provide coverage to almost any planet at most times.\n\u003C/p\u003E\n"}]}