{"TopicId":175158,"ForumId":50,"TopicTitle":"A noobs guide to building a rocket","CreatedByName":"Xd the great","CreatedById":188222,"CreatedDateTime":"2018-05-21T11:03:13Z","PageNum":1,"Articles":[{"CreatedByName":"Xd the great","CreatedById":188222,"CreatedDateTime":"2018-05-21T11:03:13Z","Content":"\n\u003Cp\u003E\nAs a new player, my rocket explodes. Every time. So i decided to write a guide to build a rocket that doesn\u0027t. So, lets start. Stuff to put on:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Command pod. A command pod is important to prevent your rocket from turning into a unguided missile.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Antenna. Vital for communication. Again, prevents kerbals from dying by getting hit with unguided missiles.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Fuel tanks. Carry fuel. No explanation needed.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Engines. Push stuff. Also a good source of explosion.\n\u003C/p\u003E\n\u003Cp\u003E\n5. Tail fins. Help stabilize your rocket. \n\u003C/p\u003E\n\u003Cp\u003E\n6. Decouplers. Dump used fuel tanks and engines away. Also useful for throwing kerbals overboard.\n\u003C/p\u003E\n\u003Cp\u003E\nStuff to note: As a beginner, try to build a rocket that works. Then try to get to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your rocket is not aerodynamically shaped, it is not worth launching it. Nosecomes are necessary.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your rocket does not look like a rocket, then your rocket is probably not a good rocket.\n\u003C/p\u003E\n\u003Cp\u003E\nCrashing into the launchpad is not advised. \n\u003C/p\u003E\n\u003Cp\u003E\nIf rocket does not launch, try MOAR BOOSTERS. More thrust is usually needed.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it still does not launch, try to use other types of engines. Note that solid rocket boosters use solid rocket fuel, jet engines need air and intakes, and some rocket engines are not designed to push stuff off the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nShould all else fails, find help. Preferably from a rocket scientist.\n\u003C/p\u003E\n"}]}