{"TopicId":187911,"ForumId":50,"TopicTitle":"The Illustrated Guide to Docking Redux","CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2019-09-01T13:24:08Z","PageNum":1,"Articles":[{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2019-09-01T13:24:08Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cu\u003E\u003Cstrong\u003EDisclaimer\u003C/strong\u003E\u003C/u\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is my interpretation of \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0022 rel=\u0022\u0022\u003E@Snark\u003C/a\u003E\u0027s \u003Ca href=\u0022https://web.archive.org/web/20151126132127/http://forum.kerbalspaceprogram.com/entries/3770-Illustrated-guide-to-docking\u0022 rel=\u0022external nofollow\u0022\u003E Illustrated guide to docking\u003C/a\u003E. A lot of this will be just copy\u0026amp;paste from his guide, not only the text but I\u0027ll also \u0022borrow\u0022 many of his illustrations. So you cannot really say that this is wholly my work. But I will give it some personal flavor (every one has a different way to rendezvous and dock) and will incorporate some of the new features, in particular the new orbit and approach information that was introduced in 1.7.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is work in progress! And it\u0027s taking me longer than I thought. But I\u0027ll get there...\u003Cbr\u003E\nEven though I\u0027ll appreciate useful comments and suggestions and may include them into this guide.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cu\u003E\u003Cstrong\u003EContents\u003C/strong\u003E\u003C/u\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI plan to group this guide into the following sections:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\n\u003Cstrong\u003ESetting up the Rendezvous\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nYou are in orbit somewhere, your target is in orbit somewhere else, and you want to meet it.\n\u003C/li\u003E\n\u003Cli\u003E\nThis is the part where you use maneuver nodes to arrange for your ship and the target to be in the same place at the same time, or at least as close as possible.\n\u003C/li\u003E\n\u003Cli\u003E\nCareful fiddling with the maneuver node will generally get you a rendezvous within a kilometer or so.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EFine-tuning and Finishing the Rendezvous \u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nThis involves making small burns as you approach the target, in the last few kilometers, so that your closest approach is zeroed in to a few dozen meters (from the kilometer-or-so you got in step 1).\n\u003C/li\u003E\n\u003Cli\u003E\nThis involves close observation of the navball and light touches on the throttle.\n\u003C/li\u003E\n\u003Cli\u003E\nThe final step is to kill your velocity relative to the target\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003E\u0022Lazy mode\u0022 Docking\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nYou have full control of both vehicles, and can rotate both around so that their docking ports face each other.\n\u003C/li\u003E\n\u003Cli\u003E\nUsing your \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters you make sure that the two docking ports hit each other face on at a survivable velocity.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EStandard Docking\u003C/strong\u003E\n\u003Cul\u003E\u003Cli\u003E\nYou cannot (or don\u0027t want to) rotate around you target.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cem\u003EYou still dock.... (Jaja, I\u0027m not done here...)\u003C/em\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cu\u003E\u003Cstrong\u003E1) Setting up the Rendezvous\u003C/strong\u003E\u003C/u\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ENavigation tool:\u003C/strong\u003E Maneuver nodes and map view\u003Cbr\u003E\u003Cstrong\u003EControl via:\u003C/strong\u003E Main engine and throttle\u003Cbr\u003E\u003Cbr\u003E\nThe first thing you have to do is to send your ship on a course that will put it and the target in the same place at the same time -- or, at least as close as you can get with maneuver nodes. The distance how close you need to get depends on where you are (how curved the space where you want to dock is(*)). A 5km encounter in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E may be too far away to successfully rendezvous, while a 5 km encounter in Keostationary orbit (2863.33 km above Kerbin) will pose no particular difficulty. In general getting an encounter that is closer than 1 km should be good enough.\u003Cbr\u003E\n(*) Yes, I\u0027m a physicist, space is curved, deal with it. Well, except maybe around Gilly, you can\u0027t really call \u003Cstrong\u003Ethat\u003C/strong\u003E curved. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 data-ratio=\u0022105.88\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022 width=\u002217\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nI\u0027m assuming here that you in fact have maneuver nodes (i.e. you\u0027ve unlocked them by upgrading Mission Control and the tracking station), and also that you\u0027re familiar with how to use them.\n\u003C/p\u003E\n\u003Cp\u003E\nSetting up a fairly good orbital rendezvous with maneuver nodes is actually a significant challenge, and if you\u0027re a new player just learning how to dock, there\u0027s a pretty good chance you may not have mastered \u0022orbital rendezvous with maneuver nodes\u0022 as a skill yet. \u003Cstrong\u003EThis guide is not really about setting up an orbital rendezvous!\u003C/strong\u003E That is a whole complex topic in its own right, and this guide is about docking rather than general orbital navigation. Having said that, I\u0027ll still present one way how this can be done. I\u0027ll use this method a lot, and I thought it makes for a better story.\n\u003C/p\u003E\n\u003Cp\u003E\nIn this guide we follow the voyage of \u003Cem\u003EAHS Minmus Big Miner\u003C/em\u003E. She isn\u0027t the prettiest ship in space, she doesn\u0027t have a fancy name, but she is a big piece of industrial equipment and can reliably haul 100 tons of ore into Kerbin Orbit. And here she is, in low Minmus orbit after just having filled her ore tanks on Minmus.\u003Cbr\u003E\u003Cimg alt=\u0022vcv44LT.png\u0022 class=\u0022ipsImage ipsAttachLink_image\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/vcv44LT.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nShe needs to deliver that ore to the refilling station in a 500 km orbit around Kerbin. On the way there she\u0027ll stop by a probe in orbit close to the station to practice docking.\n\u003C/p\u003E\n\u003Cp\u003E\nAs we can see below, just burning prograde at the right time would get her into a Kerbin orbit, but with a high inclination to the refilling station. By combining the prograde with a (anti-)normal burn she can reduce the relative inclination of the orbits by a great amount, without using any extra fuel:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00229XJJ4yB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 style=\u0022width:512px;height:auto;\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/9XJJ4yB.png\u0022\u003E\u003Cimg alt=\u0022Oc4rHxz.png\u0022 class=\u0022ipsImage ipsAttachLink_image\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 style=\u0022width:512px;height:288px;\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/Oc4rHxz.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBy burning normal or anti-normal at the node (here a normal burn at the descending node) that she encounters on the way to the periapsis, she can correct the plane of her orbit around Kerbin to be in the same plane as the target station.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022mcLLWEi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/mcLLWEi.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow that she is in an elliptical orbit in the same plane as her target that intersects the target orbit. By burning retrograde at the periapsis between the two intersection points (if you are coming from a lower orbit, burn prograde at the apoapsis) the time when she arrives a the second intersection point (after going though most of the orbit) can be changed by a large amount. So this time can be chosen so that she encounters the target at the point.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022biv00A1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221024\u0022 src=\u0022https://imgur.com/biv00A1.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNote: in order to reduce the relative speed at the intersect I first set the maneuver node to get to about the same orbit as the target, and then reduce the burn until I get that encounter.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore performing that burn I suggest to select the \u0022Approach Info\u0022 for the current orbit in the maneuver display. This updates in real time during the burn and allows one to fine tune the burn to get the best rendezvous.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002251AcN6h.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002281.82\u0022 height=\u0022768\u0022 width=\u0022939\u0022 src=\u0022https://imgur.com/51AcN6h.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E2) Fine-tuning and Finishing the Rendezvous \u003C/span\u003E\u003C/u\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cb\u003ENavigation tool: \u003C/b\u003ENavball and approach information\u003Cbr\u003E\u003Cb\u003EControl via:\u003C/b\u003E Main engine and throttle\u003Cbr\u003E\u003Cbr\u003E\nYour eventual goal is to coast to a stop so that you\u0027re parked right next to the target (as in, just a couple of dozen meters apart).\u003Cbr\u003E\u003Cbr\u003E\nChances are, however, that unless you\u0027re either super lucky or an ace at maneuver-nodes, the rendezvous that you set up in Step 1 above will only get you to within a few hundred meters at best-- perhaps a kilometer or two. You\u0027d like to be closer than that when you match velocities, since your final approach (using \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E) will be very slow, just centimeters per second, and you don\u0027t want to have to do that for a kilometer or more.\u003Cbr\u003E\u003Cbr\u003E\nSo the way to solve that is to make minor course adjustments with light touches on the throttle of your main engine, using the navball for guidance. Here\u0027s how:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003EFirst things first: Make sure navball is in \u0022target relative\u0022 mode\u003C/strong\u003E\u003C/span\u003E\u003Cbr\u003E\nOnce you get close to the target, you don\u0027t care what your orbital velocity is. You only care about your velocity relative to the target. Chances are, the navball is probably in \u0022Orbit\u0022 mode when you\u0027re in orbit (the game does that automatically, unless you\u0027ve manually tinkered with it).\u003Cbr\u003E\u003Cbr\u003E\nNormally, when you approach your target within 60 km, the navball will switch automatically to \u0022Target\u0022 mode instead of \u0022Orbit\u0022: this causes your prograde/retrograde markers to indicate your target-relative velocity rather than your orbital velocity, which is what you want. It looks like this (note the \u0022Orbit\u0022 or \u0022Target\u0022 indicator at the top of the navball):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aaSCILu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.12\u0022 height=\u0022392\u0022 width=\u0022631\u0022 src=\u0022https://imgur.com/aaSCILu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n...Typically, it will do this automatically for you and no action is required on your part. I only bring it up because it\u0027s \u003Ci\u003E\u003Cu\u003Epossible\u003C/u\u003E\u003C/i\u003E this might not happen, and you need to make sure that the navball is in \u0022Target\u0022 mode, or nothing after this point will make any sense. You can change the mode manually by clicking on the label. This will toggle the navball between Orbit, Surface, and Target modes.\u003Cbr\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cb\u003EWhy this fine-tuning step is needed\u003C/b\u003E\u003C/span\u003E\u003Cbr\u003E\nAs you get within several kilometers of your target, your navball will start to look something like this (again, make sure your navball is in \u003Ci\u003E\u003Cu\u003Etarget\u003C/u\u003E\u003C/i\u003E mode):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022bKLXwth.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002287.34\u0022 height=\u0022200\u0022 width=\u0022229\u0022 src=\u0022https://imgur.com/bKLXwth.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis looks pretty good: your target-\u003Cu\u003E\u003Ci\u003Erelative-velocity\u003C/i\u003E\u003C/u\u003E retrograde marker (yellow circle) is pretty close to your target-\u003Cu\u003E\u003Ci\u003Edirection\u003C/i\u003E\u003C/u\u003E retrograde marker (pink Y with dot in middle). The fact that these two are close together means that you are heading almost directly towards your target.\u003Cbr\u003E\u003Cbr\u003E\nHowever, the key word here is \u0022almost\u0022. If you just coast towards your target and do nothing, you\u0027ll see the target-direction retrograde marker slide farther and farther away from the velocity retrograde marker, like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022aThC6Du.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002222.12\u0022 height=\u0022194\u0022 width=\u0022877\u0022 src=\u0022https://imgur.com/aThC6Du.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s because you\u0027re not heading directly at the target. Unless you got super lucky (or are an ace) with the original maneuver node, your closest approach is likely to be at least several hundred meters away from the target. This means that without any course corrections, you\u0027re going to go past it, and it\u0027ll slide off the side of your navball in the same way that someone standing beside the road slides off to the side of your windshield as you drive past them.\u003Cbr\u003E\u003Cbr\u003E\nTherefore, you need to adjust your course when you get close by, so that you are sitting right next to your target (and not a kilometer away) when you come to a stop relative to it.\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EWhat to do\u003C/span\u003E\u003C/strong\u003E\u003Cbr\u003E\nWhen you get reasonably close to your rendezvous (say, when it\u0027s 1 minute away, which you can see in the map view when you mouse over the intercept marker), start the process.\u003Cbr\u003E\u003Cbr\u003E\nWhat you\u0027re trying to do is to move your velocity-retrograde marker so that it\u0027s precisely centered on your target-retrograde marker (i.e. so that you\u0027re heading directly at the target). To do this, start by lining up your navball so that your center-marker, velocity marker, and target marker are exactly lined up in a straight line, like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223OExovn.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002240.12\u0022 height=\u0022195\u0022 width=\u0022486\u0022 src=\u0022https://imgur.com/3OExovn.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNote that the yellow velocity-retrograde marker is exactly on a straight line in between the navball crosshairs and the pink target-retrograde marker.\u003Cbr\u003E\u003Cbr\u003E\nWhy do we do this? Well, \u003Cb\u003Efiring your engines \u0022pushes\u0022 the velocity retrograde marker away from the center crosshairs on the navball.\u003C/b\u003E Since what we want to do is move the velocity marker onto the target marker, then by lining the navball up this way, it will \u0022push\u0022 the velocity-retrograde marker in the direction we want it to go.\u003Cbr\u003E\u003Cbr\u003E\nOnce you\u0027ve got it lined up, gently throttle up to move the marker. How much throttle you need will depend on your ship\u0027s \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E and how big your target-relative velocity is. So just keep a careful eye on the navball, gently throttle up, and be ready to kill the throttle immediately when things line up.\u003Cbr\u003E\u003Cbr\u003E\nAs your engine burns, you will see the velocity-retrograde marker drift towards the target-retrograde marker, like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Ij8Wl0w.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022221.28\u0022 height=\u0022416\u0022 width=\u0022188\u0022 src=\u0022https://imgur.com/Ij8Wl0w.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen the two markers line up perfectly, cut throttle. (Don\u0027t worry if it\u0027s not pixel-perfect; all that matters is that it\u0027s better than it was. If you\u0027re off by a smidgeon, what will happen is that as you get closer to the target, the two markers will drift apart again, and you can do this correction maneuver again. Repeat as needed.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-09-03T16:04:06Z\u0022 title=\u002209/03/2019 04:04  PM\u0022 data-short=\u00224 yr\u0022\u003ESeptember 3, 2019\u003C/time\u003E by AHHans\u003C/strong\u003E\n\u003C/span\u003E\n"}]}