{"TopicId":206521,"ForumId":50,"TopicTitle":"How to reach geostationary orbit over any longitude","CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-20T21:04:26Z","PageNum":1,"Articles":[{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-01-20T21:04:26Z","Content":"\n\u003Cp\u003E\nNote- this guide is talking about geostationary orbit over Earth, not Kerbin; however the same technique can be applied using Kerbin\u0027s faster rotation time and shorter sidereal day in the same way.\n\u003C/p\u003E\n\u003Cp\u003E\nStep 1: Reach low Earth orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nStep 2: Plot a node to boost your apoapsis to geostationary altitude (~35793km according to the RP-1 geostationary satellite contracts) at your nearest ascending or descending node. If your launch site is in the northern hemisphere you\u0027ll want the descending node, and vice versa.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Cgm4nWh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002261.09\u0022 height=\u0022471\u0022 width=\u0022771\u0022 src=\u0022https://i.imgur.com/Cgm4nWh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStep 3: Find your target longitude on the surface. If you have a contract to put a GEO sat over a specific point, there should be a waypoint for that contract visible on the map; if you can\u0027t see it, try using the Waypoint Manager mod to make it visible. If you don\u0027t have a contract but want the satellite to have a specific longitude, try adding a waypoint (again, Waypoint Manager helps with this) or just pick a recognisable feature on the surface and aim for that.\n\u003C/p\u003E\n\u003Cp\u003E\nStep 4: Look at your time to apoapsis. Typically this will be in the 5 to 6 hour range and will vary depending on your initial parking orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nStep 5: In map view, position the camera so that you\u0027re looking down on Earth from above the north pole, with your apoapsis at the top of the screen. Imagine a clock face superimposed on the Earth, the apoapsis is at 12 o\u0027clock and the periapsis at 6 o\u0027clock. Earth rotates on its axis once every 24 hours*, so it takes two hours for any point on the surface to move one clock face number anticlockwise (e.g. from 5 to 4). With this in mind, you can use the current position of the target longitude to calculate where it will be when you reach apoapsis. If it happens to be right underneath you, great, but usually it won\u0027t be. In this example, the target longitude was directly underneath the point where the geostationary transfer burn occurred, so it\u0027s at 6 o\u0027clock; if it takes 6 hours to reach apoapsis, the target point will now be at 3 o\u0027clock as shown.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022owinHuZ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002261.09\u0022 height=\u0022471\u0022 width=\u0022771\u0022 src=\u0022https://i.imgur.com/owinHuZ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStep 6: Plot two burns- one to set your inclination to zero and another to circularise immediately afterwards (if using MechJeb to plot the nodes, use the \u0027after a fixed time\u0027 option on the second burn and set the time to 0 seconds), then combine the two nodes using MechJeb\u0027s node editor (other mods are available, but I\u0027m assuming you already have MechJeb installed for its Primer Vector Guidance launch controller) into a single node that does both the inclination and periapsis changes in one go. DO NOT EXECUTE THIS NODE.\n\u003C/p\u003E\n\u003Cp\u003E\nStep 7: Calculate a resonant orbit. Regardless of where your target point is, set the denominator to 24 (the default in \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E node planner is 2/3, change the 3 to 24). If your target point is ahead of your apoapsis (i.e. from 6 up to 12 on the clock face) it\u0027s pretty simple: starting at 24, subtract 2 hours for every clock face number the target point is ahead of you and use that as the numerator (e.g. if the target point is at 9 o\u0027clock, you want 18/24 as your resonant orbit setting); if the target point is behind you (i.e. from 12 up to 6) then things are a bit harder- there\u0027s a hard limit on resonant orbits which is set by the size of the Earth, anything below 10/24 is likely to crash into the atmosphere or the planet. If the target is really close behind you, it might be feasible to boost up higher than geostationary orbit to let the target point catch up to you, but this costs even more delta-V and so isn\u0027t a particularly good option.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the above example the target point is at 3 o\u0027clock, unreachable with a single resonant orbit. Instead, calculate a resonant orbit that will get you into position over several orbits- in this case try 18/24 and wait three orbits, like so:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dNVyJW9.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002261.09\u0022 height=\u0022471\u0022 width=\u0022771\u0022 src=\u0022https://i.imgur.com/dNVyJW9.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nStep 8: Once you\u0027ve calculated the resonant orbit, merge that into the combined circularisation/plane change burn, and execute it.\n\u003C/p\u003E\n\u003Cp\u003E\nStep 9: Circularise when the target point is below your apoapsis.\n\u003C/p\u003E\n\u003Cp\u003E\nBy waiting for a few orbits, the target point ends up right underneath the apoapsis and circularisation can occur. Keep in mind that circularising and changing inclination at the same time is the most efficient way of doing things in terms of delta-V as it minimises the cosine losses of the large plane change burn by combining it with as much prograde as possible; doing the two separately will require a lot more fuel and the further from circular you go with your resonant orbit, the more fuel you\u0027ll need. Conversely, you can do a resonant orbit that\u0027s much closer to circular, taking longer but saving some fuel in the process- not recommended if you don\u0027t have solar panels on board!\n\u003C/p\u003E\n\u003Cp\u003E\nThe same system can be applied to Kerbin. but remember that the geostationary altitude is much lower at 2863.33km and the sidereal day is much shorter at 5h 59m 9s, so your target point will move two numbers anticlockwise for every hour that passes.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother advantage to using resonant orbits like this is that you can deploy a series of satellites and space them out evenly: just release one satellite every time you come to your apoapsis and circularise its orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"Phileraene","CreatedById":196250,"CreatedDateTime":"2022-11-09T09:36:35Z","Content":"\n\u003Cp\u003E\nJust WOH! The perfect article to resolve my issue. Big thanks to you \n\u003C/p\u003E\n"},{"CreatedByName":"Phileraene","CreatedById":196250,"CreatedDateTime":"2022-11-09T21:21:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224197059\u0022 data-ipsquote-contentid=\u0022206521\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221667986595\u0022 data-ipsquote-userid=\u0022196250\u0022 data-ipsquote-username=\u0022Phileraene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Phileraene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust WOH! The perfect article to resolve my issue. Big thanks to you \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell it works like you said. But the mission parameters states both \u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003E\u003Cspan\u003E a \u003C/span\u003Etarget longitude and an orbital period between 23h54 and 23h58 and keep this 6 days. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003ESo when i am at the target longitude, i have an orbital period of 1 day (failed) Or i leave quickly the target longitude because my orbital period is lesser than a earth revolution. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003ESo i miss something or the mission is screwed.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Phileraene","CreatedById":196250,"CreatedDateTime":"2022-11-09T21:36:29Z","Content":"\n\u003Cp\u003E\nMy bad, i need only to be at the \u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003Etarget longitude with correct orbital period one time to satisfy the mission parameters. I do not need to keep both during 6 days.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003EThanks again for your topics!! \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-11-10T09:02:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224197256\u0022 data-ipsquote-contentid=\u0022206521\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221668028885\u0022 data-ipsquote-userid=\u0022196250\u0022 data-ipsquote-username=\u0022Phileraene\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, Phileraene said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell it works like you said. But the mission parameters states both \u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003E\u003Cspan\u003E a \u003C/span\u003Etarget longitude and an orbital period between 23h54 and 23h58 and keep this 6 days. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003ESo when i am at the target longitude, i have an orbital period of 1 day (failed) Or i leave quickly the target longitude because my orbital period is lesser than a earth revolution. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003ESo i miss something or the mission is screwed.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGeosynchronous Earth orbit is 23h 56m 9s I believe, so just match your orbital period to that and you’ll be fine. Geostationary contracts (at least in RP-1 when I did them) tend to be pretty lenient when it comes to matching the longitude so as long as you’re vaguely in the right place it should be enough.\n\u003C/p\u003E\n"}]}