{"TopicId":211239,"ForumId":50,"TopicTitle":"The Juno Jumper, or How to Complete Early Game High-Altitude Contracts without Rocket Engines or Advanced Parts","CreatedByName":"Juno_Atlas_Saturn","CreatedById":222975,"CreatedDateTime":"2022-12-30T09:46:52Z","PageNum":1,"Articles":[{"CreatedByName":"Juno_Atlas_Saturn","CreatedById":222975,"CreatedDateTime":"2022-12-30T09:46:52Z","Content":"\n\u003Cp\u003E\nFor those early career high-altitude survey contracts, I, like many of you, have traditionally opted for a combination jet engine/rocket engine plane, where the jet engine gets me to the contract location and I then jump to the necessary high altitude using the rocket. It gets the job done, but it\u0027s tough to meet early game weight and part count limits, the craft is often limited in range, cruising speed, and number of high-altitude jumps, and I\u0027m eager to ditch the whole design as soon as I unlock new tech nodes (especially the Panther).\n\u003C/p\u003E\n\u003Cp\u003E\nWhat if I told you there was a different way to fulfill those contracts, where all you need is...drumroll...curtains parting...the Juno?\n\u003C/p\u003E\n\u003Cp\u003E\nThough Junos are generally low thrust, low altitude engines, they\u0027re actually pretty capable when you use a bunch of them on a lightweight aircraft to get a high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E. Using only four, I managed to get a craft to 1.5-2 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E depending on fuel level, which was enough to reach a 600\u002Bm/s cruising speed, 630\u002Bm/s max speed (see second image below of the plane descending from cruise in preparation for a jump), and a max altitude of over 20km per jump (see third image below).\n\u003C/p\u003E\n\u003Cp\u003E\nBecause it can cruise at over 10km and 600m/s, it\u0027s actually got a pretty big range as well, and if I need to reach a faraway target I can load up the Mk1 fuel tank (see image below), and by the time it arrives at the jump point it will have used enough fuel to get the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E back up to the level where it can support a high-altitude jump. \n\u003C/p\u003E\n\u003Cp\u003E\nSome notes on the design (see first image below):\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThis design uses well under 30 parts (so you can customize with the science parts of your choice), meets all early game runway/hangar limits, and doesn\u0027t use anything beyond tech level four.\n\u003C/li\u003E\n\u003Cli\u003E\nI experimented with using a longer tail/traditional front wing/rear tail body design to minimize the risk of flipping, but any gains in stability were offset by a lower max speed and more limited turning ability that prevented me from going fully vertical in the jump, and ultimately limited the plane\u0027s max altitude too much.\n\u003C/li\u003E\n\u003Cli\u003E\nThe engines are placed as far forward as I can without limiting a pilot\u0027s ability to exit the craft, and the rear wings are as far back as I felt comfortable with, which enabled me to nudge the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E behind the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E. The \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E is even more forward when the Mk1 tank is completely full, but I rarely keep it full so I can maintain a high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E. In general, having the \u003Cabbr title=\u0022Center of Lift\u0022\u003ECOL\u003C/abbr\u003E really close to the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E provides maneuverability that helps in transitioning from supersonic horizontal flight to a vertical high-altitude climb, and in any event the plane doesn\u0027t really have a flipping problem.\n\u003C/li\u003E\n\u003Cli\u003E\nControl Surfaces - I limited all of the control surfaces (especially roll) below their defaults, because otherwise the plane can be a bit twitchy at high speeds. I also recommend using fine controls for most if not all of the flight.\n\u003C/li\u003E\n\u003Cli\u003E\nI experimented with increasing the \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAOA\u003C/abbr\u003E of the rear wings to squeeze out a little more efficiency while cruising, but the plane kept flipping on takeoff. Leaving the wings horizontal eliminated the issue, and the plane is surprisingly efficient as is.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nFlight Tips:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nBe gentle when pulling up to take-off! The plane isn\u0027t particularly flip-happy, but the only time it would happen is when I pulled back too hard during takeoff. This thing builds up speed really quickly, so you should be able to nudge it into the air with relative ease.\n\u003C/li\u003E\n\u003Cli\u003E\nTo repeat what was stated in the design tips: consider using fine controls for most/all of the flight.\n\u003C/li\u003E\n\u003Cli\u003E\nUse the lower atmosphere to build up speed. I shoot for an \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAOA\u003C/abbr\u003E of no more than 10 degrees until I reach 5-6km in altitude, and then 5 degrees or lower until I\u0027ve reached around 600m/s and between 8.5-10.5km cruising altitude. I can usually get a fuel usage rate of .08 units per second or lower (visible in the resource app) under those cruising conditions.\n\u003C/li\u003E\n\u003Cli\u003E\nOnce you approach the target location, descend slightly to max out your speed (I usually get around 630m/s), and then gradually (I can\u0027t emphasize enough that it has to be gradual) raise the nose of your craft until you\u0027re fully vertical at around 18km- you should be able to hit 20km in altitude like this, which should be sufficient for most high-altitude Kerbin survey contracts.\n\u003C/li\u003E\n\u003Cli\u003E\nThe turn needs to be gradual; you\u0027re looking to convert horizontal speed to vertical speed, not rapidly dump speed/raise drag with a sudden attitude change. Keep an eye on your speed and g force meters. If your speed is jumping down rather than slowly descending, or if you encounter any high g forces, you\u0027re probably wasting energy, and your max altitude will be lower.\n\u003C/li\u003E\n\u003Cli\u003E\nUnlike rocket plane jumpers, where you try to go vertical as quickly as possible to make the most efficient use of your limited oxidizer, don\u0027t go fully vertical too quickly. You can only raise your apoapsis if the Juno is thrusting, so until you reach 18km keep shy of full vertical so you can squeeze out a few more seconds of thrust while climbing, or at least until your apoapsis display shows that you\u0027ve exceeded your target height for the jump. Once your engines flame out, go full vertical to maximize the use your remaining airspeed which should nudge that apoapsis a teeny bit higher before it starts coming down due to drag.\n\u003C/li\u003E\n\u003Cli\u003E\nLanding: This plane handles just fine at 50m/s or below. When coming in for a landing I often have the throttle at about the 1/6 mark, which gives me just enough speed to get into position without needing to land at high speed. As an early-game craft, there are no airbrakes/reverse thrust capabilities, so you\u0027ll have to bleed off speed by maneuvering alone (from 600m/s to just over 100m/s) when approaching the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and then using the rear landing gear brakes only (there\u0027s no brakes for the front wheel). I haven\u0027t needed to deploy ailerons to improve low-speed handling but that\u0027s always an option.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nAs you unlock more tech nodes/higher \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E levels, you can add more Junos, streamline the landing gear/wings, or make other improvements, but even without those this is a really capable plane that you can continue to use into the mid-game for as long as you continue to get Kerbin altitude survey contracts. Not only does it save you the need for a full redesign as the game progresses, but since it travels at 600m/s, these survey missions go by faster and feel a lot less tedious. There\u0027s still a place for combo jet engine/rocket planes, especially for part testing contracts where you\u0027re looking to reach far beyond 20km, as well as eventual SSTOS, but sometimes MOAR JETS on a lightweight body is all you need. I\u0027ve written a bunch in this post, but the main takeaway is \u003Cu\u003Emanaging your \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E can squeeze a lot of performance out of seemingly unimpressive plane engines and parts\u003C/u\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/a/JQOxzXc\u0022 rel=\u0022external nofollow\u0022\u003ELink to full Imgur page with picture annotations\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fnJVLPS.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002260.00\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fnJVLPS.png\u0022\u003E\u003Cimg alt=\u0022Mu7Kqur.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/Mu7Kqur.png\u0022\u003E\u003Cimg alt=\u0022NH3Nrd1.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002264.00\u0022 height=\u0022674\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NH3Nrd1.png\u0022\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}