{"TopicId":25169,"ForumId":50,"TopicTitle":"[Tutorial - Step-by-step] Interplanetary Hohmann transfer guide and tips","CreatedByName":"voneiden","CreatedById":38803,"CreatedDateTime":"2013-05-02T19:47:48Z","PageNum":1,"Articles":[{"CreatedByName":"voneiden","CreatedById":38803,"CreatedDateTime":"2013-05-02T19:47:48Z","Content":"\n\u003Cp\u003EHowdy folks,\u003C/p\u003E\u003Cp\u003EI\u0027ve been gone for a while and I noticed my account lost all messages except the very first one I wrote, heh heh. I had an interplanetary Hohmann transfer guide written about one month ago, which I\u0027ll be restoring here as soon as possible.\u003C/p\u003E\u003Cp\u003EI\u0027ll be doing some proper formatting, for now it\u0027s just almost copy and paste from \u003Ca href=\u0022https://webcache.googleusercontent.com/search?q=cache%3Aforum.kerbalspaceprogram.com%2Farchive%2Findex.php%2Ft-48862.html\u0026amp;aq=f\u0026amp;oq=cache%3Aforum.kerbalspaceprogram.com%2Farchive%2Findex.php%2Ft-48862.html\u0026amp;aqs=chrome.0.57j58.1025j0\u0026amp;sourceid=chrome\u0026amp;ie=UTF-8\u0022 rel=\u0022external nofollow\u0022\u003EGoogle Cache\u003C/a\u003E. Some users provided some excellent feedback in the previous thread but unfortunately I lost it. Google Cache still shows Francescos tip: day/night terminator line can be used as planetary prograde/retrograde visual guide. \u003C/p\u003E\u003Cp\u003EAnyway, I\u0027ll work on this tutorial in the coming few days.\u003C/p\u003E\u003Cp\u003EORIGINAL POST BELOW\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003E1st April 2013, 17:38\u003C/p\u003E\u003Cp\u003EThere has been recently quite some questions about how to do interplanetary transfers properly and reliably. This tutorial focuses on Hohmann transfers. The tutorial explains the basic terms and goals, brief theory and provides two case examples: Kerbin-Duna and Kerbin-Eeloo\u003C/p\u003E\u003Cp\u003EPrerequisites: \u003C/p\u003E\u003Cp\u003EAbility to reach parking orbit with a vessel suitable for interplanetary travel\u003C/p\u003E\u003Cp\u003EBasic understanding on maneuver nodes\u003C/p\u003E\u003Cp\u003EStuff to make life easier:\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24786-Kerbal-Alarm-Clock\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/24786-Kerbal-Alarm-Clock\u003C/a\u003E) \u003C/p\u003E\u003Cp\u003EManeuver node improvement plugin (\u003Ca href=\u0022http://kerbalspaceprogram.com/maneuver-node-improvement/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/maneuver-node-improvement/\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003Eksp.olex.biz (\u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E) or \u003Ca href=\u0022http://www.eiden.fi/ksp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.eiden.fi/ksp\u003C/a\u003E for phase angle data\u003C/p\u003E\u003Cp\u003ESmart A.S.S. of MechJeb. \u003C/p\u003E\u003Cp\u003EDon\u0027t warp through a sphere of influence change. This causes inaccuracy in your trajectory.\u003C/p\u003E\u003Cp\u003ETerms\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pDYkEvK.png\u0022 alt=\u0022pDYkEvK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 1: Basic terms explained. The picture shows a basic Hohmann transfer trajectory (dotted) between Kerbin and Duna. Position of Duna is shown at departure and arrival\u003C/p\u003E\u003Cp\u003EApoapsis - The highest point of your orbit\u003C/p\u003E\u003Cp\u003EPeriapsis - The lowest point of your orbit\u003C/p\u003E\u003Cp\u003EPrograde - Forward motion. Planetary prograde is counterclockwise motion when viewed from above. \u003C/p\u003E\u003Cp\u003ERetrograde - Backward motion.\u003C/p\u003E\u003Cp\u003ENormal - A normal points always up from the current orbital plane in prograde motion. (Down in retrograde)\u003C/p\u003E\u003Cp\u003EAnti-normal - Opposite of normal, this one points down in prograde motion.\u003C/p\u003E\u003Cp\u003ETransfer angle - This is the angle that the vessel travels between the departure and arrival point. In case of Hohmann transfer, the transfer angle is always 180 degrees. This means that whenever you plan a Hohmann transfer, the apoapsis of your trajectory should be exactly on the other side of Kerbol (the sun).\u003C/p\u003E\u003Cp\u003EPhase angle - This is the required angle between your departure planet and arrival planet at the time of departure that leads into a 180 degree transfer angle on arrival time. You can use various plugins to find out the phase angles. For example MechJeb shows them.\u003C/p\u003E\u003Cp\u003ESo the first step of doing a successful Hohmann transfer is to know either your correct time of departure or the correct phase angle for the departure. Most of you probably are aware of a handy online tool ksp.olex.biz (\u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E). However I remind you, that this tool gives an average estimate for the correct phase angle. The phase angle is not a constant. It varies, depending on the eccentricities of the orbits of the planets. In case of Kerbin-Duna, the phase angle varies each year between 36-54 degrees. ksp.olex.biz gives a rough mean value of 44 degrees. If you always use this mean value, you\u0027ll end up with transfers that are not 180 degrees. You might encounter your destination earlier or later and your apoapsis is going to be higher than the destination too. It\u0027s doable, sure. But you\u0027re spending extra fuel.\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock (forum.kerbalspaceprogram.com/showthread.php/43666-Kerbal-Alarm-Clock) is a handy tool for knowing the exact time. It will also in the future likely feature more accurate phase angles. These phase angles can be found from \u003Ca href=\u0022http://www.eiden.fi/ksp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.eiden.fi/ksp\u003C/a\u003E and used manually. The case examples in this tutorial rely on the accurate phase angles.\u003C/p\u003E\u003Cp\u003EBurn times\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d1dSPUO.png\u0022 alt=\u0022d1dSPUO.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 2: Typical burn points illustrated. Departure (ejection burn), midcourse correction burn, and arrival (capture burn)\u003C/p\u003E\u003Cp\u003EAny planet can be reached easily with two maneuver nodes. In the departure burn you burn prograde. In the midcourse burn you burn prograde/retrograde as required and normal/antinormal if the destination planet is inclined. There is no need for radial burns, which are a waste of fuel. Instead of radial burns, it is vital to get the ejection burn and it\u0027s angle correct, which will be explained further in the case example.\u003C/p\u003E\u003Cp\u003EAs you already saw in Picture 1, when you fly between two planets in a hohmann transfer, you don\u0027t fly straight at the destination planet. Instead, your transfer orbit is simply an ellipse, where the apoapsis is at your arrival and periapsis is at your departure. Below is a small animation to demonstrate how the transfer looks like when put in action.\u003C/p\u003E\u003Cp\u003EPicture 3: Kerbin-Duna Hohmann transfer orbit (\u003Ca href=\u0022http://i.imgur.com/mcJWDwX.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/mcJWDwX.gif\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003ECase 1: Kerbin - Duna\u003C/p\u003E\u003Cp\u003EAlright, lets fly to Duna! I head over to \u003Ca href=\u0022http://eiden.fi/ksp/phaseangle-Kerbin-Duna.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://eiden.fi/ksp/phaseangle-Kerbin-Duna.txt\u003C/a\u003E and pick the first Kerbin-Duna transfer window: UT 5087930s Phase angle 36.55 degrees. Now, to get to the right time, you can either fast forward to the right time with the help of Kerbal Alarm Clock, or open up your save game\u0027s persistent.sfs, find the line that reads UT = somenumber, and change the somenumber to 5087930. I did that :-) Don\u0027t do that if you have other important flights going on.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/o5xJUsXh.png\u0022 alt=\u0022o5xJUsXh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 4: Game loaded at the right time. MechJeb reports a phase angle of ~36.548. \u003C/p\u003E\u003Cp\u003EThe game is now loaded at the right time. MechJeb reports the same phase angle as the text document, so we should be good. Set Duna as your target. The first step now is to determine the direction of planetary prograde and retrograde. Since all planets in Kerbal Space program orbit counterclockwise, the planetary prograde direction is also always counterclockwise.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gH27jKR.png\u0022 alt=\u0022gH27jKR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 5: Kerbin zoomed out to show the blue planetary trajectory.\u003C/p\u003E\u003Cp\u003EYou can zoom out to bring the planetary trajectory line visible. Try to memorize the direction of prograde motion before you zoom back in.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/d6aDnKf.png\u0022 alt=\u0022d6aDnKf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 6: The two escape directions.\u003C/p\u003E\u003Cp\u003ESo, since we want to fly to higher orbit (to Duna), we want to launch in the planetary prograde direction. This means we will be departing Kerbin much faster than Kerbin itself is flying, causing us to meet up with Duna on the other side of Kerbol.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vxADOR7h.png\u0022 alt=\u0022vxADOR7h.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 7: Start by eyeballing a decent location of the departure maneuver node. Then pull the prograde marker on the maneuver node plenty.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ols1ai1h.png\u0022 alt=\u0022ols1ai1h.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 8: Keep pulling it until your apoapsis reaches the trajectory of Duna.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/R7cLWPf.png\u0022 alt=\u0022R7cLWPf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 9: Now zoom back in. Notice how we are not ejecting parallel to planetary prograde anymore? We need to correct that by moving the maneuver node slightly clockwise. You can drag the maneuver node from the middle circle. It\u0027s a bit difficult and probably quite shaky, but just try. Alternatively use the Maneuver Node Improvement tool to adjust the time of the node.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uhQZ9k0.png\u0022 alt=\u0022uhQZ9k0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 10: Got it!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cbBVso3h.png\u0022 alt=\u0022cbBVso3h.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 11: Zoom out again, and adjust the maneuver node again like in Picture 8. If you\u0027re lucky, you get an encounter. (In case of Duna, you should)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HqCtzMRh.png\u0022 alt=\u0022HqCtzMRh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 12: Next step is to place a midcourse maneuver node. You can do this now, or you can do this after your departure burn, up to you. Choose roughly a good middle point of your ellipse, like in Picture 2.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/w9fWKidh.png\u0022 alt=\u0022w9fWKidh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 13: Now begins the fun part. Change your camera focus to Duna, and use the maneuver node plugin to change Conics mode from 3 to 0. You should now see how the encounter looks like up close. In this picture, it looks like the red trajectory passes far below Duna. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xYXsEiuh.png\u0022 alt=\u0022xYXsEiuh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 14: Pull the midcourse maneuver node normal/antinormal to bring the trajectory roughly level with the Duna system. As you can see, it only took 7.8m/s of delta-v.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hLxNhgUh.png\u0022 alt=\u0022hLxNhgUh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 15: Add a tiny bit of prograde and bang! Looks perfect. You might wanna go even lower, but it might be easier to do that burn after entering the sphere of influence of Duna.\u003C/p\u003E\u003Cp\u003ECase 2: Kerbin - Eeloo\u003C/p\u003E\u003Cp\u003EKerbin-Eeloo is slightly more complicated because Eeloo is a highly inclined planet. This time you really need to use the midcourse maneuver to even get the closest approach markers to appear. As with the Duna example, I chose the first date on the \u003Ca href=\u0022http://eiden.fi/ksp/phaseangle-Kerbin-Eeloo.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://eiden.fi/ksp/phaseangle-Kerbin-Eeloo.txt\u003C/a\u003E list. Now this date is slightly tricky because Mun is aligned just so that it\u0027s sitting in the way of a prograde departure. So take care or depart slightly later.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xLERkLU.png\u0022 alt=\u0022xLERkLU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 16: Funky angle. Proceed as usual, apoapsis to Eeloo trajectory\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6RXhJvL.png\u0022 alt=\u00226RXhJvL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 17: Looking from the side we can see that we are far off..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/g6kAMk2.png\u0022 alt=\u0022g6kAMk2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 18: So place a midcourse node\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/I0T0zbc.png\u0022 alt=\u0022I0T0zbc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 19: Crank it until we get an intersection and the closest approach markers appear. Now how are we going to get an encounter without radial burns?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hPpPiKj.png\u0022 alt=\u0022hPpPiKj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 20: By tweaking the ejection angle. This is the difference between departing now and..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bO5BYYm.png\u0022 alt=\u0022bO5BYYm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 21: Departing 20 seconds earlier. This does place pretty rough requirements for the ejection angle to be correct and the timing becomes very critical.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/133g4vA.png\u0022 alt=\u0022133g4vA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPicture 22: Finally by tweaking the midcourse node tiny bit like in the Duna case you can get something similar to this.\u003C/p\u003E\u003Cp\u003EDiscussion\u003C/p\u003E\u003Cp\u003ECorrect ejection angle ensures there are no requirements for radial burns in interplanetary transfers. Correct phase angle ensures that there is no need to overshoot the destination. Feel free to ask questions in this thread and I will try to answer them and perhaps integrate with this guide.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-03T04:51:35Z\u0022 title=\u002205/03/2013 04:51  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 3, 2013\u003C/time\u003E by voneiden\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheWanderer","CreatedById":57804,"CreatedDateTime":"2013-05-02T22:20:29Z","Content":"\n\u003Cp\u003Eyour first couple of links dont work\u003C/p\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2013-05-02T22:45:01Z","Content":"\n\u003Cp\u003ENice one Voeiden, very detailed, you might want to add something about how the conics mode was changed for the last screenshot so you see the approach at the target planet (I only figured this out recently with your manuever node plugin recently, but it makes it so much easier to plan the arrival)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheWanderer\u0022 data-cite=\u0022TheWanderer\u0022\u003E\u003Cdiv\u003Eyour first couple of links dont work\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe new link for the Kerbal Alarm Clock is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24786-Kerbal-Alarm-Clock\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/24786-Kerbal-Alarm-Clock\u003C/a\u003E, not sure if there is a new forum thread yet for the maneuver node plugin, but you can find the plugin on spaceport - \u003Ca href=\u0022http://kerbalspaceprogram.com/maneuver-node-improvement/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/maneuver-node-improvement/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Iridium616","CreatedById":91003,"CreatedDateTime":"2013-12-14T21:18:02Z","Content":"\n\u003Cp\u003EThis is a very good guide. Deserves more views!\u003C/p\u003E\n"},{"CreatedByName":"Zwer.ch","CreatedById":88958,"CreatedDateTime":"2014-01-04T11:02:55Z","Content":"\n\u003Cp\u003EThat\u0027s exactly what I was looking for, thanks!\u003C/p\u003E\n"},{"CreatedByName":"ItchyBrother","CreatedById":1572,"CreatedDateTime":"2014-05-25T15:02:52Z","Content":"\n\u003Cp\u003EThis is fantastic... a great guide and the pictures really help.. Kudos!\u003C/p\u003E\n"},{"CreatedByName":"adge","CreatedById":85309,"CreatedDateTime":"2014-07-06T00:23:34Z","Content":"\n\u003Cp\u003EFantastic post.\u003C/p\u003E\u003Cp\u003EI\u0027ve done a few successful transfers (to Eve, Duna and Dres), but I always had a feeling they were inefficient, and I was consuming more dV than I should. \u003C/p\u003E\u003Cp\u003EThe angle indicators on various mods are something I never knew of. I used to eyeball it (not a great idea) or get my protractor against the screen....! Likewise, when going for an inclined transfer, I\u0027d do the normal/antinormal tweaks as part of the ejection burn.\u003C/p\u003E\u003Cp\u003EThis looks a lot better. Your hard work is appreciated, friend!\u003C/p\u003E\n"},{"CreatedByName":"riles","CreatedById":114143,"CreatedDateTime":"2014-08-18T02:34:51Z","Content":"\n\u003Cp\u003EThanks for this\u003C/p\u003E\n"},{"CreatedByName":"tbarcello","CreatedById":147952,"CreatedDateTime":"2015-07-29T07:40:02Z","Content":"\n\u003Cp\u003ERise! \u003C/p\u003E\u003Cp\u003ENice guide. \u003C/p\u003E\u003Cp\u003EIf the burn timing is so important, is it a good idea to make the burn from a higher orbit, because then your speed will be slower and your timing better, especially with slow nukes?\u003C/p\u003E\n"},{"CreatedByName":"IMLL1","CreatedById":178286,"CreatedDateTime":"2019-02-14T00:32:20Z","Content":"\n\u003Cp\u003E\nAmazing! I needed this \u003Ci\u003Eso\u003C/i\u003E badly!\n\u003C/p\u003E\n"}]}