{"TopicId":39318,"ForumId":50,"TopicTitle":"How to fix horribly calibrated Joysticks in KSP (Workaround)","CreatedByName":"Ulair","CreatedById":75845,"CreatedDateTime":"2013-07-27T03:44:46Z","PageNum":1,"Articles":[{"CreatedByName":"Ulair","CreatedById":75845,"CreatedDateTime":"2013-07-27T03:44:46Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EWARNING: Windows Vista 7 \u0026amp; 8 64Bit Users will have to disable Driver Signature Enforcment for this Workaround. If you are not comfortable with that DO NOT try this. In general it shouldn\u0027t be a problem but you still need to disable a SECURITY FEATURE which makes your PC more vulnerable. You have been warned!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI wanted to try out playing KSP with a Joystick, a trusty, few years old Saitek one. But what i discovered was that it wasn\u0027t exactly behaving right. My spacecraft always wanted to move somewhere and the throttle, which i bound to the slider, could only be set between like 10% and 60%. What was happening was: The Joystick was not calibrated properly. So i recalibrated it with the Windows calibration tool but nothing changed. Even weirder: It worked perfectly fine in other games.\u003C/p\u003E\u003Cp\u003EAfter many hours of investigation (holidays yay) i found out what was happening:\u003C/p\u003E\u003Cp\u003EUnity simply does not give a tomato about joaystick calibration.\u003C/p\u003E\u003Cp\u003EFor those who don\u0027t know: There are 2 ways to read Joystick input on Windows:\u003C/p\u003E\u003Cp\u003E1) Raw-Input: This is basicly the original signals the Joystick sends to Windows. If it doesn\u0027t need calibration it works fine, but if it does this input is pretty useless.\u003C/p\u003E\u003Cp\u003E2) DirectInput: If the Joystick has never been calibrated it should effectively be the same as Raw-input. But if it has been calibrated, DirectInput will give you the correctly calibrated input.\u003C/p\u003E\u003Cp\u003EFor some stupid reason Unity uses Raw-Input. I\u0027ve seen many Unity-developers complain about it in forums. It\u0027s pretty ridicculous. But this is why Joysticks in KSP (which uses Unity) are never properly calibrated.\u003C/p\u003E\u003Cp\u003ESo what can you do? Unfortunately the only way i got around this issue was using a Virtual Joystick as Proxy:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHere is what you need:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPPJoy\u003C/strong\u003E - A virtual Joystick driver\u003C/p\u003E\u003Cp\u003EUnfortunately this is not being developed any longer and i haven\u0027t found any \u0022official\u0022 sources where you can still get it. But this tutorial here has a link to the download: \u003Ca href=\u0022http://wiki.mechlivinglegends.net/index.php?title=PPJoy_for_using_multiple_joysticks\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.mechlivinglegends.net/index.php?title=PPJoy_for_using_multiple_joysticks\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EDirect download link: \u003Ca href=\u0022http://uploaded.to/file/fzhe96kn\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://uploaded.to/file/fzhe96kn\u003C/a\u003E (MD5 Hash: 5fcb06c790ec49b2ebb49a85394cae90)\u003C/p\u003E\u003Cp\u003EI also uploaded the file again just to have another mirror: \u003Ca href=\u0022https://www.dropbox.com/s/5o059qka8hke3sw/ppjoysetup-0-8-4-6%285%29.7z\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/5o059qka8hke3sw/ppjoysetup-0-8-4-6%285%29.7z\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs the project is open source, someone put it on Github too apparently. But there aren\u0027t any binaries as far as i could tell: \u003Ca href=\u0022https://github.com/elitak/PPJoy\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/elitak/PPJoy\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat do you need to do:\u003C/strong\u003E (Note: I only tried this on Windows 8 Pro 64Bit)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1)\u003C/strong\u003E Install the driver. Vista and Windows 7/8 64Bit users !!!WILL HAVE TO DISABLE DRIVER SIGNING!!! as the PPJoy drivers aren\u0027t signed and Windows will not allow the installation otherwise.\u003C/p\u003E\u003Cp\u003EHere is a tutorial on how to do this and more importantly how you reenable it as it\u0027s technically a security issue: \u003Ca href=\u0022http://sixcolumns.com/t/how-to-disable-and-bypass-driver-signature-enforcement-in-windows-8/151\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://sixcolumns.com/t/how-to-disable-and-bypass-driver-signature-enforcement-in-windows-8/151\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe PPJoy setup will PERMANENTLY disable driver signing and does not reenable it when you uninstall it. To reenable it yourself, open a CMD as Administrator and type (without \u0022) \u0022bcdedit -set loadoptions ENABLE_INTEGRITY_CHECKS\u0022 and then \u0022bcdedit -set TESTSIGNING OFF\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2)\u003C/strong\u003E Make sure your Joystick is plugged in and open the PPJoy \u0022Joystick remixer\u0022\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3)\u003C/strong\u003E Here you have to map ALL axis and buttons to your Joystick (in my case the Saitek - see image)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://photos-5.dropbox.com/t/0/AACwuI7YEKoIfsEFohRfUgpqn92M1YiD7yB2v2FiPBFRCw/12/16768741/jpeg/32x32/3/_/1/2/remixer.jpg/-2zTZkfetBZ-9pDh5Q3MzQp0j4KuihyvPZ3FsHo-j9c?size=800x600\u0022 alt=\u0022-2zTZkfetBZ-9pDh5Q3MzQp0j4KuihyvPZ3FsHo-j9c?size=800x600\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E4)\u003C/strong\u003E Open KSP, go to settings and set the Joystick commands using your physical Joystick (Don\u0027t worry if they are named the same as before. You are actually using the Virtual Joystick. No idea why the name doesn\u0027t change)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E5) Play and enjoy \u003C/strong\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhy does that work?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESimple: PPJoy actually uses the correctly calibrated input of the physical Joystick. And since the ONLY input the Virtual Joystick has, is already calibrated, Unity gets the correct values.\u003C/p\u003E\u003Cp\u003EI hope that helped \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E- Ulair\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-07-27T06:45:55Z","Content":"\n\u003Cp\u003EGood post. I ran into the exact same issues as you did when I tried to use my Sidewinder 2 and came to roughly the same solution as well (my problems and solutions are documented here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/37651-What-s-the-best-way-to-set-up-a-Joystick-for-this-game\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/37651-What-s-the-best-way-to-set-up-a-Joystick-for-this-game\u003C/a\u003E).\u003C/p\u003E\u003Cp\u003EYour steps seem to be even better though since it seems to eliminate the need to use GlovePIE. I\u0027ll have to give your method a shot!\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-07-27T08:42:50Z","Content":"\n\u003Cp\u003EI\u0027m just glad my Logitech Attack 3 and X3D doesn\u0027t experience those issues by default. I still like to look into that though. Thanks for showing this procedure.\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-07-27T10:03:35Z","Content":"\n\u003Cp\u003EAfter messing around some, I found that GlovePIE is actually a little more flexible than PPJoy\u0027s Joystick Remixer. Both are good solutions depending on what kind of control stick you have though. Again, good guide either way. It\u0027s important to get this info out there to people with these problems!\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-07-27T13:12:23Z","Content":"\n\u003Cp\u003EOh, nice! I had to unplug my Logitech G940 stick/throttles/rudder setup because Unity doesn\u0027t read it correctly, and pull my old Sidewinder out of the basement for KSP. I\u0027ll have to see if this fixes the problem...\u003C/p\u003E\n"},{"CreatedByName":"polo","CreatedById":76129,"CreatedDateTime":"2013-07-27T18:22:56Z","Content":"\n\u003Cp\u003EDoes ppjoy work with usb or just the old game port(s)?\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-07-27T20:33:43Z","Content":"\n\u003Cp\u003EWorks just fine with USB\u003C/p\u003E\n"},{"CreatedByName":"Ulair","CreatedById":75845,"CreatedDateTime":"2013-07-27T21:42:06Z","Content":"\n\u003Cp\u003EIt works with anything. You can also use your keyboard or mouse with it. For example: You press \u0022E\u0022 and PPJoy presses Button 1 on the Virtual Joystick. Although that may not be very useful in this case.\u003C/p\u003E\u003Cp\u003EGlovePIE uses PPJoy as far as i know and you can do much more things with it. I think you can even program Joystick macros right? It seems though their site was hacked and nobody cares about fixing it. Who knows what happened to the GlovePIE binaries hosted there :S. But you can get it from 3rd party download sites. Just google \u0022GlovePIE 0.45\u0022. That\u0027s the newest version afaik. Here for example: \u003Ca href=\u0022http://download.chip.eu/en/GlovePie-0.30_174835.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://download.chip.eu/en/GlovePie-0.30_174835.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2013-07-28T06:11:17Z","Content":"\n\u003Cp\u003EI ran through all this and it was working, then went through the steps to re-enable the security and it broke again. turn it back off and good.\u003C/p\u003E\u003Cp\u003EAny tips, am I doing something wrong and the security has to stay off for it to work?\u003C/p\u003E\n"},{"CreatedByName":"polo","CreatedById":76129,"CreatedDateTime":"2013-07-28T15:03:21Z","Content":"\n\u003Cp\u003EI\u0027ve got the virtual joystick working but ksp won\u0027t detect it and keeps using raw input from my joystick.\u003C/p\u003E\u003Cp\u003EAm i missing something?\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-07-28T20:39:35Z","Content":"\n\u003Cp\u003EI had to manually edit my settings.cfg to make KSP take the axis inputs from the virtual stick vs my real one... Here\u0027s what my current pitch, roll, yaw, and throttle axes look like in my settings:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EAXIS_PITCH\u003Cbr\u003E{\u003Cbr\u003E\tname = VirY\u003Cbr\u003E\tid = joy0.1\u003Cbr\u003E\tinv = False\u003Cbr\u003E\tsensitivity = 2.177017\u003Cbr\u003E\tdeadzone = 0.05\u003Cbr\u003E\tscale = 1\u003Cbr\u003E\tgroup = 0\u003Cbr\u003E\tswitchState = Any\u003Cbr\u003E}\u003Cbr\u003EAXIS_ROLL\u003Cbr\u003E{\u003Cbr\u003E\tname = VirZRot\u003Cbr\u003E\tid = joy0.2\u003Cbr\u003E\tinv = False\u003Cbr\u003E\tsensitivity = 2.197487\u003Cbr\u003E\tdeadzone = 0.05\u003Cbr\u003E\tscale = 1\u003Cbr\u003E\tgroup = 0\u003Cbr\u003E\tswitchState = Any\u003Cbr\u003E}\u003Cbr\u003EAXIS_YAW\u003Cbr\u003E{\u003Cbr\u003E\tname = VirX\u003Cbr\u003E\tid = joy0.0\u003Cbr\u003E\tinv = False\u003Cbr\u003E\tsensitivity = 2.197487\u003Cbr\u003E\tdeadzone = 0.05\u003Cbr\u003E\tscale = 1\u003Cbr\u003E\tgroup = 0\u003Cbr\u003E\tswitchState = Any\u003Cbr\u003E}\u003Cbr\u003EAXIS_THROTTLE\u003Cbr\u003E{\u003Cbr\u003E\tname = VirSlider\u003Cbr\u003E\tid = joy0.3\u003Cbr\u003E\tinv = True\u003Cbr\u003E\tsensitivity = 1\u003Cbr\u003E\tdeadzone = 0.05\u003Cbr\u003E\tscale = 1\u003Cbr\u003E\tgroup = 0\u003Cbr\u003E\tswitchState = Any\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe important part is the ID field. The virtual stick is registered as my \u0022first\u0022 joystick by default, and my real one second. So joy0.0 refers to the X-axis of my virtual stick, and joy1.0 would refer to the X-axis of the real one. So if you\u0027re having problems making things map in-game, go into the config file and try changing stuff manually and see if that helps.\u003C/p\u003E\u003Cp\u003EAlso note that the second number in the joyx.y pair depends on how you set up your virtual joystick\u0027s axes. By default it has 8 axes, but I set mine up to just have the same 4 that my real joystick does.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-28T20:43:29Z\u0022 title=\u002207/28/2013 08:43  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 28, 2013\u003C/time\u003E by FenrirWolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ulair","CreatedById":75845,"CreatedDateTime":"2013-07-28T23:24:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trigger Au\u0022 data-cite=\u0022Trigger Au\u0022\u003E\u003Cdiv\u003EAny tips, am I doing something wrong and the security has to stay off for it to work?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m afraid the driver signing has to stay off. When you enable it again, windows will not allow the PPJoy driver to function any longer.\u003C/p\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2013-07-28T23:45:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ulair\u0022 data-cite=\u0022Ulair\u0022\u003E\u003Cdiv\u003EI\u0027m afraid the driver signing has to stay off. When you enable it again, windows will not allow the PPJoy driver to function any longer.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats the bit I missed, thanks Ulair\u003C/p\u003E\n"},{"CreatedByName":"Ulair","CreatedById":75845,"CreatedDateTime":"2013-07-28T23:52:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022polo\u0022 data-cite=\u0022polo\u0022\u003E\u003Cdiv\u003EI\u0027ve got the virtual joystick working but ksp won\u0027t detect it and keeps using raw input from my joystick.\u003Cp\u003EAm i missing something?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMine worked out of the box, but tbh I was surprised it did.\u003C/p\u003E\u003Cp\u003EAssuming your Virtual Joystick really works properly you might try another program that comes with PPJoy called \u0022Keyboard Joystick\u0022. It does the same thing as the Joystick remixer, but uses the keyboard instead. Just for configuring KSP.\u003C/p\u003E\u003Cp\u003EThe buttons aren\u0027t the problem i presume, as it doesn\u0027t matter if you use the \u0022real\u0022 ones or \u0022virtual\u0022 ones. I guess your main problem is the axes.\u003C/p\u003E\u003Cp\u003ESo you will have to map \u0022up\u0022,\u0022down\u0022,\u0022left\u0022,\u0022right\u0022 (that\u0027s the x \u0026amp; y axis), and everything containing \u0022axis\u0022 or \u0022rotation\u0022. Basically everything but the buttons.\u003C/p\u003E\u003Cp\u003ENow go to the KSP settings and try to set all \u003Cstrong\u003Eaxis\u003C/strong\u003E using the keyboard. KSP won\u0027t accept any keyboard input here, so it should work just fine.\u003C/p\u003E\u003Cp\u003EWhen you are done, close the \u0022Keyboard to Joystick\u0022 window. Then the keyboard will work normally again.\u003C/p\u003E\u003Cp\u003EIf that doesn\u0027t work please verify a few things: (Sorry if i sound like a smartass here. But better to be sure and it might help others with problems aswell)\u003C/p\u003E\u003Cp\u003E1) Is Driver signing still disabled? It has to be otherwise the PPJoy driver stops working.\u003C/p\u003E\u003Cp\u003E2) Is the Joystick Remixer open? It has to be.\u003C/p\u003E\u003Cp\u003E3) Press WINDOWS\u002BR and type \u0022joy.cpl\u0022 and enter. Do you see both your real Joystick and the Virtual one there? Select the virtual joystick, click \u0022Properties\u0022 and then go to the \u0022Test\u0022 tab. Move your real Joystick around and press a few buttons. Do they all work? If yes, then the Virtual Joystick does really work properly and I\u0027m out of ideas. :S\u003C/p\u003E\u003Cp\u003E-Ulair\u003C/p\u003E\n"},{"CreatedByName":"128MB","CreatedById":65888,"CreatedDateTime":"2013-08-09T14:39:42Z","Content":"\n\u003Cp\u003EH i have a Thrustmaster USB joystick, PPJoy does not see the inputs i make ...\u003C/p\u003E\n"},{"CreatedByName":"yithpistol","CreatedById":61110,"CreatedDateTime":"2013-08-11T05:47:12Z","Content":"\n\u003Cp\u003EI am having the same issues. I opened the mixer, set up a basic joystick: x and y axis, z rotation (the twist of the stick), and button for each button. No hat since I can\u0027t figure out what that\u0027d be.... but I left it out out of simplicity. I saved the .ini as ppjoyff2.ini so I could relaod it anytime and loaded up KSP. I went into settings and tried to map the axes out in \u0022Staging\u0022. Instead of saying \u0022Sidewinder FF 2\u0022 on the button, it had a kind of garbage. So I figured it was reading from PPJoy now. I loaded up a simple plane to test the joystick with and none of the axes worked properly. They behaved as if nothing had changed. Am I missing something?\u003C/p\u003E\u003Cp\u003EEDIT: If the driver signing is disabled, what is the best way to tell? If I did the joy.cpl and ran the test and configuring of the PPJoy1 virtual device using my Sidewinder... is that a good indication that the driver signing is disabled? If so, then I am still having issues. Not sure what to do at this point, either. However, if driver signing might still be enabled I will go that route... but I think it\u0027s off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-11T06:00:35Z\u0022 title=\u002208/11/2013 06:00  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 11, 2013\u003C/time\u003E by yithpistol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"128MB","CreatedById":65888,"CreatedDateTime":"2013-08-16T18:07:32Z","Content":"\n\u003Cp\u003EPlease anyone know why ppjoy is not reading my joystick?? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Black-Talon","CreatedById":57463,"CreatedDateTime":"2013-08-19T02:44:34Z","Content":"\n\u003Cp\u003EThanks for the great post. I\u0027ve been struggling with very similar things thing for several weeks and *nearly* have everything sorted out.\u003C/p\u003E\u003Cp\u003EI wanted to note that I\u0027m using Universal Joystick Remapper (which leverages vJoy instead of PPJoy) because I\u0027ve gotten the impression that it has been actively in development. For the most part I\u0027m happy with it, easy to use. Still requires Test Mode. Does everything I need it to do (merge pedals into single axes, easily invert axes, change axis ids on the fly, and utilize/simplify multiple joysticks).\u003C/p\u003E\u003Cp\u003EMy 1st issue was to get my racing pedals to map the Clutch and Accelerator to one axis for use as a Rudder. This has been done now and UJR w/ vJoy made that easier than what I had been trying with PPJoy and GlovePie (not to mention that PPJoy stopped successfully installing, even in test mode, for some reason).\u003C/p\u003E\u003Cp\u003EMy 2nd issue is still nagging me, getting KSP to recognize the virtual joystick instead of the real one when setting inputs. I saw your tips in the thread and will give them a try. Thank you!\u003C/p\u003E\u003Cp\u003EMy 3rd issue is going to be that these ids seem to get all mix\u0027n\u0027matched when you unplug and replug in joysticks...I have quite a few that I change for racing, flying, controller-pad for action, etc...so this is going to be a problem. I could probably see if I can get everything onto the virtual joystick and somehow keep it\u0027s id as 0...but I\u0027m not sure that covers everything. Unity could really use a huge boost here...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E4th issue is pretty silly? Once I get these joysticks working, there isn\u0027t a follow mode while in atmosphere? So I\u0027ll have to take my hand off the stick to turn my view so I can follow a plane? I haven\u0027t gotten to this point so perhaps the answer is really simple and I\u0027ve just overlooked it. If other\u0027s have ideas...\u003C/span\u003E EDIT: Nevermind, chase camera view works just fine. For some reason it wasn\u0027t working the way I had previously experienced but that must have been a mistake on my part, everything works as expected.\u003C/p\u003E\u003Cp\u003EJoysticks need to come back to gaming... it would be fantastic if KSP helped that happen. :-) Glad to see all of you enjoying awesome setups.\u003C/p\u003E\u003Cp\u003E**UPDATE - Nov. 27th, 2013**\u003C/p\u003E\u003Cp\u003E1. Universal Joystick Remapper is still working perfectly for merging my racing pedals into a rudder\u003C/p\u003E\u003Cp\u003E2. The latest version of Universal Joystick Remapper makes this a snap and I can simulate the axis during mapping very easily and it works very well.\u003C/p\u003E\u003Cp\u003E3. KSP still seems to get confused (though I still think I could find a way to force a consistent joystick ID and that should solve the issue) BUT, for the most part this is easily resolved. Often I can even solve the problem by just changing some of the associated Joystick/Axes IDs in UJR and that\u0027ll get them back inline with KSP.\u003C/p\u003E\u003Cp\u003E4. Was never a problem again. I have concluded that I just made a mistake in an under caffeinated moment.\u003C/p\u003E\u003Cp\u003E5. *new* I can easily switch between roll for rockets on the pedals and yaw for planes just with an alt-tab and few clicks in UJR! Nice!\u003C/p\u003E\u003Cp\u003E6. *new* I was having a problem with the merged rudder axes twitching out occasionally, but since evilC is actively working to improve the utility this was fixed and it works super smooth now!\u003C/p\u003E\u003Cp\u003E- Talon\u003C/p\u003E\u003Cp\u003EThrustmaster HOTAS Warthog Joystick \u0026amp; Throttle\u003C/p\u003E\u003Cp\u003EFanatec Club Sport Petals\u003C/p\u003E\u003Cp\u003EUniversal Joystick Remapper!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T06:18:56Z\u0022 title=\u002211/26/2013 06:18  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by Black-Talon\u003C/strong\u003E\n\u003Cbr\u003Eupdate to my latest experience with UJR\n\u003C/span\u003E\n"},{"CreatedByName":"OrionKealin","CreatedById":100942,"CreatedDateTime":"2014-01-14T12:54:55Z","Content":"\n\u003Cp\u003EI had the same problem and then found this thread and fixed it. Mostly.\u003C/p\u003E\u003Cp\u003EThe one problem I still have is that my POV hat wont work. Im getting really frustrated.\u003C/p\u003E\u003Cp\u003EDoes anyone else have this problem? If not, what setting are you using so it worked fine?\u003C/p\u003E\u003Cp\u003EDoes anyone know how to fix it?\u003C/p\u003E\u003Cp\u003Ethanks\u003C/p\u003E\n"},{"CreatedByName":"wilcomir","CreatedById":49293,"CreatedDateTime":"2014-02-21T11:14:27Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI have the same problem and the POV is not working here too. I\u0027ll try to fix it up and post here if I\u0027m lucky, no promises anyway... I really can\u0027t believe using a joystick with this game is such a PIA.\u003C/p\u003E\n"},{"CreatedByName":"Flame Soulis","CreatedById":104483,"CreatedDateTime":"2014-02-27T08:24:27Z","Content":"\n\u003Cp\u003EI\u0027m in the midst of finishing up a script for the Steel Battalion controller, which was truly evil since I couldn\u0027t get PPJoy to work at all (yes, I had to decipher how Unity reads the joystick to make my own calibration in the setup. I\u0027m not 100% sure that Kerbal supports POV but I can take a look with my XBOX controller later.\u003C/p\u003E\u003Cp\u003EAs for joysticks with KSP: yeah, it seriously is a pain, which is a complete shame. I haven\u0027t worked with plugins yet for KSP, but if I recall straight, KSP was made in C#, so I wonder why a substitute input plugin wasn\u0027t made yet. That will be a fun venture in my space time.\u003C/p\u003E\u003Cp\u003EPS: This thread alone is the reason I made an account, and once I finish the SBC script, I hope to post a tutorial on how to set it up.\u003C/p\u003E\n"},{"CreatedByName":"Akeo","CreatedById":119466,"CreatedDateTime":"2014-08-27T22:53:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flame Soulis\u0022 data-cite=\u0022Flame Soulis\u0022\u003E\u003Cdiv\u003EI wonder why a substitute input plugin wasn\u0027t made yet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen I am happy to introduce \u003Ca href=\u0022https://github.com/pbatard/AltInput\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EAltInput\u003C/strong\u003E\u003C/a\u003E, an Alternate Input plugin for KSP, designed to add \u003Cstrong\u003Eproper\u003C/strong\u003E support for DirectInput game controllers... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s still fairly beta, but it should work well enough to remove the need for all the stopgap solutions exposed above. Of course, since it\u0027s DirectInput based, it\u0027s \u003Cstrong\u003EWindows-only\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003EOnce the module is installed, a simple \u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003E.ini\u003C/span\u003E file, such as \u003Ca href=\u0022https://github.com/pbatard/AltInput/blob/master/PluginData/AltInput/config.ini\u0022 rel=\u0022external nofollow\u0022\u003Ethis one\u003C/a\u003E is all you need to get full benefit of your controller, including POV and throttle/slider support.\u003C/p\u003E\u003Cp\u003EFor more info, please take a look at the \u003Cspan style=\u0022font-family:\u0027courier new\u0027;\u0022\u003EREADME\u003C/span\u003E from the \u003Ca href=\u0022https://github.com/pbatard/AltInput\u0022 rel=\u0022external nofollow\u0022\u003Egithub project page\u003C/a\u003E. Or you can try the pre-compiled binaries from the latest version, which are available \u003Ca href=\u0022http://ksp.akeo.ie/downloads/AltInput/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EI just hope that this module can be useful to a few more people besides myself, as having decent joystick control sure does improves the game...\u003C/p\u003E\n"},{"CreatedByName":"Mars Mullo","CreatedById":110160,"CreatedDateTime":"2014-12-29T23:02:49Z","Content":"\n\u003Cp\u003EHi Akeo I\u0027m trying to use your ALtInput but am finding the set up process somewhat confusing. I am only using MS notepad for any editing. The config.ini file was saved into a locaction for me it was c:\\KSP-win\\plugins\\plugindata\\altinput\\\u003C/p\u003E\u003Cp\u003EI read through all the instructions and added button and controler names etc. Tried it and it would not configure. \u003C/p\u003E\u003Cp\u003EI\u0027m running windows 8 or 8.1 and I have a very old joy stick. it doesn\u0027t have a z axis (or twist handle) but has a throttle slider (which doesn\u0027t seem to ever be picked up by devices) Windows identified it through the USB port and gave it it\u0027s very long name. I am also using a USB to parrallel port converter for the stick which has 4 different modes on it as does the stick as well .. all set to the same.\u003C/p\u003E\u003Cp\u003EThe biggest problem I am having is that the joystick is actually working but... the axis are always way out of kilter to the point that I have lots of right aileron and practically no left. So I use a combination of trim on the hardware and in the KSP trim ... but it gets really bad for elevator as it sometimes is all lift and no downward.\u003C/p\u003E\u003Cp\u003EAlso my POV hat uses combinations of buttons 1234 to represent POV directions... how do you handle that in the config file?\u003C/p\u003E\u003Cp\u003EAny ways I have a screen shot of the result... any advice please?\u003C/p\u003E\u003Cp\u003EI removed all the \u0022; \u0022 lines to show my settings.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i117.photobucket.com/albums/o75/Martin_Ellis/Martins%20KSP%20screen%20shots/JSconfig.jpg\u0022 alt=\u0022JSconfig.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Elix","CreatedById":135044,"CreatedDateTime":"2015-01-10T00:43:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OrionKealin\u0022 data-cite=\u0022OrionKealin\u0022\u003E\u003Cdiv\u003EI had the same problem and then found this thread and fixed it. Mostly.\u003Cp\u003EThe one problem I still have is that my POV hat wont work. Im getting really frustrated.\u003C/p\u003E\u003Cp\u003EDoes anyone else have this problem? If not, what setting are you using so it worked fine?\u003C/p\u003E\u003Cp\u003EDoes anyone know how to fix it?\u003C/p\u003E\u003Cp\u003Ethanks\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had a POV hat problem with my Logitech Wingman Extreme joystick. Here\u0027s how I resolved it:\u003C/p\u003E\u003Cp\u003EWhat I first noticed was that I was unable to assign the hat directions as a valid \u0027key/button binding.\u0027 But what I then discovered was that I could assign it as an \u0027axis binding\u0027 input.\u003C/p\u003E\u003Cp\u003EIn my case, I was trying to assign the hat to the Camera view up/down/left/right buttons, ending up using camera horizontal/vertical axes.\u003C/p\u003E\u003Cp\u003EHope this helps you and others.\u003C/p\u003E\n"},{"CreatedByName":"Moroz","CreatedById":141434,"CreatedDateTime":"2015-05-03T14:49:52Z","Content":"\n\u003Cp\u003EI am having many of the same issues addressed in this thread. Specifically, I am experiencing joystick input delay - probably close to one second. I am using Saitek X45 joystick/throttle combo. Just downloaded KSP_1.0.2, but I don\u0027t think the issue has been fixed since it wasn\u0027t fixed in KSP_1.0. I installed vJoy and UJR to get the throttle and joystick to both work together, but i noticed that I was still experiencing a huge input delay. I was going to try installing AFBW mod but it isn\u0027t appearing on CKAN and probably won\u0027t work if I downloaded and installed it manually since all of the input setting have been changed in the 1.0 version of KSP. Akeo\u0027s plugin AltInput seems like it was a promising solution almost 9 months ago but I am not sure if it will work with the KSP 1.0 versions since all input settings in KSP have been altered - primarily because I don\u0027t know how AltInput really works. I tried to follow the instructions on the README file from the github project page on how to install AltInput,but I haven\u0027t been able to locate the AltInput.dll file and am not sure what to use to compile the project after changing the KSPPath and ultimately failing to install it. If someone could provide a better set of instructions on how to install AltInput (or any insight into whether it will work with KSP 1.0 versions at all) or possibly a completely different solution to the input delay, your help would be greatly appreciated. \u003C/p\u003E\u003Cp\u003EI specifically got the joystick for KSP 1.0, hoping the developers would have already resolved the issue, but they didn\u0027t. I really don\u0027t see myself playing KSP without a joystick now that I\u0027ve got a taste of it. If I knew how to code in C# and how to write a plugin like AltInput, I definitely would spend my time doing it (that\u0027s how badly I want to use a joystick in this game). If I don\u0027t find a solution soon I just might have to resort to learning just that - even if it takes me the whole summer, unless of course my patience runs dry.\u003C/p\u003E\n"}]}