{"TopicId":50345,"ForumId":50,"TopicTitle":"How to Optimize KSP Like Crazy","CreatedByName":"rdude71","CreatedById":61986,"CreatedDateTime":"2013-10-24T03:52:38Z","PageNum":1,"Articles":[{"CreatedByName":"rdude71","CreatedById":61986,"CreatedDateTime":"2013-10-24T03:52:38Z","Content":"\n\u003Cp\u003ENow, to say KSP is lag-free would be a lie. Of course, the game is still in beta, so that\u0027s understandable. The game is very laggy though, \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eespecially\u003C/span\u003E when flying around large space stations, launching large rockets, etc. However, I discovered many ways to make KSP run practically lag-free until the devs implement a proper, long-term solution.\u003C/p\u003E\u003Cp\u003E#1: Good hardware\u003C/p\u003E\u003Cp\u003EI first got KSP almost a year ago on my 11\u0022 MacBook Air. Needless to say, that poor little laptop\u0027s 1.6 GHz single-core i5 couldn\u0027t handle the game. Great for web-browsing, but definitely not KSP. So, just recently, I got a new 3.6 GHz dual-core i7 MacBook Pro. The performance increase was amazing. So, good hardware is essential. No matter what, if you\u0027re going to play KSP, don\u0027t get a quad-core. Quad-cores are very fast, but KSP isn\u0027t 64-bit and doesn\u0027t support multiple cores at the moment because it runs on Unity, so make sure to get a computer with high individual core speed. For example: a 3.2 GHz dual-core i7 would be better for KSP than a 2.6 GHz quad-core i7.\u003C/p\u003E\u003Cp\u003E#2: Settings\u003C/p\u003E\u003Cp\u003ELag at launch is an issue. Turn down render settings to fastest, turn off terrain scatters, disable V-sync, lower texture res to half, lower terrain detail to low, etc. All this will help tremendously with performance.\u003C/p\u003E\u003Cp\u003E#3: Part Count\u003C/p\u003E\u003Cp\u003EKeep your part count down. An awesome mod called the UbioZur welding mod allows you to weld parts together to make 1 part. It is fantastic at losing lag. Using this mod, a 1,000\u002B part station running at .2 FPS could easily become a 125 part station running at 65 FPS. I can\u0027t even explain how wonderful this mod is. Check it out: \u003Ca href=\u0022http://kerbalspaceprogram.com/ubioweldingltd/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/ubioweldingltd/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMake sure to use UbioZur if you\u0027re building large ships/stations in orbit, docking to big ships/stations, launching massive rockets, the list goes on.\u003C/p\u003E\u003Cp\u003E#4: Physics\u003C/p\u003E\u003Cp\u003EI really don\u0027t know how this works specifically, but I think everyone should do this. Go into your KSP directory, open your settings.cfg file, and then change your max physics delta per frame to 0. This guarantees good FPS. Note: This can cause some issues with physics, so if you want to play it safe, make it .1 instead of 0. However, glitches are very rare (for me anyways). I am not responsible if this somehow damages your hardware/software (under foreseeable circumstances, it won\u0027t)\u003C/p\u003E\u003Cp\u003E#5: Using these tips!\u003C/p\u003E\u003Cp\u003EI ran out of ideas for 5, so this is it! I hope these help you, as they did me, and happy launching! Now, go forth and make massive space stations! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-10-24T04:05:38Z","Content":"\n\u003Cp\u003EIf you buying a cpu to only run ksp then a dual core would be fine. If you want to run ANY other game then you\u0027d be better off buying a quad core at least.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-10-24T04:16:30Z","Content":"\n\u003Cp\u003EA good CPU does indeed increase performance, but there is no reason to avoid a quad-core CPU. In general quad-core CPUs are all-around faster than dual-cores, especially on the desktop where dual-core is limited mostly to low end options. Pretty much every modern CPU has some kind of turboboost; when you\u0027re playing KSP it usually runs at the dual-core speed unless you have heat issues. So even in laptops there is little to gain by sticking with dual-core only (high end quad-core mobile CPUs can get quite expensive, and aren\u0027t generally available in ultrabooks, but those are different issues).\u003C/p\u003E\u003Cp\u003EThe graphics setting you want to turn down during launch, or really all of the time, is the terrain settings value. The best option is to use the ocean terrain setting tweak found here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43253-Default-Terrain-Quality-Without-most-of-The-Lag%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/43253-Default-Terrain-Quality-Without-most-of-The-Lag%21\u003C/a\u003E. But if you have a weak GPU then turning down some other settings is definitely a good idea.\u003C/p\u003E\u003Cp\u003ETurning down the physics time per frame beyond the in-game limit of 0.03s/frame is probably not a good idea. You might be able to get away with 0.02 or 0.01, but this can cause issues, and in any case will make the launches of big crafts excruciatingly long. This setting defines the amount of in-game time that can pass between each frame (or really it\u0027s the max amount of time between physics steps). So at the lowest setting, 0.03 sec/frame, only 30 milliseconds of time can pass for each frame displayed on screen. Anything below 33 frames / second will result in in-game time running slower than real-world time. At the extreme ends, below 5 FPS, this can really slow things down; only 150 milliseconds of game-time for each second of real-time, making your 5 min launch more like 40 minutes.\u003C/p\u003E\n"},{"CreatedByName":"Dangerous_Beans","CreatedById":78059,"CreatedDateTime":"2013-10-24T04:16:57Z","Content":"\n\u003Cp\u003E#1 isn\u0027t really accurate. \u003C/p\u003E\u003Cp\u003Efirstly you need to consider performance per clock, a modern processor is going to outperform a 5 year old one even at the same clock speeds, because the modern one is more efficient.\u003C/p\u003E\u003Cp\u003Esecondly, you need to consider turbo and or overclocking. a core i3-4340 is a dual core at 3.6ghz, while a core 4670k is a quad core at 3.4ghz, so by your logic the 4340 is better (dual core, and faster base clock speed). however, when you consider that the 4340 can run at 3.8ghz with turbo, and 4.2\u002Bghz with overclocking, the 4670k becomes a better choice (assuming you are willing to spend the extra cash).\u003C/p\u003E\u003Cp\u003Eyou want the fastest cpu (within buget limitations). dual or quad core is irrelevant, the unused cores will just shut off. \u003C/p\u003E\u003Cp\u003Ealso, there are multi-threaded applications that are 32bit. 64/32 bit relates to the memory address size, so limits the usable ram, while single/multi-threads is the number of cpu cores it uses (in my dreams KSP is a 64bit multithreded application, along with dwarf fortress. and i have a ducati panigale superleggera. and more kittens (i\u0027m dreaming, so i may as well run with it)).\u003C/p\u003E\u003Cp\u003Ethe rest is good advice.\u003C/p\u003E\n"},{"CreatedByName":"fernandodlc","CreatedById":101689,"CreatedDateTime":"2014-01-29T19:56:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdude71\u0022 data-cite=\u0022rdude71\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E#3: Part Count\u003C/p\u003E\u003Cp\u003EKeep your part count down. An awesome mod called the UbioZur welding mod allows you to weld parts together to make 1 part. It is fantastic at losing lag. Using this mod, a 1,000\u002B part station running at .2 FPS could easily become a 125 part station running at 65 FPS. I can\u0027t even explain how wonderful this mod is. Check it out: \u003Ca href=\u0022http://kerbalspaceprogram.com/ubioweldingltd/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/ubioweldingltd/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMake sure to use UbioZur if you\u0027re building large ships/stations in orbit, docking to big ships/stations, launching massive rockets, the list goes on.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgh! Found the solution I need and no 0.23 support. Don\u0027t really want to mess around with dlls. Might have to bite that bullet.\u003C/p\u003E\u003Cp\u003EIt sounds like maybe auto-welding struts or welding at least one end might be an easy way for the devs to improve performance.\u003C/p\u003E\u003Cp\u003EHow does this work with damage? If a strut breaks does the tank it is welded to blow up?....I\u0027ll ask in that thread.\u003C/p\u003E\n"},{"CreatedByName":"fireflower","CreatedById":102309,"CreatedDateTime":"2014-02-02T08:26:13Z","Content":"\n\u003Cp\u003EI\u0027m \u003Ca href=\u0022http://www.eurogamer.net/articles/digitalfoundry-2014-r7-260x-vs-next-gen-console\u0022 rel=\u0022external nofollow\u0022\u003Epretty sure\u003C/a\u003E it\u0027s the GPU that\u0027s relevant when it comes to graphics, not the CPU. Unless you don\u0027t have a GPU, at which point, use linux.\u003C/p\u003E\u003Cp\u003EI am running a humble old laptop and launching ships with names like \u0022LEVIATHAN\u0022 with part counts over 900. I don\u0027t have a GPU to speak of, just some integrated mobile chip from back when AMD and Nvidia were on speaking terms. Sure, I turned down the graphics settings, which is a good start, but I didn\u0027t know about the Ubio Welding mod or the ocean tweak.\u003C/p\u003E\u003Cp\u003EThe big difference is the OS. When I found this laptop it was unusable because of its modest computing power and because Compaq, in the folly unique to corporate America, shipped it pre-installed with Vista. It would take a half-hour to boot. Its original owner was replacing it and told me I could have it for free if I got it to work. So I blasted it with linux.\u003C/p\u003E\u003Cp\u003EThere are slimmer distros out there, but ubuntu 12.04 is the distribution for migrating gamers, as the linux port of Steam was made for it. It\u0027s also the easiest to install and use; the distro\u0027s old tagline was \u0022linux for human beings.\u0022 Not that Unity is much better than Metro, but I replaced that desktop environment with gnome, and earned all the pretty ribbons you see in my signature. I\u0027ve sinced moved on to lubuntu, as its DE (and everything about it) is designed to be lightweight. Less RAM and clockcycles consumed by the OS means more RAM and clockcycles available for KSP.\u003C/p\u003E\n"},{"CreatedByName":"Aghanim","CreatedById":76587,"CreatedDateTime":"2014-02-02T09:11:08Z","Content":"\n\u003Cp\u003EAgreed. When I saw your opinion about Unity and lightweight I start to scream in my head: Use LXDE! Then I continued reading your post and then you say that you use lubuntu, which is Ubuntu with LXDE\u003C/p\u003E\u003Cp\u003EAgain, if anyone use Linux at this point, I suggest LXDE, with its minimalistic design but it allows for future eye candy optimization like conky or compiz effects, it really matches it\u003C/p\u003E\u003Cp\u003EAnd on topic with KSP, Linux have the upper hand of 64 bit KSP, which is good for loading all of those planet expansions mod\u003C/p\u003E\n"},{"CreatedByName":"fireflower","CreatedById":102309,"CreatedDateTime":"2014-02-02T21:43:26Z","Content":"\n\u003Cp\u003EWhat in the name of Gabe Newell\u0027s neckbeard - the other ports of KSP don\u0027t have a 64 bit version? Eat your vegetables, kids, there are PC gamers who still use Windows.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-06T15:30:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fireflower\u0022 data-cite=\u0022fireflower\u0022\u003E\u003Cdiv\u003EWhat in the name of Gabe Newell\u0027s neckbeard - the other ports of KSP don\u0027t have a 64 bit version? Eat your vegetables, kids, there are PC gamers who still use Windows.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is a Unity problem, not KSP/Squad.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-02-12T12:30:55Z","Content":"\n\u003Cp\u003EHere are another possible tweak to get even more speed:\u003C/p\u003E\u003Cp\u003E-use of ramdisk for all or a subset of game folders (people who have known the Amiga know what I\u0027m talking about \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ), ramdisk is a drive which use physical memory as storage, so it\u0027s... very fast ! Usefull for tons of small files (parts) or very huge files (KSP_Data, \u0026gt; 700 MB).\u003C/p\u003E\u003Cp\u003EThere is a shareware tool called Ramdisk than allow to do that on windows, free version allow up to 4GB drive, which is good enough for KSP.\u003C/p\u003E\u003Cp\u003E-in addition to ramdisk, there is also Junction Link Magic which allow to create symbolic links on windows (as on Unix* systems). If your computer and/or your power supply are not stable which may lead to data loss, you can create a KSP install on the ramdisk, and keep the \u0022saves\u0022 folder on a HD.\u003C/p\u003E\u003Cp\u003EI have tested the ramdisk as well as SSD full install for the game and it doesn\u0027t improve the performance so much (loading time still quite long, despite the fact I don\u0027t use tons of mods, with a HGST HTS54101A9E680 drive and an Intel Core i7-4700HQ 2.4GHz) and the symlinks can be usefull for SSD as KSP is not SSD friendly when logs are not disabled.\u003C/p\u003E\n"},{"CreatedByName":"yblad","CreatedById":103824,"CreatedDateTime":"2014-02-18T20:31:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rdude71\u0022 data-cite=\u0022rdude71\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E#4: Physics\u003C/p\u003E\u003Cp\u003EI really don\u0027t know how this works specifically, but I think everyone should do this. Go into your KSP directory, open your settings.cfg file, and then change your max physics delta per frame to 0. This guarantees good FPS. Note: This can cause some issues with physics, so if you want to play it safe, make it .1 instead of 0. However, glitches are very rare (for me anyways). I am not responsible if this somehow damages your hardware/software (under foreseeable circumstances, it won\u0027t)\u003C/p\u003E\u003Cp\u003E:\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m semi-certian a value of zero is impossible and is automatically rounded up a value on runtime. If it is at zero the game would be allowed to slow the simulation all the way down to a standstill i think. Or it may be that there is a failsafe in the code to stop this in which case setting to zero effectively is no different to setting it to one step higher anyway. I may be wrong on that, but I think I\u0027m right.\u003C/p\u003E\u003Cp\u003EActually setting it lower helps the physics be more accurate, but at the expense of your simulation time being lower than real time (1s in the game is less than 1s in the real world), setting it higher sacrifices accuracy in order to keep your simulation time high. If you want to make the game appear to run fast you want to be increasing this value. With a low value it run smoothly but slowly. So you will get better framerates but at the expense of things happening slowly on the screen. It doesn\u0027t actually effect performance, just where the performance is spent. It depends on what type of lag you prefer, the jutter/skipping of a low framerate and a bad simulation or the everything going smoothly and accurately but it taking 5 times as long for things to happen. \u003C/p\u003E\u003Cp\u003EYou can tell if the game is slowing down time by the colour of the timer. Green means everything is running at 1:1 speed, yellow means it\u0027s slowing things down.\u003C/p\u003E\n"},{"CreatedByName":"Lego8_bit","CreatedById":58076,"CreatedDateTime":"2014-03-02T15:44:02Z","Content":"\n\u003Cp\u003EOk ive been able to run ksp on barebone settings just fine on my 1 ghz dual core c-60 cpu on my netbook\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-03-08T01:33:32Z","Content":"\n\u003Cp\u003EIf you\u0027re having performance trouble, try this for a \u0022drop-in\u0022 fix: \u003Ca href=\u0022http://kerbalspaceprogram.com/fps-fix-performance-tweak-guide/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/fps-fix-performance-tweak-guide/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBefore that, I got horrible lag especially when looking at Kerbin. After, the game still runs at 10-15 FPS, but it doesn\u0027t feel so badly laggy.\u003C/p\u003E\n"},{"CreatedByName":"etheoma","CreatedById":69258,"CreatedDateTime":"2014-11-14T12:02:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003EA good CPU does indeed increase performance, but there is no reason to avoid a quad-core CPU. In general quad-core CPUs are all-around faster than dual-cores, especially on the desktop where dual-core is limited mostly to low end options.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIntel Pentium Processor G3258\u003C/p\u003E\u003Cp\u003EIt wont boost your performance vs a Quad but at Ã‚Â£55 and I don\u0027t know how much its going for in the US but you can over clock it to 4.7Ghz with load temps of 35 - 40C with a reasonably priced after market cooler.\u003C/p\u003E\u003Cp\u003Eand if you win the batch lottery and get a good to really good chip you can over clock it to 4.9-5Ghz and again its a Ã‚Â£55 chip you can burn the f***er in a year and buy another one and repeat that the next year and it will still be cheaper than a Intel Core i5 4690K.\u003C/p\u003E\u003Cp\u003EWhich personally I wouldn\u0027t over clock a 4690K for like 2 - 3 years after I bought it because I wouldn\u0027t want it to break any sooner because I personally couldn\u0027t afford to replace it but Ã‚Â£55 I can do that so in single threaded application or even dual threaded applications the G3258 is generally going to be a better performer for me.\u003C/p\u003E\u003Cp\u003EOh and the G3258 beats all the AMD chips when overcloaked also obviously you could over cloak the AMD chips also but the cheap once wont over clock so high and the more expensive once are more expensive.\u003C/p\u003E\u003Cp\u003EI say this having a 3570k and wishing I had waited a year for this chip. So its not like I\u0027m defending it because I have it and want to protect that decision.\u003C/p\u003E\u003Cp\u003EIts just that it is a really really good chip for the money.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-14T12:14:39Z\u0022 title=\u002211/14/2014 12:14  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 14, 2014\u003C/time\u003E by etheoma\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tandoori","CreatedById":125040,"CreatedDateTime":"2015-06-24T14:12:02Z","Content":"\n\u003Cp\u003EI\u0027ve been eyeing a new PC build, and it looks like the Devil\u0027s Canyon i7 4790K has a very good bang:buck ratio. I noticed, though, that the current performance metrics listed here actually shows better performance under the 4690K, when overclocked and used under x64 (presumably Linux, which is how I also run KSP).\u003C/p\u003E\u003Cp\u003E Is it safe to assume that under 1.1, the 4790K will be better utilized? Of course, I\u0027ll be playing other CPU intensive games as well, such as Cities Skylines, Civ, and Fallout 5 (this one will likely be much less CPU intensive).\u003C/p\u003E\u003Cp\u003EI\u0027ll likely wait for the Unity update before pulling the trigger anyway, since most of my gaming time is spent on KSP.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-24T16:33:15Z","Content":"\n\u003Cp\u003EYes, that is a safe assumption, I\u0027d say.\u003C/p\u003E\n"},{"CreatedByName":"harby","CreatedById":146420,"CreatedDateTime":"2015-07-08T14:49:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tandoori\u0022 data-cite=\u0022Tandoori\u0022\u003E\u003Cdiv\u003EI\u0027ve been eyeing a new PC build, and it looks like the Devil\u0027s Canyon i7 4790K has a very good bang:buck ratio. I noticed, though, that the current performance metrics listed here actually shows better performance under the 4690K, when overclocked and used under x64 (presumably Linux, which is how I also run KSP).\u003Cp\u003E Is it safe to assume that under 1.1, the 4790K will be better utilized? Of course, I\u0027ll be playing other CPU intensive games as well, such as Cities Skylines, Civ, and Fallout 5 (this one will likely be much less CPU intensive).\u003C/p\u003E\u003Cp\u003EI\u0027ll likely wait for the Unity update before pulling the trigger anyway, since most of my gaming time is spent on KSP.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E fallout 5? i know im a heavy sleeper but how long have i been under?\u003C/p\u003E\n"},{"CreatedByName":"Grhanley","CreatedById":152001,"CreatedDateTime":"2015-10-05T19:58:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tandoori\u0022 data-cite=\u0022Tandoori\u0022\u003E\u003Cdiv\u003EI\u0027ve been eyeing a new PC build, and it looks like the Devil\u0027s Canyon i7 4790K has a very good bang:buck ratio. I noticed, though, that the current performance metrics listed here actually shows better performance under the 4690K, when overclocked and used under x64 (presumably Linux, which is how I also run KSP).\u003Cp\u003E Is it safe to assume that under 1.1, the 4790K will be better utilized? Of course, I\u0027ll be playing other CPU intensive games as well, such as Cities Skylines, Civ, and Fallout 5 (this one will likely be much less CPU intensive).\u003C/p\u003E\u003Cp\u003EI\u0027ll likely wait for the Unity update before pulling the trigger anyway, since most of my gaming time is spent on KSP.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just bought the i7 4790k with the asus z97 board and got the nvidia gforce 980ti and have 32 g of ram. The game runs a like a dream under 450 parts. I would just do that setup and never look back. The computer that I just built cost $1100 and I will last me for over 3 years of gaming at the highest quality.\u003C/p\u003E\n"}]}