{"TopicId":53742,"ForumId":50,"TopicTitle":"Korbital Mechanics Lab - Delta-V","CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-11-20T05:16:40Z","PageNum":1,"Articles":[{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-11-20T05:16:40Z","Content":"\n\u003Cp\u003EHere is a lab I put together that explains what Delta-V is, why we need it, and how to get more of it in your rocket builds by focusing on the mathematics behind the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Tsiolkovsky_rocket_equation\u0022 rel=\u0022external nofollow\u0022\u003ERocket Equation\u003C/a\u003E and what this equation can tell us about the benefits of using staging.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/Zh3mOVagYdo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EEnjoy!\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-20T06:02:45Z","Content":"\n\u003Cp\u003EGenerally well-explained. Nicely done \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The only real quibble I have in its current form is that you mixed up \u003Cem\u003Eescape\u003C/em\u003E velocity and \u003Cem\u003Eexhaust\u003C/em\u003E velocity, which are two very different things.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-11-20T06:10:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EGenerally well-explained. Nicely done \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The only real quibble I have in its current form is that you mixed up \u003Cem\u003Eescape\u003C/em\u003E velocity and \u003Cem\u003Eexhaust\u003C/em\u003E velocity, which are two very different things.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the comment and correction! (I added a comment to the video, and blamed you for it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E )\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-20T09:56:39Z","Content":"\n\u003Cp\u003EGreat work. How much patience must it have taken to describe it all in this detail and simplicity!\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-11-20T22:46:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003EGreat work. How much patience must it have taken to describe it all in this detail and simplicity!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. =) To me, that\u0027s the largest part of the fun for these kinds of tutorials, learning the topic well enough to describe it simply... and then apply it to my builds! I\u0027m really looking forward to upcoming let\u0027s plays as I will be able to use this knowledge to make much better rockets.\u003C/p\u003E\u003Cp\u003EHere\u0027s an idea - show me some before / after style images of how you guys applied the concept of staging to maximize delta-v in your builds!\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-20T23:11:12Z","Content":"\n\u003Cp\u003ESee my website in the signature. You\u0027re welcome to quote it.\u003C/p\u003E\u003Cp\u003EI gathered such a collection (on the front page) once in this thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/51961-Post-some-of-your-huge-rockets-for-distant-missions\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/51961-Post-some-of-your-huge-rockets-for-distant-missions\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-21T00:38:09Z","Content":"\n\u003Cp\u003ESince you\u0027ve asked:\u003C/p\u003E\u003Cp\u003EThe \u0022before\u0022 shot was my first Mun lander design, from somewhere back in 0.18 or so when I barely knew what I was doing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jThFIT3.png\u0022 alt=\u0022jThFIT3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt made it there and back, but it was an incredible hassle getting it both built and flown.\u003C/p\u003E\u003Cp\u003EThe \u0022after\u0022 pic is from one of my more recent Mun lander designs (not Apollo-style this time):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MhkNTUn.png\u0022 alt=\u0022MhkNTUn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMuch more practical than that other massive monstrosity \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, since I took all the trouble to dig it up (before rereading the original post and realizing I was looking for the wrong thing), \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/50966-How-to-use-T-W-when-designing-a-lander?p=665627\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u0027s an older post\u003C/a\u003E where I worked out the math for optimizing a payload to fit a given mission. It\u0027s only a single-stage calculation, and Kulebron covers the same subject in a little more depth on his website, but I thought it might be useful.\u003C/p\u003E\n"},{"CreatedByName":"AuoroP","CreatedById":92186,"CreatedDateTime":"2013-12-01T17:57:14Z","Content":"\n\u003Cp\u003EIn answering the question why do I care, you missed the biggest in my mind: it gives you the power to plan your rocket stages.\u003C/p\u003E\u003Cp\u003E I would have preffered if you\u0027d used the Isp and constant version of the rocket equation because people will have seen that value in the game and and maybe even have an idea that it relates to rocket efficiency. Your example just seem to just randomly pick a exhaust velocity which doesn\u0027t help people plan better rockets. A good, but dated, example is the wiki\u0027s advanced rocket design.\u003C/p\u003E\u003Cp\u003EI \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57380-Refined-Kerbin-delta-v-Launch-1500-m-s-Up-3000-m-s-Gravity-Turnhttp://\u0022 rel=\u0022external nofollow\u0022\u003Erecently showed\u003C/a\u003E that you need a delta-v of 1500 m/s to get out of the lower atmosphere and a delta-v of 3000 m/s to get into low Kerbin orbit. Surely, being able to plan rocket stages knowing when you\u0027ll hit these two marks is a huge reason to care about delta-v. Other people have made delta-v maps that then tell you how much delta-v it will take to get around the Kerbol system.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-12-02T07:22:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AuoroP\u0022 data-cite=\u0022AuoroP\u0022\u003E\u003Cdiv\u003EIn answering the question why do I care, you missed the biggest in my mind: it gives you the power to plan your rocket stages.\u003Cp\u003E I would have preffered if you\u0027d used the Isp and constant version of the rocket equation because people will have seen that value in the game and and maybe even have an idea that it relates to rocket efficiency. Your example just seem to just randomly pick a exhaust velocity which doesn\u0027t help people plan better rockets. A good, but dated, example is the wiki\u0027s advanced rocket design.\u003C/p\u003E\u003Cp\u003EI \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57380-Refined-Kerbin-delta-v-Launch-1500-m-s-Up-3000-m-s-Gravity-Turnhttp://\u0022 rel=\u0022external nofollow\u0022\u003Erecently showed\u003C/a\u003E that you need a delta-v of 1500 m/s to get out of the lower atmosphere and a delta-v of 3000 m/s to get into low Kerbin orbit. Surely, being able to plan rocket stages knowing when you\u0027ll hit these two marks is a huge reason to care about delta-v. Other people have made delta-v maps that then tell you how much delta-v it will take to get around the Kerbol system.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for your comments!\u003C/p\u003E\u003Cp\u003EI tried to mention in the video that (generally) more Dv = more capability to reach more places. 0:20 to 0:30 says on a basic level, that the sum of the things a rocket can do is reliant on its total Dv. However, it is a but unclear how that pertains to TWR, but that is covered in my other tutorial and other great ones around the net. The main purpose of this video was really to go over the math and science behind Dv in rocketry, so that people could more intuitively understand what the math is predicting. What (I hope) people learn from the video is that having simpler rockets tends to have more delta-v because the empty weight is reduced. Adding appropriate staging, especially the use of asparagus staging, really makes sense mathematically (it\u0027s not just a game glitch or exploit - it really is more efficient in most cases, and the math supports that.)\u003C/p\u003E\u003Cp\u003EWhy do you need more Delta-V? To go farther away from Kerbin.\u003C/p\u003E\u003Cp\u003EHow do we get more Delta-V? The math tells us that Fuel% and Engine efficiency only get us so far - but even these limits can be increased by staging.\u003C/p\u003E\n"}]}