{"TopicId":54697,"ForumId":50,"TopicTitle":"Maximum possible dV for a single stage","CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2013-11-29T17:25:45Z","PageNum":1,"Articles":[{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2013-11-29T17:25:45Z","Content":"\n\u003Cp\u003EI was looking through the KW rocketry parts the other day and comparing them to the vanilla parts and I noticed that the KW rocketry fuel parts had a mass ratio of 10-1 while the vanilla parts all have a ratio of 9-1. \u003C/p\u003E\u003Cp\u003EContemplating the consequence of this, it kind of hit me; there is an upper maximum limit to how much dV is possible with a single-stage rocket no matter what you do. Because the Tsiolkovsky rocket equation works off of this ratio it is impossible to build a rocket with a mass ratio greater than it.\u003C/p\u003E\u003Cp\u003ESo for an LV-30 or LV-45 with stock tanks this is\u003C/p\u003E\u003Cp\u003E9.81*370*LN(9/1) or 7,975 m/s\u003C/p\u003E\u003Cp\u003EAn LV-909 gives us 8,406 m/s\u003C/p\u003E\u003Cp\u003EAnd the LV-N is capable of 17,244 m/s\u003C/p\u003E\u003Cp\u003EIf you\u0027re into RCS ports you\u0027re looking at\u003C/p\u003E\u003Cp\u003E9.81*290*LN(17/2) or 6,088 m/s\u003C/p\u003E\u003Cp\u003EIon engines have an upper limit of\u003C/p\u003E\u003Cp\u003E9.81*4200*LN(12/5) which gives us 36,071 m/s\u003C/p\u003E\u003Cp\u003EOf course we\u0027re looking at this from the impossible assumption of 100% of the mass of the vehicle being fuel tanks, but these are the limit values you should start to approach as fuel tank mass starts to dominate the mass of the stage.\u003C/p\u003E\u003Cp\u003EI know someone plotted these out more fully than this, but I don\u0027t think they pointed out that there was an unbreachable ceiling to the equation.\u003C/p\u003E\u003Cp\u003EAnyway, food for thought I suppose. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-29T23:53:26Z","Content":"\n\u003Cp\u003EAn astute observation, and one that\u0027s indeed not obvious to those not familiar with the math. Nicely done!\u003C/p\u003E\n"},{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2013-12-02T17:56:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EAn astute observation, and one that\u0027s indeed not obvious to those not familiar with the math. Nicely done!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. It feels like one of those things that should\u0027ve been obvious, but I guess I hadn\u0027t thought about it like that before then. I\u0027m sure that there\u0027s a point of diminishing returns that you run into well before the limit, but I haven\u0027t sat down and run the numbers to see where it lies at.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-12-02T23:53:17Z","Content":"\n\u003Cp\u003EThis is why SSTO isn\u0027t going to happen on Eve without some strange tricks. But, when you stage off those empty tanks, you break the maximum.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-12-03T03:16:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WafflesToo\u0022 data-cite=\u0022WafflesToo\u0022\u003E\u003Cdiv\u003EThanks. It feels like one of those things that should\u0027ve been obvious, but I guess I hadn\u0027t thought about it like that before then. I\u0027m sure that there\u0027s a point of diminishing returns that you run into well before the limit, but I haven\u0027t sat down and run the numbers to see where it lies at.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d imagine that there\u0027s some practical limit that\u0027s relatively easy* to calculate for an SSTO vehicle using a given engine. In an atmosphere, an ideal ascent profile\u0027s earliest stage is more or less going to follow terminal velocity, at least until it reaches the point where the atmosphere thins out faster than the engines can reasonably accelerate the craft as a whole, and a single engine\u0027s thrust, mass, and rate of fuel consumption are all known, fixed** values.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* \u0022Relatively easy,\u0022 of course, should not be taken in this case to mean \u0022absolutely easy,\u0022 as the math is probably something that requires calculus, which honestly is a bit beyond my own level of knowledge. Still, it\u0027s probably easier to calculate the ideal proportion for this one case than for \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Eevery\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E possible case, which is what I mean by way of comparison.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E** In the sense that, in the particular case of fuel consumption, it\u0027s linked to Isp, which for rocket engines rises in a linear inverse proportion as atmospheric pressure falls. If we assume a fixed amount of thrust with no throttle variation, this again should become relatively easy to calculate -- though, again, see the caveat mentioned above on what \u0022relatively easy\u0022 means in this context.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-12-03T04:34:09Z","Content":"\n\u003Cp\u003EMax theoretical dV is just the limit of infinite fuel tanks at the best mass ratio your component choices allow. Max practical dV is a function of TWR. Flip through \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/45155-Mass-optimal-engine-type-vs-delta-V-payload-and-min-TWR\u0022 rel=\u0022external nofollow\u0022\u003Emy charts\u003C/a\u003E and you\u0027ll see that for high TWR, there\u0027s an upper limit of dV on the right side of the chart, that just isn\u0027t possible at a given TWR with the engines and fuel tanks we have. Play around with \u003Ca href=\u0022http://dl.dropboxusercontent.com/u/8244638/KSP%20Design%20Optimizer%20v02.html\u0022 rel=\u0022external nofollow\u0022\u003Ethe spreadsheet version\u003C/a\u003E and you can see that as dV gets close to the max possible for a given TWR, the craft mass increases very quickly relative to the payload.\u003C/p\u003E\n"},{"CreatedByName":"AuoroP","CreatedById":92186,"CreatedDateTime":"2013-12-03T05:33:06Z","Content":"\n\u003Cp\u003EVery clever insight!\u003C/p\u003E\u003Cp\u003EI did notice a couple of caveats. The OP is correct that FL and Rockomax tanks have a ratio of 9:1 but there are a couple tiny LF tanks with their own ratios: ROUND-8\u0027s is 5.44 (full 0.136t and emtpy 0.025t), Oscar-B\u0027s is 5.25 (full 0.078675t empty 0.015t).\u003C/p\u003E\u003Cp\u003EThe OP also missed jet engines and jet fuel. A basic jet engine has an Isp of 2000 at sea level. The Mk1 fuelselage has a ratio of 3.14 and all the others have a ratio of 5 (exactly). Putting the best possible case together we have\u003C/p\u003E\u003Cp\u003E31,577 m/s = 2000 s * 9.81 m/s^2 * ln(5/1)\u003C/p\u003E\u003Cp\u003EI also wanted to more verbosely explain the OP. The ratio the OP was talking about is the mass ratio used in the rocket equation: Mfull / Mempty. The Rockomax X200-16 (handily) has a full mass of 9 t and an empty mass of 1 t. \u003C/p\u003E\u003Cp\u003EThe OP had the insight that all the FL and Rockomax fuel tanks have a ratio of 9 t / 1 t and further that as you keep adding more and more tanks the weight of the engine becomes more and more neglible unil we just throw away all other mass besides fuel tanks and we get an upper limit on an idealized stage delta-v that is, for the LV-909:\u003C/p\u003E\u003Cp\u003E8,400 m/s = 390 s * 9.81 m/s^2 * ln(9/1)\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-12-03T05:39:53Z","Content":"\n\u003Cp\u003EJets don\u0027t use the rocket equation in quite the same way, since they don\u0027t have to carry their own oxidizer. I think you can effectively multiply the Isp by the ratio of intake air to fuel mass (or is it intake air plus fuel mass, divided by fuel mass? I forget which). numerobis knows for sure and hopefully correct me here.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-12-03T19:32:09Z","Content":"\n\u003Cp\u003EMultiply Isp by 15, since you burn 15 air per unit fuel. I think -- unless it\u0027s multiply by 16, because fuel is 1/16th of the mixture. However, thrust on a KSP jet depends on your speed, so the deltaV you achieve is not what the Tsiolkovski equation predicts (it\u0027s lower). And you\u0027re operating near a planet, which means gravity and drag losses matter a lot. So I don\u0027t see much utility in this metric for jets.\u003C/p\u003E\u003Cp\u003EYou could measure max dV assuming you maintain 1 km/s and you\u0027re burning stored intake air. Intakes are very inefficient tanks (0.15 full to 0.1 empty for radials, 0.11 full to 0.1 empty for rams), so I count the LV-N as outperforming a jet on this metric.\u003C/p\u003E\n"},{"CreatedByName":"AuoroP","CreatedById":92186,"CreatedDateTime":"2013-12-03T21:04:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EMultiply Isp by 15, since you burn 15 air per unit fuel. I think -- unless it\u0027s multiply by 16, because fuel is 1/16th of the mixture. However, thrust on a KSP jet depends on your speed, so the deltaV you achieve is not what the Tsiolkovski equation predicts (it\u0027s lower). And you\u0027re operating near a planet, which means gravity and drag losses matter a lot. So I don\u0027t see much utility in this metric for jets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Isp I used was already 2.5 times higher than the magical Ion drive so I just want to check that the game hasn\u0027t already accounted for what your adjustment. Otherwise, I would dismiss gravity and drag losses not being accounted for with any other theoretical limits and arrive at 473,657 m/s.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EIntakes are very inefficient tanks (0.15 full to 0.1 empty for radials, 0.11 full to 0.1 empty for rams), so I count the LV-N as outperforming a jet on this metric.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not seeing why this is true. Higher ratios means higher limits so ratios 15:1 or 11:1 beat the otherwise winners FL and Rockomax ratios of 9:1 but I don\u0027t see how that relates to efficacy. A single intake is a small fraction of the mass of a LF tank but provides unbounded oxidizer but if you insist on bringing your own oxidizer with you then 55%, 110/(90\u002B110), of your LF tank is oxidizer a jet engine doesn\u0027t need.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-12-03T22:38:26Z","Content":"\n\u003Cp\u003EThe 15:1 ratio is the ratio of IntakeAir:LiquidFuel that the engine burns. If you multiply Isp by 16 (or 15, whichever is right) you\u0027re assuming IntakeAir is for free. Which is a halfway reasonable assumption.\u003C/p\u003E\u003Cp\u003EMy only problem is that, while the maximum deltaV for a given single-stage spacecraft is something that gives you a good idea of performance limits in interplanetary space, the max deltaV for a jet tells you very little. For the basic jet, you\u0027re measuring how much dV you can achieve as long as the jet stays at sea level and never actually moves (since thrust goes down with speed). For the turbojet, you\u0027re measuring how much dV you can achieve as long as the jet stays at precisely 6020m altitude (max Isp ~2525) and is going precisely 1 km/s (to achieve the stated thrust). Neither of these is a useful model of a flight.\u003C/p\u003E\u003Cp\u003EOn the flip side, it\u0027s definitely useful to assume you\u0027ll be getting about 10ks Isp when measuring out how much fuel you should pack for your flight.\u003C/p\u003E\u003Cp\u003EThe second ratio I mentioned, 0.15:0.1, is the ratio of full:dry mass of a radial intake, i.e. the ratio that goes into the log in your equation. Intakes are tanks of air: close them before liftoff, and they\u0027ll be full. Bring them to orbit and you can burn their stored IntakeAir in a 15:1 ratio with LiquidFuel, in the vacuum. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/27296-The-MachingBird-Challenge%21?p=683404\u0026amp;viewfull=1#post683404\u0022 rel=\u0022external nofollow\u0022\u003EFor example\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"AuoroP","CreatedById":92186,"CreatedDateTime":"2013-12-04T06:02:25Z","Content":"\n\u003Cp\u003EI checked and 1km/s does not exceed terminal velocity as long as you\u0027re above 23.395 km. This is not true for 6.020 km whose terminal velocity is is 181.0 m/s. I don\u0027t have hard data on this but my intuition tells me that terminal velocity is a cruise limit for jet engines and the flight you\u0027re suggesting exceeds this limit by 552%. So I\u0027ll admit that drag loss would make this cruise only theoretical.\u003C/p\u003E\u003Cp\u003EI got a laugh out of imagining a Bob Kermin putting two jet engines (front and back) on a fuel tank and speeding ahead until they\u0027re exceed 1m/s and yelling OMG TOO FAST!!! STOP!!! I never liked Bob because what always seemed to freak him out was being in space. I\u0027ve long suspected Kerbal nepotism: a Kerbal senator\u0027s wife\u0027s useless brother needing a job? Finally a test arises which is ideally suited to him! I can also imagine how much happier Jeb would be if he were cruising along at 1km/s in a jet and then decided to stop because Bob\u0027s screaming was ruining the experience. We would know that stopping would require a delta-v of 1000 m/s.\u003C/p\u003E\u003Cp\u003EStill if there is a maximum possible delta-v for a single stage, I still think there should be a value for jets; even with a star and a guffawing laugh beside it. What number would you pick? I\u0027ll be enjoying my first flight with Bob Kermin the jet sailor!\u003C/p\u003E\n"},{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2013-12-07T04:51:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tavert\u0022 data-cite=\u0022tavert\u0022\u003E\u003Cdiv\u003EMax theoretical dV is just the limit of infinite fuel tanks at the best mass ratio your component choices allow. Max practical dV is a function of TWR. Flip through \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/45155-Mass-optimal-engine-type-vs-delta-V-payload-and-min-TWR\u0022 rel=\u0022external nofollow\u0022\u003Emy charts\u003C/a\u003E and you\u0027ll see that for high TWR, there\u0027s an upper limit of dV on the right side of the chart, that just isn\u0027t possible at a given TWR with the engines and fuel tanks we have. Play around with \u003Ca href=\u0022http://dl.dropboxusercontent.com/u/8244638/KSP%20Design%20Optimizer%20v02.html\u0022 rel=\u0022external nofollow\u0022\u003Ethe spreadsheet version\u003C/a\u003E and you can see that as dV gets close to the max possible for a given TWR, the craft mass increases very quickly relative to the payload.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think your charts were the ones I was thinking of (god the 48-7S is OP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E, wonder how they\u0027d fair now?)\u003C/p\u003E\u003Cp\u003EI\u0027m not usually concerned with TWR for my cruise-stages (landers are a different story though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E) so the limit is of some interest to me. I haven\u0027t sat down to analyze the curve yet to find where the point of diminishing returns (and thus the effective stage limit) is at.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003E...jets... dV calculations... etc .\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJet engines are such an enigma to me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I don\u0027t even have any idea how the calculations for those work.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-07T05:01:03Z\u0022 title=\u002212/07/2013 05:01  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 7, 2013\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003Cbr\u003EMerging sequential posts\n\u003C/span\u003E\n"}]}