{"TopicId":71240,"ForumId":50,"TopicTitle":"Action Groups.?? how do you set one up please","CreatedByName":"sam1133","CreatedById":107853,"CreatedDateTime":"2014-05-02T17:32:03Z","PageNum":1,"Articles":[{"CreatedByName":"sam1133","CreatedById":107853,"CreatedDateTime":"2014-05-02T17:32:03Z","Content":"\n\u003Cp\u003EHi, i just cant figure how to set up an action group, am particularly interested in setting up custom action groups...any help please.\u003C/p\u003E\u003Cp\u003Efrom a newbie...keen to learn...knows nothing...lol\u003C/p\u003E\u003Cp\u003Ethank you\u003C/p\u003E\u003Cp\u003Esam\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2014-05-02T17:38:03Z","Content":"\n\u003Cp\u003ETechnically, this should go in the above section, but...\u003C/p\u003E\u003Cp\u003EThere\u0027s a tab, located at 1/3 to the right from the top-left corner of the VAB, called \u0022Action Groups\u0022. Click it. A whole bunch of little-er tabs pop up. \u0022Abort\u0022, \u0022Stage\u0022, and \u0022Gear\u0022 are among them, but you are looking for the ones that say \u0022Custom[insert number here]\u0022 They correspond to the number keys: Custom01 = 1, Custom09 = 9, etc...\u003C/p\u003E\u003Cp\u003EClick on one of them. Then click on a part, say, an engine. In one of the little side tabs, some boxes should appear. Click \u0022Toggle\u0022 or \u0022Toggle Engine\u0022. Now, when you hit the corresponding button on the keyboard/numberpad, the engine will activate-deactivate via a press of the number.\u003C/p\u003E\u003Cp\u003EFiddle with it a little, it\u0027s really fairly self-explanatory.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-05-02T18:38:52Z","Content":"\n\u003Cp\u003EWell, some of it is pretty non-explanatory. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E But that\u0027s okay, because you can post any additional question you have as well, sam1133.\u003C/p\u003E\n"},{"CreatedByName":"sam1133","CreatedById":107853,"CreatedDateTime":"2014-05-02T19:18:05Z","Content":"\n\u003Cp\u003Estarwhip bless your heart, thank you...now the mystery is gone...brilliant...really got to say, of all the forums i have ever been on, people here are so kind and quick to respond...such nice intelligent and helpful people...and ksp is probably the best sim-game i have ever had, and that is like out of around 1,500 of them...yes it is alot, but have had a long term serious illness, tho much better now.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-05-05T01:17:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sam1133\u0022 data-cite=\u0022sam1133\u0022\u003E\u003Cdiv\u003E... am particularly interested in setting up custom action groups ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks like you\u0027re sorted but for you and anyone else wanting more than the stock VAB/SPH action groups can offer there are two mods which might be of interest: 1) AGM (Action Group Manager) allows you to re-configure your action groups in-flight, should you find you\u0027ve forgotten to set them up or done so incorrectly. AGX (Action Groups Extended) goes beyond that and lets you create up to 250(!) action groups in the VAB/SPH or in-flight. Should your keyboard inexplicably not have 250 spare keys AGX provides a clickable-button window for the groups you define.\u003C/p\u003E\n"}]}