{"TopicId":74246,"ForumId":50,"TopicTitle":"A detailed look at Kerbal\u0026#039;s jet engines","CreatedByName":"Iffn","CreatedById":52586,"CreatedDateTime":"2014-06-05T22:47:23Z","PageNum":1,"Articles":[{"CreatedByName":"Iffn","CreatedById":52586,"CreatedDateTime":"2014-06-05T22:47:23Z","Content":"\n\u003Cp\u003EThe in-game information as well as \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Jet_engine\u0022 rel=\u0022external nofollow\u0022\u003Ethe current KSP wiki article on jet engines\u003C/a\u003E give some indication on the performance of jet engines in KSP. However they are usually not enough when building optimized SSTO\u0027s.\u003C/p\u003E\u003Cp\u003EThis is why I started analysing the vanilla engine components. So far, I\u0027ve made the following discoveries: \u003Ca href=\u0022http://imgur.com/a/hOcvk\u0022 rel=\u0022external nofollow\u0022\u003E[Graphs in Imgur album]\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xJ7ttKm.png\u0022 alt=\u0022xJ7ttKm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFindings on thrust and speed:\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe maximum thrust of an engine is always relative to the current air speed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Basic Jet works well at low speeds but is unsuitable for fast aircrafts, even if they fly at high altitude with minimum drag.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDue to it\u0027s high thrust at low speeds, the basic jet can be used as a first stage engine for a ballistic rocket.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBoth the Turbo Jet as well as the RAPIER engine in jet mode peak at surface speeds of 1000m/s and work well beyond that. (Note: I\u0027ve cut off the graph at 1500m/s, however, the curve would continue beyond that. The turbo jet will reach 0kN 2400m/s, while the rapier reaches 0kN at 2200m/s.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZprlzJU.png\u0022 alt=\u0022ZprlzJU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFindings on thrust and time:\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAll jet engines have long start up times, which makes them difficult to use in VTOLs, since they need a short response time.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAccording to my analysis, the Turbo Jet is able to increase it\u0027s thrust slightly faster then the Basic Jet despite a lower peak.\u003Cbr\u003E(Measurements taken at fixed ground location)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TY5Z1gN.png\u0022 alt=\u0022TY5Z1gN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFindings on fuel flow and altitude:\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EJet engines are very efficient compared to rocket engines.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe fuel flow is only relative to altitude. That means that a fully spooled up Turbo Jet at maximum throttle at a certain altitude always uses the same amout of fuel per second, no matter how much thrust it produces.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFor those flying on Laythe: The graph below was made using data from Kerbin. I assume the ISP is actually calculated relative to air pressure instead of altitude above sea level. However, I haven\u0027t tested this so far. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/28812-Atmospheric-Density-Table?p=355226\u0026amp;viewfull=1#post355226\u0022 rel=\u0022external nofollow\u0022\u003E[For comparison]\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECompared to the other jet engines, the basic jet is very efficient when flying below 5000m. Above that, Turbo Jet and RAPIER engines are usually much more efficient since they\u0027re able to fly much faster due to the reduced drag at higher altitudes.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The indicated ISP is also relative to altitude as seen \u003Ca href=\u0022http://i.imgur.com/CASOI0U.png\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. However, there seems to be no direct connection between fuel flow, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Isp\u0022 rel=\u0022external nofollow\u0022\u003Eactual ISP\u003C/a\u003E and indicated ISP.\u003Cbr\u003E\u003Cbr\u003E\u003Cimg src=\u0022http://i.imgur.com/GHdIG1J.png\u0022 alt=\u0022GHdIG1J.png\u0022\u003E\u003Cbr\u003E\u003Cstrong\u003EFindings on intake air flow, speed and air pressure:\u003C/strong\u003E\u003Cul\u003E\u003Cli\u003EThe intake air flow is relative to air pressure an speed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe graphs above show the intake air flow relative to speed at Kerbin sea level. (= 1 atm)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe approximate formula of these is are as follow. They shouln\u0027t deviate more then 0.5% from the actual intake air flow : (Q = intake air flow, v = speed)\u003Cbr\u003E - Ram Air Intake: Q = 0.096 * v \u002B 58.7\u003Cbr\u003E - Circular Intake: Q = 0.078 * v \u002B 47.0\u003Cbr\u003E - Engine Nacelle: Q = 0.049 * v \u002B 29.3\u003Cbr\u003E - XM-G50 Radial Air Intake: 0.039 * v \u002B23.5\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDue to the angle of attack, the movement speed will usually differ from the speed at the air intakes.\u003Cbr\u003E The true intake speed can be viewed by right clicking the air intake and subtracting 100 from the indicated Air Speed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThese values can be multiplied by the current air pressure measured by the PresMat Barometer to get the intake air flow at higher altitudes. (Stock part, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/PresMat_Barometer\u0022 rel=\u0022external nofollow\u0022\u003E[wiki page]\u003C/a\u003E)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI hope this information will help some of you to better understand the different jet engines in KSP and to fly SSTOs at even higher speeds before switching to rocket power.\u003C/p\u003E\u003C/li\u003E\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-13T13:21:03Z\u0022 title=\u002207/13/2014 01:21  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 13, 2014\u003C/time\u003E by Iffn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-06-06T09:56:22Z","Content":"\n\u003Cp\u003EGood work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E, thanks.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Iffn\u0022 data-cite=\u0022Iffn\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cstrong\u003EFindings on ISP and altitude:\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe indicated Specific Impulse (=ISP) is only relative to altitude\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Isp\u0022 rel=\u0022external nofollow\u0022\u003EAccording to the KSP\u003C/a\u003E wiki, the ISP is calculated by dividing the engine thrust by the fuel consumption. however, there seem to be some problems with the current version as \u003Ca href=\u0022http://i.imgur.com/90xE8RR.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis picture\u003C/a\u003E shows.\u003Cbr\u003E Fuel flow: 0.01348U, Thrust: 0.0kN, Specific Impulse: 1133.0s\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHave you look deeper into how KSP really work vs real life ? ISP on wiki seems to be generic formula, not that\u0027s used in game as engines are defined by one or both of these two tables (TurboJet Engine example):\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EatmosphereCurve\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E key = 0 1200\u003C/p\u003E\u003Cp\u003E key = 0.3 2500\u003C/p\u003E\u003Cp\u003E key = 1 800\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003E velocityCurve\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E key = 0 0.5 0 0\u003C/p\u003E\u003Cp\u003E key = 1000 1 0 0\u003C/p\u003E\u003Cp\u003E key = 2000 0.5 0 0\u003C/p\u003E\u003Cp\u003E key = 2400 0 0 0\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1st is ISP at a given altitude and 2nd is thrust at a given speed.\u003C/p\u003E\u003Cp\u003EvelocityCurve is used for jet/air breathing engines only.\u003C/p\u003E\u003Cp\u003ESome explanations are \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/45252-Need-Help-Understanding-VelocityCurve-and-AtmosphereCurve?highlight=atmosphereCurve\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Iffn","CreatedById":52586,"CreatedDateTime":"2014-06-08T18:33:13Z","Content":"\n\u003Cp\u003EI\u0027ve replaced the \u0022Indicated ISP relative to altitude\u0022 part with a new \u0022Fuel flow relative to altitude\u0022 graph, since there seems to be no direct connection between the indicated ISP and fuel flow.\u003C/p\u003E\u003Cp\u003E@Justin Kerbice,\u003C/p\u003E\u003Cp\u003EThank you for the information. I assume those are the values KSP uses to create the shape of those graphs above. It would be interesting to know what the exact formulas are though. This would enable players to calculate, at what speed an altitude they need to fly their SSTO in jet mode without the engine stalling.\u003C/p\u003E\n"},{"CreatedByName":"eempc","CreatedById":110483,"CreatedDateTime":"2014-06-09T14:02:18Z","Content":"\n\u003Cp\u003EVery useful information, thanks for sharing this!\u003C/p\u003E\n"},{"CreatedByName":"Pondafarr","CreatedById":99169,"CreatedDateTime":"2014-06-30T20:03:14Z","Content":"\n\u003Cp\u003EGiven 2 ram intakes (oriented towards airflow) and two circular intakes (at 90deg), how would I determine optimal altitude to switch from basic to turbo engines? \u003C/p\u003E\u003Cp\u003EFrom one of these graphs, it appears that the turbo gets better ISP than the basic right about 250m/s, but I don\u0027t see anything about altitude?\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-06-30T20:16:44Z","Content":"\n\u003Cp\u003EFuel flow/altitude chart: \u0022Compared to the other jet engines, the basic jet is very efficient when flying below 5000m.\u0022\u003C/p\u003E\u003Cp\u003ESo, presumably, the only time to bother with basic jets is flying \u0026lt;250m/s and \u0026lt;5km alt. The \u0027trainer\u0027 plane in my tutorial uses one, but mostly just to show how limited it is, otherwise I\u0027d always get height above 5km in the first half-minute or so of a flight. The only other time I\u0027ll be anywhere in those constraints is when landing, in which case the engine won\u0027t be doing much more than idling anyway.\u003C/p\u003E\n"},{"CreatedByName":"Iffn","CreatedById":52586,"CreatedDateTime":"2014-07-13T13:15:43Z","Content":"\n\u003Cp\u003EPecan is correct, a plane using Basic Jets is pretty limited above 250m/s and 10km altitude.\u003C/p\u003E\u003Cp\u003EHowever, they are very useful when used as first stage engines for a ballistic rockets.\u003C/p\u003E\u003Cp\u003EA single Basic Jet can accelerate a 13 tonne rocket to around 250m/s vertical speed and, when using 2 radial air intakes, an altitude of almost 30km before stalling. In my test, it only used around 25 units of fuel to do so, which makes it extreme efficient compared to normal rockets. A second stage using conventional rockets should then be able to bring the payload efficiently into orbit.\u003C/p\u003E\u003Cp\u003ECompared to that, a Turbo Jet can only lift around 11 tonnes of rocket and uses a lot more fuel at low altitudes. While it would be theoretically able to accelerate to a higher speed due to the increasing thrust at higher speeds, vertically ascending rockets usually reach the stalling altitude before this comes into effect.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EFinding added to the original post\u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-13T13:26:44Z\u0022 title=\u002207/13/2014 01:26  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 13, 2014\u003C/time\u003E by Iffn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-07-13T17:44:38Z","Content":"\n\u003Cp\u003EThanks for these graphs! Also for the posts \u0026amp; replies, everyone. I\u0027ve experimented with mixed jet boosting systems, which I\u0027ve found interesting. Using KER, the turbojet appears to show a higher dV than the basic jet or the RAPIER in air mode. Same with the TWR.\u003C/p\u003E\n"},{"CreatedByName":"einsteiner","CreatedById":71000,"CreatedDateTime":"2014-07-20T08:11:06Z","Content":"\n\u003Cp\u003EWould you mind posting or messaging me the raw data your excellent plots are made from? I would like to calculate the altitude/speed flameout limit for various engine configurations.\u003C/p\u003E\n"},{"CreatedByName":"Iffn","CreatedById":52586,"CreatedDateTime":"2014-07-23T09:43:31Z","Content":"\n\u003Cp\u003ESure einsteiner, I put it on my Dropbox to download, created in Microsoft Excel 2013. \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/92246239/JetEngineData.xlsx\u0022 rel=\u0022external nofollow\u0022\u003E[Link]\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-07-24T09:48:55Z","Content":"\n\u003Cp\u003EI use basics for most of my heavy lifter SSTOs. They have another property you have not discovered. They are faster below 10km than turbos. Take a plane w/ TWR \u0026gt; 1 and put one basic on it and observe your top speed at ground level. Now take those same parts and put two turbos on it. Now try three and four turbos. You\u0027ll notice a single basic will achieve a higher top speed. This an exceptional property for building up vertical speed at the start of your ascent profile. One basic with one turbo will always carry a 25T craft with a nuke into space. That\u0027s around 5km\u0027s dV@LKO, or more if you are spamming intakes. I scale that principle up for heavy lifters and use that engine combination as my design baseline.\u003C/p\u003E\n"},{"CreatedByName":"Iffn","CreatedById":52586,"CreatedDateTime":"2014-07-25T12:16:02Z","Content":"\n\u003Cp\u003ESimplified, an aircraft flying horizontally in KSP can accelerate until the engine thrust equals the drag. The Basic Jet has a higher thrust than the Turbo Jet below ~230m/s as seen on my \u0027Engine thrust relative to speed\u0027 diagram. An aircraft is usually slower at lower altitudes due to the higher air density resulting in a higher drag.\u003C/p\u003E\u003Cp\u003ESo I assume your aircraft is faster with Basic Jets because it is slower than 230m/s below 10km.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-25T12:41:38Z\u0022 title=\u002207/25/2014 12:41  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 25, 2014\u003C/time\u003E by Iffn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-07-26T16:58:17Z","Content":"\n\u003Cp\u003ECorrect. However, my craft are flying vertically. Of course, everything is horizontal in KSP physics \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have done alot of experiments with engine setups and thrust does not stack which means that in KSP\u0027s simplistic drag model, thrust does not equal drag. But somehow, SQUAD has manged to reproduce pretty well effect of nozzle velocity in relation to static thrust in their engine speed curves.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-07-28T06:43:59Z","Content":"\n\u003Cp\u003EAnyone got an updated version of these graphs for the nerfed engines in the new FAR?\u003C/p\u003E\n"},{"CreatedByName":"RedJimi","CreatedById":40030,"CreatedDateTime":"2015-05-21T09:44:23Z","Content":"\n\u003Cp\u003EAny plans to renew this to accommodate for the current version, 1.0.2?\u003C/p\u003E\n"}]}