{"TopicId":76889,"ForumId":50,"TopicTitle":"How to get to Duna!","CreatedByName":"EliteShadowLeo","CreatedById":85537,"CreatedDateTime":"2014-07-07T14:58:51Z","PageNum":1,"Articles":[{"CreatedByName":"EliteShadowLeo","CreatedById":85537,"CreatedDateTime":"2014-07-07T14:58:51Z","Content":"\n\u003Cp\u003EI have created another instruction video on how to get to Duna. This is the way I have found works the best for me.\u003C/p\u003E\u003Cp\u003EPlease do comment some constructive criticism. Cheers!\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=UUqMNWQ2ijvEIwyQIE1ULw3Q\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"frog","CreatedById":73287,"CreatedDateTime":"2014-07-08T17:54:24Z","Content":"\n\u003Cp\u003EFirst off, I have to say I\u0027m impressed that that worked out so well. I try reaching Duna using all sorts of calculations and junk and it seems to be way more difficult than you just winging it. So props on that!\u003C/p\u003E\u003Cp\u003EThat said, I find the video is very short on crucial information. Two of the main challenges of getting to Duna are building a craft that packs enough dV and launching at the right window--precisely the two things that you spend the least amount of time talking about. If you are not going to discuss craft-building in any depth, I would suggest not bothering to show the VAB at all. In addition, just by watching your video, I don\u0027t think anyone would be able to accurately gauge an appropriate phase angle for the ejection burn; it is very unclear where Duna is in relation to Kerbin while watching the video. It is only shown for a split second, and at an odd angle. Consider giving a rough estimate (45 degrees) to help viewers better understand the planetary alignment.\u003C/p\u003E\n"}]}