{"TopicId":94951,"ForumId":50,"TopicTitle":"How to Create Custom Kerbals (1.0\u002B)","CreatedByName":"greenbow66","CreatedById":132478,"CreatedDateTime":"2014-12-30T02:00:27Z","PageNum":1,"Articles":[{"CreatedByName":"greenbow66","CreatedById":132478,"CreatedDateTime":"2014-12-30T02:00:27Z","Content":"\n\u003Cp\u003EHey guys! Greenbow66 here, I was searching online for how to create custom kerbals, and all I found was mods, other discussions(That weren\u0027t relevant, duh!) and The KSP wiki which is \u003Cstrong\u003EUseful as where the Devil Lives\u003C/strong\u003E. So I decided to experiment. This is the successful result.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cstrong\u003EIMPORTANT NOTE\u003C/strong\u003E\u003C/div\u003E\u003Cstrong\u003E\u003C/strong\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis does not change the occupation of the Kerbal, but you can do that yourself, this will also not change how experienced the Kerbal is.\u003C/p\u003E\u003Cp\u003EThis includes going into the Game Files. If you are uncomfortable with that, do Not do this, or create a backup world.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESTEP 1:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ERecruit a Kerbal, this is where you get to choose your Kerbal\u0027s Occupation. In the Astronaut Complex, you see the Kerbal\u0027s occupation. Recruit the Kerbal with the occupation of your choice. In this Image, you can see my own Greenbow Kerman that yielded from the experiment. For this I\u0027m Recruiting Sigmin Kerman. note his courage and stupidity levels.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2qXXmz9.png\u0022 alt=\u00222qXXmz9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESTEP TWO:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EClose the game and go to the Persistant file. This requires going into your computers files. Where you need to go is to your files, scroll down to your computer tab, and open the one that has (C:) After the name. Click that, and the screen where files are should change. Double Click Kerbal Space Program. Now go to the folder that is titled \u0022Saves\u0022 You should see your world names, scenarios and Training. Double click the Folder of the name of the world you wanted your Kerbal in.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E You want to Right Click the folder that you want a backup of, and you should have a right click menu. Click the part that is titled \u0022Copy\u0022. Now Paste the file, I use a Windows 8, so I do Ctrl\u002BV. You should have a folder named: A world - Copy You can rename it if you want, but it really doesn\u0027t matter, as long as it sticks out from everything else in your saves. Enter the orginal folder.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ESTEP THREE:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EFind and Edit the Kerbal. To find the Kerbal, press the special key(Ctrl for windows 8) and \u0022F\u0022. The type in the search box \u0022ROSTER\u0022. You should see Jebediah Kerman under the word. Close Find, and scroll to your Kerbal. If you have a large list of Kerbals that you Executed(Come on, you did it!), then instead of finding Roster, type your Kerbal\u0027s first name. Then you should be taken to the Kerbal.\u003C/p\u003E\u003Cp\u003EFrom here, you Edit your Kerbal! You can Edit the kerbal\u0027s courage (Listed as \u0022Brave\u0022),Stupidity (Listed as \u0022Dumb\u0022), and Gender(Listed As \u0022Gender\u0022). You can also edit weather it is \u0022BadS\u0022 or not. What BadS does is Makes your Kerbal never experience fear. Like Jebediah. You can Also edit the name. \u003C/p\u003E\u003Cp\u003EWhile you\u0027re here you can also revive any dead kerbals that you may have liked, by replacing \u0022Missing\u0022 Or \u0022Dead\u0022 With \u0022Available\u0022. I did this with jebediah whilst creating Greenbow kerman, and he\u0027s alive as ever!\u003C/p\u003E\u003Cp\u003ENow Re-Open the Game, and find your save file. Open it, and Enjoy your Kerbal! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u0026lt;PROOF STRAIGHT AHEAD!!!\u0026gt;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7ZGzdwc.png\u0022 alt=\u00227ZGzdwc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I hope this Helped all of you guys out there! I hope you don\u0027t give your kerbal an Early Demise, thank you for reading, I\u0027m Greenbow66, and I\u0027m out!\u003C/p\u003E\u003Cp\u003E*Fires the arrow of beginning*\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-27T20:23:08Z\u0022 title=\u002209/27/2015 08:23  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 27, 2015\u003C/time\u003E by greenbow66\u003C/strong\u003E\n\u003Cbr\u003EUpdating Title to the Full Version!\n\u003C/span\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-12-30T02:05:10Z","Content":"\n\u003Cp\u003EImpressive work. Looks like this one might make a handy addition to the Drawing Board \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Also, moving this to the Tutorials subforum. Carry on.)\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-12-30T02:32:47Z","Content":"\n\u003Cp\u003EA few things I\u0027ve found on my own (some of it just today, while adding viewers\u0027 names to my save file):\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EKerbal profession is some sort of hash of the name, but it\u0027s not a simple one. You can\u0027t take \u0022Sally Kerman\u0022 and change her name to \u0022Tally Kerman\u0022 and expect to get the same change in profession you got when you took \u0022Fred Kerman\u0022 and changed his name to \u0022Gred Kerman\u0022.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf you want a specific first name, though, you can usually find a way to get the profession you want by modifying the last name. I\u0027ve got guys with last names like Berman, Lerman, Ferman, and Nerman. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDO NOT CHANGE A KERBAL YOU RESCUED unless you ALSO change the stored contract to the exact same name. Changing one without changing the other will lock up your game!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDO NOT CHANGE A KERBAL YOU HAVE NOT YET RESCUED unless you do the same. Again, if you do this it will lock up your game.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDO NOT EVER CHANGE THE ORDER OF KERBALS IN THE LIST. Ever. It puts random people in random places and is a huge pain to put back to rights.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"greenbow66","CreatedById":132478,"CreatedDateTime":"2014-12-30T15:12:59Z","Content":"\n\u003Cp\u003EThanks! This is my First tutorial, and I\u0027m glad it went Nicely! If you could, please check out my other post on my new MK3 parts vanishing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-20T23:00:35Z\u0022 title=\u002205/20/2015 11:00  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 20, 2015\u003C/time\u003E by greenbow66\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Program Kerbal Space","CreatedById":169331,"CreatedDateTime":"2016-11-02T00:12:16Z","Content":"\n\u003Cp\u003E\nhmm so this is how you edit one but how do you make one  \u003Cimg alt=\u0022:0.0:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 title=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vorg","CreatedById":74652,"CreatedDateTime":"2016-11-02T07:40:47Z","Content":"\n\u003Cp\u003E\nThis thread is 2 years old. Now there is a mod for it. Problem is, mod breaking updates are coming faster then mod fixes. Not sure this one made it to 1.2 and now we are 1.2.1\n\u003C/p\u003E\n"},{"CreatedByName":"RA3236","CreatedById":150734,"CreatedDateTime":"2016-11-19T13:12:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222834478\u0022 data-ipsquote-contentid=\u002294951\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478072447\u0022 data-ipsquote-userid=\u002274652\u0022 data-ipsquote-username=\u0022Vorg\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 02/11/2016 at 5:40 PM, Vorg said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis thread is 2 years old. Now there is a mod for it. Problem is, mod breaking updates are coming faster then mod fixes. Not sure this one made it to 1.2 and now we are 1.2.1\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAlt-F12 now has this functionality too, plus making the Kerbal an orange one.\n\u003C/p\u003E\n"}]}