{"TopicId":4154,"ForumId":19,"TopicTitle":"Thread storico in italiano","CreatedByName":"astroostino","CreatedById":11564,"CreatedDateTime":"2011-11-26T11:14:22Z","PageNum":13,"Articles":[{"CreatedByName":"ste1701","CreatedById":69011,"CreatedDateTime":"2013-12-04T18:19:16Z","Content":"\n\u003Cp\u003EMa ÃƒÂ¨ una bestia! Complimenti!\u003C/p\u003E\u003Cp\u003EIo con gli SSTO sono negato!\u003C/p\u003E\n"},{"CreatedByName":"Sermor","CreatedById":71350,"CreatedDateTime":"2013-12-04T18:26:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ste1701\u0022 data-cite=\u0022ste1701\u0022\u003E\u003Cdiv\u003EMa ÃƒÂ¨ una bestia! Complimenti!\u003Cp\u003EIo con gli SSTO sono negato!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGrazie !\u003C/p\u003E\u003Cp\u003EBeh, neanch\u0027io son chissÃƒÂ  quale genio, e c\u0027ÃƒÂ¨ gente sicuramente piÃƒÂ¹ in gamba di me nel realizzare aerei/velivoli vari. PerÃƒÂ² sbattendoci la testa e perseverando alla fine ce la fai.\u003C/p\u003E\u003Cp\u003EOltre ai consigli di pinolallo e argo, mi sono state d\u0027aiuto anche queste paginette della wiki di ksp:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/SSTO\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/SSTO\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Aeris_4A\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Aeris_4A\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-04T18:33:26Z","Content":"\n\u003Cp\u003EHeli Soul I.\u003C/p\u003E\u003Cp\u003EA volte lascia meravigliati come KSP riesca ad emulare le prestazioni di mezzi reali. Almeno in buona parte.\u003C/p\u003E\u003Cp\u003EParlando di velivoli VTOL il pensiero corre subito agli Harrier e derivati (AV-8), ed il paragone dal punto di vista delle prestazioni ÃƒÂ¨ davvero impressionante. Naturalmente, tutte le prove sono condotte con velivolo in configurazione pulita (nel gergo: senza carichi esterni) e non si dispone di dati circa il carico \u0022utile\u0022.\u003C/p\u003E\u003Cp\u003EHeli Soul I si alza con manetta al 50% del motore verticale, e mantiene bene l\u0027assetto in fase di decollo e volo stazionario, almeno fino a quando i serbatoi sono pieni. Occorre un minimo di attenzione durante la transizione dalla fase di sostentamento a quella di volo traslato, in quanto va temporizzata l\u0027accensione del motore di crociera con lo spegnimento del motore di sostentamento: necessario fare acquisire velocitÃƒÂ  perchÃƒÂ¨ la portanza inizi a farsi sentire come pure il controllo aerodinamico sulle superfici di controllo, mentre il motore di sostentamento farebbe assumere un angolo di attacco negativo. Pertanto meglio assumere un assetto in picchiata per far guadagnare rapidamente velocitÃƒÂ  durante la transizione. Al confronto, gli Harrier che dispongono di 4 ugelli rotanti hanno una transizione morbida e piÃƒÂ¹ governabile. Nel volo traslato ÃƒÂ¨ molto stabile, relativamente pronto a reagire a barra e timone. Si percepisce il peso del propulsore non utilizzato: a bassa quota la velocitÃƒÂ  massima a serbatoio pieno ÃƒÂ¨ arrivata a 198 m/s (Mach 0,6) che non ÃƒÂ¨ particolarmente elevata (come per gli Harrier). La velocitÃƒÂ  di virata continua in volo orizzontale ÃƒÂ¨ pari a 20Ã‚Â°/s (ma non ho utilizzato il motore di sostentamento, quindi niente manovre tipo VIFF che sono la specialitÃƒÂ  in combattimento degli Harrier: occorrerebbe una manetta separata per poter controllare separatamente i due motori). La quota di tangenza ÃƒÂ¨ stata pari a 18000 metri (a Mach 0,71). Occorre dire che raggiunta tale quota, ÃƒÂ¨ difficilmente controllabile forse per il basso rapporto portanza/peso. Ridisceso di quota ho provato qualche manovra con il motore di sostentamento, appunto per verificare effetti tipo VIFF. Occorre una certa abilitÃƒÂ  per tenere orientato il velivolo a bassa velocitÃƒÂ , mentre si cerca di dirigere la spinta nella direzione desiderata: ma l\u0027effetto ÃƒÂ¨ ben percepito. Purtroppo, cercare di stabilire nuovamente un volo stazionario richiederebbe che l\u0027aereo rimanga stabile a velocitÃƒÂ  nulla, col propulsore verticale che bilancia la gravitÃƒÂ . Ma in tali condizioni non esiste piÃƒÂ¹ controllo aerodinamico, pertanto l\u0027assetto ÃƒÂ¨ instabile. L\u0027atterraggio verticale ÃƒÂ¨ un\u0027impresa molto difficoltosa, meglio un atterraggio convenzionale su pista.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-04T18:47:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sermor\u0022 data-cite=\u0022Sermor\u0022\u003E\u003Cdiv\u003ECari colleghi kerbonauti, sono riuscito infine a portare in orbita stabile su Kerbin il mio mega SSTO da circa 150 tonnellate di peso. Una vera impresa ! ...\u003Cp\u003EEDIT: A proposito del Mechjeb e dell\u0027autopilota dell\u0027ascensione, se volessi regolarlo per portarci un ssto in orbita come dovrei fare ? Quell\u0027autopilota non sono mai riuscito ad usarlo come si deve, non riesco a capire come regolarlo.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMa veramente quel bestione vola?\u003C/p\u003E\u003Cp\u003EScherzi a parte, direi di lasciar perdere MechJeb, ÃƒÂ¨ calibrato per portare in orbita un razzo, non un SSTO. Il profilo di salita programmato non va assolutamente bene. Ci ho provato con un velivolo giÃƒÂ  in quota e velocitÃƒÂ  per poter fare l\u0027accelerazione di salita in orbita, e MechJeb lo ha buttato subito fuori rotta.\u003C/p\u003E\n"},{"CreatedByName":"Argo753","CreatedById":57893,"CreatedDateTime":"2013-12-04T19:50:56Z","Content":"\n\u003Cp\u003EMechjeb con gli SSTO si puÃƒÂ² usare, chiaramente non si puÃƒÂ² attivare l\u0027ascent a terra ma se lo si accende quando l\u0027aereo ha raggiunto un\u0027altitudine e velocitÃƒÂ  adeguata funziona a meraviglia, basta avviare l\u0027ascent semplicemente mettendo l\u0027altezza dell\u0027orbita come fossimo a terra e attivarlo.\u003C/p\u003E\u003Cp\u003ENelle fasi precedenti si usa lo smart a.s.s. impostando heading (HDG ossia la direzione, solitamente 0) e angolo di salita (pitch, PIT sullo smart) che va reimpostato durante la salita e ovviamente varia da aereo ad aereo e dal metodo che si usa.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-04T19:53:06Z\u0022 title=\u002212/04/2013 07:53  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 4, 2013\u003C/time\u003E by Argo753\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sermor","CreatedById":71350,"CreatedDateTime":"2013-12-04T20:35:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022diomedea\u0022 data-cite=\u0022diomedea\u0022\u003E\u003Cdiv\u003EMa veramente quel bestione vola?\u003Cp\u003EScherzi a parte, direi di lasciar perdere MechJeb, ÃƒÂ¨ calibrato per portare in orbita un razzo, non un SSTO. Il profilo di salita programmato non va assolutamente bene. Ci ho provato con un velivolo giÃƒÂ  in quota e velocitÃƒÂ  per poter fare l\u0027accelerazione di salita in orbita, e MechJeb lo ha buttato subito fuori rotta.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Argo753\u0022 data-cite=\u0022Argo753\u0022\u003E\u003Cdiv\u003EMechjeb con gli SSTO si puÃƒÂ² usare, chiaramente non si puÃƒÂ² attivare l\u0027ascent a terra ma se lo si accende quando l\u0027aereo ha raggiunto un\u0027altitudine e velocitÃƒÂ  adeguata funziona a meraviglia, basta avviare l\u0027ascent semplicemente mettendo l\u0027altezza dell\u0027orbita come fossimo a terra e attivarlo.\u003Cp\u003ENelle fasi precedenti si usa lo smart a.s.s. impostando heading (HDG ossia la direzione, solitamente 0) e angolo di salita (pitch, PIT sullo smart) che va reimpostato durante la salita e ovviamente varia da aereo ad aereo e dal metodo che si usa.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGrazie per le risposte.\u003C/p\u003E\u003Cp\u003EE il mezzo vola, si. \u003Cimg src=\u0022http://www.gamesvillage.it/forum/images/smilies/asd.gif\u0022 alt=\u0022asd.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003ECerto, non sarÃƒÂ  agilissimo ma si manovra abbastanza bene per essere un bestione. Se volete lo uppo su mediafire e vi posto il link del download, cosÃƒÂ¬ lo provate voi stessi.\u003C/p\u003E\u003Cp\u003EComunque visto che il mezzo l\u0027ho realizzato su ksp 0.22 dove non ho messo nessuna mod, direi che il mezzo ÃƒÂ¨ totalmente stock.\u003C/p\u003E\n"},{"CreatedByName":"thescientist","CreatedById":69046,"CreatedDateTime":"2013-12-05T15:05:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sermor\u0022 data-cite=\u0022Sermor\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBeh, neanch\u0027io son chissÃƒÂ  quale genio, e c\u0027ÃƒÂ¨ gente sicuramente piÃƒÂ¹ in gamba di me nel realizzare aerei/velivoli vari. PerÃƒÂ² sbattendoci la testa e perseverando alla fine ce la fai.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn KSP sbagliare ÃƒÂ¨ il miglior modo di imparare.\u003C/p\u003E\u003Cp\u003EDa wikipedia:\u003C/p\u003E\u003Cp\u003E\u0022Disadvantages\u003C/p\u003E\u003Cp\u003ESpaceplane type SSTOs cannot be as heavy as a vertical rocket due to structural limitations.\u0022\u003C/p\u003E\u003Cp\u003EOnestamente dopo aver visto certi Giganti come quello di Sermor ci credo assai di meno...\u003C/p\u003E\u003Cp\u003ESe lo caricassi su mediafire penso non ci sarebbero obiezioni. Personalmente sono curiosi di vedere come se la cava con la DRE\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-05T20:36:45Z\u0022 title=\u002212/05/2013 08:36  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 5, 2013\u003C/time\u003E by thescientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sermor","CreatedById":71350,"CreatedDateTime":"2013-12-06T02:26:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thescientist\u0022 data-cite=\u0022thescientist\u0022\u003E\u003Cdiv\u003EIn KSP sbagliare ÃƒÂ¨ il miglior modo di imparare.\u003Cp\u003EDa wikipedia:\u003C/p\u003E\u003Cp\u003E\u0022Disadvantages\u003C/p\u003E\u003Cp\u003ESpaceplane type SSTOs cannot be as heavy as a vertical rocket due to structural limitations.\u0022\u003C/p\u003E\u003Cp\u003EOnestamente dopo aver visto certi Giganti come quello di Sermor ci credo assai di meno...\u003C/p\u003E\u003Cp\u003ESe lo caricassi su mediafire penso non ci sarebbero obiezioni. Personalmente sono curiosi di vedere come se la cava con la DRE\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEcco il file del mezzo:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./view/fovsqeg4qz4hhu1/Jedi%20Mammuth%20v2.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./view/fovsqeg4qz4hhu1/Jedi%20Mammuth%20v2.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPremettendo che io dopo i 5000 m (0-2500 = 40Ã‚Â°; 2500 - 5000 = 35Ã‚Â°) son salito fino a sui 20000 m con un\u0027angolo di 30 gradi, in sostanza basta arrivare intorno ai 22.000 m alla velocitÃƒÂ  di 1.000 m/s circa (giocate con l\u0027angolo d\u0027attacco), volendo il mezzo puÃƒÂ² salire anche sui 23.000 con i motori a getto, ma inizia \u0022a sbandare\u0022. Se ve la sentite di rischiare provateci (io son salito \u0022rischiando\u0022) per poi attivare la propulsione convenzionale prima di perdere il controllo del mezzo (con la propulsione convenzionale oltre i 23 km va tutto bene a livello di assetto e quant\u0027altro).\u003C/p\u003E\u003Cp\u003EUna volta attivato il propulsore convenzionale basta avere un\u0027angolo d\u0027attacco di 40Ã‚Â° fino a quando l\u0027apogeo non raggiunge i 100.000 m circa, poi si puÃƒÂ² interrompere la propulsione. Una ventina di secondi prima di arrivare sull\u0027apogeo attivare la propulsione con i soli motori nucleari e dare gas al 100% fino a quando non si ha un\u0027orbita stabile. Dovrebbe avanzare abbastanza carburante per effettuare le regolazioni successive e alzare un po\u0027 l\u0027orbita. \u003C/p\u003E\u003Cp\u003EI tasti di attivazione dei motori sono:\u003C/p\u003E\u003Cp\u003E4 - attiva i motori turbojet, disattiva tutti gli altri\u003C/p\u003E\u003Cp\u003E5 - attiva solo il motore convenzionale centrale (il grosso motore arancione, il Rockomax \u0022Mainsail\u0022), distattiva o lascia spenti tutti gli altri motori.\u003C/p\u003E\u003Cp\u003E6 - attiva il motore centrale e i quattro motori nucleari posti ai lati, lascia disattivati i motori a getto\u003C/p\u003E\u003Cp\u003E7 - attiva solo i 4 motori nucleari, disattiva tutto il resto\u003C/p\u003E\u003Cp\u003E8 - attiva tutti i motori\u003C/p\u003E\u003Cp\u003E0 - disattiva tutti gli intakes\u003C/p\u003E\u003Cp\u003EGli altri tasti sono:\u003C/p\u003E\u003Cp\u003E1 - attiva la strumentazione scientifica (il termometro, il barometro ecc.)\u003C/p\u003E\u003Cp\u003E2 - attiva il report di tutta la strumentazione scientifica, quindi anche dei Mistery Goo e degli SC 9001 presenti sul mezzo, la scansione dell\u0027atmosfera del Sensor Array Computing presenti sul mezzo (occhio che per simmetria ne ho messi due), ed anche il \u0022crew report\u0022 sia della cabina di pilotaggio che dell\u0027alloggiamento dell\u0027equipaggio\u003C/p\u003E\u003Cp\u003E3 - estende le scalette\u003C/p\u003E\u003Cp\u003E9 - ritrae le scalette\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-06T02:32:06Z\u0022 title=\u002212/06/2013 02:32  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 6, 2013\u003C/time\u003E by Sermor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thescientist","CreatedById":69046,"CreatedDateTime":"2013-12-06T16:42:19Z","Content":"\n\u003Cp\u003EConoscendo la mia memoria, dovrÃƒÂ  scrivermi un foglietto da appiccicare a lato dello schermo \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EUna domanda: che ne direste di chiedere ai moderatori di fare una cartella \u0022italiano\u0022 in \u0022international\u0022?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-06T17:05:24Z\u0022 title=\u002212/06/2013 05:05  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 6, 2013\u003C/time\u003E by thescientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-06T17:42:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thescientist\u0022 data-cite=\u0022thescientist\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EUna domanda: che ne direste di chiedere ai moderatori di fare una cartella \u0022italiano\u0022 in \u0022international\u0022?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EChiedere non costa niente, e questo ÃƒÂ¨ il thread piÃƒÂ¹ lungo di tutta la sezione \u0022international\u0022. Potrebbero anche acconsentire!\u003C/p\u003E\n"},{"CreatedByName":"Argo753","CreatedById":57893,"CreatedDateTime":"2013-12-06T19:34:05Z","Content":"\n\u003Cp\u003EDirei che sarebbe ora.\u003C/p\u003E\n"},{"CreatedByName":"pinolallo","CreatedById":47075,"CreatedDateTime":"2013-12-06T23:04:38Z","Content":"\n\u003Cp\u003EEcco infatti. cosi\u0027 possiamo aprire dei threads\u003C/p\u003E\n"},{"CreatedByName":"thescientist","CreatedById":69046,"CreatedDateTime":"2013-12-07T14:43:32Z","Content":"\n\u003Cp\u003EChe ne dite?\u003C/p\u003E\u003Cp\u003EGood evening Sir,\u003C/p\u003E\u003Cp\u003EWe, the Italian community of the forum, would really like to have a folder in \u0022International\u0022, so we wonder if it is possible.\u003C/p\u003E\u003Cp\u003EThanks for reading this,\u003C/p\u003E\u003Cp\u003EThe Italian community\u003C/p\u003E\u003Cp\u003ECorreggete (siate onesti, lo so che il mio inglese fa pena) e/o postate un altro testo, cosÃƒÂ¬ da poter inviare una richiesta leggibile ad un admin.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-07T15:28:47Z","Content":"\n\u003Cp\u003EIl tuo inglese non ÃƒÂ¨ male. PeÃƒÂ² per sicurezza mi sono andato a guardare cosa si intenda per \u0022folder\u0022 nel gergo dei software di gestione forum, in particolare con vBulletin. Per folder pare si riferiscano solo a sezioni della directory di installazione del software (non diversamente dal generico uso in informatica). Forse il termine piÃƒÂ¹ corretto ÃƒÂ¨ \u0022subsection\u0022 oppure \u0022subforum\u0022. Quindi andrebbe chiesto \u0022... to have a subsection/subforum dedicated to italian users within the International section ...\u0022 (l\u0027ho fatta lunga per massima chiarezza).\u003C/p\u003E\u003Cp\u003EPresumo che l\u0027amministratore preveda l\u0027opportunitÃƒÂ  che venga designato almeno un moderatore, e certo dovrÃƒÂ  essere qualcuno di noi. Se lo chiede, dovrebbe indicare i criteri da soddisfare e quindi vediamo chi ritiene di essere in grado (ÃƒÂ¨ un bell\u0027impegno) e se la sente. \u003C/p\u003E\u003Cp\u003EL\u0027aspetto che mi appare abbia bisogno di un chiarimento ÃƒÂ¨ firmarsi \u0022The Italian community\u0022. Un post ÃƒÂ¨ sempre scritto da una sola persona, e non vedo modo per farlo sembrare una proposta collettiva. Dato che non credo esista un censimento di noi italiani, nÃƒÂ¨ tantomeno un modo di sottoscrivere un post (tipo petizione), la soluzione piÃƒÂ¹ vicina potrebbe essere quella di una votazione (poll): peccato che un poll possa essere svolto solo aprendo un nuovo thread (non che sia impossibile aprire thread nuovi nella sezione internazionale, solo che non apparrebbe in alcun modo legato a questo).\u003C/p\u003E\u003Cp\u003EPertanto, io aprirei il post come segue:\u003C/p\u003E\u003Cp\u003E\u0022... in name of the Italian community on this forum, I would ask to have ...\u0022 magari anche indicando che altri utenti della comunitÃƒÂ  hanno espresso consenso all\u0027idea.\u003C/p\u003E\n"},{"CreatedByName":"Argo753","CreatedById":57893,"CreatedDateTime":"2013-12-07T18:15:36Z","Content":"\n\u003Cp\u003EPenso sia sufficiente la richiesta scritta da thescientist, non ho mai visto votazioni per gli altri subforum \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Preliator","CreatedById":96497,"CreatedDateTime":"2013-12-12T23:35:52Z","Content":"\n\u003Cp\u003EAggiungete un italiano \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-13T08:34:19Z","Content":"\n\u003Cp\u003E@ Preliator: benvenuto. \u003C/p\u003E\u003Cp\u003ESe ti puÃƒÂ² servire aiuto, non esitare a chiedere.\u003C/p\u003E\n"},{"CreatedByName":"Preliator","CreatedById":96497,"CreatedDateTime":"2013-12-13T10:52:45Z","Content":"\n\u003Cp\u003EGrazie \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E per ora non ho bisogno di aiuto... mi piace testare e fallire migliaia di volte. Nel forum exchange ho messo la foto della mia ss che per ora ÃƒÂ¨ il massimo che sia riuscito a fare.\u003C/p\u003E\u003Cp\u003EPurtroppo il mio tempo a disposizione ÃƒÂ¨ molto poco quindi non posso giocarci molto ma quando posso mi ci fiondo immediatamente:P\u003C/p\u003E\n"},{"CreatedByName":"Argo753","CreatedById":57893,"CreatedDateTime":"2013-12-14T13:10:42Z","Content":"\n\u003Cp\u003EA quanto pare il sistema di estrazione risorse che era stato presentato un anno fa ÃƒÂ¨ stato accantonato, e una delle nuove prioritÃƒÂ  dei devs ÃƒÂ¨ diventato il multiplayer che ÃƒÂ¨ stato annunciato durante il kerbalkon. Che ne pensate di questi cambiamenti di rotta ? Io personalmente sono delusissimo dalla piega che ha preso lo sviluppo del gioco, e leggendo il forum e altri siti dove ksp ÃƒÂ¨ molto popolare (reddit) noto che serpeggia molto malcontento. Addirittura uno degli ex dev di Squad, Novasilisko (uno dei piÃƒÂ¹ validi se non il miglior dev che ksp ha avuto, che aveva giÃƒÂ  realizzato buona parte degli strumenti per ricerca e estrazione risorse, che ora non mi stupisco che se ne sia andato e con lui altri) si ÃƒÂ¨ dichiarato molto perplesso dall\u0027annuncio di voler implementare una modalitÃƒÂ  multiplayer a questo punto dello sviluppo del gioco, che ritiene troppo avanzato e richiederebbe troppe risorse e tempo per essere realizzato, pertanto l\u0027idea che ci si ÃƒÂ¨ fatti ÃƒÂ¨ che molti contenuti saranno tagliati e rivisti a favore di features piÃƒÂ¹ popolari come il multy. Secondo me non hanno idea di come portare avanti questo gioco ... vorrebbero terminare l\u0027alfa entro la fine dell\u0027anno prossimo quando in un anno hanno implementato una modalitÃƒÂ  carriera strutturata senza nessuna logica che nel giro di TRE ORE ÃƒÂ¨ stata totalmente stravolta e migliorata dai modders... \u003C/p\u003E\u003Cp\u003EHo come l\u0027impressione che le mods abbiano totalmente travolto e stravolto lo sviluppo di questo gioco, e non ho ancora capito se ÃƒÂ¨ un bene o un male avere una community cosi attiva che ÃƒÂ¨ non un passo ma duecento passi avanti ai devs.\u003C/p\u003E\n"},{"CreatedByName":"Argo753","CreatedById":57893,"CreatedDateTime":"2013-12-14T13:24:23Z","Content":"\n\u003Cp\u003EAh poi non so voi ma io aspetto di piÃƒÂ¹ la nuova mod di Nova che il prossimo update a KSP\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/TqP8M\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/TqP8M\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EAlmeno ci sarÃƒÂ  qualcosa di nuovo ...\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2013-12-14T13:40:08Z","Content":"\n\u003Cp\u003EFrancamente ti devo dare ragione, sebbene la mia conoscenza sia limitata alle recenti versioni di KSP ed alle mod attualmente compatibili. Premetto che a me il multiplayer non interessa, sono ben altre le caratteristiche che mi rendono un gioco interessante. Ma le \u0022novitÃƒÂ \u0022 presentate per la versione 0.23 (sia al Kerbalkon che in qualche thread o recensione) mi sembrano risibili, se confrontate con le \u0022feature\u0022 che invece vengono proposte da diversi modders. Tweakables, va bene; qualche altro motore, va bene (soprattutto per i nostri progettisti di SSTO); carrelli sterzanti; archivi scientifici. Ma nulla che non avrebbe potuto essere proposto da una mod (ed in effetti esistono svariate mod che avanzano proposte comparabili). La modalitÃƒÂ  carriera non ÃƒÂ¨ stata migliorata, non esiste gestione di risorse strategiche quali tempo e denaro, non ci sono ricompense per compiere determinate missioni, nÃƒÂ¨ per tenere in vita i kerbonauti. Da questo punto di vista, il gioco ÃƒÂ¨ tuttora solo un sandbox con in piÃƒÂ¹ esperimenti scientifici. Spero vivamente di vedere completare alcune delle mod ora in realizzazione, che invece hanno precorso gli aspetti carenti del gioco ed aggiunto molte caratteristiche sfiziose.\u003C/p\u003E\n"},{"CreatedByName":"Argo753","CreatedById":57893,"CreatedDateTime":"2013-12-14T13:55:47Z","Content":"\n\u003Cp\u003EI tweakables sono l\u0027unica vera novitÃƒÂ  penso dell\u0027anno...per il resto io sto giocando lo stesso identico gioco che giocavo un anno fa, e per essere un alfa la cosa non lascia ben sperare... mi sarei aspettato stravolgimenti quasi ad ogni update, come lo fu quando implementarono il docking, considerando anche la quantitÃƒÂ  di features promesse. Basta pensare a che cambiamenti porterebbe la promessa aerodinamica piÃƒÂ¹ realistica (se ne sa piÃƒÂ¹ niente) rientro atmosferico con simulazione del calore e danni (sparito pure questo) le stesse risorse che amplierebbero a dismisura le possibilitÃƒÂ  del gioco (accantonate non si sa fino a quando) miglioramento dei pianeti (effetti atmosferici, caratteristiche geologiche ecc, si sa piÃƒÂ¹ niente pure di questi da un anno)\u003C/p\u003E\u003Cp\u003EPoi le altre novitÃƒÂ  della 0.23 .. i sabre ok fighi perÃƒÂ² io nello spazio con gli aerei ci andavo giÃƒÂ  prima, ora ci andrei solo con un motore diverso... a fare cosa ? non hanno ancora messo una stramaledetta cargo bay ! nemmeno i fairings ora che ci penso ! sono anni che sono disponibili come mods ... assurdo. E dopo tre anni di sviluppo ancora devo mettere mechjeb per sapere il delta v del razzo ma scherziamo ...\u003C/p\u003E\u003Cp\u003EE il tech tree e gli archivi scientifici... ok vanno benissimo ma sono due cazzo di schermate un anno di sviluppo per due schermate ? qualsiasi mod ha decine di schermate anche molto piÃƒÂ¹ elaborate e complesse di quelle.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-14T14:01:40Z\u0022 title=\u002212/14/2013 02:01  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 14, 2013\u003C/time\u003E by Argo753\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thescientist","CreatedById":69046,"CreatedDateTime":"2013-12-14T18:20:02Z","Content":"\n\u003Cp\u003ESe posso dire la mia, secondo me stanno avendo problemi con i dindini e i finanziatori, per cui adesso stanno cercando di metterci un pÃƒÂ² le cose che ci si aspettaq di trovare nel gioco finito.\u003C/p\u003E\u003Cp\u003EAd ogni modo, non penso che sia tutto da buttare. Ad esempio, il nuovo SAS ÃƒÂ¨ grazioso anche se un pÃƒÂ² deboluccio, il motore Rockomax 48-7S ÃƒÂ¨ interessante, la nuova grafica dei motori a jet ÃƒÂ¨ bellina. PerÃƒÂ² secondo me adesso stanno forzando le tappe e sta uscendo una -scusate il termine- cagata. Secondo me la modalitÃƒÂ  carriera della 0.22 poteva ancora aspettare almeno questo update.\u003C/p\u003E\u003Cp\u003ENessuna nuova per il sub-forum, ora provo a rimandare il messaggio, magari non ÃƒÂ¨ arrivato.\u003C/p\u003E\n"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2013-12-14T18:21:11Z","Content":"\n\u003Cp\u003EWeila ragazzi come state? Son 3 mesi che manco... Siete pronti per il .23??\u003C/p\u003E\n"},{"CreatedByName":"Argo753","CreatedById":57893,"CreatedDateTime":"2013-12-14T20:35:45Z","Content":"\n\u003Cp\u003EProblemi finanziari dici ? tutto puÃƒÂ² essere, perÃƒÂ² considera che ksp ÃƒÂ¨ uno degli indie piÃƒÂ¹ venduti su Steam quest\u0027anno ... per fare un confronto si sa che Prison Architect ha superato le 250.000 copie per oltre 8 milioni di dollari di guadagno (usano la formula inversa di ksp, il prezzo sta scendendo dalle prime versioni alfa) e non ÃƒÂ¨ stato nella top 10 giochi piÃƒÂ¹ venduti nemmeno due giorni di fila... di sicuro di soldi ne han raccolti anche piÃƒÂ¹ delle loro piÃƒÂ¹ ottimistiche previsioni, perÃƒÂ² anche su questo non ci sono dati certi visto che non si sbottonano nemmeno per due modelli 3d riciclati (il nuovo sabre non ÃƒÂ¨ altro che il cilindro del sas manco i colori hanno cambiato)da mostrare in anteprima (guardacaso l\u0027unico che faceva vedere succose anteprime era Nova che ÃƒÂ¨ stato liquidato) figuriamoci per ciÃƒÂ² che riguarda il loro budget. Quel che ÃƒÂ¨ certo e ne parlavano anche su reddit ÃƒÂ¨ che con maggiori introiti e vista la cresciuta popolaritÃƒÂ  del gioco a fronte di tutte le promesse fatte dovrebbero come minimo ampliare il team e dividersi il lavoro visto che sono in 2/3 che saltano da una feature all\u0027altra senza perÃƒÂ² farne una intera decente.\u003C/p\u003E\n"}]}