{"TopicId":216106,"ForumId":126,"TopicTitle":"Where/when to return from Dres?","CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-03-31T19:53:22Z","PageNum":1,"Articles":[{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2023-03-31T19:53:22Z","Content":"\n\u003Cp\u003E\nI never thought I\u0027d have to ask such thing but... I\u0027m out of ideas.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course the maneuver node never shows where it\u0027s going to end up, but that\u0027s the least of my problems. I know I have to burn retrograde-ish but the trouble is... none of the online tools gives me a clear answer. The phase angle I get from one is different from the transfer window time I get from the other. It says it should be a 1200m/s burn to get me on collision course, and I\u0027m glad because I only have like 1250, but I can\u0027t figure out the timing. I\u0027m on Year 10.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2023-03-31T21:23:32Z","Content":"\n\u003Cp\u003E\nI have never found Alexmoon\u0027s planner to give me a wrong transfer. It has worked precisely and reliably throughout all of KSP1, and also in the two cases I have been using in for KSP2.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, there\u0027s one caveat worth knowing: the date format has changed between the games. KSP1 started the game in year 1, day 1, and hence Alexmoon\u0027s planner - made for KSP1 - does too. KSP2, meanwhile, starts the game at year 0, day 1. But the position of the planets at epoch is identical.\n\u003C/p\u003E\n\u003Cp\u003E\nSo when you are in for example year 10, day 200 in KSP2, and you want to plan a transfer from Dres to Kerbin, you have to set the earliest departure date in Alexmoon\u0027s planner to be \u003Cem\u003Eyear 11, day 200\u003C/em\u003E. Because KSP2 is always going to display one year fewer on the savegame clock than KSP1 would have.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that can very easily mean the difference between you getting an output that works, and one that doesn\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-31T21:24:16Z\u0022 title=\u002203/31/2023 09:24  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 31, 2023\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"}]}