{"TopicId":223548,"ForumId":126,"TopicTitle":"Looking for tips to land on Tylo","CreatedByName":"Kirian","CreatedById":232581,"CreatedDateTime":"2024-02-06T22:24:40Z","PageNum":1,"Articles":[{"CreatedByName":"Kirian","CreatedById":232581,"CreatedDateTime":"2024-02-06T22:24:40Z","Content":"\n\u003Cp\u003E\nI\u0027m finding a landing on Tylo to be extremely difficult, not to mention expensive. It ought to be about 2300 delta-v to land; I am going through 5k\u002B and still crashing. It\u0027s clear to me that Dart engines were a poor choice, and I\u0027m pretty certain I\u0027ll be sending a second mission with a different lander (or 3x as many Darts).\n\u003C/p\u003E\n\u003Cp\u003E\nDoes anyone have suggestions or tips for what\u0027s required to land, or for how to make the landing happen? I think my main issue is that I don\u0027t have a good trajectory for burning, and I\u0027m not sure what my target orbit from which to burn ought to be. Also would love to hear lander design thoughts; I guess I should look into making it 7k delta-v ?\n\u003C/p\u003E\n\u003Cp\u003E\nFor the monument mission, does the lander have to be manned?\n\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2024-02-07T00:37:25Z","Content":"\n\u003Cp\u003E\nHello \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/232581-kirian/?do=hovercard\u0022 data-mentionid=\u0022232581\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/232581-kirian/\u0022 rel=\u0022\u0022\u003E@Kirian\u003C/a\u003E and welcome to the KSP Forum.\n\u003C/p\u003E\n\u003Cp\u003E\nI have not landed on Tylo in KSP2, but I did a number of Tylo landings in KSP1.  Since the Kerbolar system remains largely unchanged, the information I have to impart should still be relevant.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, there are several quite different strategies for landing on a body which has no atmosphere.  One of the common ones I have seen is what I will call \u0027stop and drop\u0027.  Starting from a basically circular orbit around the target body one simply points retrograde and burns until the lander is basically motionless with regard to the surface (orbital velocity zero).  With the lander now falling straight down, the engine is pointed at the ground and the craft is slowed as needed to result in a gentle landing.  The lower the gravity of the target body, the easier this is.  However, it is not efficient.  The orbital velocity is completely removed while the lander is still far above the surface and all further burning is simply to remove the velocity accumulated while falling.  Pretty much all of this is wasted.\n\u003C/p\u003E\n\u003Cp\u003E\nTo land efficiently, the periapsis is lowered as close to the surface as possible and the retrograde burn to remove orbital velocity happens near the periapsis.  Ultimately, you want to finish the burn and bring your lander to zero orbital velocity just as you finish falling and touch down.  In practice this is quite easy on low gravity bodies.  Of course, on low gravity bodies the inefficiency of \u0027stop and drop\u0027 is much lower and so less fuel is saved.  On higher gravity bodies, this is not only difficult to achieve, but is a rather hair-raising experience.  On Tylo it is downright terrifying.  But the amount of fuel saved versus \u0027stop and drop\u0027 is dramatic.\n\u003C/p\u003E\n\u003Cp\u003E\nOne of things necessary to make this work is a sufficiently high \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E.  It is necessary to remove all orbital velocity in as short a time as possible so that the periapsis can start as low as possible and gravity has as little time as possible to accelerate your lander into the ground.  The less vertical component to your landing burn, the less fuel is wasted.  I don\u0027t remember the exact figures I have used, but it seems to me that you want a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E comfortably over 2 as you complete the removal of orbital velocity and prevent Tylo\u0027s gravity from smashing your lander into the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nWith an efficient landing trajectory and sufficient \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003E\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E\u003C/abbr\u003E, it should be possible to design a lander with something like 5300 to 5500 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E and successfully pull off landing and return to orbit.  It will take careful design of the lander and probably quite a bit of trial and error to get the periapsis and the landing zone just right.\n\u003C/p\u003E\n\u003Cp\u003E\nIt has been said in KSP1 that there are three big boss missions.  Getting to Moho, landing on Tylo, and returning from the surface of Eve.  The same should more or less be true for KSP2.  I wish you the best of luck and I hope this is somewhat helpful.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nHappy landings!\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2024-02-07T03:00:01Z","Content":"\n\u003Cp\u003E\nthree tips here, first you can do an one way probe mission. second send an rover, this reduce the accuracy needed and only the rover has to survive the landing. \u003Cbr\u003E\nthree use staging like an crashing stage or two \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Kirian","CreatedById":232581,"CreatedDateTime":"2024-02-08T02:43:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224364854\u0022 data-ipsquote-contentid=\u0022223548\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221707266245\u0022 data-ipsquote-userid=\u0022131400\u0022 data-ipsquote-username=\u0022Starhawk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/6/2024 at 4:37 PM, Starhawk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt has been said in KSP1 that there are three big boss missions.  Getting to Moho, landing on Tylo, and returning from the surface of Eve.  The same should more or less be true for KSP2.  I wish you the best of luck and I hope this is somewhat helpful.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy landings!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks for the tips! I\u0027ve managed to put together a lander at 5100 m/s and 2.2 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, which seems still a bit iffy. It doesn\u0027t even seem to be Tsiolkovsky\u0027s tyranny swinging against me here, but it feels like there\u0027s not enough fine gradation in the parts available. But I\u0027ll keep working on it. I have made it to (and back from!) Moho, so I have one down. Returning from Eve likely requires another 15k research or so.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the actual attempt on Tylo, I essentially want the periapsis at the lowest possible number (about 30k on Tylo IIRC, thanks to mountains, but I\u0027m uncertain), is that correct? And then burn hard but not too hard to land well... yikes, it feels like targeting the monument becomes really dicey then. I\u0027ll keep making attempts.\n\u003C/p\u003E\n"},{"CreatedByName":"twich22","CreatedById":110030,"CreatedDateTime":"2024-02-08T21:03:47Z","Content":"\n\u003Cp\u003E\nSo the most efficient type of burn is a suicide burn, which means you burn at full blast and by the time you reach a velocity of 0 you are at the ground. Its difficult to get right and the consequence of slight miscalculation means crashing into the planet. \n\u003C/p\u003E\n\u003Cp\u003E\nThe longer you spend \u0022falling\u0022 the more delta V you burn, thats gravity. So if you slow down the whole way, you spend more time falling, gravity has more time to pull on you, you spend more delta V getting to the surface.  Similarly, if you can stop quickly, then you can wait until the last second to start your burn. If it takes you 5 mintues to stop, its gonna be a problem no matter what. So a higher Thrust to weight ratio will help you out immensely. \n\u003C/p\u003E\n\u003Cp\u003E\nThats only for vertical velocity. You also have to think about horizontal velocity. On low gravity planets its easy enough to just stop your horizontal velocity all together because its not that high, and then all you have to do is manage your vertical velocity. But on a big planet like tylo this is much more difficult because your horizontal velocity is quite high and it takes a while to stop. So you need to do a bit of a combination\n\u003C/p\u003E\n\u003Cp\u003E\nYou want to kill as much horizontal velocity as possible on your initial burn so that you are going to cross over the path of your target and then crash into the plant. then as you approach your target you can kill the rest of your horizontal velocity so that you will fall directly onto your target. meanwhile you want to fall fast enough that you dont eat up all your delta V on a slow decent, but slow enough that you can still stop in time to not crash into the planet. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI know thats not super helpful but hopefully you will figure it out!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-08T21:05:25Z\u0022 title=\u002202/08/2024 09:05  PM\u0022 data-short=\u0022Feb 8\u0022\u003EFebruary 8\u003C/time\u003E by twich22\u003C/strong\u003E\n\u003Cbr\u003Eadded details\n\u003C/span\u003E\n"},{"CreatedByName":"Kirian","CreatedById":232581,"CreatedDateTime":"2024-02-19T23:05:52Z","Content":"\n\u003Cp\u003E\nThanks for the tips \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/131400-starhawk/?do=hovercard\u0022 data-mentionid=\u0022131400\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/131400-starhawk/\u0022 rel=\u0022\u0022\u003E@Starhawk\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/110030-twich22/?do=hovercard\u0022 data-mentionid=\u0022110030\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/110030-twich22/\u0022 rel=\u0022\u0022\u003E@twich22\u003C/a\u003E! I made it to Tylo and to the monument, and I have about 2100 \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E to spare, which I hope will get me into a very low orbit. However, one of my Kerbals is stuck in the mud and can\u0027t move, so hopefully I can figure out that bug and move forward.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Bug thwarted by cheating. Look, I was willing to walk the 4 clicks but the game wouldn\u0027t let me.  But... Apparently that 2100 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout was incorrect... I can\u0027t get into orbit. I\u0027ll send a rescue mission at some point. Hopefully he has a lot of snacks.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-02-20T04:15:40Z\u0022 title=\u002202/20/2024 04:15  AM\u0022 data-short=\u0022Feb 20\u0022\u003EFebruary 20\u003C/time\u003E by Kirian\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2024-02-22T16:12:57Z","Content":"\n\u003Cp\u003E\nI did some testing of this, KSP 2 nodes works a bit different from KSP 1 and I used this to my advantage. \u003Cbr\u003E\nFirst I made \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E low over or a bit after target, I then made an node who canceled my velocity just above the surface, add some of the vector up not only retrograde and you see there the burn stop you want to be low and falling pretty straight down, perhaps an bit prograde as its easier to cancel out for an more accurate landing. \n\u003C/p\u003E\n"}]}