{"TopicId":102817,"ForumId":15,"TopicTitle":"Use of N-Gons in 3D models?","CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2015-03-27T23:48:54Z","PageNum":1,"Articles":[{"CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2015-03-27T23:48:54Z","Content":"Being the very definition of amateur in 3D modelling, I\u0027ve only just learned of N-Gons. Apparently they are bad.\n\nBut, my question is \u0022how bad?\u0022. Obviously little information online is not related to KSP, and quite vague.\n\nSo, can anyone inform me if these types of faces should really be avoided?\n\nExample: I\u0027ve been using N-Gons forever - this Soyuz interior, the control panel face is a very-high-gon.\n\n![e7798277f3.png](http://puu.sh/gSm2a/e7798277f3.png)\n\n**In a nutshell.**\n\n![74a621705c.png](http://puu.sh/gSmfQ/74a621705c.png)\n\nOr\n\n![45627262a4.png](http://puu.sh/gSmhH/45627262a4.png)"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-27T23:54:19Z","Content":"So why are quads better though?"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-03-28T03:21:37Z","Content":"Everything is made of triangles in the end, keep that in mind - even quads are bad if you bend them \u0026 don\u0027t pay attention to the triangles they\u0027re made up of. I\u0027ve honestly forgotten most of the reasons ( although it\u0027d be easy to look up ), Max\u0027s mesh smoothing mods - and I presume everything else\u0027s - don\u0027t really appreciate them too well though, and you can run into issues with smoothing in general if you\u0027re not careful. If it\u0027s a flat surface then make it out of whatever the hell you want, providing it\u0027s always going to be flat ( ie you\u0027re not animating it ). Possibly might get some artifacts from a LODding algorithm. If it\u0027s curved try and stick with quads at least, it\u0027ll be safest for exporting."},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2015-03-28T03:51:28Z","Content":"Like Van Disaster said, as long as the Ngon is flat, and the edges around it are hard, and it\u0027s never animated then it\u0027s fine.\n\nThe issue with N-gons is that when they are triangulated this will happen in a completely random matter, so if you aren\u0027t careful you can get some really ugly results. If your N-gon has any concave elements it might even cause overlapping faces.\n\n\u003E \n\u003E So why are quads better though?\n\nQuads are considered to be better because they allow you to have non-extraordinary vertices, and when you subdivide a mesh with extraordinary vertices the mesh will either pinch or pull away from them. Other than that mesh editing tools work better with quads, and they actually make the mesh flow readable.\n\n**Edited \u003Ctime datetime=\u00222015-03-28T03:53:37Z\u0022 title=\u002203/28/2015 03:53  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 28, 2015\u003C/time\u003E by maccollo**"},{"CreatedByName":"landeTLS","CreatedById":97925,"CreatedDateTime":"2015-03-28T10:48:54Z","Content":"For lowpoly flat areas ngons are a-ok(edgesplit or seperate smoothgroup). The only issue with them is that you cant predict exactly how they will be triangulated once ingame. That might not be a problem for you as they will \u0022always\u0022 be triangulated to the lowest amount of tris. But if its important for you that they are a bit more even then you may want to do the triangulation manually For consistency.\n\nBut basically anything that will be smoothed(eather by smooth shading interpolation or subdivision) will look wierd with ngons.\n\nif you are subdividing your lowpoly or making a proper hipoly from it to get better ao baking etc you will want to atleast inset a support loop around the ngon.\n\nFor both your examples ngons are ok as it will not create any visual differences.\n\ni only worry about quads if i want the mesh to be kept easily editable, animated or if im making a hipoly Model.\n\n**Edited \u003Ctime datetime=\u00222015-03-28T11:07:39Z\u0022 title=\u002203/28/2015 11:07  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 28, 2015\u003C/time\u003E by landeTLS**"}]}