{"TopicId":106394,"ForumId":15,"TopicTitle":"How Do The New Parachutes Work?","CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2015-04-30T21:37:17Z","PageNum":1,"Articles":[{"CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2015-04-30T21:37:17Z","Content":"It\u0027s black magic, I\u0027m sure.\n\nA couple of examples:\n\n![4f7eb4f93e.jpg](http://puu.sh/hwJ2I/4f7eb4f93e.jpg)\n\n![de77d30fa7.jpg](http://puu.sh/hwJ4i/de77d30fa7.jpg)\n\nSo note:\n\n- Parachutes are adding horizontal velocity, producing a gliding effect.\n- Parachutes not slowing the capsule down nearly enough.\n- Parachutes creating mystery \u0022torque\u0022 on deploy.\n\nWhat I\u0027m doing.\n\n- Parachute config values a pulled from stock chutes\n- All tests, the capsule deploys parachute at 9000m travelling straight downwards\n- Some parachutes I\u0027ve made seem to work fine, others: the pictures above.\n\nSorry for such a borderline rant post, but I just cannot seem to figure out the new mechanics. ![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif)\n\nExample config.\n\n    PART{name = Spica_Parachute_Amodule = Partauthor = TantaresMODEL{   model = Tantares/Parts/GEMINI/Spica_Parachute_A/model   texture = Spica_Crew_A_psd , Tantares/Parts/GEMINI/Spica_Crew_A/Spica_Crew_A_psd}scale = 1node_stack_bottom = 0.0, -0.143, 0.0, 0.0, -1.0, 0.0, 0node_stack_top    = 0.0,  0.143, 0.0, 0.0, 1.0, 0.0, 0bulkheadProfiles = size0sound_parachute_open = activatesound_parachute_single = deployTechRequired = survivabilityentryCost = 2000cost = 600category     = Utilitysubcategory  = 0title        = G-143A Orientation Parachutemanufacturer = Tantares Space Technologiesdescription  = A parachute with a built in RCS system, to finer control re-entry orientation.attachRules = 1,0,1,1,0mass = 0.16dragModelType  = defaultmaximum_drag   = 0.20minimum_drag   = 0.15angularDrag    = 2crashTolerance = 10maxTemp        = 2000fuelCrossFeed = FalsestageOffset = -1MODULE{  \tname = ModuleParachute\tsemiDeployedAnimation = Spica_Parachute_A_Semi\tfullyDeployedAnimation = Spica_Parachute_A_Full\tinvertCanopy = false\tautoCutSpeed = 0.5\tcapName = Cap\tcanopyName = Spica_Parachute_A_Canopy\tstowedDrag = 0.22\tsemiDeployedDrag = 1\tfullyDeployedDrag = 500\tminAirPressureToOpen = 0.01\tdeployAltitude = 2300\tdeploymentSpeed = 1\tsemiDeploymentSpeed = 1\t}MODULE{    name = ModuleDecouple    isOmniDecoupler = false    ejectionForce = 250}MODULE{\tname = ModuleRCS\tthrusterTransformName = monoTransform\tthrusterPower = 1\tresourceName = MonoPropellant\tatmosphereCurve \t{   \t key = 0 240  \t key = 1 100 \t}}\tMODULE\t{\t\tname = ModuleDragModifier\t\tdragCubeName = SEMIDEPLOYED\t\tdragModifier = 13\t}\tMODULE\t{\t\tname = ModuleDragModifier\t\tdragCubeName = DEPLOYED\t\tdragModifier = 50\t}}"},{"CreatedByName":"Ven","CreatedById":109931,"CreatedDateTime":"2015-05-02T22:25:32Z","Content":"I think that your parachutes PartDatabase.cfg entry is a bit wonky, I had the same problem with my Parachute-Docking combo port, and after a bit trial and error, I deleted the PartDatabase.cfg (just inside your KSP folder) to force KSP to recalculate all the parts drag cubes. After that, the problem wen\u0027t away for me.\n\nhopefully that solves your problem."},{"CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2015-05-02T22:51:49Z","Content":"\u003E \n\u003E I think that your parachutes PartDatabase.cfg entry is a bit wonky, I had the same problem with my Parachute-Docking combo port, and after a bit trial and error, I deleted the PartDatabase.cfg (just inside your KSP folder) to force KSP to recalculate all the parts drag cubes. After that, the problem wen\u0027t away for me.\n\u003E hopefully that solves your problem.\n\nThanks for the info!\n\nI\u0027ll give it a try ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nEdit: Appears to have done the trick, many thanks!\n\n**Edited \u003Ctime datetime=\u00222015-05-02T23:00:59Z\u0022 title=\u002205/02/2015 11:00  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 2, 2015\u003C/time\u003E by Beale**"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2015-05-02T23:03:00Z","Content":"I am having zero luck converting my Novapunch chutes into functioning parts for 1.0.x - they seem to animate and deploy correctly as long as they\u0027re oriented right in Unity, but as soon as physics kick in they apply weird directional drag, spin around and then explode due to aero forces and heating - if you deploy directly into fullDeploy mode (say under 500m) then it\u0027ll sort of jitter wildly and then fling the pod in some direction when it explodes.\n\nWe tried endless things last night to solve it without luck. If you have a working chute can you post its setup in Unity. Also, how do you animate it?\n\nTo try to solve your horizontal drift issue, try flipping the direction your chute is oriented to locally (make the canopy point \u002BZ locally then add 90 degrees rotation in Unity to make it look right) - Mine seem to deploy in the right direction now, they just don\u0027t behave properly afterwards.\n\n**Edited \u003Ctime datetime=\u00222015-05-02T23:06:04Z\u0022 title=\u002205/02/2015 11:06  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 2, 2015\u003C/time\u003E by Tiberion**"},{"CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2015-05-03T15:01:59Z","Content":"\u003E \n\u003E I am having zero luck converting my Novapunch chutes into functioning parts for 1.0.x - they seem to animate and deploy correctly as long as they\u0027re oriented right in Unity, but as soon as physics kick in they apply weird directional drag, spin around and then explode due to aero forces and heating - if you deploy directly into fullDeploy mode (say under 500m) then it\u0027ll sort of jitter wildly and then fling the pod in some direction when it explodes.\n\u003E We tried endless things last night to solve it without luck. If you have a working chute can you post its setup in Unity. Also, how do you animate it?\n\u003E \n\u003E To try to solve your horizontal drift issue, try flipping the direction your chute is oriented to locally (make the canopy point \u002BZ locally then add 90 degrees rotation in Unity to make it look right) - Mine seem to deploy in the right direction now, they just don\u0027t behave properly afterwards.\n\nStill no luck, I experience much the same problem, sorry!\n\nI too animate Z\u002B if that helps.\n\nPerhaps someone who worked on the new aero can chime in? \n\nSeriously one of the most frustrating issues at the moment.\n\nWhenever the drag-cube database gets rebuilt, it is getting rebuilt wrong for my parachute parts, or perhaps more likely I\u0027ve made my parachute parts wrong somehow."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-05-03T16:08:28Z","Content":"I can confirm that this is mostly (all?) caused by incorrect drag\\_cube entries in the PartDatabase file;\n\nI too have a Command Module with built in parachutes that simply ceased to function in 1.0\u002B. Adding the drag\\_cube modules to the part didn\u0027t help by itself.\n\n After reading this thread during investigation, I decided to look in the PartDatabase.cfg file. \n\n Drag cube is listed as \u0027procedural=true\u0027 for my part in question; there are not multiple entries for stowed/semideployed/deployed as there are for the other parachutes. After copying over the drag cube entry from one of the stock parachutes, my part functions... approximately correctly (well, it now slows down the descent properly, and doesn\u0027t seem to throw any odd movement vectors in there, but the drag is still way off compared to 0.90)\n\nDoes anyone know what these drag cubes are supposed to represent, how to calculate one manually, or how to force the game to properly calculate them?\n\nEdit:\n\nFurther browsing brought me to: [http://forum.kerbalspaceprogram.com/threads/118847-Tech-Tree-ID-strings](https://forum.kerbalspaceprogram.com/threads/118847-Tech-Tree-ID-strings) , where it is pointed out that drag-cubes can be manually specified in the part config file. And indeed there several stock parts with drag cube overrides in the part .cfg.\n\nSeveral stock parts have multiple drag-cube entries in the PartDatabase.cfg file, -without- multiple overrides in their part.cfg file. They also do not seem to have any additional colliders/bounding boxes when the .mu is imported into blender. I have a feeling that those parts have new custom bounding boxes or such created in unity to define these custom drag cube properties (tags/layers/naming convention)(which may not be supported by the .mu importer yet). May need to wait for some dev response to know what is up on the part-tools/proper way of doing things.\n\nAdditionally, I can note that in the PartDatabase.cfg there is an A and B drag-cube entry for each part with an animation; these cubes seem to roughly correspond with the size of the part at each animation state. Parts with -multiple- animations get drag-cubes listed only as \u0027procedural=true\u0027; I\u0027m guessing this tells the game engine to recalculate the drag-cube based on the current combination of animation states. Here is where the problem will likely be for any mod-added parachutes at the current time--without knowing how to specify the custom drag-cube overrides in the model, these will likely all default to \u0027procedural=true\u0027 due to multiple animations; the default procedurally calculated drag-boxes are nowhere near appropriate for parachute-like drag, and are not named appropriately for the drag-cube-modifier module to take effect properly.\n\nEach drag-cube entry has a name (first param), followed by 24 comma separated values. As near as I can tell, these value are broken into 8 groups of 3, representing the 3-dimensional coordinates for the corners of a bounding box. Makes sense for something called a \u0027drag-cube\u0027. I\u0027m still working over the conversion of these values into the bounding box, and how it relates to the part orientation and dimensions. \n\nI did notice for stock parachutes that the drag cube seemed to be offset quite a bit on the X\u002B axis (if X is the first coordinate given...still working on that...), up to 100 units for the larger parachute.\n\n--going to import some of these .mu models into blender, and map their drag cubes over top of them, to see how they correspond to model-space. This should hopefully give enough information to specify some custom drag-cubes that -work-, with further tweaking in the part.cfg through the drag-cube multiplier stats.\n\n-- further edit:\n\nA quick plotting in blender of one of these \u0027cubes\u0027 (as 8 groups of 3, each a 3-d coordinate), fails to make any sense as a geometric shape. I cannot seem to make any sense out of the numbers given, in any kind of coordinate addressing system that I am familiar with.\n\nNow the question is back to, how to manually calculate one (or three in the case of a parachute?)\n\n**Edited \u003Ctime datetime=\u00222015-05-03T17:47:11Z\u0022 title=\u002205/03/2015 05:47  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by Shadowmage**"},{"CreatedByName":"Gristle","CreatedById":60589,"CreatedDateTime":"2015-05-03T19:42:58Z","Content":"Some drag cube info here. Nothing concerning parachutes but StupidChris does define what the values are. [http://forum.kerbalspaceprogram.com/threads/118362-Drag-cubes](https://forum.kerbalspaceprogram.com/threads/118362-Drag-cubes)"},{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2015-05-03T20:54:31Z","Content":"To stop the parachute gliding add this to the part config: bodyLiftMultiplier = 0, delete the partdatabase file after changing this. You\u0027ll notice all stock chutes have this value.\n\n**Edited \u003Ctime datetime=\u00222015-05-03T20:57:19Z\u0022 title=\u002205/03/2015 08:57  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by raidernick**"},{"CreatedByName":"Gristle","CreatedById":60589,"CreatedDateTime":"2015-05-03T21:13:50Z","Content":"\u003E \n\u003E To stop the parachute gliding add this to the part config: bodyLiftMultiplier = 0, delete the partdatabase file after changing this. You\u0027ll notice all stock chutes have this value.\n\nNice! - confirmed this worked for me."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-05-04T15:20:43Z","Content":"Thanks for the additional links and info. That explanation of drag cubes -should- give me enough to create some custom ones for my parachutes.\n\nI wonder if I could get the game to properly calculate my parachute drag-cubes automatically if I removed all-other animations from the part? The stock parachutes seem to have theirs calculated automatically, but mine will only ever say \u0027procedural=true\u0027 whenever I let stock calculate it (likely due to the multiple animations, some of which are not related to the parachute; none of the other animations interfere with geometry though).\n\nFrom the linked thread:\n\nEach drag cube entry contains a name and 8 sets of 3 numbers. The first 6 sets are the projection of the part as onto a plane for each of the six faces of a cube. The last 2 sets are unknown. In each of the first six sets of values, the first number represents the area (w/h), the second the drag coefficient, and the third is the depth. They are listed in X\u002B, X-, Y\u002B, Y-, Z\u002B, Z- order as far as I\u0027m aware.\n\nDrag Coefficient stuff: [http://en.wikipedia.org/wiki/Drag_coefficient](https://en.wikipedia.org/wiki/Drag_coefficient)\n\nKnowing this, I\u0027ll be working through some of the drag-cube stuff today, figuring out the best way to manually specify drag cube(s) for custom parachutes; will post up whatever information I can find/figure out. I will likely start by comparing some stock values to see how they \u0027look\u0027, and do some trial and error from there to find how each value effects the outcome. Some real, hard, info on how this stuff should be properly calculated would be much appreciated if anyone can find it."},{"CreatedByName":"Cocox","CreatedById":108646,"CreatedDateTime":"2015-05-04T15:44:51Z","Content":"How do I make an MM patch to add \u0022bodyLiftMultiplier = 0\u0022 to all parachute parts?"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-05-04T15:52:47Z","Content":"Stock parachutes (and those from other mod authors) should already have that line in them. You should only need to add that to any custom parachutes that you personally create.\n\n(Sorry, I have no experience with ModuleManager, so cannot tell you how to do the patch=\\)"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-04T19:55:48Z","Content":"@PART[\\*]:HAS[@MODULE[ModuleParachute]]\n\n{\n\n%bodyLiftMultiplier = 0\n\n}"},{"CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2015-05-04T20:56:52Z","Content":"\u003E \n\u003E To stop the parachute gliding add this to the part config: bodyLiftMultiplier = 0, delete the partdatabase file after changing this. You\u0027ll notice all stock chutes have this value.\n\nFantastic, that\u0027s fixed it!\n\nMany thanks raidernick!"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-05-05T02:10:21Z","Content":"I found how to get the game to auto-calculate the drag cube for a part with non-parachute related (or really any) animations.... comment them out of the part config, and reload the PartDatabase.cfg. It will them properly calculate the parachute drag cubes and insert those values into the PartDatabase.cfg.\n\nNow the problem I\u0027m coming across is that the method for custom-specifying a drag-cube in the part config file is not fully implemented/does not work for multiple named cubes. All three named cubes get inserted into the PartDatabase.cfg, but instead of starting with cube = DEPLOYED, etc... they start with DEPLOYED = DEPLOYED, and are not registered/loaded properly as far as the parachute module is concerned. I examined the stock pieces that have drag cube overrides in the part.cfg file, and they have the same bug/issue in the PartDatabase.cfg file; their drag cubes are started with \u0027Default = Default\u0027, rather than the proper \u0027cube = Default\u0027.\n\nSo for now, I\u0027ve removed the extra animations from my part (some cabin light emissive stuff....), so that the game auto-calculates the drag cubes properly, I can use the parachute drag-cube-multiplier modules, and possibly be able to release my parts one day.\n\nI suppose I should probably report this find to the KSP Bug Tracker?"}]}