{"TopicId":109792,"ForumId":15,"TopicTitle":"Service Bays: transparency effects while closed in VAB?","CreatedByName":"AndyMt","CreatedById":123144,"CreatedDateTime":"2015-05-18T10:33:49Z","PageNum":1,"Articles":[{"CreatedByName":"AndyMt","CreatedById":123144,"CreatedDateTime":"2015-05-18T10:33:49Z","Content":"I try to model a cargo bay or service bay like the stock parts for my Blacksky rocketplane. Now I want the cargo bay to use the same transparency effect like the stock service bays, so one can see what is inside while mouse over.\n\nHas anyone figured out how this works? I\u0027ve looked at the stock parts by importing it to blender and although I think I did everything limilar it doesn\u0027t work. Even directly creating my own part based on the imported service bay model doesn\u0027t work. So something is missing in Unity - I think. I\u0027m probably using the wrong trigger or it has to be of a certain number, like for example the engine glow (22 or so).\n\nAny general hints/lessons learned?"},{"CreatedByName":"mariohm1311","CreatedById":114131,"CreatedDateTime":"2015-05-18T13:11:05Z","Content":"Ok, I found this module on the .cfg file. Maybe it\u0027s what you\u0027re looking for.\n\n\u003E \n\u003E MODULE {\n\u003E  name = ModuleSeeThroughObject\n\u003E \n\u003E  transformName = TrussMount\n\u003E \n\u003E  shaderName = KSP/Bumped Specular (Transparent)\n\u003E \n\u003E  screenRadius = 1.0\n\u003E \n\u003E  leadModuleIndex = 0\n\u003E \n\u003E  leadModuleTgtValue = 0\n\u003E \n\u003E  }\n\nBetter wait for Kipard to appear. He knows better than me."},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-05-18T13:54:14Z","Content":"The module set the specified shader to all mesh in childs of the transformName. Then it set the \u0022\\_Opacity\u0022 variable of the shader depending on 2 factor : \n\n - if leadModuleIndex point to a module that implements a specific interface (ModuleAnimateGeneric or ModuleProceduralFairing) then it gets a value from those module to set the \\_Opacity\n\n - if leadModuleIndex is not here then the \\_Opacity seems to be set from how far the cursor is"},{"CreatedByName":"AndyMt","CreatedById":123144,"CreatedDateTime":"2015-05-18T14:42:15Z","Content":"\u003E \n\u003E The module set the specified shader to all mesh in childs of the transformName. Then it set the \u0022\\_Opacity\u0022 variable of the shader depending on 2 factor : \n\u003E  - if leadModuleIndex point to a module that implements a specific interface (ModuleAnimateGeneric or ModuleProceduralFairing) then it gets a value from those module to set the \\_Opacity\n\u003E \n\u003E  - if leadModuleIndex is not here then the \\_Opacity seems to be set from how far the cursor is\n\nThanks a lot. I used the CFG part mentioned above, actually I used a modified stock CFG.\n\nThat\u0027s what I did:\n\n- used the very same CFG file (renamed and with changed Part ID) as the stock service bay.\n\n- imported the stock MU model into Blender\n\n- exported it to DAE\n\n- Created GameObject in Unity, imported model\n\n- Set textures, materials etc.\n\n- made sure transforms and objects are named the same as the original (as far as we can see that).\n\n- fiddled with the Part tools etc. as usual.\n\nResult: the part works, but the transparency doesn\u0027t kick in while mouse over.\n\nI think the problem is the Shader: KSP/Bumped Specular (Transparent).\n\nThe \u0022Transparent\u0022 makes me worry. Which shader should I apply to the model in Unity? Does it matter?\n\nI\u0027ll check the transform names and other stuff again when I\u0027m back home... \n\nIt just hit me: maybe the import/export changed the scale and so the \u0022screenRadius\u0022 doesn\u0027t do what I want it to?"}]}