{"TopicId":111311,"ForumId":15,"TopicTitle":"Multiple Staging Functions?","CreatedByName":"jfjohnny5","CreatedById":64610,"CreatedDateTime":"2015-05-29T21:54:58Z","PageNum":1,"Articles":[{"CreatedByName":"jfjohnny5","CreatedById":64610,"CreatedDateTime":"2015-05-29T21:54:58Z","Content":"Is it possible to have one part with multiple staging functions? Specifically, can I have a part that has an integrated Solid Rocket Engine AND a Decoupler?"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-05-30T00:43:46Z","Content":"\u003E \n\u003E Is it possible to have one part with multiple staging functions? Specifically, can I have a part that has an integrated Solid Rocket Engine AND a Decoupler?\n\nYes, but they will stage simultaneously. The part will show in the staging list only once. \n\nAs an example, my radial decouplers in SpaceY do exactly that-- Decoupler \u002B mini-SRBs, for a thrust-based ejection, rather than relying on the ejection force."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-30T01:30:59Z","Content":"You can, however, disable staging for one of the modules. Like you could have a retro ring that has an engine that fires on stage, but a decoupler that only activates when the right-click menu (or action group) is used.\n\nThe opposite approach is often used by LES towers: both decoupler and engine activate on stage, but for the abort action group you can assign only the engine."},{"CreatedByName":"jfjohnny5","CreatedById":64610,"CreatedDateTime":"2015-05-30T01:36:29Z","Content":"\u003E \n\u003E You can, however, disable staging for one of the modules. Like you could have a retro ring that has an engine that fires on stage, but a decoupler that only activates when the right-click menu (or action group) is used.\n\nThat should work. I\u0027m actually making a retro ring. Do you happen to know how to disable a module from staging? I took a look at the CFG documentation on the wiki, but didn\u0027t see anything."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-06-11T15:50:14Z","Content":"\u003E \n\u003E That should work. I\u0027m actually making a retro ring. Do you happen to know how to disable a module from staging? I took a look at the CFG documentation on the wiki, but didn\u0027t see anything.\n\nIt is only possible to disable specific modules from staging; most specifically the decoupler.\n\nIt has a field called \u0027staged\u0027 in the config that will determine if the staging action will activate the decoupler or not. So, in your moduledecoupler, add the line \u0027staged=false\u0027 to omit the decoupler from staging action. I have not yet tried this to see how well it works (looking at the source, it -should- work) or if it removes the decoupler staging icon (probably does not). I\u0027m still looking for similar flags with engines and parachutes, but not finding much yet."}]}