{"TopicId":118449,"ForumId":15,"TopicTitle":"Texture modification using Paint(.net)?","CreatedByName":"MedwedianPresident","CreatedById":12212,"CreatedDateTime":"2015-08-14T12:45:16Z","PageNum":1,"Articles":[{"CreatedByName":"MedwedianPresident","CreatedById":12212,"CreatedDateTime":"2015-08-14T12:45:16Z","Content":"\n\u003Cp\u003ESpacesuit and Head textures can be modified using free painting programs. Can I modify the texture of the parts using Paint, PaintNet or Gimp? I am asking this because whenever I modify the texture for a part using Paint or PaintNet, it turns white ingame. Or do I have to change something in the configuration file?\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-08-14T12:48:25Z","Content":"\n\u003Cp\u003EDid you include a separate texture or did you just \u0022paint\u0022 over the existing one? Yes they can be edited btw.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2015-08-14T15:24:27Z","Content":"\n\u003Cp\u003EPaint.net is what I used for all my WindowShine textures as well as the various part textures and planet textures I\u0027ve made. You totally can use it, but you\u0027ll want to find the alpha channel plugin for paint.net before you edit anything. Most of the textures have big invisible areas on them and removing alpha channel transparencies is the only way to fix it. The plugin is on the forums Las Tim I checked (yesterday lol). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-08-14T17:35:42Z","Content":"\n\u003Cp\u003EI\u0027d be inclined to recommend the GIMP. It handles every file format you\u0027re likely to need, it uses layers (which are a powerful tool) and it\u0027s free. It\u0027s also, like KSP, available for Apple, Linux, and Windows. It\u0027s big, and complicated, but anything that does so much has to be.\u003C/p\u003E\u003Cp\u003EAnd the best program is the one you know how to use, anyway.\u003C/p\u003E\n"}]}