{"TopicId":126212,"ForumId":15,"TopicTitle":"How to add Windows to your command pod","CreatedByName":"Daelkyr","CreatedById":149075,"CreatedDateTime":"2015-11-23T00:19:15Z","PageNum":1,"Articles":[{"CreatedByName":"Daelkyr","CreatedById":149075,"CreatedDateTime":"2015-11-23T00:19:15Z","Content":"\nI\u0026#39;ve been kicking a 1.25/1.875 2 Kerbal command pod into shape but one thing keeps alluding me. How can I get a mirrored/symmetrical set of Windows cut into my pod. I keep telling Val and Jeb that they don\u0026#39;t need them, but Bill insists that docking requires them.\u003Cbr\u003E\n\u003Cbr\u003E\nI use Blender (still a noob) and I don\u0026#39;t know what I don\u0026#39;t know yet to find the answer myself. Any help would be appreciated.\u003Cbr\u003E\n\u003Cbr\u003E\n- Josh\n"},{"CreatedByName":"Kartoffelkuchen","CreatedById":108501,"CreatedDateTime":"2015-11-23T21:40:52Z","Content":"\nWell, first, you want to create the shape of the window. If you want it to be more than a disk, you can use the mirror modifier. It mirrors what you have done on the one side to the other side. \u003Cbr\u003E\nTo actually cut a window into your capsule, you\u0026#39;ll want to use the boolean modifier. Apply it to the command pod, set object to the window, set to difference. I\u0026#39;d recommend you to watch some videos about that though.\n"},{"CreatedByName":"fairy","CreatedById":152892,"CreatedDateTime":"2015-11-23T22:09:09Z","Content":"\nIf you need the window to be exactly 180 degrees opposite (or any degree really) just set the Pivot Point to \u00223D Cursor\u0022, click on the window, press shift\u002BD and type 180 degrees. If you want 4 windows directly 90 degrees apart, do the same thing, but after hitting Shift\u002BD and typing 90 degrees, just press shift\u002BR and it will repeat it. It is a technique that makes making things symmertrical really quick and easy.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, depending on how you use the boolean modifier, you can be left with unwanted shading artifacts. Especially if you apply an Edge Split modifier afterwards. More often than not, when I use the boolean modifier I tend to have to spend a lot of time making cuts and joining verts to get rid of the shading artifacts. But what Kartoffelkuchen said works great if you know what you are doing.\n"},{"CreatedByName":"InsaneDruid","CreatedById":137849,"CreatedDateTime":"2015-11-23T23:53:32Z","Content":"\nBesides the already mentioned \u0022manual\u0022 copy and rotation around the 3d cursor, you also have a mirror modifier (that can also be used multiple times, say to model 1/4th of a part, then mirror on x and then mirror everything again on y. For better control, use the array modifier with a empty that is rotated (and/or moved) one step. Say, you want a 6-way symmetric window arrangement? Add a empty, rotate it 360/6=60 degrees, add a array modifier to you model, set to 6x repetition, offset to be based on the emty.\u003Cbr\u003E\n\u003Cbr\u003E\nGoogle for \u0022Blender mirror modifier\u0022 and \u0022blender array modifier\u0022 and/or watch this video (which i learned it from ;) ): [url]http://www.blenderguru.com/tutorials/how-to-make-a-car-wheel/[/url]\n"},{"CreatedByName":"Daelkyr","CreatedById":149075,"CreatedDateTime":"2015-11-25T01:53:10Z","Content":"\nThanks for all the great advice. I finally settled on using Boolean modifier to punch holes through the side of my ship. My only problem now, is that the walls aren\u0026#39;t perfectly smooth. But I\u0026#39;m working on it.\n"},{"CreatedByName":"InsaneDruid","CreatedById":137849,"CreatedDateTime":"2015-11-26T15:28:30Z","Content":"\nLook at this thread, the solution for blender is on page3: [url]http://forum.kerbalspaceprogram.com/threads/136097-Window-Geometry[/url]\n"},{"CreatedByName":"artwhaley","CreatedById":118388,"CreatedDateTime":"2015-11-26T19:39:58Z","Content":"\nIf you get dark \u0026#39;wrinkles\u0026#39; in your hull after a boolean operation (or.. really any time you get those) the \u0022Edge Split\u0022 modifier frequently helps! If you can wriggle the angle modifier, or set the \u0022Edge Split\u0022 to respect sharp edges, and then mark the edge that you just cut along as \u0026#39;sharp\u0026#39; it should make the surrounding areas go back to smoothing correctly. Way easier than the solutions in that thread, if it works for you! But, do check to make sure you don\u0026#39;t have any normals reversed too (keeping backface culling on when you model is a good idea anyway to prevent dumb mistakes!)\n"}]}