{"TopicId":179666,"ForumId":15,"TopicTitle":"Textures luminescence/shininess","CreatedByName":"L0ck0n","CreatedById":179874,"CreatedDateTime":"2018-11-09T17:58:31Z","PageNum":1,"Articles":[{"CreatedByName":"L0ck0n","CreatedById":179874,"CreatedDateTime":"2018-11-09T17:58:31Z","Content":"\n\u003Cp\u003E\nHow to recreate stock textures luminescence/shininess? I know that KSP textures use alpha channel as a luminescence channel. I can extract this channel in GIMP to separate layer. But i can\u0027t recreate this in my textures, creating simple alpha channel transparency doesnt work. Do you have any tips on how to create textures with luminescence/shininess like that in KSP stock textures?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-09T17:58:48Z\u0022 title=\u002211/09/2018 05:58  PM\u0022 data-short=\u00225 yr\u0022\u003ENovember 9, 2018\u003C/time\u003E by L0ck0n\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2018-11-10T02:11:32Z","Content":"\n\u003Cp\u003E\nYou can add a alpha layer by right clicking on the layer and in the drop down selecting \u0022Add Layer Mask\u0022 - a number of options for creating from copying the alpha channel to a gray scale copy of the layer. To edit - click on the new alpha layer (so it has a white border) and edit away. When your done right click on the layer and select \u0022Apply layer mask\u0022 and it\u0027s merged back - or just leave it separate - when you export it\u0027s used as the alpha layer (I think).\n\u003C/p\u003E\n"},{"CreatedByName":"CobaltWolf","CreatedById":105588,"CreatedDateTime":"2018-11-14T14:01:04Z","Content":"\n\u003Cp\u003E\nI just go into the channel box in Photoshop and create an explicit alpha channel (which also saves me having to think in terms of transparency, I can just work with it as a separate grayscale map). Can GIMP not do the same? \u003Cimg alt=\u0022:huh:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 title=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"}]}