{"TopicId":189777,"ForumId":15,"TopicTitle":"Editing the Texture of the Mun?","CreatedByName":"Select Few","CreatedById":61042,"CreatedDateTime":"2019-11-13T20:37:38Z","PageNum":1,"Articles":[{"CreatedByName":"Select Few","CreatedById":61042,"CreatedDateTime":"2019-11-13T20:37:38Z","Content":"\n\u003Cp\u003E\nHello, fellow rocketeers! I have an idea for a change I want to make for the Mun but I have no idea where to start and, in truth, have never even ventured into creating my own mods before. I don\u0027t want to change the height or landscape of anything itself, mainly just the color of certain parts. I want to paint an image on the Mun that is visible from Kerbin, but I\u0027m not sure if that\u0027s even possible. And, even more difficult but not necessary, I\u0027d like to make it so that the image is visible even if the Mun is in shadow, almost like it\u0027s glowing. Is any of that possible, or am I heck-outta-luck?\n\u003C/p\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2019-11-17T04:06:15Z","Content":"\n\u003Cp\u003E\nYour best bet would be to look at some of the mods that do this - see what they do. I know Sigma did some recolors way back \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/132894-wip-130-sigma-kerbin-recolor/\u0022 rel=\u0022\u0022\u003Ehere\u003C/a\u003E and there are some more recent ones though I can\u0027t recall their names. Unsure if they require Kopernicus.\n\u003C/p\u003E\n"},{"CreatedByName":"Sigma88","CreatedById":113260,"CreatedDateTime":"2019-11-17T18:07:33Z","Content":"\n\u003Cp\u003E\nThe easiest way to modify planets is kopernicus, however it\u0027s still not updated for 1.8.1\n\u003C/p\u003E\n\u003Cp\u003E\nWe are working on updating it (mostly thomas actually), but there is no ETA\n\u003C/p\u003E\n\u003Cp\u003E\nHaving the image visible from kerbin would be possible, however getting it to glow is more difficult\n\u003C/p\u003E\n\u003Cp\u003E\nDepending on what image you want, you could use the \u0022glowing\u0022 feature from kopernicus expanded. But that will only work on 1.7.3 because it might not get updated to 1.8.1 at all\n\u003C/p\u003E\n"}]}