{"TopicId":19522,"ForumId":15,"TopicTitle":"Node viewer/editer??","CreatedByName":"AD-Edge","CreatedById":1045,"CreatedDateTime":"2012-09-17T15:54:32Z","PageNum":1,"Articles":[{"CreatedByName":"AD-Edge","CreatedById":1045,"CreatedDateTime":"2012-09-17T15:54:32Z","Content":"\n\u003Cp\u003EIve been working on some pretty complex parts recently, just wondering if theres a way to view the node positions? At the moment Im having to edit the position in the config, then load game and add the part, checking the position of the node. Its been pretty inefficient so far! And its the main thing thats slowing me down working on these parts.\u003C/p\u003E\u003Cp\u003EAny advice would be great. \u003C/p\u003E\u003Cp\u003EIm currently using Blender for the modelling/texturing. I have unity installed but havent really seen anything helpful importing/editing parts in unity in regards to nodes.\u003C/p\u003E\u003Cp\u003E-ADEdge\u003C/p\u003E\n"},{"CreatedByName":"UBERDOMINATOR","CreatedById":48288,"CreatedDateTime":"2012-09-18T07:53:44Z","Content":"\n\u003Cp\u003EI saw it suggested somewhere that if you can find the coords of the point/edge/vertex? you want as a node in Blender, you can just jot them down and try them in the .cfg. Don\u0027t know what shapes you are working with or where you want the nodes, so I don\u0027t know if this would help! Also, for the testing slowness what I did was create a second game file, delete all parts that aren\u0027t absolutely necessary for the testing of the nodes and run it that way. It quickens the load time QUITE a bit! Hope I could help!\u003C/p\u003E\u003Cp\u003EEdit: Also, if you copy the coords, may have to keep the scaling in mind (I honestly don\u0027t know).\u003C/p\u003E\n"},{"CreatedByName":"AD-Edge","CreatedById":1045,"CreatedDateTime":"2012-09-19T04:45:58Z","Content":"\n\u003Cp\u003EYeh Ive tried doing that, but they didnt match up, the scale in the config for the object was set to \u00271.0\u0027, so Im not sure whats going on there, was hoping it would work and be accurate. \u003C/p\u003E\u003Cp\u003EAs it is, I spent a lot of time manually editing the node positions in the config file, took quite some time but I have most of the pieces together now, its just a lot of sloppy guess work at first, until you get the hang of it (and even then its still super slow, when you have a modded ship made of 10-20 custom parts - all with nodes). I did also end up removing almost all of the stock parts to get it to load quicker as well, so that helps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf anyone else knows how to determine the node positions in Blender, would be great to know, Ill keep experimenting with the cursor position method, see if I can work out whats going on...\u003C/p\u003E\n"}]}