{"TopicId":197928,"ForumId":15,"TopicTitle":"Any recently-updated *non-video* tutorials for the importing-the-model part of KSP modding out there?","CreatedByName":"Starseeker","CreatedById":146175,"CreatedDateTime":"2020-11-05T08:26:57Z","PageNum":1,"Articles":[{"CreatedByName":"Starseeker","CreatedById":146175,"CreatedDateTime":"2020-11-05T08:26:57Z","Content":"\n\u003Cp\u003E\nRather self-explanatory: are there any tutorials for how to prepare \u0026amp; import a 3d model into KSP as a new part, that aren\u0027t video tutorials, and aren\u0027t critically outdated?\n\u003C/p\u003E\n\u003Cp\u003E\nI have some 3d modelling skills (going to be having to relearn Blender with the 2.8x UI changes, but that\u0027s a different topic), and I\u0027m wanting to know how to take a 3d model I\u0027ve made, add the various... transforms I think they\u0027re called? (the things that mark locations of engine flames, thrust direction, etc), and get that to be a functioning part in KSP. However, the last time I used a tutorial, the part basically just didn\u0027t work.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-11-05T08:28:37Z\u0022 title=\u002211/05/2020 08:28  AM\u0022 data-short=\u00223 yr\u0022\u003ENovember 5, 2020\u003C/time\u003E by Starseeker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2020-11-07T04:23:18Z","Content":"\n\u003Cp\u003E\nI\u0027ve been attempting to put together brief descriptions/instructions for making the various parts as I figure them out. Not a tutorial but does contain info on what transforms/colliders/etc. are needed. Contains a Blender project, The Unity project, the game folder with mu and cfg file and some notes.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022120438\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed746962466\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/169578-parts-demo-%E2%80%93-blender-gimp-and-unity-files-dec-7-2019/\u0026amp;do=embed\u0022 style=\u0022height:197px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Starseeker","CreatedById":146175,"CreatedDateTime":"2020-11-07T07:59:50Z","Content":"\n\u003Cp\u003E\nUnfortunately, I don\u0027t really have any Unity knowledge, so I also need to know how to set up Unity and all that, but still, thanks for the resource!\n\u003C/p\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2020-11-09T02:15:36Z","Content":"\n\u003Cp\u003E\nBeen awhile since I\u0027ve installed Unity - don\u0027t think I\u0027ve forgotten any steps but...\n\u003C/p\u003E\n\u003Cp\u003E\ndownload Unity 2019.2.2f1\n\u003C/p\u003E\n\u003Cp\u003E\nInstall \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/160487-parttools-updated/\u0022 rel=\u0022\u0022\u003Eparttools\u003C/a\u003E - note: some people are having problems with only a few 1.10.X shaders showing up - I\u0027m using 1.9.1 parttools until it gets fixed (or 1.11 comes out). After downloading it unzip and drop the unzipped folder into the Unity assets folder - import everything. There are some instructions on swapping out TextMeshPro but I just delete it as I\u0027m not using it.\n\u003C/p\u003E\n\u003Cp\u003E\nTo get the model into Unity you can drag and drop a dae or fbx file into the assets folder - or just drop a Blender file in.\n\u003C/p\u003E\n\u003Cp\u003E\nIn Unity create a GameObject for the root of your part and drag and drop the model asset onto this (dae files have a 90 degree rotation - I zero this out). Add Parttools to this root part - select the root part and the inspector will have a \u0022Add component\u0022 button - click that , select KSP and the top item is Part Tools. The first time you do this in a Unity project you select a directory to write the .mu file to.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen your part is setup click the \u0022Write\u0022 button in the inspector (when the root is selected).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}