{"TopicId":45042,"ForumId":15,"TopicTitle":"Wings3D or Blender? Unwrapping?","CreatedByName":"Nuin","CreatedById":71304,"CreatedDateTime":"2013-09-05T19:40:28Z","PageNum":1,"Articles":[{"CreatedByName":"Nuin","CreatedById":71304,"CreatedDateTime":"2013-09-05T19:40:28Z","Content":"\n\u003Cp\u003EI have taken a look at possibly coming up with a few custom parts, so I wanted to try my hand at it (especially as I am quite versatile in Photoshop so textures will not be an issue). I have looked at Wings 3D and Blender so far (since they are free), so I will probably use one of the two.\u003C/p\u003E\u003Cp\u003EI have gotten to UV unwrapping a donut/torus in Wings 3D with... unexpected results (shapes were either distorted or unorganized). I understand the concept, I just don\u0027t understand why it is coming out a mess.\u003C/p\u003E\u003Cp\u003EWhat program will work better for KSP part building? Any tips, suggestions and comments very much appreciated. Thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E*edit* - I just realized I posted in the wrong section. Can a moderator please move this to the modeling section? Thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-05T19:43:46Z\u0022 title=\u002209/05/2013 07:43  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 5, 2013\u003C/time\u003E by Nuin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Torminator","CreatedById":78617,"CreatedDateTime":"2013-09-05T20:28:53Z","Content":"\n\u003Cp\u003EI haven\u0027t heard of Wings3D, but Blender is pretty much the most well-known and commonly used 3d modelling software that you don\u0027t have to pay for. Personally, I find it far, far better than 3ds Max.\u003C/p\u003E\u003Cp\u003EThe advantage of this is that there is a wealth of information available. Countless tutorials, guides, forums, etc...\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-09-06T01:46:47Z","Content":"\n\u003Cp\u003EI second Torminator\u0027s advice. Its rather easy to UV unwrap in Blender and if you don\u0027t like the smart unwrap results, you can select one or a few or a group of faces and generate parts of the map until you\u0027ve got the islands the way you like. There are Blender tutorials available in these forums too (via links).\u003C/p\u003E\u003Cp\u003EEdit: you\u0027d find the links via the forum search engine. Ooops.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-06T06:25:09Z\u0022 title=\u002209/06/2013 06:25  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 6, 2013\u003C/time\u003E by Dispatcher\u003C/strong\u003E\n\u003Cbr\u003EExplaining how the links can be found.\n\u003C/span\u003E\n"},{"CreatedByName":"Torminator","CreatedById":78617,"CreatedDateTime":"2013-09-06T02:04:16Z","Content":"\n\u003Cp\u003EI\u0027ve heard quite a few people who use 3ds/Maya for modelling, and then use Blender for unwrapping. Blender\u0027s UV tools are very, very good.\u003C/p\u003E\n"},{"CreatedByName":"Nuin","CreatedById":71304,"CreatedDateTime":"2013-09-06T16:14:50Z","Content":"\n\u003Cp\u003EI have just started playing with Blender and find it is a lot more versatile and user-friendly than Wings. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2013-09-07T01:42:40Z","Content":"\n\u003Cp\u003EGo with Blender. It\u0027s awesome that it\u0027s free and it\u0027s easy to learn how to use it.\u003C/p\u003E\n"},{"CreatedByName":"Rareden","CreatedById":57466,"CreatedDateTime":"2013-09-08T01:12:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torminator\u0022 data-cite=\u0022Torminator\u0022\u003E\u003Cdiv\u003EI haven\u0027t heard of Wings3D, but Blender is pretty much the most well-known and commonly used 3d modelling software that you don\u0027t have to pay for. Personally, I find it far, far better than 3ds Max.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eoooohohohhhh hheeell no you did not just say that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torminator\u0022 data-cite=\u0022Torminator\u0022\u003E\u003Cdiv\u003EI\u0027ve heard quite a few people who use 3ds/Maya for modelling, and then use Blender for unwrapping. Blender\u0027s UV tools are very, very good.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eonly because they dont know how to use max\u0027s ones\u003C/p\u003E\n"},{"CreatedByName":"jedensuscg","CreatedById":76475,"CreatedDateTime":"2013-11-09T10:03:10Z","Content":"\n\u003Cp\u003EA little late, but I have to put my defense of Wings3D in. I started in wings before blender, and honestly wings is just so much simpler for learning. It can not do all the stuff blender can do, but wings takes a very minimalist approach, with most of the work your going to be doing accessed by right clicking and a drop down menu based on what your working on(faces, verts etc). You have far more real estate because you can do so much without having 3 different menu bars/tools bars around the screen.\u003C/p\u003E\u003Cp\u003EI love wings. Though it is not full featured in terms of animation, texturing etc, you can get some fast, easy results.\u003C/p\u003E\n"}]}