{"TopicId":46164,"ForumId":15,"TopicTitle":"Adding more channels to my object texture?","CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2013-09-16T22:16:47Z","PageNum":1,"Articles":[{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2013-09-16T22:16:47Z","Content":"\n\u003Cp\u003EI\u0027m used to building textures in layers in LightWave.\u003C/p\u003E\u003Cp\u003EYou start with a diffuse channel for color, then add another channel for specularity, then one for bump mapping, then one for luminosity, and so on. Each channel can use its own image or you might share a single image for multiple channels.\u003C/p\u003E\u003Cp\u003EI finally managed to build an object in Wings3d, UV map it, make a texture in photoshop, import it into Unity, then export it to KSP.\u003C/p\u003E\u003Cp\u003EWhile it worked, the texture needs improvement, but I can\u0027t see where I add new layers (channels) to my texture in either Wings or Unity? It\u0027s like you can have color OR normal mapping, but not both.\u003C/p\u003E\u003Cp\u003EWhich program should I be trying to do this in, Wings or Unity, and how do I do it?\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2013-09-16T23:36:13Z","Content":"\n\u003Cp\u003EIn KSP PartTools for Unity, the KSP/Bumped Shader allows you to specify both a color AND normal texture atlases.\u003C/p\u003E\n"},{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2013-09-17T00:41:35Z","Content":"\n\u003Cp\u003EI didn\u0027t notice that, but I was playing with the emissive shader and noticed that it allows for both diffuse and emissive images. So it sounds like there\u0027s no way to add more channels unless the shader supports it?\u003C/p\u003E\u003Cp\u003EThat brings up another question. Now that UV mapping is common, most models only seem to use a single material and a single texture image. Should I be building my models with multiple materials so I can get diffuse/emissive for windows and diffuse/bump for the hull?\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-09-17T04:07:57Z","Content":"\n\u003Cp\u003EThat\u0027s up to you. It can be done for sure. It doesn\u0027t seem to hit my game performance. Check my sig line for pics of parts I modeled and uploaded today. I used KSP/alpha/translucent specular for the outer tank and KSP/bumped specular for the inner structure of my fueled adapters. I just used KSP/specular for my fueled caps. See what you think. Actually you\u0027d get a better idea in game due to the lighting and shadow dynamics.\u003C/p\u003E\n"},{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-09-17T05:57:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo it sounds like there\u0027s no way to add more channels unless the shader supports it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs well as anywhere else, if you not code shaders by yourself, even in your Wings3d i\u0027m sure you can to use only channels slots which is available for particular shader. You choose shader depending on channels you need.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EShould I be building my models with multiple materials so I can get diffuse/emissive for windows and diffuse/bump for the hull?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can to use single \u0022ksp/emissive/bumped specular\u0022 for this. But yes, you can to use multiple materials, but this is almost never realy needed. Only real need for multiple materials can to be transparent/translucent parts at least from my experience.\u003C/p\u003E\u003Cp\u003EIt\u0027s just optimisation - if you can reach your goal with less then not need to use more.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-17T09:15:17Z\u0022 title=\u002209/17/2013 09:15  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 17, 2013\u003C/time\u003E by zzz\u003C/strong\u003E\n\u003C/span\u003E\n"}]}