{"TopicId":47510,"ForumId":15,"TopicTitle":"Merge exported animation and Unity animation.","CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-10-06T07:22:09Z","PageNum":1,"Articles":[{"CreatedByName":"zzz","CreatedById":63211,"CreatedDateTime":"2013-10-06T07:22:09Z","Content":"\n\u003Cp\u003EIs there any way? I prefer animate things in my modelling porgram, but exported (imported to unity)animation appears as \u0022read-only\u0022 in Unity and material animation is only possible by separate animation clip. I can make transform animation directly in Unity and it will be same clip but Unity is less comfortable. Is there easy way to import transform animation and make it possible to edit it in Unity and add Unity stuff to it to keep it to be a single clip? Maybe some trick in exporter or some checkbox in Unity?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-06T07:24:56Z\u0022 title=\u002210/06/2013 07:24  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 6, 2013\u003C/time\u003E by zzz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jahulath","CreatedById":78050,"CreatedDateTime":"2013-10-07T11:49:58Z","Content":"\n\u003Cp\u003EHi, I found that it is a bit funky but I managed to mix up Unity made Emissives with \u0022baked\u0022 movements in a single model BUT it didn\u0027t work as intended because for some reason the light object would not animate (probably becasue I was trying to do it with AnimateGeneric NOT AnimateLight or whatever the proper command would be).\u003C/p\u003E\u003Cp\u003EI did manage to get an extending aerial along with a white emissive glow, it just crapped up when I started messing with the light. I used the \u0022Animations\u0022 window in Unity and just selected parts and added them to the main animation as I went (all with no tutorial, if I can do it you definitely can!).\u003C/p\u003E\n"},{"CreatedByName":"DSSP","CreatedById":72559,"CreatedDateTime":"2013-10-15T15:53:26Z","Content":"\n\u003Cp\u003Ei have created a simple unity script a while back which is able to read-out animation keyframe/path/type basicly all you need to create an animationclip.\u003C/p\u003E\u003Cp\u003Eit would be very easy to rewrite it for your purpose (combining clips).\u003C/p\u003E\u003Cp\u003Eif you would like i could post you the script.\u003C/p\u003E\n"},{"CreatedByName":"Space ghöst","CreatedById":50704,"CreatedDateTime":"2013-11-09T17:04:48Z","Content":"\n\u003Cp\u003EWhat I do is either select Store in Root or Store in Original Roots when selecting your rigging. Now place your object in the scene. After that select the parent part that will control a group of objects. Then select the animation file from the parent object, it will highlight in yellow the animation file you are using. Select that file in the project window and hit ctrl-d to duplicate it (rename if you wish). From there you can now edit the copied animation file, as you\u0027ll have read/write access.\u003C/p\u003E\u003Cp\u003EPITA, but it works. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}