{"TopicId":61928,"ForumId":15,"TopicTitle":"Get-Vector script ?","CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-02-02T13:03:56Z","PageNum":1,"Articles":[{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-02-02T13:03:56Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI saw this script which might be usefull \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/2471-3ds-Max-Kerbal-Parts-Guide-Updated-1-2-2012?highlight=3dsmax\u0022 rel=\u0022external nofollow\u0022\u003Ein this closed old post\u003C/a\u003E, anyone know where to get it ?\u003C/p\u003E\u003Cp\u003EOr is there any other way to get similar results ?\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"},{"CreatedByName":"stubbles","CreatedById":36867,"CreatedDateTime":"2014-02-02T20:47:58Z","Content":"\n\u003Cp\u003EHere\u0027s the script: \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/1482056/getVectorTool.ms\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/1482056/getVectorTool.ms\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou\u0027re using 3dsmax I take it? If you\u0027re using Blender, I\u0027m not sure what alternative there is for it.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2014-02-02T23:49:19Z","Content":"\n\u003Cp\u003EIts easy enough to find it manually. Set up your part as you want in your software, or in Unity. Then create a new object and place it where you would want the node. Then find the location transform for that object (in other words, the coordinates for its location); it will be the offset values for your node from the origin of your part (make sure you part is situated over the scene origin properly)\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-02-03T06:20:46Z","Content":"\n\u003Cp\u003Ethanks both for reply, I just found the script it earlier in the deprecated KSP SDK available on official wiki.\u003C/p\u003E\u003Cp\u003E@Tiberion: it sounds easy in your mind I guess with your experience, but without a bit of practice and knowledge, it doesn\u0027t looks like so easy reading you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I\u0027m just begin to make parts and I have to make my way in, so I\u0027ll be happy to discover as much methods as possible to get the one which fit me the best.\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2014-02-04T23:12:30Z","Content":"\n\u003Cp\u003EWell, its simple once you understand how objects exist within the 3d scene you work in. Each \u0022object\u0022 be it a mesh, a collider, or just an \u0022empty\u0022 abstract GameObject placed in Unity has its own set of coordinates that tells you where it is with relation to the center of the scene (which is 0, 0, 0)\u003C/p\u003E\u003Cp\u003ESo if you make a simple cylinder for a fuel tank, and leave it at the scene origin, its coordinates are also 0, 0, 0. To alter this, you can transform \u0022Objects\u0022 by moving them, scaling, them, or rotating them. This is different from actually editing the geometry of a mesh in \u0022edit mode\u0022 or whatever - you\u0027re just applying modifications to the object and not its underlying parts, and you can go it to any type of object (even if scaling an empty abstract object to 2x scale doesn\u0027t seem to have any value, it actually can if you add other objects to it as \u0022children\u0022 as they can inherit transforms from their parents, but thats a story for another day.)\u003C/p\u003E\u003Cp\u003ESo lets say you make that cylinder just the right size, but you don\u0027t know how \u0022tall\u0022 it is and thus don\u0027t know where to put the top and bottom nodes would be, as coordinates.\u003C/p\u003E\u003Cp\u003EMost 3d programs have a function where you could select the top face or a vertex on the cylinder itself and find the coordinate that way (In Blender, you go into Edit mode, hit N to open the property panel and select the top face, and the coordinate is displayed.\u003C/p\u003E\u003Cp\u003EOr, you can use the method I desrcibed in my last post, which is a little more flexible, because you might not always have a face or a vertex in the exact spot you would want your node. So here, you create another object (it can be a tiny cube in your 3d program, or any sort of object in Unity) and move the object so that its origin point is exactly where you want the node to be. Then the coordinate of your new object will match the desired coordinate of your node on the original object.\u003C/p\u003E\u003Cp\u003ELets say you move your 2nd object so that it sits right where the node on top of your cylinder would be, and when you check its coordinates, it has 2.25 as its vertical coordinate (and if you moved neither off of the origin on the other axies, they should both be 0) - Thus the coordinates of your node would be 0, 2.25, 0 (and if your cylinder is symmetric top vs bottom, the bottom node coordinate would be 0, -2.25, 0.\u003C/p\u003E\u003Cp\u003ESince its a fuel tank, you want it to align vertically, which means the \u0027vector\u0027 half of the node would be 0, 1, 0, like so:\u003C/p\u003E\u003Cp\u003Enode_stack_top = \u003Cspan style=\u0022color:#0000FF;\u0022\u003E0, 2.25, 0\u003C/span\u003E, \u003Cspan style=\u0022color:#FF0000;\u0022\u003E0, 1, 0\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Enode_stack_bottom = \u003Cspan style=\u0022color:#0000FF;\u0022\u003E0, -2.25, 0\u003C/span\u003E, \u003Cspan style=\u0022color:#FF0000;\u0022\u003E0, 1, 0\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EWith the blue part being the coordinate, and the red part being the vector.\u003C/p\u003E\u003Cp\u003ESo if you have a weird shaped object, the node might be in a random spot on all three axis, with a coordinate of 1.375, 2.375, 0.755 which would be difficult to \u0022eyeball\u0022 - but moving the object to that location is easy, and you can plug the coordinate right into a node.\u003C/p\u003E\u003Cp\u003EAlso note, you can round down if you get really long decimals in the coordinate, 3 or 4 digits is generally as specific as you can be.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-02-07T21:47:47Z","Content":"\n\u003Cp\u003EThanks Tiberion for your time, I was quite out of my shoes earlier \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E easier to understand when you are on the duty.\u003C/p\u003E\n"}]}