{"TopicId":64041,"ForumId":15,"TopicTitle":"Starting over in part modding. The adventure begins.","CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2014-02-23T08:36:10Z","PageNum":1,"Articles":[{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2014-02-23T08:36:10Z","Content":"\n\u003Cp\u003EWhen this game was fairly new, I used to use Blender to make my own personal parts because it was relatively easy at the time. I would really like to get back into doing that because there are things that I require. I am a bit anxious about it though because it seems there have been several changes to the way that the parts work. I believe now there is more to it than just exporting parts as .dae with mesh files in a mesh folder and providing a texture image. I am not really sure where to start with that.\u003C/p\u003E\u003Cp\u003EI think I need to get the .20 part tools and then upgrade that to the .23 part tools correct? It\u0027s a little confusing because before there where no steps required in unity before.\u003C/p\u003E\u003Cp\u003EAlso, I am sure several naming conventions have changed and animations have certainly changed. Before parent objects had to be named a certain way and the child brushes also had to be named according to convention.\u003C/p\u003E\u003Cp\u003EI am not sure if you still have to do that now or if that is now something that one would define in the unity based part tools. If It is still required, I would appreciate if some one could point me to a list of those or to a tutorial perhaps that shows what must be done.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T08:42:27Z\u0022 title=\u002202/23/2014 08:42  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by Payload\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2014-02-23T09:22:04Z","Content":"\n\u003Cp\u003EOk I am now DLing Unity 4.2.2. I have read this is the version that I require. I must then instal part tools .20 as a unity package and then overwrite files with .23 part tools correct?\u003C/p\u003E\u003Cp\u003EIf all of that goes well, then I will try to setup some of my old work in unity and get it in KSP .23.\u003C/p\u003E\u003Cp\u003EI expect that is where I will find my demons.\u003C/p\u003E\u003Cp\u003EWish me luck fellas. I was working on a special project way back when and I would like to complete it. Certainly now that the atmospheric craft are a robust part of the game now. Lets just say that way back when, they were a novelty.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-02-23T14:37:14Z","Content":"\n\u003Cp\u003ENow you are not required to export from Blender as a .dae file. Unity imports the .blend file fine. Of course you also import textures (I think it doesn\u0027t matter what format they start in, but I use .png). The model and texture files go into an asset folder for the project you are working on; so that\u0027s easy enough. When you export from Unity for use in KSP, the model is in .mu format. You may select a format for the texture; default for KSP is .mbm.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-02-23T16:25:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Payload\u0022 data-cite=\u0022Payload\u0022\u003E\u003Cdiv\u003EOk I am now DLing Unity 4.2.2. I have read this is the version that I require. I must then instal part tools .20 as a unity package and then overwrite files with .23 part tools correct?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnity 4.2.2 is definitely the version you want, 4.3 made some changes to the animations that KSP doesn\u0027t seem to like. I don\u0027t think you have to install .20 then overwrite it with .23 part tools. Just download the .23 tools and move them into your asset folder, but I might be wrong about that.\u003C/p\u003E\u003Cp\u003EI usually import files as .fbx format, but .blend works too, you just have to make sure you take into account the change in the y and z axes when going from Blender to Unity. Also, the naming conventions for collider meshes don\u0027t apply anymore, you can name the collider whatever you want, or just add it as a physics component in Unity.\u003C/p\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2014-02-23T16:34:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dispatcher\u0022 data-cite=\u0022Dispatcher\u0022\u003E\u003Cdiv\u003ENow you are not required to export from Blender as a .dae file. Unity imports the .blend file fine. Of course you also import textures (I think it doesn\u0027t matter what format they start in, but I use .png). The model and texture files go into an asset folder for the project you are working on; so that\u0027s easy enough. When you export from Unity for use in KSP, the model is in .mu format. You may select a format for the texture; default for KSP is .mbm.\u003Cp\u003EGood luck!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI saw a video about it but I haven\u0027t tried it yet. I am going over all my older files and working to get them moved over to the new formats. So far, I have a fuel tank and an RCS Tank that I made ages ago and I have managed to get them working properly.\u003C/p\u003E\u003Cp\u003EDoes the import of the blend files work properly as far as the whole Y-up and X-up problem goes? I had to flip back into blender and correct the orientation of a lot of my parts. I have also noticed that the textures are coming out a whole lot larger after the conversion. Maybe close to nine times larger. I\u0027m not sure I understand what benefit this is supposed to have if any at all. The PNG that I was using was much smaller in size. Is it mip mapping when you use .mbm but not when you use .png?\u003C/p\u003E\u003Cp\u003EAlso, I have not even attempted to get my old engines working. Something tells me that will be a nightmare if I cant find a tutorial of some kind. The old way you just named the parts of the model correctly and KSP did the rest, but I think that may not work anymore.\u003C/p\u003E\u003Cp\u003EThe fact that I don\u0027t have to make my own collision meshes anymore is quite nice. But that Y-up thing still ticks me off. Found my self fixing a lot of that.\u003C/p\u003E\n"},{"CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2014-02-23T18:31:33Z","Content":"\n\u003Cp\u003EMaking your own collision meshes can be much more efficient than turning your current mesh into one. As far as the Y-up thing, fix it in unity. Have an empty game object at the scene origin in unity that you use as an exporter. Rotate your object 90 degrees and drag it onto the exporter in the Hierarchy window to parent it.\u003C/p\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2014-02-23T18:49:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nazari1382\u0022 data-cite=\u0022Nazari1382\u0022\u003E\u003Cdiv\u003EMaking your own collision meshes can be much more efficient than turning your current mesh into one. As far as the Y-up thing, fix it in unity. Have an empty game object at the scene origin in unity that you use as an exporter. Rotate your object 90 degrees and drag it onto the exporter in the Hierarchy window to parent it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have no idea what that means unfortunately. I just started using unity today. I have seen several pictures of this process but I must be misunderstanding something because it still comes out sideways in KSP unless I rotate the mesh sideways in blender. No matter what I make a parent or a child the Y axis is still sideways.\u003C/p\u003E\n"},{"CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2014-02-23T19:23:17Z","Content":"\n\u003Cp\u003EYou can create an empty object with GameObject \u0026gt; create empty. Add PartTools to it by going to Add Component \u0026gt; ksp \u0026gt; PartTools in the Inspector window on the right. You can fix the orientation of your part when it\u0027s parented by rotating it to face up, which is Y\u002B on its parent object. You export the part to ksp by clicking Write on the empty exporter object\u0027s PartTools component.\u003C/p\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2014-02-23T21:05:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nazari1382\u0022 data-cite=\u0022Nazari1382\u0022\u003E\u003Cdiv\u003EYou can create an empty object with GameObject \u0026gt; create empty. Add PartTools to it by going to Add Component \u0026gt; ksp \u0026gt; PartTools in the Inspector window on the right. You can fix the orientation of your part when it\u0027s parented by rotating it to face up, which is Y\u002B on its parent object. You export the part to ksp by clicking Write on the empty exporter object\u0027s PartTools component.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoesn\u0027t work. Anytime I rotate anything it just rotates the Y-axis. It is still coming out of the side of my model.\u003C/p\u003E\u003Cp\u003EYou keep being unclear. WTF does parented mean? Is the empty transform the parent or the child of the model? Not that it matters because I have tried it both ways. In the end, the easiest solution is to just rotate it in blender. I have been doing that since the beginning anyway.\u003C/p\u003E\u003Cp\u003EAlso I am reading a lot of outdated information that keeps getting me in trouble. Several tutorials say to zero out all the transforms and that just ruins everything for me. Importing the blend file was just a hot mess.\u003C/p\u003E\u003Cp\u003EWell I got my SRBs working again once I got the thrustTransform thing squared away. Now I need to learn how to handle my old gimballed engines.\u003C/p\u003E\n"},{"CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2014-02-23T22:26:37Z","Content":"\n\u003Cp\u003EI was not unclear - when you drag your part onto the empty exporter object in the Hierarchy, it will be the child of that object. It\u0027s easy to see because the children of an object will be indented. You don\u0027t rotate the parent (the object with the PartTools component). You rotate the model so that the front faces the same direction as the parent\u0027s Y axis, which is up.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2014-02-24T02:31:04Z","Content":"\n\u003Cp\u003EI\u0027ve also had issues sometimes with the axis shift. When that happens, I\u0027ve rotated it in Blender. The issue was regarding texture edge orientation on a part.\u003C/p\u003E\u003Cp\u003EI have 4.3, but I\u0027ve not done animations, so lucky me.\u003C/p\u003E\n"}]}