{"TopicId":71114,"ForumId":15,"TopicTitle":"Part Making/Modding Tutorial?","CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2014-05-01T07:28:55Z","PageNum":1,"Articles":[{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2014-05-01T07:28:55Z","Content":"\n\u003Cp\u003ECan anyone direct me to a good tutorial or source of info for creating parts mods or editing existing parts? I would like to try my hand at making a few small parts just to see how they turn out, but I\u0027m not sure where to start. I have seen both blender and Sketchup (by one guy) used for modeling. I\u0027ve used Sketchup a bit but not blender but would like to learn. Thanks!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2014-05-01T08:20:40Z","Content":"\n\u003Cp\u003EThread moved to the Addon modeling forum, you will have a better answer since it is the actual forum to talk about modelling and making parts for the game.\u003C/p\u003E\u003Cp\u003EThere are several stickies on the forum you can have a look at.\u003C/p\u003E\u003Cp\u003EHave fun (I am more on the coding side of the add-on so I can\u0027t help much with modelling)\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-05-01T09:06:18Z","Content":"\n\u003Cp\u003EInaddition to that ^^:\u003C/p\u003E\u003Cp\u003EModelling techniques are the same for pretty much anything. There\u0027s not a lot of KSP specific things so if you\u0027re after modelling tutorials then you\u0027d be better off looking through youtube for beginner tutorials.\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2014-05-02T00:13:09Z","Content":"\n\u003Cp\u003EOkay, so I just made this today in Sketchup,\u003C/p\u003E\u003Cp\u003E\u003Ciframe width=\u0022640\u0022 height=\u0022480\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022\u0022\u003E\u003C/iframe\u003E\u003C/p\u003E\u003Cp\u003ESo I guess to be a little more specific is how to texture using photoshop, and how do I open the existing game parts so I can see how their textures are done. I feel like that is how I learn best, by reverse engineering something already made. Also, do I need to be worried about my polygons or whatnot? Is this too detailed? And while we\u0027re here, any thoughts on the part?\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-05-02T00:38:22Z","Content":"\n\u003Cp\u003ESeriously if you\u0027re still a beginner then you should be watching and reading beginner tutorials. It\u0027s a bit of a waste of time asking basic questions here. Once you get to a point where you\u0027ll have KSP-specific questions then people will be more eager to help.\u003C/p\u003E\u003Cp\u003EWith that in mind:\u003C/p\u003E\u003Cp\u003EThe polycount looks just right.\u003C/p\u003E\u003Cp\u003EYou can use the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43513\u0022 rel=\u0022external nofollow\u0022\u003EBlender Mu Importer\u003C/a\u003E to get Squad models into blender, just remember you\u0027re not allowed to redistribute those models afaik.\u003C/p\u003E\u003Cp\u003ETo open MBM textures, rename the suffix to \u0022raw\u0022 and open with an image viewer that supports raw images. You\u0027ll need to figure out the import settings (dimensions, depth, etc) by trial and error. You can\u0027t redistribute those either. Although I\u0027ve seen people adapt parts of them without any backlash from Squad.\u003C/p\u003E\u003Cp\u003EThe part looks ok, but you need to make some of the edges hard in some places. I wouldn\u0027t bother with Sketchup to be honest. Blender\u0027s the way to go.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-02T07:08:23Z\u0022 title=\u002205/02/2014 07:08  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 2, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-05-02T09:26:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003ETo open MBM textures, rename the suffix to \u0022raw\u0022 and open with an image viewer that supports raw images.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s also a mbm2png tool that converts MBM files to PNG files.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EThe part looks ok, but you need to make some of the edges hard in some places.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich edges would that be?\u003C/p\u003E\u003Cp\u003ERegarding the mesh, I\u0027d recommend making a slightly lower-poly version of it by removing that small ring on the top flat circle. Not remove it completely, but convert that into a normal map feature. It\u0027s just so small that it won\u0027t hurt if it\u0027s only done by normal mapping. Perhaps the complete inset of the top flat part should be done using a normal map.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-05-02T09:57:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EWhich edges would that be?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn each side of the base the faces form a concave arch. It looks bad with a smooth shader, so that arch should either have hard edges or he should add more geometry to get rid of smoothing artefacts.\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003EAll of these actually. Also that mesh is a bit messy. I\u0027d start over if I were you. In blender. AFAIK Blender gives you more control over your mesh.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dsxGmOu.png\u0022 alt=\u0022dsxGmOu.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-02T10:07:29Z\u0022 title=\u002205/02/2014 10:07  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 2, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2014-05-06T15:10:59Z","Content":"\n\u003Cp\u003EJust wanted to say thanks guys, the info here helped get me on the right track. I guess it is just hard to get started sometimes, there are so many tutorials on youtube I wanted to get some input so I would know what I needed to do. Here is what I have so far in blender, no completely happy with the base yet. I\u0027m wondering if I should attempt to make this a moving part or just make it static. What would you say is the difficulty rating on moving parts? Thanks again! (sketchfab screenshot seems to be incorrect, from a previously uploaded version with incorrect shading)\u003C/p\u003E\u003Cp\u003E\u003Ciframe width=\u0022640\u0022 height=\u0022480\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022\u0022\u003E\u003C/iframe\u003E\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-05-06T15:30:29Z","Content":"\n\u003Cp\u003EWith a look like this, it really HAS to be moving \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-05-06T16:13:04Z","Content":"\n\u003Cp\u003EThat\u0027s a big improvement. Next thing you should keep in mind is not to go overboard with detail especially detail that wont be visible, e.g. those bolts on the sides don\u0027t need to have so many faces.\u003C/p\u003E\u003Cp\u003EYou can try to make it animated but maybe you should take things slow for now.\u003C/p\u003E\n"}]}