{"TopicId":84404,"ForumId":15,"TopicTitle":"[Resolved] Blender Messing-up FBX Export","CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-09-12T00:39:44Z","PageNum":1,"Articles":[{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-09-12T00:39:44Z","Content":"\n\u003Cp\u003EIn Blender, my model appears like this. Note that the three gray bars are straight and parallel.\u003C/p\u003E\u003Cp\u003EThe three bars are parented to the flat panel, which will rotate. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qwdVyr3.jpg\u0022 alt=\u0022qwdVyr3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn Unity, the model appears like this. Note the three bars.:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1bCcoJK.jpg\u0022 alt=\u00221bCcoJK.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUpon importing the FBX file created by Blender into Blender, I see that the FBX file has the same problem:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7zSzl8Z.jpg\u0022 alt=\u00227zSzl8Z.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI added the purple material to clearly show the three bars,\u003C/p\u003E\u003Cp\u003EI don\u0027t know if it matters, but my node_collider does NOT cover this part of the model; is is to be an animated door . Upon opening, the player can then put objects inside of it. Then close the door.\u003C/p\u003E\u003Cp\u003EEDIT: Deleted link to BLEND file because IT WILL CRASH YOUR KSP. Crash due to open collider mesh (node_collider)\u003C/p\u003E\u003Cp\u003EHave any Blender users seen the problem? How did you solve it?\u003C/p\u003E\u003Cp\u003Ethanks\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-13T01:08:38Z\u0022 title=\u002209/13/2014 01:08  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 13, 2014\u003C/time\u003E by Apollo13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-09-12T00:53:36Z","Content":"\n\u003Cp\u003EHuh, I haven\u0027t run into that. But I don\u0027t export as FBX. \u003C/p\u003E\u003Cp\u003EI\u0027ve been using Collada/DAE mostly, which has worked well, except for a couple of instances where the models just didn\u0027t import (I\u0027d get the transforms but not the actual models). I\u0027ve also been using Unity 4.5, and just downgraded to 4.2.2 so I can do emissive animations. The first model I tried importing with DAE had the UV mapping all scrambled, so I switched to OBJ and it transferred to Unity just fine.\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-09-12T01:28:10Z","Content":"\n\u003Cp\u003EAs an experiment, I exported to DAE, then imported that DAE file back into Blender. The same problem occurred, but not as drastically. I did not attempt to import it into Unity.\u003C/p\u003E\n"},{"CreatedByName":"noonespecial","CreatedById":81942,"CreatedDateTime":"2014-09-12T09:32:59Z","Content":"\n\u003Cp\u003EHave you tried to just importing the .blend file directly into Unity?\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-09-12T13:09:05Z","Content":"\n\u003Cp\u003EStupid question, did you reset the transforms for position and scale once you had finished the model? especially if the parts were manipulated during creation. if you haven\u0027t reset it can lead to probs like this. sorry if you\u0027ve already checked, but you never know:P\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-09-12T18:48:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022noonespecial\u0022 data-cite=\u0022noonespecial\u0022\u003E\u003Cdiv\u003EHave you tried to just importing the .blend file directly into Unity?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot on this model. when I did that on previous models, I got a Windows dialog saying \u0022Blender has stopped working.\u0022\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpannerMonkey(smce)\u0022 data-cite=\u0022SpannerMonkey(smce)\u0022\u003E\u003Cdiv\u003EStupid question, did you reset the transforms for position and scale once you had finished the model? especially if the parts were manipulated during creation. if you haven\u0027t reset it can lead to probs like this. sorry if you\u0027ve already checked, but you never know:P\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot a stupid question at all. As an experiment, I \u0022un-parented\u0022 the gray bars from the panel. I manipulated the panel via the timeline, and the bars did not follow; thus, successful unparenting. I exported to FBX, and re-imported the FBX. The model was correct. I reloaded the BLEND file and parented them again to the panel, and the problem recurred.\u003C/p\u003E\u003Cp\u003EOTHER EXPERIMENTS:\u003C/p\u003E\u003Cp\u003EI tried grabbing and and moving the bar off the panel. When I exported and re-imported the FBX file, the bar was still off the panel, but crooked at the same angle as before.\u003C/p\u003E\u003Cp\u003EI duplicated a gray bar (SHFT-D) and placed it elsewhere. Upon exporting and importing, it, too, was crooked at the new location.\u003C/p\u003E\u003Cp\u003EExported and imported just the three bars without the panel. The bars were perfectly straight as they should be. Perhaps something to do with the panel? Somehow, parenting to the panel causes the bars to go crooked even though I unparented them and re-parented?\u003C/p\u003E\u003Cp\u003EI combined the panel and bars into a single object (Ctrl-J). The problem still happened after exporting and importing.\u003C/p\u003E\u003Cp\u003EI deleted the panel. I created a new panel and parented the bars to it. I FBX exported and imported the model. The crooked bars still occurred.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-12T21:37:30Z\u0022 title=\u002209/12/2014 09:37  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 12, 2014\u003C/time\u003E by Apollo13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2014-09-13T01:08:17Z","Content":"\n\u003Cp\u003EMy work-around.\u003C/p\u003E\u003Cp\u003EGrouped three bars as single object. Unparented the bars from the panel. Parented the panel to the bars. Animated the bars object versus animating the panel. Parented bars object to rest of model.\u003C/p\u003E\u003Cp\u003EThis should not have been necessary. Thank you, Blender, for wasting about more than a dozen hours of my life. Now, I can spend time tweaking the model.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-13T01:10:19Z\u0022 title=\u002209/13/2014 01:10  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 13, 2014\u003C/time\u003E by Apollo13\u003C/strong\u003E\n\u003C/span\u003E\n"}]}