{"TopicId":85964,"ForumId":15,"TopicTitle":"Blender Naming and Unity Animations","CreatedByName":"noonespecial","CreatedById":81942,"CreatedDateTime":"2014-10-03T10:18:16Z","PageNum":1,"Articles":[{"CreatedByName":"noonespecial","CreatedById":81942,"CreatedDateTime":"2014-10-03T10:18:16Z","Content":"\n\u003Cp\u003EIn Blender, object must have unique names. In this case suspensionParent, suspensionParent.001, suspensionParent.002, and suspensionParent.003. Why four suspensionParents? Because the lander I\u0027m working on has 4 legs.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/XXssR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ENow, my issues (which you\u0027ve probably already guessed), AFAIK you can only specify a single suspensionParent under KSP\u0027s ModuleLandingLeg. Unity does allow transforms with identical names. However, remaining the different suspensionParents breaks the animation. Even though I\u0027ve made the animation readable, I can find no way to edit the information within the Unity Animation Window. \u003C/p\u003E\u003Cp\u003EAnimating the lander solely within Unity, though possible, is not desirable because Unity does not respect the track constraints applied in Blender to keep the hydraulics lined up properly.\u003C/p\u003E\u003Cp\u003EAny ideas for a possible solution? \u003C/p\u003E\u003Cp\u003EFYI, the animation works perfectly in KSP with the exception of suspension (and the occasional falling through the floor, but I think I have that latter issue solved).\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-10-03T10:45:39Z","Content":"\n\u003Cp\u003EThe obvious workaround is to make the legs one separate part and give it stack nodes for accurate placement.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-03T10:48:12Z\u0022 title=\u002210/03/2014 10:48  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 3, 2014\u003C/time\u003E by Cpt. Kipard\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"noonespecial","CreatedById":81942,"CreatedDateTime":"2014-10-03T10:55:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EThe obvious workaround is to make the legs one separate part and give it stack nodes for accurate placement.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is an obvious workaround. But not what I\u0027m looking to do. For this particular part, I\u0027d rather go without the suspension than make it an additional part. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-10-03T12:00:22Z","Content":"\n\u003Cp\u003Eyou can\u0027t rename them in Unity. best you can do is use AnimateGeneric to run all 4 legs at the same time, you wont\u0027 get suspension and use of \u0022G\u0022 key. if you want to use ModuleLanderLeg, you have to split the lander leg into a part. \u003C/p\u003E\u003Cp\u003Ethe other option is redo the animation in Unity after you\u0027ve rearranged the hierarchy to include 4 identical suspension parents and wheelcolliders. don\u0027t know how ModuleLanderLeg will behave, I don\u0027t think it makes a list of suspension parents and wheel colliders.\u003C/p\u003E\u003Cp\u003Eyou can try hacking the animation clip by forcing it to text mode and editing the suspension parent names in the animation curves to be identical. The curves are referenced from the root transform with period separating each level in the heirarchy tree, that\u0027s why when you rename something or insert another object in the original hierarchy tree the animation no longer works. I\u0027ve never tried and can\u0027t say if it\u0027ll work or break anything in KSP.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-03T12:02:32Z\u0022 title=\u002210/03/2014 12:02  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 3, 2014\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"noonespecial","CreatedById":81942,"CreatedDateTime":"2014-10-03T12:11:56Z","Content":"\n\u003Cp\u003EI animated all four of them in Blender as a single animation, so ModuleLanderLeg doesn\u0027t have any issues. I guess I\u0027ll just have to go without the suspension. I\u0027ll see if I can get anywhere \u0022hacking\u0022 it, but we\u0027ll see.\u003C/p\u003E\n"}]}