{"TopicId":87287,"ForumId":15,"TopicTitle":"[SOLVED] Part with animation not loading","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-14T13:48:45Z","PageNum":1,"Articles":[{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-14T13:48:45Z","Content":"\n\u003Cp\u003EHi\u003C/p\u003E\u003Cp\u003EI\u0027ve got a part that I just can\u0027t get to load. It\u0027s absolutely fine when I strip the animation component off, but I get the following in output_log when adding it back on:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EFile error:\u003Cbr\u003E(null)\u003Cbr\u003E  at (wrapper managed-to-native) UnityEngine.AnimationClip:SetCurve (string,System.Type,string,UnityEngine.AnimationCurve)\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E  at A..ReadAnimation (System.IO.BinaryReader br, UnityEngine.GameObject o) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E  at A..ReadChild (System.IO.BinaryReader br, UnityEngine.Transform parent) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E  at A..ReadChild (System.IO.BinaryReader br, UnityEngine.Transform parent) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E  at A.. (.UrlFile ) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve stripped it right back, made a fresh scene, completely reconstructed the Unity rigging, made a fresh animation called something different, made sure the rig is set to legacy, unticked Play Automatically, checked there is nothing funny in the PartTools console log. Running out of ideas now. The part just won\u0027t load when any animation is applied. It\u0027s not even a clip I\u0027ve imported, I animated this one straight in Unity. All it does it rotate one GameObject 90 degrees! PartTools appears to spits the .mu out fine, along with textures.\u003C/p\u003E\u003Cp\u003EIt used to work fine, then I changed the animation slightly and this started happening, then I ran through all the steps above trying to figure out what the hell went wrong. Several hours screaming, ranting and raving at KSP have left me none the wiser!\u003C/p\u003E\u003Cp\u003ECheers, really stumped on this one.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-14T18:19:29Z\u0022 title=\u002210/14/2014 06:19  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 14, 2014\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-14T14:07:03Z","Content":"\n\u003Cp\u003EHi, had issues like this a couple of times usually during a mass burning of midnight oil, in my case it was simply caused by me accidentally selecting the individual part to be animated from the hierarchy rather than the root object. It sort of happens like this: \u003C/p\u003E\u003Cp\u003Eclick on model, select animation window, create new animation, select transforms or whatever to be animated, create curves , then because i couldn\u0027t get a decent view on the animating part i rotated the scene so I could, and this is where it went bad, instead of the root object i just selected the animating object, Nothing changed to tell me it was off in the animation window, and it all worked and looked fine in Unity, but very bad things happened once loaded in game, like engines and effects running in vab or worse an insta crash, producing the same error as you have highlighted. As you\u0027ve remade it once i doubt this is the case , but you never know.\u003C/p\u003E\n"},{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2014-10-14T14:09:39Z","Content":"\n\u003Cp\u003EAlso make sure your Unity version is 4.2.2 or earlier if you\u0027re animating anything on the materials.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-14T16:27:04Z","Content":"\n\u003Cp\u003EYeah, running 422. I wonder if it\u0027s something to do with the prefab... Thanks guys\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-10-14T16:48:11Z","Content":"\n\u003Cp\u003Edid you accidentally key frame a collider?\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-14T17:20:10Z","Content":"\n\u003Cp\u003EI don\u0027t think so. What happens if you do, that\u0027s a new one on me?\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-10-14T18:12:56Z","Content":"\n\u003Cp\u003Eyou get an error like you had in the OP. I usually run into it if I accidentally key framed a collider or some other channels that shouldn\u0027t have curves, but I can\u0027t remember specific ones other than a collider. Could be Active/Inactive tick box on a component or a GameObject. alot of things can get key framed in Unity and it\u0027s easy to accidentally key something that KSP can\u0027t read.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-14T18:16:30Z\u0022 title=\u002210/14/2014 06:16  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 14, 2014\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-14T18:17:14Z","Content":"\n\u003Cp\u003EFixed. Thanks guys, gave me a push to look at a few more things.\u003C/p\u003E\u003Cp\u003EThe problem was to do with the exported .DAE having animation, which I ignored and wrote again in Unity. Previously, I\u0027d broken the prefab, so this had not been a problem. In the new version where I didn\u0027t break the prefab by renaming an object (because I\u0027d named it correctly before export), it clearly causes a problem with the Part Tools export. A nice little Gotcha! Interestingly, adding my new animation to the fresh root game object I put the dae inside did not help, I\u0027d imagine something to do with it still hanging around in the prefab.\u003C/p\u003E\u003Cp\u003EEdit: Thanks nli2work, that\u0027s useful info I\u0027ll try to remember!\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-10-14T19:43:50Z","Content":"\n\u003Cp\u003EAh it\u0027s during export. I thought this was during KSP load time. \u003C/p\u003E\u003Cp\u003Eso basically the problem was that the prefab was pointing to an incorrect animation clip?\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-14T20:01:59Z","Content":"\n\u003Cp\u003ENo, it\u0027s during KSP load time that message comes up. Whether it\u0027s part tools or KSP that\u0027s actually causing the issue we may never know!\u003C/p\u003E\u003Cp\u003EYeah, basically. Or a clip that didn\u0027t actually get properly clipped.\u003C/p\u003E\u003Cp\u003EEDIT: To be clear, the model had an animation exported, which I did not use. I left it un-rigged and added anothe animation which I created directly in Unity. This is what caused the problem. I did this because you animation that are part of a prefab (.DAE or FBX) are read-only and I wanted to animate some of the objects I added in in Unity. The solution was fairly simple: Rig as normal, open the prefab in Unity and find the animation. highlight it and hit CTRL\u002BD, which will clone the animation. change the animator component to point to the copied animation (not the one stored in the prefab), and it will then be editable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-01T23:49:56Z\u0022 title=\u002212/01/2014 11:49  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 1, 2014\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"}]}