{"TopicId":92069,"ForumId":15,"TopicTitle":"Animation FPS drops","CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-06T06:30:09Z","PageNum":1,"Articles":[{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-06T06:30:09Z","Content":"\n\u003Cp\u003EI am wondering if anyone can help me with an animation problem I am having. I have seen this same issue on other part mods and it frequently happens to my animated parts. When placing the part it will cause large FPS drops until I deploy then undeploy the animation. This happens in the VAB and once loaded into the game. There are no errors or warnings in the log and no spam.\u003C/p\u003E\u003Cp\u003EIs this something that happens because of overlapped colliders, moving colliders, non-linear animations? It happens on parts with a high polygon count, large numbers of moving parts and colliders, but it also happens to single parts with a single moving animation. I can\u0027t find any reason for it.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-06T15:24:02Z","Content":"\n\u003Cp\u003Ehigh number of mesh colliders can eat up frame rates, high number like in the 20\u002B; also check to see if there are properties that have key frames where they shouldn\u0027t... things like collider size; component on/off. Most of those will give you an error during export or KSP load time and you won\u0027t see the part in game, but maybe some of them slips through.\u003C/p\u003E\n"},{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-06T22:01:51Z","Content":"\n\u003Cp\u003ESo I can\u0027t resize a collider by having it as the child to a part that changes or I just can\u0027t resize it directly using keyframes? I have many parts with colliders set as their child that change size. One of my solar panels has 31 simple \u0022cube\u0022 mesh colliders and it causes no lag at all. I then have a part with a single moving antenna with 2 colliders total that causes massive fps drops.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-06T22:08:56Z","Content":"\n\u003Cp\u003EI think parent objects of colliders can animate, and if a child object happens to have collider, it\u0027s not a probelm. but collider themselves should not have any key frames, like if you keyframed the radius on a capsule collider... or convex tick box on a mesh collider, that will usually give you errors either during export or during game load.\u003C/p\u003E\u003Cp\u003Eit\u0027s hard to know why animations run super slow. a lot of times I end up redoing them and they work afterwards. are there any messages in Unity console when you scrub the animation on the part that\u0027s slow in KSP? I had a really weird error message related to an imported animation in Unity recently, but was never able to reproduce it. would have been useful for future references.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-06T22:52:09Z\u0022 title=\u002212/06/2014 10:52  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 6, 2014\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-12-06T22:31:46Z","Content":"\n\u003Cp\u003EI think this is a phenomenon known as \u0022animation lag\u0022. It has something to do with keyframes, though I don\u0027t remember the details. Yogui\u0027s models had great issues with it in the past.\u003C/p\u003E\n"},{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-06T23:26:08Z","Content":"\n\u003Cp\u003EThe thing is it will randomly happen on a part with one moving part with only 2 key frames, one at the beginning and one at the end of the animation. I will need to check unity for any weird errors when importing.\u003C/p\u003E\n"},{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-07T02:44:12Z","Content":"\n\u003Cp\u003EI think I figured out the issue. If I separate the animated parts, like the antennae, from the rest of the ship and make them their own model/part the lag disappears. I am currently in the process of converting all of my parts by making the antennae and dishes separate parts.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-12-07T03:44:44Z","Content":"\n\u003Cp\u003Ehm, interesting. Is the animation component on the root transform of the entire part, or on the transform that is animated? if you have bits that use different animation clips, might help if the bits have their own animation component with it\u0027s own clip, instead of single animation component on the root transform with multiple clips. You can still call all the different clips as normal. Added bonus of being able to shift the animated transform around the heirarchy without breaking its animation clip.\u003C/p\u003E\n"},{"CreatedByName":"raidernick","CreatedById":97711,"CreatedDateTime":"2014-12-07T10:18:07Z","Content":"\n\u003Cp\u003EAs much as I hate to do this I am dropping the stock animation module. I don\u0027t want dependencies but I don\u0027t have a choice here. I switched back to the firespitter animator and the craft no longer lag at all.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-07T14:04:10Z\u0022 title=\u002212/07/2014 02:04  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 7, 2014\u003C/time\u003E by raidernick\u003C/strong\u003E\n\u003C/span\u003E\n"}]}