{"TopicId":96266,"ForumId":15,"TopicTitle":"[Question] IVA rotating/translating seats?","CreatedByName":"mech_engr","CreatedById":117187,"CreatedDateTime":"2015-01-10T20:45:07Z","PageNum":1,"Articles":[{"CreatedByName":"mech_engr","CreatedById":117187,"CreatedDateTime":"2015-01-10T20:45:07Z","Content":"\n\u003Cp\u003EHas anyone tried to implement a rotating or translating seat in IVA? I\u0027m developing a part mod that uses a command pod for both atmospheric flight and vertical launch / landing and I think it would be awesome to have two IVA views (with controls) that can swivel the pilot\u0027s chair down 90 degrees so that landing a lander vertically would be much easier in IVA with windows. Is it possible to animate an IVA seat gameobject and bind it\u0027s state with say, an RPM switch? Or are these gameobjects static? Thank you!\u003C/p\u003E\n"},{"CreatedByName":"artwhaley","CreatedById":118388,"CreatedDateTime":"2015-01-11T02:37:00Z","Content":"\n\u003Cp\u003EI haven\u0027t tried... but most things that depend on transforms seem to work when animated. I don\u0027t recall any stock modules for playing an animation inside an iva... if one exists that\u0027s your best bet. Something like RPM\u0027s variable animator can make a prop that moves... but I don\u0027t see how you\u0027d embed a working kerbal transform into a prop.\u003C/p\u003E\u003Cp\u003EThe easy answer is to \u0027sorta fake it\u0027 with InternalCameraSwitch. It won\u0027t move the seat or the kerbal, but you COULD click a \u0027landing view\u0027 button in the cockpit that was actually the collider for the InternalCameraSwitch, and moved your view down to a lower window. Not perfect, but it would be something.\u003C/p\u003E\u003Cp\u003EI keep hoping for a mod that lets kerbals switch seats in IVA for my mods. One of my cockpits has very different controls at different seats - there are two \u0027pilots\u0027 seats, and then a docking station and an engineering station with different controls. When the pod isn\u0027t full, it would be nice if the pilot could move to the docking module and operate those controls. If this mod ever gets made, you could change \u0027seats\u0027 without actually moving the chair itself, if you cleverly designed it so that both possible camera positions couldn\u0027t see any bits of the other positions chair.\u003C/p\u003E\u003Cp\u003EI hope someone smarter comes along with a simpler answer... but that\u0027s what I can come up with right now!\u003C/p\u003E\n"},{"CreatedByName":"mech_engr","CreatedById":117187,"CreatedDateTime":"2015-01-12T00:38:01Z","Content":"\n\u003Cp\u003EGenius! Thanks Art! I might actually consider writing a mod to swap seats. Doesn\u0027t seem too difficult at all. Maybe after that I could write something for modifying seat transforms...\u003C/p\u003E\n"}]}