{"TopicId":100233,"ForumId":20,"TopicTitle":"development cost and long time exploitation money saves using sub assembly","CreatedByName":"winn75","CreatedById":52183,"CreatedDateTime":"2015-02-20T19:59:49Z","PageNum":1,"Articles":[{"CreatedByName":"winn75","CreatedById":52183,"CreatedDateTime":"2015-02-20T19:59:49Z","Content":"I don\u0027t know if it as been discussed yet but designing and testing rockets doesn\u0027t cost anything (unless you play hard mode without quick load).\n\nPretty hard to simulate trials and development cost when you can rewind game before a failed attempt and get refund. \n\nThe idea is to make proven design cheaper than new ones.\n\nHow?\n\nUsing the sub-Assembly ! \n\nAdding a new sub assembly could cost money (let\u0027s say = 100% the cost of all sub assembled parts). That simulates rocket development cost.\n\nUsing an existing sub assembly could give a discount (let\u0027s say = -30% or -40% on cost of the Sub-Assembly). That simulates money saving based on long time exploitation.\n\nIt will encourage player to reuse their proven design instead of creating a new one for each mission as development cost would be refund in 3-4 launches. \n\nIst a kind of a bet on the reuseability of your old design, and that gameplay feature would fully rely on choice (choice is always a good gameplay feature ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)) and not on time.\n\nOf course as it is usign sub assembly, it\u0027s optionnal and you can always send rockets without it.\n\nWhat do you think?"},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-02-20T22:30:40Z","Content":"That\u0027s a great idea. It makes the game a little more realistic (I\u0027m pretty sure most of the cost of a rocket launch is amortizing developement expenditure), and also encourages different styles of play than \u0022reusable air hogging RAPIER spaceplane\u0022."},{"CreatedByName":"C1maCat","CreatedById":121247,"CreatedDateTime":"2015-02-21T05:24:27Z","Content":"You should check out [Kerbal Construction Time](https://forum.kerbalspaceprogram.com/threads/92377-0-90-Kerbal-Construction-Time-1-1-2-%2812-27-14%29-Unrapid-Planned-Assembly). It doesnt do what you\u0027re looking for but adds some more realism to simulations and dev. I also think this would be a great mod though."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-02-21T05:37:38Z","Content":"That\u0027s a nice, simple solution for stock (though I now play with KCT)."},{"CreatedByName":"winn75","CreatedById":52183,"CreatedDateTime":"2015-02-22T20:03:25Z","Content":"Yes i tried it and it\u0027s pretty cool!\n\nEnven better when you play with a life support mod and time has a real impact ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"mic_e","CreatedById":60757,"CreatedDateTime":"2015-03-12T19:13:02Z","Content":"\u002B1; there should be a mod for this."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-03-12T20:35:52Z","Content":"\u003E \n\u003E You should check out [Kerbal Construction Time](https://forum.kerbalspaceprogram.com/threads/92377-0-90-Kerbal-Construction-Time-1-1-2-%2812-27-14%29-Unrapid-Planned-Assembly). It doesnt do what you\u0027re looking for but adds some more realism to simulations and dev. I also think this would be a great mod though.\n\nI\u0027d have to second the call for this mod. If you recover a ship, you\u0027ll get whatever parts are on it put into storage, which can be fitted to the next ship cheaper and faster.\n\nIt also legitimises \u0022simulations\u0022 by virtue of actually having a simulator, which costs money to use, but can place you around any planet for a limited amount of time. Not always easy to decide on the Nth sim of a craft, or just build the darn thing and hope it doesn\u0027t explode though ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2015-03-12T22:28:25Z","Content":"Or you could just disable the \u0022revert to\u0022 features when starting a new game... An Time"},{"CreatedByName":"C1maCat","CreatedById":121247,"CreatedDateTime":"2015-03-18T03:35:25Z","Content":"Still want this"}]}