{"TopicId":102637,"ForumId":20,"TopicTitle":"How to install mods and mod compability","CreatedByName":"GuyFromTheSky","CreatedById":139958,"CreatedDateTime":"2015-03-24T21:58:29Z","PageNum":1,"Articles":[{"CreatedByName":"GuyFromTheSky","CreatedById":139958,"CreatedDateTime":"2015-03-24T21:58:29Z","Content":"I recently reinstalled Kerbal Space Program to try out the new career mode. I wanted to install a few mods to go with it but when i tried to play the game there seemed to be a ton of bugs and the game was unplayable. I probably messed something up when installing because i have no idea what i\u0027m doing.\n\nHow do i install mods?\n\nThe mods i was trying to install were:\n\nB9 Aerospace Pack\n\nChatterer\n\nDeadly Reentry\n\nEngineer Redux\n\nEnhanced Nav Ball\n\nKW Rocketry\n\nMechJeb\n\nSCAN sat\n\nTAC Life Support\n\nToolbar\n\nI understood that some mods need the \u0022Module Manager\u0022 so i tried installing that also, but it\u0027s just a .dll-file... \n\nAre these mods compatible with each other (and the career mode)? Is there any particular install order i should use? Is there any way to install several mods in one go in an easy fashion or do i have to unpack every mod into each directory manually? I am really confused by all this and most of the mods doesn\u0027t even come with a readme... If someone could point me in the right direction i\u0027d really appreciate it."},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-03-24T23:30:40Z","Content":"Yes, all of those mods should work together. There\u0027s no install order.\n\nHow to install addons manually: [http://wiki.kerbalspaceprogram.com/wiki/Addon#Installing_addons](http://wiki.kerbalspaceprogram.com/wiki/Addon#Installing_addons)\n\nIf you want an automatic mod manager, there\u0027s [CKAN](https://forum.kerbalspaceprogram.com/threads/100067)"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-03-25T00:18:08Z","Content":"Looking at your list, you have two pretty large parts packs: B9 and KW....I would only install one and try playing, then try installing the other after ALL the other mods seem to be working...\n\nAll of those mods are pretty popular, and have been around and supported for quite some time, so any incompatabilities have most likely already been found and solved...just make sure to read thru the release thread for each one...I\u0027m pretty sure any incompatibilities that havent been able to be fixed, are most likely listed there. Also, any required dependencies should be listed in each respective release thread.\n\nI\u0027ve used all those mods together, (except Chatterer \u0026 Deadly Reentry), with many others at the same time as well, thru 0.23, 0.24, 0.25, \u0026 0.90, with no specific incompatibility issues...So my first guess is you might be pushinf your system with both those large parts packs, or else maybe something innt installed quite right...\n\n**Edited \u003Ctime datetime=\u00222015-03-25T00:21:06Z\u0022 title=\u002203/25/2015 12:21  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 25, 2015\u003C/time\u003E by Stone Blue**"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-03-25T00:52:20Z","Content":"from where have you installed KSP from? I installed mine off of Steam!"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-03-25T08:20:11Z","Content":"\u003E \n\u003E the game was unplayable.\n\u003E B9 Aerospace Pack\n\nYou know that you need Active Texture Management as well to avoid memory problems?"},{"CreatedByName":"GuyFromTheSky","CreatedById":139958,"CreatedDateTime":"2015-03-25T09:36:59Z","Content":"\u003E \n\u003E If you want an automatic mod manager, there\u0027s [CKAN](https://forum.kerbalspaceprogram.com/threads/100067)\n\nThis is just what i was looking for, thank you!\n\n\u003E \n\u003E So my first guess is you might be pushinf your system with both those large parts packs, or else maybe something innt installed quite right...\n\nDon\u0027t think so. My computer is brand new with very good specs. I probably installed something wrong...\n\n\u003E \n\u003E from where have you installed KSP from? I installed mine off of Steam!\n\nSteam as well.\n\n\u003E \n\u003E You know that you need Active Texture Management as well to avoid memory problems?\n\nI did not know that. What does it do? There are several versions in CKAN, how do i know which one to install?"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-03-25T11:50:15Z","Content":"\u003E \n\u003E I did not know that. What does it do? There are several versions in CKAN, how do i know which one to install?\n\nIf you\u0027re using the 32bit version you should use the basic (not aggressive) x86 version. If your install still uses too much memory you could try the aggressive version instead but that one looks definitely worse."},{"CreatedByName":"GuyFromTheSky","CreatedById":139958,"CreatedDateTime":"2015-03-25T19:44:14Z","Content":"\u003E \n\u003E If you\u0027re using the 32bit version you should use the basic (not aggressive) x86 version. If your install still uses too much memory you could try the aggressive version instead but that one looks definitely worse.\n\nHow do i know if i use the 32 or the 64 bit version? My OS is 64 bit and i installed the game trough steam."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-03-26T01:49:17Z","Content":"Unless you specifically told Steam to launch the Win x64 version (*and you should not*, because it\u0027s an unstable mess for most people, and unplayable in career for all people), you will be running the 32bit (x86) version. When running the 32bit version, you are limited to ~3.5GB of ram usage by the process, and Unity\u0027s D3D9 client has a bug where it keeps textures shadowed in memory even if told not to, so even if you have 64GB of ram, you\u0027ll still crash to desktop if you add too many part packs without taking other steps."},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-03-26T03:56:24Z","Content":"\u003E \n\u003E When running the 32bit version, you are limited to ~3.5GB of ram usage by the process, and Unity\u0027s D3D9 client has a bug where it keeps textures shadowed in memory even if told not to, so even if you have 64GB of ram, you\u0027ll still crash to desktop if you add too many part packs without taking other steps.\n\n^^This ^^\n\n...I should have qualified my statement to reflect that....I just assume every one knows about the current 4GB RAM limit...lol\n\nThe quickest way to tell if maxing out RAM is what is causing KSP to crash, is to open Task Manager before a crash, and leave it open while playing....If KSP, crashes, go to the Performance tab, and look at the graph...See what it peaked at during the crash...if high 3GB\u0027s to low 4GB\u0027s, it likely hit the RAM limit...\n\nI\u0027m pretty sure you can also open the KSP log, and near the top of the file, it lists current % RAM usage at the time of the crash... Mine usually always says 75% or 76%.... (I am unclear whether that is the percentage of your total installed RAM, or if that is the percentage of the 4GB limit that KSP itself hits...) For me, this is because I only have 6GB total RAM installed...My system crashes with KSP running at/about 3.8-4.1GB (System\u002BKSP\u002Ball other processes)...Which is about 75% of my total installed RAM: (4GB of 6GB installed)...\n\nBut then it could be KSP\u0027s RAM usage alone, of the 4GB limit, since KSP only shows 2.8-3.2GB RAM usage of the 4GB limit..."}]}