{"TopicId":102853,"ForumId":20,"TopicTitle":"Docking port reinforcement mod","CreatedByName":"Sacnoth","CreatedById":123191,"CreatedDateTime":"2015-03-28T14:31:00Z","PageNum":1,"Articles":[{"CreatedByName":"Sacnoth","CreatedById":123191,"CreatedDateTime":"2015-03-28T14:31:00Z","Content":"Hello everyone,\n\nI\u0027ve been playing ksp for a while now, and of the problems I encounter (and many others do too I imagine) is docking port wobble.\n\nWhen you turn a larger ship made of bigger parts docked together, the docking ports are weak point and you risk your ship breaking apart.\n\nI was wondering if there is a mod (or one could be made) that allows for strengthening the docking port connection. Preferably with a button on the docking port. The strengthening could possibly be explained by docking clamps that grip into each other and thus lock the docking port together after the magnetic connection is made. \n\nHis would a allow you to dock your ships and then toggle the lock on and off.\n\nDoes something like this exist? Could it be useful?"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-03-28T15:04:51Z","Content":"You might try TweakableEverything [http://forum.kerbalspaceprogram.com/threads/64711-0-90-TweakableEverything-1-8-For-all-your-part-tweaking-needs](https://forum.kerbalspaceprogram.com/threads/64711-0-90-TweakableEverything-1-8-For-all-your-part-tweaking-needs)"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-03-28T18:30:32Z","Content":"not sure if this works on docking ports or not:\n\n[http://forum.kerbalspaceprogram.com/threads/55657-0-22-Kerbal-Joint-Reinforcement-v1-0-Properly-Rigid-Part-Connections](https://forum.kerbalspaceprogram.com/threads/55657-0-22-Kerbal-Joint-Reinforcement-v1-0-Properly-Rigid-Part-Connections)\n\nAnd I\u0027ve used Quantum Struts for quite awhile to address docking connections:\n\n[http://forum.kerbalspaceprogram.com/threads/93818-0-24-2-QuantumStrutsContinued-1-1-Magical-Struts-for-Rigidifying-Outside-the-VAB](https://forum.kerbalspaceprogram.com/threads/93818-0-24-2-QuantumStrutsContinued-1-1-Magical-Struts-for-Rigidifying-Outside-the-VAB)"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-03-29T03:34:15Z","Content":"Kerbal Joint Reinforcement should also help towards this: [http://forum.kerbalspaceprogram.com/threads/55657-0-90-Kerbal-Joint-Reinforcement-v3-1-2-3-26-15](https://forum.kerbalspaceprogram.com/threads/55657-0-90-Kerbal-Joint-Reinforcement-v3-1-2-3-26-15)"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-03-30T07:16:15Z","Content":"Unfortunately there is no such thing as a \u0022grip strength\u0022 factor that you can just tell the game to increase. If there was, Squad would have done it long ago - wobbly docking ports have been an issue for as long as docking ports have been in the game. No, docking port strength is directly related to the *masses* of the docking ports connected to each other.\n\nSo you could improve the docking port strength by writing a MM config that makes them heavier. Alternatively, the Construction pack from the Near Future Suite and Stockalike Station Parts Expansion ship some extra-heavy docking collars that are much stronger than anything offered in stock."},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-03-30T12:14:48Z","Content":"\u003E \n\u003E Unfortunately there is no such thing as a \u0022grip strength\u0022 factor that you can just tell the game to increase. If there was, Squad would have done it long ago\n\nHow do you think KJR works ? Docking port are joint and joint have configurable strength. The same joint are used to connect part. AFAIK docking port are hard to change because the stock code does not allow much."},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-03-30T13:58:55Z","Content":"Doesn\u0027t KJR use a totally different method to calculate strength, by factoring in additional joints beyond the immediate pair being calculated? Or something to that effect...\n\nAs far as I recall it uses some sort of of workaround precisely because it can\u0027t be done without it.\n\nAdmittedly, mods change over time, and I certainly don\u0027t claim to keep caught up with all of them..."},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2015-03-30T16:49:48Z","Content":"KJR works just by adding MOAR struts...Invisible, and dont add to part count... ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif) lol"}]}