{"TopicId":109293,"ForumId":20,"TopicTitle":"Removal of the fairing \u0022Cannot activate part while stowed\u0022 thing","CreatedByName":"The Lone Wolfling","CreatedById":13675,"CreatedDateTime":"2015-05-15T00:52:54Z","PageNum":1,"Articles":[{"CreatedByName":"The Lone Wolfling","CreatedById":13675,"CreatedDateTime":"2015-05-15T00:52:54Z","Content":"I\u0027m looking for a way to remove the fairing\u0027s whole \u0022Cannot activate part while stowed\u0022 thing. I don\u0027t like it, especially as it makes no sense to me for (for example) an engine to not be able to burn out of an open end of a fairing, or an accelerometer not work. That sort of thing is already handled elsewhere and better.\n\nI looked through the config files, but it turns out it\u0027s not done there, so plugin time, yay. But wait, there\u0027s more! Turns out, it\u0027s not even done in ModuleCargoBay, it\u0027s actually checked by the parts themselves. So... I cannot think of a better way of doing this than adding a module that replaces the right-click / action group actions with its own copies that unshields the part, calls the proxied method, then reshields it. If that\u0027s even possible itself.\n\nSo, sanity check. Is this the best hack to do this? Or is there a better one?"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-06-12T14:40:11Z","Content":"It\u0027s sad this thread was buried down there, it\u0027s a request I endorse a lot. Personally, I\u0027m using FAR, so for all I care fairings can be strictly structural, with only decouple functionality.\n\nBump attempt?"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-06-17T12:52:54Z","Content":"Agreed. There\u0027s no good reason for having this limitation."},{"CreatedByName":"MrMeeb","CreatedById":84238,"CreatedDateTime":"2015-06-17T14:11:01Z","Content":"\\*bumps\\* :3 I think this will be very helpful"},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-06-18T15:05:40Z","Content":"Bumpidy, all of my reentry probeshells suffer from this. I either cant deorbit, or deorbit and burn up. I think engines should be able to burn inside the fairings too, for user experience their engines should blow up with their fairings.\n\nNo need for this limitation, no sane user would activate an engine inside a fairing."},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2015-06-20T07:00:25Z","Content":"Yes I too think it is an annoying function"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-20T09:08:11Z","Content":"Think about it like this: Even if the engine could activate, all it would do is burn fuel and heat things up. It wouldn\u0027t change velocity, because the very propellants you\u0027re expelling (to push you one way) will bounce off the fairing and push the vessel in the opposite way.\n\nIt\u0027s like blowing on a sail. It don\u0027t work."},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-06-20T10:08:16Z","Content":"Except when you\u0027re building something that is transforming chemical energy into kinetic energy like an internal combustion engine or a gas turbine. Even if practical use is limited or none, the topic\u0027s subject is blocking creativity and/or educational purposes.\n\nExample of what is possible in 0.90 but not in 1.0x:\n\n[https://www.reddit.com/r/KerbalSpaceProgram/comments/31alv9/model_of_a_turbofan_engine_stock_huge_heavy_and/](https://www.reddit.com/r/KerbalSpaceProgram/comments/31alv9/model_of_a_turbofan_engine_stock_huge_heavy_and/)"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-06-20T11:01:05Z","Content":"uh, what ? This contraption does not use a cargo bay so it would work fine."},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-06-20T11:10:18Z","Content":"Unless you use FAR. But it\u0027s besides the point, why impose such a limitation if it means you can\u0027t experiment with certain concepts, while it doesn\u0027t clash with the rules of physics?\n\nMaybe all someone would want is heat something, for whatever reason.\n\nHere\u0027s another example. Building a turboshaft engine inside a fairing. Should dramatically improve performance compared to 0.90.\n\n[https://www.reddit.com/r/KerbalSpaceProgram/comments/3497yg/cannot_activate_while_stowed_my_most_anticipated/](https://www.reddit.com/r/KerbalSpaceProgram/comments/3497yg/cannot_activate_while_stowed_my_most_anticipated/)\n\n**Edited \u003Ctime datetime=\u00222015-06-20T11:16:10Z\u0022 title=\u002206/20/2015 11:16  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 20, 2015\u003C/time\u003E by Azimech**"},{"CreatedByName":"brusura","CreatedById":57899,"CreatedDateTime":"2015-06-20T11:28:37Z","Content":"Hey I want to deploy my antenna before I open the cargo bay...why should I not be able to do that? Because this way you can abuse a game mechanic, the antenna should not work while inside the cargo bay ( because radiowave are somehow shielded ) but I should be able to deploy it\n\nThe problem is that those functions ( deploy and antenna on ) are overlapped , this is just an example ( also solar panels come to my mind ) , this is one of those cases... feature/bug/game mechanic\n\n**Edited \u003Ctime datetime=\u00222015-06-20T11:30:52Z\u0022 title=\u002206/20/2015 11:30  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 20, 2015\u003C/time\u003E by brusura**"},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-06-20T13:26:03Z","Content":"The problem is if you pull something out of a fairing (think soyuz abort or Apollo) it\u0027s broken."},{"CreatedByName":"Requia","CreatedById":112924,"CreatedDateTime":"2015-06-20T19:58:50Z","Content":"\u003E \n\u003E Hey I want to deploy my antenna before I open the cargo bay...why should I not be able to do that? Because this way you can abuse a game mechanic, the antenna should not work while inside the cargo bay ( because radiowave are somehow shielded ) but I should be able to deploy it\n\u003E The problem is that those functions ( deploy and antenna on ) are overlapped , this is just an example ( also solar panels come to my mind ) , this is one of those cases... feature/bug/game mechanic\n\nI\u0027m in favor of this somehow being overhauled (if only because it both doesn\u0027t seem useful and is bugged as is) but in that particular case why not just deploy the antenna in the VAB? If it\u0027s inside the cargo bay it shouldn\u0027t break from aero."},{"CreatedByName":"Rocketfeline","CreatedById":137938,"CreatedDateTime":"2015-06-20T21:35:28Z","Content":"My problem is that when im making a areoshelled probe. And I try to drop out of it.I I cannot activate the engine because it thinks im stowed. When in reality im outside the areoshell. Thats one issue I dont like.Im ok with not deploying things like antenna. But thats one thing I don\u0027t like."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-21T02:19:20Z","Content":"If you have decoupled/jettisoned the aeroshell and the engine still thinks it\u0027s shielded, that\u0027s a bug, and you should report it."},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-06-21T19:46:50Z","Content":"\u003E \n\u003E If you have decoupled/jettisoned the aeroshell and the engine still thinks it\u0027s shielded, that\u0027s a bug, and you should report it.\n\nHe said he dropped out of it like Curiosity\u0027s aeroshell. So he wouldn\u0027t have jettisoned the areoshell."},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-06-23T14:59:33Z","Content":"It\u0027s still in in 1.0.3, and thus: Request repeated."},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-06-23T15:16:27Z","Content":"\u003E \n\u003E It\u0027s still in in 1.0.3, and thus: Request repeated.\n\nI think Squad did a kind of bodge job to stop it happening. When you stage a separator in a faring it automatically separates the fairing. \n\nOn a brighter note, the SRBs are awesome now!"},{"CreatedByName":"Jon144","CreatedById":80626,"CreatedDateTime":"2015-06-23T16:40:14Z","Content":"Once when making my B-52 replica I put SRBs mounted on decouplers on the wings to replicate missiles. I never put any sort of fairings on the aircraft yet when I launched the \u0022Missiles\u0022 I was given the notice \u0022Cannot activate part while stowed\u0022 so the SRB did not fire as intended. I found this very odd. I never even stowed it.\n\n\u003E \n\u003E Think about it like this: Even if the engine could activate, all it would do is burn fuel and heat things up. It wouldn\u0027t change velocity, because the very propellants you\u0027re expelling (to push you one way) will bounce off the fairing and push the vessel in the opposite way.\n\u003E It\u0027s like blowing on a sail. It don\u0027t work.\n\nAlso as I proved in a different post engine exhaust is not going to heat anything.\n\n**Edited \u003Ctime datetime=\u00222015-06-23T16:44:04Z\u0022 title=\u002206/23/2015 04:44  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by Jon144**"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-06-24T20:52:39Z","Content":"Engines are not the only thing that can\u0027t activate, science parts can\u0027t either.\n\nI understand some experiments seem like they need exposure, but that\u0027s more roleplay than anything, in my opinion."},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-06-24T21:27:11Z","Content":"The first thing I do in KSP is to try and recreate the Apollo 11 launch and mission, 1 core feature which is very important to me which I was assured would be possible is when stage 1 is dropped the engines fire on stage 2 with the fairing still attached and then the fairing is dropped approximately 30 seconds later.\n\n\u002B 1 from me to give an option for the user to not have this ridiculous \u0027feature\u0027.\n\nSurely it is the most kerbal way to be able to risk making your ship explode I e by hot staging like the Russians used to do..."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-24T21:34:18Z","Content":"\u003E \n\u003E I think Squad did a kind of bodge job to stop it happening. When you stage a separator in a faring it automatically separates the fairing.\n\nThis is an even hackier fix that continues to deny us the solution we really want.\n\nIf anyone can figure out the code to remove both of these nuisances . . . well I don\u0027t really need to speak for the appreciation of the community for that."},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-06-26T04:09:08Z","Content":"I don\u0027t know how but I would like to help. Can anyone point me in a direction?"},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-06-26T06:54:17Z","Content":"\u003E \n\u003E Once when making my B-52 replica I put SRBs mounted on decouplers on the wings to replicate missiles. I never put any sort of fairings on the aircraft yet when I launched the \u0022Missiles\u0022 I was given the notice \u0022Cannot activate part while stowed\u0022 so the SRB did not fire as intended. I found this very odd. I never even stowed it.\n\u003E Also as I proved in a different post engine exhaust is not going to heat anything.\n\nIt appears the game now checks for part occlusion before it\u0027s allowed to be activated. I had a few helicopter designs that needed some engine repositioning as the jet exhaust was too close to the collision meshes of other parts.\n\nA good workaround would be to see if Squad can give us some sort of right click status display showing of the part is currently shielded or occluded. This was implemented previously in Procedural Fairings and indeed I have built air and spacecraft with parts mounted inside fairings but not shielded (VTOL engines with components hidden by fairing) or using fairings as airplane fuselages or conformal payload bays. \n\nFor the latter example, yes, indeed it would be silly to simply lock out the part because it\u0027s covered by the fairing, but what Squad did was probably assume all fairings are full enclosures that disable everything inside."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-26T10:23:14Z","Content":"\u003E \n\u003E Even if the engine could activate, all it would do is burn fuel and heat things up\n\nMaybe I want the engine to heat things up.\n\nSpecifically, I do. I want the engine to overheat the structural part next to the cargo bay/fairing/whatever so that it breaks freeing the cockpit during the Abort Sequence. Putting airplane cockpit on a decoupler is silly, plus there are no MK2-sized decouplers. OTOH destroying the middle part of the plane to free the cockpit and drop it on a parachute (after, say, losing wings) seems like a logical thing to do."}]}