{"TopicId":116652,"ForumId":20,"TopicTitle":"Which OS do you test Mods under?","CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-07-23T10:43:01Z","PageNum":1,"Articles":[{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-07-23T10:43:01Z","Content":"The 32-bit Windows version, even when running under the 64-bit Windows OS, often feels short of memory.\n\nI\u0027ve been told that 64-bit Linux is very good. I understand that Apple is also 64-bit. Both will be still limited by hardware, but RAM costs keep dropping. I am beginning to think of at least doing Linux dual boot when I do the next hardware upgrade.\n\nIncidentally, my plans will give me about a million times the RAM of my first computer, and close to a million times the CPU clock speed plus the multiple cores.\n\nThe same screwdriver can be used.\n\nBut, while the OS doesn\u0027t affect the components, except maybe for the EOL markers in the readme, nobody seems to say anything about which OS they use. Looking at some of the spectacularly-sized Mods out there, I must be using a lot of Apple/Linux-created Mods, with no problems.\n\nSo what are you using?"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-07-23T11:06:00Z","Content":"I use Linux but, I did start with windows and now dual boot because something just don\u0027t run in Linux but for the most part, I in linux about all the time and if you wanted to running linux there are a bunch of different Linux OS in the way the look and run."},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-07-23T13:34:40Z","Content":"To clear some things up: KSP is 32-bit on Windows and OS X. KSP is only 64-bit under Linux. The 32-bit KSP versions of KSP will only ever be able to access about 3.5 GB of RAM, even if you run it on a 64-bit operating system. KSP 1.1 may or may not have a Windows 64-bit version, since they\u0027re updating to Unity 5.\n\nAnyways, I **play** KSP on Linux, because my KSP is about 8-10 GB once fully loaded. I **write** and **test**  mods under OS X, but I don\u0027t really play on that installation. I keep it trimmed down (1024x768, worst graphics settings, no mods except what I\u0027m testing) because development requires you to restart KSP dozens of times an hour."},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-07-24T01:12:36Z","Content":"Unity\u0027s game development software runs only on Windows and OSX, so anyone wanting to use that won\u0027t be developing on Linux unless they want to deal with Wine."},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2015-07-24T01:36:15Z","Content":"\u003E \n\u003E Unity\u0027s game development software runs only on Windows and OSX, so anyone wanting to use that won\u0027t be developing on Linux unless they want to deal with Wine.\n\nWine can\u0027t really run unity unless not on some Linux best to dual boot then."},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-07-24T07:50:38Z","Content":"\u003E \n\u003E Unity\u0027s game development software runs only on Windows and OSX, so anyone wanting to use that won\u0027t be developing on Linux unless they want to deal with Wine.\n\nYou can write plugins without ever launching Unity, so you can mod on Linux."},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-07-24T08:01:50Z","Content":"I\u0027ve only done plugin hacking. This days I do all of that development work on OSX, and test on OSX and Windows."},{"CreatedByName":"Ser","CreatedById":104207,"CreatedDateTime":"2015-07-24T10:14:06Z","Content":"I don\u0027t use Unity editor at all too.\n\n\u003E \n\u003E I use Linux but, I did start with windows and now dual boot because something just don\u0027t run in Linux but for the most part, I in linux about all the time and if you wanted to running linux there are a bunch of different Linux OS in the way the look and run.\n\nCan you post some examples that don\u0027t run on Linux?\n\nActually, folks, I\u0027m thinking about installing Linux but don\u0027t understand how do you make mods work with it as they are distributed in dll files?"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2015-07-24T11:19:53Z","Content":"The same dll files work perfectly well on linux. These are not ordinary Windows DLLs containing Windows specific API calls, they are platform independent DLLs containing [CIL](https://en.wikipedia.org/wiki/Common_Intermediate_Language) code that can run under any CIL runtime (e.g. .NET or Mono in Unity)."}]}