{"TopicId":118962,"ForumId":20,"TopicTitle":"Abstracts and Concepts for Various Potential Mods","CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-21T02:17:45Z","PageNum":1,"Articles":[{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-21T02:17:45Z","Content":"\n\u003Cp\u003EIf you are chronically TL;DR, then this isn\u0027t the thread for you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere are some of the mod concepts and improvements that have popped into my head while playing KSP. I do know that some of these ideas may have already been implemented, so if you see me writing about an idea that someone else has already put into practice please tell me so I can go ahead and cross it off the list. Beyond that I\u0027m just looking for feedback on which (if any) of these is interesting and should be looked at further and additional suggestions on how any of these ideas (or just some of your own if you like). Some of the ideas I can implement, others are a bit beyond my ken. They are not in any particular order, I just happened to write them down here and there and then compiled them all together. Anywhoo, on to the list...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPlayer Created Ground Stations: \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E My first time playing RO I didn\u0027t have the remotetech transmission sites updated, so in order to launch unmanned craft I first had to built a base control station. It was an oversized ground vehicle with six kerbals on board along with the necessary antennas to communicate with the craft. I drove it about 5 km away from the launch complex but still with line of sight to the pad. This kept the vessel outside of the loading range from whatever active rocket the player is trying to launch (assuming the player still has the stock loading distances in place). This could be parlayed into another aspect of the game where not only are you setting up satellite constellations, but you are also responsible for setting up your initial ground control stations both local (at the cosmodrome) and remote (think Alice Springs, Australia during Mercury). This is achievable easily via reducing the number of static ground stations and/or severely limiting their transmission distance and providing enough parts early in the game for the player to make their ground stations. See the RemoteTech Additions section for relevant information concerning non-Line-of-Sight radios.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMood and Sanity:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E A psych or \u0022sanity\u0022 state for the kerbals as part of the life support system. Sanity being affected by things such as living conditions, enviroment, overall duration in a given enviroment type (no \u0022change in scenery\u0022). Factors:\u003C/p\u003E\u003Cp\u003E \u003Cem\u003EMood \u003C/em\u003E- As a sanity affecting factor mood is weighted more heavily, happy people don\u0027t come unhinged as fast as unhappy people. Mood in general is an amalgam of the following factors, however other special events can have an immediate and overriding impact on the Kerbal in question. For instance they might be as happy as can be under STP, but for the 5 minutes they spend hurtling through the atmosphere on re-entry they could still have a rather significant emotional event.\u003C/p\u003E\u003Cp\u003E-- Interaction - Social critters need to social. If there are no other critters nearby to make pleasing noises with then the next best thing is calling up other critters on a communication device and making pleasing noises by remote transmission. Basically don\u0027t leave your Kerbal alone and out of radio contact for very long, you never know what kind of mischief they might get up to. Very short clock on this one. Radio communication ameliorates isolation but is an imperfect solution and only decreases the penalty.\u003C/p\u003E\u003Cp\u003E-- Habitat Volume - How was your last airline flight? Much elbow or leg room? Want to stay in that seat for the duration of a 2 week mission? Well that was about the sum of things for the Gemini pilots. For very long duration missions you\u0027ll probably want more than a phone booth\u0027s worth of living space per \u0027naut. This factor is largely static and is directly based on the available crew volume in a vessel divided by crew members, perhaps done non-linearly. Two \u0027nauts might have to share the extra space, but at least it\u0027s still extra space so it isn\u0027t just a straight division.\u003C/p\u003E\u003Cp\u003E-- Diet - Luxury or specialty food items selected by astronauts on the ISS are used to break up the monotany of the available food stuffs on board. I imagine a Kerbal equivalent would be a \u0022Mint Dessert\u0022 to break up the constant snackage. MD are prepackaged in single serving units and the Kerbonauts would be \u0022instructed\u0022 by ground control to \u0022open science mission package 327b and execute contained instructions...\u0022 which naturally would be \u0022Eat me.\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E with an appropriate number of MD cakes (cake (mint dessert type), one (1x) per) would be consumed giving the \u0027nauts an appropriate boost to mood and will also reset a \u0022snack clock\u0022. At first the diet will have a net positive affect on sanity, however after a period of time (as the snack clock climbs) it will decrease, flatten out for a while, and then begin negatively impacting the sanity. As mentioned this can be reset with the application of suitable luxury food items.\u003C/p\u003E\u003Cp\u003E-- Gravity - Major mood killer if you can\u0027t get out of your rack because Eve\u0027s gravity has you pinned to the matress like a cat to a car window. Low/no gravity can be initially very fun and a mood boost, but will gradually slide to slightly negative in zero-G as the physiological effects begin to take their toll. A centrifuge habitat can be used to raise it up to just a neutral effect. Heavy gravity is immediately fatiguing and so is an immediate and constant negative effect to mood.\u003C/p\u003E\u003Cp\u003E-- Duration - How long has the \u0027naut been away from home, and also how long have they been in a given biome? Overall duration starts neutral and then eventually evolves to negative both in mood and in a slow but cummulatively relevant direct affect on sanity. The closer the local environment is to home, the slower this clock runs. Time in a given biome starts out with a positive boost to mood, and a slightly positive direct affect on sanity and then progresses to neutral and flattens there as the local scenery becomes common.\u003C/p\u003E\u003Cp\u003E-- Distractions - Food for the eyes and mind. New movies, messages, pictures. Anything novel and interesting that can be digitized and delivered at 2.4GKz. Behavior similar to the desserts for diet but gives a slightly longer (but less intense) mood boost and also a direct positive sanity increase if the distraction is emotionally significant for the \u0027naut (letters from family, etc.)\u003C/p\u003E\u003Cp\u003E-- The practical effects of mood and sanity states could be displayed in a cross-grid, and possibly include spontaneous transmissions, varying levels of command compliance, positive/negative effect on craft and systems, et alii.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIntegration of Craft Parts Into Avionics Mods:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E In short limiting the information available to the player via MechJeb (or others) while in flight based on the available onboard (or offboard) hardware. As an example, MechJeb not being able to display the local temperatures without an on-board thermometer. Perhaps certain higher order maneuver planning is unable to be performed with the on board craft hardware and instead you need a radio link back to mission control where the ground based super computers can chew on the problem for you.\u003C/p\u003E\u003Cp\u003E Other aspects would include integrating other mods together, such as the KerbalGPS system with RemoteTech and Mechjeb. Early hardware may prove insufficient for accurately plotting the ship\u0027s trajectory out beyond a certain distance and so instead of a nice orbital line being displayed the player instead sees an ever expanding cone from their current position to the point where the plot just ends because it has become excessively inaccurate.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAblation Resource for Engines and Regenerative Cooling Failure:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EInspired the cooling selection mod but primarily for those using RO or similar engine mods that already make large distinctions between fuel types and engine hardware. Add the ablation resource to ablatively cooled engines in much the same manner as for command pods thus giving them a very much finite run life. This could be the single major limiting factor in the reused of hypergol engines that are otherwise not restart-limited.\u003C/p\u003E\u003Cp\u003EOn the other side for regeneratively cooled engines, perhaps some catastrophic failure (due to rapid and extreme overheating, so technically the failure bit is already in game, we just need a way to activate it in particular situations) if the engines are run to propellant exhaustion and thus are deprived of coolant flow through the engine prior to flame out. So the player would either need to balance the tankage to be a little coolant heavy (so the engine flames out before losing coolant flow, assuming only one of the bi/tripropellants is used in cooling, not an available strategy for monopropellant engines like NTR\u0027s) or shut down and/or stage before total propellant/coolant exhaustion (probably the better idea).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for SmartStage Mod:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAdditional triggering parameters such as G-load, unifying the different parts into a single part with menu selectable triggering parameters (and attendant texture change to match), and perhaps allowing remote placement such as putting a tank resource Smartpart in the interstage IU and then just telling it which tank to monitor. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for RealismOverhaul Mod:\u003C/strong\u003E \u003Cem\u003EIf the improvement is specific to another mod RO alters that mod is listed in italics and underscored.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E-- Being able to switch from the day 0 Julian-style calendar currently in game to the more familiar and thus intuitive Gregorian Calendar.\u003C/p\u003E\u003Cp\u003E-- Control Moment Gyroscopes of various gimballing function as a later upgrade from the basic (and extremely low torque) Reaction Wheels. In practical application this means just making a heavier reaction wheel module part with stronger torque.\u003C/p\u003E\u003Cp\u003E-- A change to the saturation of reaction wheels, instead of having a torque consumable resource that slowly regenerates they could display the current reaction wheel speed and also its maximum and minimum speeds. As the reaction wheel does work it will be gradually speeding up or slowing down the wheel as needed and once it reaches the limit of its speed range it is no longer able to provide torque in that direction. At that point the player can execute a desaturation burn using the onboard RCS engines and thus \u0022reset\u0022 all the momentum wheels back to their starting speeds. \u003C/p\u003E\u003Cp\u003ESingle reaction wheel/single gimbal CMG\u0027s to start with. Low mass, placeable as the player desires, and only able to affect a single axis of rotation (based on their mounted orientation). Combo units to follow after unlocking higher tech nodes. Single gimbal CMG\u0027s provide better torque, but you\u0027ll need more of them combared to a multi-gimbal CMG.\u003C/p\u003E\u003Cp\u003E-- Flow limits on propellant lines. If you\u0027re feeding a big engine from another tank via a fuel line it would need to be sized up (and thus also it\u0027s mass) as appropriate to permit the volume necessary to run the engine. The size of the fuel line/utility tunnel would also affect the rate of resource transfer from one area of the ship to another if it is channeled through such a bottle neck. Flow rate from balloon tanks limited by the rate of tank pressurization (can\u0027t let the structure collapse because we\u0027re sucking the propellant out of it faster than the pressurization system can manage, this could induce players to choosing heavier tank types if they\u0027re feeding big engines or using tankage in a mass/volume restricted application.)\u003C/p\u003E\u003Cp\u003E-- Treating electrical charge like any other resource and requiring the appropriate resource connections to channel it around resource break points (decouplers) and the like.\u003C/p\u003E\u003Cp\u003E-- \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ETAC Life Support\u003C/span\u003E\u003C/em\u003E - Resource consumption rate documentation so space craft can be appropriately designed for specific missions and duration (I\u0027m looking at doing an RO config for Universal Storage and will likely be looking up this particular information on my own and can probably just release whatever notes I write down for that purpose.)\u003C/p\u003E\u003Cp\u003E-- \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ETAC LS\u003C/span\u003E\u003C/em\u003E - Cabin CO2 needs to changed so it\u0027s displayed as a percentage of the cabin atmosphere, and not an alterable resource (you can\u0027t magically reallocate the CO2 out of the air in the cabin without either a chemical scrubber or atmospheric fractioning equipment, which would be heavy). CO2 needs to be constantly and immediately scrubbed so the CO2 absorbers need to be planned to last the entire mission. Any build up in the crew cabin would be detrimental to their health. CO2 gauge should be from 0.00% to 1.50% (or whatever is considered lethal). Kerbal suits should have their own built in systems and crew should be able to get into their suits if the spaceship life support isn\u0027t working (this idea is repeated below as it would be appropriate in a non-RO game as well). \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E-- \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003ETAC LS\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E - \u0022Life support\u0022 electricity should be broken down into detail so that select technology upgrades can be implemented and cause the astronauts to use less through more efficient lighting/heating/cooling. Crew capsules should also be temperature controlled, which would require greater amounts of electricity if the craft isn\u0027t setup to handle its own waste heat efficiently (radiators, etc., more energy used if you have to use a lot of heat pumps to move the waste heat somewhere else to be radiated, so on) \u003Cspan style=\u0022color:#FF0000;\u0022\u003EApparently already does this.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E-- \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003ETAC Fuel Balancer\u003C/em\u003E\u003C/span\u003E - Should not be able to randomly dump certain resources (such as solid waste). Also needed are persistent settings per craft resource so that the tankage and such can be set up to operate in a specific manner (such as drawing RCS fuel from earlier stages so you don\u0027t inadvertently drain the tanks for your reentry control earlier in the mission) and the ability set them while still in the VAB/SPH. This second aspect would be beneficial for TAC FB in general, and not just in RO, and is repeated farther down for that reason.\u003C/p\u003E\u003Cp\u003E-- Landing hazards presented by residual toxic resources on board, ergo, the necessity of dumping your remaining RCS propellants and what not before touching down on the ground. Failure to do so would render the craft \u0022toxic\u0022 and subject to a long and possibly costly reclamation process (basically a cool down timer and a cost penalty before you can recover the craft, the crew on board could still button up their space suits, get out and go get picked up on their own so they don\u0027t die from starvation and the like while the timer is still going.) Heat hazards after reentry might also be a consideration.\u003C/p\u003E\u003Cp\u003E-- \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ERemoteTech \u003C/span\u003E\u003C/em\u003E- Remote operations center (ie. any ship with six kerbals and a radio) kerbal skill requirement (ie. 3 engineers, 2 scientists and 1 pilot for a remote station, and a needed XP level for each). Perhaps a new type of kerbal, the support Technician necessary for certain things. \u003C/p\u003E\u003Cp\u003E-- \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003EMore RemoteTech\u003C/em\u003E\u003C/span\u003E - Directional antennas that need to be pointed at the target. Some with auto-tracking (similar to solar panel sun tracking, but oriented to the designated target) others without either need the spacecraft to point at the target (Voyager, New Horizons, etc.) or some other mechanism (Infernal Robotics?).\u003C/p\u003E\u003Cp\u003E-- \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003EMOAR RemoteTech!!\u003C/em\u003E\u003C/span\u003E - Different radio bands, some that do atmospheric bounce and scattering to allow non-Line-of-Sight communication on a planet without relays (void where prohibited and/or lacking an ionosphere and troposphere), and their associated propagation effects, transmitter power requirements (user adjustable on the fly, why put out enough RF wattage to reach Pluto when you only need to talk to Mars right now?), receiver sensitivity.\u003C/p\u003E\u003Cp\u003E-- \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003EMultistage Engine Start Up and Operation\u003C/em\u003E\u003C/span\u003E: spin up turbomachinery first via compressed gas or gas generator, when the pumps are \u0022at speed\u0022 or the propellant lines read a certain pressure available then open the fuel valves to the injector and activate the ignitor system if seperate (the H-1 engine bled off gasses from the solid rocket motor gas generator that spun up the pumps and used it to also ignite the combustion chamber). On/off status should be independant of throttle setting and require a deliberate action (shutting the propellant valves). Some issues with start-limited engines in the KSP game are there are instances where the game may either bug out momentarily setting throttle to 0 and then back to the previous setting and there are instances with mechjeb (such as switching off the launch guidance while still in powered flight) that will also change the throttle setting and interfere with proper operation and often cause a failed launch. The game \u0022hiccups\u0022 can be resolved by allowing the automatic re-ignition and continuation of an engine that is already at speed (pump wise) and temperature (combustion chamber wise).\u003C/p\u003E\u003Cp\u003EBeing able to build an appropriate IU (Instrumentation Unit) for the different stages. Almost possible currently with smart parts. Being able to add additional tanks of high pressure helium and/or TEA/TEB to change the number of times an engine could be restarted. The Saturn V S-2 engines (five J-2\u0027s) only needed to light once, versus the S-IVB\u0027s engine (also a J-2) would need to be able to start at least twice. This will let players further tailor their rockets to their own designs.\u003C/p\u003E\u003Cp\u003E-- \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EStage System Overhau\u003C/span\u003E\u003C/em\u003El: Any command that could otherwise be placed into an action group can be optionally placed into the staging queue. Each \u0022stage\u0022 can be broken down and different parts can be assigned different times of action to be executed as a stage. Example:\u003C/p\u003E\u003Cp\u003EStage 1 (launching)\u003C/p\u003E\u003Cp\u003ET\u002B0 seconds = fire gas generators starting turbomachinery for engines.\u003C/p\u003E\u003Cp\u003ET\u002B6 seconds = open fuel valves to combustion chamber.\u003C/p\u003E\u003Cp\u003ET\u002B6 seconds = activate ignitor.\u003C/p\u003E\u003Cp\u003ET\u002B10 seconds = after achieving full thrust (not an instant thing in real engines), release launch clamps.\u003C/p\u003E\u003Cp\u003ET\u002Bn seconds = close fuel valves to turbomachinery and allow to spin down on own, thrust drops off gradually.\u003C/p\u003E\u003Cp\u003ET\u002Bn\u002B5 seconds = initiate staging\u003C/p\u003E\u003Cp\u003E-- \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003EProcedural Parts\u003C/em\u003E\u003C/span\u003E - Different battery chemistry and break-down (loss of capacity) over time. Disposable vs. rechargeable, varying capacities vs. weights and so on. \u003C/p\u003E\u003Cp\u003E-- \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003EVirtual Parts\u003C/em\u003E\u003C/span\u003E - Flight hardware that can be incorporated into crewed capsules and takes up a set amount of internal volume, such as the on board CO2 scrubber, radio transceivers, various flight instrumentation. The \u0022parts\u0022 can be swapped out based on mission needs, upgraded for ability and miniaturization. On-board parts will also affect what flight information is available to the player via MechJeb and the like. Some other example parts include a radar altimeter (which gives you an exact true altitude) a barometric altimeter (which gives you a mostly accurate sea level altitude, but only if you\u0027re in an atmosphere to measure), a star tracker (which tells you where you are in space), attitude gyroscopes, a non-resetting mission clock (that basically just records how long that particular capsule part has been in use and doesn\u0027t get reset by things like docking and undocking) and the list just goes on and on with the only real limit being player desire for how far they want to take it. Capsules and probes would have a set internal volume for flight hardware as distinct from the volume set aside for tankage with realfuels. Excess hardware volume could be made available for crew habitat use (note the Mood and Sanity need for habitat volume above).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for MechJeb Mod:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESmart A.S.S. control mode that uses engine gimbal to \u0022center\u0022 the engine thrust through the center of mass of the entire spacecraft, and to orient the navball so that prograde is parallel with the thrust vector. This should help players deal with minor craft imbalances at the later stages of flight where the issues become more and more pronounced as craft mass decreases.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for FASA Launch/Umbilical Tower:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EA unified common tower model from which the umbilical arms and boarding gantries are suspended from. Perhaps put it on the VAB side of the launch pad and have the tower base mounted on rail bogeys in those existing track models so it appears to be part of the roll out system and stands off from the launch pad proper. Umbilical arms and boarding gantry should be procedurally adjustable for length in order to have the reach for the larger rockets that have a wide diameter or lots of boosters at the lower stages.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for TAC Fuel Balancer:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EPersistent settings per craft resource so that the tankage and such can be set up to operate in a specific manner (such as drawing RCS fuel from earlier stages so you don\u0027t inadvertently drain the tanks for your reentry control earlier in the mission) and the ability set them while still in the VAB/SPH.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for Procedural Parts:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EToroidal propellant tanks. Similar to the fillet cylinder, but with a hollow cavity in the middle and an \u0022Inner Diameter\u0022 adjustment for it. Basic mounting hardware at the top where the tank attaches in the stack and with the second stack node just below it so engines and other parts can be nested inside the tank (ie. lunar ascent and descent stages for the LEM).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for Kerbal Attachment System with Kerbal Inventory System:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESpacesuit change to crew inventory item that they can choose to wear (option to wear available both inside and outside the craft). Suit life support values independant from the spacecraft at all times (with the player controls to refill from ship resources.) Wear of a space suit while inside the craft will put that person\u0027s life support requirements on the suit thus giving them an option in the event of ship life support failure.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for Procedural Fairings:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EA \u0022see through\u0022 mode for procedural fairings akin to the stock fairings so you don\u0027t have to pull them off (and thus break some action groups) to get at the parts underneath when setting stagings and action groups. This could be accomplished by having the fairing simply be mostly transparent and non-clickable/collidable (except for a small bit where it mounts to the support ring) while in the VAB/SPH.\u003C/p\u003E\u003Cp\u003ESmaller/skeletonized thrust plates and cargo/interstage adapters. The adapters become excessively tall at larger sizes and being able to reduce that height (and also mass) manually would be helpful. Thrust plate load capacity (and thus overall mass, again) as an independantly adjustable setting that affects the visible thickness of the structure. Images of skeletonized thrust plate concept to follow.\u003C/p\u003E\u003Cp\u003EBird-cage/lattice style fairing panel for early interstage junctions. Examples can be found on the Soviet SS-8 and SS-13 missiles.\u003C/p\u003E\u003Cp\u003EHaving most of the part objects consolidated into 2 or 3 distinct parts and then use selection menus to specify and customize. Procedural fairings pieces with selections for exterior texture, interior texture, shape geometry, material selection (extra insulated, metal vs. composite, reentry tiles, etc.), a single \u0022mounting adapter\u0022 that is selectable for Engine Thrust Plate, Cargo Mounting (specially selectable for the height of the payload mounting, depressed/flush/elevated and how much), interstage and so on.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for TestFlight:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFor the TestFlight mod: What about test stands that let you evaluate and develop engine reliability without risking them in flight? Test stand can be as simple as your rocket stage being mounted to extra-strong, non-releasing launch clamps that also act as the probe core for control. As an addon for KCT, you could develop engines on a test stand to reduce their dynamic failure rate (rather than flying them to do so), and then also incorporate a minimum \u0022material defect\u0022 failure rate. To counter this you would test unique engines on the stands, verify they are good, and then install them on the rockets for use. A few special areas don\u0027t allow this though, such as the Lunar Descent Engine on the LEM. Due to the corrosive hypergol propellant and the ablative cooling it could only be fired once and allowed for no pre-testing, so while you might reduce the tech development failure rate with R\u0026amp;D and live fire tests you will be unable to avoid the material defect failure rate in certain cases.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAdditions for Airlock:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EUnable to exit the crew capsule unless it is depressurized first, can only depressurize if everyone in the capsule is suited up. Airlock code module for crew capsules large enough to support them, airlocks allow ingress/egress without depressurizing the whole capsule, but will vent an airlock\u0027s worth of oxygen to space if a scavenger pump isn\u0027t available/used. Airlock possible extra item to add to ships or stations that don\u0027t yet have one.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EExisting-mod-based Parachute Parts Pack for RealChute:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EA model pack of all the available (permission pending) parachute models rolled together and made available for use by the RealChute mod in order to add more variety to the game. Possibly also practical effects based on chute selection.\u003C/p\u003E\u003Cp\u003EOther addiction for RealChute: Collision mesh (?) for parachutes so they push each other aside (and maybe deform/flatten where they contact) while deployed instead of clipping through each other.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAstro-Charting and Telescope Experiments:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EA few previous mods have entertained the idea of needing to physically orient the craft so that the telescope can see things, but this could be taken a few steps further. This idea would necessitate the discovery, observation and tracking of celestial objects that have otherwise been overlooked if you wanted to be able to (accurately and/or successfully) visit them. Astronomy experiments to first discover other celestial bodies followed by plotting their orbits (repeated observations). Perhaps a system to give the player an idea of where to manually look with a telescope (using WFOV IR/Vis/UV as an example), and then repeated static sightings being calculated into orbital parameters.\u003C/span\u003E \u003Cspan style=\u0022color:#FF0000;\u0022\u003EAlready fulfilled by ResearchBodies mod (thank you Hab136 for telling me about it.)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESpacestation Purposes and Missions:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAdd in practical benefits and necessities for station placement, such as you can only do certain experiments on an established (time in present orbit requirements?) spacestation orbiting a specific body at a particular altitude and also missions to expand upon already placed space stations with additional scientific, industrial, or mission payloads that expand the capability of that station.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMass Centering Tool for the VAB/SPH:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E COM centering tool for the VAB (top-down looking indicator showing vessel COM and COT relative to physical center so the player can move payloads around until properly balanced.)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENegative Buoyancy:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Buoyancy ratings for different craft/returned probes and thus a practical use for additional flotation devices to keep your water-landed craft from sinking.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProcedural Utility Tunnels:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Essentially fuel lines that can only be placed vertically (and will automatically snap the second part into vertical alignment), and which will contour themselves to the surface of the craft. Menu selections for which resources that can be passed and in which direction. Needed for controlling resource flow across staged part stacks, like from the Service Module to the Command Module, I want the service module\u0027s oxygen to feed the CM, but I don\u0027t want to just toggle crossfeed on the decoupler because I do not want the SM\u0027s fuel cells to be able to rob the CM\u0027s crew oxygen in the event of Something BadÃ¢â€žÂ¢.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EContracts and Strategies in Science-only Career Mode:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E Contracts and administrator strategies should remain open and available during \u0022science only\u0022 career playthroughs as both provided a source of science points to unlock technology (a science only career has less science points available to it than a full career, especially early on when the player is scraping together a few points here and there to unlock the initial techs). \u003C/p\u003E\u003Cp\u003E \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EAdditionally a career mode that allows the player to act as a government agency for funding purposes could be interesting, a regular albeit fixed budget that is provided each year/month with the player able to petition for an increase in funding by putting together project presentations, tech demonstrators, etc. or suffer a decrease if they fail to show merit for continued funding.\u003C/span\u003E Idea is already being implemented in a couple mods. I love being able to cross things off. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPreferential Electrical Grid:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E A list of all ElectricCharge consuming parts on the vessel and the option to set their priority, ie. the grid control will choose to stop powering certain systems if the on board stored electricity falls below a set threshold, or if the current load demand exceeds a certain point (imagine I turn on the radar mapping device, my power drain jumps and the grid controller reacts by switching off certain non-critical ship components so I don\u0027t drain my batteries before reaching the light side of the planet. Accurate time estimations for resource depletion.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPost-Rollout Fueling: (I\u0027ve already done this and have the altered configs set aside)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E In order to get around part loading lag that was destroying massive rockets in my game I would prepare them in the VAB and then drain all the main LOX/LH2/RP-1 tanks and have a few of the ground support parts (launch clamps, umbilical towers) set as resource generators. The rocket would load in with only a fraction of it\u0027s flight mass avoiding lag bug destruction, and then would spend a short while gassing up prior to flight. obviously shouldn\u0027t apply to small pre-prepared tanks like the Apollo SM\u0027s SPS hypergol tanks, RCS fuel, etc. Only modification needed was to add the resource modules to the launch clamps.\u003C/p\u003E\u003Cp\u003E Additionally, this reduced the propellant penalty incurred while waiting for the booster engines to spin up to full thrust. Until I released the last of the launch clamps the propellant umbilical on the first stage would try to keep the tank full during start up. A kludge system I used to employ for this issue was an extra fuel tank strapped to the frame of the launch clamps with a fuel line connected to the first stage. The tank I was leaving behind would feed the engines until they were at full thrust and I broke the fuel line connection by releasing the launch clamps.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-21T19:21:00Z\u0022 title=\u002208/21/2015 07:21  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 21, 2015\u003C/time\u003E by Yaivenov\u003C/strong\u003E\n\u003Cbr\u003ECrossing stuff off the list.\n\u003C/span\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-08-21T09:09:01Z","Content":"\n\u003Cp\u003EMood and Sanity - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/114956\u0022 rel=\u0022external nofollow\u0022\u003EKabin Kraziness\u003C/a\u003E, also look at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67739\u0022 rel=\u0022external nofollow\u0022\u003EKeepFit\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPreferential Electrical Grid - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127687\u0022 rel=\u0022external nofollow\u0022\u003EAmpYear Power Manager\u003C/a\u003E, sorta\u003C/p\u003E\u003Cp\u003EAstro-Charting and Telescope Experiments - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127533\u0022 rel=\u0022external nofollow\u0022\u003EResearchBodies\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPost-Rollout Fueling - I think \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/62270\u0022 rel=\u0022external nofollow\u0022\u003EShip Manifest\u003C/a\u003E can do this if you\u0027re still on the pad. The launch-clamps-as-generator idea is pretty cool though. I\u0027ve previously strapped fuel tanks to the launch clamps so that I could power up a jet-engine first stage and still be fully fueled on takeoff.\u003C/p\u003E\u003Cp\u003E\u0022Each \u0022stage\u0022 can be broken down and different parts can be assigned different times of action to be executed as a stage.\u0022 - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64227\u0022 rel=\u0022external nofollow\u0022\u003ESmart Parts\u003C/a\u003E has a timer that you can activate through staging. You could activate a bunch of timers in one stage, then at \u002B5 seconds one part will fire, at \u002B7 seconds a different part will fire, etc. The timer can then activate an action group or stage.\u003C/p\u003E\u003Cp\u003E\u0022Crew capsules should also be temperature controlled, which would require greater amounts of electricity if the craft isn\u0027t setup to handle its own waste heat efficiently\u0022 - my understanding is that TAC\u0027s electric usage already accounts for heating/cooling, in addition to CO2 scrubbing.\u003C/p\u003E\u003Cp\u003EMost of these ideas as very intricate and fully into the \u0022simulation\u0022 end of the pool (instead of the \u0022game\u0022 end).\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-21T19:11:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hab136\u0022 data-cite=\u0022hab136\u0022\u003E\u003Cdiv\u003EMood and Sanity - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/114956\u0022 rel=\u0022external nofollow\u0022\u003EKabin Kraziness\u003C/a\u003E, also look at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67739\u0022 rel=\u0022external nofollow\u0022\u003EKeepFit\u003C/a\u003E\u003Cp\u003EPreferential Electrical Grid - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127687\u0022 rel=\u0022external nofollow\u0022\u003EAmpYear Power Manager\u003C/a\u003E, sorta\u003C/p\u003E\u003Cp\u003EAstro-Charting and Telescope Experiments - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127533\u0022 rel=\u0022external nofollow\u0022\u003EResearchBodies\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EPost-Rollout Fueling - I think \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/62270\u0022 rel=\u0022external nofollow\u0022\u003EShip Manifest\u003C/a\u003E can do this if you\u0027re still on the pad. The launch-clamps-as-generator idea is pretty cool though. I\u0027ve previously strapped fuel tanks to the launch clamps so that I could power up a jet-engine first stage and still be fully fueled on takeoff.\u003C/p\u003E\u003Cp\u003E\u0022Each \u0022stage\u0022 can be broken down and different parts can be assigned different times of action to be executed as a stage.\u0022 - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64227\u0022 rel=\u0022external nofollow\u0022\u003ESmart Parts\u003C/a\u003E has a timer that you can activate through staging. You could activate a bunch of timers in one stage, then at \u002B5 seconds one part will fire, at \u002B7 seconds a different part will fire, etc. The timer can then activate an action group or stage.\u003C/p\u003E\u003Cp\u003E\u0022Crew capsules should also be temperature controlled, which would require greater amounts of electricity if the craft isn\u0027t setup to handle its own waste heat efficiently\u0022 - my understanding is that TAC\u0027s electric usage already accounts for heating/cooling, in addition to CO2 scrubbing.\u003C/p\u003E\u003Cp\u003EMost of these ideas as very intricate and fully into the \u0022simulation\u0022 end of the pool (instead of the \u0022game\u0022 end).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKeepFit is great for modeling the physiological changes on the body but in this case I wanted to focus on the mind. KabinKraziness seems to be in the direction I want to go but it is dependent on another mod I\u0027ve already discarded (see below) and seems to be oriented around modeling the system via the resource pool rather than individual attributes tied to particular individuals.\u003C/p\u003E\u003Cp\u003EI tried AmpYear, Fusebox and TAC Fuel Balancer. Only TACFB came close to the prioritization I desired (I could rig some fuel tanks to always want to flow in and then rig a fuel line from SM to CM to make a one-way resource route and in that manner the crew capsule always was topped off for oxygen and water) but it doesn\u0027t offer the level of control and persistence I\u0027m looking for, and near as I can tell they all treat electricity as an ubiquitous resource not in need of wiring and thus is rather difficult to control the flow of (such as, if the power fails in the service module I want the battery backup in the command module to ONLY power the command module\u0027s life support and a few systems and nothing else, but I can\u0027t with the current system).\u003C/p\u003E\u003Cp\u003EResearchBodies: Outstanding! ....now I just have to figure out how to integrate it into RO. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EPost-Rollout Fueling, I could also just use the TAC Fuel Balancer to click and edit the fuel back into the ship, but there is something amusing to me about the anticipation of fueling it up. As mentioned this is something that I\u0027ve already found a simple solution to and implemented (launch umbilicals, bless you FASA for all you\u0027ve given us) but on reflection now I think it could be expanded further: Growing cryogenic effects, boil off apparent at the junctions and vents of the rocket, frost forming over the surface of the LOX and LH2 tanks, etc.\u003C/p\u003E\u003Cp\u003EFor Staging I\u0027ve been testing out smartparts and as I mentioned you darn near can make a nice IU using them, but growing part count will always be an issue. Just spitballing here but lets say that\u0027s between 6 and 10 smartparts per stage to handle all the timing issues, that\u0027s between 18 and 30 extra parts just for a three stage deal. Even with that set aside there is still the desire to be able to remove things from the staging list so it can not be inadvertently activated and the like.\u003C/p\u003E\u003Cp\u003ETACLS - Thanks for that info, I was playing around with watching power drain via AmpYear earlier and I wasn\u0027t able to discern any changes as the spacecraft proceeded through different environmental regimes. I\u0027ll just tentatively scratch this one off the list then.\u003C/p\u003E\u003Cp\u003EAnd yeah, that\u0027s why I tried to split the ideas between RO specific and those that I thought could help flavor (mostly) stock games.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-08-22T20:35:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yaivenov\u0022 data-cite=\u0022Yaivenov\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E-- Being able to switch from the day 0 Julian-style calendar currently in game to the more familiar and thus intuitive Gregorian Calendar.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt should be possible to set an epoch and starting date so that you do, in fact, begin in 1950. However, KSP doesn\u0027t know about leap years. So the calendar may look familiar, but it will soon be off. That would set a trap for people who don\u0027t know about this quirk and start planning missions from real-life documents -- IMO it\u0027s better that the date is obviously, visibly off.\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-22T21:04:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EIt should be possible to set an epoch and starting date so that you do, in fact, begin in 1950. However, KSP doesn\u0027t know about leap years. So the calendar may look familiar, but it will soon be off. That would set a trap for people who don\u0027t know about this quirk and start planning missions from real-life documents -- IMO it\u0027s better that the date is obviously, visibly off.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would imagine a Gregorian calendar mod would secretly be operating off the day zero Julian date that already exists. The player just gets to choose an arbitrary start point and the mod could calculate out and display the \u0022correct\u0022 G-date as extrapolated from the starting point and the elapsed J-date. The progression of time remains mathematically correct for the purposes of the game, but is just displayed differently on the player\u0027s end, much in the same manner as the changing of your speed display from m/s to MPH.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-22T21:05:00Z\u0022 title=\u002208/22/2015 09:05  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 22, 2015\u003C/time\u003E by Yaivenov\u003C/strong\u003E\n\u003Cbr\u003ETypos will be the death of me...\n\u003C/span\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-08-24T10:11:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yaivenov\u0022 data-cite=\u0022Yaivenov\u0022\u003E\u003Cdiv\u003EOnly TACFB came close to the prioritization I desired (I could rig some fuel tanks to always want to flow in and then rig a fuel line from SM to CM to make a one-way resource route and in that manner the crew capsule always was topped off for oxygen and water) but it doesn\u0027t offer the level of control and persistence I\u0027m looking for, and near as I can tell they all treat electricity as an ubiquitous resource not in need of wiring and thus is rather difficult to control the flow of (such as, if the power fails in the service module I want the battery backup in the command module to ONLY power the command module\u0027s life support and a few systems and nothing else, but I can\u0027t with the current system).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor topping off things, I use \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/118176\u0022 rel=\u0022external nofollow\u0022\u003EGPOSpeedPump\u003C/a\u003E (a continutation of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67163-0-23-5-Goodspeed-Automatic-Fuel-Pump-v2-14-1\u0022 rel=\u0022external nofollow\u0022\u003EGoodSpeed Fuel Pump\u003C/a\u003E).\u003C/p\u003E\u003Cp\u003EFor example, I set my station\u0027s Life Support parts to pump level 15 (out of 16), then my lander to level 4. Any time it docks, it automatically refills. If I need to dump life support for some reason (for example a capsule returning to Kerbin), I set it to level 16 which flows to everywhere else on the station.\u003C/p\u003E\u003Cp\u003EFor waste, I do the reverse. The station\u0027s waste container is set to level 1, and my lander\u0027s waste container is set to level 4. My lander then empties waste every time it docks, automatically. On returning capsules, I set the pump level to zero, and let it fill up with waste before returning to Kerbin.\u003C/p\u003E\u003Cp\u003EThe best part is you can set the pump levels (and options of what to pump) in the editor before launch, or during flight, and they persist forever.\u003C/p\u003E\u003Cp\u003EThe above works for separate parts, but since pods have supplies\u002Bwaste, I have to set the pump level to zero, let it fill up with all resources, then set the pump options to only pump food/water/oxygen, then set the pump level to 16. Result: pod full of waste and no food/water/oxygen. By default TACLS lets Kerbals survive for 2 hours without supplies, which is plenty of time to deorbit and land from low Kerbin orbit.\u003C/p\u003E\u003Cp\u003EBy default it only pumps fuel but it\u0027s easily extended to pump life support and other stuff, even electricity.\u003C/p\u003E\n"},{"CreatedByName":"Yaivenov","CreatedById":81754,"CreatedDateTime":"2015-08-25T05:49:33Z","Content":"\n\u003Cp\u003EExcellent, I\u0027ll give it a look when I get the chance.\u003C/p\u003E\u003Cp\u003EAt the moment I\u0027m knee deep in service module fuel cells and I might end up writing up an EPS sim concept to more accurately reflect their operation.\u003C/p\u003E\u003Cp\u003EFun fact i just learned: when additional load is put on the FC\u0027s it causes a voltage drop at the terminals until the engine case temperature can rise in response to the increased current output and in so doing brings voltage back up to nominal. You have to increase loads slowly or buffer the system via batteries to help support the load while the fuel cells adjust. Otherwise you run the risk of an undervolt situation that could damage stuff. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E and the reverse holds true when unloading the system, except overvoltage is the danger, though in that direction you can take one of your FC\u0027s off the bus in order to bolster the load on the remaining active cells.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-25T06:01:03Z\u0022 title=\u002208/25/2015 06:01  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 25, 2015\u003C/time\u003E by Yaivenov\u003C/strong\u003E\n\u003Cbr\u003ELearning is fun!\n\u003C/span\u003E\n"}]}