{"TopicId":126168,"ForumId":20,"TopicTitle":"Stock module for adding fx to origin of part, does it exist?","CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-11-22T15:27:07Z","PageNum":1,"Articles":[{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-11-22T15:27:07Z","Content":"\nHi guys,\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;m looking for a way to produce effects (smoke, fire) that will work with any part based on part origin, with offset capability, and the capability for an input resource (for example heat or fire). Does Unity/KSP have such a thing?\u003Cbr\u003E\n\u003Cbr\u003E\nBecause with the new ModuleResourceConverter, it should in fact be possible to create a fire, which spreads if not contained/controlled.\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-11-24T13:24:16Z","Content":"\nThere are mods with do similiar things:\u003Cbr\u003E\n\u003Cbr\u003E\n[URL=\u0022http://forum.kerbalspaceprogram.com/threads/101496\u0022]Collision FX[/URL] - generates sparks during collisions\u003Cbr\u003E\n[URL=\u0022http://forum.kerbalspaceprogram.com/threads/84102-PARTS-PLUGIN-1-0-x-V1-8G-Kerbal-Foundries-wheels-anti-grav-repulsors-and-tracks\u0022]Kerbal Foundries[/URL] - they took code from Collision FX to create Dust FX which generates dust depending on the surface the wheels are touching\u003Cbr\u003E\n[URL=\u0022http://forum.kerbalspaceprogram.com/threads/109952-1-0-x-Destruction-Effects-%28flames-and-smoke-on-joint-breaks%29?highlight=destruction\u0022]Destruction Effects[/URL] - adds fire and smoke to parts you shoot at\u003Cbr\u003E\n\u003Cbr\u003E\nThey all do more or less the same (adding FX to parts). You can look into the codes to figure out how that works and then add your spreading fire to it.\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-11-25T09:44:20Z","Content":"\nThanks!\u003Cbr\u003E\n\u003Cbr\u003E\nI am hoping there is another way, writing a plugin is something I still need to learn, and if there is a stock module I\u0026#39;d rather use that.\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-11-25T10:07:01Z","Content":"\nThe problem is that fire isn\u0026#39;t (can\u0026#39;t be) a resource. So you can\u0026#39;t use ModuleResourceConverter to simulate it. Or I\u0026#39;m too stupid to see a reasonable way to do it with this PartModule.\u003Cbr\u003E\n\u003Cbr\u003E\nHow about coming up with your own version of fire? I can imagine to play some fire effects if a part\u0026#39;s temperature is above some threshold. And as long as the fire effects are played you add more heat energy to the part. KSP\u0026#39;s heat system will distribute the heat to neighboring parts and eventually everything will be on fire until it\u0026#39;s destroyed by overheating.\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-11-25T12:15:57Z","Content":"\nModuleResourceConverter together with ModuleCoreHeat can simulate a fire, I just haven\u0026#39;t figured out the right variables yet. I asked[URL=\u0022http://forum.kerbalspaceprogram.com/threads/140273-Core-temperature-modifiers-is-there-a-detailed-explanation\u0022] in this topic[/URL] if someone knows the right ones but thus far no reply.\n"}]}