{"TopicId":135552,"ForumId":20,"TopicTitle":"[Request] Space Traffic Control Module!","CreatedByName":"blorgon","CreatedById":159569,"CreatedDateTime":"2016-03-31T18:41:35Z","PageNum":1,"Articles":[{"CreatedByName":"blorgon","CreatedById":159569,"CreatedDateTime":"2016-03-31T18:41:36Z","Content":"\n\u003Cp\u003E\nWould anybody else be interested in a Space Traffic Control module for space stations? It should have support for 6-12 Kerbals, could act as a RemoteTech command station (possibly with a long-range integrated omni like KSC, but appropriately lower-power), and have multiple viewing ports for watching docking events.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m currently designing my first space station, and I use Near Future\u0027s PPD-1 Heavy Command Module that seats 6 and can be used as a command station to control probes even without line of sight to KSC. The purpose of my station will be long term habitation, long-term science research, short-term science experiment delivery to the Kerbin surface, and an interplanetary space port with a large fuel tanker dock and large interplanetary ship dock.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s what I\u0027m thinking it could look like, but obviously I\u0027d like a single part that is also specifically designed for orbit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/dfCDJEjh.jpg\u0022 alt=\u0022dfCDJEjh.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-03-31T22:36:14Z","Content":"\n\u003Cp\u003E\nInteresting concept, I would have use for such a module.\n\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2016-04-01T04:03:27Z","Content":"\n\u003Cp\u003E\ncould probably just weld two of those together in part config... does it have IVA?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-01T04:04:20Z\u0022 title=\u002204/01/2016 04:04  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 1, 2016\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2016-04-01T04:14:30Z","Content":"\n\u003Cp\u003E\nThe NF spacecraft does have an IVA, but the large pod is -mostly- non functional. Only for show/placeholder. But, it\u0027s a custom placeholder. The smaller 2 man pod has a more functional IVA.\n\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2016-04-01T04:24:40Z","Content":"\n\u003Cp\u003E\nhm... would be fairly easy without IVA. simple part config would do the trick. IVA is more difficult\n\u003C/p\u003E\n"},{"CreatedByName":"blorgon","CreatedById":159569,"CreatedDateTime":"2016-04-01T05:15:41Z","Content":"\n\u003Cp\u003E\nWell, what I was thinking is that it\u0027d be neat to have an actual (basic) space traffic control mechanic in the game, where there would be a dedicated console inside the control tower for each docking port you have on the station and the console would have a screen connected to the docking camera of an approaching vessel. Kerbals could guide incoming unmanned cargo or refueling tankers to the station and you could do this all IVA at a well designed console like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oJREcbi.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/oJREcbi.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nwhile being able to look out the window while you work!\n\u003C/p\u003E\n\u003Cp\u003E\nYou could have a telemetry feed in the console for the craft you\u0027re controlling, and then of course the main display would be the feed from the approaching craft\u0027s docking camera as it sees the station. I think it\u0027d be a fun mechanic that would add quite a lot to the game.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternatively, you could just have the one console, since (unless multiplayer becomes a thing) you\u0027d only be able to work at any one console at a time. That way, you could use something like mod\u002B[ ] to switch spacecraft while staying at the console. It\u0027d be quite a challenge to control a lot of traffic, just like how real air traffic control works, where an operator is responsible for a handful of planes, and dictates instructions to a plane, and then switches to another plane and dictates instructions, constantly switching back and forth until the planes are on the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nIdeally, you\u0027d probably only be able to take control at the console once you\u0027re on approach (within 5km, and under 100m/s relative), otherwise, the control tower would act like a normal command station in the way RemoteTech works, where you\u0027re controlling the craft from the command station, but the camera is focused on the payload (which I think is kind of lame, honestly. I\u0027d much rather fly unmanned craft from an orbital station or from KSC Mission Control with a real map view on the big screen and all your telemetry on a console in front of you). I feel like unless you\u0027re taking screenshots, or just admiring your own work, you should pretty much always fly IVA, but that\u0027s just personal.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-01T05:31:49Z\u0022 title=\u002204/01/2016 05:31  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 1, 2016\u003C/time\u003E by blorgon\u003C/strong\u003E\n\u003C/span\u003E\n"}]}