{"TopicId":136014,"ForumId":20,"TopicTitle":"[Request] Mid-point attachment nodes","CreatedByName":"Kerbin Von Braun","CreatedById":67234,"CreatedDateTime":"2016-04-04T04:46:24Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbin Von Braun","CreatedById":67234,"CreatedDateTime":"2016-04-04T04:46:24Z","Content":"\n\u003Cp\u003E\nThe gist of it is this, a mod that added support for surface attachment nodes (the green bits you snap to) at the midpoint of certain parts, like the orange fuel tank, would make life a lot easier.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen designing large-scale landers for lunar bases for example, I\u0027ve found that being able to land a horizontal tube is much easier than a vertical tower. However, getting the placement of all the parts to be symmetrical so the craft is stable as the fuel burns is... challenging, to say the least. Having a tool to place surface attachment snap-to nodes at midpoints of certain parts would make that a lot easier, and I assume that any mod capable of that would lead to fantastic build flexibility that could lead to all sorts of new and different community creations. Off the top of my head I imagine this would be useful for large rovers and surface base components as well.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, thoughts? Opinions? Anyone like that idea or have any clue how to pull it off? (And would it be foolish to dream of being able to one day place things offset from the CG by a specific # of meters?)\n\u003C/p\u003E\n"},{"CreatedByName":"blorgon","CreatedById":159569,"CreatedDateTime":"2016-04-04T04:55:19Z","Content":"\n\u003Cp\u003E\nHave you ever heard of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/127378-editor-extensions-redux-301-released-with-selectroot-merge/#comment-2314915\u0022\u003EEditor Extensions\u003C/a\u003E? It allows you to not only add perfect struts to your crafts, but also surface attach anything (as long as it\u0027s able) and then center it on the part vertically, and also horizontally (as well as go up to 20-part symmetry!).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-04T04:55:30Z\u0022 title=\u002204/04/2016 04:55  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 4, 2016\u003C/time\u003E by blorgon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kerbin Von Braun","CreatedById":67234,"CreatedDateTime":"2016-04-04T17:32:39Z","Content":"\n\u003Cp\u003E\nNo I hadn\u0027t, thanks! Sounds like someone already made what I wanted XD. Here I was thinking I\u0027d checked too...\n\u003C/p\u003E\n"}]}