{"TopicId":138574,"ForumId":20,"TopicTitle":"The New Landing Gear System","CreatedByName":"njmksr","CreatedById":114236,"CreatedDateTime":"2016-04-30T18:20:40Z","PageNum":1,"Articles":[{"CreatedByName":"njmksr","CreatedById":114236,"CreatedDateTime":"2016-04-30T18:20:40Z","Content":"\n\u003Cp\u003E\nHey everybody!\n\u003C/p\u003E\n\u003Cp\u003E\nI may be a little late to the party in asking this question, but does anybody know how to use the new landing gear .cfg module?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2016-04-30T19:46:45Z","Content":"\n\u003Cp\u003E\nnjmksr,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m still puzzling it out as I go.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n        name = ModuleWheelBase\u003Cbr\u003E\n        radius = n.n The collision mesh wheel\u0027s radius in m\u003Cbr\u003E\n        center = x,y,z Where the force of the wheel is applied in relation to the wheel itself.\u003Cbr\u003E\n        mass = n.n The amount of sprung mass used in the suspension. units unknown.\u003Cbr\u003E\n        groundHeightOffset = n.n Presumably in meters, but I have had no luck playing with this value.\u003Cbr\u003E\n        frictionSharpness = n.n I dunno.\u003Cbr\u003E\u003Cbr\u003E\n        name = ModuleWheelSuspension\u003Cbr\u003E\n        suspensionDistance = n.n The amount of travel from fully extended to fully compressed in meters.\u003Cbr\u003E\n        suspensionOffset = n.n Not exactly sure, but it\u0027s in meters and affects where the wheel \u0022lives\u0022 in relation to the surface. Negative values raise the wheel.\u003Cbr\u003E\n        targetPosition = n.n Where the wheel, as drawn, resides in it\u0027s travel. 0 is fully extended, 1 is fully compressed.\u003Cbr\u003E\n        springRatio = n.n The tightness of the spring, units unknown. It affects how rapidly the wheel moves in response to shocks. Too low causes sluggish behavior and banging into the suspension stops. Too high causes phantom forces, skittering, and terrain collisions.\u003Cbr\u003E\n        damperRatio = The drag created by movement. 0 is completely undamped, while 1 is critically damped. Exceeding 1 causes oscillations.\u003Cbr\u003E\n        boostRatio = I have no idea.\n\u003C/p\u003E\n\u003Cp\u003E\nThe simulation figures out how much mass is resting on the suspension, then adjusts the spring tension so that it will rest where we want it to. Then it turns up the damper based on the spring value.\u003Cbr\u003E\n        \u003Cbr\u003E\nThe values in the damage module seem to work backwards from how I expected. The higher the number, the lower the threshold for damage.\n\u003C/p\u003E\n\u003Cp\u003E\nHTHs,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-30T19:49:53Z\u0022 title=\u002204/30/2016 07:49  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 30, 2016\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2016-04-30T20:10:56Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003Ecenter \u003C/strong\u003Eshifts wheelCollider from the position in the MU. can be used to adjust the wheel without reexporting, best left to default of 0,0,0\u003Cbr\u003E\u003Cstrong\u003EgroundHeightOffset \u003C/strong\u003Esets spawn height, basically replaces the Bounds collider from earlier WheelModule. only used when vessel is initially spawned from VAB/SPH\u003Cbr\u003E\u003Cstrong\u003EforceSharpness\u003C/strong\u003E I think this determines how quickly full friction forces act on the vehicle. Higher increases responsiveness overall. Too low a value makes it very mushy; too high a value makes wheels jitter continuously. Defaults 10; I find values between 10~20 is decent. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EsuspensionDistance, \u003C/strong\u003Eheight of actual suspension, \u003Ca href=\u0022http://i.imgur.com/E9kYjaO.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/E9kYjaO.jpg\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EsuspensionOffset\u003C/strong\u003E moves suspensionTransform up/down the suspension vector. e.g. you set suspensionDistance to 1m; targetPosition to 1; and suspensionOffset to -1; this in effect sets suspensionTransform to move between 0 to -1 relative to suspension vector\u0027s origin. This only affects the suspensionTransform\u0027s position, not the actual suspenion interaction with terrain or other objects, actual suspension will still be between 0 to 1m from terrain. pics: \u003Ca href=\u0022http://i.imgur.com/DPHxpvf.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/DPHxpvf.jpg\u003C/a\u003E\u003Cbr\u003E\u003Cstrong\u003EtargetPosition\u003C/strong\u003E is where the wheelCollider will try to position suspensionTransform. 0 is fully compressed, 1 is fully extended. This is inverted from Unity\u0027s WheelCollider. Wheels generally sit around 0.5; Lander Legs sit around 1. Setting this to 0 is functionally same as setting \u003Cstrong\u003EsuspensionDistance = 0\u003Cbr\u003E\nspringRatio\u003C/strong\u003E adjusts how much mass the suspension can support. Since there\u0027s dynamic adjustment and tweakable sliders in game, this will take a lot of testing for each wheel you make. Higher supports more mass, but can shoot vehicle into the air on unpack when wheelCollider becomes active. My guess is units are in kN from observing behavior in game.\u003Cbr\u003E\u003Cstrong\u003EdamperRatio \u003C/strong\u003Eadjusts force opposing oscillation due to springRatio force. 10% to 50% of springRatio value is good starting point. takes trial and error for each wheel part.\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EgroundHeightOffset\u003C/strong\u003E video \u003Ca href=\u0022https://www.youtube.com/watch?v=OunIHXUWfoE\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=OunIHXUWfoE\u003C/a\u003E\u003Cbr\u003E\u003Cstrong\u003EwheelClip detection\u003C/strong\u003E video \u003Ca href=\u0022https://www.youtube.com/watch?v=E9lZD3OemrM\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=E9lZD3OemrM\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBig thread with lots of info on the new wheel modules.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/135250-landing-legs-in-11/\u0026amp;do=embed\u0026amp;page=6\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-02T15:17:03Z\u0022 title=\u002205/02/2016 03:17  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 2, 2016\u003C/time\u003E by nli2work\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Markarian421","CreatedById":57423,"CreatedDateTime":"2016-05-01T00:41:04Z","Content":"\n\u003Cp\u003E\nboostRatio seems responsible for some of the strange behavior.  I\u0027ve been trying to scale up the LT-1 legs, and it appears I need to adjust:\n\u003C/p\u003E\n\u003Cp\u003E\ngroundHeightOffset (to keep it from shooting into the air)\n\u003C/p\u003E\n\u003Cp\u003E\nspringRatio (to hold up more mass)\n\u003C/p\u003E\n\u003Cp\u003E\nand then damperRatio and boostRatio to try and get things back under control with the suspension once I\u0027ve upped springRatio.  The boostRatio parameter almost seems like a \u0022superball\u0022 adjustment -- I cranked it up on one try, and the legs would bounce higher with each landing.  In general I\u0027m finding I need to reduce both damperRatio and boostRatio to keep larger landing gear stable.\n\u003C/p\u003E\n"}]}