{"TopicId":142564,"ForumId":20,"TopicTitle":"RO engine thrust limit","CreatedByName":"archenemy_6","CreatedById":160281,"CreatedDateTime":"2016-06-27T00:02:08Z","PageNum":1,"Articles":[{"CreatedByName":"archenemy_6","CreatedById":160281,"CreatedDateTime":"2016-06-27T00:02:08Z","Content":"\n\u003Cp\u003E\nI started a \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E with RP-0 career a while back and immediately noticed that all the liquid fueled engines would have an abrupt cut off right at about 4.08 \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E. I thought it might be a part of one of the mods I had installed so I usually got around it by making clusters of 5 engines and shutting off 2 at a time. It usually let me use all of the fuel in a stage. \n\u003C/p\u003E\n\u003Cp\u003E\nSo yesterday I was playing most of the day when things just started to go wrong. Every simulation I\u0027d run the rocket would take off and slowly drift sideways and then get ripped apart like it was under a lot of aerodynamic stress. After a few reloads my Kerbal construction time upgrades had reset and it showed I had -56 upgrades available. So I decided to reinstall everything.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter I get a new game working I notice that the thrust limit is gone and rockets will accelerate far beyond that limit. \n\u003C/p\u003E\n\u003Cp\u003E\nIs there supposed to be a limit in \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E or one of the mods or was I just playing with a broken game the whole time?\n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2016-06-27T02:30:05Z","Content":"\n\u003Cp\u003E\nBroken game.\n\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2016-06-28T03:53:58Z","Content":"\n\u003Cp\u003E\nYep, broken install. Make sure you\u0027re on 1.1.2 and you don\u0027t have Tweakscale installed.\n\u003C/p\u003E\n"}]}