{"TopicId":143936,"ForumId":20,"TopicTitle":"KAS Functionality on a larger scale","CreatedByName":"jonrd463","CreatedById":116868,"CreatedDateTime":"2016-07-16T14:32:02Z","PageNum":1,"Articles":[{"CreatedByName":"jonrd463","CreatedById":116868,"CreatedDateTime":"2016-07-16T14:32:02Z","Content":"\n\u003Cp\u003E\nThis is just an idea I had while doing some EVA \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E work on my station earlier. I\u0027m not a modder myself, but I figured I\u0027d toss this out there as an idea.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E allows us to take smaller parts and make them a part of larger parts. As far as I know, it\u0027s not related to docking or anything like that. Frankly, I have no idea what voodoo Kospy came up with to make it work, but those of us who swear by it can attest to how much it adds to gameplay. Anyway, one of the problems of on-orbit assembly is dock lag. It seems like the more parts you have docked together, the more it lags. I\u0027ve tested this myself by making two assemblies-- one made up of segments docked to eachother, and the other using the same amount of segments, but node or radially attached together in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E and sent to orbit with Hyperedit. The one assembled all together was significantly less laggy than the one docked. \n\u003C/p\u003E\n\u003Cp\u003E\nNow \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E got me thinking... Would it be possible to take that same functionality and scale it up? Rather than, for instance, an engineer with a wrench, you had an engineer piloting a \u0022placement craft\u0022, that would then assemble parts together in orbit? I know large parts can be \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E attached with a team of engineers, so it\u0027s possible in theory. In order to avoid out-right replacement of docking, limitations could be put into place, i.e. making placement permanent, or perhaps a limit of 3 placements in order to tweak positioning. \n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know if this would alleviate docking lag or not, but I thought I\u0027d at least open the concept up for discussion.  \n\u003C/p\u003E\n"}]}