{"TopicId":144642,"ForumId":20,"TopicTitle":"Getting started with MKS","CreatedByName":"ruiluth","CreatedById":60427,"CreatedDateTime":"2016-07-27T01:27:54Z","PageNum":1,"Articles":[{"CreatedByName":"ruiluth","CreatedById":60427,"CreatedDateTime":"2016-07-27T01:27:54Z","Content":"\n\u003Cp\u003E\nIn my most recent career save I\u0027ve explored Eve, Duna, and Dres with probes and I have flotillas on the way to Jool and Eeloo to explore them. Since they\u0027re not due for another 2 years, I figured I\u0027d send a manned ship to Duna to start a base there. I decided to make a multipurpose space ship rather than just a one-use rocket for the mission, so I built a pretty self-sufficient ship that should be able to house and feed four kerbals comfortably for a few years, with a modular nuclear drive section.\n\u003C/p\u003E\n\u003Cp\u003E\nWith that in place, I decided I wanted to make bases on Minmus and Duna for replenishment for the first ship in a future fleet of interplanetary ships, but I haven\u0027t really looked at MKS much and it\u0027s looking to be much more difficult than it seemed at first. My plan was to send a robotic base at first to start harvesting resources and at least have all the infrastructure there so that when the crew arrived they\u0027d have everything they needed to supply themselves with food and power. However, since I realized that all the converters need machinery to function, it seems like I would either need to send huge supply ships very frequently or set up large surface manufacturing plants that use technology I haven\u0027t unlocked yet.\n\u003C/p\u003E\n\u003Cp\u003E\nHow do you all usually start with MKS? Is it necessary to set up giant supply chains or send shipments all the time, or am I just overestimating how much machinery they\u0027ll use?\n\u003C/p\u003E\n\u003Cp\u003E\nPictures would be appreciated, since I\u0027m also a little unclear about how to assemble all these parts.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-27T01:53:57Z\u0022 title=\u002207/27/2016 01:53  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 27, 2016\u003C/time\u003E by ruiluth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2016-07-27T16:06:15Z","Content":"\n\u003Cp\u003E\nYou\u0027re overestimating a bit - machinery gets used very slowly, especially by purely robotic bases.  (Which don\u0027t produce at full production rate.)  A small amount of machinery will get you a long way.  However MKS is designed to need occasional shipments in, with them reducing over time.  Duna is not Kerbin, and you need stuff from home to live.  \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d set up on Minmus first and get a feel for things - you can make mistakes and only have it cost a few days to send up a Kontainer to fix things.\n\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2016-07-27T19:03:09Z","Content":"\n\u003Cp\u003E\nWhat \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/155685-dstaal/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022155685\u0022 href=\u0022%7B___base_url___%7D/index.php?/profile/155685-dstaal/\u0022 rel=\u0022\u0022\u003E@DStaal\u003C/a\u003E said.\n\u003C/p\u003E\n\u003Cp\u003E\nFocus on life support first, and you will find it\u0027s pretty easy to get started.  Maybe drop off a few crates of machinery and you will be set for years.  In other words, think about how we\u0027d do a real colony effort... we would send lots of pre-placed stuff to support our colony until (way down the road) it could achieve a level of self sufficiency.\n\u003C/p\u003E\n"}]}