{"TopicId":145665,"ForumId":20,"TopicTitle":"Heat Production and Heat Transfer","CreatedByName":"theonegalen","CreatedById":71012,"CreatedDateTime":"2016-08-09T16:32:08Z","PageNum":1,"Articles":[{"CreatedByName":"theonegalen","CreatedById":71012,"CreatedDateTime":"2016-08-09T16:32:08Z","Content":"\n\u003Cp\u003E\nHi, I\u0027m building some warbird cockpits and messing around with WEP and temperature gauges and the like, I\u0027d like to get the AirplanePlus engines to overheat. Unfortunately, all the heat transfers straight into the cockpit behind the engine, which then makes the cockpit explode. Is there a good way to keep the overheating to the engine itself in a way that doesn\u0027t break? What I\u0027d like to do is create a requirement for a radiator part (probably using the old radial intake model) for the liquid-cooled engines.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-09T16:32:27Z\u0022 title=\u002208/09/2016 04:32  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 9, 2016\u003C/time\u003E by theonegalen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sebi.zzr","CreatedById":81294,"CreatedDateTime":"2016-08-09T17:50:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222710851\u0022 data-ipsquote-contentid=\u0022145665\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221470760328\u0022 data-ipsquote-userid=\u002271012\u0022 data-ipsquote-username=\u0022theonegalen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, theonegalen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there a good way to keep the overheating to the engine itself\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMaybe adding these line to engines .cfg will solve your problem.\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003EheatConductivity = 0.06 //lower the number,less heat get transferred to neighbour part\nradiatorMax = 0.5 //how much can part be cooled\nemissiveConstant = 0.85 //how much heat is radiated from part iself \u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-08-10T08:55:37Z","Content":"\n\u003Cp\u003E\nHeat conductivity between parts is split into two separate flows:\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n1.) Internal \u0026lt;-\u0026gt; internal conduction. The transfer amount for any given temperature differential depends on four things: the heatConductivity of the source part, the heatConductivity of the destination part, the bulkheadProfiles of the source part, and the bulkheadProfiles of the destination part.\n\u003C/p\u003E\n\u003Cp\u003E\nheatConductivity defaults to 0.12, lower conducts less. bulkheadProfiles is not a number, but rather a specific setting, such as \u0022size1\u0022 or \u0022surf\u0022. A part can have multiple bulkheadProfiles, but usually only has one. The surface and size0 profiles are the smallest and conduct the least, while the size3 profile conducts the most.\n\u003C/p\u003E\n\u003Cp\u003E\nRecommended action: lower heatConductivity of the engine by an order of magnitude (so like 0.01).\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n2.) Skin \u0026lt;-\u0026gt; skin conduction. This is often forgotten, but if the skin of a part is hot, it will most definitely leak into the skin of attached parts. The transfer amount for any given temperature differential depends on two things: the skinSkinConductionMult field for source and destination. This is a multiplier, so it defaults to 1.0, and lowering will lower conductivity.\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally, there exists a field called skinInternalConductionMult. This does not do anything for conduction between parts, but rather governs conduction within a part. Because heat can conduct between internals and the skin, it means that if you don\u0027t seal of both internal conduction and skin conduction between parts, heat will still find its way around.\n\u003C/p\u003E\n\u003Cp\u003E\nRecommended action: lower skinSkinConductionMult of the engine by an order of magnitude (so like 0.1). This field isn\u0027t in any config files by default, so you have to add it yourself. It goes directly into the PART node, like heatConductivity.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWith those two steps, you should be able to isolate the engine and trap the heat it creates within itself. That heat creation, in turn, can also be tweaked via the relevant field in ModuleEnginesFX.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-10T08:57:20Z\u0022 title=\u002208/10/2016 08:57  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 10, 2016\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"}]}