{"TopicId":148954,"ForumId":20,"TopicTitle":"Mod Idea: Counter Mass Drive (Advanced Electrical Part)","CreatedByName":"Dewar","CreatedById":107737,"CreatedDateTime":"2016-09-29T19:02:13Z","PageNum":1,"Articles":[{"CreatedByName":"Dewar","CreatedById":107737,"CreatedDateTime":"2016-09-29T19:02:13Z","Content":"\n\u003Cp\u003E\nMy idea is for a single modded part that could significantly change endgame play: the Counter Mass Drive ( or CM Drive for short).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0026lt;From Google\u0026gt;\n\u003C/p\u003E\n\u003Cp\u003E\nWhat is negative mass?\n\u003C/p\u003E\n\u003Cp\u003E\nNegative mass is the hypothetical idea that matter can exist with mass of the opposite sign to the ordinary stuff. Instead of 2 kg, a lump of negative mass would be -2 kg. Nobody knows whether negative mass can exist but there have nevertheless been plenty of analyses to determine its properties.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBelow is a mockup using my pathetic Microsoft paint skills:\u003Cbr\u003E\u003Cimg alt=\u0022CM_Drive.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://s22.postimg.org/fejwnz3s1/CM_Drive.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe basic parameters of the modded part involved would be:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBe able to extend a counter mass field around the ship (via a UI pop-up with tweakables i.e. radius/length)\n\u003C/li\u003E\n\u003Cli\u003E\nObjects inside of the field need their mass reduced to .001 or equivalent/all engines affected by the field should have their thrust reduced to 0 (an engine uses mass to propel itself forward, if said mass is within the field it shouldn\u0027t have the ability to produce thrust)\n\u003C/li\u003E\n\u003Cli\u003E\nPower usage should be extremely high and variable to the size of the field or negative mass needed (I.e. heavier objects need more power to reduce the weight)\n\u003C/li\u003E\n\u003Cli\u003E\nThe weight of the drive itself should be quite considerable, perhaps 14 tons or more\n\u003C/li\u003E\n\u003Cli\u003E\nAtmospheric Usage should not be allowed or cost ridiculously more power (perhaps 10x or equivalent to make for interesting gameplay)\n\u003C/li\u003E\n\u003Cli\u003E\nIt should unlock under the last tech node of electrical (I always felt something other than the 2.5m battery was needed there)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nImagine a ship with one of these installed orbiting kerbin; while turned off, mechjeb is telling you that you have a measly \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of 0.13, 280 ∆v, and total vessel mass of 45 tons.  You switch the drive on and your power supplies start to sap down as the field extends around your ship. You watch as the mechjeb numbers change, a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of 8, 12000 ∆v, and total vessel mass of 2.5 (the exact weight of the solar panels and engine that extend beyond the field.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously this would need a lot of tweaking for balance, as this could easily be a completely overpowered part.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: An afterthought I had was that perhaps the field could simply reduce the mass by whatever percentage (80% of total mass for example) is deaned acceptable for balanced gameplay.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut I think this could make for some very interesting gameplay as, unlike an alcubierre drive, this still utilizes rocket motor engines. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlas, I\u0027m not a modder. So for now I\u0027ll leave the concept here and hope that somebody, with more skills and knowhow than I, will pick this up.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m more than happy to spitball ideas and lend whatever help I can to any modders interested in the project.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for reading\n\u003C/p\u003E\n\u003Cp\u003E\n- Dewar\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-29T19:28:27Z\u0022 title=\u002209/29/2016 07:28  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 29, 2016\u003C/time\u003E by Dewar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-09-29T20:18:19Z","Content":"\n\u003Cp\u003E\nThis is pretty much the core concept, and the source of the name, of the Mass Effect series of games. In their lore, humanity attained interstellar travel by discovering ancient jump gates that projected fields around starships that reduced their mass to near-nothing. This allowed incredible acceleration, and even removed the speed of light as a universal limit (somehow, I forget). Humanity later discovered and joined a galactic collective of sentient races that know how to build this technology and apply it to many different engineering problems.\n\u003C/p\u003E\n"},{"CreatedByName":"Dewar","CreatedById":107737,"CreatedDateTime":"2016-09-29T23:09:36Z","Content":"\n\u003Cp\u003E\nBelieve it or not I\u0027ve never played any of the mass effect games. I had the idea for this after reading the odyssey one novel series.\n\u003C/p\u003E\n\u003Cp\u003E\nSounds like some interesting lore though.\n\u003C/p\u003E\n"},{"CreatedByName":"Sresk","CreatedById":167879,"CreatedDateTime":"2016-09-30T03:08:20Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure how to go about modding this but a simpler way of implementing it would be to treat it like an inline procedural fairing or decoupler. Everthing inside the fairing or above the mass coupler gets edited.\n\u003C/p\u003E\n"},{"CreatedByName":"Dewar","CreatedById":107737,"CreatedDateTime":"2016-09-30T03:14:23Z","Content":"\n\u003Cp\u003E\nI was thinking exactly along the same lines and will attempt to design a part that will do just that. But as mentioned, I\u0027m a newb to modding.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a side note, I\u0027ve just dove into modding ksp tonight. The system squad designed is much more intuitive than I thought. I\u0027m currently adding the resource gold, a highly valuable resource found on most planets in tiny amounts. Also editing some storage tanks and drills for a semi-early on way to make early game money. I figure if you can get 10 tons of it back from minmus you deserve the million it\u0027ll give you.\n\u003C/p\u003E\n"}]}