{"TopicId":149756,"ForumId":20,"TopicTitle":"Disabling mods temporarily","CreatedByName":"Bandus","CreatedById":8358,"CreatedDateTime":"2016-10-12T06:32:55Z","PageNum":1,"Articles":[{"CreatedByName":"Bandus","CreatedById":8358,"CreatedDateTime":"2016-10-12T06:32:55Z","Content":"\n\u003Cp\u003E\nApologies is this is a well known thing, but, I am curious if it is possible to somehow temporarily disables mods (as opposed to removing them entirely). I\u0027d like to remove them so I can play KSP without having to wait for all the mods I have installed to be updated. Is there a simple way to do this?\n\u003C/p\u003E\n"},{"CreatedByName":"BlackHat","CreatedById":138278,"CreatedDateTime":"2016-10-12T06:58:59Z","Content":"\n\u003Cp\u003E\nNot really. The easiest thing to do is create 2 versions of the game (I assume your playing on Steam?)\n\u003C/p\u003E\n\u003Cp\u003E\nSelect your original root game folder with all the mods installed (outdated and updated) that you don\u0027t want to play due to the out dated mods.\n\u003C/p\u003E\n\u003Cp\u003E\nCopy that entire game folder \u0022KSP_win\u0022 (or whatever you have it named) and paste it in your current folder. \u0022Ksp_win-copy\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nDelete all the folders in the Mods directory except \u0022Squad\u0022 and start a NEW game playing using the KSP.exe in THIS folder. (Your saves will probably NOT work.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIF your not on Steam, just download the 1.2 from KSP site and again Create a second version of the game. (Do NOT overwrite your first version) (ie name its folder \u0022KSP Unmoded\u0022) and play using its KSP.exe\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-10-12T07:08:47Z","Content":"\n\u003Cp\u003E\nYou can also use AutoPruner (look up the forum thread here) to \u0022prune\u0022 all files in a mod folder of your choice, so they don\u0027t get loaded. This is done by changing the file extensions, and is completely reversible via a single command.\n\u003C/p\u003E\n"},{"CreatedByName":"genericeventhandler","CreatedById":149557,"CreatedDateTime":"2016-10-12T13:36:39Z","Content":"\n\u003Cp\u003E\nif you remove a parts mod that is used on one of your active craft, you lose the craft and the kerbals inside. \n\u003C/p\u003E\n\u003Cp\u003E\nfor info, I always play from a copy of the steam install folder, because I don\u0027t want steam updating my game while I am in the middle of a career and deleting all my ships.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}