{"TopicId":152875,"ForumId":20,"TopicTitle":"KW Rocketry Engine Performance \u0026amp; Price and a question","CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2016-12-02T05:28:19Z","PageNum":1,"Articles":[{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2016-12-02T05:28:19Z","Content":"\n\u003Cp\u003E\nFirst, just to have it said: KW-Rocketry is one of my 3 go-to packs so this is not meant as whining over KWR. However there is one thing that always kinda nagged me and that is, the KW engines seem to replace the stock engines completely. What I mean is:\n\u003C/p\u003E\n\u003Cp\u003E\nTake the stock T-45 and the KW WildCat V.\n\u003C/p\u003E\n\u003Cp\u003E\nThey cost the same and have the same mass but the WC-V outclasses the T-45 in Isp and thrust. With the KW pack there is no longer any reason to use the old 45. when cost vs performance is concidered.\n\u003C/p\u003E\n\u003Cp\u003E\nI was wondering: Is there a way for someone not familiar with these things to adjust the price for the KW parts to reflect the better performance?\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-12-02T09:19:48Z","Content":"\n\u003Cp\u003E\nYou could talk to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129964-linuxgurugamer/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022129964\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/129964-linuxgurugamer/\u0022 rel=\u0022\u0022\u003E@linuxgurugamer\u003C/a\u003E, who maintained the community patch for KW Rocketry the last time I checked.\n\u003C/p\u003E\n"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2016-12-02T11:26:06Z","Content":"\n\u003Cp\u003E\nKW is a must-have for me as well. How about the mod ModuleManager to tweak the cfg-files, to fill the gap between 600 and 1400 kerbalkilonewtons and to tweak the WildCat ...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2016-12-02T12:01:12Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Comparison_of_orbital_rocket_engines\u0022 rel=\u0022external nofollow\u0022\u003EAs you can see\u003C/a\u003E, IRL 1.5t-heavy engines usually have ~4-5 greater thrust than in KSP, ~800 kN rather than 200.\n\u003C/p\u003E\n\u003Cp\u003E\nAs the Kerbin orbital speed (2.6 km/s) is 3 times less than IRL, a rocket made of parts with IRL values would be overpowered, so KSP engines have much worse parameters than IRL.\u003Cbr\u003E\nSo, different developers treat \u0022enough worse\u0022 like different values. KW worse is better worse than a stock worse.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbals can\u0027t into engines, \u0022stupidity\u0022 value is not just 4lulz.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-02T12:04:55Z\u0022 title=\u002212/02/2016 12:04  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 2, 2016\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2016-12-02T12:12:38Z","Content":"\n\u003Cp\u003E\nFYI, there is a patch waiting for me to pull which makes a lot of adjustments.    It\u0027s a bit patch, and I\u0027ve been a bit busy, but I\u0027ll try to get to it this weekend.\n\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2016-12-02T12:43:04Z","Content":"\n\u003Cp\u003E\nFirst, thanks heaps for the replies and linuxgurugamer in particular. I was more than a bit hesitant to ask you directly as in my book, that would be like nagging you to change the mod which really isn\u0027t what I was after. I will keep my eyes open for any news on KWR.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for IRL, well that was never an issue. The entire point here was the comparison between stock and mod parts as I (and this is strictly a personal taste) would like to see more differentiating rather than replacement of stock parts. One way would be to adjust the price, another to adjust the stats, and another would be to move the parts up the tech tree to a later node. As I was thinking this would be a tweak for my own personal taste and use and I have no idea how to tweak any of this, I figured the price would be the easiest for me to tweak.\n\u003C/p\u003E\n\u003Cp\u003E\nI had a look in the part cfg but couldn\u0027t find any reference to the in-game price (1200 credits) and how to tweak ModuleManager is well beyond my skills and knowledge.\n\u003C/p\u003E\n"}]}