{"TopicId":156015,"ForumId":20,"TopicTitle":"Mod idea - Aperture Science Portal Device - Travel through portals!","CreatedByName":"Fireheart318","CreatedById":159932,"CreatedDateTime":"2017-02-05T02:40:19Z","PageNum":1,"Articles":[{"CreatedByName":"Fireheart318","CreatedById":159932,"CreatedDateTime":"2017-02-05T02:40:19Z","Content":"\n\u003Cp\u003E\nBasically, it\u0027s the Portal Gun from Portal. In Portal, the device exists in the form of a futuristic-looking gun that works by shooting a pair of portals onto surfaces coated in moon rocks (and the moon itself) to instantaneously transport information and matter across space. Only two portals can exist at a time (save for co-op multiplayer, which will be ignored) and work both ways.\n\u003C/p\u003E\n\u003Cp\u003E\nIn KSP, the portal device would exist as a large-ish part that could transport ships and their cargo (passengers, resources, momentum(?), across space to a duplicate of itself. To do this, both parts would require a large amount of electric charge, ore, and a way to refine it into fuel as well as a strong (green) connection to each other through CommNet (The two portals have to be able to communicate with each other and both have green signals. The signals can bounce as many times as needed but the route must stay green the entire way through). This would work only on bodies without an atmosphere, and in space. In order to function in-atmosphere, the portal part would need an airlock. Said airlock would be a deployable space made of \u0022hardlight\u0022 or some form of tarp (textures would be interchangable for people who don\u0027t like scifi. Then again, why would they be using a portal mod if they don\u0027t like scifi. Whatever.). A ship would need to fit inside the airlock, which would need an increasingly large amount of electric charge to hold open (because it\u0027s hardlight) the bigger it gets.\n\u003C/p\u003E\n\u003Cp\u003E\nBut what if you want to go somewhere else but you already have two portals set up? Easy, just switch the target location on the portal \u0022here\u0022 portal to the desired \u0022there\u0022 portal (all portals function as both \u0022here\u0022 and \u0022there\u0022 portals at the same time).\n\u003C/p\u003E\n\u003Cp\u003E\nWhy does it exist? It\u0027s a colonization mod that I just thought would be a cool thing. Unfortunatley, I have next to no skill and would probably grow bored of maintaining the mod quite quickly, if it ever became a thing in the first place. That\u0027s where you guys come in. Anyone and everyone can make this mod, I\u0027m simply bringing up the topic.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, that\u0027s everything I have to say. Bye!\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2017-02-05T03:32:10Z","Content":"\n\u003Cp\u003E\nFairly close, might do what you need to do:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/141205-12-esld-jump-beacons-revived-09/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-05T03:33:07Z\u0022 title=\u002202/05/2017 03:33  AM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 5, 2017\u003C/time\u003E by DStaal\u003C/strong\u003E\n\u003Cbr\u003ECurrent version of the mod.\n\u003C/span\u003E\n"},{"CreatedByName":"teensarlacc","CreatedById":191688,"CreatedDateTime":"2018-09-12T13:43:33Z","Content":"\n\u003Cp\u003E\nwill Wheatley be in orbit around the moon?\n\u003C/p\u003E\n"}]}