{"TopicId":158075,"ForumId":20,"TopicTitle":"Possible to lock Contract Weights via MM?","CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2017-03-22T20:58:07Z","PageNum":1,"Articles":[{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2017-03-22T20:58:07Z","Content":"\n\u003Cp\u003E\nAs the title says, I\u0027d like a way to lock in contract weights for various contract types. Is this possible? It would seem \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E does game-level changes as opposed to save level changes, I could be wrong though.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-03-23T08:23:03Z","Content":"\n\u003Cp\u003E\nYou can change the weighting behavior with \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E, but I\u0027m not sure if the current weights of individual contracts are even things that are accessible in config files. It might be something that only exists in the save file, which would mean that \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E can\u0027t touch it.\n\u003C/p\u003E\n\u003Cp\u003E\nLook into the contract definition file that Squad ships. Is there a field for weight? If yes, you can change it. If no, you probably can\u0027t.\n\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2017-03-23T20:44:49Z","Content":"\n\u003Cp\u003E\nI think I can change these lines in contracts.cfg\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003EWeightDefault = 30 // The default weight new contract types start with\n\tWeightMinimum = 10 // The minimum weight that contracts can have from declining them\n\tWeightMaximum = 90 // The maximum weight that contracts can have from accepting them\n\tWeightAcceptDelta = 12 // How much accepting contracts affects their weight\n\tWeightDeclineDelta = -8 // How much declining contracts affects their weight\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\nLeave weightdefault, and zero out the last two, then in the career save I should be able to make changes that will stick.\n\u003C/p\u003E\n"}]}