{"TopicId":160753,"ForumId":20,"TopicTitle":"TRUE Realism Overhaul!","CreatedByName":"Comet Tail","CreatedById":118211,"CreatedDateTime":"2017-05-17T23:31:15Z","PageNum":1,"Articles":[{"CreatedByName":"Comet Tail","CreatedById":118211,"CreatedDateTime":"2017-05-17T23:31:15Z","Content":"\n\u003Cp\u003E\nCertain members of the community, myself included, love Realism Overhaul. But even with all the amazing work done on that series of mods, there\u0027s one huge chunk of realism still missing from the game...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EThe amazing world of government contracting!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo here\u0027s the idea of what the mod would do:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EYou can choose to play as big, established companies like Lockheed Martin or Boeing\u003C/strong\u003E, with a brand-new amazing contract from NASA! With this option, you get to play as an executive. Meddle in your engineers\u0027 designs. Wait until they\u0027ve finished designing a rocket, then go tell them \u003Ca href=\u0022https://en.wikipedia.org/wiki/Atlas_V\u0022 rel=\u0022external nofollow\u0022\u003Eit needs to lift much more weight to orbit\u003C/a\u003E! And most of all, get as much sweet green money-juice out of that contract as possible, making your design as complicated as you can - right up to the point of cancellation! And when you\u0027ve done that, you can report every penny you\u0027ve pulled out of NASA to your investors!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOr you can play as a manager in NASA\u003C/strong\u003E. Remember, your Ion drives are completely necessary to go to Mars - after all, if they aren\u0027t, then you wouldn\u0027t get funding to keep working on them! Get real friendly and convince upper managers just how vital your Ion drives are for a manned mission to Mars. And whatever you do - don\u0027t go under budget, go over budget so that next quarter they\u0027ll really see how badly you need a bigger budget!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EYou can play as the head of NASA himself, as in the original game\u003C/strong\u003E. But this time you don\u0027t actually design your craft, you just contract most of it out, and watch as your contracts grow bigger and bigger! Have presidential candidates come over to your state and promise to do big things with NASA when they\u0027re out of office and have no power to live up to their words! Be amazed and actually regain some hope for humanity when small startups work 18-hours a day to actually stay within their originally contracted budget!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOr, you can play as one of the recent start-up private companies\u003C/strong\u003E. You can do what\u0027s absolutely impossible, and the disullisioned engineers elsewhere in the industry think what you\u0027re doing is impossible - but boy do you show them wrong! However, you have to work 18 hours a day to make this happen. If you spend any less than that, there\u0027s always a big line-up of people willing to take your place if you fall behind!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo how\u0027s that for a realism overhaul? \u003Cimg alt=\u0022:sticktongue:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 title=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(Disclaimer; I don\u0027t know of much executive meddling in actual designs, but I do know the Atlas V, or at least the Common Core Booster, was never intended to have \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u0027s attached, and when engineers were told to make it lift a lot more, this led to an odd non-symmetrical design. And I don\u0027t know much about the executive history of Ion Drive development - other than there have been proponents for it as a means of manned missions to Mars, which is kind of absurd, really, but you see a lot of \u0022let\u0027s all do our own thing and see if we can go to Mars with it\u0022 type of work at NASA nowadays, as opposed to the straightforward goal-oriented Apollo approach. Kind word for Ion drives, though; they really do have a place at least on unmanned missions.)\n\u003C/p\u003E\n\u003Cp\u003E\nEh, it probably comes off worst than I meant it, but it\u0027s just kind of a little joke at how much nicer our little Kerbal programs are than the real one. Don\u0027t get me wrong, I still love NASA, kinda eh on the United Launch Alliance, and SpaceX is amazing, but the real world is quite odd.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nBut in case that all came off as a bit too negative, here\u0027s a neat reminder that NASA\u0027s still doing awesome stuff, even outside of SpaceX contracting:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Space_Launch_System#SLS_mission_schedule\u0022 rel=\u0022external nofollow\u0022\u003ECheck out NASA\u0027s awesome flight schedule - they\u0027re planning to land a probe on Europa, and do a manned Lunar flyby as early as 2021-23!\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002214183111571418311330.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://sen.com/thumbs/1024x576/img/14183111571418311330.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Jas0n","CreatedById":57441,"CreatedDateTime":"2017-05-18T02:20:23Z","Content":"\n\u003Cp\u003E\nI feel like this sounds like a different game, where the focus is more on the economy and society aspects rather than rocket science. \n\u003C/p\u003E\n"},{"CreatedByName":"Comet Tail","CreatedById":118211,"CreatedDateTime":"2017-05-18T16:44:13Z","Content":"\n\u003Cp\u003E\nEh, it\u0027s largely satirical, just kind of poking fun at the real aerospace industry.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-18T16:51:29Z\u0022 title=\u002205/18/2017 04:51  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 18, 2017\u003C/time\u003E by Comet Tail\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-05-18T20:08:38Z","Content":"\n\u003Cp\u003E\nsounds like another game, like the other person said, but I would still get it\n\u003C/p\u003E\n"}]}