{"TopicId":160850,"ForumId":20,"TopicTitle":"Resourses and exraction","CreatedByName":"Provisional Name 12","CreatedById":158174,"CreatedDateTime":"2017-05-20T07:53:48Z","PageNum":1,"Articles":[{"CreatedByName":"Provisional Name 12","CreatedById":158174,"CreatedDateTime":"2017-05-20T07:53:48Z","Content":"\n\u003Cp\u003E\nHi, I am trying to plan a mission where I will send a modular space science lab to gilly/moho to collect a bunch of science from the biomes and analyze it. I have build a reasonable little K\u0026amp;K base, but I am trying to figure out what to do for supplies. I am most used to using the K\u0026amp;K way of making fertilizer with algae from ore, not through MKS with gypsum or minerals. Yet gilly has 0.1% ore and .4% gypsum and 1.4% minerals. I would like to know how to do the math here on how much I will receive for each to make enough fertilizer to keep it going. I am fine with making separate collection/conversion modules for each planet and I have included an algae converter just in case I have to send emergency shipments of ore, I would prefer not to though. How do you calculate the rates of drilling and generation for these products included in the community resource project? I know I can find the conversion rates of other stuff in the MKS documentation, but I do not know if the community resource pack works on the same rate as ore extraction from stock. Hell I don\u0027t even know if the drill rates of my non-stock parts factor into it (which they probably do). I am really confused as to how to approach this problem. I could just send ore resupplies, but that just seems like giving up, ya know? Is there anywhere I can find this info?\u003Cbr\u003E\u003Cbr\u003E\nAlso how does scan-sat detection cutoff factor in. I have cutoff really low on gilly for some items but really high on moho. Also I have .3% ore on moho but the map shows nothing. I am very confused about how this entire situation works.\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2017-05-20T15:25:58Z","Content":"\n\u003Cp\u003E\nOk, first off: You should mention which life support mod you\u0027re using.  From inference, I\u0027m guessing \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E-LS.  (And really, this question should therefore be asked over in that mod\u0027s thread, so you\u0027ll attract the attention of those who know about the mod.)\n\u003C/p\u003E\n\u003Cp\u003E\nNext: CRP (Community Resource Pack) resources work just like stock resources for the extraction mechanic - as they rely entirely on stock to do the work.  (The CRP just defines the resources, and KSP does the rest.)\n\u003C/p\u003E\n\u003Cp\u003E\nBeyond that... Honestly, I’m confused by your jumble of questions. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E  Slow down, think it through, and sort out what you need to know - quite often just doing that will help you figure out the answer, and even when it doesn\u0027t it helps others answer them.\n\u003C/p\u003E\n"},{"CreatedByName":"Provisional Name 12","CreatedById":158174,"CreatedDateTime":"2017-05-20T20:30:08Z","Content":"\n\u003Cp\u003E\nI am using usi LS and pretty much the whole \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E bundle.\u003Cbr\u003E\u003Cbr\u003E\nThank you, this answer on CRP answers most of my questions. As long as I know I can do the math along those lines I feel like I can engineer to this math. That said you are right I need to ask the \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E mod (mks I think) about my issue with drill rates. I might be able to find it out from the charts and info I have found on \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E, which has very supportive documentation.\n\u003C/p\u003E\n"}]}