{"TopicId":168418,"ForumId":20,"TopicTitle":"something to do with simple mods with tech tree","CreatedByName":"jevry","CreatedById":172487,"CreatedDateTime":"2017-12-10T13:52:04Z","PageNum":1,"Articles":[{"CreatedByName":"jevry","CreatedById":172487,"CreatedDateTime":"2017-12-10T13:52:04Z","Content":"\n\u003Cp\u003E\ni really don\u0027t know where to put this post so i will put it here for now i guess.\n\u003C/p\u003E\n\u003Cp\u003E\nas you probably noticed already i am typing this with a bit a small head-ache. my mind is kind of in a off-state...\n\u003C/p\u003E\n\u003Cp\u003E\nanyways: techtree balancing, i have been playing ksp a bit and one this that is always bothering is that the tech tree is absurdly bad. strategies as well but those you can ignore.\n\u003C/p\u003E\n\u003Cp\u003E\nmy main complaints is: no matter what you do you will end up spending all your tech points on radar and comms dishes because you dont need better rockets if you lose control over them if you get them really far\n\u003C/p\u003E\n\u003Cp\u003E\nsecondly, planes are too science expensive to ever use, i never use planes, ever. simply because i can get much farther using rockets instead.\n\u003C/p\u003E\n\u003Cp\u003E\nrandom parts. not counting the mini strut you start with and that minitarisation tech block the structural parts are probably the best placed ones\n\u003C/p\u003E\n\u003Cp\u003E\ni do not know why the devs decided to make it like this, and not fix it, ever... i mean c\u0027mon okay i heard something about loss of knowlege of the code but tech tree can be fixed easily.\n\u003C/p\u003E\n\u003Cp\u003E\nso what i am really browsing for (which constantly ends me up at ceti) is a stock tech tree balancer mod that is not ment to work with any mods, at all. because i don\u0027t want any mods, or empty tech nodes be they important for stock playtrough or not.\n\u003C/p\u003E\n\u003Cp\u003E\ni simply want a working tech tree. it is too much work and confusing to mod ksp imo. i can mod minecraft. but ksp, it boggles my mind. next to that i doubt my pc can handle 70 mods or so.\n\u003C/p\u003E\n\u003Cp\u003E\ni know likely isn\u0027t such balancer mod because not enough people want it.\n\u003C/p\u003E\n\u003Cp\u003E\nso i googled mod packs: appearently that is non-existant because it ruins portefolios and  breaks alot anyways since ksp updates and stuff. and again, my pc can\u0027t handle many mods, neither can my brain.\n\u003C/p\u003E\n\u003Cp\u003E\nso if anyone has a solution... you know...\n\u003C/p\u003E\n\u003Cp\u003E\nor if you agree that the modding situation is a little messy. i always enjoy people having the same opinion as i do...\n\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2017-12-10T14:04:18Z","Content":"\n\u003Cp\u003E\nI don\u0027t understand how you\u0027re confused by modding KSP.  They literally couldn\u0027t have made it easier.  You copy one folder into another folder.  Done.  I can\u0027t even fathom how you need it easier.\n\u003C/p\u003E\n\u003Cp\u003E\nI know there are several tech tree re-balancers out there that will work with the stock tech tree.  Unfortunately since I don\u0027t play career and rarely even play science, I don\u0027t have any experience with them.\n\u003C/p\u003E\n\u003Cp\u003E\nI also had a little trouble following your post.  Hopefully when your headache clears up you can clarify some things.\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2017-12-10T14:14:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223240203\u0022 data-ipsquote-contentid=\u0022168418\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221512913924\u0022 data-ipsquote-userid=\u0022172487\u0022 data-ipsquote-username=\u0022jevry\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, jevry said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nmy main complaints is: no matter what you do you will end up spending all your tech points on radar and comms dishes because you dont need better rockets if you lose control over them if you get them really far\n\u003C/p\u003E\n\u003Cp\u003E\nsecondly, planes are too science expensive to ever use, i never use planes, ever. simply because i can get much farther using rockets instead.\n\u003C/p\u003E\n\u003Cp\u003E\nrandom parts. not counting the mini strut you start with and that minitarisation tech block the structural parts are probably the best placed ones\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou don\u0027t actually need any comms tech if you just send Kerbals instead. You could completely skip that part of the tree if you felt like it.\n\u003C/p\u003E\n\u003Cp\u003E\nPlanes are an optional thing for people who like planes, again you can just skip them if you don\u0027t feel they are worth the investment. (Quite a few good parts in those nodes though that can be used for other things besides planes like liquid fuel tanks for nukes.)\n\u003C/p\u003E\n\u003Cp\u003E\nAlthough the Tech tree isn\u0027t perfect; it\u0027s designed to lead the player through a natural progression of building simple Kerbal manned rockets and then on to each new type of vehicle as they are more experienced. So although it may seem odd to have something like wheels or ladders higher up the tree than rocket engines; from a gameplay perspective, this is how you want to funnel new players along.\n\u003C/p\u003E\n\u003Cp\u003E\nSETI is really the only current, updated mod I know of that balances the tech tree more in favor of unmanned launches if that\u0027s what you are looking for?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-10T14:15:25Z\u0022 title=\u002212/10/2017 02:15  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 10, 2017\u003C/time\u003E by Rocket In My Pocket\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2017-12-10T15:38:33Z","Content":"\n\u003Cp\u003E\nI\u0027ve never used anything other than the stock tech tree, so I can\u0027t recommend any alternatives.  But even if there are others, that doesn\u0027t mean you\u0027ll be happy with them either.  It\u0027s very unlikely that somebody else is going to share your vision of what the tech tree should be.  It\u0027s very easy to move items from one technology to another, so why don\u0027t you considering customizing it just the way you want it.  All you have to do is install ModuleManager and write a .cfg file that changes the required technology for the parts that you want to move.  A sample cfg might look something like that below.  You just have to look up the names of the parts and technologies by looking through the existing .cfg files in the GameData/Squad/Parts/ folder.  After you\u0027re finished, just place the cfg anywhere inside the GameData folder.  The next time you start a career game, all the parts will be moved to the new techs.\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003E@PART[longAntenna]\n{\n\t@TechRequired = engineering101\n}\n\n@PART[mediumDishAntenna]\n{\n\t@TechRequired = precisionEngineering\n}\n\n@PART[commDish]\n{\n\t@TechRequired = automation\n}\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-12-10T16:50:45Z","Content":"\n\u003Cp\u003E\nGotta agree with the guys above. I thought the tech-tree was pretty well thought-out. Heavy rocket parts are on the top. So if you like manned rockets (like me), this will be your go-to zone. Unmanned, science-type stuff is on the bottom. So if you like sending probes, you\u0027ll concentrate here. These will be small anyway, so you won\u0027t need the big rockets. Branching off of these are the pods, landing gear, wheels, docking ports, and all the other things you\u0027ll eventually want and need. These are supposed to be tough decisions. When you\u0027re ready to open a node and you\u0027ve got 90 points to spend, that\u0027s a bit like having your last 10 bucks in your hand. You\u0027re not gonna spend it on just anything. You really need to think about it. I think the game does this well. There is stuff you want, and stuff you need, and some things that just look cool. You have to decide for yourself what\u0027s important.\n\u003C/p\u003E\n\u003Cp\u003E\nLeft unsaid, is the middle section of the tree. Therein lies the exotic land of the spaceplane parts. I usually save these for last since I\u0027m a rocket guy. When I saw your question about the Dart yesterday it made me smile because, although I\u0027ve got about 2,500 hours in, most of that was on a single career. I unlocked the tech-tree so long ago I forgot where things were. I just started a new career a few weeks ago and, after unlocking most of the rocket parts, I suddenly realized I didn\u0027t have the Dart. It took some searching to find it hidden with the spaceplane parts; high up in the tree. This was perplexing at first but, when I thought about it for a moment, it made sense. As a rocket guy, I think of it as a \u0022rocket part\u0022 because it\u0027s my preferred engine for Duna and Laythe landers. However, if you\u0027re a spaceplane guy, with its low profile and decent thrust, it probably makes a good \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E engine. The lack of gimbal would seem to make it tough to control, but I assume they use Vernors or something for stability. Who knows, though? Those spaceplane guys are a strange breed. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyway, they had to balance need and desire, and everyone\u0027s personal preferences; which is pretty tough. I think they did pretty well.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-10T16:53:05Z\u0022 title=\u002212/10/2017 04:53  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 10, 2017\u003C/time\u003E by Cpt Kerbalkrunch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2017-12-10T17:21:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223240366\u0022 data-ipsquote-contentid=\u0022168418\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221512924645\u0022 data-ipsquote-userid=\u0022175588\u0022 data-ipsquote-username=\u0022Cpt Kerbalkrunch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 minutes ago, Cpt Kerbalkrunch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI just started a new career a few weeks ago and, after unlocking most of the rocket parts, I suddenly realized I didn\u0027t have the Dart. It took some searching to find it hidden with the spaceplane parts; high up in the tree. This was perplexing at first but, when I thought about it for a moment, it made sense. As a rocket guy, I think of it as a \u0022rocket part\u0022 because it\u0027s my preferred engine for Duna and Laythe landers. However, if you\u0027re a spaceplane guy, with its low profile and decent thrust, it probably makes a good \u003Cabbr title=\u0022Vertical Take-Off and Landing\u0022\u003EVTOL\u003C/abbr\u003E engine. The lack of gimbal would seem to make it tough to control, but I assume they use Vernors or something for stability. Who knows, though? Those spaceplane guys are a strange breed. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think the intended use of the Dart is probably for a \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E.  The real advantage of an aerospike is that it gives good performance over a wide range of ambient air pressures, i.e. both sea level and vacuum.  This advantage isn\u0027t all that obvious in stock KSP because the delta-v requirement to get to orbit is so low - we\u0027re not really penalized much for using a different type of engine.  But in real life, where is takes three times as much delta-v to reach orbit, the advantage is more apparent.  An aerospike can burn from liftoff all the way to orbit while providing good \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E the entire way.  A bell nozzle can\u0027t do that - at some point during the ascent it\u0027s going to be performing suboptimally.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-12-10T21:50:47Z","Content":"\n\u003Cp\u003E\nLooks like this is going to end up being a discussion of modding the tech tree, and so the thread has been moved to the modding subforum. \n\u003C/p\u003E\n"},{"CreatedByName":"jevry","CreatedById":172487,"CreatedDateTime":"2017-12-10T22:57:33Z","Content":"\n\u003Cp\u003E\nfirst of all, thanks bananaman. also ohiobob. i will very likely take a look at those files and see if i cant make a few adjustment myself. but i\u0027l clarify a bit more.\n\u003C/p\u003E\n\u003Cp\u003E\ni understand a bit better now why the tech tree is made how it is. i guess i am a bit of a probe guy. since probes are much cheaper than big manned craft. and i care little for the surface samples. i just love sending a rover to minmus on a single max lvl \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003Esrb\u003C/abbr\u003E and an extra fuel tank for the needed oompf to get into orbit. and it is quite fun to be midway trough your game and have 3 mill in your back pocket incase you need all of it because for example you blew up a building \u0022by accident\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nhowever. it still doesn\u0027t justify the aerospace part of the tree. until you are halfway the nodes are litterally not worth the science. because what are you going to get from kerbin? everything starts fully scienced on your home planet!\n\u003C/p\u003E\n\u003Cp\u003E\nyou\u0027r not going to get that plane into space with rocket engines. besides, what use are wings in space? now you have massive wings and you can\u0027t earn jack science points with them.\n\u003C/p\u003E\n\u003Cp\u003E\npersonally i actually think the full aerodynamic tech tree should have a 30-50% science discount. that or move every node in that tree one space to the left putting them a tech tier lower.\n\u003C/p\u003E\n\u003Cp\u003E\nand one single node exists that bothers me even more. miniaturization. it does absolutely nothing is completely usseless and imo all the parts in that ndoe should be placed amoung other nodes and the node itself should be removed or replaced with actual usseless parts. in one of my older careers it was litterally the last thing i unlocked. the best thing from that node are useless. oh look a nice looking size counterfitter to make your rocket look pretty and earodynamic. exept there is no air in space. so you just wasted mass and space. personally if i want pretty i just cover those parts up with for example science experiments, actual usefull parts.\n\u003C/p\u003E\n\u003Cp\u003E\nagain, i guess one could argue that it is personal prefference, but even someone who finds looks important would say meh to miniaturization. \n\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2017-12-11T00:49:19Z","Content":"\n\u003Cp\u003E\nIf you\u0027re a probe guy, then maybe you should try this...\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed1287929726\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/95645-13x-seti-unmanned-before-manned-patreon/\u0026amp;do=embed\u0022 style=\u0022height:214px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nI\u0027ve seen several threads like this, and the thing I\u0027ve noticed about tech trees it that that everyone has an opinion and nobody\u0027s opinion is the same.  Somebody will come along and argue that \u0022it\u0027s just common sense\u0022 that the tree should be arranged in some particular fashion.  The next guy will come along and say the same thing but will propose something completely different.  If it were so obvious that the tree should be arranged in some specific way, then everybody would agree, but they don\u0027t.  It\u0027s all depends on a person\u0027s particular style of play, and there\u0027s nearly are as many different styles as there are players.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s why I proposed you consider rearranging the tree yourself.  The chances that there\u0027s an existing tech tree out there that does exactly what you want is probably remote.  If a particular tree doesn\u0027t look the way you think it should, that doesn\u0027t make it wrong, it just makes it different.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jevry","CreatedById":172487,"CreatedDateTime":"2017-12-11T16:30:02Z","Content":"\n\u003Cp\u003E\nwell again. seti is what i always ended up at when looking for new tech trees. and i actually have little against the manned spaceflight part.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nso i have now i think changed the science cost of aerospace tech to from 180 to 120, 300 to 200-250 mattering which of the 2 you choose as heavy aerodynamics is even less usefull. 550 to 500 and 1000 to 900\n\u003C/p\u003E\n\u003Cp\u003E\ni think this might be slightly better balanced imo though i think it might be better to lower cost at the early wing parts while keeping the parts with for example engines at the same cost.\n\u003C/p\u003E\n\u003Cp\u003E\ni will see as i continue along\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\ni also changed miniaturization to 30 science. because that is the most i would ever pay for such a garbage tech node.\n\u003C/p\u003E\n"}]}