{"TopicId":169562,"ForumId":20,"TopicTitle":"Suggestion for achievable Space Elevators and Skyhooks","CreatedByName":"Periapse","CreatedById":163395,"CreatedDateTime":"2018-01-14T05:50:22Z","PageNum":1,"Articles":[{"CreatedByName":"Periapse","CreatedById":163395,"CreatedDateTime":"2018-01-14T05:50:22Z","Content":"\n\u003Cp style=\u0022background-color:transparent;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;margin-top:0px;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n[First time I\u0027ve made a thread so please let me know if I need to do anything differently or post somewhere else \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E ]\u003Cbr\u003E\nSo here\u0027s a suggestion - functional simulated Space Elevators and Skyhooks not as vessels but as \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E pseudo-Structures that can be upgraded like any other. I don\u0027t know if I\u0027ll ever get around to making this myself so I want to put the concept out there for feedback and for anyone with more modding experience than me.\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:transparent;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;margin-top:0px;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nI\u0027ll start with Space Elevators since they\u0027re simpler to use and implement. Using one would go something like clicking on the structure in the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, seeing the same menu you get when you click on the Launchpad and Runway, selecting a vessel to \u0022launch\u0022, and then loading to a floating \u0022structure\u0022 in geostationary orbit above the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. We basically render the station at the top of the space elevator, not the elevator itself, so it just floats there acting as a launchpad. There could be multiple such structures at different altitudes up the length of the elevator, from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E up to GEO, although you\u0027d only find yourself in a circular orbit if you set off from the GEO point since you wouldn\u0027t be starting with enough orbital velocity. From your chosen launch point you detach and off you go. You can use this method to put entire spaceships (subject to mass limits determined by structure upgrade level) into orbit, or put individual modules of a ship or station into orbit one at a time and then dock them. You could even bring canisters of material kits or rocket parts up if you\u0027re using Extraplanetary Launchpads, up to a waiting shipyard, enabling you to construct HUGE ships very easily for some seriously cool late-game stuff. This is my reason for wanting this mod, I\u0027m tired of launching from the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E or from EL bases on the moon and I want ways to streamline the process while remaining grounded in realistic futurism. \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:transparent;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;margin-top:0px;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n\u003Cspan style=\u0022float:none;background-color:transparent;color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003EFor balance we can use the stock building upgrade system to incrementally increase how much mass the elevator can accommodate in one \u0022launch\u0022 - you\u0027d start with a few tons, and work your way up to tens or maybe hundreds. I don\u0027t think it should ever be unlimited as with the fully upgraded Launchpad and Runway. That would be too easy, you may as well just use Hyperedit at that point. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background-color:transparent;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;margin-top:0px;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nFor optimal functionality with EL, we\u0027d need some way to have at least one vessel \u0022docked\u0022 to the orbital launch point, otherwise we\u0027d have to manually ferry cargo to a nearby station every time we brought it up, largely negating the whole point of the mod. I\u0027m not sure how achievable this is in KSP. If it can be done, I\u0027d like any vessel docked to the elevator to be able to receive unlimited resources from the surface, for a price of Resource Amount * Resource Cost * Operating Cost per Unit of Mass. If we can\u0027t dock with the structure in any traditional way, perhaps we can treat the shipyard as being in an unlaunched state on one of several staging points. Ideally that would mean there\u0027s a main \u0022Launchpad\u0022 from which vessels brought up by the elevator are deployed, surrounded by one or more dummy launchpads where vessels can be placed, used and recovered but are unable to launch. This could get buggy though. Still trying to think of an ideal solution. \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:transparent;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;margin-top:0px;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nFinally, if we wanted to make this REALLY awesome, it would be pretty great to place such pseudo-structures on any body in the Kerbin System and beyond. This could be used with out EL but it would be much more useful if you were using it as part of some serious extraplanetary shipbuilding or resource-moving infrastructure. This would entail a special part which, in the case of the Space Elevator, acts as a sort of \u0022setup kit\u0022 which can be deployed on, say, the Mun to create a Space Elevator endpoint. It would need to be placed at the equator of a body to work and would take time and resources to complete setup. Upgrades to the new elevator would be managed through the right click part menu, but I think the best solution would be a dedicated menu at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and Tracking Station where we can manage all our launch structures throughout the system in one list, without having to load in and visit them.  \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:transparent;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;margin-top:0px;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nWe could also create skyhooks in the same way. The idea with skyhooks is they\u0027re cheaper to operate and in many ways simpler to build than space elevators. These would require you to fly a spaceplane to a specific speed and altitude eastwards over the equator. A toolbar menu would then enable you to \u0022attach\u0022 to the skyhook, which would teleport the craft to a specific orbit depending on the skyhook.\u003Cspan style=\u0022float:none;background-color:transparent;color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003EIt would be fun to make even more narrow criteria and try and intercept the skyhook at exactly the right time and place, but it wouldn\u0027t be much use if you wanted to use the thing regularly. \u003C/span\u003E It would be nice to attach only the cargo somehow, but I don\u0027t know how realistic that is or how we\u0027d achieve that in the mod since KSP only sees one craft irrespective of what\u0027s considered \u0022cargo\u0022. Conceivably this would work offworld as well. \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:transparent;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;margin-top:0px;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background-color:transparent;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;margin-top:0px;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E\nAlright, that\u0027s it. I think what I\u0027ve outlined here would be quite achievable, if I or anyone else gets around to making such a thing, and it would be tremendously useful and immersive for builds like mine where I\u0027m spending most of my time in the late game playing with mods like Interstellar Extended and \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E Colonization. I\u0027d love to hear what the rest of you guys think \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2018-01-14T09:05:14Z","Content":"\n\u003Cp\u003E\nI think that would really elevate the gameplay on a whole new level (pun intended) but I\u0027m afraid to say that there\u0027s several problem regarding ultra-large megastructure in KSP. Since it\u0027s essentially, a space elevator is a glorified hyperedit. It might be possible to make a mod about it, but considering the limitation regarding physic simulation distance, orbital mechanic and gameplay value, there must be a way to prevent the space elevator being too \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E or impractical as well as a way to overcome the limitation of game engine regarding orbital mechanics and gameplay value.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, the main problem with space elevators (Gameplay value) is that, once it\u0027s created, it renders launch pad useless since rockets becomes obsolete. A launching facility on \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E has their own advantage and disadvantage so that one of them does not overshadow each other. For example, launch pad allows you to launch rockets, but unfeasible for launching spaceplanes or atmospheric aircraft. While you might argue that we can launch rockets on runway too, without runway, there\u0027s no viable starting point for SSTOs and jet aircraft. If there\u0027s a space elevator, then no more use for launch pad, and the only usage of runway is for landing \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E or operating atmospheric aircraft. There must be a limit of space elevator capability such as maximum tonnage, additional cost for launch or cool down period after each launch.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond (Practicality), I understand the concept of space elevator is awesome and really, I do want to see it becomes a reality. But in real life, space elevator is also vulnerable to space debris, just like space stations, and in KSP it\u0027s still in full effect. Judging from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E location on equatorial region of kerbin, and most players usually makes equatorial orbit, it\u0027s not surprising most refueling stations, space probes, relays and debris are scattered mostly on equatorial orbit. If launching ship from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E is like what you suggest, then there\u0027s a very high probability that the ship being hit by space object as soon as it\u0027s \u0022materialized\u0022 (loaded) in orbit, especially if the elevator being frequently used.\n\u003C/p\u003E\n\u003Cp\u003E\nThird (Orbital mechanic), how the ship makes orbit? Sure, the ship is transported into outer atmosphere where the orbit takes place, but space elevator is static object, aka a structure, it does not move at all. If you load a ship on the outer atmosphere locked by launch clamps on the summit of space elevator and release it, it will fall straight down since the ship has zero velocity, it does not move at all in the first place, and thus has no orbital velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally though, for me, I\u0027d like to use mass driver instead of space elevators since judging from engineering standpoint, it\u0027s much easier to build and maintain (and someone already make a mod about it)\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know much about skyhook though, only a vague information about it, and I don\u0027t know exactly how it works\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-14T09:07:43Z\u0022 title=\u002201/14/2018 09:07  AM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 14, 2018\u003C/time\u003E by ARS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2018-01-14T16:17:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223267555\u0022 data-ipsquote-contentid=\u0022169562\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221515920714\u0022 data-ipsquote-userid=\u0022168061\u0022 data-ipsquote-username=\u0022ARS\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, ARS said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThird (Orbital mechanic), how the ship makes orbit? Sure, the ship is transported into outer atmosphere where the orbit takes place, but space elevator is static object, aka a structure, it does not move at all. If you load a ship on the outer atmosphere locked by launch clamps on the summit of space elevator and release it, it will fall straight down since the ship has zero velocity, it does not move at all in the first place, and thus has no orbital velocity.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis one actually isn\u0027t a problem - the \u0027top\u0027 (I assume you mean geostationary hub - the actual \u0027top\u0027 of a space elevator would need to be even *further* out, as the center of mass needs to be at the hub) is after all in a geostationary *orbit*.  So if you push a ship out of the hanger at that point, it\u0027ll be in a geostationary orbit as well, or at least close to one.  If you actually went to the \u0027top\u0027 of the elevator, it\u0027d be on an escape trajectory.\n\u003C/p\u003E\n\u003Cp\u003E\nBut the practical aspect in the game is that the game physics doesn\u0027t allow for such a large structure easily.  It\u0027d need to essentially be part of the planet, I think.  (And I\u0027m not sure if that would work either.)  You could imitate one by placing an EL dock in KSO and hyperediting building materials to it.\n\u003C/p\u003E\n"},{"CreatedByName":"Periapse","CreatedById":163395,"CreatedDateTime":"2018-01-15T04:03:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022float:none;background-color:transparent;color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003EBut the practical aspect in the game is that the game physics doesn\u0027t allow for such a large structure easily.  It\u0027d need to essentially be part of the planet, I think.  (And I\u0027m not sure if that would work either.) \u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ll try to be more clear, what I\u0027m proposing is not an actual physical space elevator in game. All that would exist would be the \u0022stations\u0022 along the length of the elevator. These would be the same as structures attached to the surface of a planet, they\u0027d just be offset from the surface by hundreds or thousands of kilometers. They\u0027d basically just float there, and would be no bigger than, say, the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. It would look a little janky to look at since we can\u0027t render the cable, but in my opinion the functionality is worth it. Heck, maybe we could fake the cable with a ribbon particle, since particles can extend beyond physics range. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022float:none;background-color:transparent;color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003EFirst, the main problem with space elevators (Gameplay value) is that, once it\u0027s created, it renders launch pad useless since rockets becomes obsolete. \u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou bet it does, that\u0027s the whole point! Space Elevators are a futuristic technology and should only be available way down at the end of the vanilla tech tree, and would only be fun to use if you\u0027re using a modded build where you\u0027re doing some serious high-tech interplanetary expansion. Let\u0027s say you\u0027re using Interstellar Extended and you\u0027re trying to build a glorious space empire with fusion rockets and antimatter. A civilization like that will have found way better ways to get stuff into space. \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022float:none;background-color:transparent;color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003EBut in real life, space elevator is also vulnerable to space debris, just like space stations, and in KSP it\u0027s still in full effect. Judging from \u003C/span\u003E\u003Cabbr style=\u0022background-color:transparent;border-bottom-color:rgb(53,60,65);border-bottom-style:none;border-bottom-width:0px;color:rgb(53,60,65);font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:underline;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022 title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003Cspan style=\u0022float:none;background-color:transparent;color:rgb(53,60,65);font-family:Roboto, \u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:400;letter-spacing:normal;text-align:left;text-decoration:none;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\u0022\u003E location on equatorial region of kerbin, and most players usually makes equatorial orbit, it\u0027s not surprising most refueling stations, space probes, relays and debris are scattered mostly on equatorial orbit.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a really good point, I hadn\u0027t considered that. Perhaps there could be a debris-zapper volume around the station, where any vessel tagged as debris is purged before physics kicks in. Might be risky, but we might pass it off as the automated debris-defense laser showing no mercy and put a big warning label on the side of the station. \n\u003C/p\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2018-01-15T04:40:59Z","Content":"\n\u003Cp\u003E\nRegarding about the structure being created like \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E facility and put to offset on the orbit altitude, it might work like a space elevator. Since yes, we cannot render the cable or large scale structure from ground level to orbit altitude, a particle effect might be worth using. This also makes me wonder, if the space elevator is indeed being built, most of the upper section would be like an orbital shipyard where ships being built in orbit and launched directly, with materials being transported by the elevator itself. It kinda like a spaceport, after all, you can only send limited amount of stuff with the elevator, but there\u0027s nothing stopping you to assemble it in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nNow wait a minute, I think I can make a pseudo-space elevator (aka improvising). I haven\u0027t heard about extraplanetary launch pad mod that you said before, but what I know, it allows you to build and launch rockets on another planet, mind telling me how it works? I think I\u0027m able to find a way to make this \u0022space elevator\u0022 possible\n\u003C/p\u003E\n"},{"CreatedByName":"0something0","CreatedById":182790,"CreatedDateTime":"2018-01-15T06:56:30Z","Content":"\n\u003Cp\u003E\nI also was thinking  of a similar thing but with parts. There would be a hub at geostationary orbit with a space elevator part and a ground vessel with the part that has to be on the equator beneath the orbital station to deploy. Then another vessel near the station or the base could go to the ground or to the station  respectivly. This would allow such structures to be deployed on oher planets\n\u003C/p\u003E\n"},{"CreatedByName":"DStaal","CreatedById":155685,"CreatedDateTime":"2018-01-15T16:06:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268211\u0022 data-ipsquote-contentid=\u0022169562\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221515991259\u0022 data-ipsquote-userid=\u0022168061\u0022 data-ipsquote-username=\u0022ARS\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 hours ago, ARS said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNow wait a minute, I think I can make a pseudo-space elevator (aka improvising). I haven\u0027t heard about extraplanetary launch pad mod that you said before, but what I know, it allows you to build and launch rockets on another planet, mind telling me how it works? I think I\u0027m able to find a way to make this \u0022space elevator\u0022 possible\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt allows you to design a rocket normally, and then build it at a specialized facility anywhere in your KSP universe.  To build it, you need a launchpad, a workshop, Engineers, and resources (RocketParts with just base EL).  How much resources are required is dependent on the mass of the ship you\u0027re building.  A launchpad is either a special part, or a surveyed site on the surface of a planet/moon along with a part that controls the survey.  A workshop is a different special part (or parts - you can have more than one) that allows engineers to work.  How fast you build is determined by the quality of your workshop(s), and the experience and stats of your Kerbals.  If a ship is built with a launchpad, you can fill it with fuel/other resources upon launch.  (You can\u0027t with a surveyed site - the vessel isn\u0027t connected to the build station.  So you\u0027d better think about how you\u0027re handling it then.)\n\u003C/p\u003E\n\u003Cp\u003E\nIn terms of a pseudo-elevator, if you were to put a build station into KSO, and keep it filled with RocketParts via Hyperedit you could launch vessels from it every few days, depending on the size of the vessels.  (I\u0027m saying fill with hyperedit to make it different from just putting the station into KSO and supplying it normally as an orbital shipyard.)\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268281\u0022 data-ipsquote-contentid=\u0022169562\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221515999390\u0022 data-ipsquote-userid=\u0022182790\u0022 data-ipsquote-username=\u00220something0\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, 0something0 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI also was thinking  of a similar thing but with parts. There would be a hub at geostationary orbit with a space elevator part and a ground vessel with the part that has to be on the equator beneath the orbital station to deploy. Then another vessel near the station or the base could go to the ground or to the station  respectivly. This would allow such structures to be deployed on oher planets\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is an interesting idea.  The question would be how to balance it, and how (and what) to require for the hub.  Note that you can\u0027t get into a geostationary orbit around Mun, for instance, because of the way the physics engine works in KSP.  (It would require you orbit the Mun outside of the Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.)\n\u003C/p\u003E\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2018-01-15T18:45:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223268515\u0022 data-ipsquote-contentid=\u0022169562\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516032383\u0022 data-ipsquote-userid=\u0022155685\u0022 data-ipsquote-username=\u0022DStaal\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, DStaal said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt allows you to design a rocket normally, and then build it at a specialized facility anywhere in your KSP universe.  To build it, you need a launchpad, a workshop, Engineers, and resources (RocketParts with just base EL).  How much resources are required is dependent on the mass of the ship you\u0027re building.  A launchpad is either a special part, or a surveyed site on the surface of a planet/moon along with a part that controls the survey.  A workshop is a different special part (or parts - you can have more than one) that allows engineers to work.  How fast you build is determined by the quality of your workshop(s), and the experience and stats of your Kerbals.  If a ship is built with a launchpad, you can fill it with fuel/other resources upon launch.  (You can\u0027t with a surveyed site - the vessel isn\u0027t connected to the build station.  So you\u0027d better think about how you\u0027re handling it then.)\n\u003C/p\u003E\n\u003Cp\u003E\nIn terms of a pseudo-elevator, if you were to put a build station into KSO, and keep it filled with RocketParts via Hyperedit you could launch vessels from it every few days, depending on the size of the vessels.  (I\u0027m saying fill with hyperedit to make it different from just putting the station into KSO and supplying it normally as an orbital shipyard.)\n\u003C/p\u003E\n\u003Cp\u003E\nThis is an interesting idea.  The question would be how to balance it, and how (and what) to require for the hub.  Note that you can\u0027t get into a geostationary orbit around Mun, for instance, because of the way the physics engine works in KSP.  (It would require you orbit the Mun outside of the Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOr use Konstructs to place an object with a KK launchpad on it.  For gameplay sake place in Kerbal Stationary Orbit.  \n\u003C/p\u003E\n\u003Cp\u003E\nLaunch your station to be attached to it with clamps (or a modded part with clamp module).  Also mod a part for the station like a special tank that generates fuel/oxidiser/anything using the same module as an \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E (not suitable for career saves \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E or is it? Extraplanetary Launchpads effectively is free building costing time, not funds.  Make sure the tanks you mod fill with EPL\u0027s rocket parts too \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E make sure your craft/station includes EPL launchpads.\n\u003C/p\u003E\n\u003Cp\u003E\nClose the KK launch site.  Also in the save file remove the staging for the craft/station launch clamps so you don\u0027t have any \u0027accidents\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso have lots of docking ports \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI think that would be a solution \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPeace.\n\u003C/p\u003E\n"}]}