{"TopicId":169660,"ForumId":20,"TopicTitle":"Thought on Fairings","CreatedByName":"Matuchkin","CreatedById":135127,"CreatedDateTime":"2018-01-16T17:20:07Z","PageNum":1,"Articles":[{"CreatedByName":"Matuchkin","CreatedById":135127,"CreatedDateTime":"2018-01-16T17:20:07Z","Content":"\n\u003Cp\u003E\nIs it possible to create procedural fairings that have non-circular cross sections? If so, how feasible is it to have fairings which alter their cross section throughout their length?\n\u003C/p\u003E\n\u003Cp\u003E\nWhy am I asking? Picture this: You create the internal skeleton of an aircraft out of structural girders and i-beams, place small fuel tanks, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E systems, science, etc (even weapon storage) into this skeleton. Then, all you have to do is place a modded \u0022fuselage nosecone\u0022 on the nose of your aircraft, and a structural fairing is stretched over your aircraft skeleton, creating a fuselage with a distinct shape and making your aircraft a bit more realistic and less made of digital Lego. This can also be applied to space vehicles such as landers.\n\u003C/p\u003E\n"},{"CreatedByName":"Titandesdieu","CreatedById":183706,"CreatedDateTime":"2018-01-18T04:49:54Z","Content":"\n\u003Cp\u003E\nseems like a goos idea but I think that the game physics did not allow that because I think it will to much demanding on the computer performance\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2018-01-18T15:27:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223269487\u0022 data-ipsquote-contentid=\u0022169660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221516123207\u0022 data-ipsquote-userid=\u0022135127\u0022 data-ipsquote-username=\u0022Matuchkin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 1/16/2018 at 10:20 AM, Matuchkin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs it possible to create procedural fairings that have non-circular cross sections?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nStock? No.\n\u003C/p\u003E\n\u003Cp\u003E\nModded?  Sure.  Tons of code.\n\u003C/p\u003E\n\u003Cp\u003E\nThe real problem is -- it won\u0027t work well for an aircraft body because KSP \u003Cstrong\u003Edepends\u003C/strong\u003E on the lego setup in order to derive the aircraft lift/drag properties.  It doesn\u0027t do any real vehicle analysis like you might thinkl; rather it just sums up the precomputed \u0027drag-cubes\u0027 for the parts, taking into account their position and orientation (and occlusion for stack-mounted parts), and applies however much drag the drag cube specifies for that setup.\n\u003C/p\u003E\n\u003Cp\u003E\nSingle part fuselage = single drag cube = no dynamics = going to fly weird, if at all.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWould it work?  Sure.  Would it work well?  No.\n\u003C/p\u003E\n"}]}