{"TopicId":176164,"ForumId":20,"TopicTitle":"BDArmory\u0026#039;s Weapon Manager not working","CreatedByName":"kspguy77","CreatedById":189458,"CreatedDateTime":"2018-06-25T05:28:27Z","PageNum":1,"Articles":[{"CreatedByName":"kspguy77","CreatedById":189458,"CreatedDateTime":"2018-06-25T05:28:27Z","Content":"\n\u003Cp\u003E\nHi! If this is the wrong place to ask about this, then, mods, please move this thread to somewhere else. So, i have a problem with bdarmory. The weapon manager doesn\u0027t work even though it\u0027s attached to the craft (rover in this case with a Patriot missile launcher and batteries for POWAAH). When i click the bdarmory menu button (?) in \u0022flight\u0022 on the upper right corner,  there should appear a some kind of a list of weapons you can use and stuff. Doesn\u0027t happen for me. It just says \u0022no weapon manager found\u0022 even though the thing is attached to the craft. Any ideas on what\u0027s happening? Also when i try to make a link between a radar vehicle and a missile launcher, i have to drive them really close to each other (150 meters) for both of them to appear on the vessel switcher or whatever. I can always see the vehicle i\u0027m operating at the moment on the vessel switcher but no other team A craft until 150 meters of distance or team B vehicles (it\u0027s the same for them too). Then, when i\u0027ve managed to get all these things, for example the missile turret with 8 mid range SAM missiles (can\u0027t remember what it\u0027s called), and a fighter jet with the AI pilot thing attached, to at least 150 meters of distance when i switch to the \u0022enemy\u0022 fighter, i set one of my units as the target, go back to the missile turret, press P on the vessel switcher to activate enemy\u0027s autopilot, the plane starts its takeoff roll but stops 350.7 meters from me (autopilot switches off). Then when drive closer than the distance previously said, the plane starts to take off once again. So if i\u0027d like to shoot airborne stuff down, i would need to constantly drive after them to maintain no more than 350 meters of separation which is impossible. Thanks in advance for your answers.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-25T11:32:09Z\u0022 title=\u002206/25/2018 11:32  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 25, 2018\u003C/time\u003E by kspguy77\u003C/strong\u003E\n\u003Cbr\u003EAdded a couple more issues\n\u003C/span\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2018-06-25T16:09:12Z","Content":"\n\u003Cp\u003E\nHi  you seem to have firstly installed BDA incorrectly and not installed Physics range extender, which a requirement for BDA, there should be on screen warning for some of this , but if BDA itself is incorrectly installed then the warnings do not show.  The correct filepath should be  KSP/GameData/BDArmory     not  KSP/GameData/GameData/BDArmory and not KSP/GameData/BDArmory.1.2.1.4_06102018.   A zipped and downloadable copy of your KSP.Log will enable us to check the installation, without it the above is my best guess.\n\u003C/p\u003E\n\u003Cp\u003E\nBDA Help desk\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-25T16:09:25Z\u0022 title=\u002206/25/2018 04:09  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 25, 2018\u003C/time\u003E by SpannerMonkey(smce)\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2018-06-25T16:25:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223405153\u0022 data-ipsquote-contentid=\u0022176164\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221529942952\u0022 data-ipsquote-userid=\u002250907\u0022 data-ipsquote-username=\u0022SpannerMonkey(smce)\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 minutes ago, SpannerMonkey(smce) said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ninstalled Physics range extender, which a requirement for BDA\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIs this a requirement for all BDA?\n\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2018-06-25T18:06:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223405162\u0022 data-ipsquote-contentid=\u0022176164\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221529943934\u0022 data-ipsquote-userid=\u002289014\u0022 data-ipsquote-username=\u0022adsii1970\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, adsii1970 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ns this a requirement for all BDA? \u003Cspan\u003E﻿\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHi, Yes,  since KSP 1.3 it\u0027s been an essential part of BDA\u0027s functions\n\u003C/p\u003E\n"},{"CreatedByName":"kspguy77","CreatedById":189458,"CreatedDateTime":"2018-06-26T06:50:25Z","Content":"\n\u003Cp\u003E\nWhen i downloaded BDArmory, on the site there read that the file includes Physics Range Extender. The filepath you said (KSP/Gamedata/BDArmory), it\u0027s the same one i have. Where do i put my downloadable copy KSP log as you said? I\u0027m not really good on computing stuff so.. Dumb question\u003Cspan\u003E:w\u003C/span\u003Eon\u0027t it reveal something personal (the log)?\n\u003C/p\u003E\n"}]}