{"TopicId":181849,"ForumId":20,"TopicTitle":"KRPC variable server side timestamps?","CreatedByName":"Ender1618","CreatedById":195145,"CreatedDateTime":"2019-01-31T03:51:22Z","PageNum":1,"Articles":[{"CreatedByName":"Ender1618","CreatedById":195145,"CreatedDateTime":"2019-01-31T03:51:22Z","Content":"\n\u003Cdiv\u003E\n\u003Cp\u003E\nI am a newbie to KRPC, but I was wondering if there was a mechanism for getting server/game time stamps for the state of a variable, such as the vessel’s velocity vector. Say I registered a stream for velocity, and I query the stream at client time t0 and then slightly later at time t1. Is there a way to know the sever/simulation side elapsed time between the 2 observations?\n\u003C/p\u003E\n\u003Cp\u003E\nI would think just having client side t0 and t1 and thus client side elapsed time (delta t) wouldn’t be nearly as accurate. Say for use in a client side PID algorithm, for control of some Kerbal system over KRPC.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks, \n\u003C/p\u003E\n\u003Cp\u003E\nEnder\n\u003C/p\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"Benjamin Kerman","CreatedById":172792,"CreatedDateTime":"2019-01-31T07:16:41Z","Content":"\n\u003Cp\u003E\nYes, you can query the server for it\u0027s time at t1c and then at t2c, the subtract them to get the ∆ts\n\u003C/p\u003E\n"},{"CreatedByName":"Ender1618","CreatedById":195145,"CreatedDateTime":"2019-01-31T16:15:27Z","Content":"\n\u003Cp\u003E\nWhat part of the kRPC api lets you do this?\n\u003C/p\u003E\n\u003Cp\u003E\nSo you would query time at t1c, then immediately query the variables you want, then again at t2c?\n\u003C/p\u003E\n\u003Cp\u003E\nHow would you know that the variables pulled correspond to the the t1s and t2s timestamps, is there a way to batch the calls, to ensure they are from the same server time step?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks,\n\u003C/p\u003E\n\u003Cp\u003E\nEnder\n\u003C/p\u003E\n"},{"CreatedByName":"Benjamin Kerman","CreatedById":172792,"CreatedDateTime":"2019-02-01T09:01:38Z","Content":"\n\u003Cp\u003E\nI don\u0027t know specifically about the kRPC API, but I am more speaking in general about what I would recommend doing. \n\u003C/p\u003E\n\u003Cp\u003E\nQuerying the values at two different client times will give you the ∆t of the server between the two client times, which can determine if the server is running slower or faster than the client. Batching would _not_ be recommended, because that defeats the purpose of having the ∆t on the client side. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}