{"TopicId":182164,"ForumId":20,"TopicTitle":"Challenge and progression mods for a career game","CreatedByName":"PunkyFickle","CreatedById":130214,"CreatedDateTime":"2019-02-14T08:52:11Z","PageNum":1,"Articles":[{"CreatedByName":"PunkyFickle","CreatedById":130214,"CreatedDateTime":"2019-02-14T08:52:12Z","Content":"\n\u003Cp\u003E\nEvery time I start a new career, I inevitably end up finding a new awesome mod that-I-can\u0027t-play-without-how-don\u0027t-I-know-about-that-one-yet, which makes me wonder wether I should restart because it makes no sense to continue with suddenly this feature or act like nothing happened and regret it for the rest of the game. So today is the day I take the bull by the horns and ask forum members to perform their very favourite activity : giving mod recommendations.\n\u003C/p\u003E\n\u003Cp\u003E\nThe aim here is to find mods that add a feeling of progression and challenge by increasing the level of \u0022realism\u0022 of a career oriented game. When I say \u0022realism\u0022 I don\u0027t mean that I want to go full \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E with IVA only and only recreations of real parts. I want to stick with the wacky and lovely Kerbal style as much as possible, but I would like to scale up the difficulty of my careers. My other objective is to to feel a form of progression in my game. In vanilla(ish), everything is kind of granted if you know the ropes, and Jool moons are next door as soon as you reach tier 4 tech. My Kerbals and me need to grind and sweat to get there, and manned interplanetary travel should be an endgame thing, thanks to technological or logistical constraints, for example.\n\u003C/p\u003E\n\u003Cp\u003E\nA few constraints \u003Cspan\u003E:\u003C/span\u003E I try to keep my number of mods quite low not to hinder my performances too much, so I sometimes ditch mods that fit my requirements, but that I don\u0027t judge essential enough (ResearchBodies, for example). I also fear for compatibility bugs. So I would rather stick to mods last edited in 2018 at least and tend to avoid notorious incompatibilities. I try to keep thing modular and avoid big overhauls in case something go wrong on one aspect only (I went for Kerbal Health and TACLS rather than Kerbalism, for example). Lastly, you will notice that I avoided part breaking mods. First because I want failures to be my own fault, second, because I would like not to deal with the frustration of a random malfunction and the effect it might have on my motivation to play the game (\u0022Hah!\u003Cem\u003E I want more challenge\u003C/em\u003E, he said!\u0022).\n\u003C/p\u003E\n\u003Cp\u003E\nMods that help to alleviate the difficulty in a balanced/\u0022realistic\u0022 manner (DeepFreeze\u003Csup\u003E(Balanced because very high tech)\u003C/sup\u003E, rotating habitat, etc) are welcome too. Again, I try to stick to stockalike parts and not to venture too far from the Kerbal way of life\u003Csup\u003E®\u003C/sup\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nHere are some examples of mods I already have installed and that fill those roles \u003Cspan\u003E\u003Cspan\u003E:\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nRemotetech\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nDeadly Reentry\n\u003C/li\u003E\n\u003Cli\u003E\nRealChute\n\u003C/li\u003E\n\u003Cli\u003E\nSCANSat\n\u003C/li\u003E\n\u003Cli\u003E\nKerbal Health\n\u003C/li\u003E\n\u003Cli\u003E\nTAC Life Support\n\u003C/li\u003E\n\u003Cli\u003E\nKerbal Construct Time (with KRASH \u0026amp; ScrapYard)\n\u003C/li\u003E\n\u003Cli\u003E\nFinal Frontier\n\u003C/li\u003E\n\u003Cli\u003E\nCommunity Tech Tree\n\u003C/li\u003E\n\u003Cli\u003E\nContract packs (the bread and butter of progression) \u003Cspan\u003E:\u003C/span\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cspan\u003EGAP\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan\u003EExploration Plus\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan\u003EAnomaly Surveyor\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan\u003EBases and Station\u003C/span\u003E\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cspan\u003E...\u003C/span\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nHere\u0027s the full list of my installed mods, in case I missed anything \u003Cspan\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nClickThroughBlocker - 0.1.6.10\u003Cbr\u003E\nToolbar - 1.7.17.15\u003Cbr\u003E\nToolbarControl - 0.1.6.20\u003Cbr\u003E\nAstronomer\u0027s Visual Pack - 3.7.4\u003Cbr\u003E\nB9 Part Switch - 2.6\u003Cbr\u003E\nBasic DeltaV - 1.0.5.1\u003Cbr\u003E\nChatterer - 0.9.96.2332\u003Cbr\u003E\nCommunity Category Kit - 4.1\u003Cbr\u003E\nCommunity Resource Pack - 1.1\u003Cbr\u003E\nCommunityTechTree - 3.3.6\u003Cbr\u003E\nContract Configurator - 1.27.1\u003Cbr\u003E\nContract Pack: Anomaly Surveyor - 1.7.1\u003Cbr\u003E\nContract Pack: Clever Sats - 1.4\u003Cbr\u003E\nContract Pack: Exploration Plus - 1.0.1\u003Cbr\u003E\nContract Pack: Giving Aircraft a Purpose - 1.6.1\u003Cbr\u003E\nContract Pack: Kerbal Academy - 1.3.0.1\u003Cbr\u003E\nContract Pack: Bases and Stations - 3.7.1.2\u003Cbr\u003E\nContract Pack: RemoteTech - 2.1.4\u003Cbr\u003E\nDeadly Reentry - 7.7.1\u003Cbr\u003E\nDistantObjectEnhancement - 1.9.1\u003Cbr\u003E\nDMagic Orbital Science - 1.4.2\u003Cbr\u003E\nWaypoint Manager - 2.7.4\u003Cbr\u003E\nDynamicBatteryStorage - 1.4\u003Cbr\u003E\nEnvironmental Visual Enhancements - 1.4.2.2\u003Cbr\u003E\nFerram Aerospace Research - 0.15.9.6\u003Cbr\u003E\nHeatControl - 0.4.10\u003Cbr\u003E\nHideEmptyTechTreeNodes - 1.1\u003Cbr\u003E\nJSIPartUtilities - 0.4.2.1\u003Cbr\u003E\nJSIAdvTransparentPods - 0.1.17\u003Cbr\u003E\nRasterPropMonitor - 0.30.6\u003Cbr\u003E\nKerbal Engineer Redux - 1.1.5.7\u003Cbr\u003E\nKerbalHealth - 1.3.4\u003Cbr\u003E\nInlineBallutes - 1.2.9.7\u003Cbr\u003E\nKopernicus - 1.6.1.2\u003Cbr\u003E\nKRASH - 0.5.29.7\u003Cbr\u003E\nKSP-AVC Plugin - 1.2.0.7\u003Cbr\u003E\nMagiCore - 1.3.1\u003Cbr\u003E\nMechJebForAll - 1.3.0.5\u003Cbr\u003E\nModularFlightIntegrator - 1.2.6\u003Cbr\u003E\nDocking Port Alignment Indicator - 6.8.2\u003Cbr\u003E\nNearFutureElectrical - 0.10.6\u003Cbr\u003E\nNearFutureProps - 0.5\u003Cbr\u003E\nNearFutureSolar - 0.8.15\u003Cbr\u003E\nFinal Frontier - 1.5.3.3465\u003Cbr\u003E\nKerbal Planetary Base Systems - 1.6.7\u003Cbr\u003E\nPlanetShine - 0.2.6.1\u003Cbr\u003E\nPrecise Maneuver - 2.4.1\u003Cbr\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid - 0.9.7.4\u003Cbr\u003E\nRealChute - 1.4.7.3\u003Cbr\u003E\nRemoteTech - 1.9.1.131\u003Cbr\u003E\nAmpYear - 1.5.3\u003Cbr\u003E\nDeepFreeze Continued... - 0.23.9\u003Cbr\u003E\nRLA_Reborn - 0.15.1.5\u003Cbr\u003E\nSCANsat - 1.1.8.10\u003Cbr\u003E\nStationPartsExpansionRedux - 1.1\u003Cbr\u003E\nStock Visual Terrain - 2.1.4.1\u003Cbr\u003E\nTAC Life Support - 0.13.11\u003Cbr\u003E\nKerbal Alarm Clock - 3.10\u003Cbr\u003E\nAlternate Resource Panel - 2.9.3\u003Cbr\u003E\nTransfer Window Planner - 1.6.3\u003Cbr\u003E\nUniversal Storage 2 - 1.5.1.9\u003Cbr\u003E\nWaypoint Manager - 2.7.5\u003Cbr\u003E\n[x] Science! - 5.19\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Friznit","CreatedById":191545,"CreatedDateTime":"2019-02-19T14:17:03Z","Content":"\n\u003Cp\u003E\nIt sounds like you have a similar play style to me.  I have a set of core quality of life mods that I never go without (things like \u003Cabbr title=\u0022Kerbal Alarm Clock (mod)\u0022\u003EKAC\u003C/abbr\u003E, \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E, MechJeb, Precise Manoeuvre etc).  My second set of mods adds a bit of a pseudo-realism theme - things like life support, scanning, Remote Tech \u0026amp; \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E in various permutations (e.g. \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E theme; or Interstellar Extended theme; or WBI theme).  The final set of mods is specific to my chosen story arc - i.e. the overall goal of the career game.  In my last playthrough, the mission was to establish a viable self sustaining colony in a different solar system, hence mods such as \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E Kolonization, Civilian Population and a planet pack with at least one other star system.\n\u003C/p\u003E\n\u003Cp\u003E\nFor Contract Packs, I enjoy Advanced Career Progression - I usually end up \u0022overtaking\u0022 the mission progression before long but it\u0027s a nice way to start.  You might also consider Tourism Plus, though it can turn into a bit of a money spinner rather than drive any actual progression of the \u0022story\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve just started a new career trying out Snacks\u002BKerbal Health as a lightweight alternative to TAC/\u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E Life Support.  The story in this career is \u0022race for the stars\u0022, so I\u0027ve added Monthly Budgets, Research Bodies/Tarsier Space Tech, Galileo\u0027s Planet Pack and the BDB rockets for the sweet 1960\u0027s nostalgia.  It\u0027s an interesting fresh challenge - having to balance the the budget between research, exploration and lobbing enough Kerbs into space to keep the paymasters happy.\n\u003C/p\u003E\n"},{"CreatedByName":"SpinkAkron","CreatedById":134807,"CreatedDateTime":"2019-02-19T16:06:55Z","Content":"\n\u003Cp\u003E\nVery similar to how I play. I use most of those mods but I do use part failure mods  I have three themes that guide my setup. First is to slow down the pace of the game. The primary way to do this is to play on hard difficulty. Science points drive the pace. Less science means more missions to reach the next tier. I deselect the part unlock cost. That\u0027s just a money sink and I reduce money in other ways. I use the all the pressure/force  stuff on the advanced tab. I select action groups always available cuz that\u0027s just a quality of life thing. Kerbal Construction Time provides a sense of time passing.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond and third go hand in hand. I want to have meaningful decisions and I want consequences for bad ones. This also primarily done with difficulty setting sliders. I jack the penalty settings up which also increases upgrade costs. I like to feel like I\u0027m always a couple screw ups from disaster. It\u0027s not uncommon for my careers to end in bankruptcy.\n\u003C/p\u003E\n\u003Cp\u003E\nI use SETI contracts to drive the career and disable all stock contracts, using contract packs instead. Exploration Plus is another good career driver. \n\u003C/p\u003E\n\u003Cp\u003E\nI like to use a custom tech tree so I can start with just probes and have to really work for the things we normally take for granted. I used Seti UBM with \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/71012-theonegalen/\u0026amp;do=hovercard\u0022 data-mentionid=\u002271012\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/71012-theonegalen/\u0022 rel=\u0022\u0022\u003E@theonegalen\u003C/a\u003E extensions for a long time. Probes Before Crew looks quite interesting but it makes changes to science that conflicts with my science tweaks. I finally ended up making my own tech tree to provide the challenge I wanted.\n\u003C/p\u003E\n\u003Cp\u003E\nI get a lot of enjoyment developing scripts for kOS. I do not allow any commands to unmanned craft except thru kOS so that adds another level of challenge.  I really love how all these mods allow each of us to customize the game to our own version of what we think it should be.\n\u003C/p\u003E\n"}]}