{"TopicId":182390,"ForumId":20,"TopicTitle":"Guideline for Nvidia TI series crash solution","CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2019-02-23T09:53:25Z","PageNum":1,"Articles":[{"CreatedByName":"Jiraiyah","CreatedById":97667,"CreatedDateTime":"2019-02-23T09:53:25Z","Content":"\n\u003Cp\u003E\nHi\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t know if this is a proper thread section for this or not but considering that this problem happens on modded ksp versions, thought it would be proper place.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, what is the problem?\n\u003C/p\u003E\n\u003Cp\u003E\nYou install some graphical mods, launch ksp and get random crashes in different places of game but it\u0027s not a regular game closing crash. it\u0027s a vga failing crash! your pc goes to black screen, the fan on vga goes crazy and you are doomed. no way other than restarting the pc manually. here is what you need to do, STEP by STEP \u003Cspan\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E1- Open the output log under \u003Cspan\u003E: \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cpre style=\u0022border-left-color:#e0e0e0;border-left-style:solid;border-width:0px 0px 0px 4px;color:#353c41;font-size:14px;padding:15px;\u0022\u003E\n%USERPROFILE%\\AppData\\LocalLow\\Squad\\Kerbal Space Program\\output_log.txt \u003C/pre\u003E\n\u003Cp\u003E\nlook for the last few lines, you may get lots of null entry, go above, there should be tons of null reference exceptions, here is an example \u003Cspan\u003E:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003E(Filename:  Line: 572)\n\nNullReferenceException: Object reference not set to an instance of an object\n  at KS3P.Shaders.EyeAdaptationComponent.Prepare (UnityEngine.RenderTexture source, UnityEngine.Material uberMaterial) [0x00000] in \u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026lt;filename\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022atn\u0022\u003Eunknown\u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026gt;\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E:0 \n  at KS3P.Shaders.PostProcessingBehaviour.OnRenderImage (UnityEngine.RenderTexture source, UnityEngine.RenderTexture destination) [0x00000] in \u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026lt;filename\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022atn\u0022\u003Eunknown\u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026gt;\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E:0 \u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n\u003Cspan\u003Eas you see in the code above, clearly ks3p has problems. so, first step : get this log file somewhere on the net, report the log file to the mod developer, and remove it from the game instance.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThat maybe the only thing you need to do, but here is more to think of.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWe all read and believe that when ever GPU is failing, we need to UPGRADE the graphic driver. Well, in this case, it won\u0027t work and MAY cause more harm ! It looks like recent versions of nvidia\u0027s drivers have issue on directX 11 on TI series. lots of searching, and you come to two solutions : a) roll back driver b) don\u0027t install nvidia experience. So, here is what we need to do \u003Cspan\u003E:\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E2- Clean Unistall the graphic driver using \u003Ca href=\u0022https://www.softpedia.com/get/Tweak/Uninstallers/Display-Driver-Uninstaller.shtml\u0022 rel=\u0022external nofollow\u0022\u003EDDU (Display Driver Unistaller)\u003C/a\u003E\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe ddu guide line tells you that first, you need to disable internet and make sure windows is not in the middle of updating itself. It tells you that it\u0027s better to run the program under safe mode and use clean and restart option. if you are lazy (like i am) you can ignore the safe mode but the guide line tells you to clean and restart and then again clean and restart to be safe. I have done that. This will ensure that your graphic driver and all associated items are being removed from system.\n\u003C/p\u003E\n\u003Cp\u003E\n3- Roll back to \u003Ca href=\u0022https://www.geforce.com/drivers/results/138070\u0022 rel=\u0022external nofollow\u0022\u003Envidia driver 411.63\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter your second restart on step 3, you can install 411.63 version of nvidia, this was the recommended version on tom\u0027s hardware website and trust me, they know what they are talking about !\n\u003C/p\u003E\n\u003Cp\u003E\nOn the installation, first, you need to select driver only and not driver with experience, then you choose custom instead of express and uncheck 3d vision option and install the driver to the end.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBefore all of these steps, I would get crash with scatterer beside ks3p. Knowing ks3p has null references, it was ok. but scatterer?\n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003E[Scatterer] Volumetric clouds error on planet: KerbinSystem.NullReferenceException: Object reference not set to an instance of an object\n  at scatterer.SkyNode.mapEVEVolumetrics () [0x00000] in \u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026lt;filename\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022atn\u0022\u003Eunknown\u003C/span\u003E\u003Cspan class=\u0022tag\u0022\u003E\u0026gt;\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E:0 \u003C/span\u003E\u003C/pre\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-html prettyprinted\u0022\u003E\n\u003Cspan class=\u0022pln\u0022\u003Ed3d11: failed to create staging 2D texture w=6 h=6 d3dfmt=77 [80070057]\nd3d11: failed to create staging 2D texture w=3 h=3 d3dfmt=77 [80070057]\nLoad(Texture): scatterer/config/Sunflares/Sun/Ghost1\n \n(Filename: C:/buildslave/unity/build/artifacts/generated/common/runtime/DebugBindings.gen.cpp Line: 51)\n\nd3d11: failed to create staging 2D texture w=6 h=6 d3dfmt=77 [80070057]\nd3d11: failed to create staging 2D texture w=3 h=3 d3dfmt=77 [80070057]\nLoad(Texture): scatterer/config/Sunflares/Sun/Ghost2\n \n(Filename: C:/buildslave/unity/build/artifacts/generated/common/runtime/DebugBindings.gen.cpp Line: 51)\n\nLoad(Texture): scatterer/config/Sunflares/Sun/Ghost3\n \n(Filename: C:/buildslave/unity/build/artifacts/generated/common/runtime/DebugBindings.gen.cpp Line: 51)\n\nTexture resolution is not valid for compression: \u0027D:\\KSP\\GameData\\scatterer\\config\\Sunflares\\Sun\\Ghost3.png\u0027 - consider changing the image\u0027s width and height to enable compression\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\nThese were the only problematic entries on the log file for it, as you may guessed, it shouldn\u0027t have caused any vga crashes. The thing is that, after reading some forums, it may look like nvidia\u0027s newer versions of vga have some sort of problem with huge water bodies, and what do we have near \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E? ocean !\n\u003C/p\u003E\n\u003Cp\u003E\nSo, after going trough 3 above steps, removing the ks3p from folder.... no more crashes and everything is fine ! problem solved. \u003Cspan style=\u0022color:#e74c3c;\u0022\u003E\u003Cstrong\u003EAND DON\u0027T UPGRADE DRIVER UNTIL FARTHER NOTICE\u003C/strong\u003E\u003C/span\u003E (caps are for emphasizing not shouting \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E )\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI hope this will help people around if they have this sort of issue, and i remind you it\u0027s not only modded ksp, lots of games have this problem and users are constantly yelling and kicking in forums with support of game developers trolling or not being able to solve the problem !\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit : on farther note, the ks3p had an unofficial dx11 compile, got it working and now the scatterer causes the crash to happen ! it looks like no matter what, if you have an NPE (Null Pointer Exception) in your mod list, specially if it\u0027s on a graphical mod, it will cause the crash. But, at the same time, i had the crashing problem on some other games when people said their machine is fine and the game is working. So, I assume the combination of above moves, with proper versions of mods, would make a very stable game.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-23T10:43:22Z\u0022 title=\u002202/23/2019 10:43  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 23, 2019\u003C/time\u003E by Jiraiyah\u003C/strong\u003E\n\u003C/span\u003E\n"}]}