{"TopicId":186152,"ForumId":20,"TopicTitle":"Luna 1/2 Mission in KSP RO help","CreatedByName":"Slav","CreatedById":198314,"CreatedDateTime":"2019-07-07T16:39:28Z","PageNum":1,"Articles":[{"CreatedByName":"Slav","CreatedById":198314,"CreatedDateTime":"2019-07-07T16:39:29Z","Content":"\n\u003Cp\u003E\nHello,\n\u003C/p\u003E\n\u003Cp\u003E\nI am playing KSP 1.6.1 with \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E and a bunch of other mods, however I am struggling to replicate the Luna missions. I am using the pre-made \u0022RN Stock Luna 2\u0022 craft (from the Soviet Probes and Soviet Rockets mods by Raidernick), the craft has plenty of \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E, but I am still unable to reach/impact the moon.\n\u003C/p\u003E\n\u003Cp\u003E\nCorrect me if I am wrong, but here is my understanding of how the real mission went:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Launched from Baikonur\n\u003C/p\u003E\n\u003Cp\u003E\n2. Reached an altitude of about 200-300km (could not find an accurate number), before the main engine of the second stage ran out of fuel\n\u003C/p\u003E\n\u003Cp\u003E\n3. Removed the fairing\n\u003C/p\u003E\n\u003Cp\u003E\n4. Decoupled the upper stage, and lit it\u0027s vernier engines\n\u003C/p\u003E\n\u003Cp\u003E\n5. At the right time it lit the upper stage\u0027s main engine as well (the RD-0105)\n\u003C/p\u003E\n\u003Cp\u003E\n6. When the impact orbit was reached (or in the case of Luna 1, slightly after) the engines shut down.\n\u003C/p\u003E\n\u003Cp\u003E\n7. Decoupled the probe\n\u003C/p\u003E\n\u003Cp\u003E\n8. Impacted/flew close by the Moon\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHere is what I am doing in KSP \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E using the RN Stock Luna 2 craft:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Set the Moon as target\n\u003C/p\u003E\n\u003Cp\u003E\n2. Wait until the inclination of the orbit is as close as possible to the one of the Moon (around 17.5 degrees, according to Mechjeb\u0027s Rendezvous Planner) and the moon is in a proper position (not too far behind or in front of what would become my transfer orbit trajectory)\n\u003C/p\u003E\n\u003Cp\u003E\n3. Launch\n\u003C/p\u003E\n\u003Cp\u003E\n4. Reach about 200-300 km, decouple, light verniers, etc.\n\u003C/p\u003E\n\u003Cp\u003E\n5. Use Mechjeb\u0027s Maneuver Planner to create a node automatically\n\u003C/p\u003E\n\u003Cp\u003E\n       5.1. Select \u0022bi-impulsive (Hohmann) transfer to target\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n      5.2. Select \u0022intercept only, no capture burn (impact/flyby)\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n      5.3. Select \u0022create node at next apoapsis\u0022, because otherwise it creates a node after one orbit has passed, and the craft is not in orbit\n\u003C/p\u003E\n\u003Cp\u003E\n      5.4. Click \u0022create node\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n6. Align the upper stage with the node, wait untill the required burn time is split 50/50 before and after the node.\n\u003C/p\u003E\n\u003Cp\u003E\n7. light the main engine, burn until fuel runs out.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe craft itself (according to Mechjeb\u0027s \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E stats has 13176 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E. However no matter what I do I still fall short by at least 1000 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E on the upper stage.\n\u003C/p\u003E\n\u003Cp\u003E\nI tried warping back and forward before launching to change the position of the Moon in it\u0027s orbit, tried playing with the inclination and initial altitude, but no luck.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat am I doing wrong, why am I unable to reach the Moon?\n\u003C/p\u003E\n\u003Cp\u003E\nI tried looking for a tutorial/info about this mission and it\u0027s mission profile, but I was unable to find anything detailed.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2019-07-07T19:40:11Z","Content":"\n\u003Cp\u003E\nMoving to Add-on Discussions.\n\u003C/p\u003E\n"},{"CreatedByName":"Slav","CreatedById":198314,"CreatedDateTime":"2019-07-11T11:27:34Z","Content":"\n\u003Cp\u003E\nOkay it turned out the problem consisted of 2 parts:\n\u003C/p\u003E\n\u003Cp\u003E\n1.The rocket was meant for use with the stock planetary system. It is even in the name \u0022RN STOCK Luna 2\u0022. The right craft is \u0022 \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E RN Luna 2 \u0022. But who reads the names of the crafts anyway? \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n2. It turns out it is rather difficult to hit the moon directly without first making a parking orbit. After a few days of trying I managed to impact it by letting the Moon reach a point in its orbit when two statements are true:\n\u003C/p\u003E\n\u003Cp\u003E\n    a. The relative inclination is about or less than 25 degrees.\n\u003C/p\u003E\n\u003Cp\u003E\n    b. The moon and the Baikonur launch site are on the opposite sides of the Earth (not sure if that makes sense, I can upload a photo if needed)\n\u003C/p\u003E\n\u003Cp\u003E\nAfter both of those are true, I selected the Moon as target and launched roughly to the east, but with a heading of less than 90 degrees (specifically 70 degrees in my case), but how much exactly will depend on where the prograde target of the moon is on the navball (as long as it is in a heading of less than 90 degrees). Effectively the rocket\u0027s prograde vector should be directly above that target and slowly coming down towards it. After the first stage is out, the apoapsis should be at 200-300km and time to apoapsis should be about 3-5 minutes. After that I immediately create the node with Mechjeb as usual, tweak it from the map view (if it does not show a direct impact) and let Mechjeb execute it. (of course I first stage, to remove the used stage).\n\u003C/p\u003E\n\u003Cp\u003E\nDoing all this should allow for minor radial burn, which should allow for a burn node with about 4500-4900 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-07-11T11:29:54Z\u0022 title=\u002207/11/2019 11:29  AM\u0022 data-short=\u00224 yr\u0022\u003EJuly 11, 2019\u003C/time\u003E by Slav\u003C/strong\u003E\n\u003C/span\u003E\n"}]}