{"TopicId":195492,"ForumId":20,"TopicTitle":"RO/IFS and making history.","CreatedByName":"Spheroid","CreatedById":206076,"CreatedDateTime":"2020-07-09T14:27:54Z","PageNum":1,"Articles":[{"CreatedByName":"Spheroid","CreatedById":206076,"CreatedDateTime":"2020-07-09T14:27:54Z","Content":"\n\u003Cp\u003E\nI asked a question in the IFS thread yesterday but I found out almost nobody replies since the last few weeks.\n\u003C/p\u003E\n\u003Cp\u003E\nInstalling Realism overhaul turns the making history parts into structural pieces, i can\u0027t recall any information that MH is unsupported by \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E, so,  is it?\n\u003C/p\u003E\n\u003Cp\u003E\nI thought that by using interstellar fuel switch I could just edit the tanks regardless, but as it turns out, the parts aren\u0027t recognized as fuel tanks at all.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is spiteful because many of the realism overhaul cockpits have the 1.875m attachment nodes and while I do use \u003Cu\u003EProcedural parts\u003C/u\u003E which I\u0027m not fan of \u003Cem\u003Ebut seems mandatory for \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E/\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E\u003C/em\u003E I definitely like the extra variety of the MH parts.\n\u003C/p\u003E\n\u003Cp\u003E\nIs there a patch in and of itself or a config line I could add to the MH parts to make them work as fuel tanks?\n\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2020-07-10T21:59:59Z","Content":"\n\u003Cp\u003E\nI think you are refering to the scriot that allows you to configure fuel tanks with a different configuration. IFS dusables itself whenerver id detect another fuel switchhing patmodule on a part. This is probably the case here. Yuo should still b able to use the Dedicated IFS tanks if you installed the full version.\n\u003C/p\u003E\n"}]}