{"TopicId":203638,"ForumId":20,"TopicTitle":"can anyone help me with the best mods","CreatedByName":"Hamez2.0","CreatedById":212624,"CreatedDateTime":"2021-07-05T19:38:14Z","PageNum":1,"Articles":[{"CreatedByName":"Hamez2.0","CreatedById":212624,"CreatedDateTime":"2021-07-05T19:38:14Z","Content":"\n\u003Cp\u003E\nI have some ideas on the type of mods such as:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nspace x stuff (with crew dragon parts)\n\u003C/li\u003E\n\u003Cli\u003E\nreal solar system \n\u003C/li\u003E\n\u003Cli\u003E\ngood parts mods \n\u003C/li\u003E\n\u003Cli\u003E\nsome realistic graphics mods \n\u003C/li\u003E\n\u003Cli\u003E\nand some more science equipment\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nplease reply with some cool mods that you recommend as well.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-06T09:34:01Z","Content":"\n\u003Cp\u003E\nThere are two very different paths for you to go down. One is \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1, the other is not.\n\u003C/p\u003E\n\u003Cp\u003E\nRealism Overhaul and Realistic Progression 1 are built to turn KSP into Human Space Program, with real rocket engines, realistic technologies and, in the case of RP-1, a tech tree that reflects real life technological developments. If you want to try and beat Sputnik to orbit or Apollo 11 to the Moon, this is the game for you- but be warned, this is a pretty hefty mod set that requires many gigabytes of memory and which takes a good 15\u002B minutes to load even on an SSD, and game performance can be a bit slow because it’s being made to do things that it was never really designed to do.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are a few options for \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E graphics mods- RSSVE, EVO and the still-WIP REO; if your PC can handle the load, EVO looks incredible and has a few neat features such as dust storms on Mars, but if not then RSSVE is less intensive but still looks good.\n\u003C/p\u003E\n\u003Cp\u003E\nFor parts, you could go down the route of using mods that include real rocket parts- BDB and Tantares cover most US and Soviet designs respectively- and replicate real missions, or go for the procedural parts route and make everything yourself, which can take a lot of fiddling but is also more flexible and lets you build your own stuff instead. There’s also a Kerbalism config for \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E that makes the science system more realistic (no more one-click results, experiments take time- sometimes decades!) as well as adding life support. For SpaceX stuff, I think Tundra Exploration works with \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nBe warned, \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1/\u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E is a very different experience to stock KSP!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nThe other alternative is to do something completely different and more Kerbal-related. Try out a new planet pack with some new challenges- Beyond Home, Whirligig World, Grannus and more are available at stock scale, or if you want something bigger and more difficult you could try JNSQ or resizing either the stock solar system or a planet pack- Beyond Home has a config to make it bigger and Grannus has a patch to make it work with JNSQ, for example.\n\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2021-07-06T16:16:22Z","Content":"\n\u003Cp\u003E\nHow much KSP experience do you have? If you have enough that stock gameplay has become very easy and you want a bit more challenge, I highly recommend the \u003Cem\u003E\u003Cstrong\u003EJNSQ\u003C/strong\u003E\u003C/em\u003E planet pack. It\u0027s a rescaled 2.7x system, so getting into orbit is more challenging and you\u0027ll need to design better rockets. The JNSQ thread provides a lot more information.\n\u003C/p\u003E\n\u003Cp\u003E\n2 good visual mods are \u003Cem\u003E\u003Cstrong\u003EScatterer\u003C/strong\u003E \u003C/em\u003Eand \u003Cem\u003E\u003Cstrong\u003EEnvironmental Visual Enhancements\u003C/strong\u003E\u003C/em\u003E. They work with stock, JNSQ, and many other planet packs,\n\u003C/p\u003E\n\u003Cp\u003E\nThere are so many parts packs that it\u0027s tempting to install too many, which clutters the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, complicates construction of new rockets, and slows down the game depending on your PC. Here are a few great options but I recommend using one of them at a time until you get more familiar with modding:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cem\u003E\u003Cstrong\u003EBluedog Design Bureau\u003C/strong\u003E\u003C/em\u003E (BDB): USA historical parts.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cem\u003E\u003Cstrong\u003ETantares\u003C/strong\u003E\u003C/em\u003E: Russian historical parts.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cem\u003E\u003Cstrong\u003EKnes\u003C/strong\u003E\u003C/em\u003E: European historical parts, plus many conceptual parts that never flew.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cem\u003E\u003Cstrong\u003ENear Future\u003C/strong\u003E\u003C/em\u003E: this is a collection of mods, not just one. It adds a flexible set of parts that encourage your own unique designs. Also looks for other mods by the same author (Nertea) that have a similar integrated art style.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}