{"TopicId":209229,"ForumId":20,"TopicTitle":"Any RP1 optional mods not on the recommended list to use?","CreatedByName":"Fihnakis","CreatedById":214199,"CreatedDateTime":"2022-08-04T23:56:08Z","PageNum":1,"Articles":[{"CreatedByName":"Fihnakis","CreatedById":214199,"CreatedDateTime":"2022-08-04T23:56:08Z","Content":"\n\u003Cp\u003E\nBeen away from KSP for a couple years. Looking to set it up for a long game one time install of mods. So there\u0027s the list of suggested mods on RP1 wiki but is there a list of mods or mods you use with RP1 that are known to not break the game? Doing RP1 with sci Fi speculative realism. Also connections to systems outside our own if any will work with RP1. If anything requires more than simple \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003E\u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003Eckan\u003C/abbr\u003E\u003C/abbr\u003E install (writing a compatibility script) then it would be beyond my know how.  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-08-05T04:19:07Z\u0022 title=\u002208/05/2022 04:19  AM\u0022 data-short=\u00221 yr\u0022\u003EAugust 5, 2022\u003C/time\u003E by Fihnakis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2022-08-06T07:37:28Z","Content":"\n\u003Cp\u003E\nCoatl Aerospace ProbesPlus, download the master branch from the GitHub and NOT the version available on \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E. Two reasons really:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nGeneric thruster \u003Ci\u003Ewith a gimbal\u003C/i\u003E;\n\u003C/li\u003E\n\u003Cli\u003E\nTiny radiators to reduce boiloff.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nNear Future Exploration adds a load of new antennas, some of which are actually rather good; Hyperspace makes the game load noticeably faster as long as you don’t need to rebuild the ModuleManager cache; Soundtrack Editor lets you add more music into the game and I use it for every KSP install I make now- there’s a good selection available in the Astronomer’s Music Pack (find it on the AVP front page) and Kevin MacLeod (who did much of the KSP soundtrack) has a vast library of stuff available for free, as do others (again see AMP).\n\u003C/p\u003E\n\u003Cp\u003E\nI can give you a patch I made that makes PicoPort miniature docking ports appear in RP-1, very useful for probes.\n\u003C/p\u003E\n"}]}