{"TopicId":211201,"ForumId":20,"TopicTitle":"Mod to auto-transmit science from laboratory?","CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2022-12-26T17:15:46Z","PageNum":1,"Articles":[{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2022-12-26T17:15:46Z","Content":"\n\u003Cp\u003E\nThe stock lab and most (all?) modded labs become inactive after they\u0027ve converted too much \u0022data\u0022 into \u0022science\u0022. We then have to take manual control of the lab to transmit the science. Are there any mods (not Kerbalism) that transmit lab science in the background?\n\u003C/p\u003E\n\u003Cp\u003E\nMy current playthrough is on fairly hard difficulty and I need the arguably \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E labs to unlock the tech tree. I feel like I\u0027m wasting more time babysitting labs than having fun playing the game. Every 30 days I need to take control of station #1, manually transmit the processed science, control station #2, transmit, repeat. That\u0027s very grindy when my next launch window is a year away and I just want to timewarp instead 12 cycles of transmitting science.\n\u003C/p\u003E\n\u003Cp\u003E\nThe best solution I have so far is to stop using the lab game mechanics, manually calculate how much potential science is in the lab, set an alarm many months away, and when the alarm hits cheat all of that science.\n\u003C/p\u003E\n"},{"CreatedByName":"Krazy1","CreatedById":203523,"CreatedDateTime":"2023-01-15T18:23:16Z","Content":"\n\u003Cp\u003E\nI\u0027m grinding like this too. The deployed science experiments run autonomously... why can\u0027t the lab?\n\u003C/p\u003E\n\u003Cp\u003E\nAdditionally or alternatively it would be nice to  remove the 750 data cap. Then what about the data processing rate above 750? Well, it seems dumb to me that the processing rate changes with the amount of data loaded... just make it constant equivalent to 700 data loaded (about average if it stays between 650 and 750 typically when transmitting 500 science periodically)\n\u003C/p\u003E\n"}]}