{"TopicId":218875,"ForumId":20,"TopicTitle":"Better Plasma FX with Waterfall?","CreatedByName":"DarlesChickens","CreatedById":230248,"CreatedDateTime":"2023-08-12T21:33:30Z","PageNum":1,"Articles":[{"CreatedByName":"DarlesChickens","CreatedById":230248,"CreatedDateTime":"2023-08-12T21:33:30Z","Content":"\n\u003Cp\u003E\nHow easy will it be to make a waterfall config to revamp ksp1s current (bad) reentry and plasma effects? Something like or better what we see posted by the ksp2 Devs? I feel like it is one of the few severely lackluster features of the game.\n\u003C/p\u003E\n"},{"CreatedByName":"RomeoThreeSeven","CreatedById":230249,"CreatedDateTime":"2023-08-12T22:24:47Z","Content":"\n\u003Cp\u003E\nI agree. I don\u0027t understand much in the way of mods, but I heard somewhere that waterfall operates off a mesh system. I imagine it would be possible to tweak the mesh to that generated by the present FX.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-08-12T22:28:28Z\u0022 title=\u002208/12/2023 10:28  PM\u0022 data-short=\u0022Aug 12\u0022\u003EAugust 12, 2023\u003C/time\u003E by RomeoThreeSeven\u003C/strong\u003E\n\u003Cbr\u003EExtra space\n\u003C/span\u003E\n"},{"CreatedByName":"Space Kerbalisation Tech","CreatedById":211297,"CreatedDateTime":"2023-08-13T05:31:39Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/230248-darleschickens/?do=hovercard\u0022 data-mentionid=\u0022230248\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/230248-darleschickens/\u0022 rel=\u0022\u0022\u003E@DarlesChickens\u003C/a\u003E I\u0027m not an actually modder (so it what i\u0027m saying might be wrong and I can\u0027t actually make this into a mod), but based on my experience on how ksp part modules work i think a alternate and easier to implement solution (since stock ksp visual effects aren\u0027t created to run on waterfall and the mod might not support effects on non-ksp part instances so it might be quite challenging to implement it the way you described): making a small part with a extremely efficient jet engine part module configured that produces no thrust and only works at high speeds and high altitudes inside atmosphere of all celestial bodies (i.e. use intakeAtm instead of intakeAir) that will show combustion failure at all other non-reentry conditions (i\u0027m pretty sure this can be done).  Then, you can create a upside down waterfall plume for the \u0027engine\u0027  to use that looks like an actual reentry plasma trail so when you place this reentry effect generating part on the bottom of your vessel, all you need to do is to activate the \u0027engine\u0027 and when the reentry conditions are met, it should produce a stunning plasma trail. Obviously a disadvantage would be the fact that you need to place this part on every ship you build and will no longer count as fully stock (if you usually don\u0027t use mods), but it should be relatively easy to be made into a mod for players to use conveniently since this part would technically be an engine and waterfall is designed to make plumes and effects for engines. This is similar to the idea of a mod I have seen (probably vapor vent or plume party) which has a supersonic visual effect (but without waterfall) that is activated when that part is placed on a plane which is going at mach 1. \n\u003C/p\u003E\n\u003Cp\u003E\nHope this helps.\n\u003C/p\u003E\n"},{"CreatedByName":"DarlesChickens","CreatedById":230248,"CreatedDateTime":"2023-08-13T17:01:01Z","Content":"\n\u003Cp\u003E\nThanks for your insight, that\u0027s very interesting. I\u0027m not anywhere near a modder, but I was thinking of something like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/topic/192648-18x-112x-reentry-particle-effect-renewed-26-mar-2020/\u0022 rel=\u0022\u0022\u003Ereentry particle effects\u003C/a\u003E but modernised.\n\u003C/p\u003E\n"}]}