{"TopicId":225083,"ForumId":20,"TopicTitle":"What is the difference between Dirt and Soil when it comes to Life Support?","CreatedByName":"Xtra","CreatedById":209276,"CreatedDateTime":"2024-06-10T13:40:09Z","PageNum":1,"Articles":[{"CreatedByName":"Xtra","CreatedById":209276,"CreatedDateTime":"2024-06-10T13:40:09Z","Content":"\n\u003Cp\u003E\nThere are several mods in the game which have greenhouse or Snack creation, and several that contain Soil, but when I try to gather/load it in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, I can\u0027t find Soil and (maybe just my level) I don\u0027t see a Converter for it.  I can load up on Dirt, but I can\u0027t seem to find soil.   Then I ran into a post that says Soil is a biproduct of the Kerbals eating Snacks... which makes me believe they\u0027re talking about kerbal bodily waste.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I guess that\u0027s pretty much what I\u0027m trying to figure out... is Soil the biproduct of Kerbals eating or is it converted Dirt and maybe fertilizer?\n\u003C/p\u003E\n"},{"CreatedByName":"JadeOfMaar","CreatedById":167617,"CreatedDateTime":"2024-06-10T20:15:09Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/profile/209276-xtra/?do=hovercard\u0022 data-mentionid=\u0022209276\u0022 href=\u0022https://forum.kerbalspaceprogram.com/profile/209276-xtra/\u0022 rel=\u0022\u0022\u003E@Xtra\u003C/a\u003E Dirt is primarily a mined resource that\u0027s used by MKS\u0027 \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E chains. It\u0027s a low-grade alt to stock Ore (literally, low-grade ore) and represents the continuous but tiny presence of all other crustal resources that you happen to need and do exist on the current planet but might not exist in the current biome. MKS has parts and processes for sifting Dirt. If you don\u0027t use MKS then help yourself and write a converter recipe for yourself for (inefficiently) splitting Dirt into whatever you need.\n\u003C/p\u003E\n\u003Cp\u003E\nSoil is primarily the waste resource of the Snacks! LS mod (equivalent to Mulch in \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E LS) but is treated differently by another mod who\u0027s name I can\u0027t remember and I don\u0027t think it\u0027s a LS mod. Part of how Snacks works is that it adds the Soil Recycler converter to some stock parts (namely the Hitchhiker can) and it adds resources to crewed parts at the points of reloading a craft file in the editor or launching from the editors. I don\u0027t think it adds Soil tankage to every affected part so be mindful of that. Snacks! adds a few 1.25m tanks (they look like the un-Restocked FL-Tx00\u0027s. Can\u0027t miss the green on them) which are switchable between Snacks and/or Soil. They\u0027ll be in either the Utility or Payload? category or the CCK LS category.\n\u003C/p\u003E\n\u003Cp\u003E\nSoil is not a CRP resource, I think, so expect it to be inaccessible without the mods that use it.\n\u003C/p\u003E\n"}]}