{"TopicId":25105,"ForumId":20,"TopicTitle":"The DEFINITIVE mod pack?","CreatedByName":"Jonathan_C_W","CreatedById":62370,"CreatedDateTime":"2013-05-02T08:37:25Z","PageNum":1,"Articles":[{"CreatedByName":"Jonathan_C_W","CreatedById":62370,"CreatedDateTime":"2013-05-02T08:37:25Z","Content":"\n\u003Cp\u003EHey guys!\u003C/p\u003E\u003Cp\u003ESo here is the problem: I have yet to compile a mods pack that doesn\u0027t cause crashes on take-off or other such bugs (I am not a modder, I am just interested in improving the game). What I am after then, is the DEFINITIVE mod pack. That is, the DEFINITIVE mod pack of 20 mods that are sufficient for all the joy to be had from Kerbal, but without the crashes.\u003C/p\u003E\u003Cp\u003EThe demand is simple: 20 mods that work well together\u003C/p\u003E\u003Cp\u003EHere is the criteria: parts (lots of them), autopilots, kethane is a must and then anything else that works great and isn\u0027t prohibitively buggy.\u003C/p\u003E\u003Cp\u003EIf you happen to run what YOU think is the DEFINITIVE mod pack, simply post them here so I can try them out and at last enjoy Kerbal bug-free!\u003C/p\u003E\u003Cp\u003EJonathan\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-05-02T17:29:53Z","Content":"\n\u003Cp\u003EOdds are if you\u0027re crashing a lot, it\u0027s precisely because you have lots of parts loaded. When I had both KW rocketry and the Nova Punch pack installed and many others, KSP would crash on me every other launch. I removed mods that I don\u0027t use, parts from packs that I don\u0027t use, etc. Until we get the new parts storage that\u0027s coming, all parts get loaded when the game loads, and some of those models are not small, so they take up a good bit of memory.\u003C/p\u003E\n"},{"CreatedByName":"Fyrem","CreatedById":57131,"CreatedDateTime":"2013-05-02T18:03:33Z","Content":"\n\u003Cp\u003Ewhy 20? just get/load the mods you NEED. Putting an artificial goal of \u002220\u0022 makes no sense.\u003C/p\u003E\u003Cp\u003Eand besides your \u0022ideal\u0022 mods may not overlap with my \u0022ideal\u0022 mods much at all.\u003C/p\u003E\u003Cp\u003E(personally, I use 7 mods, but I don\u0027t even load everything out of them, I pick and choose).\u003C/p\u003E\n"},{"CreatedByName":"TheCardinal","CreatedById":22874,"CreatedDateTime":"2013-05-02T18:10:44Z","Content":"\n\u003Cp\u003EThe definite mod pack should contain parts not mods. Chances are that 75% of the parts of most mods will never be used by you.Choose the parts you like and use (often) from mods you like. KSP won\u0027t crash as much and loads faster.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-02T18:58:01Z\u0022 title=\u002205/02/2013 06:58  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 2, 2013\u003C/time\u003E by TheCardinal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"aquilux","CreatedById":23859,"CreatedDateTime":"2013-05-03T02:46:00Z","Content":"\n\u003Cp\u003ETo expand on your idea Cardinal, I mention this: \u003Ca href=\u0022http://painterlypack.net/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://painterlypack.net/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESomething in the same style as that would be rather useful. Browse through the different parts available and check off the ones you want. Maybe even build recommendations for other parts to go with what you\u0027ve already selected based off of statistical data about what other people have downloaded (like what amazon does with their suggestions).\u003C/p\u003E\n"},{"CreatedByName":"lyndonguitar","CreatedById":61194,"CreatedDateTime":"2013-05-03T08:02:53Z","Content":"\n\u003Cp\u003EWhat I do is I delete parts that I don\u0027t want/not gonna use, BUT we should be able to delete parts in the game itself, so we can delete easier, its a hassle to select mod parts to delete as of now\u003C/p\u003E\n"}]}