{"TopicId":25481,"ForumId":20,"TopicTitle":"Vanilla or Mods?","CreatedByName":"Lobo1544","CreatedById":61396,"CreatedDateTime":"2013-05-04T21:45:12Z","PageNum":2,"Articles":[{"CreatedByName":"loppnessmonsta","CreatedById":58525,"CreatedDateTime":"2013-05-05T05:50:09Z","Content":"\n\u003Cp\u003EI keep a text file in my install folder to help me keep track of which mods I\u0027ve installed. Currently: \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EPayloader\u003Cp\u003ESubassembly Loader\u003C/p\u003E\u003Cp\u003EMechJeb 1.9\u003C/p\u003E\u003Cp\u003EMechJeb Command Pod (Partial)\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock\u003C/p\u003E\u003Cp\u003EIon Engine Sounds\u003C/p\u003E\u003Cp\u003ERomfarer\u0027s Robotic Arms Pack\u003C/p\u003E\u003Cp\u003EB9 Aerospace Pack R2-5\u003C/p\u003E\u003Cp\u003EKW Rocketry\u003C/p\u003E\u003Cp\u003ECommon Berthing Mechanism\u003C/p\u003E\u003Cp\u003EKSPX\u003C/p\u003E\u003Cp\u003EStock Improvement Pack\u003C/p\u003E\u003Cp\u003EKAS\u003C/p\u003E\u003Cp\u003ENucleonics NTR\u003C/p\u003E\u003Cp\u003ETAC Fuel Balancer\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut that\u0027s too many. I seem to lose interest in the game when I have too many parts. So I\u0027m probably going to do a fresh install (While rescuing my current designs and whatnot) and re-install all of the non-part addons, and only parts of, for example, the B9 pack and KW. Even though both of those packs are very cool and fun, they just eat up my PC\u0027s resources too much and overwhelm me. I\u0027m probably not going to re-install the Nucleonics pack at all, even though I like it a lot, because it overlaps with the KSPX pack. Or maybe I\u0027ll just do a partial of KSPX and keep the Nucleonics. I\u0027ll see.\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2013-05-05T06:04:50Z","Content":"\n\u003Cp\u003EI hate mods and play pure stock with skill\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-05T06:20:53Z","Content":"\n\u003Cp\u003EI don\u0027t use mods because: \u003C/p\u003E\u003Cp\u003E1) I like the challenge. \u003C/p\u003E\u003Cp\u003E2) I don\u0027t want to become dependent on something that might be broken the next time an update comes out, with the additional possibility that its creator won\u0027t be around to fix it. \u003C/p\u003E\u003Cp\u003E3) I hate fighting with glitches and so don\u0027t want to clutter the game\u0027s software with additions. Look around the forum at all the posts that say stuff like, \u0022I installed Mod X and now all my rocket engines thrust backwards!\u0022 Who needs the headaches? \u003C/p\u003E\u003Cp\u003E4) I want to be excited when Squad adds a new part or feature, and not just say, \u0022Ho hum, I was doing that with Mod X two months ago.\u0022 I think my interest in the game will last longer this way. \u003C/p\u003E\u003Cp\u003E5) It gives me a common basis to share ideas and accomplishments with other players. By contrast, when I see a post that says \u0022Look what I did!\u0022 with a modded-out ship, how the expletive can I tell whether that was a difficult accomplishment or somebody just pressed a button that said, \u0022Perform feat now\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-05-05T07:08:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022superm18\u0022 data-cite=\u0022superm18\u0022\u003E\u003Cdiv\u003EI hate mods and play pure stock with skill\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003E1) I like the challenge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGotta love people that assume that mods remove the challenge. Yes, there are mods that reduce or eliminate the challenge. There are also mods that increase the challenge, and many mods that actually have no effect on the challenge.\u003C/p\u003E\u003Cp\u003ELet\u0027s see, at the moment I have five installs.\u003C/p\u003E\u003Cp\u003E1) Stock, because the reddit weekly challenges require stock.\u003C/p\u003E\u003Cp\u003E2) Stock \u002B KER: Once a month, I do a Mun mission with this one just to make sure I haven\u0027t picked up any dependancies on addons. KER is just so that I don\u0027t have to spend too much time experimenting to get the delta-V right, since I hate to overbuild Mun missions, and I always start from the ground up on this.\u003C/p\u003E\u003Cp\u003E3) Stock \u002B Deadly Reentry: One weekly challenge super hard mode required this mod, and I liked it enough to keep it around, but I haven\u0027t integrated it into my regular install yet since I\u0027ve got a few ongoing missions that it would affect.\u003C/p\u003E\u003Cp\u003E4) General. This is where I do the bulk of my play. No parts that are OP compared to the stock parts, no parts that I never use. Other than that, my imagination doesn\u0027t like arbitrary restrictions, so I keep my options open. Subloader, Kerbal Alarm Clock, Kerbal Crew Manifest, KER, Damned Robotics, KAS, Kethane, Home Habitat, Robotic Arms, and I had the Bobcat Cart stuff until 0.19. Sometimes I even have the Hooligan Airships mod installed.\u003C/p\u003E\u003Cp\u003E5) The install that doesn\u0027t count: This is for the wild ideas. No limits, I even have hyperedit installed if I want to test something on some planet but don\u0027t want to take the time to get there just for a 5 minute test. I don\u0027t even discuss what I do there on the forums unless it\u0027s an experiment where the results apply to some other situation.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-05T07:16:50Z","Content":"\n\u003Cp\u003EI love mods. The only problem i have with them is that the game frequently crashes if you have to many of them. And to all the people that think mods make the game easier, try some part packs like KW or NovaPunch.\u003C/p\u003E\n"},{"CreatedByName":"Tristavius","CreatedById":60879,"CreatedDateTime":"2013-05-05T07:21:04Z","Content":"\n\u003Cp\u003EMy rule for mods is simple. The mod must not add any kind of auto-control or in flight readout or part which isn\u0027t stock. All my ships must be 100% stock. I only use mods which provide handy functionality during design or UI improvements during flight. They must replicate something I can achieve myself on paper. I think very carefully about mods before using them. My list and justifications are as follows..\u003C/p\u003E\u003Cp\u003EActions On The Fly: Just a UI improvement allowing for action group changes in flight, something I\u0027m 99% sure will come into the game at some stage and used to correct bugs in conglomerate ships.\u003C/p\u003E\u003Cp\u003EEngineer Redux: Used in the VAB/SPH only to calculate the TWR/Delta V to save a lot of scribbling on paper. Never launched with one attached or that would break my rules.\u003C/p\u003E\u003Cp\u003EHaystack: To correct the problems targeting things with the UI.\u003C/p\u003E\u003Cp\u003EProtractor: Again to save doing lots of calculations on paper and holding up pieces of paper to the screen to work out angles. Never launched with a ship,I just have one rover at the KSC with one attached. Without one in space I still have to work our my burn angles myself, I just use protractor to get the destination planet in the right ballpark and save lots of reloading from trying to eye-ball it.\u003C/p\u003E\u003Cp\u003ESub Assembly Loader: Probably the most important mod out there, and a feature that\u0027s bound to be in the game sooner or later.\u003C/p\u003E\u003Cp\u003EAnd Finally, ISA MapSat... the only one not conforming to my normal rules but I feel the functionality it adds is not game changing and does not make life easier or adjust the balance in any way, but adds a very good reason to send satellites to places and an objective to game play. I launch mapping satellites which are my only non-stock vehicles.\u003C/p\u003E\u003Cp\u003EI will never, ever use anything like MechJeb... takes away far too much from the game for me.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-05-05T07:44:49Z","Content":"\n\u003Cp\u003EI do actually use part add-ons. Adds more parts and option to the game, but I maintain 2 save files: one stock, one modded. I do stay myself away from plugins though, particularly those who make the game easier by putting you into orbit without much effort or mess up the whole game by altering planetary orbits (I think you know what plugins I am talking about).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lobo1544\u0022 data-cite=\u0022Lobo1544\u0022\u003E\u003Cdiv\u003EI have recntly have been playing with a few mods, which I like, but they just add TOO MANY PARTS (cough cough KW Rocketry). I think I\u0027m going to delete all the mods and start a new game. So I was wondering what you have to say on the subject.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CoriW\u0022 data-cite=\u0022CoriW\u0022\u003E\u003Cdiv\u003EPersonally I really dislike mods that add a whole bunch of parts, I\u0027ve been debating on KSPX for a long time but still am just putting off using it simply because it adds \u0022A whole bunch of parts\u0022 (Also because the dev of that mod is now a KSP dev so I hope to see some of those parts in Stock hopefully within the next few updates.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Qumefox\u0022 data-cite=\u0022Qumefox\u0022\u003E\u003Cdiv\u003EAnd playing KSP with lots of mods is like driving a car that has 400 spare tires.. \u003Cp\u003EOr in mechjeb\u0027s case, having a chauffeur, so you\u0027re not driving at all, only along for the ride. \u003C/p\u003E\u003Cp\u003ESome of us run pretty much vanilla because we LIKE the fact it\u0027s not just easy mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022superm18\u0022 data-cite=\u0022superm18\u0022\u003E\u003Cdiv\u003EI hate mods and play pure stock with skill\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EI don\u0027t use mods because: \u003Cp\u003E1) I like the challenge. \u003C/p\u003E\u003Cp\u003E2) I don\u0027t want to become dependent on something that might be broken the next time an update comes out, with the additional possibility that its creator won\u0027t be around to fix it. \u003C/p\u003E\u003Cp\u003E3) I hate fighting with glitches and so don\u0027t want to clutter the game\u0027s software with additions. Look around the forum at all the posts that say stuff like, \u0022I installed Mod X and now all my rocket engines thrust backwards!\u0022 Who needs the headaches? \u003C/p\u003E\u003Cp\u003E4) I want to be excited when Squad adds a new part or feature, and not just say, \u0022Ho hum, I was doing that with Mod X two months ago.\u0022 I think my interest in the game will last longer this way. \u003C/p\u003E\u003Cp\u003E5) It gives me a common basis to share ideas and accomplishments with other players. By contrast, when I see a post that says \u0022Look what I did!\u0022 with a modded-out ship, how the expletive can I tell whether that was a difficult accomplishment or somebody just pressed a button that said, \u0022Perform feat now\u0022?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/mM3rp.jpg\u0022 alt=\u0022mM3rp.jpg\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"lobsterbark","CreatedById":57253,"CreatedDateTime":"2013-05-05T08:08:39Z","Content":"\n\u003Cp\u003EWhy are there so many weird \u0022ermegurd i dont use no mods so im better than evry one else\u0022 people, all of the sudden.\u003C/p\u003E\n"},{"CreatedByName":"Trux","CreatedById":44041,"CreatedDateTime":"2013-05-05T08:22:52Z","Content":"\n\u003Cp\u003EI like to pick and choose, some I use are KW Rocketry (Although I deleted all the 3M\u002B parts), Protractor, KSPX, Robotic arms and other I can\u0027t remember right now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Felsmak","CreatedById":27187,"CreatedDateTime":"2013-05-05T08:25:57Z","Content":"\n\u003Cp\u003EI prefer vanilla, but occasionally I\u0027ll install some mods only to uninstall them later. It just seems like mods somehow corrupt the game so that I have to reinstall, but that could just be bad luck. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-05T08:33:57Z\u0022 title=\u002205/05/2013 08:33  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 5, 2013\u003C/time\u003E by Felsmak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Unistrut","CreatedById":2229,"CreatedDateTime":"2013-05-05T08:26:32Z","Content":"\n\u003Cp\u003EOh, they\u0027ve always been here. There\u0027s a reason the Planet Ribbon post includes a specific mention about not asking me to make different devices for people who don\u0027t use mods. My mom worked on satellites. Launching a real satellite is way closer to MechJeb than stock KSP. There is no joystick. There is no GUI. You stare at a lot of numbers and sometimes get to give the computer permission to do the next step.\u003C/p\u003E\n"},{"CreatedByName":"Custard Donut (In Space)","CreatedById":58058,"CreatedDateTime":"2013-05-05T08:38:36Z","Content":"\n\u003Cp\u003ESo far i tried Mechjeb for a few minutes before realising the only thing i wanted from all of it\u0027s many features was the real surface height (sea-surface makes it harder for me to land) and satellite mapping, which i thought was a great mod except it slows down my pc too much, lastly i tried a mod that gave me a whole load of new parts, i quickly realised it was pointless for someone like me who is yet to fully understand all the vanilla stock parts.\u003C/p\u003E\u003Cp\u003ESo i\u0027m on vanilla again, i hope to try mods in the future but at a much later stage, once i\u0027m fully familiar with all the standard stuff already in the game.\u003C/p\u003E\u003Cp\u003EEdit* Athough not mods i have taken a great liking for downloading other people\u0027s ships, i gawp at them much as a caveman would gawp at a UFO and i learn nice tips from how they are made.\u003C/p\u003E\u003Cp\u003EDouble Edit* I\u0027m actually thinking of getting chatterer mod, if it leaves my game running smoothly i\u0027l hold on to it as it doesn\u0027t change any physics in the game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-05T08:44:27Z\u0022 title=\u002205/05/2013 08:44  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 5, 2013\u003C/time\u003E by Custard Donut (In Space)\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fourjays","CreatedById":60289,"CreatedDateTime":"2013-05-05T09:00:31Z","Content":"\n\u003Cp\u003EI almost have to use KW Rocketry... just adds a whole new level of challenge on the part of KSP I enjoy most (building rockets). It is far more interesting and challenging to build a probe/rover/satellite/whatever to fit within a fairing space of a pre-determined size (while still doing everything it needs to), than to come up with the probe/rover/satellite/whatever first and then just bolt enough rockets round it for it to reach orbit. I spent a whole weekend making a landing system for a rover that could land safely, drop the rover intact, allow the rover to drive off (without fire the lander\u0027s rockets and potentially damaging the rover) and still fit inside a 2.5m fairing (which was the hardest part). Was worth the effort (and all the testing on Kerbin) when it landed and released the rover successfully.\u003C/p\u003E\u003Cp\u003EAside from that I\u0027ve only got mods that add functionality and features. I generally try to keep them to a minimum.\u003C/p\u003E\n"},{"CreatedByName":"Sempiternal","CreatedById":63447,"CreatedDateTime":"2013-05-05T09:03:14Z","Content":"\n\u003Cp\u003EI rarely play with mods, and when I do they NEED to be VERY well balanced.\u003C/p\u003E\u003Cp\u003EThat\u0027s why KAS and KSPX are my favourites.\u003C/p\u003E\n"},{"CreatedByName":"Uncle Mort","CreatedById":57933,"CreatedDateTime":"2013-05-05T09:04:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lobsterbark\u0022 data-cite=\u0022lobsterbark\u0022\u003E\u003Cdiv\u003EWhy are there so many weird \u0022ermegurd i dont use no mods so im better than evry one else\u0022 people, all of the sudden.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know what you mean; sometimes it gets to be like a religious argument, the Purists vs. the Heretics.\u003C/p\u003E\u003Cp\u003EMe? I\u0027m a heretic.\u003C/p\u003E\u003Cp\u003EMechjeb\u003C/p\u003E\u003Cp\u003EHOME\u003C/p\u003E\u003Cp\u003EMapSat\u003C/p\u003E\u003Cp\u003EKethane\u003C/p\u003E\u003Cp\u003EKSPX parts\u003C/p\u003E\u003Cp\u003EDeep Space parts\u003C/p\u003E\u003Cp\u003EKAS science module\u003C/p\u003E\u003Cp\u003EBase inflatable\u003C/p\u003E\u003Cp\u003ESubassembly\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-05T09:15:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EGotta love people that assume that mods remove the challenge. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003EDid I say EVERY mod makes the game easier? The question posed by this thread is whether *I* use mods, and that was \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003Eone of\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003E my \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003Eseveral \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-family:Calibri;\u0022\u003Ereasons. And did I tell you or anyone else that you shouldn\u0027t use mods, or imply that I\u0027m superior because I don\u0027t? There\u0027s no reason to get snotty about it. \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-05-05T14:41:10Z","Content":"\n\u003Cp\u003EKSP is in a very early stage of development and still has a lot to look like a complete game.\u003C/p\u003E\u003Cp\u003EFor this reason Mods are almost a must have. Also we always found something that fix better with our personality.\u003C/p\u003E\u003Cp\u003EI try to be very selected with the mods that I add, becoz a perfect game would be the one that with least amount of parts you could build anything you want.\u003C/p\u003E\u003Cp\u003EThis is my list:\u003C/p\u003E\u003Cp\u003E- Subassembly Loader\u003C/p\u003E\u003Cp\u003E- Actions On The Fly\u003C/p\u003E\u003Cp\u003E- MechJeb (Everything big that flys in earth is by computers. Also is perfect to program rovers or probes to make automated actions. Adds fun, And I dont have joystick XD) \u003C/p\u003E\u003Cp\u003E- Kerbal Crew Manifest\u003C/p\u003E\u003Cp\u003E- Fuel vent (part to remove the fuel from the tanks.)\u003C/p\u003E\u003Cp\u003E- Throttle Steering (I just add the module section to each engine, then i can use it or not by action groups)\u003C/p\u003E\u003Cp\u003E- RemoteTech (adds gameplay, I delete some parts)\u003C/p\u003E\u003Cp\u003E- Ioncross Crew Support (I only need an extra food system and the game looks real) \u003C/p\u003E\u003Cp\u003E- Kerbal Attachment System (love it)\u003C/p\u003E\u003Cp\u003E- Mps Nautilus (3 parts, ring habitats for artificial gravity, makes long time periods more credible)\u003C/p\u003E\u003Cp\u003E- Inflatable Module (this is something that the game needs for sure)\u003C/p\u003E\u003Cp\u003E- KSPX (only 6 parts)\u003C/p\u003E\u003Cp\u003E- Home Habitats\u003C/p\u003E\u003Cp\u003E- Jool 5 (to lauch Home habitats or heavy things without kill my computer with lag)\u003C/p\u003E\u003Cp\u003E- Escape Pod (only the pod part, just becoz is cute, I reduce their fuel values) \u003C/p\u003E\u003Cp\u003E- Damned Robotics (just 1 part for now)\u003C/p\u003E\u003Cp\u003E- Aviation lights (3 parts, just becoz this game needs more lights)\u003C/p\u003E\u003Cp\u003E- 2 Pods and some legs (An extra pod like Munox and one pair of legs that I need)\u003C/p\u003E\u003Cp\u003E- B9 Aerospace (This is my doom, it has 89 parts!! But all looks so perfect and fix well, i dont know how to cut parts here. Maybe After I design 1 small space plane and 1 shuttle, I will remove all the other parts that these planes dont use.)\u003C/p\u003E\u003Cp\u003E------------------------------------\u003C/p\u003E\u003Cp\u003EI dont have these yet, becoz I am not sure if it will make the game more unstable or for other issues.\u003C/p\u003E\u003Cp\u003E- ISA Mapsat\u003C/p\u003E\u003Cp\u003E- Lazor Docking Cam (I LOVE IT, but I TOTALLY HATE the bug that makes the lauch stability explode)\u003C/p\u003E\u003Cp\u003E- Rototic Arms Pack (i am not sure, maybe I can remplace that with Damned Robotics)\u003C/p\u003E\u003Cp\u003E- Enginner Redux (maybe just for the VAH section)\u003C/p\u003E\u003Cp\u003EThen, I dont like any weapon mods, or some others that are not based in real physsics (alias quantum strut XD).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-05T15:00:25Z\u0022 title=\u002205/05/2013 03:00  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 5, 2013\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MmPMSFmM","CreatedById":56831,"CreatedDateTime":"2013-05-05T17:58:00Z","Content":"\n\u003Cp\u003EI use kerbal alarm clock, haystack, lazor docking cam and sub-assembly loader for several things, as it makes them much easier.\u003C/p\u003E\u003Cp\u003EI have KSPX, Dummy weights, Damned robotics and KW Rocketry for the parts, but I\u0027m planning on removing them all except for KSPX as I never use them.\u003C/p\u003E\u003Cp\u003EI am also going to install Mechjeb, solely for the information.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-05T18:00:51Z\u0022 title=\u002205/05/2013 06:00  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 5, 2013\u003C/time\u003E by MmPMSFmM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thrashing mad","CreatedById":61251,"CreatedDateTime":"2013-05-05T18:06:36Z","Content":"\n\u003Cp\u003EI use only Deadly Reentry mod for extra challenge.\u003C/p\u003E\n"},{"CreatedByName":"iDan122","CreatedById":24439,"CreatedDateTime":"2013-05-05T18:19:00Z","Content":"\n\u003Cp\u003EPros: adds new useful stuff,decreases lag\u003C/p\u003E\u003Cp\u003ECons: problems updating KSP version, aka saving your saves\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-05T19:38:09Z","Content":"\n\u003Cp\u003EMods. Lots of mods, though I do discard the bits I end up never using. So you might say my install of KSP isn\u0027t vanilla, just cherry-picked.\u003C/p\u003E\n"},{"CreatedByName":"Atanar","CreatedById":59913,"CreatedDateTime":"2013-05-05T19:48:39Z","Content":"\n\u003Cp\u003EHaving no mods improves synergy with the community. How can you do a challenge when people have some better parts in their mods? How can you donwnload a craft file without getting annoyed if it isn\u0027t stock parts?\u003C/p\u003E\u003Cp\u003EAlso I refuse to play with modded parts that should be in the game. It\u0027s the devellopers job! Don\u0027t tell me to use something someone created for free when it fills the gap for something I already payed for!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EI want to hear \u0022the devellopers should add x\u0022 instead of \u0022you should use mod x\u0022 when someone has a problem!!!\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-05-05T20:06:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003EHaving no mods improves synergy with the community.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETell that to the modding community and see how great their synergy is to the people.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003EHow can you do a challenge when people have some better parts in their mods?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why people who post imposes \u003Cstrong\u003Erules\u003C/strong\u003E on the challenge they create, whether they will allow mods or stock only, plugins, etc.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003EHow can you donwnload a craft file without getting annoyed if it isn\u0027t stock parts?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why people tell if the crafts they are sharing needs some parts and add-ons that must be installed first before they can use them. Also, can you elaborate why in the world a non-stock craft file annoy you?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso I refuse to play with modded parts that should be in the game. It\u0027s the devellopers job! Don\u0027t tell me to use something someone created for free when it fills the gap for something I already payed for!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EI want to hear \u0022the devellopers should add x\u0022 instead of \u0022you should use mod x\u0022 when someone has a problem!!!\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPutting this here for the second time, just for you:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/mM3rp.jpg\u0022 alt=\u0022mM3rp.jpg\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHave a nice day. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-05-05T20:51:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EDid I say EVERY mod makes the game easier?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot explicitly, but you listed preferring the challenge of stock KSP as your number one reason for avoiding mods. Not as your reason for avoiding overpowered or imbalanced mods, but all mods.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003Eand that was \u003Cem\u003Eone of\u003C/em\u003E my \u003Cem\u003Eseveral \u003C/em\u003Ereasons.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd the other reasons are things I can get behind. I even mentioned something very close to one of your other reasons in my own post.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003EAnd did I tell you or anyone else that you shouldn\u0027t use mods, or imply that I\u0027m superior because I don\u0027t?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd did I tell you that I thought you said any of those things? No, I didn\u0027t, and I apologize if it sounded like I was implying that. \u003C/p\u003E\u003Cp\u003EI went after one logical fallacy, and I should have done a better, less flippant, job of that. I\u0027d rather you disagree with me because of sound reasoning than agree with me because of a logical fallacy. I\u0027m not immune to that, so I don\u0027t mind it when people point it out in myself. I\u0027m very much a \u0022find the fun wherever you find it\u0022 kind of person/player, even when where you found it confuses the heck out of me. The only reason I\u0027m (overly?) sensitive on this is because it colors the opinions of people that don\u0027t have any facts to form an opinion on. Most of the new KSP players I talk with fall into two categories (note: the proportions don\u0027t mean anything, as this could be viewed as a bit of a self-selecting survey). There\u0027s the players that load up on mods, sometimes to excess. There\u0027s the players that avoid mods like the plague, despite never having tried them, just because they\u0027ve heard that mods take the challenge out of the game. Yes, there are players that try mods and find they like vanilla better, and I\u0027m fine with that, since it\u0027s an informed opinion.\u003C/p\u003E\u003Cp\u003EThe whole \u0022I\u0027m better than you because I play the game the way it was meant to be played,\u0022 while sometimes annoying, is a separate issue and one that I would rather not stir up, other than pointing out that it exists in response to the \u0022or anyone else\u0022 part of that third quote. Noone\u0027s said it explicitly in this thread, but I can assure you that I could point to several examples of that prior to the great forum oops, including one person going so far as to advocate that the devs should remove the ability to mod the game altogether.\u003C/p\u003E\u003Cp\u003ETrust me, I get why you went off when you felt like you were being attacked. While your post didn\u0027t feel like an attack, there have been posts that felt like a personal attack that basically read that all my efforts mean nothing because I use mods, despite the fact that I make an effort to avoid out of balance mods and parts. Most of the time, I just let it roll off, another uninformed opinion. But some times, you just want to stomp the logical fallacy flat before it infects yet more players.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atanar\u0022 data-cite=\u0022Atanar\u0022\u003E\u003Cdiv\u003EAlso I refuse to play with modded parts that should be in the game. It\u0027s the devellopers job! Don\u0027t tell me to use something someone created for free when it fills the gap for something I already payed for!\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EI want to hear \u0022the devellopers should add x\u0022 instead of \u0022you should use mod x\u0022 when someone has a problem!!!\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf the developers had enough time to do everything that the users could possibly want as soon as they wanted it, you \u003Cstrong\u003EMIGHT\u003C/strong\u003E have a point. We don\u0027t live in that universe.\u003C/p\u003E\u003Cp\u003EIn the case of not-unlimited developer resources, there will always be something that the devs haven\u0027t had time for. You\u0027re saying that I shouldn\u0027t be able to play with moving parts because the devs haven\u0027t had time to do their own robotics functions? Even if it\u0027s something that the devs plan on doing, having the modding community do it first gives the devs a look at what kinds of things worked and what didn\u0027t, reducing their development time. And this is a bad thing in your mind? I have to disagree.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-05T21:08:53Z\u0022 title=\u002205/05/2013 09:08  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 5, 2013\u003C/time\u003E by Eric S\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bekiekutmoar","CreatedById":23500,"CreatedDateTime":"2013-05-05T21:19:18Z","Content":"\n\u003Cp\u003EIn my case 100% vanilla ... !\u003C/p\u003E\n"}]}