{"TopicId":25481,"ForumId":20,"TopicTitle":"Vanilla or Mods?","CreatedByName":"Lobo1544","CreatedById":61396,"CreatedDateTime":"2013-05-04T21:45:12Z","PageNum":4,"Articles":[{"CreatedByName":"P.Funk","CreatedById":3080,"CreatedDateTime":"2013-05-06T17:35:14Z","Content":"\n\u003Cp\u003EThere\u0027s too much that\u0027s just not possible without mods. I like to use as much stock stuff as possible while using parts that increase the capability of things I build without giving them a leg up in terms of engine efficiency or fuel payload versus weight.\u003C/p\u003E\u003Cp\u003ESometimes I just wanna try and land the Buran from the Soviet Pack without needing to spend a week trying to build a balanced shuttle and launcher system, you know? There are some things I\u0027d never get around to doing without mods to make getting to the problem possible.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-05-06T18:08:46Z","Content":"\n\u003Cp\u003EWell, in just 1 day 2 more pages \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EAtanar: \u003C/strong\u003E Let me explain my position further:\u003Cp\u003EFirst off, I don\u0027t hate mods. If you play with mods it\u0027s your thing. But I don\u0027t want to be told that I should use mods.\u003C/p\u003E\u003Cp\u003EFull-time working devellopers generally do a better job than hobby modders. Modders have a tendency of not optimising, neither conflicts with other mods nor performance. They add too much often and mess badly with game balance. My experience with other games (minecraft for example) has shown me that. Stuff from modders is so rarely good that it\u0027s hardly worth the efford looking. And I want to play with properly made stuff.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELook, I give you the reason that if you dont have time to be selective with the mods that you use and after install erase all the parts that you not use it comes a point when the experience is negative.\u003C/p\u003E\u003Cp\u003EAnd yes, modders often add too much without care very much in the final result.\u003C/p\u003E\u003Cp\u003EBut all the things that \u003Cstrong\u003EEric\u003C/strong\u003E said was also truth, the dev team cant do everything. And many things that are made by modders fix better than the actual parts. \u003C/p\u003E\u003Cp\u003EFor example, what is the excuse to not add -Subassembly Loader or -Actions On The Fly?\u003C/p\u003E\u003Cp\u003EIf you said that you dont like the other things is ok, but if you have problems with things like those it seems more a problem of fanaticism than reason.\u003C/p\u003E\u003Cp\u003EAbout blainstorming, etc... look counter strike, dota, linux, etc etc.. All those things are made from home without any organization or solid work structure.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECoriW\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI am agree with the list of mechjeb users \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Conarr","CreatedById":60613,"CreatedDateTime":"2013-05-06T19:07:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lobo1544\u0022 data-cite=\u0022Lobo1544\u0022\u003E\u003Cdiv\u003EI have recntly have been playing with a few mods, which I like, but they just add TOO MANY PARTS (cough cough KW Rocketry). I think I\u0027m going to delete all the mods and start a new game. So I was wondering what you have to say on the subject. Do you play with mods? what are the pros and cons of playing with them?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI loaded 8 million tons of parts mods, built out the ships I needed for my missions. I saved the .craft files, nuked and reloaded KSP only to find I really only used about 10 parts outside the stock and KSPX packs. I found those few parts, added them in and that\u0027s the load I use now.\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-05-13T18:04:54Z","Content":"\n\u003Cp\u003EStock, because if features are worth adding then either the devs have already added it to stock or will, and better than what the mod could do.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-05-13T18:28:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Canopus\u0022 data-cite=\u0022Canopus\u0022\u003E\u003Cdiv\u003EMods are a big part of KSP. Don\u0027t forget that Nova, C7, Clara Lyrae and Romfarer were all modders before they got hired by Squad.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETell that to the person here who said that having no mods improves synergy in the community.\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-05-17T05:27:42Z","Content":"\n\u003Cp\u003Elightly modded due to system limits.\u003C/p\u003E\n"},{"CreatedByName":"Chewy2014","CreatedById":54348,"CreatedDateTime":"2013-05-17T07:31:24Z","Content":"\n\u003Cp\u003EAfter playing for 6 months or so in vanilla I\u0027ve recently installed mods that make the game more about role-playing. I have RemoteTech for probe comms, MapSat for scoping potential landing sites, Kethane for mining resources from other bodies, and I had a life support mod but it was too buggy. I wish I could find another one that worked like the one I had. I would also have FAR installed, but it seems to break my game too much.\u003C/p\u003E\u003Cp\u003EI have KSPX as well for extra parts. Some of them are really useful.\u003C/p\u003E\n"},{"CreatedByName":"darkwuulf","CreatedById":66414,"CreatedDateTime":"2013-05-17T07:42:48Z","Content":"\n\u003Cp\u003ESo far I have enjoyed playing with no mods that add parts or affect gameplay. I do however quite like the RemoteTech and Alarmclock mods.\u003C/p\u003E\u003Cp\u003E~D\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-05-17T09:39:31Z","Content":"\n\u003Cp\u003EDue to chronic inability of KSP devs to deliver just about anything within reasonable timelines (3 months for useless flags? C\u0027mon), mods are the only game in town. If it wouldn\u0027t be for mods, I would\u0027ve apandoned KSP long time ago.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-05-17T09:56:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asmi\u0022 data-cite=\u0022asmi\u0022\u003E\u003Cdiv\u003EDue to chronic inability of KSP devs to deliver just about anything within reasonable timelines (3 months for useless flags? C\u0027mon), mods are the only game in town. If it wouldn\u0027t be for mods, I would\u0027ve apandoned KSP long time ago.\u003C/div\u003E\u003C/blockquote\u003EPeople like you make me sick. You obviously have no idea about developing software and how hard it is.\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-05-17T10:13:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Canopus\u0022 data-cite=\u0022Canopus\u0022\u003E\u003Cdiv\u003EPeople like you make me sick. You obviously have no idea about developing software and how hard it is.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMiss. I\u0027m a software developer for over 10 years and I know that 3 months is hell a lot of time for a team of 5 devs (I think that\u0027s what Squad has got). If organized and planned well, team like that could develop KSP itself up to the current state in this time.\u003C/p\u003E\u003Cp\u003EThe problem is not the lack of technical expertise in dev team (they are obviously technically proficient), but lack of good management and planning. This whole situation (\u0022Let\u0027s do resources! Oh, not - let\u0027s do seats! Oh, no - let\u0027s better do flags!\u0022) just screams that, and it\u0027s obvious to anyone who is long enough in this industry.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-17T10:18:00Z\u0022 title=\u002205/17/2013 10:18  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 17, 2013\u003C/time\u003E by asmi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Iren","CreatedById":58417,"CreatedDateTime":"2013-05-17T10:23:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asmi\u0022 data-cite=\u0022asmi\u0022\u003E\u003Cdiv\u003EMiss. I\u0027m a software developer for over 10 years and I know that 3 months is hell a lot of time for a team of 5 devs (I think that\u0027s what Squad has got). If organized and planned well, team like that could develop KSP itself up to the current state in this time.\u003Cp\u003EThe problem is not the lack of technical expertise in dev team (they are obviously technically proficient), but lack of good management and planning. This whole situation (\u0022Let\u0027s do resources! Oh, not - let\u0027s do seats! Oh, no - let\u0027s better do flags!\u0022) just screams that, and it\u0027s obvious to anyone who is long enough in this industry.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell then, we\u0027re waiting for your well-planned, good-organized Space Sim/Sandbox game, I\u0027m sure that if you outdo KSP you will receive a lot of good reviews as this game already has \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"erkha343","CreatedById":1957,"CreatedDateTime":"2013-05-17T12:17:59Z","Content":"\n\u003Cp\u003EI\u0027m staying away from mods until 0.20, mods will be much easier to uninstall then.\u003C/p\u003E\n"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2013-05-17T12:22:45Z","Content":"\n\u003Cp\u003EUsually i use a very high quantity of mod, but only in a saves where i made test and crazy things. In my \u0022\u0022real\u0022\u0022 saves i play full stock\u003C/p\u003E\n"},{"CreatedByName":"Lortto","CreatedById":53969,"CreatedDateTime":"2013-05-17T12:50:42Z","Content":"\n\u003Cp\u003EAll I have is the Chatterer plugin. It\u0027s just too hilarious and doesn\u0027t really effect gameplay at all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-17T18:00:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EDue to chronic inability of KSP devs to deliver just about anything within reasonable timelines \u003C/div\u003E\u003C/blockquote\u003EThey told you the game was a work in progress before you bought it, and they committed to no timeline for its development. In what way do you feel they have let you down? This kind of attitude really grates my cheese. Squad gets a rash of manure if they don\u0027t flood their media outlets with constant announcements of new features, and then they get a rash of manure if any of those provisional release times are 10 minutes late. Can\u0027t we just leave the guys alone to work on the game in peace? I\u0027d rather they spent their time adding to the game the game than TELLING us that they\u0027re adding to the game.\n"},{"CreatedByName":"Nexustrimean","CreatedById":33308,"CreatedDateTime":"2013-05-17T18:28:11Z","Content":"\n\u003Cp\u003EI have a modded copy of KSP, and an unmodded copy of ksp, Best of both worlds.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-05-17T18:31:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nexustrimean\u0022 data-cite=\u0022Nexustrimean\u0022\u003E\u003Cdiv\u003EI have a modded copy of KSP, and an unmodded copy of ksp, Best of both worlds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr you could just keep the modded KSP and created two separate save files (one modded, one stock). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2013-05-18T23:11:12Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EMods make the game; \u0027vanilla\u0027 only gives the Kebals a basic understanding of their space future; it is up to them to advance or not.\u003C/p\u003E\u003Cp\u003EMy Kerbals will advance, in such a way as to advance slowly, with patience and perserverence. \u003C/p\u003E\u003Cp\u003EThey will learn alot of thing about life and science.\u003C/p\u003E\u003Cp\u003EAs you can see, MODS are what make the game; as it seems this was intended.\u003C/p\u003E\u003Cp\u003ECdr Zeta\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-05-19T00:42:23Z","Content":"\n\u003Cp\u003EIn my opinion, the only mods you really NEED to get a nice, complete set of parts are Kethane, Mechjeb, Kerbal Attachment System (KSA), and KSPX. I personally have some others, but those aren\u0027t really needed. With the mods above, you should have a loadtime that is near-stock.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-05-19T00:45:17Z","Content":"\n\u003Cp\u003EI can see Kethane being useful, but I find that MJ takes away from the game. You only need the stock propulsion parts for anything less than Jool ascent, but other things like KAS and QuantumStrut help make the game better. Personally, I try to do things completely stock unless mods are part of the point (like setting up a mining base or a mapping satillite).\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2013-05-19T14:50:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asmi\u0022 data-cite=\u0022asmi\u0022\u003E\u003Cdiv\u003EDue to chronic inability of KSP devs to deliver just about anything within reasonable timelines (3 months for useless flags? C\u0027mon), mods are the only game in town. If it wouldn\u0027t be for mods, I would\u0027ve apandoned KSP long time ago.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGuys, relax. He was clearly just saying the exact opposite of what he meant.\u003C/p\u003E\u003Cp\u003EI mean, there\u0027s no way someone could be this dumb, right?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003ERight??\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"koshelenkovv","CreatedById":53764,"CreatedDateTime":"2013-05-19T16:26:43Z","Content":"\n\u003Cp\u003EI only use mods which do not add rocket parts. Like ISA MapSat, Figaro GPS, Graphotron, Weights collection or Vanguard personal parachute.\u003C/p\u003E\u003Cp\u003EThe most useful is Kerbal Engineer Redux. It saves from calculating dV by hand and shows nice interception information. I find it more useful than Protractor.\u003C/p\u003E\u003Cp\u003EAlso, Damned Robotics and Kerbal Attachment System both add a lot of fun to ground activities.\u003C/p\u003E\n"},{"CreatedByName":"Designer225","CreatedById":48514,"CreatedDateTime":"2013-05-29T05:22:14Z","Content":"\n\u003Cp\u003EI really don\u0027t use a lot of mods, and I have only add the mods that actually went to the latest version.\u003C/p\u003E\u003Cp\u003EIf all of them is outdated, I would try to make it work... or I\u0027ll just play stock.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2013-05-29T08:36:23Z","Content":"\n\u003Cp\u003EI really want to use mods but I like building ships that anybody can use. Really having a dilema here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}