{"TopicId":34654,"ForumId":20,"TopicTitle":"Game realism","CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-06-25T01:06:13Z","PageNum":1,"Articles":[{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-06-25T01:06:13Z","Content":"\n\u003Cp\u003EI have installed several mods such as Deadly Reentry and Ion cross Life Support and others which add more realism to the stock game, I\u0027m debating on getting the extraplantary launch pads but I wanna keep the game some what realistic although it would be much easier to not launch through the atmosphere. \u003C/p\u003E\u003Cp\u003EBasically I\u0027m asking what do you guys think? Should I get it because it makes larger rockets easier but takes away the realism factor or forget about it due to it basically being a cheat.\u003C/p\u003E\n"},{"CreatedByName":"entaran","CreatedById":67823,"CreatedDateTime":"2013-06-25T01:08:17Z","Content":"\n\u003Cp\u003E\u0022cheats\u0022 are relative to your perspective.\u003C/p\u003E\u003Cp\u003EPlay the game how you want to play it, I know a ton of guys who hyperedit a lot of their space stations into orbit because they\u0027re huge and incredibly involved (beautiful) designs but there\u0027s just no real way to launch them without a 1200 part launcher which just isn\u0027t feasible. Ultimately, the decision is made by you.\u003C/p\u003E\u003Cp\u003EIf you like realism, get remotetech too.\u003C/p\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-06-25T01:09:02Z","Content":"\n\u003Cp\u003EMaintaining surface bases with IronCross would be a bit of a challenge. And it\u0027s not necessarily unrealistic to build spacecraft on other bodies, so yeah. I would suggest you use it.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-06-25T01:10:39Z","Content":"\n\u003Cp\u003EI don\u0027t see how it can be realistic, but I suppose it depends on how you use it.\u003C/p\u003E\u003Cp\u003EWe have rockets just appear at the drop of a hat in the VAB on Kerbin, but I presume there is a whole industrial civilization on Kerbin support this effort, even though we can\u0027t see any signs of it on the planet.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-06-25T01:13:43Z","Content":"\n\u003Cp\u003EI recently installed \u003Cstrong\u003EOrbitalConstructuion_Redux\u003C/strong\u003E and so far I\u0027ve been pretty pleased with the results. I can now construct things in space I could not launch in a normal way. And since it takes 125 tons in \u0027spare parts\u0027 to construct a 100 ton ship it does not feel like cheating.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-06-25T01:15:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022entaran\u0022 data-cite=\u0022entaran\u0022\u003E\u003Cdiv\u003Ebut there\u0027s just no real way to launch them without a 1200 part launcher which just isn\u0027t feasible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cimg src=\u0022http://i301.photobucket.com/albums/nn77/Whackjob_photos/screenshot17_zps6e917e28.png\u0022 alt=\u0022screenshot17_zps6e917e28.png\u0022\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI can tell you from experience that you\u0027re entirely right and this is in no way feasible hehe. Not feasible YET anway!\u003C/p\u003E\u003Cp\u003E/not sure if the part count is at 1200\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-06-25T01:16:13Z","Content":"\n\u003Cp\u003E@enteran you have a good point, which I have used hyperedit in the past to launch some pretty massive pieces my self. And I have remotech and kethane \u003C/p\u003E\u003Cp\u003E@mushroom It adds a challenge of having to resupply a base with fresh air which is a fun challenge. \u003C/p\u003E\u003Cp\u003E@Brotoro I agree, for example the mod only adds a drill a forge and a pad, realisticly on the moon or other planets the gravity would be different the absence of air and other factors would all affect the building process and make it more difficult if not impossible \u003C/p\u003E\u003Cp\u003EAnd that is why I can\u0027t decide on it or not.\u003C/p\u003E\u003Cp\u003EAnd I have used orbital construction in the past its good but has the same problem... Is it actually possible because the absence of gravity.\u003C/p\u003E\n"},{"CreatedByName":"stevoe26","CreatedById":22064,"CreatedDateTime":"2013-06-25T01:55:02Z","Content":"\n\u003Cp\u003EI don\u0027t see how the lack of gravity can hinder building something, if anything i would think it would be easier, you no longer have to lift massive parts, structural integrity can be much lower in microgravity, so it would cost less resource wise. not including the spare parts launches to the orbital constructor. taking weight away from building massive vehicles can only make it easier. or am i overlooking something?\u003C/p\u003E\n"},{"CreatedByName":"automcdonough","CreatedById":12249,"CreatedDateTime":"2013-06-25T02:36:03Z","Content":"\n\u003Cp\u003Ethe scale of things\u003C/p\u003E\u003Cp\u003Ethe wheel friction properties\u003C/p\u003E\u003Cp\u003Ethe aerodynamics\u003C/p\u003E\u003Cp\u003Elife support details\u003C/p\u003E\u003Cp\u003Ereentry heat\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-06-25T03:29:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stevoe26\u0022 data-cite=\u0022stevoe26\u0022\u003E\u003Cdiv\u003EI don\u0027t see how the lack of gravity can hinder building something, if anything i would think it would be easier, you no longer have to lift massive parts, structural integrity can be much lower in microgravity, so it would cost less resource wise. not including the spare parts launches to the orbital constructor. taking weight away from building massive vehicles can only make it easier. or am i overlooking something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn theory, but the reality of weightlessness is somewhat different. Gene Cernan had a terrible time trying to perform basic task on his Gemini 9 spacewalk.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOn the third day Cernan finally reached the rear of the spacecraft and began to check and prepare the AMU. This took longer than planned due to lack of hand and foot holds. He was unable to gain any leverage which made it hard to turn valves or basically any movement. All this was made worse when after sunset, his faceplate fogged up. His pulse soared to about 195 beats per minute. The flight surgeon on the ground feared he would lose consciousness.\u003Cp\u003EAt this point Cernan decided that there was considerable risk in continuing the EVA. He had poor visibility from within his spacesuit and had found that he could not move very well. He would have to disconnect himself from the umbilical that attached him to the Gemini (though would still be attached by a longer thinner lead), after he had connected himself to the AMU. But when he had finished with the AMU he would somehow have to take the thing off with one hand, while the other held onto the spacecraft. He decided to cancel the rest of the EVA, with Tom Stafford and the Mission Controllers concurring.\u003C/p\u003E\u003Cp\u003EHe managed to move himself back to the cockpit and Stafford held onto his legs to give him a rest. After trying to remove a mirror mounted to the side of the spacecraft, his suit cooling system overheated and his faceplate fogged up completely, denying him any vision. He and Stafford managed to get the hatch closed and repressurised. Cernan had spent 128 minutes outside the spacecraft. Cernan\u0027s difficult EVA experience, which continued the EVA problems of the previous Gemini missions, contributed to a complete NASA reappraisal of EVA training and procedures for future Gemini and Apollo flights.\u003C/p\u003E\u003Cp\u003EStafford has said in a 2001 interview that there was a real concern that Cernan would not be able to get back into the capsule. As it would not have been acceptable for Stafford to cut Cernan loose in orbit he stated that the plan was to make re-entry with the astronaut still attached by his umbilical. However, such an action would have resulted in the deaths of both men.\u003C/p\u003E\u003Cp\u003EAs well as the rendezvous and EVA, the other major objective of the mission was to carry out seven experiments. The only medical experiment was M-5, which measured the astronauts reactions to stress by measuring the intake and output of fluids before, during and after the flight.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe training is obviously a lot better these days, but doing thing in a weightless environment is by no means simple.\u003C/p\u003E\n"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2013-06-25T03:32:34Z","Content":"\n\u003Cp\u003ERemove timewarp then we can now start talking about realism.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-06-25T03:52:39Z","Content":"\n\u003Cp\u003Eyes, and require food supply, radiation shielding, sleep periods, etc. etc. for our Kerbals and maintenance on our spacecraft during those years long missions...\u003C/p\u003E\u003Cp\u003EAnd of course degrading orbits when launching something to below say 650km up.\u003C/p\u003E\n"},{"CreatedByName":"entaran","CreatedById":67823,"CreatedDateTime":"2013-06-25T03:53:48Z","Content":"\n\u003Cp\u003ERemove timewarp and we can start watching player count drop through the floor.\u003C/p\u003E\n"},{"CreatedByName":"7499275","CreatedById":70640,"CreatedDateTime":"2013-06-25T12:28:29Z","Content":"\n\u003Cp\u003EWhen I said realism I meant using what is avalible at hand to use, back in .18 and .19 I had a mod where the crews DID require food and water and air, but I am not sure where it went too.\u003C/p\u003E\n"},{"CreatedByName":"entaran","CreatedById":67823,"CreatedDateTime":"2013-06-25T13:21:37Z","Content":"\n\u003Cp\u003EIt\u0027s called IonCross Crew Support and it\u0027s currently on the first page of the addons forum.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-06-25T13:32:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022entaran\u0022 data-cite=\u0022entaran\u0022\u003E\u003Cdiv\u003EIt\u0027s called IonCross Crew Support and it\u0027s currently on the first page of the addons forum.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIonCross only takes care of Oxygen, Carbon dioxide and climate control (At least, I presume that\u0027s what the capsule energy drain is). You don\u0027t have to worry about food and water.\u003C/p\u003E\n"},{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2013-06-25T23:55:37Z","Content":"\n\u003Cp\u003EThe AIES mod adds more realistic looking parts if you want that.\u003C/p\u003E\n"},{"CreatedByName":"Tongues","CreatedById":65915,"CreatedDateTime":"2013-06-27T18:11:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stevoe26\u0022 data-cite=\u0022stevoe26\u0022\u003E\u003Cdiv\u003EI don\u0027t see how the lack of gravity can hinder building something, if anything i would think it would be easier, you no longer have to lift massive parts, structural integrity can be much lower in microgravity, so it would cost less resource wise. not including the spare parts launches to the orbital constructor. taking weight away from building massive vehicles can only make it easier. or am i overlooking something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EApparently weight isn\u0027t an issue in space, but mass certainly is. It is still challenging to move massive objects in a weightless envionment, which is why RCS struggles with heavier craft. Getting something to move, and then getting it to stop moving!\u003C/p\u003E\n"}]}