{"TopicId":35337,"ForumId":20,"TopicTitle":"Easiest way how to make a collision mesh and node placement?","CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-06-30T01:56:11Z","PageNum":1,"Articles":[{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-06-30T01:56:11Z","Content":"\n\u003Cp\u003EHello all,\u003C/p\u003E\u003Cp\u003EI am working on a \u003Cem\u003Every\u003C/em\u003E detailed part, and I need to see the easiest way how to make a collision mesh. I do not want to remake the part for it though. So is there a easier way how to do this in Blender? Also with node placement, I need a simplified explanation. I apologize if there is a thread on this that is explaining it.\u003C/p\u003E\n"},{"CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2013-07-01T04:10:29Z","Content":"\n\u003Cp\u003ECollision mesh: duplicate the part, and simplify it. Make it convex. (checking \u0027convex\u0027 option in unity will do this but it may not be exactly the way you want it)\u003C/p\u003E\u003Cp\u003Enode placement:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/CFG_File_Documentation#Node_Definitions\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/CFG_File_Documentation#Node_Definitions\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eyou are just setting up what distance the nodes will be from the object\u0027s origin, which you can place wherever you want when you are in blender.\u003C/p\u003E\n"},{"CreatedByName":"Cryocasm","CreatedById":5299,"CreatedDateTime":"2013-07-01T11:33:39Z","Content":"\n\u003Cp\u003EBasically, the node collider is a mesh that \u0022sums up\u0022 the part in a nutshell:\u003C/p\u003E\u003Cp\u003EIf its a coca cola can in space, and it has modeled surface detailing that \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Edoes not\u003C/span\u003E extend beyond the module\u0027s diameter, your fine making a simply, 12-24 sided cylinder mesh that has the same diameter and that\u0027s it. 12 sides are preferable due to KSP symmetry, but other than that.\u003C/p\u003E\u003Cp\u003ENode colliders? Just set your modeling programs units to the Metric system. Then, once your done modeling, select the vertex of the \u0022top\u0022 and note the coordinates, similarly for the bottom as well as any side attachment nodes. After that, its just a \u003Cstrong\u003Elot\u003C/strong\u003E of fussing with rotation orientation of the attachment node, making sure that it can actually connect (node collider being of smaller magnitude than the attachment node) and so on.\u003C/p\u003E\n"},{"CreatedByName":"Lillegre","CreatedById":68753,"CreatedDateTime":"2013-07-01T16:12:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCanadianVendingMachine\u0022 data-cite=\u0022TheCanadianVendingMachine\u0022\u003E\u003Cdiv\u003EHello all,\u003Cp\u003EI am working on a \u003Cem\u003Every\u003C/em\u003E detailed part, and I need to see the easiest way how to make a collision mesh. I do not want to remake the part for it though. So is there a easier way how to do this in Blender? Also with node placement, I need a simplified explanation. I apologize if there is a thread on this that is explaining it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMake the model, the copy it in object mode (CTRL D), then press ESC. This makes a copy object, but does not move it. Then, with the copy selected, press M to move to a new layer. Select the layer the copy is on, then press tab to edit. In edit mode, hack off necessary geometry, remove edge loops etc to make a much more basic version of your item.\u003C/p\u003E\u003Cp\u003EWhen done export as normal. In Unity, you should then see the complex and simple versions. Delete the simple version from the premade hierarchy, add the physics mesh object to the proper version, then change the mesh used to the simple version.\u003C/p\u003E\u003Cp\u003EDone!\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-07-02T09:32:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cryocasm\u0022 data-cite=\u0022Cryocasm\u0022\u003E\u003Cdiv\u003EBasically, the node collider is a mesh that \u0022sums up\u0022 the part in a nutshell:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Enode_collider was a key name used in the old system, I would avoid using it in a part tools context to prevent confusion. The general term is simply collider (or colliders, multiple ones are fine).\u003C/p\u003E\u003Cp\u003EAs to creating colliders, you can either create a models (under 255 triangles) in your modelling program and then wrap mesh colliders around them in unity or build it up from multiple primitive colliders arranged in unity.\u003C/p\u003E\n"},{"CreatedByName":"giannis1996","CreatedById":81719,"CreatedDateTime":"2013-09-14T08:27:06Z","Content":"\n\u003Cp\u003Eis there any video tutorial?\u003C/p\u003E\u003Cp\u003Ei\u0027m new with KSP modding so, i can\u0027t understand what does those values mean\u003C/p\u003E\u003Cp\u003Ethanks!\u003C/p\u003E\n"}]}