{"TopicId":37398,"ForumId":20,"TopicTitle":"Calculating fuel storage?","CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-17T03:38:31Z","PageNum":1,"Articles":[{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-17T03:38:31Z","Content":"\n\u003Cp\u003EI am currently working on a set of large tanks and engines. Set will include 3.75m, 5m, and 7.5m tanks, engines, and little support stuff same sizes (like sas, rcs and such).\u003C/p\u003E\u003Cp\u003ESo here is my issue. I am not sure how to go about figuring out how much each tank should hold. I want the entire set to maintain \u0027stock balance\u0027 as it were. Should I figure out per meter storage on stock 1.25m and 2.5m tanks and then scale it up? Should I base it on overall volume pulled from Blender (Id have to figure out how to do that, but Im sure I have seen Hooligan do it before figuring volumes on his envelopes). I am a bit lost how to start, a little shove in the right direction would be huge help, thank you=)\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-07-17T03:57:18Z","Content":"\n\u003Cp\u003EHere\u0027s a bunch of tables!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/c9GMuKi.png\u0022 alt=\u0022c9GMuKi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese are based on centimeter measurements of the visible tank, I suggest you pick an end of the stock range and go with that Unit/m\u003Csup\u003E3\u003C/sup\u003E, figure out the volume of your parts, and multiply for epic loots.\u003C/p\u003E\u003Cp\u003EYou can get more complicated than that and calculate the actual internal tank size, if you want...\u003C/p\u003E\u003Cp\u003EThese two sites can be very useful\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.calculatorsoup.com/calculators/geometry-solids/capsule.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.calculatorsoup.com/calculators/geometry-solids/capsule.php\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.aqua-calc.com/calculate/volume-sphere\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.aqua-calc.com/calculate/volume-sphere\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-07-17T04:12:27Z","Content":"\n\u003Cp\u003EThank you much, that was the shove I needed!\u003C/p\u003E\u003Cp\u003EI know this is rocket science and all, but I figured setting up some tanks wouldn\u0027t take to much maths.....silly me.\u003C/p\u003E\n"}]}