{"TopicId":44169,"ForumId":20,"TopicTitle":"Where does the line get drawn?","CreatedByName":"DocLangy","CreatedById":57459,"CreatedDateTime":"2013-08-28T14:34:43Z","PageNum":1,"Articles":[{"CreatedByName":"DocLangy","CreatedById":57459,"CreatedDateTime":"2013-08-28T14:34:43Z","Content":"\n\u003Cp\u003EI had a thought today about modding and developer relationships. There are some pretty talented modders out there that are creating parts/functions/etc for this game that the developers are not focusing on. So where is the line between a mod and what is considered \u0022stock\u0022? Is it simply a matter of origin? I\u0027ll give an example of what I mean using a popular mod. We know that resources will eventually be added to the \u0022stock\u0022 game, what is stopping Harv or any of the other developers from taking all that work that Majiir has already put into the Kethane mod and say this is now \u0022stock\u0022, this is a resource that everyone will use (I understand that the idea is to have multiple resources for different fuels). I just wondered what the communities thoughts were on this. I am not a modder I don\u0027t really know anything about it, but it is my perception that much of their work could be adopted at least in part in some way by the developers so they could have a head start on a particular facet of the game.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-08-28T14:47:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DocLangy\u0022 data-cite=\u0022DocLangy\u0022\u003E\u003Cdiv\u003Ewhat is stopping Harv or any of the other developers from taking all that work that Majiir has already put into the Kethane mod and say this is now \u0022stock\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey can\u0027t use the work directly because I own the Kethane copyright. (They could, of course, ask for permission.)\u003C/p\u003E\u003Cp\u003ETo answer your original question, the line gets drawn at the packaging step. Take KSPX, for example; it started as a mod, but some of those parts are now packaged with stock (with the author\u0027s permission). Whatever the user gets when they download the game is stock regardless of where the content was originally released.\u003C/p\u003E\n"}]}