{"TopicId":45625,"ForumId":20,"TopicTitle":"Danger of popular mods dying off?","CreatedByName":"GavinZac","CreatedById":68719,"CreatedDateTime":"2013-09-11T12:52:31Z","PageNum":2,"Articles":[{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2013-09-11T21:55:38Z","Content":"\n\u003Cp\u003EThe problem is that the game is unfinished, mods like Kethane, RelayTech, MechJeb, Lifesupport, Deadly Reentry, Mission Control, etc, etc, \u0022Finish\u0022 the game. Ideally SQUAD will have working space mining, communications, autopilot, life support, re-entry and career mode when they finish the game (someday) making most if not all of the most popular mods obsolete. \u003C/p\u003E\u003Cp\u003EI personally could not keep playing this game without MechJeb, I love to build but can\u0027t fly worth crap.\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-09-11T22:14:16Z","Content":"\n\u003Cp\u003EKasperVld, the manditory selection of \u0022A license\u0022 precludes ambiguity, makes things clear, I think it\u0027s a good thing and not just because when forced to think about it many addon makers will choose permissive terms\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-09-11T22:18:34Z","Content":"\n\u003Cp\u003EKasper, I have yet to mod for KSP, but have done so for other games - and I feel the policy of requiring some sort of license is fine, providing that the author is permitted to choose the terms of the license. This protects the rights of authors while clearly delineating what the end user is permitted to do. There\u0027s a reason that all commercially available software comes with a license, however open or restrictive it may be.\u003C/p\u003E\u003Cp\u003EI think that the current policy is good - but it would perhaps help if recommendations were made as to what the license should explicitly cover so as to avoid omissions and ambiguity. \u0022All rights reserved\u0022 is a simple and explicit license that leaves no room for misinterpretation, and on the other hand a license that says the user is free to modify and redistribute as they see fit is also pretty explicit. Confusion comes when an author may with to allow or protect certain forms of use but does not explicitly address them.\u003C/p\u003E\u003Cp\u003EIt still wouldn\u0027t be a problem if not for the general misconceptions and, dare I say, legal ignorance of the average forum pundit - but in my experience, the concept that \u0022omission of the explicit does not equal implicit permission\u0022 seems to be an alien concept in discussion of IP rights on any game forum.\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2013-09-11T22:18:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Talisar\u0022 data-cite=\u0022Talisar\u0022\u003E\u003Cdiv\u003EYour point is well taken, but there are a couple of examples of the opposite happening. In one instance, the Deadly Robotics mod fell into disuse and was forked by Sirkut (with what appears to be a lot of aid by Devo) and now Infernal Robotics is much better than the original. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the kind words but I must toot my horn a little louder. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Warning, a lot of I\u0027s are going to show up. I did all enhancements to the code. I made all the models except for the gantry \u0026amp; telescoping piston were by VoidInfuser, the Industrial Hinge, VTOL Rotatron and Large Rotatron were Devos). I also textured (using Devo\u0027s amazing artwork) all of the models except for Devo\u0027s \u0026amp; 1 or two of the hinges as didn\u0027t have any textures to work with until Devo assisted me. I\u0027m not devaluing what Devo has done I just want people to know I did more than what has been perceived.\u003C/p\u003E\u003Cp\u003ENow to get back on track. For me I\u0027m not too concerned with mods dying off. Since I was used as an example, if the license allows it, I or someone will either create a new one or pick up where it was left off. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EAllow me to test the water a little here with a question for the mod makers: how do you feel about the current policy which states all mods must come with a license in some way, shape or form?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the requirement is fine but should at least have a default license that is assume if the person hasn\u0027t provided one in the beginning. I think jumping down one\u0027s throat because they didn\u0027t list a license is a bit off putting and could chase people away. Plus it would be nice if there was a sticky that could list the various licenses and maybe a simple explanation as to what means what.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-11T22:32:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirkut\u0022 data-cite=\u0022sirkut\u0022\u003E\u003Cdiv\u003EPlus it would be nice if there was a sticky that could list the various licenses and maybe a simple explanation as to what means what.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/44738-License-Selection-Guide\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/44738-License-Selection-Guide\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"sirkut","CreatedById":57229,"CreatedDateTime":"2013-09-11T22:35:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiron\u0022 data-cite=\u0022Tiron\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/44738-License-Selection-Guide\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/44738-License-Selection-Guide\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoom. I really should check this section more often. I started IR before that and never bothered looking there. Thanks Tiron and Kudos Majir!\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-11T22:38:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sirkut\u0022 data-cite=\u0022sirkut\u0022\u003E\u003Cdiv\u003EBoom. I really should check this section more often. I started IR before that and never bothered looking there. Thanks Tiron and Kudos Majir!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re welcome. I\u0027d just seen it a minute ago when I was looking at GAoA so I remembered. To be fair it appears to have only been started a month ago, roughly.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-11T22:42:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EAllow me to test the water a little here with a question for the mod makers: how do you feel about the current policy which states all mods must come with a license in some way, shape or form?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it\u0027s a great policy so long as you retain the caveat that source must be provided.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-09-11T23:34:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI would go so far as to say that posting a new mod thread in the \u0022Add-on Releases and Projects Showcase\u0022 forum should result in the thread be queued for posting by mods, who would get a chance to look it over and reject threads if they don\u0027t meet the posting criteria.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes. This should be standard procedure.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Faark\u0022 data-cite=\u0022Faark\u0022\u003E\u003Cdiv\u003EMay i ask what the problem would be with Squad offering a specific license they like for mods/that is KSP-friendly in case the mod developer does not care? Like when you create your spaceport project, you have specific license preselected and can change it to whatever you want. I ofc do \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Enot\u003C/span\u003E want squad to enforce a specific license, but to kind of state what Squad would like and make it easy for modders to use that one, if they like it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was referring to a mandatory set of licensing terms. I\u0027d also consider a scheme where new unlicensed mods get \u0022automatically\u0022 licensed to be in poor form and possibly downright illegal. An option with a convenient default has its own problems, which I\u0027ll detail in my answer to KasperVld\u0027s question.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Faark\u0022 data-cite=\u0022Faark\u0022\u003E\u003Cdiv\u003ECould you please also link one/some of the mentioned threads? I haven\u0027t seen or found any, it was most likely before i got to this forum. You are not talking about your definitively helpful and interesting License Selection Guide, aren\u0027t you?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThreads variously pop up here or in The Forum Forum (like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/42242-Mandatory-mod-licence-and-mod-abandonment\u0022 rel=\u0022external nofollow\u0022\u003Ethis one\u003C/a\u003E).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Faark\u0022 data-cite=\u0022Faark\u0022\u003E\u003Cdiv\u003EBut your actual mod is based on Squads work / the game\u0027s DLLs. And for using those you have to follow Squads copyright.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESquad have gone on record saying they do \u003Cem\u003Enot\u003C/em\u003E lay claim to the intellectual property of mods and don\u0027t consider them to be derivative works. Many games have modding ecosystems where it\u0027s common to reference or copy elements from the base game, but this is rare (or even illegal) in the case of KSP.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EAllow me to test the water a little here with a question for the mod makers: how do you feel about the current policy which states all mods must come with a license in some way, shape or form?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with it because this is effectively the situation anyway (unlicensed mods are under full copyright). \u003Cem\u003EHowever\u003C/em\u003E, I think enforcement is a touchy subject, and you (the forum mods) ought to be very careful about what policies you choose in implementing this rule. Faark asked what I\u0027d have against a dropdown with a set of license choices. My main concern is this: \u003Cstrong\u003Elicenses are permanent, so mod developers should not be pushed into a decision\u003C/strong\u003E. If you have a dropdown with a license selected by default, that\u0027s a problem. If you make a list (like my stickied thread) of licenses and one\u0027s at the top, that\u0027s a problem. That\u0027s precisely why I put \u0022All Rights Reserved\u0022 first; I wanted any lazy reader to have the option to change their mind later if they want to make a more informed decision. I really, really, \u003Cem\u003Ereally\u003C/em\u003E didn\u0027t want to see someone license their mod under something like GPL only to regret it as soon as they understood what it\u0027s all about. That\u0027s exactly what happened with KospY (KAS), and it was only by a technicality that he was able to back out of it. Users can afford to wait a few weeks for the developer to choose (or write) the license they want, but if a developer hastily releases a mod with a license they\u0027re not happy with or don\u0027t fully understand, that\u0027s irrevocable.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003E\u0022All rights reserved\u0022 is a simple and explicit license that leaves no room for misinterpretation\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust nitpicking: in general, we\u0027ve misinterpreted what this means. Generally, screenshots or other similarly derivative media of a piece of software are considered to be property of whoever owns the software unless they explicitly license otherwise. All Rights Reserved doesn\u0027t grant you those rights so, for example, we\u0027re technically in violation by distributing screenshots of ISA Mapsat. This is really shaky because in the same way, we\u0027re not granted the right to actually play the mod, but... yeah, we all take that as an assumed privilege. I\u0027m not arguing that we crack down on such cases, but I wanted to point out that even the simplest of terms can have complex consequences.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI think it\u0027s a great policy so long as you retain the caveat that source must be provided.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf we\u0027re on that note, I disagree with the source code requirement on principle, although I do see clearly how it benefits the community.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-11T23:51:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EIf we\u0027re on that note, I disagree with the source code requirement on principle, although I do see clearly how it benefits the community.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know where you\u0027re coming from but I want to reinforce the idea of open source helping the community by saying that it would have taken me four or five times as long to make the simple mod I did, and I may have not even bothered. Modding communities, in my experience, aren\u0027t very friendly or helpful to people trying to enter so code samples are very welcome\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-09-12T00:21:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PDCWolf\u0022 data-cite=\u0022PDCWolf\u0022\u003E\u003Cdiv\u003ENo modder is commited to continue their work. Yet letting their projects die without warning or without letting someone else continue it is as bad as it gets. It shows irresponsibility from their part. (Yes, I know I haven\u0027t continued my parts either, I\u0027ll do so when the game gets fun again. 3 updates without anything new certainly broke my will of playing KSP).\u003Cp\u003EAbout the mods you list themselves, there\u0027s not much to say. Mechjeb dying off can\u0027t certainly be a bad thing. It was a monopoly. Its dead can only bring joy to players and modders alike, and maybe better made forks or entirely new projects.\u003C/p\u003E\u003Cp\u003EDeadly reentry died because the maker let himself be carried away by casuals saying the mod was hard, and then it got turned into a useless heat module for parts without challenge at all.\u003C/p\u003E\u003Cp\u003EIonCross got itself turned into \u0022Add this module not to die\u0022, which is a ****ty mechanic.\u003C/p\u003E\u003Cp\u003ERemoteTech 2 has a really ****ty development cycle, where devs would let their plugin be tested only by their \u0022secret github club\u0022 instead of bringing it to light at the forums, which makes for a really slow development and pretty much dead testing. Another bad thing they did is just ripping off modules from mechjeb. I remember accidentally forking their project on github though.\u003C/p\u003E\u003Cp\u003EThe only mournable death you got on your list is KAS.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethere isnt a single thing on your (sorry but) biased opinionated list I can agree with. Mechjeb was largely abandoned at a very bad time, when the 0.21 update left most of it in bad shape with for the most part a single person to fix it, and with the help of a few people has done a good job in picking up the ball.\u003C/p\u003E\u003Cp\u003EDeadly Re-Entry\u0027s maintainer last checked in to apologize for lack of updates indicating that he was too busy trying not to become homelesss and apparently is also disabled. So he apparently has a little more important things to worry about than gaming. show some sensitivity.\u003C/p\u003E\u003Cp\u003ERemoteTech: I\u0027m not in anyone\u0027s club and I just followed the github link from the RemoteTech thread, I was not EVEN signed into Github and I just downloaded the latest build of RemotTech2 which is still in testing. \u003C/p\u003E\u003Cp\u003EAs for IonCross, are you kidding me? It\u0027s a life support mod. some of life support equipment is represented by parts. I dont see a problem with that. maybe if you\u0027d complained about not being able to warp without dying I could take that seriously at least.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-12T00:38:20Z","Content":"\n\u003Cp\u003ETime to throw my two cents seeing where this went.\u003C/p\u003E\u003Cp\u003EAs for mandatory licensing, that is very simple. If I understand this correctly, you can license your mod in the simplest way just by adding \u0022All rights reserved.\u0022\u003C/p\u003E\u003Cp\u003EIn regards to an earlier comment which said that all mods should be required to be open source, I would be done. I would walk away from KSP modding. I am very picky about keeping track of who has my source code. I like to set my stuff under share-alike unported non-commercial attribution (or something like that (no selling, share alike, attribution)). Now, I would always make sure that people have a way to contact me and ask for the source code even if I have dropped KSP so anyone who wants to could get the code from me and continue my work. That is my preference and if rules start to disagree with that, we\u0027re gonna have problems.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-12T00:56:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EI like to set my stuff under share-alike unported non-commercial attribution (or something like that (no selling, share alike, attribution)).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s open source. Open-source simply means that the source is always available for someone to inspect. Also, if \u003Ca href=\u0022http://creativecommons.org/licenses/by-nc-sa/3.0/deed.en_GB\u0022 rel=\u0022external nofollow\u0022\u003Ethis is the license\u003C/a\u003E you are referring to, anyone forking your source doesn\u0027t need to contact you, they just need to give you credit, use in it in a non-commercial manner, and share alike.\u003C/p\u003E\n"},{"CreatedByName":"Gaiabladegold","CreatedById":43730,"CreatedDateTime":"2013-09-12T00:59:15Z","Content":"\n\u003Cp\u003EI\u0027d just say its due to mods not being needed as much with all the updates lately. We\u0027re practically on the verge of the game itself making its own custom engines through r\u0026amp;d, so no need for as many new parts, and communications and mining will be implemented sometime eventually too... Ideas stem alot from mods, the community in general, and sometimed the team even takes on modders from time to time to suppliment this growth. Its a growing game, and alot of those gaps that once needed filling are being covered by the vanilla game itself. I agree, I\u0027ll miss many of the mods when they get dropped off too, but its a slow process, and there\u0027ll always be someone who wants something to stay bad enough... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2013-09-12T01:01:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI know where you\u0027re coming from but I want to reinforce the idea of open source helping the community by saying that it would have taken me four or five times as long to make the simple mod I did, and I may have not even bothered. Modding communities, in my experience, aren\u0027t very friendly or helpful to people trying to enter so code samples are very welcome\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s a difference between \u0027Open Source\u0027 and \u0027Source Available\u0027. The difference being what you have the rights to do: \u0027Open Source\u0027 generally includes the rights to distribute, modify, and crucially also to distribute your modifications.\u003C/p\u003E\u003Cp\u003EIt\u0027s entirely possible to make the source available without giving up ANY of those rights. The key thing people might have misgivings about in that regard is that it makes it easier to rip off, although it doesn\u0027t make it any more legal. It also makes it easier to see when something HAS been ripped off, because you\u0027d look at the source for Mod Y and see that it\u0027s using the exact same code as Mod X.\u003C/p\u003E\u003Cp\u003EThe main thing there however is security: being able to look at the code and verify that it\u0027s not doing anything malicious before running it. Some people, particularly in the Linux World, feel so strongly about this that they quite literally won\u0027t use anything they haven\u0027t compiled from source themselves.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-12T01:11:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiron\u0022 data-cite=\u0022Tiron\u0022\u003E\u003Cdiv\u003EThere\u0027s a difference between \u0027Open Source\u0027 and \u0027Source Available\u0027. The difference being what you have the rights to do: \u0027Open Source\u0027 generally includes the rights to distribute, modify, and crucially also to distribute your modifications.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI stand corrected, thanks. I try not to get hung up on semantics, but the distinction is important.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-12T01:19:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI stand corrected, thanks. I try not to get hung up on semantics, but the distinction is important.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, and my stuff is source available. YOu can never just download my source code right off the release thread. I\u0027ll happily provide it but to get it you must email me (and my email is thus usually provided in place of a source code download link).\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-09-12T01:27:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiron\u0022 data-cite=\u0022Tiron\u0022\u003E\u003Cdiv\u003EThe main thing there however is security: being able to look at the code and verify that it\u0027s not doing anything malicious before running it. Some people, particularly in the Linux World, feel so strongly about this that they quite literally won\u0027t use anything they haven\u0027t compiled from source themselves.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot in the case of the KSP community. I know because I\u0027ve accidentally released DLLs which don\u0027t match the public source code, and nobody complained. I suppose someone might\u0027ve complained if the discrepancy was malicious, but I find it far more likely nobody compares the compiled assemblies with source. It\u0027s nice that the build-it-yourself option is there for the truly paranoid, but let\u0027s not get distracted with the security excuse.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2013-09-12T01:32:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003Ethere isnt a single thing on your (sorry but) biased opinionated list I can agree with.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat a tragedy.\u003C/p\u003E\u003Cp\u003EAs for opinions, we are on a forum.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EMechjeb was largely abandoned at a very bad time, when the 0.21 update left most of it in bad shape with for the most part a single person to fix it, and with the help of a few people has done a good job in picking up the ball.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot related to the point I tried to make, so I suppose this has nothing to do with responding to me.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EDeadly Re-Entry\u0027s maintainer last checked in to apologize for lack of updates indicating that he was too busy trying not to become homeless and apparently is also disabled. So he apparently has a little more important things to worry about than gaming. show some sensitivity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is totally unrelated to the point I tried to make, I said the plugin got easier, lost all difficulty and challenge, not that the guy deserves to die for not updating.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003ERemoteTech: I\u0027m not in anyone\u0027s club and I just followed the github link from the RemoteTech thread, I was not EVEN signed into Github and I just downloaded the latest build of RemotTech2 which is still in testing. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGitHub is unintuitive for a lot of people, and hinders the amount of testing that goes into the plugin. And on top of that, devs seem really irresponsive.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EAs for IonCross, are you kidding me? It\u0027s a life support mod. some of life support equipment is represented by parts. I dont see a problem with that. maybe if you\u0027d complained about not being able to warp without dying I could take that seriously at least.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, a life support mod that gets its entire purpose reduced to \u0022add these parts to avoid dead\u0022 (Which is why almost everyone bashed the heat/heat management suggestion, hypocrisy much?). There\u0027s no objective for the mod than to add to the part count as it lacks any depth beyond that point.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-09-12T01:38:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EYes, and my stuff is source available. YOu can never just download my source code right off the release thread. I\u0027ll happily provide it but to get it you must email me (and my email is thus usually provided in place of a source code download link).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure that\u0027s against forum rules. If you\u0027re posting on Reddit or something, different rules apply. I can\u0027t seem to find any mod threads authored by you here, so I don\u0027t know why whether you release your source or not even matters.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-09-12T03:38:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EJust nitpicking: in general, we\u0027ve misinterpreted what this means. Generally, screenshots or other similarly derivative media of a piece of software are considered to be property of whoever owns the software unless they explicitly license otherwise. All Rights Reserved doesn\u0027t grant you those rights so, for example, we\u0027re technically in violation by distributing screenshots of ISA Mapsat. This is really shaky because in the same way, we\u0027re not granted the right to actually play the mod, but... yeah, we all take that as an assumed privilege. I\u0027m not arguing that we crack down on such cases, but I wanted to point out that even the simplest of terms can have complex consequences.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn this scenario, perhaps the author would have the right to do so... but is never under the \u003Cem\u003Eobligation\u003C/em\u003E to do so. That is to say, the author \u0022reserves\u0022 the right to permit or limit use as he or she sees fit, and indeed even on a case-by-case basis.\u003C/p\u003E\u003Cp\u003EAs for a mod author being stuck with a license irrevocably, I don\u0027t see why that would be the case. Software publishers modify their licenses all the time - the terms change and the user has two choices: accept the new terms, or stop using the product. I\u0027m not sure why this should be any different. If I create something, and later decide the terms of the license are too restrictive (or not restrictive enough to avoid unintended abuse), it should be my prerogative to change the license and notify users. Perhaps such changes could only be implemented with updated versions - after all, there\u0027s nothing to stop a user from continuing to use a version under the terms of the license provided therein - but even something as simple as posting notice on the thread and/or Spaceport page my be acceptable.\u003C/p\u003E\u003Cp\u003Etl,dr: \u0022Reserved\u0022 is the most important part of \u0022all rights reserved\u0022 and there\u0027s no reason licenses should be permanent and immutable.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-09-12T03:43:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PDCWolf\u0022 data-cite=\u0022PDCWolf\u0022\u003E\u003Cdiv\u003EGitHub is unintuitive for a lot of people.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor those who are claiming they should be allowed to pick up others\u0027 discontinued mods, this is a very weak excuse.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t know how to use GitHub, chances are you\u0027re not the sort of person who\u0027d be any good keeping an old mod alive anyhow.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2013-09-12T03:55:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EFor those who are claiming they should be allowed to pick up others\u0027 discontinued mods, this is a very weak excuse.\u003Cp\u003EIf you don\u0027t know how to use GitHub, chances are you\u0027re not the sort of person who\u0027d be any good keeping an old mod alive anyhow.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, maybe you should tell this to those guys that maintain old as hell open source programs without even touching github.\u003C/p\u003E\u003Cp\u003EI know github is useful and a great tool, but excludes a lot of people who maybe can just post in a thread and say \u0022hey, I did this and it didn\u0027t work and it\u0027s not listed as intented behaviour\u0022 by hiding your project under a dev-only-words-filled interface.\u003C/p\u003E\u003Cp\u003EWhat I\u0027m against is giving exclusivity to github.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-09-12T03:59:59Z","Content":"\n\u003Cp\u003EYou weren\u0027t talking about exclusivity, you said it\u0027s \u0022unintuitive\u0022. I\u0027m not saying it\u0027s a must for modders, but I seriously doubt that someone who can\u0027t understand GitHub is going to be able to effectively maintain an abandoned mod.\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-09-12T04:01:35Z","Content":"\n\u003Cimg src=\u0022http://i.imgur.com/yjFXBqD.png\u0022 alt=\u0022yjFXBqD.png\u0022\u003E\n"}]}