{"TopicId":49685,"ForumId":20,"TopicTitle":"Mechjeb - Translatron","CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-10-20T16:34:52Z","PageNum":1,"Articles":[{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-10-20T16:34:52Z","Content":"\n\u003Cp\u003EHow the hell does this work?\u003C/p\u003E\u003Cp\u003EI tryd to use it a few times, but I just get more confused. I have a lander on the Mun, bring it a bit in the air, and try to fiddle with the different settings, but they either don\u0027t do what I except, or I\u0027m just stupid.\u003C/p\u003E\u003Cp\u003EI\u0027ve seen Scott Manley use it a few times in his videos, and it looks usefull, but I just can\u0027t figure it out\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-10-20T17:18:49Z","Content":"\n\u003Cp\u003EI used Translatron in \u0022Keep Vert\u0022 mode quite a bit. It tries to keep a selected vertical speed by raising/lowering thrust of your main engine. Build a simple craft, fly a few meters up and turn it on. It will kind of hold your altitude for you. But you can still rotate in whatever direction you like, Translatron only has to throttle your engine a little bit. This way you can concentrate on flying horizontally while Translatron makes sure you don\u0027t crash into the ground or have to think about altitude. Once you are getting close to your landing spot (VAB roof? ^^) you type in a low negative number, press execute and your vessel will start descending.\u003C/p\u003E\u003Cp\u003ESo in that regard its kind of the opposite to Smart SAS\u0027s \u0022keep me pointing up\u0022. Both together make practicing pretty much as easy as it can get, till your good enough to do it without them.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-10-20T17:40:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Faark\u0022 data-cite=\u0022Faark\u0022\u003E\u003Cdiv\u003EI used Translatron in \u0022Keep Vert\u0022 mode quite a bit. It tries to keep a selected vertical speed by raising/lowering thrust of your main engine. Build a simple craft, fly a few meters up and turn it on. It will kind of hold your altitude for you. But you can still rotate in whatever direction you like, Translatron only has to throttle your engine a little bit. This way you can concentrate on flying horizontally while Translatron makes sure you don\u0027t crash into the ground or have to think about altitude. Once you are getting close to your landing spot (VAB roof? ^^) you type in a low negative number, press execute and your vessel will start descending.\u003Cp\u003ESo in that regard its kind of the opposite to Smart SAS\u0027s \u0022keep me pointing up\u0022. Both together make practicing pretty much as easy as it can get, till your good enough to do it without them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI found out how useful this was on Duna during a rescue mission. My rescue ship wasn\u0027t designed as well as it could have been and I had a hard time landing in the target zone. The best I managed was 5 km away so rather than walking six Kerbals 5 km one by one I had to learn to use the translatron keep vert. Worked well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-20T17:43:04Z\u0022 title=\u002210/20/2013 05:43  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 20, 2013\u003C/time\u003E by Starwaster\u003C/strong\u003E\n\u003Cbr\u003EDAMN YOU AUTOCORRECT!\n\u003C/span\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-10-20T17:50:55Z","Content":"\n\u003Cp\u003EI see, thank you.\u003C/p\u003E\u003Cp\u003EIs there a nice list of what the other buttons do exactly?\u003C/p\u003E\u003Cp\u003EFor example I asume keep horizontal locks a horizontal speed, but how exactly is that usefull? Same for Orbital?\u003C/p\u003E\u003Cp\u003EAnd would you suggest practicing at KSC, or on the Mun?\u003C/p\u003E\n"},{"CreatedByName":"Kerba Fett","CreatedById":62292,"CreatedDateTime":"2013-10-23T01:57:10Z","Content":"\n\u003Cp\u003EKill HS cancels your horizontal speed. You can still move with the flight controls, but as soon as you let go of the controls it will try and cancel your velocity. Keep orbit maintains your orbital velocity. Perhaps you dip a bit too deep into the atmosphere on a flyby. This will run the throttle just enough to keep you from areobraking. Keep surface maintains your surface speed. More useful for planes when climbing or descending.\u003C/p\u003E\u003Cp\u003EAnd as the other fellows have said, Keep Vert is for vertical speed control. Positive numbers are climb, 0 is hover, negative numbers are descent.\u003C/p\u003E\u003Cp\u003EAccording to the wiki for Mechjeb 1 the panic button kills throttle, seperates all but the last stage, then autolands. Touching any controls aborts the panic function.\u003C/p\u003E\u003Cp\u003EThe execute button locks in the number in the field. \u003C/p\u003E\u003Cp\u003EOne thing that a lot of people don\u0027t realize is that you can enter a descent rate then click execute to make it active, THEN enter a new descent rate and click somewhere outside the window. You\u0027re still descending at the first rate as shown by the text just under the execute button. When you\u0027re ready for the new rate you just click the execute button to make it active. This is quite helpful since your flight controls are disabled when the window is active and by clicking execute then clicking outside the window, they\u0027re not disabled for long.\u003C/p\u003E\u003Cp\u003EAlso, as of .21 you could use the translatron for takeoffs. I\u0027ve managed to lift off with it set as low as .05 m/sec. It used to glitch and flip the lander if you tried to use it from the ground when I started playing with it back in .18.\u003C/p\u003E\u003Cp\u003EThere\u0027s a stock VTOL you can play with this on in the spaceplane hanger. It\u0027s pretty fuel hungry so you may want to edit up an new copy of the engines with a higher isp if you want to play for a while. One big limitation of the Keep Vert function is that it doesn\u0027t work well with jet engines. It can\u0027t seem to deal with the spool up time of the engines so it works for small movements, but eventually the throttle lag causes mechjeb to over correct more and more till you crash.\u003C/p\u003E\u003Cp\u003EIf you want to play with long running VTOL\u0027s you probably have to use edited rocket engines.\u003C/p\u003E\n"}]}