{"TopicId":49857,"ForumId":20,"TopicTitle":"Steam Workshop","CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2013-10-21T12:09:40Z","PageNum":1,"Articles":[{"CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2013-10-21T12:09:40Z","Content":"\n\u003Cp\u003EJust a quick and curious question. \u003C/p\u003E\u003Cp\u003EHave there been any official notions about implementing Steam Workshop?\u003C/p\u003E\u003Cp\u003ENot so much about the usability of an actual SDK, but more about mod management and the ease of access to updates to said mods.\u003C/p\u003E\n"},{"CreatedByName":"DYJ","CreatedById":8636,"CreatedDateTime":"2013-10-21T12:16:53Z","Content":"\n\u003Cp\u003EThe official line is that it won\u0027t happen, KSP is not exclusive on steam so it wouldn\u0027t make too much sense.\u003C/p\u003E\n"},{"CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2013-10-21T12:28:12Z","Content":"\n\u003Cp\u003EWell, if that\u0027s not going to happen, then I\u0027m looking forward for an overhaul of the spaceport. \u003C/p\u003E\u003Cp\u003EIe. Legacy/Legend downloads. And perhaps a more clear design, less frontpage templates, more Kerbals or spacy looking design..\u003C/p\u003E\u003Cp\u003EAnd finally, on the long run, an actual mod updater of some sort...\u003C/p\u003E\u003Cp\u003EI\u0027m well aware of the limited time/workforce that squad have to put into said site, however I\u0027m more surprised that Squad decided to make there own Mod Database, when in most other games, it is usually left open to the Community to make one. And by doing that, the developers wont get stressed out by yet another side of the project.\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-10-21T12:31:47Z","Content":"\n\u003Cp\u003ERob (N3X15), have been working a fair bit on redesigning spaceport. You can follow the progress every week with the weekly update.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-21T13:34:57Z","Content":"\n\u003Cp\u003ESpaceport is a wreck..and kinda sad how Squad ignores all spaceport issue at this time...just saying \u0027new one is being made\u0027....well guess what fellas, making a new website DOES NOT FIX THE CURRENT ONE...nor the issues your playerbase has with it.\u003C/p\u003E\u003Cp\u003E@Yilmas: Mods are easy as can be to install/uninstall since 0.20 dropped, my guess is (like I was) your sick of having to navigate into the steam folder to make changes?? Easy fix for that, make a copy of the KSP install onto your desktop. Keep your steam install mod free, as a backup. I actually keep 3 installs of KSP...One in steam folder that stays stock, and 2 on my desktop, one for playing the game, one for testing/developing new parts or testing mods im unsure of.\u003C/p\u003E\n"},{"CreatedByName":"Panzerbeard","CreatedById":66380,"CreatedDateTime":"2013-10-21T14:28:33Z","Content":"\n\u003Cp\u003EYeah, Steam Workshop would be a convenient way of sharing .crafts and mods, but the issue is that people would start using it exclusively, meaning stuff might not be available to non-steam players. I\u0027m hoping that by release they\u0027ve got some sort of sharing system for .crafts integrated into the game itself, and the Spaceport is no longer terrible.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-21T14:35:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashflare\u0022 data-cite=\u0022Ashflare\u0022\u003E\u003Cdiv\u003EYeah, Steam Workshop would be a convenient way of sharing .crafts and mods, but the issue is that people would start using it exclusively, meaning stuff might not be available to non-steam players. I\u0027m hoping that by release they\u0027ve got some sort of sharing system for .crafts integrated into the game itself, and the Spaceport is no longer terrible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is also no moderation on Steam Workshop...not like there is here at least. I will commend Squad on there Mod posting rules...if more modder games used like rules Id probably play more. \u003C/p\u003E\u003Cp\u003EMaking devs post source code is really a much bigger security feature than people think....anyone who played GuildWars in its hayday will know just what Im talking about...figgin virus city..and not just in some mods...on mod d/l sites too....Spaceport(despite how crappy it is) and source rules really REALLY cut down on that.\u003C/p\u003E\u003Cp\u003EIn fact I have yet to get even the smallest virus from ANYTHING ksp related...and I use as much mods as the program will let me.\u003C/p\u003E\u003Cp\u003EIf this was a Steam only game I could see this happening, but as is I think it would actually be detramental to the KSP community as a whole.\u003C/p\u003E\n"},{"CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2013-10-21T14:44:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003ESpaceport is a wreck..and kinda sad how Squad ignores all spaceport issue at this time...just saying \u0027new one is being made\u0027....well guess what fellas, making a new website DOES NOT FIX THE CURRENT ONE...nor the issues your playerbase has with it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs an Interactive Developer with more than a decade of work experience, I fully understand the dilemma that Squad faces, which again leads me to think, that it was/is a mistake that they themselves decided to host there own mod database. \u003C/p\u003E\u003Cp\u003EIt is true, that a new website dosn\u0027t fix the current one, however from my understanding there is only 1 guy on the website development component, and it is in my believe better for him to focus on a new website, rather than fixing the old one. Nobody likes the job of maintaining old code, nor is it an easy job when you look at the rather unintelligible search function.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EMods are easy as can be to install/uninstall since 0.20 dropped, my guess is (like I was) your sick of having to navigate into the steam folder to make changes?? Easy fix for that, make a copy of the KSP install onto your desktop.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt may be easy for you, me and the IT experienced players of this community. However, I dont know if you\u0027ve noticed the amount of players that dosn\u0027t have that much computer experience on the forums. So many people asking different questions, that you may be doing a /facepalm over. Are we as a community just to forget about them. Sometimes, it feels like Squad has, however as someone else mentioned as well in a different thread, using mods is at the users own discretion and therefor Squad doesn\u0027t hold any responsibilities nor obligations.\u003C/p\u003E\u003Cp\u003EI may not have played this game for the many years that a lot of the players have on this forum. However, during the last 2-3 months that I have played it. I\u0027ve grown to find it very much enjoyable, and would at any time recommend it to others. So why shouldn\u0027t I want to improve said game, if I believed I had something to contribute to it. \u003C/p\u003E\u003Cp\u003EIf I had been on this forum for the last many years, I might have been able to gain the recognition that it would require to make a new and community hosted mod database. I atleast know I have the skills. But what can one do with skills alone. \u003C/p\u003E\u003Cp\u003ESo instead I must try to contribute to the problem at hand, with what ever I have.\u003C/p\u003E\u003Cp\u003EMost of this might seem like it is what most people are thinking, however I haven\u0027t seen much talk about it. \u003C/p\u003E\u003Cp\u003ESo with the little recognition I have, I would like to ask the community, what do you feel WE can do to help the situation?\u003C/p\u003E\u003Cp\u003EBesides whining, which accomplishes nothing...\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-21T15:26:06Z","Content":"\n\u003Cp\u003ETheir \u0027dilemma\u0027 does not justify ignoring all the request for supports....\u003C/p\u003E\u003Cp\u003E(myself and many other players have been locked out of spaceport account since 0.20 droped...and all we are told is \u0027new spaceport is being worked on\u0027.....still havent been able to login in several months...)\u003C/p\u003E\u003Cp\u003EIf I treated even a small % of my customers like that I would be out of buissness, broke, and homeless.....just saying...this is NOT the proper way to do customer support, regardless of circumstance.\u003C/p\u003E\u003Cp\u003EYou should also read the \u0027Addon Posting\u0027 rules thread, as some of the things your suggesting are technically against squads rules. FYI, there used to be a 3rd party add-on site..it got shut down...\u003C/p\u003E\u003Cp\u003E3rd party sites become a security issue, as stated in my last post. Seems like your making suggestions based on what would fit you best, not the community overall.\u003C/p\u003E\u003Cp\u003E3rd party site = more bunk downloads = more a-holes putting viruses in mods = the degredation of the KSP modding community....\u003C/p\u003E\u003Cp\u003EDont belive that? go look at any number of previous \u0027modders games\u0027 that have failed and been shut down due to just this thing...\u003C/p\u003E\u003Cp\u003EAlso you should learn the difference between whining and stating an opinion that\u0027s based on valid concerns before you offend someone.....\u003C/p\u003E\n"},{"CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2013-10-21T16:00:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EYou should also read the \u0027Addon Posting\u0027 rules thread, as some of the things your suggesting are technically against squads rules. FYI, there used to be a 3rd party add-on site..it got shut down...\u003Cp\u003E3rd party sites become a security issue, as stated in my last post. Seems like your making suggestions based on what would fit you best, not the community overall.\u003C/p\u003E\u003Cp\u003E3rd party site = more bunk downloads = more a-holes putting viruses in mods = the degredation of the KSP modding community....\u003C/p\u003E\u003Cp\u003EDont belive that? go look at any number of previous \u0027modders games\u0027 that have failed and been shut down due to just this thing...\u003C/p\u003E\u003Cp\u003EAlso you should learn the difference between whining and stating an opinion that\u0027s based on valid concerns before you offend someone.....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst off, I would like to say, that I am sorry if anything I said offended you, or anyone else for that matter. I simply read your post as whine because of the unnececary use of capitals and the overall quickness of the post. For that I am sorry. \u003C/p\u003E\u003Cp\u003ECould you, if you have time, find me that thread \u0022Addon Posting\u0022. It seems to be deluding me. A search only resulted in this thread as top result. And any rules I could find were the regular Forum Rules, which from my understanding doesn\u0027t even come close to disallowing such suggestions that I made. \u003C/p\u003E\u003Cp\u003EWhether or not a 3rd party mod database equals bad mods, is very much debatable, as an example. Look at curse. Sure they are a big company now, but thats not how it began. \u003C/p\u003E\u003Cp\u003EThere are so many ways to combat illegitimate addons(malware and the like), that I cant really agree with simply banning them. \u003C/p\u003E\u003Cp\u003EOne of which, is proberbly the most used, the community/moderator approval system, where a mod wont see the daylight of regular players, until it has been approved by both a moderator and the community.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-21T16:22:31Z","Content":"\n\u003Cp\u003EA mod approved method would be the way to go once a full release is done, however I see massive problems with that now, based on how oftern KSP, and therefore mods, get updated. \u003C/p\u003E\u003Cp\u003ECurse was kinda a bad example, while they are a great mod depository for many games now, back in the early days it was not so good...I did actually get a virus from there...granted I think it was actually within the first year the site was active...probably unheard of now.\u003C/p\u003E\u003Cp\u003EYes, there are plenty of way to combat people uploading bad addons, but it all depends on the person (people) running that site to enforce it. With a 3rd party site there is no way to confirm it, and certainly no way for Squad to get in on it....I think this was the basic idea behind SpacePort.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/33079-Addon-posting-rules-May-31-2013\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/33079-Addon-posting-rules-May-31-2013\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Enot sure why, but the search feature seems to hate sticky threads\u003C/p\u003E\u003Cp\u003EThis \u002B KSP ToS...there is a fairbit of handwaving to some of it...esp the stuff in ToS about mods n such\u003C/p\u003E\u003Cp\u003EKinda an after thought, but how hard would it be to automate the \u0027mod approved posting\u0027 type addon site? I know practicaly nothing about coding, but my antivirus automates keeping my computer clean. Maybe its possible to imbed the same kinda process into the posting feature of a website??\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T16:36:25Z\u0022 title=\u002210/21/2013 04:36  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by KhaosCorp\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2013-10-21T16:45:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/33079-Addon-posting-rules-May-31-2013\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/33079-Addon-posting-rules-May-31-2013\u003C/a\u003E\u003Cp\u003Enot sure why, but the search feature seems to hate sticky threads\u003C/p\u003E\u003Cp\u003EThis \u002B KSP ToS...there is a fairbit of handwaving to some of it...esp the stuff in ToS about mods n such\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI must be missing something here. Because neither the \u0022Addon posting rules\u0022 thread, ToS nor the EULA disallows 3rd party mod database\u0027s. All the information I\u0027ve been able to find, concerns the use of License files, and respect of it regarding how a user may use the mod in question.\u003C/p\u003E\u003Cp\u003EPerhaps DYJ(or another moderator) can give a final word on this ? Because the documentation I\u0027ve been led to believe should contain it, does not seem to do so.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EA mod approved method would be the way to go once a full release is done, however I see massive problems with that now, based on how oftern KSP, and therefore mods, get updated. \u003Cp\u003ECurse was kinda a bad example, while they are a great mod depository for many games now, back in the early days it was not so good...I did actually get a virus from there...granted I think it was actually within the first year the site was active...probably unheard of now.\u003C/p\u003E\u003Cp\u003EYes, there are plenty of way to combat people uploading bad addons, but it all depends on the person (people) running that site to enforce it. With a 3rd party site there is no way to confirm it, and certainly no way for Squad to get in on it....I think this was the basic idea behind SpacePort.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhether or not Curse is a bad example or not, all comes back to the user looking at it. So lets just keep it at that.\u003C/p\u003E\u003Cp\u003EWell, to be technical, if a user experience virus issues from a mod downloaded through a 3rd party site. It can never be Squads fault.\u003C/p\u003E\u003Cp\u003EAnd in the end, if the users of such a mod database, feels that all the site is giving them is bad addons, surely, the users will leave said site. Which inevitably would lead to the site being closed. As you have mentioned in an earlier post.\u003C/p\u003E\u003Cp\u003EHowever, I stand by my opinion that that should be the challenge of the community, rather than Squad, which clearly have plenty of other things to do.\u003C/p\u003E\u003Cp\u003EAnd then, as time progresses, we might see squad creating an actual SDK, which would bring control back to Squad, when they feel they have the time and money to focus on it.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-21T17:06:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yilmas\u0022 data-cite=\u0022Yilmas\u0022\u003E\u003Cdiv\u003EAnd in the end, if the users of such a mod database, feels that all the site is giving them is bad addons, surely, the users will leave said site. Which inevitably would lead to the site being closed. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think ya just hit the nail on the head behind the idea of SpacePort. It eleminates (or is supposed to) that whole \u0027where to get my mods from\u0027 process for the player. \u003C/p\u003E\u003Cp\u003EAs for the 3rd party site I mentioned that was closed a moderator jumping in on that would be awesome, as I came along after the fact, and am going on heresay. But from what I gather it was closed due to some violations.....not sure if that denotes license violations, or something squad put into play...but either way it presents a (possibly recurring) issues.\u003C/p\u003E\u003Cp\u003EPersoanly Im all for a 3rd party site, if these several issue can be addressed in a fashion that allows the modding community to operate basicaly as it does now.....Better the Squad devs be working on the game imo then spaceport.\u003C/p\u003E\u003Cp\u003ELeads me back to previous point...how much of these much needed security features can be automated if indeed 3rd part sites are indeed ok (and I still have my doubts..well known people in the modding community have actually offered to host addon repository, and yet to see anything...one name that sticks out was Majiir offered just this..i think just after 0.20 or maybe 0.21).\u003C/p\u003E\u003Cp\u003EHow do site like Curse currently handle these issue come to think of it?\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-10-21T17:11:24Z","Content":"\n\u003Cp\u003EI have a strong dislike for steam workshop.\u003C/p\u003E\n"},{"CreatedByName":"DYJ","CreatedById":8636,"CreatedDateTime":"2013-10-21T17:14:28Z","Content":"\n\u003Cp\u003EThere is no legal reason why you wouldn\u0027t be allowed to host a thirdparty mod database ( as long as you are just letting mod authors upload their stuff there on their own volition ). There has been a few attempts, some more successful than others. Kerbal.net which I assume is what KhaosCorp is referring too is one of these, and it was indeed shutdown but not after legal or otherwise pressure from squad, its maintainers simply assumed that spaceport would be good enough to make kerbal.net obsolete.\u003C/p\u003E\u003Cp\u003ESpaceport is in its current state not a good service and I\u0027d advice people to stay away from it until spaceport 2 rolls out.\u003C/p\u003E\n"},{"CreatedByName":"Yilmas","CreatedById":83246,"CreatedDateTime":"2013-10-21T18:20:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EPersoanly Im all for a 3rd party site, if these several issue can be addressed in a fashion that allows the modding community to operate basicaly as it does now.....Better the Squad devs be working on the game imo then spaceport.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood to see, we can agree on some topics \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003ELeads me back to previous point...how much of these much needed security features can be automated if indeed 3rd part sites are indeed ok (and I still have my doubts..well known people in the modding community have actually offered to host addon repository, and yet to see anything...one name that sticks out was Majiir offered just this..i think just after 0.20 or maybe 0.21).\u003Cp\u003EHow do site like Curse currently handle these issue come to think of it?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have seen Majiirs name pop up a few times, however not under a topic of a mod database. But perhaps, it might be something that would be worth looking into. \u003C/p\u003E\u003Cp\u003ETo my knowledge Curse handles the security aspect as part moderator part community. \u003C/p\u003E\u003Cp\u003EIn the general sense, the community approves of new addons via gameplay through the Curse Client. Which automaticly logs whether or not a user have actually played with that addon, and therefor have experience with it. Before it allows the user to vote on its content. \u003C/p\u003E\u003Cp\u003EThe moderators then handpicks addons which looks illegit or faulty (through an autonomous system or random, I dont know). Validates its content, and marks it \u0022Curse approved\u0022, where as the community can only mark it as \u0022Community approved\u0022.\u003C/p\u003E\u003Cp\u003EWhen enough votes have been cast, the addon then gets send to the mass\u0027.\u003C/p\u003E\u003Cp\u003EHowever!!! It must also be noted, that the games that Curse supports, actually have there own SDK, meaning the developers are already in a some what control of what an addon can change/configure.\u003C/p\u003E\u003Cp\u003EThe case that you thought off, I\u0027m guessing, is from before Curse made it a requirement that the games must have an SDK.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveofDefeat\u0022 data-cite=\u0022DaveofDefeat\u0022\u003E\u003Cdiv\u003EI have a strong dislike for steam workshop.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn which way do you dislike steam workshop ? Any input can be used to improve any future ideas.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DYJ\u0022 data-cite=\u0022DYJ\u0022\u003E\u003Cdiv\u003EThere is no legal reason why you wouldn\u0027t be allowed to host a thirdparty mod database ( as long as you are just letting mod authors upload their stuff there on their own volition ). \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the clarification.\u003C/p\u003E\n"}]}