{"TopicId":50013,"ForumId":20,"TopicTitle":"Should Void\u0026#039;s Hud be in base game?","CreatedByName":"Peppe","CreatedById":51446,"CreatedDateTime":"2013-10-22T05:32:03Z","PageNum":1,"Articles":[{"CreatedByName":"Peppe","CreatedById":51446,"CreatedDateTime":"2013-10-22T05:32:03Z","Content":"\n\u003Cp\u003EMod:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/void-vessel-orbital-information-display-2/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/void-vessel-orbital-information-display-2/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI have i been taking a look at flight information mods and stumbled across void, Vessel Orbital Information Display, a weekend or two ago.\u003C/p\u003E\u003Cp\u003EIt has a hud option that puts basic orbit and surface information right next to the altimeter (also shows in orbital map view). The data is plain text and doesn\u0027t obstruct the view of the screen. No windows/borders, so all very clean. \u003C/p\u003E\u003Cp\u003EExample:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/s9dn4j1.png\u0022 alt=\u0022s9dn4j1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe data is basically a quick summary of what you can get from one of the standard views (orbital, flight, or internal). I like it because you can spend more time in flight view and only need orbit view to setup maneuvers.\u003C/p\u003E\u003Cp\u003ECompared to mechjeb and flight engineer the VOID hud looks and feels like it should be in the game. The others with borders and extra information go well above what you as a player can access from all the available views.\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-10-22T11:05:04Z","Content":"\n\u003Cp\u003ENo, it should not be in the game. KSP tries to use as few numbers as somehow possible and instead have a \u0022natural\u0022 looking UI. Beside that it just looks like someone made its first modding experiences at all. The game would have to do it in a visually more attractive way and yes, that would require more screen space, again.\u003C/p\u003E\u003Cp\u003EBtw I\u0027m using MechJeb to display such information. Orbit Info is open pretty much all the time here; Dv / Surface only when required. So yes, i think i can understand why you want it.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2013-10-22T11:23:16Z","Content":"\n\u003Cp\u003EId like the same text/font but arranged around the screen in a circle like, as in future tech huds, with little lines and indicators and small flashing indicators with different colours.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}