{"TopicId":54112,"ForumId":20,"TopicTitle":"Mod with 3.75m to 2.5m stack quad-adapter","CreatedByName":"leops1984","CreatedById":78510,"CreatedDateTime":"2013-11-23T15:06:16Z","PageNum":1,"Articles":[{"CreatedByName":"leops1984","CreatedById":78510,"CreatedDateTime":"2013-11-23T15:06:16Z","Content":"\n\u003Cp\u003EIs there a mod that has a part like the stock stack quad adapter (TVR-400L Stack Quad-Adapter), except that it goes from a 3.75m stack to four 2.5m stacks?\u003C/p\u003E\u003Cp\u003EAlso, are there mods that have a in-line 3.75m unmanned pod (like the RC-L01 Remote Guidance Unit, only bigger) and a inline battery in the same size?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-11-23T15:35:29Z","Content":"\n\u003Cp\u003E\u003Cem\u003EWhat is this place?\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s called... General Add-on Affairs.\u003C/p\u003E\u003Cp\u003EShhh.... First, a deep breath, take it all in... feel the halogens warming your skin... smell how they pump in pure oxygen. See? They care... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mic_n","CreatedById":27054,"CreatedDateTime":"2013-11-25T11:23:14Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/CFG_File_Documentation\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/CFG_File_Documentation\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ErescaleFactor\u003Cp\u003E An optional parameter that is not usually included in most parts, but the option is available for resizing a part for personal use. In order to retain correct node placements, the scale parameter must also be proportionally changed to match the new rescaleFactor. The default value for rescaleFactor is 1.25 but can be changed to any value. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince there\u0027s already a 2.5 -\u0026gt; 4x1.25 adapter, scaling that up by 1.5 times would give you a 3.75 -\u0026gt; 4x1.875... which ain\u0027t gonna work.. scale it up by 2 would give you a 5 -\u0026gt; 4x2.5. It won\u0027t look right, but it\u0027ll work. If you want, go take a look at the development forums, get your hands on a free 3d modelling program and make yourself a model for it.. 1 circle splitting into 4 circles isn\u0027t an overly complicated shape to model.\u003C/p\u003E\u003Cp\u003ESo.. neither option there is perfect, but it\u0027s a possibility for a lot of parts like that that are just the wrong size (like the pod and battery you mention)... make a copy of them in another folder (I had a \u0022my stuff\u0022 folder with various bits and pieces like that) and modify the names, descriptions and dimensions to suit.\u003C/p\u003E\u003Cp\u003EJust remember, if you want to keep it \u0027balanced\u0027, to rescale the mass accordingly, as well.. and given mass is a measure of the solid form and not just a linear like the rescalefactor value, you need to scale that into three dimensions.. ie if you increase the rescalefactor by 1.5 times, you need to increase mass by 1.5^3 (=3.375) times.. doubling the factor increases mass by 8 times.\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t recommend redistributing them, since you\u0027re just modifying someone else\u0027s work - if you want to, I\u0027d heartily recommend contacting the original author and running it by them - they may like to include it in a future release if it\u0027s going to be useful.\u003C/p\u003E\u003Cp\u003EBut to answer your original question: I have no idea.\u003C/p\u003E\n"}]}