{"TopicId":62048,"ForumId":20,"TopicTitle":"Is there such a thing as a \u0026quot;modpack\u0026quot; for KSP?","CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-03T15:04:25Z","PageNum":1,"Articles":[{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-03T15:04:25Z","Content":"\n\u003Cp\u003ESome games, like Minecraft, have seen their modding scene progress well beyond simply having a selection of individual mods to choose from. Interested players can find a wide variety of full modpacks, which are pre-bundled collections of a number of mods, usually even with custom configurations et al.\u003C/p\u003E\u003Cp\u003EThis of course raises the question: could one do this for KSP? I have not seen such a modpack yet (apart from one or two mods that bundle little helper plugins or mention that they are designed to be run alongside a specific other mod). So now I am curious why. Is there simply no demand for it, or are there legal reasons? I am not very good with that topic, so I\u0027ll attempt to summarize what I think I understand about mod distribution. Please correct me if I am wrong.\u003C/p\u003E\u003Cp\u003EAs stated in the sticky, every mod posted must have some form of license. Technically that would allow a person to select a number of mods that allow redistribution by third parties, bundle them up, and release them as a pack. Licenses might also include permission to modify content, which would allow a modpack creator to tweak the respective mods themselves.\u003C/p\u003E\u003Cp\u003EAs far as Squad\u0027s content goes, I am less sure. Would a maker be allowed to change stock part.cfg files and redistribute them as part of a modpack with the goal of more smoothly integrating stock and modded parts, or does that infringe on Squad\u0027s copyright? I\u0027m not talking about actually bundling art assets, sounds or code; just config files that anyone can access and modify at their leisure anyway. And, in a related question, how are these config files treated from the perspective of modifying a mod that does not grant a license to modify it?\u003C/p\u003E\u003Cp\u003EThanks in advance for satisfying my curiosity on the matter \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-02-03T15:56:01Z","Content":"\n\u003Cp\u003EI don\u0027t think a lot of mods\u0027 licences allow this. Although... I suppose you could make a program that downloads the mods from the official download sites...\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-02-03T16:00:08Z","Content":"\n\u003Cp\u003EThe closest thing we have is ROV. Here\u0027s some reading on the subject:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66270-ks-are-they-legal-and-ethical\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/66270-ks-are-they-legal-and-ethical\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/62956-KSP-needs-a-lazy-newb-pack\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/62956-KSP-needs-a-lazy-newb-pack\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61829-MOD-Packs\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/61829-MOD-Packs\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/50048-Assembling-a-Mod-Pack\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/50048-Assembling-a-Mod-Pack\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETL;DR: KSP is nothing like Minecraft. Mods are easy to install, are developed at a fast pace, and there are rarely compatibility issues to deal with. Mod packs aren\u0027t needed.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2014-02-03T21:35:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETL;DR: KSP is nothing like Minecraft. Mods are easy to install, are developed at a fast pace, and there are rarely compatibility issues to deal with. Mod packs aren\u0027t needed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I understand why you dislike Mods, and they are not likely to happen any time soon for KSP, I disagree with the statement that Mod packs aren\u0027t needed. \u003C/p\u003E\u003Cp\u003EThere are already multiple mods that do the same thing (eg 3 different life support mods). Some mods are well suited to each other because they compliment each others features, for example KAS is useful with Kethane, so you can run pipes around to refuel stuff. These points alone make the idea of mod packs worthwhile.\u003C/p\u003E\u003Cp\u003EI expect we will see mod packs in the future, once the game becomes more stable (ie beta), but as regex has said at the moment development pace is too fast for them to be practical.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-02-03T21:55:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Merinsan\u0022 data-cite=\u0022Merinsan\u0022\u003E\u003Cdiv\u003EWhile I understand why you dislike Mods\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe point of my post was not to illustrate my dislike of mod packs and the people who make them, but to point out that this discussion happens quite often and there was already ample reading on the subject, and ample reasons why mod packs are generally a bad idea.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Merinsan\u0022 data-cite=\u0022Merinsan\u0022\u003E\u003Cdiv\u003Efor example KAS is useful with Kethane, so you can run pipes around to refuel stuff\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENeither of those mods allow redistribution. I suspect more mod authors will change licenses when and if mod packs become popular, depending on their inclination.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-04T10:25:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThe closest thing we have is ROV. Here\u0027s some reading on the subject:\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66270-ks-are-they-legal-and-ethical\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/66270-ks-are-they-legal-and-ethical\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/62956-KSP-needs-a-lazy-newb-pack\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/62956-KSP-needs-a-lazy-newb-pack\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61829-MOD-Packs\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/61829-MOD-Packs\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/50048-Assembling-a-Mod-Pack\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/50048-Assembling-a-Mod-Pack\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETL;DR: KSP is nothing like Minecraft. Mods are easy to install, are developed at a fast pace, and there are rarely compatibility issues to deal with. Mod packs aren\u0027t needed.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the links, they were very informative.\u003C/p\u003E\u003Cp\u003EWhile I understand that you feel strongly about the topic, I disagree with your assessment that there would be nothing to gain from prebundled packs. I\u0027ve recently been trying out different KSP mods, and in all honesty, as soon as you get more than 2-3 installed at once, it gets both bloated with redundant parts and disjointed in terms of intended user experience. Also, if you want to play career mode, you\u0027re wasting a ton of potential without a custom tech tree - which must be tailored to the mod selection and/or vision at hand. I\u0027ve briefly tried a few standalone tech tree mods, but most of them try to accomodate all mods ever and thus end up unplayable for any particular subset (unless you don\u0027t mind 8 out of 10 nodes being empty).\u003C/p\u003E\u003Cp\u003ENow I\u0027ve no issues with editing stuff together for myself, but I thought I might as well check if someone else already had a similar idea. Might save me hours of work, you know?\u003C/p\u003E\u003Cp\u003EAsking mod authors to coordinate with each other to an extent where this is no longer an issue is both infeasible (it would limit creativity/variety in design) and extra work on their backs which takes away from development. It seems a much better idea for a player with free time and a vision for a specific experience to take on the task of integrating the mods he wants, and then offer that experience to other players to discover. If redistribution of mods is undesired, then a simple config pack could be provided, which merely overwrites config files on the end user side or works through a ModuleManager plugin. People would then download the mods themselves and simply use the config pack to integrate them.\u003C/p\u003E\u003Cp\u003EOf course the concerns of developers voiced in the other threads are valid as well, and I in no way support parading someone else\u0027s work as one\u0027s own. I just don\u0027t think that dismissing the idea of bundles with \u0022there\u0027s no need\u0022 is a valid argument, because clearly there are people who see a need. Else this discussion wouldn\u0027t reappear so frequently.\u003C/p\u003E\u003Cp\u003E(P.S.: Minecraft has had drag-and-drop mod installation with zero jarfile editing for well over a year now.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-04T10:27:32Z\u0022 title=\u002202/04/2014 10:27  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 4, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2014-02-04T15:16:05Z","Content":"\n\u003Cp\u003EIt always perplexes me how most Minecraft mod support lags behind the official releases by several months.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-02-04T15:23:24Z","Content":"\n\u003Cp\u003EYeah, those lazy dev. It\u0027s so simple to mod on MC ! you just have to decompile MC, update forge/Bukkit/WhateverFrameworkYouUse to works with the new decompiled and obfuscated code, have them be stable and then rewrite the part of your mods that broke because something changed in MC or forge.\u003C/p\u003E\u003Cp\u003EStreetwind : while none of my mod licence stop someone from adding them to a pack you will find that I\u0027ll won\u0027t provide any support to a modpack. It\u0027s hard enough to do support for 2 versions, I won\u0027t shot myself in the foot trying to support whatever version someone choose to pack.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E(P.S.: Minecraft has had drag-and-drop mod installation with zero jarfile editing for well over a year now.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow is the the weather in 2016 ?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-04T15:25:27Z\u0022 title=\u002202/04/2014 03:25  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 4, 2014\u003C/time\u003E by sarbian\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-02-04T15:59:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EIf redistribution of mods is undesired, then a simple config pack could be provided, which merely overwrites config files on the end user side or works through a ModuleManager plugin. People would then download the mods themselves and simply use the config pack to integrate them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think anyone has ever had an objection to this \u0022method\u0022. The Realism Overhaul crew does this and at least one other mod (BTSM) has a required mod list. What most mod authors object to, if you read those threads, is to people redistributing their work for various reasons. This can obvious be handled with licensing and probably will if someone ever goes the redistributing route. So far no one has come along and started redistributing, and finding all the joys inherent in bug reports, and dealing with KSP version change hysteria (because they will inevitably choose the more popular mods which have to deal with that sort of thing), and resolving license disputes.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EI just don\u0027t think that dismissing the idea of bundles with \u0022there\u0027s no need\u0022 is a valid argument, because clearly there are people who see a need. Else this discussion wouldn\u0027t reappear so frequently.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople who \u0022see a need\u0022 fall into two groups: doers and talkers. People who make threads about something they \u0022see a need\u0022 for are talkers. So far all we\u0027ve seen on this front, save for the Realism Overhaul \u0022doers\u0022 (who put in a lot of quality time and energy writing their scripts and mods), has been talkers. Apparently the rest of the doers can be dissuaded by grumpy middle-aged forum warrior spewing links to past threads.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E(P.S.: Minecraft has had drag-and-drop mod installation with zero jarfile editing for well over a year now.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the info, although I find it hard to believe. I haven\u0027t modded Minecraft or really played it outside my company\u0027s stock server for over a year.\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2014-02-04T19:18:13Z","Content":"\n\u003Cp\u003EYou could theoretical have something that goes to the mods link on spaceport. Then you would just have a config file of what mods you wanted to download.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-04T19:45:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EPeople who \u0022see a need\u0022 fall into two groups: doers and talkers. People who make threads about something they \u0022see a need\u0022 for are talkers. So far all we\u0027ve seen on this front, save for the Realism Overhaul \u0022doers\u0022 (who put in a lot of quality time and energy writing their scripts and mods), has been talkers. Apparently the rest of the doers can be dissuaded by grumpy middle-aged forum warrior spewing links to past threads.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr maybe they just saw the reason in the arguments presented? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EContrary to popular belief, most people who enjoy playing mods are actually quite respectful towards the wishes of mod authors. It\u0027s sadly the bottom 10% who make enough problems for many times their numbers... If you or ferram or sarbian express your dislike for modpacks, then I have no issue accepting that. Besides, I\u0027m not a \u0022doer\u0022 in the sense of releasing anything anyway, I just like to tweak my things and explore various experiences. So you definitely don\u0027t have any drama to fear from my direction. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThanks for the info, although I find it hard to believe. I haven\u0027t modded Minecraft or really played it outside my company\u0027s stock server for over a year.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot really on topic here so I\u0027ll be brief, but you basically download an API that comes with a one-click installer. You then launch the client once to initialize it, after which you get a \u0022mods\u0022 folder in your install directory, into which you drop downloaded mods. You don\u0027t even need to unzip them. Fun bonus: the stock launcher can support an unlimited number of parallel game installations of all versions past, present and future, both modded and unmodded. That\u0027s something I would definitely love to see added to KSP after they finish building the game itself!\u003C/p\u003E\u003Cp\u003ENow, while that API\u0027s mod ecosystem is huge and constantly growing, there are also still a good number of legacy mods that do jarfile editing with all its annoying downsides, even though Mojang explicitly forbids it in the EULA. This is because Mojang has unofficially stated that they\u0027re not going to actually enforce that until they have their own stock API finished. Currently, only mods using the aforementioned third-party API are fully EULA compliant, and enforcing the EULA would basically result in Mojang forcing everyone to use a non-Mojang product for modding Minecraft, which is a can of worms nobody wants to open.\u003C/p\u003E\u003Cp\u003ESo basically it\u0027s come a long way but isn\u0027t completely there yet. By contrast, Felipe really did the community here a huge favor by concepting KSP as moddable from the start.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-02-04T22:46:38Z","Content":"\n\u003Cp\u003EIf we have Spaceport 2 integrated with the game (AKA ingame spaceport), a \u0022modpack\u0022 would be just a set of names and maybe one or another config file.\u003C/p\u003E\u003Cp\u003EIt would download each pack from its respective owner, then replace the needed config files with the pack ones.\u003C/p\u003E\u003Cp\u003EThen reload the game (or make some magic) and you good to go.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-05T08:49:57Z","Content":"\n\u003Cp\u003EThat sounds interesting. Is that a planned* feature?\u003C/p\u003E\u003Cp\u003E(* in the sense of statement of intent from Squad)\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-02-05T15:41:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EThat sounds interesting. Is that a planned* feature?\u003Cp\u003E(* in the sense of statement of intent from Squad)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure if it\u0027s planned, but i know that Spaceport 2 is/was under development.\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-02-05T16:22:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003ENot sure if it\u0027s planned, but i know that Spaceport 2 was under development.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI fixed your sentence. SP2 is not more.\u003C/p\u003E\n"}]}