{"TopicId":62639,"ForumId":20,"TopicTitle":"Discuss: MJ makes KSP more acceptable to Junior player. Hence, create more QUESTIONS.","CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-02-09T11:23:04Z","PageNum":4,"Articles":[{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-19T18:52:20Z","Content":"\n\u003Cp\u003EYou can\u0027t have it both ways. Either MJ is easy to add to the core game or it isn\u0027t. In the first half of your post you say that adding MJ is \u0022quick and only needing one person for QA\u0022, then later talk about how it will \u0022strain workloads and delay release\u0022. So, which is it?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESpace planes are a set of parts not a game mechanic. This is the difference. If they planned to REPLACE the rockets with space planes you would have a point.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESimilarly, if they planned to REPLACE manual piloting with MechJeb, you would have a point. And spaceplanes did change game mechanics, by allowing lifting craft! It suddenly got much easier to get into orbit or make an SSTO. It defies imagination that you can\u0027t see the analogy between C7 and MJ, other than being deliberately obtuse. Certainly, there are differences, as in any analogy, but I think the point stands. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EHonestly you posts come across as \u0022I would like this to be stock so everyone plays like me, no matter what others think\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s an unfair characterization. I would never support a reduction in game modes. I know there are a lot of people who enjoy KSPs piloting, and they should be able to do so. But MJ doesn\u0027t take that away! If implemented, I expect there will be people who don\u0027t use it, just as there are people who don\u0027t use spaceplanes, or ion engines, or rovers. My position is, \u0022MechJeb would improve the game experience for enough players with minimal impact on players that don\u0027t want to use it, so it should be included.\u0022\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-02-19T20:19:04Z","Content":"\n\u003Cp\u003EThis thread is way off topic. Whether MJ should be stock or not is beyond the scope of this thread (and could easily fill a thread of its own). Can we get back to Mechjeb\u0027s potential as a teaching tool for new players?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EExcept... your anecdote only \u0022proves\u0022 they\u0027ve used calculators too much and have thus been \u0022harmed\u0022 only if you accept the premise that knowing all the square roots up to 100 is a desirable state. You\u0027re essentially making the same mistaken assumption when it comes to MJ - starting with an untenable assumption and then extrapolating from there. A castle built on air has no foundation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it is \u003Cem\u003Eyour\u003C/em\u003E assumption that is untenable. Being able to mentally perform basic math functions without a calculator is essential for being able to teach a student more advanced forms of math (as a former math tutor, I\u0027ve seen the effects of overly relying on calculators, its not pretty). Is it such a stretch that learning KSP would share some similarities? Yet you seem adamant that it is wrong to advise a new player to learn some basics in the stock game before playing around with the most powerful tool available in KSP. I wish there was a double blind study into the effects of learning KSP both with Mechjeb at the start, and with trial and error. But there isn\u0027t one (I hope Teachergaming LLC is looking into this though). Until then, we can only offer opinions based on our own experiences and observations. \u003C/p\u003E\u003Cp\u003ELook at the Youtube \u0022let\u0027s play\u0022 channels that showcase KSP. Most of them fire up the game for the first time live. Would you recommend that they immediately install Mechjeb to learn how to play? Isn\u0027t \u0022failure is fun\u0022 one of the main attractions of learning KSP? Does Mechjeb massively cut down on the chance for failure? \u003C/p\u003E\u003Cp\u003ENow I know you\u0027ll accuse me of \u0022dictating how people should play\u0022, so let me stop you right there. I\u0027m not asking that a new players puts in 200 hours of stock KSP before \u0022allowing\u0022 them to try mods or anything. I\u0027m just saying I would recommend that they play stock for a short time before diving into mods. From what I have observed, most players fail spectacularly at first, start to figure things out, achieve some of the basic accomplishments, then start to run into a wall of \u0022what next\u0022. That is when I would suggest mods like Mechjeb. Its a learning process that most players seem to go through. Given no other information than \u0022new player\u0022, this is what I would recommend.\u003C/p\u003E\n"},{"CreatedByName":"TimMartland","CreatedById":68334,"CreatedDateTime":"2014-02-19T20:43:06Z","Content":"\n\u003Cp\u003EI have proof MechJeb is a good teaching tool for new players, because it taught me the game back when even the most \u0027For Dummies\u0027 Guide left me floundering. Getting to watch my rockets do stuff allowed me to improve my design techniques, and eventually allowed me to learn difficult procedures like transfers and rendezvous\u0027. I still keep MechJeb around, but mostly for plotting interplanetary for me, getting my orbits to that exact 100km-100km above Kerbin and the occasional time I forget to pack lights on a night landing.\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2014-02-19T21:51:34Z","Content":"\n\u003Cp\u003EFor the \u0022I can\u0027t pilot for my life, I want to just design crafts and plan my missions\u0022 situation there are 2 solutions:\u003C/p\u003E\u003Cp\u003Ea) use autopilot, take the challenge to design crafts it flies perfectly (the only minus is that MJ-optimized crafts might become almost unflyable by hand, making it problematic to even try learning piloting). You\u0027ll still get a nicely running space program. But if you start thinking about it getting boring, try to learn a bit of manual piloting.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E try to learn to fly manually and take the challenge to design crafts even you can fly with no problem. You will practice both engineering and piloting skills. \u003C/p\u003E\u003Cp\u003ENow, if you ask the oldschool players, most will recommend the second path. Why? There were times when plugins didn\u0027t exist, but there also wasn\u0027t much to do except practicing you piloting skills. But using MJ to kickstart your space program and then gradually learning to pilot (or even not leaning much) is fully legit, too.\u003C/p\u003E\u003Cp\u003EAlso there\u0027s a third option: find a friend who can\u0027t build a rocket, but likes piloting. And try playing coop!\u003C/p\u003E\u003Cp\u003EBut let me say one one thing about one of the strongest pro-MJ arguments about optimizing too repetitive tasks. If you ran into ten flights to assemble each interplanetary mission, maybe it\u0027s time for the engineering challenge to optimize it? Try reducing the size of your crafts or designing a better launch vehicle. That\u0027s also a great task for the engineers. (Says the creator of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57197-The-ultimate-Jool-5-challenge-land-Kerbals-on-all-moons-and-return-in-one-big-misson?p=967141\u0026amp;viewfull=1#post967141\u0022 rel=\u0022external nofollow\u0022\u003Ethis thing\u003C/a\u003E *facepalm*)\u003C/p\u003E\u003Cp\u003EAlso the precision of MechJeb - you don\u0027t need that precision. Even in the real world it\u0027s impossible to get maneuvers with such levels of precision. That\u0027s what small mid-course corrections are for.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-19T21:57:31Z\u0022 title=\u002202/19/2014 09:57  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 19, 2014\u003C/time\u003E by Alchemist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2014-02-19T23:30:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SpaceGremlin\u0022 data-cite=\u0022SpaceGremlin\u0022\u003E\u003Cdiv\u003EI think it is \u003Cem\u003Eyour\u003C/em\u003E assumption that is untenable. Being able to mentally perform basic math functions without a calculator is essential for being able to teach a student more advanced forms of math (as a former math tutor, I\u0027ve seen the effects of overly relying on calculators, its not pretty). Is it such a stretch that learning KSP would share some similarities?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it\u0027s not a stretch. \u0027Stretch\u0027 doesn\u0027t even \u003Cem\u003Ebegin\u003C/em\u003E to cover the mental gyrations needed to accept the premise you\u0027re defending. You\u0027re trying to extrapolate from the tiny number of people who will math tutors to... to I\u0027m not sure what you\u0027re extrapolating to. You\u0027ve leapt to the defense of math tutors but completely failed to anyhow make any logical connection to the thread at hand.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EYet you seem adamant that it is wrong to advise a new player to learn some basics in the stock game before playing around with the most powerful tool available in KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only things I\u0027m adamant against are the nonsense and lack of logic from those who oppose MJ, the insistence that there is something wrong or deficient with people who use it, and feeling among some that they can dictate how other people play. Your statement above is an example of the last.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIsn\u0027t \u0022failure is fun\u0022 one of the main attractions of learning KSP?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo some people, yes. But not to all. (Again, your logic fails because you extrapolate from the fraction to the whole.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENow I know you\u0027ll accuse me of \u0022dictating how people should play\u0022, so let me stop you right there. I\u0027m not asking that a new players puts in 200 hours of stock KSP before \u0022allowing\u0022 them to try mods or anything. I\u0027m just saying I would recommend that they play stock for a short time before diving into mods.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe mind boggles that someone can simultaneously say \u0022I\u0027m not dictating how people should play\u0022 and \u0022I recommend they play a certain way\u0022 without realizing the two statements are almost completely at odds with each other.\u003C/p\u003E\n"},{"CreatedByName":"SpaceGremlin","CreatedById":65961,"CreatedDateTime":"2014-02-20T00:02:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENo, it\u0027s not a stretch. \u0027Stretch\u0027 doesn\u0027t even begin to cover the mental gyrations needed to accept the premise you\u0027re defending. You\u0027re trying to extrapolate from the tiny number of people who will math tutors to... to I\u0027m not sure what you\u0027re extrapolating to. You\u0027ve leapt to the defense of math tutors but completely failed to anyhow make any logical connection to the thread at hand.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts called an analogy.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe only things I\u0027m adamant against are the nonsense and lack of logic from those who oppose MJ, the insistence that there is something wrong or deficient with people who use it, and feeling among some that they can dictate how other people play. Your statement above is an example of the last.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t oppose Mechjeb (I use and love it), except in this one extremely narrow case. You seem to be missing that point.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe mind boggles that someone can simultaneously say \u0022I\u0027m not dictating how people should play\u0022 and \u0022I recommend they play a certain way\u0022 without realizing the two statements are almost completely at odds with each other. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt boggles my mind that you think the words \u0022recommend\u0022 and \u0022dictate\u0022 are equivalent.\u003C/p\u003E\n"},{"CreatedByName":"AlteranEmpire","CreatedById":34035,"CreatedDateTime":"2014-02-20T00:45:40Z","Content":"\n\u003Cp\u003EI started on my own and then tried out mechjeb early (prior to docking I have no idea when, it was a while ago) and didn\u0027t care for it. Once docking came out I was horrid with rendezvous so when mechjeb had the autopilot, or at least I heard that it did, I began using it again for that. After I used mj as a crutch to learn how to do things I stopped using it for everything except the information displays. In my opinion it is a great learning tool but you can become too dependent on it.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-20T01:05:38Z","Content":"\n\u003Cp\u003EI find Mechjeb is useful for learning, or doing something that you\u0027ve done thousands of times before. I personally don\u0027t use it to rendezvous or dock (I find it wastes RCS), but I will launch to intercept, or use it to make Hohmann transfers, Or launch my rockets to a specific orbit for me, or land my landers. (And in the case of probes pretend that it\u0027s the probes programming doing it.)\u003C/p\u003E\u003Cp\u003EEDIT: That being said I can do all of these things on my own, it\u0027s just that MechJeb does it better. I don\u0027t advocate it\u0027s use to a new person because I believe that they should learn how to do these things the hard way (The same way I learned, by trial and error) before getting some kind of autopilot to do it for them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-20T01:07:49Z\u0022 title=\u002202/20/2014 01:07  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 20, 2014\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-02-20T02:32:49Z","Content":"\n\u003Cp\u003EMJ is useful for times when you can\u0027t control most of the mission\u0027s aspects directly. Thought it\u0027s not perfect. I started being wary of it\u0027s faults when the maneuver node planner put my satellite in colision route to Duna\u0027s surface, instead of orbiting it. Also, no one is willing to make it work with FAR, which makes me steer away from it.\u003C/p\u003E\n"},{"CreatedByName":"darkmuminek","CreatedById":79107,"CreatedDateTime":"2014-02-20T06:28:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E I don\u0027t advocate it\u0027s use to a new person because I believe that they should learn how to do these things the hard way (The same way I learned, by trial and error) before getting some kind of autopilot to do it for them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, most new players probably start stock and try doing everything by themselves but could we leave the decision whether to use MJ (or any other mod) or not to them? You believe they should learn the hard way. I believe they should do whatever they want. I really don\u0027t get you guys. KSP is just a game, it\u0027s meant to be fun, not a struggle (unless you find fun in struggle). It\u0027s not real life, there\u0027s no real challenge to it. Most people don\u0027t care you managed to build a space station using only stock parts or that you landed on Eve and returned without refuelling.\u003C/p\u003E\u003Cp\u003EPlaying this game is the same as watching a TV series. Some people will watch one episode a week, while others will spend entire day watching two seasons one after another.\u003C/p\u003E\u003Cp\u003EAs for making MechJeb stock there\u0027s actually one good reason for it: if SQUAD makes it possible to control missions from a command centre you\u0027d need at least some kind of an autopilot to do the job. I\u0027m not sure but I think I read somewhere that they want to implement this feautre in the game.\u003C/p\u003E\u003Cp\u003ENow to get back on the topic (is it a correct phrase?). MJ can be a good learning tool. I learned most things from youtube videos but it\u0027s more convenient to have this in-game. Proper placement of manouver nodes, Hohmann transfers, randezvous, inclination changes or proper launching (assuming you don\u0027t use FAR). Also it can be a great help for handicapped people. Not everyone can use their both hands or has a good hand-eye coordination.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-02-20T06:42:13Z","Content":"\n\u003Cp\u003Eokay, gonna chime in again here, and just say, that there are some things that are nearly impossible to do w/out mechjeb or are possible, but the difficulty is way up there. Just gonna leave a few pictures here, to illustrate something.\u003C/p\u003E\u003Cp\u003EI have launched this successfully. Twice. With MechJeb. Even WITH MechJeb, its something of a beast to fly.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uhP0Rto.png\u0022 alt=\u0022uhP0Rto.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TFWS703.png\u0022 alt=\u0022TFWS703.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI could NOT do this very easily before MechJeb taught me. Yes, I read tutorials and watched every video I could get my hands on, even Scott Manley\u0027s videos.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.com/a/img23/1070/7ogu.png\u0022 alt=\u00227ogu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ein short. MechJeb is a valued asset to this game. BUT, in the end, we each play this game in what ever way we feel is fun for us, and SQUAD has given us unprecedented access to do just that! I know of no other game \u0026lt;aside from minecraft i think, i dont play that, so, correct if wrong\u0026gt; that gives players not ONLY the choice to play how they want, but lets THEM play with the code to TAILOR THE GAME to how THEY want. So, let people play how they want, and be thankful we have the CHOICE to do so!!!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-20T07:41:58Z\u0022 title=\u002202/20/2014 07:41  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 20, 2014\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-02-20T13:08:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022 data-cite=\u0022AlamoVampire\u0022\u003E\u003Cdiv\u003Eokay, gonna chime in again here, and just say, that there are some things that are nearly impossible to do w/out mechjeb or are possible, but the difficulty is way up there. Just gonna leave a few pictures here, to illustrate something.\u003Cp\u003EI have launched this successfully. Twice. With MechJeb. Even WITH MechJeb, its something of a beast to fly.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/uhP0Rto.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/uhP0Rto.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/TFWS703.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/TFWS703.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI could NOT do this very easily before MechJeb taught me. Yes, I read tutorials and watched every video I could get my hands on, even Scott Manley\u0027s videos.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.com/a/img23/1070/7ogu.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imageshack.com/a/img23/1070/7ogu.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ein short. MechJeb is a valued asset to this game. BUT, in the end, we each play this game in what ever way we feel is fun for us, and SQUAD has given us unprecedented access to do just that! I know of no other game \u0026lt;aside from minecraft i think, i dont play that, so, correct if wrong\u0026gt; that gives players not ONLY the choice to play how they want, but lets THEM play with the code to TAILOR THE GAME to how THEY want. So, let people play how they want, and be thankful we have the CHOICE to do so!!!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but this sounds more like and excuse to give MJ a purpose, when you could had launched the first rocket as separate pieces and joined them into orbit.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-02-20T13:28:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MR4Y\u0022 data-cite=\u0022MR4Y\u0022\u003E\u003Cdiv\u003EYes, but this sounds more like an excuse to give MJ a purpose, when you could have launched the first rocket as separate pieces and joined them in orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo?\u003C/p\u003E\u003Cp\u003EYour suggestion sounds more like an excuse to remove the use of MJ when you could launch it in one go.\u003C/p\u003E\u003Cp\u003EWhat exactly is your point?\u003C/p\u003E\u003Cp\u003EIt\u0060s all about each player playing the way they like. There are some things only MJ can do, there are some things only a human controlled craft can do.\u003C/p\u003E\u003Cp\u003EIf using mods is \u0060cheating\u0060 until the point they become stock, at which point they are accepted (like subassembly loader or docking or crew manifest for example) then that sets up the premise that to \u0060not cheat\u0060 then your mod must pass the golden gate and become stock. Only at that point will the \u0060no mods\u0060 or \u0060no cheating\u0060 purists accept the feature.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI find it hilarious that the people who do not want MechJeb as stock are the ones driving the pressure for it to become stock because they call it cheating as a result of it not being part of the stock game.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou can see that is what you are doing, can\u0060t you?\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-02-20T15:25:40Z","Content":"\n\u003Cp\u003EThese MJ threads always feel like a religious \u0022discussion\u0022.\u003C/p\u003E\u003Cp\u003EForum rules anyone? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-02-20T17:31:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EThese MJ threads always feel like a religious \u0022discussion\u0022.\u003Cp\u003EForum rules anyone? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0060s probably because there is no \u0060right\u0060 solution for everyone, only a compromise, and similar to religion, some people are not willing to compromise. The best compromise solution that I can see is to give everyone the option of using MJ or not then everyone can decide as an individual whether they want to use that part or not but it seems some people want to exclude or restrict others from having that option which elicits a negative reaction. Others seem to want to retain some elite status by doing things in a particular way and restrict any options to make the game easier (for some people it makes the game possible), for example by having Dv or TWR readouts in the VAB or a more comprehensive range of readouts in flight.\u003C/p\u003E\u003Cp\u003EI have noticed the viewpoints of various sides seem to range from \u0060I play stock, mods are too ephemeral and your game experience is not guaranteed\u0060 to \u0060The game is no fun for me that way\u0060 to \u0060The information readouts are very useful\u0060 to \u0060Play how you want it does not matter, it\u0060s a tool in a sandbox game\u0060 to finally \u0060I could not play without it\u0060\u003C/p\u003E\u003Cp\u003ENone of these styles of play are wrong. The only wrong part come where someone tries to say that the way someone else plays is wrong or makes them a lesser pilot in some way. Any of the above viewpoints that has \u0022so you should not use X and it should not be an option for others\u0022 on the end of it will get a negative response. Similarly saying that using or not using a particular mod makes you a better or worse pilot will do the same.\u003C/p\u003E\u003Cp\u003EMyself I want as much information about my rocket as the people who actually make them would have. I want TWR (wet and empty on a stage by stage basis), Dv cumulative and per stage, burn times cumulative and per stage, and even projected capabilities for a land and return mission all in the VAB and readouts for every variable you could think of in flight but that\u0060s me and not everyone wants or needs that.\u003C/p\u003E\u003Cp\u003EI\u0060m happy for a lot of that to be as an addon but I\u0060d like to see a bit more info in the VAB and better node handling in the stock game (I believe we are getting some node improvements next update)\u003C/p\u003E\u003Cp\u003EAs regards the OP\u0060s question, I think that you can tell someone that age (12-15) what to do and it sort of goes in but not really. If you show them what to do and then say \u0060do something like that\u0060 they actually learn it. The best bit is they learn it with their particular craft.\u003C/p\u003E\u003Cp\u003EI forget where it is from but someone said \u0060I hear and I forget, I see and I remember, I do and I understand\u0060\u003C/p\u003E\u003Cp\u003ESo I would say MJ is a good tool to refer to, like a textbook, if you are stuck or want a copilot to do something you\u0060ve done loads already but like a textbook, you shouldn\u0060t just copy it, you have to interpret what it does and learn from it and like a copilot, they should not be doing *all* the flying because then they are the pilot...\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-02-20T19:27:57Z","Content":"\n\u003Cp\u003EI don\u0027t care for MJ for the primary reason it is a resource hog and the fact it does not work with FAR is another reason why steer clear of it. \u003C/p\u003E\u003Cp\u003EOtherwise it is a great utility for those who do not like to do things themselves or have repetitive actions they do not want to do.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-02-20T21:32:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003ESo?\u003Cp\u003EYour suggestion sounds more like an excuse to remove the use of MJ when you could launch it in one go.\u003C/p\u003E\u003Cp\u003EWhat exactly is your point?\u003C/p\u003E\u003Cp\u003EIt\u0060s all about each player playing the way they like. There are some things only MJ can do, there are some things only a human controlled craft can do.\u003C/p\u003E\u003Cp\u003EIf using mods is \u0060cheating\u0060 until the point they become stock, at which point they are accepted (like subassembly loader or docking or crew manifest for example) then that sets up the premise that to \u0060not cheat\u0060 then your mod must pass the golden gate and become stock. Only at that point will the \u0060no mods\u0060 or \u0060no cheating\u0060 purists accept the feature.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI find it hilarious that the people who do not want MechJeb as stock are the ones driving the pressure for it to become stock because they call it cheating as a result of it not being part of the stock game.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou can see that is what you are doing, can\u0060t you?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst off, where you got the fallacious assumption that I am a stock purist?\u003C/p\u003E\u003Cp\u003EAlso, every single KSP player have used at least one mod at least once, which makes stock purists hypocrites.\u003C/p\u003E\u003Cp\u003EAnd yes, making overly complex vehicles that are unstable to pilot and maneuver and stating that only MJ can pilot them, hence it is an improvement is an excuse to give MJ a function.\u003C/p\u003E\u003Cp\u003ETake your assumptions somewhere else.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-02-21T00:43:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MR4Y\u0022 data-cite=\u0022MR4Y\u0022\u003E\u003Cdiv\u003EYes, but this sounds more like and excuse to give MJ a purpose, when you could had launched the first rocket as separate pieces and joined them into orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is basically dictating how he should pay the game. I\u0027m sure that anyone with enough skill could launch it into orbit. Also you called it an excuse. Wouldn\u0027t reason be a better word for it? And a question how does he or anyone else play affect you in anyway shape or form.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-02-21T01:04:02Z","Content":"\n\u003Cp\u003EBut anyway I do think that it is a good educational tool as it can show you what to do in real time.\u003C/p\u003E\n"},{"CreatedByName":"1of6Billion","CreatedById":46191,"CreatedDateTime":"2014-02-21T08:11:22Z","Content":"\n\u003Cp\u003EMJ is the *ONLY* reason I\u0027m still playing KSP today.\u003C/p\u003E\u003Cp\u003EWhen I found out about KSP, I downloaded the Demo (0.13.3) and played around with it for a while. I had to buy the full version to be able to install mods. I did. Just to be able to use that nifty autopilot. I watched and learned, watched and learned. These days, I fly OK without it at the beginning of the tech tree or sometimes when I feel like it. Otherwise I always use it.\u003C/p\u003E\n"},{"CreatedByName":"MR4Y","CreatedById":66897,"CreatedDateTime":"2014-02-21T15:21:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dodgey\u0022 data-cite=\u0022Dodgey\u0022\u003E\u003Cdiv\u003EAnd a question how does he or anyone else play affect you in anyway shape or form.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t. But this is a discussion thread. Would be useless if everyone had the same opinion.\u003C/p\u003E\n"},{"CreatedByName":"Rowsdower","CreatedById":91811,"CreatedDateTime":"2014-02-21T18:40:55Z","Content":"\n\u003Cp\u003ETake some deep breaths, everyone.\u003C/p\u003E\u003Cp\u003EBreathe in - hold it, hold it, hold it - and out.\u003C/p\u003E\u003Cp\u003EFeel any better?\u003C/p\u003E\u003Cp\u003ERight now there are no plans to make MJ stock, so let\u0027s sweep that one under the rug. Just remember that there is no \u0022wrong\u0022 or \u0022right\u0022 way to play KSP. The experience that someone has by choosing to use MJ or any mod for that matter, is up to each individual.\u003C/p\u003E\n"},{"CreatedByName":"Dwight_js","CreatedById":83255,"CreatedDateTime":"2014-02-21T20:39:05Z","Content":"\n\u003Cp\u003EI think MJ is great. I didn\u0027t use it to learn the basics - I got my foundation in orbital mechanics playing Orbiter years ago. But in Orbiter I didn\u0027t learn by trial and error, I installed MFDs that were purpose built to help with launching, rendezvous, transfers, aerobraking, etc. Once I saw the kinds of maneuvers calculated by the MFDs I began to learn how things worked. If I didn\u0027t have that previous experience, I probably would have learned by watching what MechJeb does.\u003C/p\u003E\u003Cp\u003EWhat I wonder about is whether a stock autopilot will interfere with the developer\u0027s vision for training Kerbal pilots to fly the ships. Given the choice, would anyone chose a Kerbal over MJ?\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-02-21T22:39:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MR4Y\u0022 data-cite=\u0022MR4Y\u0022\u003E\u003Cdiv\u003EYes, but this sounds more like and excuse to give MJ a purpose, when you could had launched the first rocket as separate pieces and joined them into orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, let me be clear.\u003C/p\u003E\u003Cp\u003E1. I work a little like Whackjob in that I enjoy designing big beautiful things.\u003C/p\u003E\u003Cp\u003E2. I also like to build my stations as whole things in the VAB then break them down into chunks, but this time, I made it a mission to see if I could lift nearly 1500 tons off the pad and into orbit. This made it fun.\u003C/p\u003E\u003Cp\u003E3. I find that MJ helps me fly larger more realistic missions thanks to its varied functions, not the least of which is its AUTOPILOT.\u003C/p\u003E\u003Cp\u003E4. If having more data available to me on my vessel helps me fine tune (yes other mods can do this with out AP but) AND give me the ability to automate long or dull or highly repeated actions with out more added to my ship by use of 1 mod that gives me both aspects so much the better.\u003C/p\u003E\u003Cp\u003E5. Cant stress this enough: MechJeb taught me better and more effectively than tutorials and vids could have because it did so with MY ships.\u003C/p\u003E\u003Cp\u003ESo there ya go\u003C/p\u003E\n"},{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-02-22T01:09:23Z","Content":"\n\u003Cp\u003EI honestly think you should try to get to Duna and back without MJ once. This way you\u0027ll actually learn how the game works. MJ is like any computer, it breaks down;and when it does, you will get screwed if you dont have the training/patience/knowledge of moving your spacecraft manually....\u003C/p\u003E\n"}]}