{"TopicId":63086,"ForumId":20,"TopicTitle":"How do you KSP?","CreatedByName":"Genolution","CreatedById":54840,"CreatedDateTime":"2014-02-13T15:34:44Z","PageNum":1,"Articles":[{"CreatedByName":"Genolution","CreatedById":54840,"CreatedDateTime":"2014-02-13T15:34:44Z","Content":"\n\u003Cp\u003EWhat mods do you use and why? Tell us what mods have been game making and game breaking for you.\u003C/p\u003E\u003Cp\u003EI\u0027m starting a new KSP build and have selected the following (RAM dependent of coarse)\u003C/p\u003E\u003Cp\u003EFAR\u003C/p\u003E\u003Cp\u003EDeadly reentry\u003C/p\u003E\u003Cp\u003EKerbal alarm clock\u003C/p\u003E\u003Cp\u003EProcedural fairings\u003C/p\u003E\u003Cp\u003EProcedural wings (if FAR compatible)\u003C/p\u003E\u003Cp\u003EVisual enhancements\u003C/p\u003E\u003Cp\u003EMemory reduction\u003C/p\u003E\u003Cp\u003EChatterer\u003C/p\u003E\u003Cp\u003EKerbal attachment system\u003C/p\u003E\u003Cp\u003EKerbal joint reinforcement\u003C/p\u003E\u003Cp\u003ESome kind of shuttle pack\u003C/p\u003E\u003Cp\u003ESome kind of station pack\u003C/p\u003E\u003Cp\u003ESome kind of life support mod\u003C/p\u003E\u003Cp\u003EFTMN atomic rockets\u003C/p\u003E\u003Cp\u003EKerbal engineer redux\u003C/p\u003E\u003Cp\u003ETexture replacer\u003C/p\u003E\u003Cp\u003EI plan on spending a lot of time building stations and such since work has left only enough time for short missions. So how do you KSP?\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-13T22:52:59Z","Content":"\n\u003Cp\u003EConsidering I am running at a minimum 54 different mods I\u0027m not going to list them all (I just counted the different folders in my Game Data minus the Squad folder, I might not actually be running 54, but it\u0027s more than 40) I build to have fun, and push the limits.\u003C/p\u003E\n"},{"CreatedByName":"ThomsenX","CreatedById":103318,"CreatedDateTime":"2014-02-15T11:54:40Z","Content":"\n\u003Cp\u003EI run \u003Cem\u003Ea lot\u003C/em\u003E of mods, about as many as 32-bit Unity lets me, but the main ones are AIES Aerospace, Active Memory Reduction, BOSS (3xSS makes for good wallpapers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E), Visual Enhancements (no city lights), Editor Extensions, EnhancedNavBall, FASA, KerbalJointReinforcement, KSPX, KW Rocketry, asmi\u0027s EC Life Support System, MechJeb, NavyFish\u0027s Docking Port Alignment HUD, RCS Sounds (so I can hear what I\u0027m doing), udk_lethal_d0se\u0027s 2.5 meter station parts, RealChute, SelectRoot, TextureReplacer and TweakableEverything.\u003C/p\u003E\u003Cp\u003ECareer mode hasn\u0027t hit home with me, since all the mods I like and use seem to skew my progress somewhat, but when I eventually dive into it, I\u0027ll probably add Deadly Reentry to my list. \u003C/p\u003E\u003Cp\u003EI spend most of my KSP time building and serving stations, and the mods above make for a good, solid orbital platform \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E I\u0027m a sandbox-kind-of-guy, but even though KSP lets me build madman contraptions and put them in orbit, I prefer to keep it clean and simple, and spend lots and lots of time designing and assembling awesome orbital labs etc. That\u0027s how I KSP \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}