{"TopicId":64553,"ForumId":20,"TopicTitle":"Community Mod Repository and The Majiir Challenge","CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-02-28T22:51:30Z","PageNum":1,"Articles":[{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-02-28T22:51:30Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ECommunity Mod Repository\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe goal of this project is to \u003Cstrong\u003Ereplace Kerbal Spaceport with a community-built, community-run alternative\u003C/strong\u003E. Spaceport is in disrepair, and both it and its planned successor are effectively abandoned. By producing our own repository, we can ensure that it serves our interests as the producers and consumers of mod content.\u003C/p\u003E\u003Cp\u003EThere\u0027s been some discussion (e.g. in \u003Ca href=\u0022http://webchat.esper.net/?channels=kspmodders\u0022 rel=\u0022external nofollow\u0022\u003E#kspmodders\u003C/a\u003E) on what a replacement should look like. I hope this thread will both consolidate those scattered discussions and attract more of the community at large.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThe Majiir Challenge\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOne of the greatest obstacles to this project is the cost of server infrastructure. Weighing in at just 15MB, Kethane alone generated 650 gigabytes in download traffic in January. A popular mod repository would easily overwhelm any free or inexpensive hosting plans.\u003C/p\u003E\u003Cp\u003ETo eliminate that obstacle, \u003Cstrong\u003EI am offering free hosting for a community mod repository\u003C/strong\u003E. My own server infrastructure is highly underutilized, and some back-of-the-envelope calculations indicate it\u0027s more than enough to handle this project. Specifically, I can provide virtual private servers on a baremetal hypervisor that I manage. This means I can support any needed server software and configuration so long as it doesn\u0027t incur additional licensing costs. (That means Linux, please.) The server is located in a Tier III datacenter (that\u0027s good), and it has a gigabit Internet link with plenty of bandwidth. I can also provide SSL certificates and (probably) domain names. In other words, I can take care of anything that really costs money.\u003C/p\u003E\u003Cp\u003ESince we may see multiple projects in the works, I\u0027m willing to provide service for any promising candidates until a clear winner emerges. Note that I have a preference for scalability, so a lightweight server will be more likely to win the challenge than a Wordpress reskin. (Super bonus points for using Node.)\u003C/p\u003E\u003Cp\u003EThere are no hard-and-fast rules at this point. My goal is to encourage development by removing the cost concern.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EMy Two Bits\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAs a mod developer, these are some things I\u0027d like to see that would convince me to host Kethane on a repository:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDetailed download statistics with an option to export raw data. This is my biggest sticking point.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEffective search system. I don\u0027t care if it picks up every keyword, but if someone searches for Kethane, my mod ought to come up first.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENo moderation queue. At the very least, there should be some way to graduate out of moderation.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPrevious version support. I like to keep previous versions available for reference purposes, and some users like to hold off on updating.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBut above all, I suggest to \u003Cstrong\u003Estart simple\u003C/strong\u003E. There\u0027s no point in getting wrapped up in a complicated categorization system before producing a first version. Let\u0027s talk core features, technologies and objectives.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-03T02:47:31Z\u0022 title=\u002204/03/2014 02:47  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 3, 2014\u003C/time\u003E by Majiir\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-02-28T23:01:29Z","Content":"\n\u003Cp\u003EThis is what I would like to see per mod. Some of these would be optional, of course.\u003C/p\u003E\u003Cp\u003E- Screenshots.\u003C/p\u003E\u003Cp\u003E- Videos.\u003C/p\u003E\u003Cp\u003E- Changelog.\u003C/p\u003E\u003Cp\u003E- License.\u003C/p\u003E\u003Cp\u003E- Link to source code repository.\u003C/p\u003E\u003Cp\u003E- Donate button (linking to where mod author decides.)\u003C/p\u003E\u003Cp\u003E- Forum thread link.\u003C/p\u003E\u003Cp\u003E- No commenting (use the forums!)\u003C/p\u003E\u003Cp\u003E- Do we ever need rating?\u003C/p\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-02-28T23:11:52Z","Content":"\n\u003Cp\u003EI\u0027ll chime in and agree with what Blizzy has suggested for each mod, especially the no commenting bit. Creating another place for support requests to appear is a pain, since for FAR I already need to check the FAR release thread, the Addon Support forum and r/KSP and r/KerbalAcademy, and then the Spaceport comment section if I remember (normally I don\u0027t, and normally comments don\u0027t appear there). Having the option to comment there will just frustrate everyone (users don\u0027t get timely support, modders have another place to look).\u003C/p\u003E\n"},{"CreatedByName":"rbray89","CreatedById":48847,"CreatedDateTime":"2014-02-28T23:34:52Z","Content":"\n\u003Cp\u003EOne thing I wouldn\u0027t mind having is an easy way to manage source releases (from a modder perspective). Ie. I push to github, and hit generate release on the spaceport and it builds and packages it. I have sooo many projects on my plate ATM. One more can\u0027t hurt right? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2014-02-28T23:45:19Z","Content":"\n\u003Cp\u003ERating is actually a really valuable thing if harnessed correctly.\u003C/p\u003E\u003Cp\u003EThe biggest thing in my eyes is that we need a Crowd Sourced Content Moderation system, similar to how Reddit works. Users are given a quick system to convey how they feel about a listing and flag things that they feel are inappropriate. Ratings, views vs downloads, and how recently a mod was posted impact listing order after relevancy, so if you search for Kethane, Kethane is first, but if you search for Rockets, the listings will be ordered based on community response, with newer mods being preferred. A sufficient quantity of flags in a given period relative to the total number of views may cause a listing to be hidden, but all flags will be brought to the attention of a small number of official moderators to be handled.\u003C/p\u003E\u003Cp\u003EIdeally the users should not be forced to have an account, but users logged into accounts could be treated as more valuable for weighting their opinions; and there could be a system where users define an instance of KSP, what version they\u0027re using with it; and what mods they\u0027re using with it; and the system will alert them when updates for those mods are posted. There could even be a system of sharing builds that provides an easy method of getting all of them.\u003C/p\u003E\u003Cp\u003ESecond to that, there should be a strong versioning awareness to the system that doesn\u0027t force developers into one scheme for their own versioning. Mainly it needs to be aware that this version of MechJeb is newer than that version. Side to that, the version of X mod needs to have it\u0027s own compatibility list that users are able to contradict; so say UbioZur\u0027s Welding mod \u0027supposed\u0027 works for 0.23, but last I used it it crashed everything constantly, I could go to the listing, look at that version, and click a thumbs down next to the Version Y Works With: KSP 0.23 item, and these results would be conveyed back to the users for them to make their own decision about it. Similarly I could thumbs up that it does work with 0.23 to give relevancy to the thumbs down count; and I could thumbs up version matches that maybe aren\u0027t addressed or supposedly don\u0027t work. In combination with the Voluntary Version Locking movement, mod makers should be able to specify that their mod will refuse to work with certain versions of KSP.\u003C/p\u003E\u003Cp\u003EAlso mandatory license selection for all submitted addons, with a list of common licenses selectable via a randomized order checkbox list, a license helper link; and the ability to upload a license file; No means that could result in a listing that does not contain a license.\u003C/p\u003E\u003Cp\u003EFinally, as a feature to the modders, offsite hosting. Even if the new ~port is good, some people may still want to host the files themselves or exploint GitHub\u0027s release system; the ability for a listing to have a link instead of an uploaded file would just be nice.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-02-28T23:46:35Z","Content":"\n\u003Cp\u003EAs a(n extremely light) modder, I\u0027d like the ability to host my own stuff yet still have an entry on the modding site.\u003C/p\u003E\u003Cp\u003EAs a player, I\u0027d like a way to be notified (email, for example) when a mod I\u0027m using is updated, if I\u0027ve so chosen to be notified.\u003C/p\u003E\n"},{"CreatedByName":"rbray89","CreatedById":48847,"CreatedDateTime":"2014-02-28T23:56:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs a player, I\u0027d like a way to be notified (email, for example) when a mod I\u0027m using is updated, if I\u0027ve so chosen to be notified.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOooh... I like that.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-03-01T00:07:46Z","Content":"\n\u003Cp\u003EGood idea, in order to reduce hosting cost to its bare minimum, a torrent tracker might be the best, torrent can even be rated by the bittorrent client, community will be invited to contribute by seeding and whatever happen to the main server, sharing can still be up.\u003C/p\u003E\u003Cp\u003EIn addition to that, as Greys wrote, versionning should be mandatory \u002B I add: DOCUMENTATION inside/with the files.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-03-01T00:14:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003EGood idea, in order to reduce hosting cost to its bare minimum, a torrent tracker might be the best, torrent can even be rated by the bittorrent client, community will be invited to contribute by seeding and whatever happen to the main server, sharing can still be up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat idea! I\u0027d personally torrent everything I use and leave them up all the time.\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2014-03-01T00:20:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003EGood idea, in order to reduce hosting cost to its bare minimum, a torrent tracker might be the best\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMajiir has 100TB monthly transfer to offer, and most mods don\u0027t compete with the popularity of Kethane, reducing the hosting cost isn\u0027t really necessary and involving a torrent client adds a barrier for entry that a significant number of users won\u0027t bother with. Not a bad idea but in this situation I don\u0027t think it\u0027d be advantageous in this situation. Maybe as a secondary offering.\u003C/p\u003E\u003Cp\u003EThe big problem with torrents in this situation is that as mod makers we want to limit the recirculating of outdated versions, so there would need to be a way to kill the torrent swarm when that version is replaced; given that most torrent clients these days are designed to keep a torrent running even once the tracker has been cut off this may be impossible.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2014-03-01T00:58:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003EGood idea, in order to reduce hosting cost to its bare minimum, a torrent tracker might be the best, torrent can even be rated by the bittorrent client, community will be invited to contribute by seeding and whatever happen to the main server, sharing can still be up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs a user, no thank you. If I need additional software or plugins/add-ons to download mods, it\u0027ll likely be a no-go. KISS.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-03-01T01:10:50Z","Content":"\n\u003Cp\u003ESame here, I\u0027d just want to download it using my browser I\u0027m already browsing the site with.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-03-01T03:06:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003E- Screenshots.\u003Cp\u003E- Videos.\u003C/p\u003E\u003Cp\u003E- Changelog.\u003C/p\u003E\u003Cp\u003E- License.\u003C/p\u003E\u003Cp\u003E- Link to source code repository.\u003C/p\u003E\u003Cp\u003E- Donate button (linking to where mod author decides.)\u003C/p\u003E\u003Cp\u003E- Forum thread link.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the spirit of simplicity, I\u0027ll distill this down to one feature: rich description field. A simple text formatter like Markdown can be extended to support video embeds.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003E- No commenting (use the forums!)\u003Cp\u003E- Do we ever need rating?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree that commenting is a bad idea. I also think traditional rating systems are a bad idea, although I\u0027ll address this in more detail in response to Greys.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rbray89\u0022 data-cite=\u0022rbray89\u0022\u003E\u003Cdiv\u003EOne thing I wouldn\u0027t mind having is an easy way to manage source releases (from a modder perspective). Ie. I push to github, and hit generate release on the spaceport and it builds and packages it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAutomated build is a huge feature, but something that\u0027s very easy and allows for the same end result is a simple submission API. If the site is well-built, this wouldn\u0027t even need to be a separate feature. This way, you can use an automated build system like Jenkins and have your built script automatically upload releases.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003EThe biggest thing in my eyes is that we need a Crowd Sourced Content Moderation system, similar to how Reddit works.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I agree with this at a fundamental level, but what you\u0027ve described is getting very complex, especially when you talk about logins, versions, flags, moderators, et cetera. A system that brings more responsibility to mind than Reddit is StackOverflow, but that works because reputation is earned as a sort of currency, and that must be spent in order to vote down. Another alternative is a \u0022star\u0022 system, which is essentially upvote-only (and can seem less like a voting system if it\u0027s used to give users a \u0022favorites\u0022 list). Crowd rating systems are hard to get right (even Reddit is still refining its algorithms) so I\u0027m not sure this is a core feature.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003ESecond to that, there should be a strong versioning awareness to the system that doesn\u0027t force developers into one scheme for their own versioning. Mainly it needs to be aware that this version of MechJeb is newer than that version.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are a number of ways to do that, but it can get complicated if you try to be too automatic. If the system is to support multiple versions of a mod, is it not enough to have a \u0022latest\u0022 (or \u0022default\u0022) and then a chronological listing of all other versions? The fanciest you have to get is allowing the mod author to manually reorder the listing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003ESide to that, the version of X mod needs to have it\u0027s own compatibility list that users are able to contradict; so say UbioZur\u0027s Welding mod \u0027supposed\u0027 works for 0.23, but last I used it it crashed everything constantly, I could go to the listing, look at that version, and click a thumbs down next to the Version Y Works With: KSP 0.23 item, and these results would be conveyed back to the users for them to make their own decision about it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is getting way too complex. It seems simple on the surface, but when you consider all the API endpoints, database routines and front-end scripts that would go into it, this becomes a huge feature item. It\u0027s not worth it. Either the mod will have been updated after the latest KSP release or it won\u0027t. If someone wants detailed compatibility information, they can go to a linked forum thread.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003EIn combination with the Voluntary Version Locking movement, mod makers should be able to specify that their mod will refuse to work with certain versions of KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure... in the general-purpose description field. \u003Ca href=\u0022https://en.wikipedia.org/wiki/KISS_principle\u0022 rel=\u0022external nofollow\u0022\u003EKISS\u003C/a\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003EAlso mandatory license selection for all submitted addons, with a list of common licenses selectable via a randomized order checkbox list, a license helper link; and the ability to upload a license file; No means that could result in a listing that does not contain a license.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is making my head spin. \u003Ca href=\u0022https://en.wikipedia.org/wiki/KISS_principle\u0022 rel=\u0022external nofollow\u0022\u003EKISS\u003C/a\u003E again. That\u0027s a whole lot of work for a problem that isn\u0027t fully articulated. This won\u0027t be operated by Squad, so it doesn\u0027t need to conform to Squad\u0027s community rules. I personally disagree with making license selection mandatory; so long as a sensible default policy is clearly communicated, the worst case is that mods are licensed more restrictively than intended (and this can always be amended).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003EFinally, as a feature to the modders, offsite hosting. Even if the new ~port is good, some people may still want to host the files themselves or exploint GitHub\u0027s release system; the ability for a listing to have a link instead of an uploaded file would just be nice.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EAs a(n extremely light) modder, I\u0027d like the ability to host my own stuff yet still have an entry on the modding site.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve said this about Spaceport, but the reason is because Spaceport doesn\u0027t have good analytics, and as an author I want to be able to track downloads. Off-site download is not completely unreasonable, but it does introduce complexity, so I\u0027d be interested in justifications. There are advantages to requiring that files be hosted. (If a link is broken or leads to a slow download server, that could irritate users while reflecting poorly on the mod repository.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EAs a player, I\u0027d like a way to be notified (email, for example) when a mod I\u0027m using is updated, if I\u0027ve so chosen to be notified.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like this idea. I don\u0027t think it\u0027s a core feature, but it\u0027s a good second-round addition. It could go very nicely with a \u0022star\u0022 system since users would be disinclined to star mods they don\u0027t care to keep easy track of.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003EGood idea, in order to reduce hosting cost to its bare minimum, a torrent tracker might be the best, torrent can even be rated by the bittorrent client, community will be invited to contribute by seeding and whatever happen to the main server, sharing can still be up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs others have mentioned, this is both detrimental to users and simply unnecessary. (Seriously, I have plenty of bandwidth. I host one of the most popular KSP mods, and my monthly bandwidth readout always rounds down to 0% utilization.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003EIn addition to that, as Greys wrote, versionning should be mandatory \u002B I add: DOCUMENTATION inside/with the files.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDocumentation is just something that quality mods do. You can\u0027t force quality.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-03-01T04:33:18Z","Content":"\n\u003Cp\u003EVery interesting stuff, here, Majir. I\u0027ll distill as well to those things I have some opinion on, which is amusingly one thing:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EOne feature: rich description field. A simple text formatter like Markdown can be extended to support video embeds.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne problem with a single description field for everything is that every mod will look different on their own page. The site will look disjointed and will confuse users. I feel the site should enforce SOME rules lest people (users, not modders) don\u0027t bother using it because it\u0027s ugly most of the time.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EI like this idea. I don\u0027t think it\u0027s a core feature, but it\u0027s a good second-round addition. It could go very nicely with a \u0022star\u0022 system since users would be disinclined to star mods they don\u0027t care to keep easy track of.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see a problem with that: If I get updates for everything I give a star rating to, I\u0027d never give something a low star rating. Unless by \u0022star\u0022 system you mean \u0022thumbs up\u0022 in which case I\u0027m all for that. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EDocumentation is just something that quality mods do. You can\u0027t force quality.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...but you can force standards, and if a mod can\u0027t bother to conform to (reasonable) standards it\u0027s probably not worth my time as a user.\u003C/p\u003E\u003Cp\u003EDon\u0027t let me make you think I\u0027m down-talking the idea. This is just discussing the particulars \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-01T04:47:47Z","Content":"\n\u003Cp\u003EI was about to say I\u0027d give this a go (I\u0027m a web dev by trade and we have an open-source MongoDB framework that would work perfectly for this) but then I remembered that I have a hard enough time working on my own mod after eight hours of programming.\u003C/p\u003E\u003Cp\u003EThis all sounds like a fantastic idea, though, and thanks for putting forward your resources, Majiir. Your \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71133-Community-Mod-Repository-and-The-Majiir-Challenge?p=996740\u0026amp;viewfull=1#post996740\u0022 rel=\u0022external nofollow\u0022\u003Epost here\u003C/a\u003E echos my thoughts on most of the meat of this discussion. I agree, keep it simple.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-03-01T05:04:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EI see a problem with that: If I get updates for everything I give a star rating to, I\u0027d never give something a low star rating. Unless by \u0022star\u0022 system you mean \u0022thumbs up\u0022 in which case I\u0027m all for that. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s what I mean. Think of Github\u0027s star system, or a browser\u0027s favorites list. Github displays a count of how many users have starred a repository, and each user can view his list of stars. It\u0027s a loose way of gauging popularity, and it tends to work as long as the action of starring also does something like adding the item to a quick reference list. (This way users don\u0027t just star everything they see.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EOne problem with a single description field for everything is that every mod will look different on their own page. The site will look disjointed and will confuse users. I feel the site should enforce SOME rules lest people (users, not modders) don\u0027t bother using it because it\u0027s ugly most of the time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003E...but you can force standards, and if a mod can\u0027t bother to conform to (reasonable) standards it\u0027s probably not worth my time as a user.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI mentioned to Greys in #kspmodders that NPM is a great example of a simplistic repository: \u003Ca href=\u0022https://www.npmjs.org/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.npmjs.org/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENPM serves a very different purpose, but it does a good job at providing a consistent and informative experience without much complexity. I agree that it\u0027s possible to be \u003Cem\u003Etoo\u003C/em\u003E open-ended, but I also think it\u0027s important to carefully justify each additional piece of information that\u0027s made into a first-class feature. For KSP mods, it might be important to display author, version and release date, but a donate button might be too esoteric. These are issues to sift out keeping in mind that complexity can always be added later.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI was about to say I\u0027d give this a go (I\u0027m a web dev by trade and we have an open-source MongoDB framework that would work perfectly for this) but then I remembered that I have a hard enough time working on my own mod after eight hours of programming.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is why I created this thread instead of working on code. I\u0027d really like to see this happen, and while I think I have the skills to get the job done, I don\u0027t think I can make the time commitment. Plus, a lot of the feedback so far deviates from what I expected, so that\u0027s valuable knowledge.\u003C/p\u003E\u003Cp\u003EMongoDB is certainly a good candidate technology for a site like this. Of course, that final determination will require more details on what exactly the site will do.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-01T05:15:58Z\u0022 title=\u002203/01/2014 05:15  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 1, 2014\u003C/time\u003E by Majiir\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-03-01T05:53:06Z","Content":"\n\u003Cp\u003EVery generous of you, Majiir - all of this sounds neat!\u003C/p\u003E\u003Cp\u003E I have a fair amount of experience working in PHP / MySQL for web-based stuff similar to this, so if you guys need such expertise, let me know how I can help.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-03-01T05:57:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EEither the mod will have been updated after the latest KSP release or it won\u0027t. If someone wants detailed compatibility information, they can go to a linked forum thread.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt might be a good idea to have some kind of designated version indicator, not just the [version] text that some people add to the name of their mod.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs others have mentioned, this is both detrimental to users and simply unnecessary. (Seriously, I have plenty of bandwidth. I host one of the most popular KSP mods, and my monthly bandwidth readout always rounds down to 0% utilization.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe one, and really only, thing that spaceport does well is that big red download button. There is no other software required, and no pop-up ridden download host to deal with. Having that simplicity in actually getting the files is a huge benefit.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2014-03-01T08:47:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003EThe one, and really only, thing that spaceport does well is that big red download button. There is no other software required, and no pop-up ridden download host to deal with. Having that simplicity in actually getting the files is a huge benefit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, \u002B1, \u0022Like\u0022, Thumbs Up, and assorted other noises indicating support and deep admiration.\u003C/p\u003E\u003Cp\u003EThe one thing the site must do well is make the download button obvious, consistent, and above-the-fold.\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2014-03-01T09:17:51Z","Content":"\n\u003Cp\u003EAllowing listings without download links that just refer to some external location (forum thread or even spaceport) might be a good idea as well, especially for the transition phase.\u003C/p\u003E\u003Cp\u003EBeing comprehensive is very important for users accepting such a database and sth like that might make it easier for mod creators or even allows entries to be created initially by someone else.\u003C/p\u003E\u003Cp\u003EI\u0027m also a little worried about the competition between multiple such projects. As mentioned, having a comprehensive listing is very important for such a project and both users and mod developers tend to be lazy. That means who ever launches first to get a head start will most likely win, regardless of its usability features (competing against spaceport with lots of modders behind you is one thing, but but an open competition sth else). Unless ofc there would be some rule that forces them to share content between each other...\u003C/p\u003E\n"},{"CreatedByName":"Rich","CreatedById":17874,"CreatedDateTime":"2014-03-01T10:13:56Z","Content":"\n\u003Cp\u003EI propose that we use an open source GitHub clone, such as \u003Ca href=\u0022http://gitlab.org/\u0022 rel=\u0022external nofollow\u0022\u003EGitLab\u003C/a\u003E, as a starting point. I suggest this based on my experiences using GitHub itself to develop and distribute my small contributions to the KSP community.\u003C/p\u003E\u003Cp\u003ETo demonstrate the partial viability of using a git backed system, I will address the OP\u0027s \u0022Two bits\u0022 in terms of how GitHub fulfils these requirements (coupled with the vision to specialise and extend GitLab to support similar features).\u003C/p\u003E\u003Cp\u003E1) Analytics - GitHub provides some analytics, but not nearly enough. However, I suspect these extra analytics could be added to GitLab. \u003C/p\u003E\u003Cp\u003E2) Searching - The clone I am using as an example includes a search function. Is it any good? I have no idea, but again I am sure as a community we could improved it if needed.\u003C/p\u003E\u003Cp\u003E3) Moderation - I feel a solution to this is independent of the platform developed.\u003C/p\u003E\u003Cp\u003E4) Versioning - \u003Ca href=\u0022https://github.com/richardbunt/Telemachus/releases\u0022 rel=\u0022external nofollow\u0022\u003EGitHub releases\u003C/a\u003E is amazing.\u003C/p\u003E\u003Cp\u003EPotential issues that I see:\u003C/p\u003E\u003Cp\u003E* The scalability of GitLab.\u003C/p\u003E\u003Cp\u003E* Git is not suitable for every project, but coupled with a GitHub releases style system this would not be a problem.\u003C/p\u003E\u003Cp\u003E* Everyone is not familiar with such rich project tools? Well, there would need to be some serious UI specialisation to make it suitable for a modding community.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-01T12:32:57Z\u0022 title=\u002203/01/2014 12:32  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 1, 2014\u003C/time\u003E by Rich\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2014-03-01T11:51:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rich\u0022 data-cite=\u0022Rich\u0022\u003E\u003Cdiv\u003EI propose that we use an open source GitHub clone, such as \u003Ca href=\u0022http://gitlab.org/\u0022 rel=\u0022external nofollow\u0022\u003EGitLab\u003C/a\u003E, as a starting point. I suggest this based on my experiences using GitHub itself to develop and distribute my small \u003Cp\u003E2) Searching - The clone I am using as an example includes a search function. Is it any good? I have no idea, but again I am sure as a community we could improved it if needed.\u003C/p\u003E\u003Cp\u003E3) Moderation - I feel a solution to this is independent of the platform developed.\u003C/p\u003E\u003Cp\u003E4) Versioning - \u003Ca href=\u0022https://github.com/richardbunt/Telemachus/releases\u0022 rel=\u0022external nofollow\u0022\u003EGitHub releases\u003C/a\u003E is amazing.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust a few thoughts off the top of my head...\u003C/p\u003E\u003Cp\u003ESearching... If there is one thing I absolutely HATE about both Spaceport and the KSP forums is the really crappy search engine. Trying to find a specific mod is hard enough without it sorting the results incorrectly and getting wierd stuff mixed in that has nothing to do with what you searched for. And what REALLY drives me silly is four letter minimum search query when we have a LOT of three letter mods (kOS for example) that you cannot search for. Want to search for SAS mods... HAHAHAHAH... dammit! \u003C/p\u003E\u003Cp\u003EModeration - Someone is going to need to weed out the trash/spam etc AND help make the mods go in the right subsections. Who is going to spend a LOT of time moderating the stuff (which is what has caused Spaceport to fail so dismally). It\u0027s something to think about.\u003C/p\u003E\u003Cp\u003EVersioning - Here\u0027s an idea... I think we need to see one main thing shown next to the download button \u0022[This mod is compatible up to V0.23]\u0022 so we know we are downloading a good version. The problem comes when a mod gets abandoned but is so good that it keeps working for a while afterwards... Maybe change it to \u0022Confirmed working with V0.23\u0022. Also what to do with versions that are no longer working with the current version of KSP but still works fine in older versions? Some people may play older versions just because of their specific mod.\u003C/p\u003E\u003Cp\u003EI also want to say thanks to Majiir for offering his server infrastructure.... I\u0027m a big mod user and regularly have problems finding stuff that I am after. Having a mod base that will finally be organised will be a HUGE help. \u002B10000000 rep.\u003C/p\u003E\n"},{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2014-03-01T15:14:56Z","Content":"\n\u003Cp\u003EAfter reading this thread I have a few requests and points ( and please bear with me, I\u0027m on my phone) to make.\u003C/p\u003E\u003Cp\u003E1. As a frame of reference I liked the direction Spaceport was headed in terms of how they wanted to organize mods by what they had; command and control, science, utility, etc. The problem was that most mods that have parts, cover most of the spectrum of part classifications. This, coupled with the obscene amount of craft files, poorly organized or documented secondary and tertiary mods caused the whole thing to collapse in a pile of mediocrity. \u003C/p\u003E\u003Cp\u003E I propose an organizational hierarchy that is limited to name, author, a handful of predesignated tags (much like it already is organized in the mods library thread), and version. Most modders like me either already know some of that information or loosely know names, and could thus cut down on the search engine requirements.\u003C/p\u003E\u003Cp\u003E2. This repository could go with out the aforementioned craft file downloads. They clutters server space and have few downloads if any. The forum already has a section for this and there is always red it for showing of and providing downloads. \u0027Nuff said.\u003C/p\u003E\u003Cp\u003E3. I will add this to the discussion as food for thought. If this does take off and actually begin developing, I think that it would only be appropriate to ask SQUAD for some official support, and allow them to focus on the game itself rather than the mod repository. If we get support, there stands the possibility of having logins tied into our forum accounts and simplifying the voting, reputation, and bug support issue. \u003C/p\u003E\u003Cp\u003EI would like to note that I am not a web dev, mod dev, and have little to no experience with networking outside of military infrastructure. I am simply a player with a lot of time spent downloading mods.\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2014-03-01T15:50:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sharpspoonful\u0022 data-cite=\u0022sharpspoonful\u0022\u003E\u003Cdiv\u003E2. This repository could go with out the aforementioned craft file downloads. They clutters server space and have few downloads if any. The forum already has a section for this and there is always red it for showing of and providing downloads. \u0027Nuff said.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would agree with this 100%, or at the very least have some exclusionary capability included with search functions so people could easily filter out results that they have no interest in.\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2014-03-01T18:22:05Z","Content":"\n\u003Cp\u003EOne of spaceport\u0027s top failings, among many top failings, is that craft files are in no way separated from things that are not craft files, this effectively exploits all of the other top failings to make the site useless unless you have a link to exactly what you want, and even then....\u003C/p\u003E\u003Cp\u003ESo long as our replacement for it does separate craft files, they shouldn\u0027t matter at all; and that is predominantly an issue with the search engine excluding things that don\u0027t have the desired category, how those categories are cut up is a discussion on to itself that we will probably have repeatedly, but craft files are not addons, they are not mods, they are not parts, they are not plugins, and they are not assets.\u003C/p\u003E\u003Cp\u003EIn one way you could consider this a key metric of if the search engine is working adequately, given that both addon and craft listings exist; if any craft files show up in the results when you don\u0027t want them to, the engine has failed.\u003C/p\u003E\n"}]}