{"TopicId":65610,"ForumId":20,"TopicTitle":"Kethane on the water","CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-03-12T23:36:55Z","PageNum":1,"Articles":[{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-03-12T23:36:55Z","Content":"\n\u003Cp\u003EA couple of weeks ago, someone was displaying their Kethane drilling rig, (platform that floats on the surface of the water). They were having a buoyancy issue as to how the platform floated on the surface. Recently, I had a re-entry go bad. (and yeah, Jeb died again) The only thing that survived was an empty kethane tank which hilariously bounced up into the air hundreds of meters, 3 or 4 times! (Felt like I was watching a danny video). Anyways, the light bulb went on, and thought, \u0022Hey, I can make a great floating platform utilizing empty kethane tanks! So I went about constructing a kethane drilling rig powered by 4 turbo jets, testing it out in the water just north of the launch pad several times. I must have had two or three hours invested in the making. So I send it on it\u0027s maiden voyage to a pre-mapped kethane site several kilometers due south of the KSC, splashed down almost perfectly using the turbos and chutes, deployed the drills.,.,., and nothing! The platform sat about 2 or 3 meters above the surface, with the converter, tank and drills almost submerged. Everything was working but it didn\u0027t work! Whats the deal here?\u003C/p\u003E\n"},{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-03-13T06:24:29Z","Content":"\n\u003Cp\u003EThe drills must make physical contact with the seabed below, in order to extract the Kethane. I\u0027ve read a number of theories about trying to get the drills to sink to the bottom, while attached by a winch, but I have never seen a single video or screenshot of Kethane being mined from underwater. As far as I can tell, Kethane deposits underwater are inaccessible.\u003C/p\u003E\n"},{"CreatedByName":"Vertibirdo","CreatedById":76243,"CreatedDateTime":"2014-03-13T12:21:40Z","Content":"\n\u003Cp\u003EHere is the thread, that can be of some use.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/49318-Deep-water-kethan-mining\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/49318-Deep-water-kethan-mining\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Raven.","CreatedById":99340,"CreatedDateTime":"2014-03-13T13:36:47Z","Content":"\n\u003Cp\u003ELike Voculus has mentioned, Kethane located below water is inaccessible, unless it is close to shore enough where you can get a drill in the ground.\u003C/p\u003E\n"},{"CreatedByName":"Kilmeister","CreatedById":65062,"CreatedDateTime":"2014-03-13T19:03:57Z","Content":"\n\u003Cp\u003EI haven\u0027t tried it so this is pure speculation. But I know there\u0027s a submarine part mod that you can adjust your depth. I imagine you could use that and create a submersible vehicle to go get it.\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-03-13T19:08:46Z","Content":"\n\u003Cp\u003EBoy, now I feel like a total idiot! The thought did cross my mind that the kethane might be down in the sea bed but, with a land drill the bit merely scratched the surface and your\u0027e getting kethane, so I didn\u0027t think the mod would be THAT realistic. After all, let\u0027s not forget this same mod has that KE-WAITNONOSTOP Kerbal blender! Regardless, thank you for providing the link. It was quite the education. I was most impressed and inspired with Seanth\u0027s \u0022Water Strider\u0022.\u003C/p\u003E\n"}]}