{"TopicId":68585,"ForumId":20,"TopicTitle":"Mechjeb target selection?","CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-04-07T23:20:25Z","PageNum":1,"Articles":[{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-04-07T23:20:25Z","Content":"\n\u003Cp\u003EIm planning on regressing myself to fly with mechjeb again, but with a catch. Im not using any of the autopilots, and flying in IVA the whole time. Utilizing the node creation and flight data to fly, and land on the moon. \u003C/p\u003E\u003Cp\u003EOne of the problems I have with this is, I can\u0027t seem to find a way (if there is a way) to select targets without going to map view OR right clicking them in normal view. (such as in a docking situation)\u003C/p\u003E\u003Cp\u003EThis doesn\u0027t matter as much when i want to just land anywhere on the moon, but it does matter if i want to land close to a target and need its coordinates and data.\u003C/p\u003E\u003Cp\u003EI know Kerbal Engineer can select targets via buttons, and was wonderin if MJ has something similar hidden away somewhere or even has that functionality.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-07T23:40:08Z","Content":"\n\u003Cp\u003EAre you using RasterPropMonitor? It\u0027s got a target selection screen on one of the pages. Haven\u0027t used it for targeting landed things so I don\u0027t know what info it gives regarding that, but it\u0027ll be targeted all the same.\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-04-08T03:33:18Z","Content":"\n\u003Cp\u003ENo, i could potentially get the mod for what im doing just to make things a little more user friendly in IVA. I probably will if there is not function or minor add on to give mechjeb the ability to set up targets without map or outside views.\u003C/p\u003E\n"},{"CreatedByName":"Sethnizzle","CreatedById":22985,"CreatedDateTime":"2014-04-08T13:29:28Z","Content":"\n\u003Cp\u003EI haven\u0027t seen anything that does exactly what you want, but in addition to RasterPropMonitor, you might be interested in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54925-WIP-ALCOR-Advanced-Landing-Capsule-for-Orbital-Rendezvous-by-ASET-(UPD-11-02-2014)\u0022 rel=\u0022external nofollow\u0022\u003EALCOR\u003C/a\u003E lander.\u003C/p\u003E\n"}]}