{"TopicId":68813,"ForumId":20,"TopicTitle":"AS much as I love it","CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2014-04-09T20:10:02Z","PageNum":1,"Articles":[{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2014-04-09T20:10:02Z","Content":"\n\u003Cp\u003EAs much as Ilove the Kerbals and all things squad, I would like to point at the one area that is driving me nuts and hopefully get some help.\u003C/p\u003E\u003Cp\u003EWheels... For the love of all that is holy I want wheels. Not monstrous uber wheels, not racing wheels just wheels that work.\u003C/p\u003E\u003Cp\u003EThe big wheels (XL3) are massive... really massive. Getting them off world is challenging, and building a ballanced lander with them is ... difficult\u003C/p\u003E\u003Cp\u003EThe M1\u0027s and and TR2\u0027s are right sized but so week to be almost useless at anything over a brisk walking speed. Adding to the fun is when they fail out the impart energy in random directions. Every cart I have made has died soon after I tried to apply it to its design function.\u003C/p\u003E\u003Cp\u003EThe S2\u0027s I have never found a use for as they don\u0027t scale to the basic parts of Kerbal that well and at the sizes of carts built with them their total weight would make them more unstable than the M1 and TR2\u0027s.\u003C/p\u003E\u003Cp\u003ESo my question is where are all the wheels these days. I have used almost every set of MOD wheels since v.17 when I first starting using mods in my games, and I miss most of them. BoBCat and TT are by far the best two (at times I think they were the same thing and other times they seemed seperated but I thank all the dev\u0027s of both for making great and truly useful wheel systems). Is there anything out there now for the ARM era to make my carts not die.\u003C/p\u003E\u003Cp\u003EIf there are (and yes I have looked but the answers have been discouraging and at times confusing) wheel part mods please give me a hit here and I will be forever in your debt.\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-04-09T20:35:44Z","Content":"\n\u003Cp\u003EYou could try Modular Multi-Wheels, pretty sure those still work. (They did in .23) There is also a mod called \u003Ca href=\u0022http://kerbalspaceprogram.com/rollkage-1-0/\u0022 rel=\u0022external nofollow\u0022\u003ERollkage\u003C/a\u003E that adds Dunebug styled wheels. \u003Ca href=\u0022http://kerbalspaceprogram.com/0-20-freelancer-rover-body-mk1-wayland-corp/\u0022 rel=\u0022external nofollow\u0022\u003EWeyland corp\u003C/a\u003E. also has some wheels (Though they seem a bit over powered, often causing flips, but they go fast) Firespitter has some too (Though they are geared more towards aircraft). \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-taverios-pizza-and-aerospace/\u0022 rel=\u0022external nofollow\u0022\u003ETaverio\u0027s Pizza and Aerospace\u003C/a\u003E should have wheels? Or you could forgo wheels altogeather and wait until Electronic Fox releases his Caterpillar Track update.\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2014-04-09T20:58:31Z","Content":"\n\u003Cp\u003EI think the bigger issue, and maybe what you were alluding to, is that they don\u0027t seem to operate sensibly. They work okay on Kerbin I suppose, but places without an atmosphere, like the Mun for instance, just behave strangely. It\u0027s like they have no traction or something, compounded by the default controls causing you to tilt as well as drive (I have my buttons on the arrow keys). They have other oddities as well, such as the wheels only seem to grip at a specific spot on the bottom, so if you try to use them strangely like a 90 angle, the no longer work.\u003C/p\u003E\u003Cp\u003EWheels is a place the game could definitely use some love one day. Perhaps when rover science becomes a thing. Right now they are sort of like planes, a ******* idea that is largely unfinished and mostly in place as a token gesture. Rovers and buggies probably won\u0027t really make sense until stock has things like cargo bays, fairings and other ways to handle payloads. They are kind of like boats on Minecraft.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-04-10T12:38:45Z","Content":"\n\u003Cp\u003EThere is also the wheels from the Core Dune Raider (avail on spaceport), they work in 0.23 and they are great, at least on Kerbin.\u003C/p\u003E\u003Cp\u003Ethe author wrote:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EDune Raider becomes unstable at high speed on low gravity worlds (such as the Mun)\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-04-10T13:53:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022alacrity\u0022 data-cite=\u0022alacrity\u0022\u003E\u003Cdiv\u003EThe M1\u0027s and and TR2\u0027s are right sized but so week to be almost useless at anything over a brisk walking speed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHm. They can easily do 20m/s (at least on Kerbin). Windows\u0027 calculator tells me that\u0027s 72 km/h or if you are from the US, 45 mph. That\u0027s a \u003Cstrong\u003Every\u003C/strong\u003E brisk walking speed in that case!\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-04-10T14:12:11Z","Content":"\n\u003Cp\u003Ewell i imagine if they ever give rovers an expanded science role, they will expand the rover parts. same if they do new aerodynamics we would get better plane parts\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2014-04-10T16:50:04Z","Content":"\n\u003Cp\u003EWheels are certainly not without issues but a lot of the problems users think wheels have are kinda the users fault. Frequently people complain about the speed and traction-at-speed of rovers, but as mentioned the stock wheels can go 45mph almost without exception and at 45mph you simply cannot make sharp turns; even on roads. The sharpest highway speed turn in my area is 65mph speed limit and takes place over two miles, on either side this is a 75mph highway, they forbid lane changing, and there is a significant bank. In KSP you\u0027re lucky if you\u0027re not trying to turn up a hill (antibank), you do not have a proper road surface (reduced traction), you probably have all wheel steering (massively oversensitive steering response), and there\u0027s a good chance that you\u0027re using keyboard controls, which are either I/O in standard mode, or increasing over sustained input, both of which lead to pilot induced oscillation. Finally, there\u0027s a very good chance that your rover is simply far too thin with it\u0027s CoM far too high. This is true if your rover is composed of any 1.25m cylindrical stack part with any stock wheels attached directly to it and you\u0027re not using the giant wheels, this is true and your rover is unstable under the best of circumstance.\u003C/p\u003E\u003Cp\u003EThis is a stable rover\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yR06Dib.png\u0022 alt=\u0022yR06Dib.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s track is well over twice the ground height of it\u0027s CoM, and I\u0027ve given it ballast tanks to make it even heavier, which increases traction and lowers the CoM. The wheels extend further than the stock wheels but also are also on extensions. Steering on the rear wheel is disabled, this increases the turning radius and turning slower is better. This rover can travel at an average 28m/s offroad over flat terrain and be stable. Over less flat terrain it\u0027s safe at 24m/s, over hilly terrain I turn it down to 15m/s.\u003C/p\u003E\u003Cp\u003EThere are mods to help with this, as mentioned Rollkage has vastly superior wheels, they\u0027re a little bit faster, have wider footprints, a bit better traction, and they look amazing. There\u0027s a recently released mod that changes the unit displayed to you and you can set the speed value from m/s to mph or kmph so that you\u0027ve got a better idea of what speed you are going; or just memorize a bunch of m/s-\u0026gt;mph conversions. KJR will make your rover less wobbly which is usually a good thing, and FAR can allow your rover to travel faster in atmosphere, and also use aerodynamic effects in turning to resist rollover.\u003C/p\u003E\u003Cp\u003ENow, that\u0027s all stuff that\u0027s true because of geometric physics, those things won\u0027t really change regardless of how wheels work. because it\u0027s the application of force over the whole vessel; except for traction which really is fine, you just think you\u0027re going slower than you actually are.\u003C/p\u003E\u003Cp\u003EKSP\u0027s wheels are not without fault and hopefully they will get better, so here\u0027s some tips for working with them.\u003C/p\u003E\u003Cp\u003EEvery wheel I\u0027ve ever used in KSP has had such a responsive suspension that even properly designed rovers can easily bottom out, and few parts in KSP can survive that. The I-beam shaped parts can, so putting several of them along the bottom of your rover, particularly the front back and center (front/back for bottoming out on valleys, center for bottoming out over peaks) can help to protect your rover from inevitable ground collisions. \u003C/p\u003E\u003Cp\u003EKSP\u0027s joints are weird, when you have light things connected to heavy things, the joint is really weak, now the failure point of a joint is defined in the cfg, but the stiffness is not, so if you put your wheels on say, a giant fuel tank, that has a really high mass, that wheel is going to be really not-stiff, and wobbly wheels are bad. KJR as mentioned strengthens stack connections so you can get away with having a lighter part on the end of your heavy tank, and connect the wheels to that lighter stack part.\u003C/p\u003E\u003Cp\u003EFor whatever reason, KSP hates rear wheel drive. If any wheels behind your CoM have their motors enabled, your rover will be much more difficult to control and prone to spinning out than should be expected. Disabling the motors on your rear wheels will allow you to make tighter turns at higher speeds without spinning out, but it won\u0027t help to keep you from rolling over. This will adversely impact your hill climbing ability and will make it harder to get some vehicles moving, I suggest you use actiongroups to toggle them quickly and symmetrically, but generally leave the back wheels off.\u003C/p\u003E\u003Cp\u003EReaction wheels will kill you. Turn them off. Unless you\u0027re using MJ\u0027s rover autopilot waypoint system which is able to use reaction wheels independent of steering to keep your rover right side up.\u003C/p\u003E\u003Cp\u003EI don\u0027t see wheels getting revamped any time soon, especially since they just made landing legs into wheels with their brakes permanently on, but if you exploit the system you can make \u003Ca href=\u0022http://i.imgur.com/dB1Ea1K.png\u0022 rel=\u0022external nofollow\u0022\u003Esome pretty decent stuff\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2014-04-10T19:39:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003EWheels are certainly not without issues but a lot of the problems users think wheels have are kinda the users fault.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, KSP doesn\u0027t particularly make it easy to make smooth turns. Yes, no one on a highway would hardly yank the wheel around, but you really have to exercise this in KSP.\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2014-04-10T23:16:56Z","Content":"\n\u003Cp\u003EInput limitations are a problem yes, but the other factors have a very significant influence on the issue, while writing that post I made a couple of rovers to test what I was saying and the first one was undriveable on the runway at 12m/s, but disabling the rear steering made it just uncomfortable and disabling the cockpit\u0027s torque made it perfectly driveable, though it would still flip if I did a U-turn at top speed (20m/s), disabling rear wheel drive fixed that because when the rover started to tip it lost traction and the front inside wheel stopped contributing \u0027thrust\u0027, thus letting the rover slow down and pull out of the turn a bit. Having 4 wheel drive leaves the turning rover with enough torque to accelerate into the turn and flip, that was all with keyboard controls.\u003C/p\u003E\u003Cp\u003EIf you\u0027re forced to dri e an unweildy rover you are able to use joysticks with KSP, they\u0027re just finnicky.\u003C/p\u003E\n"},{"CreatedByName":"alacrity","CreatedById":70443,"CreatedDateTime":"2014-04-10T23:58:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KvickFlygarn87\u0022 data-cite=\u0022KvickFlygarn87\u0022\u003E\u003Cdiv\u003EHm. They can easily do 20m/s (at least on Kerbin). Windows\u0027 calculator tells me that\u0027s 72 km/h or if you are from the US, 45 mph. That\u0027s a \u003Cstrong\u003Every\u003C/strong\u003E brisk walking speed in that case!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe m1\u0027s and tr2\u0027s operate at 20 m/s over flat land, but roll over the runway at speed and on average I lose 4 out of 6 wheels on my carts. On the moon I lose stability at around 14 m/s If I get airborn the wheels tend to fail on any impact from over 3 meters, sending the cart into some bizarre acrobatic death spiral that has apogees up to 20 meters over the surface.\u003C/p\u003E\u003Cp\u003EThe oddest aspect is that these happenings are regardless of the load on the cart. I use my carts as fuel and ore transports and full or empty, their speed envelopes some unchanged, and the wheel failures seem to happen just the same.\u003C/p\u003E\u003Cp\u003EAlacrity\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2014-04-11T17:39:41Z","Content":"\n\u003Cp\u003ESo last night I got super caffeinated and for the first time in about 16 months recorded a video, mostly because I wanted to. This is my first go at constructing a format in KSP and there are things I want to change, and things I forgot like the \u0027sense of scale\u0027, and I definitely noticed that the action wasn\u0027t always making my point very well so in the future I need to spend more time scripting activities so I don\u0027t forget what I\u0027m trying to show, but here.\u003C/p\u003E\u003Cp\u003EMust be viewed in 1080 for the text to be legible.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gUgjdWrTZMw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ETLDW; changing your rover control bindings so they don\u0027t coincide with your reaction wheel controls will make almost any rover driveable.\u003C/p\u003E\n"}]}