{"TopicId":79738,"ForumId":20,"TopicTitle":"Add-Ons for an enhanced Space Station experience?","CreatedByName":"jztemple","CreatedById":57512,"CreatedDateTime":"2014-07-27T17:22:10Z","PageNum":1,"Articles":[{"CreatedByName":"jztemple","CreatedById":57512,"CreatedDateTime":"2014-07-27T17:22:10Z","Content":"\n\u003Cp\u003EI hope this is the proper forum to discuss this, if not, let me know.\u003C/p\u003E\u003Cp\u003EI\u0027m a bit burned out on the new Contracts experience, so I\u0027ve decided to challenge myself to build and maintain a large Space Station, either in Kerbin orbit or around the Mun. I\u0027m already running the following Mods that are probably appropriate:\u003C/p\u003E\u003Cp\u003EUniversal Storage\u003C/p\u003E\u003Cp\u003ETAC Fuel Balancer\u003C/p\u003E\u003Cp\u003EKAS\u003C/p\u003E\u003Cp\u003EMechJeb\u003C/p\u003E\u003Cp\u003EWhat I\u0027m looking for, or I guess what I \u003Cem\u003Ethink\u003C/em\u003E I\u0027m looking for, as I\u0027m still a bit unsure, are mods to do the following:\u003C/p\u003E\u003Cp\u003E- Provide a simulation of water, oxygen and food usage on the station, based upon number of Kerbonauts aboard. Universal Storage already gives me water and oxygen storage, but no demand system. \u003C/p\u003E\u003Cp\u003E- Power usage. I think I\u0027m looking for something with modules that simulate the power needed for life support, experiments, and other power expenditures. \u003C/p\u003E\u003Cp\u003E- Ability to transfer Kerbonauts and supplies between supply ships and the station.\u003C/p\u003E\u003Cp\u003ENow I know there are lots of mods out there and by surfing through the add-on showcase forum I could find a bunch of the above. I\u0027m posting here to ask because I figure there are already folks out there who have or are running their own space station simulators and can authoritatively comment and suggest based on their own experience.\u003C/p\u003E\u003Cp\u003EThanks in advance for any advice or suggestions.\u003C/p\u003E\n"},{"CreatedByName":"sargunster","CreatedById":11781,"CreatedDateTime":"2014-07-27T22:05:10Z","Content":"\n\u003Cp\u003ETAC Life Support requires water, oxygen, food, and electricity. It also requires a way to dispose of waste and waste water.\u003C/p\u003E\u003Cp\u003EShip Manifest will make it easy to transfer crew between ships (when docked). Supplies can be transferred when docked in stock KSP, no mods required.\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-07-27T22:08:51Z","Content":"\n\u003Cp\u003EKSP Interstellar adds a science lab that requires electricity, though it\u0027s also a massive change to the entire game.\u003C/p\u003E\n"},{"CreatedByName":"SGCam","CreatedById":112418,"CreatedDateTime":"2014-07-28T19:19:15Z","Content":"\n\u003Cp\u003EKerbal Crew Transfer is another way to move crew around while docked- a simpler \u0022stockalike\u0022 solution similar to Ship Manifest.\u003C/p\u003E\u003Cp\u003EAlso, yes TAC Life Support.\u003C/p\u003E\u003Cp\u003EI saw this mod \u0022Station Science\u0022 that adds resource and electrical demands for labs.\u003C/p\u003E\u003Cp\u003EI find that stock parts are a little limiting to building impressive space stations, so you should consider looking at structural style part packs as well.\u003C/p\u003E\n"},{"CreatedByName":"jztemple","CreatedById":57512,"CreatedDateTime":"2014-07-28T19:52:16Z","Content":"\n\u003Cp\u003EThanks for the suggestions, I\u0027ll give them a look!\u003C/p\u003E\n"}]}