{"TopicId":83341,"ForumId":20,"TopicTitle":"Plane landing with NEAR/FAR?","CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2014-08-30T00:58:00Z","PageNum":1,"Articles":[{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2014-08-30T00:58:00Z","Content":"\n\u003Cp\u003EFirst time NEAR-user here, feeling like a greenhorn again after countless hours of KSP. Need help landing planes with NEAR, especially on terrain. Whats the trick there? I had no trouble landing planes with the stock aerodynamics, but now the higher speeds seem to make landing almost impossible. Plane touches ground with speeds around 100m/s and flight angle \u0026lt;5Ã‚Â°, bounces and crashes shortly afterwards (if the initial contact doesn\u0027t already disintegrate it). I can\u0027t even land the stock Aeris 3 - what am i doing wrong? How do you people build/fly planes for landings?\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-08-30T01:20:50Z","Content":"\n\u003Cp\u003Eair brakes; or zig zag to bleed off speed till you are between 60~80m/s\u003C/p\u003E\n"},{"CreatedByName":"Spica","CreatedById":65153,"CreatedDateTime":"2014-08-30T01:21:34Z","Content":"\n\u003Cp\u003EWell, 100 m/s is roughly 223 mph, or 360 km/h. That is much faster than the speeds at which most planes land. Furthermore, it is landing on uneven terrain, which only makes things worse.\u003C/p\u003E\u003Cp\u003ESince you are only landing at a 5 degree angle of attack (flight angle), you may want to try to slow down an pitch up more. If your plane can\u0027t do that, try either moving the center of lift slightly forwards, or give the plane more control authority (maybe some canards at the front of the plane may help). Remember, also try to keep your final descent rate under 5 m/s, that should lessen the shock of landing.\u003C/p\u003E\u003Cp\u003EI hope some of that helps.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-30T01:35:58Z\u0022 title=\u002208/30/2014 01:35  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 30, 2014\u003C/time\u003E by Spica\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-08-30T09:53:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003Eair brakes; or zig zag to bleed off speed till you are between 60~80m/s\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewithout forgetting: cut the throttle off before you actually do and glide to your landing zone.\u003C/p\u003E\u003Cp\u003EBut airbrakes are really mandatory (Firespitter, B9 as I heard and nil2work\u0027s retro future planes)\u003C/p\u003E\n"}]}