{"TopicId":85144,"ForumId":20,"TopicTitle":"Your RT2 networks?","CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-09-21T17:47:56Z","PageNum":1,"Articles":[{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-09-21T17:47:56Z","Content":"\n\u003Cp\u003EI just setup my first basic RT2 network. And I wanted to share it, while also seeing some of yours! Show us!\u003C/p\u003E\u003Cp\u003EI used this rocket I built\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ww3.xyz/KSPA/FC_CAREER_GALLERY/2014-09-21_00-59-01.png\u0022 alt=\u00222014-09-21_00-59-01.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Yes I use FAR and everything btw. And no I don\u0027t use mj)\u003C/p\u003E\u003Cp\u003Eto launch my first 4 communication satellites!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ww3.xyz/KSPA/FC_CAREER_GALLERY/2014-09-21_01-57-05.png\u0022 alt=\u00222014-09-21_01-57-05.png\u0022\u003E\u003Cimg src=\u0022http://ww3.xyz/KSPA/FC_CAREER_GALLERY/2014-09-21_01-56-19.png\u0022 alt=\u00222014-09-21_01-56-19.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"weeble","CreatedById":117348,"CreatedDateTime":"2014-09-23T06:15:05Z","Content":"\n\u003Cp\u003EVery nice design and job setting up that network. You should consider posting a pic on your actual satellite that you\u0027re using. I\u0027m too embarrassed to show my attempts!\u003C/p\u003E\n"},{"CreatedByName":"Gryphon","CreatedById":58513,"CreatedDateTime":"2014-09-23T19:22:32Z","Content":"\n\u003Cp\u003E(I am using RT2, TAC life support, FAR aerodynamics, and Procedural Fairings, among other mods not relevant to this.)\u003C/p\u003E\u003Cp\u003EHere is my keostationary equatorial orbit comsat network:\u003C/p\u003E\u003Cp\u003EI named each satellite in the network based on the position of the sun from KSC towards its location: Sunset, Twilight, Midnight, Predawn, and Sunrise.\u003C/p\u003E\u003Cp\u003EThe apparent gap in the network is intentional; the ground-based antennae at KSC cover that part of the sky.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jMyXWdr.jpg\u0022 alt=\u0022jMyXWdr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENote my pre-positioned Kerbal retrieval ship in LKO. While it is on the opposite side of the planet from KSC, it has a short window when all the KEO Comsats are simultaneously visible, as shown here.\u003C/p\u003E\u003Cp\u003EThe links going offscreen are to the Munar comm network, currently being deployed.\u003C/p\u003E\u003Cp\u003EKEO Comsat, first wave of deployment (2 sats).\u003C/p\u003E\u003Cp\u003EEach sat has an interplanetary-range dish, a shorter range dish for long links in the Kerbin SOI, and the largest omni available, intended for links to Kerbin, LKO, and the rest of the KEO Comsat net. \u003C/p\u003E\u003Cp\u003EI also included a Clamp-o-tron jr. on the aft end for refueling or expansion.\u003C/p\u003E\u003Cp\u003EAfter it was in operation, I decided it the sats needed an RTG for auxiliary power, so I brought extras along for the first wave sats when I was deploying my second wave of KEO Comsats.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VyAucj4.jpg\u0022 alt=\u0022VyAucj4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EKEO Comsat, second wave of deployment (3 sats).\u003C/p\u003E\u003Cp\u003ESimilar to the first wave, but I unlocked the biggest dish, and more is better, right? These also included the PB-NUK on initial deployment.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KQ4y3aY.jpg\u0022 alt=\u0022KQ4y3aY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMSEO Comsat (3 sats).\u003C/p\u003E\u003Cp\u003EI am currently deploying three equidistant comsats to semi-synchronous equatorial orbit around the Mun. Each has two dishes to link back to two separate KEO Comsats, and an omni to support Munar ops.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/A9E2C2Y.jpg\u0022 alt=\u0022A9E2C2Y.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-23T19:37:36Z\u0022 title=\u002209/23/2014 07:37  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 23, 2014\u003C/time\u003E by Gryphon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2014-09-23T20:45:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gryphon\u0022 data-cite=\u0022Gryphon\u0022\u003E\u003Cdiv\u003E~snip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow do your Mun sats have enough power to last through the night? Unless I\u0027m wrong you only have a few hundred EC and if you have all three antennas going and a 19 hour (1/2 Sidereal rotational period) that is only enough for 200seconds out of the 2200 for the dark period.\u003C/p\u003E\n"},{"CreatedByName":"SuccessPastaTime","CreatedById":110002,"CreatedDateTime":"2014-09-23T22:54:07Z","Content":"\n\u003Cp\u003EHere\u0027s my main go to for Kerbin SOI coverage. Still has upper stage attached to it, so don\u0027t mind the Saturn V style painted part. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zZg9BXA.png\u0022 alt=\u0022zZg9BXA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m so nitpicky about how my satellites look, I literally spend way to long in the VAB and never actually get the missions done. Don\u0027t got a picture of their layout yet, but I place three in KSO at least.\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2014-09-24T00:19:20Z","Content":"\n\u003Cp\u003EThis thread is great, since it made me review my entire network, which had all sorts of weird and broken connections \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyways, here\u0027s what I\u0027m running for my heavily modded save, including stuff from KSPI-Lite and KW Rocketry. This network (especially the KGN, MOS, and MiOS satellites) was inspired/stolen from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/88879-Beginner-s-Notes-on-Remote-Tech-2-in-Career\u0022 rel=\u0022external nofollow\u0022\u003Ethis guide\u003C/a\u003E. I\u0027m aiming for satellites around at least Duna and Eve as well, but we\u0027ll see how long I\u0027m motivated to keep launching dozens of commsats.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ZNtZv\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-24T00:23:26Z\u0022 title=\u002209/24/2014 12:23  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 24, 2014\u003C/time\u003E by Wiseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-09-24T01:26:25Z","Content":"\n\u003Cp\u003EWhile I don\u0027t have a pic of my network I do have one of my sat. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/h8RYZGg.png\u0022 alt=\u0022h8RYZGg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s one of my Long Range Sats, these were placed Halfway to the Mun\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GEzsAAU.png\u0022 alt=\u0022GEzsAAU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s another version of my inter-system commsat\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7EXYvN3.png\u0022 alt=\u00227EXYvN3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhile not a picture of my network specifically you can see the inter-system sats at KSO and the Long Range Sats further out. There are 3 KSP sats and 4 of my Long Range Sats.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yQBF30b.png\u0022 alt=\u0022yQBF30b.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s another showing the inter-system sats (This was a different save so I didn\u0027t have the long range satellites)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HBlGg0T.png\u0022 alt=\u0022HBlGg0T.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-24T01:30:16Z\u0022 title=\u002209/24/2014 01:30  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 24, 2014\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gryphon","CreatedById":58513,"CreatedDateTime":"2014-09-24T05:34:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nori\u0022 data-cite=\u0022Nori\u0022\u003E\u003Cdiv\u003EHow do your Mun sats have enough power to last through the night? Unless I\u0027m wrong you only have a few hundred EC and if you have all three antennas going and a 19 hour (1/2 Sidereal rotational period) that is only enough for 200seconds out of the 2200 for the dark period.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUm.\u003C/p\u003E\u003Cp\u003EI may not have fully tested the electrical consumption without a charge from the panels, and I forgot that KSP doesn\u0027t spend electric when you are not focusing on that vessel, so when it looked OK, I thought it was OK. I\u0027d rather pretend that it works the way it should, so I checked it out:\u003C/p\u003E\u003Cp\u003EThe good news is that it\u0027s only 20 minutes of Kerbin shadow at keosynchronous equatorial orbit.\u003C/p\u003E\u003Cp\u003EThe bad news is that with the full 210 EC available, the satellite batteries last about 1 minute with all antennae active.\u003C/p\u003E\u003Cp\u003EIn the dark, the sat with all antennas up drains the 210 EC in about 1 minute.\u003C/p\u003E\u003Cp\u003EHOWEVER, with the dishes turned off and just the omni antenna active, the sat has enough power for continuous operation without input from the solar panels. The Kerbals COULD keep re-aiming dishes to different parts of the network as sats go in and out of shadow, and it would work OK.\u003C/p\u003E\u003Cp\u003EI\u0027d rather have enough power to get through shadow periods, though; in my mind, constant switching is a recipe for losing unmanned craft, when you forget to retarget in the correct order and lose control of the satellite.\u003C/p\u003E\u003Cp\u003E(In the version more real than RemoteTech, you could just use a really large dish like Arecibo and still contact the satellite, like they did, for instance, with ISEE-3. But I digress.)\u003C/p\u003E\u003Cp\u003EIf my math is right, then I need more power or more battery for that shadow: 5 more PB-NUK\u0027s or 4300\u002B EC of batteries.\u003C/p\u003E\u003Cp\u003EBUT WAIT, THERE\u0027S MORE!\u003C/p\u003E\u003Cp\u003EThere are also Munar shadows to contend with. A craft will stay in the Munar shadow the longest while it is out on the limbs of the orbit, going directly toward or away from the Mun. This could be 8\u002B minutes. At those points of the orbit, the batteries should be recharged sufficient to handle that amount of time (I think). However, if the craft encounters the Munar shadow just before or after the Kerbin shadow, it will still be an additional 4 minutes or so of discharge time. That adds up to 5200\u002B EC required.\u003C/p\u003E\u003Cp\u003ESo, thanks for the heads-up; now I get to fly ANOTHER mission to each satellite!\u003C/p\u003E\u003Cp\u003EEdit: Oh, hey, the Universal Storage guy made a spreadsheet for figuring this stuff: \u003Ca href=\u0022http://www.kingtiger.co.uk/kingtiger/wordpress/2013/11/20/kasa-power-requirements/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kingtiger.co.uk/kingtiger/wordpress/2013/11/20/kasa-power-requirements/\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-24T05:51:09Z\u0022 title=\u002209/24/2014 05:51  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 24, 2014\u003C/time\u003E by Gryphon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2014-09-24T06:17:58Z","Content":"\n\u003Cp\u003EI try to keep it pretty simple and exact for the sake of cutting down on the number of crafts. Here\u0027s my typical Kerbin setup, sans connection lines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RKASU0p.png\u0022 alt=\u0022RKASU0p.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFour satellites in semi-synchronous equatorial orbit. At that altitude other craft can get by with using the Communtron 16 rather than the 32 in LKO, which isn\u0027t the case if those comsats were in Kerbi-synchronous orbit. Each is also equipped with two short range dishes to maintain coverage upon the Mun and Minmus.\u003C/p\u003E\u003Cp\u003EThe two polar orbits are very heavy comsats with a mid-range dish for each of Moho/Eve/Duna/Active Vessel and a long range for each of Dres/Jool/Eeloo/Active Vessel. The AP of their orbits is around 4000km with a PE of around 95km, synchronized so that as one is reaching PE, the other is reaching AP. That way one is very nearly always visible to anything trying to maintain contact with Kerbin from afar.\u003C/p\u003E\n"},{"CreatedByName":"Overjay","CreatedById":104131,"CreatedDateTime":"2014-09-24T08:05:29Z","Content":"\n\u003Cp\u003EBoomerang, DUUUUDE! Those polar orbits are genuine! I\u0027ll use them for sure\u003C/p\u003E\n"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2014-09-25T01:19:09Z","Content":"\n\u003Cp\u003ESo here is my current network.\u003C/p\u003E\u003Cp\u003EGot 4 Sats around Kerbin with 3h orbit times.\u003C/p\u003E\u003Cp\u003E3 are around the Mun and I\u0027m currently adding 3 to Minmus. See captions on images for more info.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/wnMoN\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Beale","CreatedById":70533,"CreatedDateTime":"2014-09-25T15:15:17Z","Content":"\n\u003Cp\u003EI\u0027ve tried to avoid Geo (Keo?) stationary orbits due to the \u0022drift\u0022 that happens with floating point errors. So I opt for Molniya orbits around Kerbin.\u003C/p\u003E\u003Cp\u003ESuprisingly near-perfect coverage, you\u0027ll be connected just about anywhere in the Kerbin system.\u003C/p\u003E\u003Cp\u003EYou see a \u0022four-leaf\u0022 clover around Kerbin here.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/bNlPu/da2294de35.jpg\u0022 alt=\u0022da2294de35.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Satellites are nothing special, just the 2nd most powerful dish and some arrays \u002B (shameless plug) some Tantares omni-directionals.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/bNlT9/0057f3ba88.jpg\u0022 alt=\u00220057f3ba88.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe far side of the Mun gets partial coverage by the Munar relay.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/bNlWD/56896c13a6.jpg\u0022 alt=\u002256896c13a6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhich has been helpful in landing this fella.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/bNlZk/c1cad3b3c4.jpg\u0022 alt=\u0022c1cad3b3c4.jpg\u0022\u003E\u003Cimg src=\u0022http://puu.sh/bNm5M/52e7b328f3.jpg\u0022 alt=\u002252e7b328f3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EReally nice to see other\u0027s networks!\u003C/p\u003E\u003Cp\u003EEdit: Oh, and before the network was set up, a series of ground stations with a crew of 6 gave pretty decent coverage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://puu.sh/bNmaW/6c48086ae8.jpg\u0022 alt=\u00226c48086ae8.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-25T15:18:45Z\u0022 title=\u002209/25/2014 03:18  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 25, 2014\u003C/time\u003E by Beale\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SuccessPastaTime","CreatedById":110002,"CreatedDateTime":"2014-09-25T15:50:47Z","Content":"\n\u003Cp\u003ENice Molniyas. I\u0027ve been doing those lately too. It\u0027s much easier to spread them out compared to KSO orbit sats, IMO.\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2014-09-25T18:22:55Z","Content":"\n\u003Cp\u003EMy communications network is planned to consist of multiple rings of communication sats going like this,\u003C/p\u003E\u003Cp\u003EGeosynchronous ring, main communications ring, connected to ksc via Geo Sat Alpha, three of the sats in this ring connect to a single sat in a ring of comms sats in a 250 km orbit or wherever I put it, this sat is the Low Orbit Communications Hub, covered in large dishes, and it connects the ring at this altitude, then, three of the dishes in this ring, maybe three in the geo ring too, connect to a single sat in either an orbit between the geo sats and the mun, or above the mun, and that satellite will keep that ring in contact, overall I\u0027ll have a few sats to target at the mun and Minmus, and the hubs can be used to target other planets, or if necessary, I can launch a ring with multiple hubs to keep all the planets in contact.\u003C/p\u003E\u003Cp\u003EI\u0027m going to busy for the next month...\u003C/p\u003E\n"},{"CreatedByName":"schoff123","CreatedById":71389,"CreatedDateTime":"2014-09-28T19:58:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beale\u0022 data-cite=\u0022Beale\u0022\u003E\u003Cdiv\u003EI\u0027ve tried to avoid Geo (Keo?) stationary orbits due to the \u0022drift\u0022 that happens with floating point errors. So I opt for Molniya orbits around Kerbin.\u003Cp\u003ESuprisingly near-perfect coverage, you\u0027ll be connected just about anywhere in the Kerbin system.\u003C/p\u003E\u003Cp\u003EYou see a \u0022four-leaf\u0022 clover around Kerbin here.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/bNlPu/da2294de35.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/bNlPu/da2294de35.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Satellites are nothing special, just the 2nd most powerful dish and some arrays \u002B (shameless plug) some Tantares omni-directionals.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/bNlT9/0057f3ba88.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/bNlT9/0057f3ba88.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe far side of the Mun gets partial coverage by the Munar relay.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/bNlWD/56896c13a6.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/bNlWD/56896c13a6.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhich has been helpful in landing this fella.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/bNlZk/c1cad3b3c4.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/bNlZk/c1cad3b3c4.jpg\u003C/a\u003E\u003Ca href=\u0022http://puu.sh/bNm5M/52e7b328f3.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/bNm5M/52e7b328f3.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EReally nice to see other\u0027s networks!\u003C/p\u003E\u003Cp\u003EEdit: Oh, and before the network was set up, a series of ground stations with a crew of 6 gave pretty decent coverage.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://puu.sh/bNmaW/6c48086ae8.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://puu.sh/bNmaW/6c48086ae8.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewhats the AP/PE on those molniyas? about 600k/100k?\u003C/p\u003E\n"},{"CreatedByName":"jordanjay29","CreatedById":62787,"CreatedDateTime":"2014-10-02T04:07:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003E\u0026lt;snip\u0026gt;\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich mods are you using besides RT? I\u0027ve seen some of those parts before, but not where to find them.\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-10-02T17:31:05Z","Content":"\n\u003Cp\u003EHere\u0027s the plan I\u0027ve been following for my last couple of careers:\u003C/p\u003E\u003Cp\u003EEight satellites with Communotron 16s in a 175km equatorial orbit of Kerbin. This compact ring will reach an atmospheric vehicle using a Reflectron DP-10 anywhere along Kerbin\u0027s equator. Note to self: calculate the highest latitude to cover a DP-10 at ground level and the range of altitudes at which the inner ring will cover the poles.\u003C/p\u003E\u003Cp\u003ELunar and interplanetary relays in pairs at 1000km altitude equatorial. I chose 1000 km because it keeps all satellites within the cone of a KR-7 in Mun orbit, and within the cone of a GX-128 by the time a probe goes out of the range of an 88-88.\u003C/p\u003E\u003Cp\u003EThe first pair of relays each carry a Communotron 16 and four DTS-M1. Targets are Mun, Minmus, active vessel, and spare. Spare dishes will be used if a station or mothership needs to relay to its support craft while outside the coverage of its cone-mode dishes. Hasn\u0027t happened yet.\u003C/p\u003E\u003Cp\u003ESecond pair of relays carries the 88-88. Targets are Moho, Eve, Duna, active vessel, and two spares for symmetry. The shorter-range \u0022active vessel\u0022 dishes on the older satellites can become spares once the longer-range \u0022active vessel\u0022 dishes are available, since \u0022active vessel\u0022 doesn\u0027t care about cone width.\u003C/p\u003E\u003Cp\u003EThird pair of relays carries the GX-128. Targets are Dres, Jool, Eeloo, active vessel, and two spares. The \u0022active vessel\u0022 88-88s that are freed up now target Dres, to provide coverage of high Dres orbit at close approaches when the GX-128 cone is too narrow.\u003C/p\u003E\u003Cp\u003EMun and Minmus get sets of three equatorial relays with Communotron 16 and one DTS-M1 to talk to the Kerbin-orbit relays. Mun-orbit relays go at 240 km altitude to support use of DP-10 on landers and rovers. I thought of that altitude only on my current career, so I haven\u0027t calculated the corresponding altitude for Minmus yet.\u003C/p\u003E\u003Cp\u003EDuna- and Jool-system local relays will be designed the next time a career advances far enough to need them.\u003C/p\u003E\n"}]}