{"TopicId":85157,"ForumId":20,"TopicTitle":"Automated Vector Control System (Sci-fi-ish space maneuvering)","CreatedByName":"Patrick Kerbivan","CreatedById":114804,"CreatedDateTime":"2014-09-21T20:00:00Z","PageNum":1,"Articles":[{"CreatedByName":"Patrick Kerbivan","CreatedById":114804,"CreatedDateTime":"2014-09-21T20:00:00Z","Content":"\n\u003Cp\u003EWhile there are plenty of mods that add various science-fiction-styled parts, I haven\u0027t seen anything to enable maneuvering in space as it is often depicted in science fiction. In most popular sci-fi settings when a ship thrusts in a certain direction it\u0027s as if its previous inertia is negated or redirected, allowing the ship to gracefully weave between objects by simply maintaining a heading towards the point in space it wishes to pass through. As we all know from experience it works nothing like this in reality (or KSP, at least). The best way to illustrate it I could come up with was this lovely little mspaint number here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2uTgZ11.png\u0022 alt=\u00222uTgZ11.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat I\u0027d like to see is a mod that enables sci-fi style spaceflight to go along with the various sci-fi style parts that have been added by numerous mods. One of the main concepts I think would be necessary for this to not be completely absurd would be specifically managing a relative vector; putting it in KSP terms, this would keep your velocity relative to a target aligned with your current heading.\u003C/p\u003E\u003Cp\u003EThe more realistic option I can think of would be to just have a toggled flight control plugin that automatically uses RCS thrust to correct your relative velocity while maintaining your heading. This correction would almost certainly not be instantaneous, but could allow for some fun \u0022drifting\u0022 maneuvers. It would probably be impractical for larger vessels unless you coated the body of the craft in vernor engines.\u003C/p\u003E\u003Cp\u003EThe more sci-fi option, which could potentially be made to work for a vessel of any size, would be an actual \u0022inertial redirection module\u0022 of some sort. I would imagine this to be something that consumes large amounts of electricity, with consumption scaled to vessel mass or applied force if possible, to automatically and near-instantaneously apply the necessary thrust to redirect your current relative velocity into line with your heading.\u003C/p\u003E\u003Cp\u003EIn both cases it would probably need some protection mechanism that only enables use of the system when dealing with another craft, asteroid, or similar object. Trying to change your velocity relative to a planet would probably be futile with the RCS option, and should likely tear apart your ship with the sci-fi option. I suppose an absolute behemoth of a spacecraft (I\u0027m looking at you, B9 builders) would potentially turn so slowly that the forces entailed in keeping its orbital inertia in line with its heading wouldn\u0027t necessarily snap it in half though.\u003C/p\u003E\u003Cp\u003EAnyway, a last bonus feature would be something like \u0022space brakes\u0022, which would just be an option built into the system to automatically apply thrust as necessary to slow or even stop your craft (again, relative to a designated target) when the throttle is set to zero.\u003C/p\u003E\u003Cp\u003EThoughts?\u003C/p\u003E\n"},{"CreatedByName":"Exerminator2000","CreatedById":60784,"CreatedDateTime":"2014-09-21T20:02:26Z","Content":"\n\u003Cp\u003Eseems like a good idea\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-09-21T21:57:43Z","Content":"\n\u003Cp\u003EMaking this would be fairly simple, but I fail to see what purpose it would have. Any maneuver you would perform would be amazingly inefficient (a 90 degree turn at 1000m/s would require 2000m/s of DV) so it would have to either utilize tremendously overpowered mechanics or be useless.\u003C/p\u003E\n"},{"CreatedByName":"Patrick Kerbivan","CreatedById":114804,"CreatedDateTime":"2014-09-21T23:29:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xaiier\u0022 data-cite=\u0022Xaiier\u0022\u003E\u003Cdiv\u003EMaking this would be fairly simple, but I fail to see what purpose it would have. Any maneuver you would perform would be amazingly inefficient (a 90 degree turn at 1000m/s would require 2000m/s of DV) so it would have to either utilize tremendously overpowered mechanics or be useless.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why I was talking about just dealing in velocities relative to local targets like other craft, stations, and asteroids. Trying to use something like this to change your velocity relative to a large orbital body like Kerbin would indeed be a bit nuts. This is a \u0022for fun\u0022 idea, intended for the players who might like to treat KSP more like a sci-fi building set than a realistic spaceflight simulator (and who are likely already using some of those tremendously overpowered mechanics you mentioned as introduced by other sci-fi themed mods).\u003C/p\u003E\n"},{"CreatedByName":"Darth Jeb","CreatedById":160009,"CreatedDateTime":"2016-07-29T16:57:57Z","Content":"\n\u003Cp\u003E\nI would surely support the development of this kind of mod.\n\u003C/p\u003E\n\u003Cp\u003E\nAt least it will be useful to me for making ksp battle or other stunt videos in space that involve many crafts.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease make one !\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-08T09:13:35Z\u0022 title=\u002210/08/2016 09:13  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 8, 2016\u003C/time\u003E by Darth Jeb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2016-07-29T17:29:33Z","Content":"\n\u003Cp\u003E\nMight be handy as a \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E mode - anything more than that would need a gimballing cockpit so the entire rest of the ship can thrust in the necessary direction...\n\u003C/p\u003E\n\u003Cp\u003E\nIncidentally Babylon 5 had proper newtonian physics for battle scenes, I vaguely recall? I haven\u0027t seen it since the 90s.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-29T17:30:48Z\u0022 title=\u002207/29/2016 05:30  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 29, 2016\u003C/time\u003E by Van Disaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tyko","CreatedById":164179,"CreatedDateTime":"2016-08-02T18:58:06Z","Content":"\n\u003Cp\u003E\nIs the \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E asking for a flight computer connected with very powerful \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to emulate \u0022star wars\u0022 or \u0022biplane\u0022 style flight or is this a request to actually break the physics system to enable \u0022un-realistic\u0022 flight models? If you\u0027re not breaking the physics model, then it would quickly become apparent why \u0022real\u0022 spacecraft won\u0027t fly like atmospheric craft do - it\u0027s just crazy DeltaV hungry.\n\u003C/p\u003E\n\u003Cp\u003E\nIMHO, most movies use \u0022star wars\u0022 style flight models because they made for a movie experience that non-technical viewers would understand. There are many games out there that let you fly spacecraft like atmospheric aircraft. One of the reasons I went to KSP was that I wanted to learn how to fly \u0022real\u0022 spacecraft and because of that I\u0027d be opposed to anything that breaks the physics model.\n\u003C/p\u003E\n"}]}