{"TopicId":85633,"ForumId":20,"TopicTitle":"Group modules into sub-directory and select group on Start","CreatedByName":"greghacke","CreatedById":123681,"CreatedDateTime":"2014-09-28T19:26:50Z","PageNum":1,"Articles":[{"CreatedByName":"greghacke","CreatedById":123681,"CreatedDateTime":"2014-09-28T19:26:50Z","Content":"\n\u003Cp\u003EWhat I would like to see...\u003C/p\u003E\u003Cp\u003E./gamedata/\u0026lt;mods\u0026gt; gathered into compressed folders called for example ./gamedata/interstellar.zip and ./gamedata/research.zip\u003C/p\u003E\u003Cp\u003EAt launch, flag the launch with a startup commend such as \u003Cem\u003Eksp -mods research.zip\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ENow, I can play my interstellar mods, research games, etc. with only the mods I run for that iteration.\u003C/p\u003E\u003Cp\u003EThoughts? I am willing to state that Squad would need to enable the \u003Cem\u003E-mods\u003C/em\u003E command but gathering and compressing with the ability to dynamically release would rock.\u003C/p\u003E\u003Cp\u003EP.71\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-09-28T23:07:34Z","Content":"\n\u003Cp\u003EWhilst an in-game add-on manager to select which add-ons are used per savegame might be handy, I strongly dislike the idea of isolating add-on within zip folders. This is because many add-ons now use ModuleManager to directly modify/patch other add-ons, and having separate zip folders for each add-on would interfere with this process.\u003C/p\u003E\u003Cp\u003EFor instance, in the current system, my FusTek Station Parts keeps an eye out to see if TAC Life Support is enabled, and if so, automatically patches my station parts pack to add life support resources like food and water. Other add-ons may override the default textures on my station parts, or maybe even prevent certain FusTek parts from being used in a savegame altogether (for justifiable reasons). If FusTek and TAC Life Support were crammed inside their own zip archives, they won\u0027t be able to \u0022talk\u0022 to each other and apply the necessary patches.\u003C/p\u003E\u003Cp\u003EDynamically compressing and uncompressing add-on archives have been done in other games, but would require a complete rewrite of KSP\u0027s add-ons and assemblies loader, which would cause many problems for add-on authors and offer very little advantages to add-on users.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-09-28T23:42:53Z","Content":"\n\u003Cp\u003Etry this: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94426-0-24-2-Addon-Controller-Toggle-addons-and-parts-on-off-for-individual-saves\u0022 rel=\u0022external nofollow\u0022\u003EAddon Controller - Toggle addons and parts for individual saves - Now with UI\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2014-09-28T23:50:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaiiden\u0022 data-cite=\u0022Gaiiden\u0022\u003E\u003Cdiv\u003Etry this: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/94426-0-24-2-Addon-Controller-Toggle-addons-and-parts-on-off-for-individual-saves\u0022 rel=\u0022external nofollow\u0022\u003EAddon Controller - Toggle addons and parts for individual saves - Now with UI\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, this looks like it would fit the OP\u0027s main request, but without the hokey archiving of add-ons.\u003C/p\u003E\n"}]}