{"TopicId":88409,"ForumId":20,"TopicTitle":"Realism Overhaul Discussion Thread","CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-10-24T20:08:23Z","PageNum":4,"Articles":[{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-11-09T04:25:08Z","Content":"\n\u003Cp\u003ENathanKell the man with all the answers \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-11-09T06:36:08Z","Content":"\n\u003Cp\u003EIs there a way to make a tank cryogenic so fuel doesn\u0027t boil away over time? I know the procedural tanks have a cryo variant, but I designed a probe around a NearFuture structural tank and an Aerojet tank. Not long after exiting Earth\u0027s SOI I just noticed all my liquid hydrogen and oxygen was gone. So before I redesign the whole thing is there a simple way to edit these tanks for such a task?\u003C/p\u003E\u003Cp\u003EI found a \u003C/p\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E name = ModuleFuelTanks\u003C/p\u003E\u003Cp\u003E volume = 8000\u003C/p\u003E\u003Cp\u003E type = Cryogenic\u003C/p\u003E\u003Cp\u003Ein the ProceduralParts deprecated folder. If I paste that into the tanks cfg will it become cryogenic by chance?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-09T06:44:06Z\u0022 title=\u002211/09/2014 06:44  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 9, 2014\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Phredward","CreatedById":100166,"CreatedDateTime":"2014-11-09T16:16:28Z","Content":"\n\u003Cp\u003EThe method I\u0027ve used for now is to attach radiator fins to the tank you want to keep cool. One or two have done a good job at keeping all but the largest tanks at 0 boiloff, even for hydrogen. They will use a log of electricity.\u003C/p\u003E\u003Cp\u003EIf you want to go forward with an existing mission, the thing that worked for me was spending most of the mission time not focused on the vehicle with cryogenic fuels, as boiloff doesn\u0027t happen when you\u0027re not flying that craft.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-11-09T16:22:54Z","Content":"\n\u003Cp\u003EThe radiators from NearFuture? Ill give that a try, thanks Phredward.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-11-09T21:11:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Phredward\u0022 data-cite=\u0022Phredward\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf you want to go forward with an existing mission, the thing that worked for me was spending most of the mission time not focused on the vehicle with cryogenic fuels, as boiloff doesn\u0027t happen when you\u0027re not flying that craft.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know that may be the only way to do it right now but isn\u0027t that (not exactly I know) cheating? tongue in cheek don\u0027t take me serious. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Phredward","CreatedById":100166,"CreatedDateTime":"2014-11-09T23:40:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mcirish3\u0022 data-cite=\u0022mcirish3\u0022\u003E\u003Cdiv\u003EI know that may be the only way to do it right now but isn\u0027t that (not exactly I know) cheating? tongue in cheek don\u0027t take me serious. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, totally. Before I found out about the radiators, but still wanted to use Hydrolox, I counted it as the only way.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-09T23:52:53Z","Content":"\n\u003Cp\u003EStrange, that sounds like a bug. It should occur for unloaded vessels too.\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2014-11-10T00:58:22Z","Content":"\n\u003Cp\u003EIs there any way to fix the sensitivity/precision required for docking ports? I finally got a good dock and had to actively fight the magnetic pull between the ports via RCS to get the relative velocities to 0.0 before the ports would finally stick together. (Not sure if this is new with .25 or if it\u0027s just the FASA ports, but it was really super hard since the bounding from the magnetic pull keeps the ports from docking if you don\u0027t intervene manually.)\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-11-10T01:09:04Z","Content":"\n\u003Cp\u003EHonestly I wish the magnetic pull could be done away with entirely and replaced with a locking-pressurizing sound. I don\u0027t find it necessary what so ever.. even in stock ksp.\u003C/p\u003E\u003Cp\u003EJrandom what do you mean when you say you have to fight the magnetic pull? Like when the two craft wobble back and forth trying to complete the dock? Or when it pulls you in initially? I always dock at the slowest speed possible. And once I suddenly start to see the magnets pull me in I brake to slow just before the ports make contact.\u003C/p\u003E\u003Cp\u003EPS: So I tried the NearFuture and the external thermal fin radiators... No effect. I\u0027m still loosing fuel at a crippling rate. What radiator is Phredward referring too exactly?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-10T01:41:07Z\u0022 title=\u002211/10/2014 01:41  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 10, 2014\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2014-11-10T01:43:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EJrandom what do you mean when you say you have to fight the magnetic pull? Like when the two craft wobble back and forth trying to complete the dock? Or when it pulls you in initially? I always dock at the slowest speed possible. And once I suddenly start to see the magnets pull me in I brake to slow just before the ports make contact.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2014-11-10T02:32:12Z","Content":"\n\u003Cp\u003EAre there any plans for engines designed for the upscaled SP\u002B parts? I can use a procedural structural part to make adapters, but it still looks kinda funny. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-11-11T01:54:53Z","Content":"\n\u003Cp\u003ESo even after I redesigned my probe with procedural cryo tanks.. im still getting excessive boil off. And what radiotors are there other then NearFuture and the thermal fin?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-11T02:38:27Z","Content":"\n\u003Cp\u003EThe thermal fin is, IIRC, the only radiator part that works as a heat pump. But note that right now and in the past (AFAIK) *no* probes use even mildly cryogenic (like LOX) propellants. Certainly not LH2. There are lots of ideas for how to have massive refrigeration for cryogenic stages, but that\u0027s certainly not probe-sized stages anyway.\u003C/p\u003E\u003Cp\u003Ejrandom: engines like what?\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2014-11-11T03:09:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003Ejrandom: engines like what?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you put jet engines on the back of the upscaled SP\u002B bicoupler... well, they don\u0027t exactly fit as the engines are designed to match the size of the non-RO-scaled parts. I was just curious if there were plans in the works for engines with a matching scale.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-11-11T03:19:15Z","Content":"\n\u003Cp\u003EHm.. thanks Nathan I suppose I\u0027ll have to change engines and fuel. I was getting great Dv with LH2/LOX.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-11-11T04:08:24Z","Content":"\n\u003Cp\u003Ejrandom: the engines are designed to be their actual size. F100s and J58s just happen to very close to that diameter IIRC.\u003C/p\u003E\n"},{"CreatedByName":"JRA","CreatedById":121964,"CreatedDateTime":"2014-11-11T22:33:49Z","Content":"\n\u003Cp\u003EProblem: The link in the first post to the overhaul thread, where you can get all the mods, links to a thread that is closed. RedAv8r closed it today? \u003C/p\u003E\u003Cp\u003EThis thread says go there for the d/l and that thread links back to here, where there are no d/l. Is this mod dead now? That would be a huge bummer. \u003C/p\u003E\u003Cp\u003EI have become quite good at stock KSP and was going to d/l this suite of mods to try and up the challenge. Anyway, I will check back here to see if Realism Overhaul is dead or not.\u003C/p\u003E\u003Cp\u003ERegards\u003C/p\u003E\n"},{"CreatedByName":"TeeGee","CreatedById":82434,"CreatedDateTime":"2014-11-11T22:49:32Z","Content":"\n\u003Cp\u003ESo this mod is no more? Wow. I\u0027d first like to thank Red and Nathan for doing a fantastic job with this mod and I am very sad to see it go. You guys/gals are amazing and a huge part of what makes KSP so great! Best wishes and good luck!\u003C/p\u003E\n"},{"CreatedByName":"jrandom","CreatedById":74522,"CreatedDateTime":"2014-11-11T22:54:52Z","Content":"\n\u003Cp\u003ELooks like RealismOverhaul \u003Ca href=\u0022https://github.com/KSP-RO/RealismOverhaul\u0022 rel=\u0022external nofollow\u0022\u003Eis still up on github\u003C/a\u003E. Hoping that doesn\u0027t get pulled, and I really don\u0027t understand all this tantrum throwing. It\u0027s ridiculous.\u003C/p\u003E\u003Cp\u003EEdit: In case it \u003Cem\u003Edoes\u003C/em\u003E get pulled from GitHub, \u003Ca href=\u0022https://github.com/jrandom/RealismOverhaul\u0022 rel=\u0022external nofollow\u0022\u003EI\u0027ve created a backup fork\u003C/a\u003E of it in its current state here as a contingency plan.\u003C/p\u003E\n"},{"CreatedByName":"Felger","CreatedById":76828,"CreatedDateTime":"2014-11-11T23:37:29Z","Content":"\n\u003Cp\u003EI\u0027ve got one as well, just in case, as does NathanKell I\u0027m sure. Hopefully it doesn\u0027t come down to that.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2014-11-12T00:50:51Z","Content":"\n\u003Cp\u003EWell.. that\u0027s ashame. Did it really come down to just a few people to spoil the fun for everyone else? I\u0027m going to hold onto my RSS install as long as I can in the meantime. This is how I want to play KSP. Nathan... I\u0027d like to ask if its not too personal.. how overwhelmed are you? I\u0027ve been on this forum long enough to see alot of mods drop to the floor only for you to pick them up. You are involved with nearly every major project this community has going on. I can only imagine how exhausting that may be.. And above all I\u0027d hate to see it spoil the game for you. I\u0027d offer my help. I would, but I do not have any coding expertise. So for what it counts if there is anything a user with mildly above average computer skills can do.. you let me know. Let ALL of us know. Because I feel that\u0027s what it\u0027s going to take to keep RO up and running.\u003C/p\u003E\n"},{"CreatedByName":"RedAV8R","CreatedById":94171,"CreatedDateTime":"2014-11-12T00:55:01Z","Content":"\n\u003Cp\u003ERealism Overhaul is alive. It\u0027s NKs. I imagine a new thread or old thread will be activated soon.\u003C/p\u003E\u003Cp\u003EI\u0027m simply removing myself from the community as a whole.\u003C/p\u003E\u003Cp\u003EThere is a reason why the title to the thread is \u0022RealismOverhaul w/RedAV8R\u0022\u003C/p\u003E\n"},{"CreatedByName":"Felger","CreatedById":76828,"CreatedDateTime":"2014-11-12T01:01:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EWell.. that\u0027s ashame. Did it really come down to just a few people to spoil the fun for everyone else? I\u0027m going to hold onto my RSS install as long as I can in the meantime. This is how I want to play KSP. Nathan... I\u0027d like to ask if its not too personal.. how overwhelmed are you? I\u0027ve been on this forum long enough to see alot of mods drop to the floor only for you to pick them up. You are involved with nearly every major project this community has going on. I can only imagine how exhausting that may be.. And above all I\u0027d hate to see it spoil the game for you. I\u0027d offer my help. I would, but I do not have any coding expertise. So for what it counts if there is anything a user with mildly above average computer skills can do.. you let me know. Let ALL of us know. Because I feel that\u0027s what it\u0027s going to take to keep RO up and running.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo be honest, everyone starts out with no programming skills. Hard to come out of the womb with \u0027em. There really is only one way to get programming skills, and that\u0027s to start doing it.\u003C/p\u003E\u003Cp\u003EAll that\u0027s beside the point, since Realism Overhaul is mostly not-programming. It\u0027s mostly creating and updating config files for parts so they\u0027re realistic. So if you\u0027re good at looking up spacecraft parts, and finding parts in mods that look like real life parts, or even if you\u0027d like to try becoming good at looking up spacecraft parts, etc, you should help out!\u003C/p\u003E\u003Cp\u003EIt really isn\u0027t too hard, and there\u0027s a whole community of people who are more than willing to help you out with that stuff.\u003C/p\u003E\n"},{"CreatedByName":"samroberts","CreatedById":114268,"CreatedDateTime":"2014-11-12T02:39:36Z","Content":"\n\u003Cp\u003EI would like to help in anyway possible, I can\u0027t program but the way Felger makes it sound I don\u0027t really need to. If there is anyway I can help with looking things up or changing configs left me know. Also what is the future of getting help with bugs and such for this mod? I am aware for mods like RSS to go to that thread but what about here?\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-11-12T03:33:43Z","Content":"\n\u003Cp\u003EWell it is good to hear that NK will be picking it up. I may actually update my RO install sometime this year.\u003C/p\u003E\n"}]}