{"TopicId":89052,"ForumId":20,"TopicTitle":"Discussion regarding unathorised forks of mods and their distribution","CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-10-31T15:01:12Z","PageNum":4,"Articles":[{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-11-02T12:06:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mcirish3\u0022 data-cite=\u0022mcirish3\u0022\u003E\u003Cdiv\u003EI am glad that Senshi has made these mods available to me again. I am very disappointed that it became necessary for him to do so.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt didn\u0027t. The thing is the authors didn\u0027t forbid or prevent us from using their mods in x64 but rather made it more difficult. It takes \u003Cem\u003Ebasic\u003C/em\u003E skills to remove the protection but people who do so are less expected to do irrational things like begging for support. If my mod thread was flooded by senseless begging or even threats ordering me what to do I\u0027d not only do the same but probably make the protection even more severe and change my license.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-11-02T14:15:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theend3r\u0022 data-cite=\u0022theend3r\u0022\u003E\u003Cdiv\u003EIt takes \u003Cem\u003Ebasic\u003C/em\u003E skills to remove the protection but people who do so are less expected to do irrational things like begging for support.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it doesn\u0027t. Recompiling a plugin for KSP is harder than just finding and tweaking the offending code. You have to set up a compiler (not everyone has one handy) and configure it to work with Unity. Those are \u003Cem\u003Enot \u003C/em\u003Ebasic skills, figuring out how to make KSP plugins takes time. Besides, not everyone wants to install a rather large piece of software like Visual Studio just to fix what shouldn\u0027t have been broken in first place. What Senshi did was by all means necessary.\u003C/p\u003E\u003Cp\u003EStupid requests should simply be ignored, and threats reported to mods. This is what any reasonable person would\u0027ve done. Restrictive licenses and \u0022protection\u0022 are BS that only harms legitimate users. The proper response is to \u003Cem\u003Egrow up and deal with it. \u003C/em\u003EIf you can\u0027t handle a few ungrateful idiots, good luck doing anything IRL. I support every effort to remove pointless restrictions, circumvent region-locking and such. 64bit restriction in KSP is no different.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T14:19:39Z\u0022 title=\u002211/02/2014 02:19  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-11-02T14:29:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theend3r\u0022 data-cite=\u0022theend3r\u0022\u003E\u003Cdiv\u003EIt didn\u0027t. The thing is the authors didn\u0027t forbid or prevent us from using their mods in x64 but rather made it more difficult. It takes \u003Cem\u003Ebasic\u003C/em\u003E skills to remove the protection but people who do so are less expected to do irrational things like begging for support. If my mod thread was flooded by senseless begging or even threats ordering me what to do I\u0027d not only do the same but probably make the protection even more severe and change my license.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou just pulled out my one comment that used the common literary device known as Hyperbole. \u003Ca href=\u0022https://en.wikipedia.org/wiki/Hyperbole\u0022 rel=\u0022external nofollow\u0022\u003EHere educate yourself.\u003C/a\u003E If you read my comment you would see I fully understand what the mod makers experienced, and that I also understand that policy they put in place was necessary but also harmed community members not responsible for the mess and did not contribute to it. Senchi was and is trying to solve the problem in a way that will be equitable for all involved. Perhaps it won\u0027t work. In which case I will probably try and find a tutorial on how to mod the code myself. But for those of us who are not experience with coding, or have lives outside of gaming is was a godsend and we are very grateful to Senshi for his assistance.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-11-02T14:41:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003ENo, it doesn\u0027t. Recompiling a plugin for KSP is harder than just finding and tweaking the offending code. You have to set up a compiler (not everyone has one handy) and configure it to work with Unity. Those are \u003Cem\u003Enot \u003C/em\u003Ebasic skills, figuring out how to make KSP plugins takes time. Besides, not everyone wants to install a rather large piece of software like Visual Studio just to fix what shouldn\u0027t have been broken in first place. What Senshi did was by all means necessary.\u003Cp\u003EStupid requests should simply be ignored, and threats reported to mods. This is what any reasonable person would\u0027ve done. Restrictive licenses and \u0022protection\u0022 are BS that only harms legitimate users. The proper response is to \u003Cem\u003Egrow up and deal with it. \u003C/em\u003EIf you can\u0027t handle a few ungrateful idiots, good luck doing anything IRL. I support every effort to remove pointless restrictions, circumvent region-locking and such. 64bit restriction in KSP is no different.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree, (least reading my comment you think I don\u0027t) with all you just said except the actual necessity part, but there is a very large hurdle to overcome, as you rightly pointed out, without Senshi\u0027s help. One thing that has frustrated many is the assumption if you don\u0027t know how to compile the source code you must be one of those who will come running and complaining to the mode makers to fix the problem. This is a false dichotomy, that states if you are not one then you are the other. It leave no room for a middle ground which in this case is where most people actually fall. They know that they should not ask the mod maker for help and don\u0027t blame them for not helping but also do not have the experience and skills to edit and compile the source code. Senshi realized this and stepped in to help out. I am not sure why this is so hard to understand, or is it that many vocal members of the community have bought into this false dichotomy, including some of the mod makers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T14:50:13Z\u0022 title=\u002211/02/2014 02:50  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by mcirish3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-11-02T14:48:44Z","Content":"\n\u003Cp\u003EWell at least this thread is making it really easy for me to see who not to provide support to \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-02T14:55:41Z","Content":"\n\u003Cp\u003ESame for me\u003C/p\u003E\n"},{"CreatedByName":"tecknobabble","CreatedById":60262,"CreatedDateTime":"2014-11-02T15:05:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mcirish3\u0022 data-cite=\u0022mcirish3\u0022\u003E\u003Cdiv\u003EAs a member of this community who has been here far longer than most... longer than all but a few. I find this whole thing rather confusing. I don\u0027t comment often, and really, I guess, I missed the tempest in a teapot that has been happening ever since x64KSP came out. Early on I probably made one or two post about a mod I was using in winx64 not working. But it did not take me more that 5 days to realize that it was not the mod that was broken but winx64. So I simply stop reporting bugs when I ran winx64 KSP. Afterall Squad said it was experimental, and the mod makers said it was not something they could fix. So if I ran a mod and it broke my game I uninstalled it and did not use it. Afterall if I really must have that mod I could always instal x86 KSP.\u003Cp\u003E In any case I was a little surprised when 0.25 came out that most of the major mods had blocked x64KSP from running their mod, since I figured most reasonable people had come to the same realization I had come to. I am rather SHOCKED and disappointed that it has all come to such harsh exchanges when all that was necessary is a little common sense. I am glad that Senshi has made these mods available to me again. I am very disappointed that it became necessary for him to do so. I am sure many of the mod makers feel exactly like I felt today when my 4 year old complained to me that the cookie I gave her was not a kind she prefered. You should be thanking them for all their hard work, not jumping down their throat if everything isn\u0027t perfect, after all you did not pay them, they owe you nothing, and they did their work for love of the game.\u003C/p\u003E\u003Cp\u003E That said, the removal of the x64 support felt like I was getting punished for something I did not do. I know that was not their intent but it was a consequence. I dont know what the solution is, since if people can\u0027t act like adult, then what choice do they have.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis pretty much sums up how I feel about this issue, thank you for saving me from having to articulate it myself. My experience under x64 has been relatively trouble free, certainly no worse than with x86, and unfortunately because of this schism I\u0027ve been playing it less because mods I used, enjoyed and relied on have been blocked from my environment of choice. Not sure I am going to take any side, I\u0027m more likely to devote my time to something less fractious instead and see if things improve with later releases.\u003C/p\u003E\n"},{"CreatedByName":"ShredLikeTed","CreatedById":127035,"CreatedDateTime":"2014-11-02T15:07:04Z","Content":"\n\u003Cp\u003EAlthough i can see where everyone is coming from on both sides i feel that this might lead to problems down the road. i feel that it will set a dangerous precedent for \u0022its legal so i can\u0022 attitude. what the whole discussion is about here is farrem allowing but not blessing this fork. so what we have is really no argument. for now they allow it. the problem that can arise though is the pushing of this line. i worry that next time it will involve someone pushing the boundary, I.E. just going ahead and publishing their fork. what we have now is a nice mod publishing community that is generally considerate, i feel that once people start just publishing forks that are legal but with out the blessing of the mod creator will create deeply rooted resentment and lead to restrictive licenses and at worst dropped support for mods. i really hope that everyone can look at this and try to moderate themselves as to never let this happen.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-11-02T15:16:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EWell at least this thread is making it really easy for me to see who not to provide support to \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003ESame for me\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm...what do you mean? Do you mean to say you wont provide support for anyone who said something you disagree with in the thread? Do you mean to say that if any one admits that they have at one time used x64 KSP you will refuse to provide support even if they have an issue with win32 KSP? What exactly is the point of these comments? Are you trying to derail a reasonable discussion and turn it into a inflammatory \u0022bash the mod makers\u0022 discussion? Or do you indeed buy into the false dichotomy I spoke of earlier? I am not sure what these comments contribute to the discussion and would ask the moderator to remove them.\u003C/p\u003E\n"},{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-11-02T15:29:26Z","Content":"\n\u003Cp\u003EI\u0027m going to throw my support behind Senshi on this one. He made his intentions crystal clear, and has been nothing but respectful about it. That doesn\u0027t mean I hate mod authors or spit on their work. Far from it. Without their mods, I would have given up on KSP a long time ago. If they want to blacklist me for having fun on my own computer in a manner they don\u0027t approve of, then so be it. I\u0027ll always be grateful for your efforts, even when I\u0027m too dumb to figure it out right away, but I simply will not take the time to coddle full grown men.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T15:31:34Z\u0022 title=\u002211/02/2014 03:31  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by Voculus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-11-02T15:30:22Z","Content":"\n\u003Cp\u003EPlease explain why a moderator should remove them? They are simple facts. Unpleasant ones, but simple. Please let me know what forum rule I have violated? \u003C/p\u003E\u003Cp\u003EI provide stuff for free, because in general I try to be nice. The awesome bit about this is that I am under no obligation to support what I provide. I do so because people are polite, and generally enjoy the stuff I make. So I will happily answer questions and provide support to people who are nice. And people who understand the difference between something being legal and something being right. And for those that can\u0027t grasp that, I expect they can find their own way around support, simple as that. I am under no obligation to help them, so I won\u0027t.\u003C/p\u003E\u003Cp\u003EThis thread (and others like it) is simply making the task of identifying these folks a lot easier, so for me it\u0027s proven to be a valuable tool. (Edit for clarity) - Dismissing support because of a worldview would be silly. Dismissing support because people are downright unpleasant, now that\u0027s a different kettle of fish. And these issues are doing an excellent job of sussing out the latter sub-group.\u003C/p\u003E\u003Cp\u003ESo to put it a different way, I choose WHO I support. And that\u0027s 99.99% of the KSP player base. Though I expect before this is all through that number will be more like 99.96% \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T15:32:23Z\u0022 title=\u002211/02/2014 03:32  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by RoverDude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2014-11-02T15:35:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mcirish3\u0022 data-cite=\u0022mcirish3\u0022\u003E\u003Cdiv\u003EHmm...what do you mean? Do you mean to say you wont provide support for anyone who said something you disagree with in the thread? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is something I have every right to do. I\u0027m not squad, I did not sell any one anything. \u003C/p\u003E\u003Cp\u003ESome said that we should choose our license better and not complain after. As stated before they are legally right but that does not make it a good thing.\u003C/p\u003E\u003Cp\u003EI agree with your comments about how this came to be but I\u0027ll handle it however I want to.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-11-02T15:54:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EPlease explain why a moderator should remove them? They are simple facts. Unpleasant ones, but simple. Please let me know what forum rule I have violated? \u003Cp\u003EI provide stuff for free, because in general I try to be nice. The awesome bit about this is that I am under no obligation to support what I provide. I do so because people are polite, and generally enjoy the stuff I make. So I will happily answer questions and provide support to people who are nice. And people who understand the difference between something being legal and something being right. And for those that can\u0027t grasp that, I expect they can find their own way around support, simple as that. I am under no obligation to help them, so I won\u0027t.\u003C/p\u003E\u003Cp\u003EThis thread (and others like it) is simply making the task of identifying these folks a lot easier, so for me it\u0027s proven to be a valuable tool. (Edit for clarity) - Dismissing support because of a worldview would be silly. Dismissing support because people are downright unpleasant, now that\u0027s a different kettle of fish. And these issues are doing an excellent job of sussing out the latter sub-group.\u003C/p\u003E\u003Cp\u003ESo to put it a different way, I choose WHO I support. And that\u0027s 99.99% of the KSP player base. Though I expect before this is all through that number will be more like 99.96% \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E I suggested that the moderator remove them not because they violated a form rule per se but because the vagueness of your comment can lead others to jump to conclusions which made your comment rather trollish and violates the spirit of the form rules rather than the letter. If you want people to do what is right rather than what is legal then please consider that when making a comment. Remember talk is cheep leading by example in what you say would be better. You have partially explained yourself which is better. However you still express a certain disdain for a rather vague group. Who do you consider impolite? Only those who you disagree with? A large set? a Smaller set? We all appreciate what you and the other mod makers do, as I have express more than once, and most reasonable people know that you do not owe us anything since you and the other mod makers make for love of the game. But there is a certain fair treatment which we all would at least hope a mod maker would exhibit when dealing with issues even if you are not obliged to do so. Again, leading by example and doing what is right is better that what is required.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T16:03:58Z\u0022 title=\u002211/02/2014 04:03  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by mcirish3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-11-02T16:10:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003ENo, it doesn\u0027t. Recompiling a plugin for KSP is harder than just finding and tweaking the offending code. You have to set up a compiler (not everyone has one handy) and configure it to work with Unity. Those are \u003Cem\u003Enot \u003C/em\u003Ebasic skills, figuring out how to make KSP plugins takes time. Besides, not everyone wants to install a rather large piece of software like Visual Studio just to fix what shouldn\u0027t have been broken in first place. What Senshi did was by all means necessary.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t need to recompile anything, you can just edit the dll with Reflector or something.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EStupid requests should simply be ignored, and threats reported to mods. This is what any reasonable person would\u0027ve done. Restrictive licenses and \u0022protection\u0022 are BS that only harms legitimate users. The proper response is to \u003Cem\u003Egrow up and deal with it. \u003C/em\u003EIf you can\u0027t handle a few ungrateful idiots, good luck doing anything IRL. I support every effort to remove pointless restrictions, circumvent region-locking and such. 64bit restriction in KSP is no different.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree that ignoring and reporting to mods would be for the best if the posts were few and far between which wasn\u0027t the case. We are not entitled to anything and the modders could just stop publishing their mods if they wanted, they aren\u0027t getting paid.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-11-02T16:16:56Z","Content":"\n\u003Cp\u003E\u0022But there is a certain fair treatment which we all would at least hope a mod maker would exhibit when dealing with issues even if you are not obliged to do so. \u0022\u003C/p\u003E\u003Cp\u003EI find this statement ironic, since it\u0027s the very core of the issue, just swap the roles.\u003C/p\u003E\u003Cp\u003ETo be honest, we\u0027re beating a dead horse here. People are not going to change their world views, and no amount of words on either side is going to convince someone to be more or less pleasant, or to have more or less respect for the work of others. They should just be prepared for the consequences of being unpleasant. Nothing more, nothing less. And in the end, it makes my job easier because I only have to support folks who are nice. Those who are not nice, get to go find other mods, or make their own.\u003C/p\u003E\u003Cp\u003EAnd to be honest, I really should not have to explain what polite behavior is, nor am I under any obligation to do so - because there\u0027s really no value in me attempting to educate people on social contracts if they already have no intention of observing them. It\u0027s not unlike teaching a pig to dance. It only leads to frustration for both you and the pig.\u003C/p\u003E\u003Cp\u003E(Edit)\u003C/p\u003E\u003Cp\u003ELet us put it a different way. I make a mod first for myself, second for my friends, and third, for people who I find to be pleasant. I am under no obligation to be all-inclusive in this. Just as, if I host a block party, and someone comes over (an acquaintance of an acquaintance perhaps) and decides to smash my windows and drink all of the beer, I am under no obligation to provide them more beer. I can\u0027t kick them out (it\u0027s a public street), but I certainly don\u0027t want them to get the idea that they are welcome either \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T16:21:32Z\u0022 title=\u002211/02/2014 04:21  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by RoverDude\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2014-11-02T16:33:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003E\u0022But there is a certain fair treatment which we all would at least hope a mod maker would exhibit when dealing with issues even if you are not obliged to do so. \u0022\u003Cp\u003EI find this statement ironic, since it\u0027s the very core of the issue, just swap the roles.\u003C/p\u003E\u003Cp\u003ETo be honest, we\u0027re beating a dead horse here. People are not going to change their world views, and no amount of words on either side is going to convince someone to be more or less pleasant, or to have more or less respect for the work of others. They should just be prepared for the consequences of being unpleasant. Nothing more, nothing less. And in the end, it makes my job easier because I only have to support folks who are nice. Those who are not nice, get to go find other mods, or make their own.\u003C/p\u003E\u003Cp\u003EAnd to be honest, I really should not have to explain what polite behavior is, nor am I under any obligation to do so - because there\u0027s really no value in me attempting to educate people on social contracts if they already have no intention of observing them. It\u0027s not unlike teaching a pig to dance. It only leads to frustration for both you and the pig.\u003C/p\u003E\u003Cp\u003E(Edit)\u003C/p\u003E\u003Cp\u003ELet us put it a different way. I make a mod first for myself, second for my friends, and third, for people who I find to be pleasant. I am under no obligation to be all-inclusive in this. Just as, if I host a block party, and someone comes over (an acquaintance of an acquaintance perhaps) and decides to smash my windows and drink all of the beer, I am under no obligation to provide them more beer. I can\u0027t kick them out (it\u0027s a public street), but I certainly don\u0027t want them to get the idea that they are welcome either \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m glad that you\u0027re taking some of this recent drama in stride like that. It\u0027s not hard to get the vibe from some authors that they\u0027re just about fed up with some of this recent behavior and that if it keeps up, they might just be done entirely. And thanks for all your awesome work, as an aside. \u003C/p\u003E\u003Cp\u003EIt\u0027s amusing that such a straight forward statement of yours is being accused of trolling.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-11-02T16:54:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022undercoveryankee\u0022 data-cite=\u0022undercoveryankee\u0022\u003E\u003Cdiv\u003EEven if the license allows a fork without individual permission, I would recommend that if the upstream author asks you to give your fork a different title, you do so whether the license requires it or not. If we can make a habit of giving each other a little extra courtesy in areas where it\u0027s hard to write a bright-line legal rule, it becomes an easier decision for authors to put new code under a more community-friendly license.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess this is where it is. I\u0027ve not read any of the discussions. But if someone asks you to rename something to avoid people mistaking your work for theirs or visa versa, you do it out of politeness and because it\u0027s the right thing to do.\u003C/p\u003E\u003Cp\u003EAFAIK open sourcing code in no way allows others to use a programs \u003Cem\u003Ename\u003C/em\u003E just it\u0027s code.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-11-02T17:38:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Technical Ben\u0022 data-cite=\u0022Technical Ben\u0022\u003E\u003Cdiv\u003EI guess this is where it is. I\u0027ve not read any of the discussions. But if someone asks you to rename something to avoid people mistaking your work for theirs or visa versa, you do it out of politeness and because it\u0027s the right thing to do.\u003Cp\u003EAFAIK open sourcing code in no way allows others to use a programs \u003Cem\u003Ename\u003C/em\u003E just it\u0027s code.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think using the name falls under a trademark issue, ie Firefox is released under some kind of GPL derivative, but the name itself can\u0027t be used unless certain conditions are met. \u003C/p\u003E\u003Cp\u003EWhile it seems unlikely that anyone is going to get a legally binding trademark for their addon, it would probably be a good idea for anyone releasing an alternate version of something that is still under \u003Cem\u003Eactive\u003C/em\u003E development to use a different name. If nothing else it would at least prevent confusion. That wouldn\u0027t be a bad idea for one of the forum addon rules.\u003C/p\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2014-11-02T17:49:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003E Just as, if I host a block party, and someone comes over (an acquaintance of an acquaintance perhaps) and decides to smash my windows and drink all of the beer, I am under no obligation to provide them more beer. I can\u0027t kick them out (it\u0027s a public street), but I certainly don\u0027t want them to get the idea that they are welcome either \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet us take your analogy a bit further. Let us suppose it was a group of people who were damaging your house. Also let us suppose there was another group who were behaving well but happened to be dressed similarly to those damaging your house. You were unable to distinguish between the two groups due to their similar appearance. You therefore refused to allow both groups to have any beer. A friend realized that there was a group who due to unfortunate circumstances of dress, were being refused beer, although they had done nothing wrong. He then attempted to make them feel welcome by giving them beer without your approval knowing that the initial invitation stated that all would be welcome. He agreed with your right to refuse beer to those that had damaged you, but also wished to amend the injustice of those wrongly associated with the miscreants, and to try and do so in a ways that would cause the least possible disruption to the party by telling those he is helping to stay away from your house. Sure they could run home and change cloths (switch to win32 KSP) but that would mean they would lose out on some of the party. This friend also understood that there was a chance that he would serve by accident some of the miscreants and therefore warned the group to be on their best behavior or else he too would remove access to the beer. This friend also understood however that it is better to let a ruffian go free than to punish the innocent. (founding concept of the US legal system)\u003C/p\u003E\u003Cp\u003EWould you truly wish to refuse beer to this group, and would you truely be mad at your friend?\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-11-02T17:57:16Z","Content":"\n\u003Cp\u003EAnd this is when the people buying beer decide to move and buy beer for a different game.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-11-02T18:09:20Z","Content":"\n\u003Cp\u003EYou are confusing the analogy. It was in relation to support, in which case there simply is no confusion over who the miscreants are. If someone cannot respect property, or abide by social contracts, or acts like an entitled child, then I see no reason to waste my time helping them. Simple as that.\u003C/p\u003E\u003Cp\u003EAs I said - whether you think the current trend is \u0027right\u0027 or not is subjective, and nobody is going to change anyone\u0027s world view here. It\u0027s about as futile as arguing politics or religion. The difference being in this case, that continued alienation of the producers will, in the end, just result in less being produced.\u003C/p\u003E\u003Cp\u003EThat damage has already been done, and while some will simply tell modders to \u0027grow up\u0027, etc. I\u0027d encourage folks with said beliefs to start learning C# and Unity, or get used to vanilla, because people kinda don\u0027t like providing stuff in an increasingly toxic environment, and we\u0027ll hit a point where every mod is released under very restrictive licensing because of failure of the social contract.\u003C/p\u003E\u003Cp\u003EThat\u0027s pretty much reality. You can debate the right and wrong if it all day long (again, I don\u0027t see anyone\u0027s viewpoint being changed), but the outcome is already there. \u003C/p\u003E\u003Cp\u003EFor me, as I said, I will personally limit my support of my mods to those I enjoy providing support for. I see it as a party with friends, and folks with whom there\u0027s a healthy dose of mutual respect.\u003C/p\u003E\u003Cp\u003EThere is no real argument here - my POV is not going to change, nor do I expect yours to. I\u0027m merely advising of the expected consequences, do with it what you will since it\u0027s of no real concern to me.\u003C/p\u003E\u003Cp\u003E(Edit)\u003C/p\u003E\u003Cp\u003EAnd Majiir hit the nail on the head.\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2014-11-02T18:12:53Z","Content":"\n\u003Cp\u003EAll this beer analogies are just making me thirsty.\u003C/p\u003E\u003Cp\u003ETo clarify my previous posts:\u003C/p\u003E\u003Cp\u003E- if the license allows it, you have already authorized the fork.\u003C/p\u003E\u003Cp\u003E- you can, of course, not approve the new fork (ferram, for example, doesn\u0027t)\u003C/p\u003E\u003Cp\u003E- common courtesy should apply both ways: with this I mean that (obviously) who decides to fork should try to respect the original author\u0027s wishes, if possible; the author should also try to be considerate with the wishes of the forker, especially after he has given him permission to go ahead (which is exactly what ferram did).\u003C/p\u003E\u003Cp\u003EAnd now I think I\u0027m just gonna leave this thread because I re-read my post about 20 times and it still doesn\u0027t read like I\u0027d like it to, I don\u0027t think I can explain myself and not sound like a mule \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-11-02T18:17:06Z","Content":"\n\u003Cp\u003EAll I have to say is that modders shouldn\u0027t base decisions for the development of their mod on people who complain whilst have no knowledge of the difference between something inherent to the game and something a mod actually modifies, particularly if that decision ends up locking out a certain group of players from utilizing your mod. People like that shouldn\u0027t influence development decisions, and locking out players from using your mod purely because of, well, stupid people just isn\u0027t right. And this is especially so if something like x64 doesn\u0027t even affect the functionality of the mod itself (and the mods that disable themselves did work fine in x64)\u003C/p\u003E\u003Cp\u003EEvery mod is going to have a certain group of users who don\u0027t know any better (or are just plain trolling. It happens) who will try to pin their problems on something wrong with the mod when in reality the mod had nothing to do with it. This happens in every modding community, and in every community there\u0027s a certain number of modders who get too caught up in what those users complain about, and what those modders then proceed to do pretty much screws everyone else (or at least some people) out of their mods all because they bought in to the posts of stupid people.\u003C/p\u003E\u003Cp\u003EIN a perfect world, this would be all fair. But this isn\u0027t a perfect world, and stupid people aren\u0027t ever not going to be stupid, especially on the internet.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-11-02T19:01:54Z","Content":"\n\u003Cp\u003EBottom line: This is a \u003Cem\u003Ehobby\u003C/em\u003E. If the hobby is no longer fun, why bother? Much as I really enjoy this community my fun is beholden to no one around here even though it is quite affected by a small minority, and at some point the simple act of sharing becomes a pain. When people having fun doing a hobby get (quite literally) strong-armed in some attempt to make them do something the communal bonds of trust and respect are broken, and everybody suffers. That is when it\u0027s no longer worth contributing, when \u003Cem\u003Esharing\u003C/em\u003E becomes a pain. Whether that\u0027s because of a small subsection of the community or just a general feeling of malaise is besides the point. There is always going to be a small subsection who have no respect for the idea of sharing and will try to twist such things to their advantage; it\u0027s when that small subsection gets nasty, regardless of whether someone is \u003Cem\u003Edirectly affected\u003C/em\u003E by them or not, that people start wondering if what they\u0027re doing is actually worth it.\u003C/p\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2014-11-02T19:15:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022G\u0022 data-cite=\u0022G\u0022\u003E\u003Cdiv\u003EAll I have to say is that modders shouldn\u0027t base decisions for the development of their mod on people who complain whilst have no knowledge of the difference between something inherent to the game and something a mod actually modifies\u0027 date=\u0027 particularly if that decision ends up locking out a certain group of players from utilizing your mod. People like that shouldn\u0027t influence development decisions, and locking out players from using your mod purely because of, well, stupid people just isn\u0027t right. And this is especially so if something like x64 doesn\u0027t even affect the functionality of the mod itself (and the mods that disable themselves did work fine in x64)\u003Cp\u003EEvery mod is going to have a certain group of users who don\u0027t know any better (or are just plain trolling. It happens) who will try to pin their problems on something wrong with the mod when in reality the mod had nothing to do with it. This happens in every modding community, and in every community there\u0027s a certain number of modders who get too caught up in what those users complain about, and what those modders then proceed to do pretty much screws everyone else (or at least some people) out of their mods all because they bought in to the posts of stupid people.\u003C/p\u003E\u003Cp\u003EIN a perfect world, this would be all fair. But this isn\u0027t a perfect world, and stupid people aren\u0027t ever not going to be stupid, especially on the internet.[/quote\u0027]\u003C/p\u003E\u003Cp\u003ESpend a significant amount of time on the thread for any reasonably popular mod that you\u0027re familiar with. Look through 10-30 pages of support issues.\u003C/p\u003E\u003Cp\u003EYou can\u0027t just ignore the people who are being rude or unhelpful. Because especially around the time of a game update, a significant potion of those support requests are going to be people who are: whining for a mod to be updated faster, demanding support in a rude way, people asking for support without providing sufficent information to the people providing support, or (now with the advent of x64) people who are either whining about their borked x64 that the people offering support can do nothing about, or who are demanding that x64 be supported after the aforementioned whining has caused x64 to be unsupported. \u003C/p\u003E\u003Cp\u003EI mean, you can try ignoring all of that, but best of luck to you. You\u0027ll need it. \u003C/p\u003E\u003Cp\u003EMod authors have every right to be angry over people who subvert their efforts to provide a quality product. That\u0027s true of the anti-CC mod and it\u0027s true of people releasing x64 forks against an author\u0027s wishes. \u003C/p\u003E\u003Cp\u003ESure, people can do those things, but they shouldn\u0027t. It makes life harder on just about everyone, all for the sake of a few whiny people who want what they feel that they\u0027re entitled to regardless of the wishes of others or the consequences that others will have to deal with.\u003C/p\u003E\u003Cp\u003Ex64 is a ....ing disaster of a release. It shouldn\u0027t be available for us to even tinker with for the number of phantom issues it has. And if you\u0027re going to start trying to throw mods into that mix, you ought to have enough of an idea of what you\u0027re doing tech-wise that you can recompile a mod to run on x64 without having to wait for someone else to do it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EBottom line: This is a \u003Cem\u003Ehobby\u003C/em\u003E. If the hobby is no longer fun, why bother? Much as I really enjoy this community my fun is beholden to no one around here even though it is quite affected by a small minority, and at some point the simple act of sharing becomes a pain. When people having fun doing a hobby get (quite literally) strong-armed in some attempt to make them do something the communal bonds of trust and respect are broken, and everybody suffers. That is when it\u0027s no longer worth contributing, when \u003Cem\u003Esharing\u003C/em\u003E becomes a pain. Whether that\u0027s because of a small subsection of the community or just a general feeling of malaise is besides the point. There is always going to be a small subsection who have no respect for the idea of sharing and will try to twist such things to their advantage; it\u0027s when that small subsection gets nasty, regardless of whether someone is \u003Cem\u003Edirectly affected\u003C/em\u003E by them or not, that people start wondering if what they\u0027re doing is actually worth it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESome nail meeting head action going on right there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-02T19:18:42Z\u0022 title=\u002211/02/2014 07:18  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 2, 2014\u003C/time\u003E by Boomerang\u003C/strong\u003E\n\u003C/span\u003E\n"}]}