{"TopicId":89177,"ForumId":20,"TopicTitle":"Kerbal Reproduction Mod","CreatedByName":"Pure_Diamond","CreatedById":100558,"CreatedDateTime":"2014-11-02T02:29:42Z","PageNum":1,"Articles":[{"CreatedByName":"Pure_Diamond","CreatedById":100558,"CreatedDateTime":"2014-11-02T02:29:42Z","Content":"\n\u003Cp\u003EWell... I was watching Harv\u0027s \u0022Last Project\u0022 series and came up with a very weird mod idea... The idea is basically when two kerbals share a command pod with an empty space they will make a new kerbal every year or so with a random element. There would also be a way to click on a hatch and initiate the process. Also there would be a way to add a strict no workplace relations policy. Eventually I would want to add in a genetic component affecting Courage and Stupidity as well as the .90 Kerbal EXP. I was wondering if this would be at all possible and how one would be able to do said thing...\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2014-11-03T05:22:35Z","Content":"\n\u003Cp\u003Euhhhhhh.................. i am not sure how to respond to this uhhh are you sure you want kerbals to have accidents like this plus would they be spawning mini kerbals or full sized kerbals first of all?\u003C/p\u003E\n"},{"CreatedByName":"Axelord FTW","CreatedById":1896,"CreatedDateTime":"2014-11-03T08:51:07Z","Content":"\n\u003Cp\u003EWith enough kerbals and an engine nozzle strapped to the pod hatch, you could get some thrust out the expansion of the kerbals\u0027 volume.\u003C/p\u003E\u003Cp\u003EBut really, \u003C/p\u003E\u003Cp\u003Ewat\u003C/p\u003E\n"},{"CreatedByName":"Luka 999","CreatedById":127252,"CreatedDateTime":"2015-04-18T17:47:45Z","Content":"\n\u003Cp\u003EThis is a good idea but I think that you should wait for the version 1.0 when female kerbals will be introduced. I would add the reqirement that there has to be at least one female and one male kerbal inside the ship. For the problem of the time the kerbals need to grow up I sudgest that you add a new resource named baby kerbals (or any other name) and after a certen amount of time (about 5 years) the kerbal would appear in the free seat. Please text back. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2015-04-18T18:06:07Z","Content":"\n\u003Cp\u003EThis thread is old enough that the idea has since been implemented as part of the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/112142\u0022 rel=\u0022external nofollow\u0022\u003ECivilian Population\u003C/a\u003E mod.\u003C/p\u003E\u003Cp\u003EIf you\u0027re looking to discuss it further, there\u0027s a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/114874-Idea-Kerbal-Kids-expanded-Colonies-and-more\u0022 rel=\u0022external nofollow\u0022\u003Emore recent thread here\u003C/a\u003E. (Closed.)\u003C/p\u003E\n"}]}