{"TopicId":91465,"ForumId":20,"TopicTitle":"Ion Cannon/Orbital Weapons?","CreatedByName":"lordmuffin","CreatedById":127240,"CreatedDateTime":"2014-11-28T13:21:11Z","PageNum":1,"Articles":[{"CreatedByName":"lordmuffin","CreatedById":127240,"CreatedDateTime":"2014-11-28T13:21:11Z","Content":"\n\u003Cp\u003EI was browsing the KSP forums, and I suddenly thought, \u0022I want an ion cannon for my satellites.\u0022 I don\u0027t mean Baha\u0027s laser, or the Sunbeam, already tried those.\u003C/p\u003E\u003Cp\u003EWhat I want to do is blow up KSC \u003Cem\u003Efrom orbit.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIf that is possible, and you can do it, I\u0027m sure everyone would love it.\u003C/p\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2014-11-28T13:41:05Z","Content":"\n\u003Cp\u003EDevs have stated some time ago that no weapons would be present in the stock game. Ever.\u003C/p\u003E\u003Cp\u003EYou can make a mod though. \u003C/p\u003E\u003Cp\u003EYou can also bring an asteroid and drop it onto KSC.\u003C/p\u003E\n"},{"CreatedByName":"lordmuffin","CreatedById":127240,"CreatedDateTime":"2014-11-28T14:09:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cicatrix\u0022 data-cite=\u0022cicatrix\u0022\u003E\u003Cdiv\u003EDevs have stated some time ago that no weapons would be present in the stock game. Ever.\u003Cp\u003EYou can make a mod though. \u003C/p\u003E\u003Cp\u003EYou can also bring an asteroid and drop it onto KSC.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t mean stock, I mean a mod.\u003C/p\u003E\u003Cp\u003EAnd honestly I have no time and no idea how to make a mod.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-28T14:21:46Z","Content":"\n\u003Cp\u003EThe trouble is the physics bubble. Weapons aren\u0027t going to affect something outside the ~2.5km limit. Best you could hope for is something launched from orbit that can be followed down, like a missile or projectile.\u003C/p\u003E\n"},{"CreatedByName":"Buzzou","CreatedById":100703,"CreatedDateTime":"2014-11-30T12:55:57Z","Content":"\n\u003Cp\u003Eit can be done with a bit of tinkering...\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/SnpOMpLYhqo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Sasami_TN","CreatedById":130310,"CreatedDateTime":"2014-11-30T13:45:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lordmuffin\u0022 data-cite=\u0022lordmuffin\u0022\u003E\u003Cdiv\u003EI was browsing the KSP forums, and I suddenly thought, \u0022I want an ion cannon for my satellites.\u0022 I don\u0027t mean Baha\u0027s laser, or the Sunbeam, already tried those.\u003Cp\u003EWhat I want to do is blow up KSC \u003Cem\u003Efrom orbit.\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.pix8.net/pro/pic.php?u=3365epM5u\u0026amp;i=11591508\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.pix8.net/pro/pic.php?u=3365epM5u\u0026amp;i=11591508\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(*smirkles*) I believe that there is an international accord agreement against weaponizing space (mostly for the reason which you requested). If ensuring public safety against meteor/ comet collision isn\u0027t a strong enough reason to put missiles, and massive gigawatt beam cannons on satellites, or even provide them the ability to launch derelict farm pickup trucks at incoming rocks of doom. Then I am sure that megalomanic tendencies which would circumvent the M.A.D. (mutually assured destruction) conscience safeguard.. would not really carry very far unless you can find a megalomanic rogue nation (MOD) sponsor who would also delight in mass destruction and seeing flaming kerbals running around screaming. (*sigh*) Since noone is allowed to weaponize space even to protect the rest of us. The best that NASA and other participating countries have been able to draw up concerning the danger of inbound cataclysmic asteroids was to put up a telescope and some sensors so that we could watch on primetime television as the rocks fall on our heads. Oh yeah, they also sponsored 2 hollywood space rock movies, which should count for something. Perhaps a future environmentally correct plan may be to send up astronauts on one side of a killer asteroid.. and push. (MISSION CONTROL\u0026gt; \u0022Okay guys, on 3 you all are to push like you\u0027ve had your wheaties for breakfast. 1.. 2.. 3... and p-u-s-h. Now again and this time do it like you mean it. And please will you tell that other guy to get off his cell phone to his girlfriend and contribute to the game plan here. Thank you.\u0022)\u003C/p\u003E\u003Cp\u003EIn all seriousness, one of NASA engineer\u0027s designed a gravitational tractor which would be sent up many months ahead of any planetary collision to provide a gravitational nudge which would put the asteroid on another trajectory, thereby missing earth entirely. Well, until it returns in some future time along the same trajectory. But groundbreaking idea\u0027s are being drafted and several board meetings have burned the midnight oil trying to find affordable solutions to public safety concerns. (*looks through slightly open NASA door*) yep, they\u0027re still at it so I wouldn\u0027t worry none. You can feel safe with your future in the hands of balding men wearing long sleeve white shirts and funny looking neckties.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-30T17:53:23Z\u0022 title=\u002211/30/2014 05:53  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 30, 2014\u003C/time\u003E by Sasami_TN\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-30T18:43:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sasami_TN\u0022 data-cite=\u0022Sasami_TN\u0022\u003E\u003Cdiv\u003EI believe that there is an international accord agreement against weaponizing space (mostly for the reason which you requested).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I understand it, that treaty only forbids weapons of mass destruction in orbit. Conventional weapons are within the treaty limits (the Soviets had an armed satellite for a while).\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2014-11-30T19:14:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E(the Soviets had an armed satellite for a while).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Edo you mean the salyut 3 space station? it had an aircraft autocannon bolted onto it which always struck me as being extremely amusing as it\u0027s the most deadpan literal way that you could possibly militarize outer space. they performed ASAT tests with it, and reportedly with success at that, so maybe it wasn\u0027t such a silly idea.\u003C/p\u003E\u003Cp\u003Eedit/postscript: it\u0027s also worth noting as a funny historical scrap that the X-20 dyna-soar had a proposed military payload that included a mounted AR-15 to shoot up enemy satellites that the vehicle was co-orbiting, which is possibly an even sillier thing to imagine (it would be best of all if the soldier-astronaut actually picked up a gun and started shooting out of the service hatch, but unfortunately neither the dyna-soar nor this ASAT scenario was ever to materialize).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-30T19:20:35Z\u0022 title=\u002211/30/2014 07:20  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 30, 2014\u003C/time\u003E by rodion\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-30T19:25:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion\u0022 data-cite=\u0022rodion\u0022\u003E\u003Cdiv\u003Edo you mean the salyut 3 space station? it had an aircraft autocannon bolted onto it which always struck me as being extremely amusing as it\u0027s the most deadpan literal way that you could possibly militarize outer space. they performed ASAT tests with it, and reportedly with success at that, so maybe it wasn\u0027t such a silly idea.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is the one I was thinking of, though I had forgotten it was a space station and not a satellite. Didn\u0027t know about that proposal for the Dyna-soar, sounds comical. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}