{"TopicId":95684,"ForumId":20,"TopicTitle":"Hug A Mod-maker 2015","CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-05T01:27:32Z","PageNum":1,"Articles":[{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-05T01:27:32Z","Content":"\n\u003Cp\u003EMore than a few mod-makers are not supporting Win-64 KSP because of the bugs they get unfairly blamed for.\u003C/p\u003E\u003Cp\u003ELast year StupidChris got fed-up with the many whiners around and withdrew RealChutes.\u003C/p\u003E\u003Cp\u003EThe MJ thread has recently been plauged by a PERSON who was convinced it WAS BROKEN and HAD to be fixed because HE couldn\u0027t play KSP without it.\u003C/p\u003E\u003Cp\u003ESarbian has now left Module Manager - which many other mods depend upon.\u003C/p\u003E\u003Cp\u003ETime to give some New Year love!\u003C/p\u003E\u003Cp\u003ERemember:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EMods are free\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt takes a lot of work to make a useful mod and keep it up to date\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMod-makers still need to eat - so they\u0027re giving-up their time voluntarily\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EApart from their wish to make things better for everyone there is no guarantee of quality, functionality or past/future compatibility\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMods, and the makers of mods, owe us exactly nothing\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIf you are new - ****ing off the maker of popular mod, that many people use, is not going to make you many friends ^^\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHug a mod-maker while you\u0027ve still got a chance!\u003C/p\u003E\n"},{"CreatedByName":"lincourtl","CreatedById":72218,"CreatedDateTime":"2015-01-05T01:31:22Z","Content":"\n\u003Cp\u003EHear, hear! KSP has the best, and some of the most knowledgeable, mod developers on this planet, and many others.\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-01-05T01:33:26Z","Content":"\n\u003Cp\u003EFriendly reminder that the little star shaped button in the bottom left of a user\u0027s post (next to Blog this Post) is the button to add to a user\u0027s reputation \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-01-05T01:37:11Z","Content":"\n\u003Cp\u003EShame shame on the people who pressure modders! After my planet pack I was completely wiped out and desperately needed to spend a day off (even though I still had fun messing around with Kopernicus). But how do the \u003Cem\u003Ereal\u003C/em\u003E modders, the ones who make the models, textures, animations, etc. from scratch, do what they do? Respect for all the modders out there! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Abdu","CreatedById":102145,"CreatedDateTime":"2015-01-05T01:47:59Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003E*big hug*\u003C/strong\u003E\u003C/span\u003E \u003Cspan style=\u0022font-size:8px;\u0022\u003Esoo big that the world blew up\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-05T01:54:39Z","Content":"\n\u003Cp\u003EMoved to General Add-on Affairs. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}