{"TopicId":96723,"ForumId":20,"TopicTitle":"\u0026quot;Far is hard\u0026quot;","CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2015-01-15T01:56:58Z","PageNum":4,"Articles":[{"CreatedByName":"NBZ","CreatedById":117892,"CreatedDateTime":"2015-01-16T15:40:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lincourtl\u0022 data-cite=\u0022lincourtl\u0022\u003E\u003Cdiv\u003EI\u0027m running KSP 0.90 with FAR, Deadly Reentry, Real Chute, Procedural Fairings, Kerbal Joint Reinforcement, ScanSat, and many more mods on an AMD Athlon Dual Core 4850e 2.5GHz machine with 2GB of memory and Windows Vista Business 32 bit. It\u0027s a Dell Optiplex 740 to be specific. FAR has next to no effect on my install\u0027s framerate or other performance. The Trajectories mod however results in lots of 1-2 second freezes. Go figure.\u003Cp\u003EFerram isn\u0027t doing computational fluid dynamics in FAR. It\u0027s not exactly taxing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you have a supercomputer. Good for you.\u003C/p\u003E\u003Cp\u003EJoke aside, I\u0027m usually on a Dell Latitude E4310 (i5 520M 2.4GHz, 8GB RAM, Windows 7 Ultimate 64 bit on SSD), so if FAR works for you, it should for me too.\u003C/p\u003E\u003Cp\u003ECurrent mods are BahaSP, Chatterer, CIT, ColorCodedCans, CrowdSourcedScience-1.2.1, DeadlyReentry, Diazo, EditorExtensions, ForScience, img_viewer, InFlightWaypoints, KerbalIspDifficultyScaler, KerbalJointReinforcement, MechJeb2, ModuleManager, R\u0026amp;SCapsuledyne, SafeChute, SpaceY-Lifters, StageRecovery, StockBugFixModules, StockDragFix, TextureReplacer, ToadicusTools, and TweakableEverything, so nothing too heavy there either.\u003C/p\u003E\u003Cp\u003EMaybe there was something else going on, but I was noticing significant frame rate drops in atmosphere when using FAR. Other than that, I liked it. Maybe KSP was just having a bout of hiccups. I\u0027ll try FAR again next time I start a career. Thank you.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-01-16T15:45:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashflare\u0022 data-cite=\u0022Ashflare\u0022\u003E\u003Cdiv\u003EI\u0027ve played around with NEAR, haven\u0027t looked at FAR yet, but does anyone have a simple explanation of how the in-flight tools work? I can\u0027t find any guides or documentation for it. I\u0027m pretty sure I understand the tools in the SPH/VAB, I just find the in-flight window a little unintuitive.\u003C/div\u003E\u003C/blockquote\u003E\u003Ca href=\u0022https://github.com/ferram4/Ferram-Aerospace-Research/wiki/Notes-on-stability-derivatives\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/ferram4/Ferram-Aerospace-Research/wiki/Notes-on-stability-derivatives\u003C/a\u003E\u003Cp\u003EThe sidebar menu has more links.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-16T15:46:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ashflare\u0022 data-cite=\u0022Ashflare\u0022\u003E\u003Cdiv\u003EI\u0027ve played around with NEAR, haven\u0027t looked at FAR yet, but does anyone have a simple explanation of how the in-flight tools work? I can\u0027t find any guides or documentation for it. I\u0027m pretty sure I understand the tools in the SPH/VAB, I just find the in-flight window a little unintuitive.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe graphs are explained on the github, they are fairly easy to understand. The derivatives were always the confusing part to me but I just went and looked and the good news is the wiki has had an update since the last time I looked. I\u0027ll have to read through that some time.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/ferram4/Ferram-Aerospace-Research/wiki/Definition-of-Terms-and-Symbols\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/ferram4/Ferram-Aerospace-Research/wiki/Definition-of-Terms-and-Symbols\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"lincourtl","CreatedById":72218,"CreatedDateTime":"2015-01-16T16:51:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NBZ\u0022 data-cite=\u0022NBZ\u0022\u003E\u003Cdiv\u003E I\u0027m usually on a Dell Latitude E4310 ... so if FAR works for you, it should for me too. ... Maybe there was something else going on, but I was noticing significant frame rate drops in atmosphere when using FAR. Other than that, I liked it. Maybe KSP was just having a bout of hiccups. I\u0027ll try FAR again next time I start a career. Thank you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI honestly think a lot of the problems KSP has performance wise have to do with how poorly Mono/Unity handles memory allocation and garbage collection. For instance, one of the things I noticed was that running KSP with no command line switches, thus using DirectX 9, none of my GPU memory was being used. Once I figured out the right command line switches, I got KSP running using DirectX 11, and suddenly my GPU memory is being used correctly; KSP is no longer acting like I have onboard graphics utilizing shared system memory.\u003C/p\u003E\u003Cp\u003EAnd then Windows itself sometimes gets in the way. Like I mentioned, I only have 2GB of system memory and even with ATM Aggressive I couldn\u0027t get KSP to run for more than an hour before crashing. After that it wouldn\u0027t run at all, crashing on load with a \u0022too many heap sections\u0022 error. Eventually I discovered that Windows automatically takes half of allocatable memory for itself but this can be overridden. Once I did that I was able to get KSP 0.90 plus all those mostly non-parts mods I consider essential working with pretty good performance, although I still have to run at half-res.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-01-16T17:12:49Z","Content":"\n\u003Cp\u003EWings placement affect each other unlike stock ksp (understand that spamming 30 winglet in 1 spot, won\u0027t linearly improve lift, it will get less and less useful)\u003C/p\u003E\u003Cp\u003Eand yes, it is better for building aircraft simply because it is better for flying them with a pad / joystick, but some extremely cheaty stock planes are also fun to fly xD like my UMI\u003C/p\u003E\u003Cp\u003Ebut you never never reach the complexity in behaviour and handling. \u003C/p\u003E\u003Cp\u003EBecause it\u0027s not all FAR does, FAR also simulate wind forces on parts that lift or drag \u0026gt; aeroviz ( that can break those if tolerance exceeded ) what it means really is that suspension on a plane now make sense, which is great for building and hard yes especially since you have to see how the mod works between the lines, all parts have a \u0022front\u0022 and a \u0022rear\u0022 with different lift / drag depending on how you place it..\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-16T17:18:15Z\u0022 title=\u002201/16/2015 05:18  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 16, 2015\u003C/time\u003E by RevanCorana\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"notsorightstuph","CreatedById":82399,"CreatedDateTime":"2015-01-17T03:58:40Z","Content":"\n\u003Cp\u003EI used FAR for a while. Its not hard to understand really. You dont need to worry about all the graphs and windows. I use NEAR now but only because there is a compatibility issue with dang it. Its awesome when u tip your shuttle over a bit and then just sit back and watch it slowly tip as it rises doing a beautiful realistic gravity turn with almost no effert. I do have to play with the main engine throttle a bit but not wasd input at all. Then if you add deadly reentry to the mix you have a concoction for some really fun moments. I hope the aero update is NEAR. I think it should be stock and I bet a lot of people would love it if they just didn\u0027t know they were using it.\u003C/p\u003E\n"},{"CreatedByName":"KerBlam","CreatedById":134309,"CreatedDateTime":"2015-01-17T08:05:23Z","Content":"\n\u003Cp\u003ESo, I\u0027ve switched to FAR after reading this, and now I am suffering unplanned disassembly at every turn.... I\u0027ve looked at the FAR wiki, and aside from a headache, I derived nothing useful from there as far as design elements and methods... I play this game to have fun, you know...\u003C/p\u003E\u003Cp\u003EWatching my lifter that used to get whatever I wanted within reason off planet, flip over and explode at 6-10000m over and over, without any idea why or how to fix it, is sucking the fun out for me. \u003C/p\u003E\u003Cp\u003EI even turned mechjeb ascent guidance on, I got the same result... \u003C/p\u003E\u003Cp\u003ESo is there some more information out there on how to make it work, or is this only really for ACTUAL rocket scientists? \u003C/p\u003E\u003Cp\u003EMaybe I should go back to using the stock drag fix that was giving me satisfactory results, and stop caving to the communal pressure of \u0027you\u0027re not really flying unless it\u0027s FAR\u0027,\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-01-17T08:29:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerBlam\u0022 data-cite=\u0022KerBlam\u0022\u003E\u003Cdiv\u003EWatching my lifter that used to get whatever I wanted within reason off planet, flip over and explode at 6-10000m over and over, without any idea why or how to fix it, is sucking the fun out for me.\u003C/div\u003E\u003C/blockquote\u003EI\u0027m guessing you\u0027re using a traditional KSP launch trajectory (launch straight up, make a sandwich, at 8~10km turn 45deg)? This is why stock aero is so terrible, it taught you the wrong way to launch rockets. E: This is not criticism of \u003Cem\u003Eyou\u003C/em\u003E, it\u0027s criticism of the stock aero. Were you playing FAR from the beginning, you wouldn\u0027t be finding it hard because you wouldn\u0027t have been learning the wrong way to actually launch a rocket.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerBlam\u0022 data-cite=\u0022KerBlam\u0022\u003E\u003Cdiv\u003ESo is there some more information out there on how to make it work, or is this only really for ACTUAL rocket scientists?\u003C/div\u003E\u003C/blockquote\u003EFor stock Kerbin, what works best for me (NOT an ACTUAL rocket scientist) is to launch straight up until you\u0027re going about 75m/s then tilt 5deg towards your turn vector (normally east). Then just follow the prograde marker until you\u0027re out of the second atmosphere band. One you\u0027re clear of the thick atmosphere, you have much more leeway in how you do things, so more major corrections are easier. Keep your launch vehicle\u0027s TWR around 1.2~1.4 on the pad and pack a good 3.5~4km/s of delta-V for orbital insertion (3.5km/s should do you, I think).\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerBlam\u0022 data-cite=\u0022KerBlam\u0022\u003E\u003Cdiv\u003Eand stop caving to the communal pressure of \u0027you\u0027re not really flying unless it\u0027s FAR\u0027,\u003C/div\u003E\u003C/blockquote\u003EYou\u0027re imagining things, no one cares how you play this game in your own home.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-17T08:35:11Z\u0022 title=\u002201/17/2015 08:35  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 17, 2015\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerBlam","CreatedById":134309,"CreatedDateTime":"2015-01-17T08:36:39Z","Content":"\n\u003Cp\u003ENo, I paid attention... I start a \u0027gravity turn\u0027 at about 600m, by nudging it east, and everything appears to go well until about 6000m-10000m when it decides it wants to go home. Noses over and.. you know the rest.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EKeep your launch vehicle\u0027s TWR around 1.2~1.4 on the pad and pack a good 3.5~4km/s of delta-V for orbital insertion (3.5km/s should do you, I think, but I don\u0027t play stock Kerbin with FAR).\u003C/div\u003E\u003C/blockquote\u003E That\u0027s good advice, I think my TWR is around 3 (2.75)... \u003Cp\u003EI\u0027ll give it time.. I imagine that once I \u0027get it\u0027 I will be glad I stuck with it, so I will.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-01-17T09:17:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerBlam\u0022 data-cite=\u0022KerBlam\u0022\u003E\u003Cdiv\u003ENo, I paid attention... I start a \u0027gravity turn\u0027 at about 600m, by nudging it east, and everything appears to go well until about 6000m-10000m when it decides it wants to go home. Noses over and.. you know the rest.\u003Cp\u003E That\u0027s good advice, I think my TWR is around 3 (2.75)... \u003C/p\u003E\u003Cp\u003EI\u0027ll give it time.. I imagine that once I \u0027get it\u0027 I will be glad I stuck with it, so I will.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe important thing you have to check is your speed. If it reach mach speed (about 340m/s) within deep atmosphere (\u0026gt;15km) it will be very difficult to do any maneuvers without either things tumble or simply break apart. If you reach close to that speed, stop trying to turn. Keep yourself going at whatever direction you have been pointing at until you go to like 20km.\u003C/p\u003E\u003Cp\u003EUsually a launch stage TWR between 1.5-2.5 is easy enough to control. You can have higher TWR if you want, but you have to control your throttle carefully.\u003C/p\u003E\n"},{"CreatedByName":"lincourtl","CreatedById":72218,"CreatedDateTime":"2015-01-17T12:50:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerBlam\u0022 data-cite=\u0022KerBlam\u0022\u003E\u003Cdiv\u003EI even turned mechjeb ascent guidance on, I got the same result... \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust to add to what everybody else has said, remember to install the Optional Mechjeb Module for FAR. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60933-Optional-MechJeb-Modules\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/60933-Optional-MechJeb-Modules\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-01-17T13:23:17Z","Content":"\n\u003Cp\u003E@kerblam: If you\u0027re using MechJeb, use the limit angle of attack function and adjust the number to what works for you. \u003C/p\u003E\u003Cp\u003EAlso, I ran into a similar instability problem with a ship of mine (which even MJ couldn\u0027t stop) and kept trying different rocket configurations, then I decided that maybe the fairing was too small (it was a smallish bulb at the top) and made it bigger and bam, that pretty much solved it. Basic point is that maybe theres some aerodynamic instability going on.\u003C/p\u003E\n"},{"CreatedByName":"Sage","CreatedById":103634,"CreatedDateTime":"2015-01-17T14:31:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerBlam\u0022 data-cite=\u0022KerBlam\u0022\u003E\u003Cdiv\u003ENo, I paid attention... I start a \u0027gravity turn\u0027 at about 600m, by nudging it east, and everything appears to go well until about 6000m-10000m when it decides it wants to go home. Noses over and.. you know the rest.\u003Cp\u003E That\u0027s good advice, I think my TWR is around 3 (2.75)... \u003C/p\u003E\u003Cp\u003EI\u0027ll give it time.. I imagine that once I \u0027get it\u0027 I will be glad I stuck with it, so I will.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that TWR is exaggerated, but there is no need to redesign your rocket if iyt\u0027s liquid fueled, just throttle down. Also remember that if you aren\u0027t staging your TWR goes up as you burn fuel so remember to throttle down the more you go up. Your CoM might also be shifting backwards if your payload isn\u0027t heavy enough, so make sure that your CoL remains behind it. Usually having fins is enough. A good exercise is try to make a ballistic, sub-orbital, single stage missile with a probe and try to do a gravity turn without touching the WASD controls. just tip a bit at the beginning and manage the throttle so it keeps tipping at the right rate.\u003C/p\u003E\u003Cp\u003EAlso post your design if you want further help.\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2015-01-17T15:22:01Z","Content":"\n\u003Cp\u003EFAR isn\u0027t \u003Cem\u003Ehard\u003C/em\u003E, it\u0027s \u003Cem\u003Eintuitive\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EStock aero is just \u003Cem\u003Econfusing\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EAt first, I too made the noob mistake of designing rockets that actually look like rockets. I had to \u003Cem\u003Eun-learn\u003C/em\u003E everything I thought I knew about aerodynamics, because stock areodynamics simply isn\u0027t.\u003C/p\u003E\u003Cp\u003EThere were 2 things that came very close to putting me off KSP for good, one was the \u0022bends like a bananna\u0022 springy joint effect \u0026amp; the other was the \u0022flat rockets with no nosecones are more efficient\u0022 mantra of stock aerodynamics.\u003C/p\u003E\u003Cp\u003EFerram has nicely solved both of these issues and I for one will be \u003Cem\u003Every\u003C/em\u003E disappointed if the upcoming aero overhaul doesn\u0027t take inspiration from his work.\u003C/p\u003E\u003Cp\u003EHonestly, I think I would have given up on KSP as simply being too silly and counter-intuitive if it hadn\u0027t been for FAR. FAR is easy, because if it looks like it will fly it probably will.\u003C/p\u003E\u003Cp\u003EStock is ridiculous, because designs that certainly \u003Cem\u003Eshouldn\u0027t\u003C/em\u003E fly do, and designs that make sense don\u0027t.\u003C/p\u003E\u003Cp\u003EThe only \u0022hard\u0022 part of FAR is that you actually have to think about the aerodynamics of your designs at all, to me that\u0027s a good thing.\u003C/p\u003E\u003Cp\u003EThe very first response I got, the last time I introduced someone to KSP was: \u0022I thought it was more realistic than this, what\u0027s up with aerodynamics?\u0022 - I rest my case.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-17T15:29:37Z\u0022 title=\u002201/17/2015 03:29  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 17, 2015\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Poodmund","CreatedById":128643,"CreatedDateTime":"2015-01-17T16:02:25Z","Content":"\n\u003Cp\u003EAs someone who has studied limited aerodynamics and has played a fair bit of flying sims in the past, I have found FAR easier and less frustrating to play with as it just makes sense to me. I don\u0027t use the FAR build windows but the planes still act as though they look like they should when I fly them and with the stock aero this isn\u0027t the case.\u003C/p\u003E\u003Cp\u003EBasically, FAR is easier because it makes sense/is intuitive.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-17T16:12:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerBlam\u0022 data-cite=\u0022KerBlam\u0022\u003E\u003Cdiv\u003ENo, I paid attention... I start a \u0027gravity turn\u0027 at about 600m, by nudging it east, and everything appears to go well until about 6000m-10000m when it decides it wants to go home. Noses over and.. you know the rest.\u003Cp\u003E That\u0027s good advice, I think my TWR is around 3 (2.75)... \u003C/p\u003E\u003Cp\u003EI\u0027ll give it time.. I imagine that once I \u0027get it\u0027 I will be glad I stuck with it, so I will.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECheck your CoM/CoL markers, especially after you empty the upper fuel tanks. You may be getting a weightshift reversal (i.e. CoL in front of CoM) on \u0027em as your fuel consumption moves CoM. Excessive TWR usually implies extra engine mass at the base of the ship, pulling the CoM towards increased instability.\u003C/p\u003E\u003Cp\u003EEither pumping some fuel upwards/forwards during flight or sticking some more fins on the base would likely sort it.\u003C/p\u003E\n"},{"CreatedByName":"Poodmund","CreatedById":128643,"CreatedDateTime":"2015-01-17T16:39:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EExcessive TWR usually implies extra engine mass at the base of the ship, pulling the CoM towards increased instability.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECoM does not affect your TWR. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E It is true that your CoM is important when regarding the stability of the craft but to say your TWR value affects this is illogical. If you meant that a high TWR value probably means that you are using an overpowered, and therefore, heavy propulsion system as the base of your craft then I can see where you\u0027re coming from but this is then a case of saying that you are overpowering your craft at launch. A lift-off TWR of 3 is massively excessive, especially using FAR that requires an early turn to be efficient. If your rockets are proving to be unstable below 20km or so or are snapping in half, I would say even go as low as 1.4 for the early stages of launch and then adjust your throttle to match your terminal velocity upon ascent.\u003C/p\u003E\u003Cp\u003EIf you\u0027re using MechJeb, you could always just limit your maximum angle of attack to something \u0026lt;5 degrees until you\u0027re outside of the majority of the atmospheric drag... this applies even if you\u0027re not using MechJeb too.\u003C/p\u003E\n"},{"CreatedByName":"landeTLS","CreatedById":97925,"CreatedDateTime":"2015-01-17T18:22:18Z","Content":"\n\u003Cp\u003EFar does make some things harder (and more fun) if you are used to stock aero. But the fact that i can get into orbit with only 3200 -3300 dv vs 4350-4500 in stock aero just makes the game way too easy. There is KIDS but the way its solved isnt optimal(80/80 changes the vac balance too much while 40?/1 makes it too attractive to adopt wierd design strategies to increase efficiency). If far was balanced the same as stock aero but behaved as it does now that would be very nice. It is what im crossing my fingers for the 0.91 aero revamp to be. \u003C/p\u003E\u003Cp\u003EIn the mean time i tried a few experiments with some rss configs. I did create a config that kept the stock planet size and raised atmo height only a bit. It relied mostly on increasing atmo density. But the result was about 4500 dv to reach orbit. The problem was that the vessel became extremly hard to control at higher speeds through the atmosphere. Ill wait for the aero revamp i think\u003C/p\u003E\n"},{"CreatedByName":"TeeGee","CreatedById":82434,"CreatedDateTime":"2015-01-17T21:26:00Z","Content":"\n\u003Cp\u003EWhy is everyone knocking FAR down? It is an optional mod created by ferram!\u003C/p\u003E\u003Cp\u003EHe has put a lot of time in to his work and it shows! I still don\u0027t even know why this thread even exists... stock aero WON\u0027T BE FAR. Get over it. \u003C/p\u003E\u003Cp\u003EI think the best reason as to why FAR shouldn\u0027t be made stock is to play RO. Once you start playing KSP with realistic, simulated aerodynamics; you have no excuse to NOT be playing KSP with RO. Anyone that plays KSP with FAR on stock planet is a huger cheater in my opinion. \u003C/p\u003E\u003Cp\u003EIf you want THAT much realism in your game, why aren\u0027t you playing with: real fuels, engine ignitor, DR, RSS, Dangit!, TAC, Remote Tech, soviet engines, KW rocketry, AJE etc. You can\u0027t just pick up FAR and play with stock ksp because it isn\u0027t balanced FOR stock KSP. \u003C/p\u003E\u003Cp\u003EIn real life, engines have HUGE gimbal ranges in comparison to their kerbal companions and therefore they are easier to control in real life in comparison to this stock game. That\u0027s why we don\u0027t need tail fins on our rockets! Try launching a single probe rocket with stock parts in FAR without tail fins... I triple dare you to. If you can make it passed the gravity turn, you deserve a gold star. \u003C/p\u003E\u003Cp\u003EIt\u0027s all about balance and FAR has NONE when it comes to the stock experience. \u003C/p\u003E\u003Cp\u003ETo everyone that plays this game with FAR on stock... stop antagonizing everyone, grow a pair, and play RO like the rest of us big boys and girls. THEN lets talk about FAR in the proper context. \u003C/p\u003E\u003Cp\u003ESquad is going to do a stat revamp of all the rockets/engines after this aero update, I guarantee it. Why? because the game isn\u0027t BALANCED with proper aerodynamics in mind yet.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2015-01-17T21:29:19Z","Content":"\n\u003Cp\u003EThat\u0027s another thing: it\u0027s not FAR making things easier in terms of delta-V, it\u0027s the ludicrous size and rotational speed of Kerbin that makes getting into orbit easier. That\u0027s why the stock drag/aero model is so dumb, they intentionally want it to be harder because the solar system is so messed up.\u003C/p\u003E\u003Cp\u003EE: looks like I got long-post ninja\u0027d.\u003C/p\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2015-01-17T22:17:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TeeGee\u0022 data-cite=\u0022TeeGee\u0022\u003E\u003Cdiv\u003EI think the best reason as to why FAR shouldn\u0027t be made stock is to play RO. Once you start playing KSP with realistic, simulated aerodynamics; you have no excuse to NOT be playing KSP with RO. Anyone that plays KSP with FAR on stock planet is a huger cheater in my opinion.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENonsense.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TeeGee\u0022 data-cite=\u0022TeeGee\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf you want THAT much realism in your game, why aren\u0027t you playing with: real fuels, engine ignitor, DR, RSS, Dangit!, TAC, Remote Tech, soviet engines, KW rocketry, AJE etc. You can\u0027t just pick up FAR and play with stock ksp because it isn\u0027t balanced FOR stock KSP.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI strongly object the statement that Dang It! is a realism mod.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TeeGee\u0022 data-cite=\u0022TeeGee\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETry launching a single probe rocket with stock parts in FAR without tail fins... I triple dare you to. If you can make it passed the gravity turn, you deserve a gold star.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the future, I suggest you try your own challenges before you triple dare people. \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E6\u003C/span\u003E 5 parts, 100% stock. Designed and built in ~30 seconds.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Xwh1F\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-17T22:19:00Z\u0022 title=\u002201/17/2015 10:19  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 17, 2015\u003C/time\u003E by Ippo\u003C/strong\u003E\n\u003Cbr\u003EIppo cannot into count\n\u003C/span\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-17T22:29:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Poodmund\u0022 data-cite=\u0022Poodmund\u0022\u003E\u003Cdiv\u003EIf you meant that a high TWR value probably means that you are using an overpowered, and therefore, heavy propulsion system as the base of your craft then I can see where you\u0027re coming from but this is then a case of saying that you are overpowering your craft at launch.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s exactly what I was saying. The rocket in question apparently has a launch TWR of more than three; therefore, it very likely has much bigger engines than necessary. And rockets with a rearwards weight bias tend to be more unstable than those that don\u0027t, due to decreased CoM/CoL offset.\u003C/p\u003E\n"},{"CreatedByName":"TeeGee","CreatedById":82434,"CreatedDateTime":"2015-01-17T22:50:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ippo\u0022 data-cite=\u0022Ippo\u0022\u003E\u003Cdiv\u003ENonsense.\u003Cp\u003EI strongly object the statement that Dang It! is a realism mod.\u003C/p\u003E\u003Cp\u003EIn the future, I suggest you try your own challenges before you triple dare people. \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E6\u003C/span\u003E 5 parts, 100% stock. Designed and built in ~30 seconds.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/Xwh1F\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/Xwh1F\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhere is your center of lift on that rocket? Show me.\u003C/p\u003E\u003Cp\u003EEDIT: I meant build a rocket and launch a PROBE into orbit. Not launch a rocket with a probe core on it. My bad.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QEcTyWk.png\u0022 alt=\u0022QEcTyWk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd with regards to Dangit... and I suppose having 100% reliable parts is super realistic?!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-17T22:58:05Z\u0022 title=\u002201/17/2015 10:58  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 17, 2015\u003C/time\u003E by TeeGee\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2015-01-17T23:48:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TeeGee\u0022 data-cite=\u0022TeeGee\u0022\u003E\u003Cdiv\u003EWhere is your center of lift on that rocket? Show me.\u003Cp\u003EEDIT: I meant build a rocket and launch a PROBE into orbit. Not launch a rocket with a probe core on it. My bad.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith that question you are actually trying to prove that my rocket was stable. And yes, it was: the CoL is just a tiny bit behind the CoM. I could argue that I technically still won (you didn\u0027t say it needed to be unstable, just that it mustn\u0027t have any tail fins...), but here\u0027s a complete rebuttal just to be sure:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/3vsXo\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E(Before you ask: I also tried with 4 wings, but that\u0027s just too much. For my endurance, at least)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TeeGee\u0022 data-cite=\u0022TeeGee\u0022\u003E\u003Cdiv\u003EAnd with regards to Dangit... and I suppose having 100% reliable parts is super realistic?!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s totally unrealistic: this doesn\u0027t make Dang It a realism mod. It\u0027s just not modeling the failures correctly: it might be fun gameplay for some, but it\u0027s definitely not realistic. Engines, in particular, are plain wrong: they should have a chance of exploding when you ignite them. I know a thing or two about this, since, you know, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81794\u0022 rel=\u0022external nofollow\u0022\u003EI made it\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2015-01-17T23:55:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TeeGee\u0022 data-cite=\u0022TeeGee\u0022\u003E\u003Cdiv\u003EWhere is your center of lift on that rocket? Show me.\u003Cp\u003EEDIT: I meant build a rocket and launch a PROBE into orbit. Not launch a rocket with a probe core on it. My bad.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI accept gold stars by email, cheque or Bitcoin, thank you.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/V5g6Y\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EYou miss stage separation because it was just pretty much more of the same - follow the prograde vector down until nearly horizontal, wait for AP to reach desired height, then decouple and wait for AP.\u003C/p\u003E\u003Cp\u003EFAR is not hard. It\u0027s just different.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-17T23:59:05Z\u0022 title=\u002201/17/2015 11:59  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 17, 2015\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"}]}