{"TopicId":97789,"ForumId":20,"TopicTitle":"Friendly Rentry","CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-01-25T18:15:27Z","PageNum":1,"Articles":[{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-01-25T18:15:27Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EYes I know DRE has difficulty settings they don\u0027t do what I want please stop bringing them up as a substitute for the mod being proposed here.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EJust throwing an idea out in the open because I\u0027m not a coder and likely won\u0027t be one for a very long time, but I do know how to model and get parts into the game so if anyone wants to arrange a parts for code exchange I\u0027m open to negotiations.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EBasically I\u0027m looking for a lighter more forgiving version of deadly reentry like how \u003Cem\u003ESnacks!\u003C/em\u003E is to \u003Cem\u003ETAC Life Support\u003C/em\u003E, or \u003Cem\u003EAntenna Range\u003C/em\u003E is to \u003Cem\u003ERemote Tech\u003C/em\u003E, or \u003Cem\u003EStock Drag Fix\u003C/em\u003E is to \u003Cem\u003EFAR\u003C/em\u003E. Something that doesn\u0027t need extra parts, and by default won\u0027t kill my kerbals or destroy my ships in the process.\u003C/p\u003E\u003Cp\u003EWhat it would do in game seems simple enough if you\u0027re ship reenters to steep, and to fast it will hurt your recovery factor in career mode. Bare minimum that\u0027s all it needs. No fussing about orientations or what the ship is made out of. It only does just enough to make reentry a relevant gameplay factor without becoming so complex, and realistic that it becomes the game itself. \u003C/p\u003E\u003Cp\u003EOther potential penalties for a bad reentry could be charging the other currency\u0027s as well like a science recovery penalty or a reputation hit, and maybe even denying kerbals XP or baking them alive for the hardcore out there though at that point why not use DRE? \u003C/p\u003E\u003Cp\u003EAnd at the risk of feature creep setting in ways to combat reentry effects could include strategies in the admin building aimed towards minimizing the damage to the different currencies, or taking the crafts average crash tolerance across all parts to determine the steepest angle it can take before it starts getting damaged, or even giving you a recovery factor bonus based on the skill of an engineer you are carrying, but like I said before the feature creep sets in bare minimum all it needs is a recovery factor penalty based on how steep and how fast you are going.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-26T19:03:04Z\u0022 title=\u002201/26/2015 07:03  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 26, 2015\u003C/time\u003E by passinglurker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rynak","CreatedById":115092,"CreatedDateTime":"2015-01-25T18:24:36Z","Content":"\n\u003Cp\u003EI think this might be too \u0022friendly\u0022. I completely agree with simplicity here - like not requiring extra parts or part properties. But reentry should be capable of destroying a craft, even if only in very extreme cases (so, it could be very \u0022forgiving\u0022 - heck, you could make this a config option). It also would need UI feedback... like a general heat and damage meter... not per part, but just for the entire vessel.\u003C/p\u003E\u003Cp\u003EAt low damage levels, it could work as you decribed - lower recovery. Once surpassing 100%, parts would start to explode, with the order based on the max temperature rating of the parts.\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-01-25T18:38:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rynak\u0022 data-cite=\u0022rynak\u0022\u003E\u003Cdiv\u003EI think this might be too \u0022friendly\u0022. I completely agree with simplicity here - like not requiring extra parts or part properties. But reentry should be capable of destroying a craft, even if only in very extreme cases (so, it could be very \u0022forgiving\u0022 - heck, you could make this a config option). It also would need UI feedback... like a general heat and damage meter... not per part, but just for the entire vessel.\u003Cp\u003EAt low damage levels, it could work as you decribed - lower recovery. Once surpassing 100%, parts would start to explode, with the order based on the max temperature rating of the part.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ekerbal is just a game why is destructive reentry essential and if it is why not just use DRE?\u003C/p\u003E\u003Cp\u003EIt seems to me that what you described is essentially DRE just with the recovery factor penalty on top if not less forgiving as your orientation and ship construction can\u0027t save you from burning up and destroying important but fragile parts like parachutes or science(it doesn\u0027t matter if most of you survived reentry if you lose your chutes)\u003C/p\u003E\u003Cp\u003EI\u0027m not saying it shouldn\u0027t be an option that\u0027s left off by default but to actually make this a reality I want to keep things as dead simple as possible until an implementation is in the wild so just recovery factor based on angle and speed. That\u0027s what I\u0027d make parts in exchange for and what comes after that is up to the modder that codes it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T18:50:25Z\u0022 title=\u002201/25/2015 06:50  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by passinglurker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-01-25T18:51:33Z","Content":"\n\u003Cp\u003EMy 2fund: If we have reentry penalty, it should be destructive. Kind of like how if we crash a rocket to the ground result in explosions. More explosions are nice, imo, and it teaches players things.\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-01-25T18:56:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EMy 2fund: If we have reentry penalty, it should be destructive. Kind of like how if we crash a rocket to the ground result in explosions. More explosions are nice, imo, and it teaches players things.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Emy issue with that is that it essentially destroys the mod\u0027s niche like how everyone keeps asking the snacks! dev to add a dedicated snack storage part and kerbal starvation like they just want him to make it into a second TAC. In my view a diet version of a big realism mod absolutly needs to be nonlethal by default to differentiate itself.\u003C/p\u003E\n"},{"CreatedByName":"rynak","CreatedById":115092,"CreatedDateTime":"2015-01-25T19:05:06Z","Content":"\n\u003Cp\u003EWell, to put it simple: You want two aspects as the \u0022niche\u0022: Simplicity and nonlethality. \u003C/p\u003E\u003Cp\u003EI and some others think that simplicity, and configurable difficulty is enough of a reason. And yes, if the difficulty is scalable, it could go from as nonlethal as your proposal, to \u0022harder than DRE\u0022. The common theme would be simplicity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T19:07:22Z\u0022 title=\u002201/25/2015 07:07  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by rynak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2015-01-25T19:45:28Z","Content":"\n\u003Cp\u003Ethe only problem with the original proposal is that the mod would only work as intended in full career mode; even in just science mode it would be severely gimped, and in sandbox it would be entirely disabled. I don\u0027t think there\u0027s a solution to that so it may be something that just has to be put up with.\u003C/p\u003E\n"},{"CreatedByName":"Vindaloo","CreatedById":134734,"CreatedDateTime":"2015-01-26T14:58:13Z","Content":"\n\u003Cp\u003EDeadly Re-entry has a settings options, you can put it on Easy. It does add parts, but the heat-shields are just very thin decouplers, not very complicated.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-26T16:16:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vindaloo\u0022 data-cite=\u0022Vindaloo\u0022\u003E\u003Cdiv\u003EDeadly Re-entry has a settings options, you can put it on Easy. It does add parts, but the heat-shields are just very thin decouplers, not very complicated.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty much what vindaloo said. You can adjust DRE to fit your needs. \u003Ca href=\u0022https://youtu.be/QYh3BcVFGtM?t=18m20s\u0022 rel=\u0022external nofollow\u0022\u003EThis is an older video \u003C/a\u003Ebut I think it\u0027s mostly valid. As far as heat shields go, you do not require them, it is possible to reenter without generating too much heat.\u003C/p\u003E\u003Cp\u003EI don\u0027t know how true this is, but I\u0027ve heard it said that NASA only uses heat shield because they don\u0027t want our craft entering the atmosphere over foreign air space, but the shuttle could have been made without any heat shield at all if it weren\u0027t for that restriction.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-26T16:25:29Z\u0022 title=\u002201/26/2015 04:25  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 26, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-01-26T17:26:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vindaloo\u0022 data-cite=\u0022Vindaloo\u0022\u003E\u003Cdiv\u003EDeadly Re-entry has a settings options, you can put it on Easy. It does add parts, but the heat-shields are just very thin decouplers, not very complicated.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EPretty much what vindaloo said. You can adjust DRE to fit your needs. \u003Ca href=\u0022https://youtu.be/QYh3BcVFGtM?t=18m20s\u0022 rel=\u0022external nofollow\u0022\u003EThis is an older video \u003C/a\u003Ebut I think it\u0027s mostly valid. As far as heat shields go, you do not require them, it is possible to reenter without generating too much heat.\u003Cp\u003EI don\u0027t know how true this is, but I\u0027ve heard it said that NASA only uses heat shield because they don\u0027t want our craft entering the atmosphere over foreign air space, but the shuttle could have been made without any heat shield at all if it weren\u0027t for that restriction.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou two don\u0027t understand DRE only reprimands you for bad flying with destruction by setting it on easier settings you might as well not even use it. What the proposal does is it leverage changes to ksp that have come about after DRE was first released to find new ways to penalize you for bad flying.\u003C/p\u003E\u003Cp\u003EIts for those who want reentry to be a simple factor gameplay wise, but don\u0027t want to be realistic, or lethal.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-01-26T17:59:14Z","Content":"\n\u003Cp\u003EWhy anyone would want non-lethal reentry is beyond me. People blow up kerbals on takeoff constantly, but whine if they auger in on reentry?\u003C/p\u003E\n"},{"CreatedByName":"passinglurker","CreatedById":103157,"CreatedDateTime":"2015-01-26T19:00:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tater\u0022 data-cite=\u0022tater\u0022\u003E\u003Cdiv\u003EWhy anyone would want non-lethal reentry is beyond me. People blow up kerbals on takeoff constantly, but whine if they auger in on reentry?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E *guilty as charged* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ELook some people see the gameplay aspects added by various realism mods (Remote Tech, TAC Life Support, etc...), and want to play a game with those aspects and considerations but don\u0027t want the realistic complexity those mods weigh you down with so they seek out simplified versions (Antenna Range, Snacks!, etc...). Clearly there are people who are into this sort of thing whether you can comprehend it or not.\u003C/p\u003E\u003Cp\u003EThe problem with destructive reentry in my view is you either need DRE\u0027s level of complexity to pull off in a way that is fair and fun for the player or it happens in such rare and extreme cases that you can easily avoid any ill effect meaning you might as well just not have it installed and just roleplay. So since a simplified version can\u0027t really offer destructive reentry that doesn\u0027t cruelly screw you over or that can\u0027t be offered by tweaking the difficulty settings of another existing mod one must find another way to penalize the player for a bad reentry at least for the majority of reentry cases in order to differentiate itself. destruction while potentially fun can\u0027t be the simplified mods primary feature nor is it needed as a feature because as others point out you can just set DRE on easy to kill you when you slam straight into kerbin at interplanetary speed, and potentially you can just run both at the same time. Hence my focus on the potential nonlethal consequences those being a penalty to your career mode currency when you make a bad reentry.\u003C/p\u003E\n"},{"CreatedByName":"hab136","CreatedById":75997,"CreatedDateTime":"2015-01-27T08:44:49Z","Content":"\n\u003Cp\u003ESince Deadly Re-entry has already done all the hard work (computing re-rentry), it would probably make sense to just add an optional \u0022friendly\u0022 mode on it where it just affects recoverability of the craft instead of exploding. Would be a lot easier than starting a new mod from scratch.\u003C/p\u003E\u003Cp\u003EPersonally I think the idea is really niche.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-01-27T14:56:29Z","Content":"\n\u003Cp\u003EIf you don\u0027t have DRE, then reentry is friendly. If you have DRE and want it less dangerous (normal is pretty non-dangerous anyway) set DRE to \u0022easy.\u0022 I\u0027m not seeing the problem.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-27T15:08:54Z","Content":"\n\u003Cp\u003EI\u0027m just not getting the concept here. You don\u0027t want re-entry heating, you reentry pickpocketing? Instead of Deadly Re-entry you could call it Thieving Re-entry. I just don\u0027t get it really, I agree this sounds like a mod that a very small amount of people would use, and I wouldn\u0027t, so I am going to pass. I have a feeling most modders are going to say this same, something this niche is best done by you. Pick up a beginner C# book and get started.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-01-27T15:09:28Z","Content":"\n\u003Cp\u003EI think the idea is that, there should be penalties for doing things \u0022wrong\u0022, but the penalty should just be a slap on the wrist instead of busting out a chainsaw and slice your hand clean off.\u003C/p\u003E\u003Cp\u003EOk, bad analogy. \u0026gt;.\u0026gt;\u003C/p\u003E\u003Cp\u003EBut still, I think with stock aerodynamic being fixed and such, at one point reentry will have their own stock interpretation. After all why else they have those temperature stats for? And deadly reentry simply use those stats and provide a method of heat generation.\u003C/p\u003E\u003Cp\u003EWhat is being asked here, however, is different. It will require heat generation, but it will also require a separate kind of heat tracking and convert it to penalty for recovery, because it can\u0027t use the stock heat tolerance stat which deadly reentry uses(exceeding it in stock means explosions). It will a bit more complex for the developer than deadly reentry itself for the sake of being easier.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2015-01-30T19:40:06Z","Content":"\n\u003Cp\u003EI think the OP should fork DRE, strip the parts and hack the crap out of it until he\u0027s happy. Slap a new name on it and put it up for download. \u003C/p\u003E\u003Cp\u003ECall it \u0027Mean Reentry\u0027 or \u0027Scolding Reentry\u0027 or something.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-01-31T15:01:25Z","Content":"\n\u003Cp\u003EEven with hard mode, DRE is very forgiving. You really have to to a lot of mistakes to destroy a vehicle...\u003C/p\u003E\n"}]}