{"TopicId":103963,"ForumId":36,"TopicTitle":"[WIP][1.9.x-1.12.x] Scatterer-atmospheric scattering (0.0838 - 14/08/2022) Scattering improvements, in-game atmo generation and multi-sun support","CreatedByName":"blackrack","CreatedById":104258,"CreatedDateTime":"2015-04-12T08:37:35Z","PageNum":275,"Articles":[{"CreatedByName":"Agustin","CreatedById":172127,"CreatedDateTime":"2017-12-01T19:19:20Z","Content":"\u003E \n\u003E \n\u003E 3 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E [@Agustin](https://forum.kerbalspaceprogram.com/index.php?/profile/172127-agustin/) The error is not caused by TextureReplacer, but is being triggered by TexturesUnlimited; the code with the error would *appear* to be in the Scatterer code that disables scatterer for reflection cameras  (I say *appear*, as sometimes the root cause of a problem can be not what it would seem).  The solution will likely have to come on the Scatterer end of things, though I won\u0027t know more until I can setup the Scatterer repo/build environment and dig in for some testing.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E (I am quite curious why I have not seen any of these problems during my debug/testing?  Are you using DX9 by chance? )\n\u003E \n\nI am using DX11, and I can\u0027t reproduce because if I reload (f5 and f9) the errors dissapear.  \n\nEDIT: I am testing and it happens whenever the bug wants it to happen. It seems very random and a quickload solves it. But it happens quite often\n\n**Edited \u003Ctime datetime=\u00222017-12-01T19:20:47Z\u0022 title=\u002212/01/2017 07:20  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 1, 2017\u003C/time\u003E by Agustin**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-12-01T19:29:31Z","Content":"\u003E \n\u003E \n\u003E 1 minute ago, Agustin said:\n\u003E \n\u003E \n\u003E I am using DX11, and I can\u0027t reproduce because if I reload (f5 and f9) the errors dissapear.\n\u003E \n\nThanks for the confirmation.  Just had to check if it was yet another \u0027DX9\u0027 related problem.\n\nAfter a bit of reading through the Scatterer source-code, the problem would appear to be this:\n\n[https://github.com/LGhassen/Scatterer/blob/master/scatterer/DisableEffectsForTextureReplacer.cs#L34](https://github.com/LGhassen/Scatterer/blob/master/scatterer/DisableEffectsForTextureReplacer.cs#L34)\n\nWhere neither the array, nor the elements in the array, are being checked for null prior to access.  This may or may not be an \u0027error\u0027 (you shouldn\u0027t always need to check for null) in that particular line of code, but would at least point to there being an error -somewhere- (if null is not a valid value for the array, then why is the preCull() method being called before the array is initialized/populated?).\n\nI would -infer- that what is happening is that TU is rendering reflections before Scatterer is fully initialized, and thus the arrays are not populated when the method is first called.  Either way, not something that I can readily solve in TU code; the solution will need to come from Scatterer (I could potentially *work around* the problem in TU...but I only resort to such hacks as a last resort).\n\n[@blackrack](https://forum.kerbalspaceprogram.com/index.php?/profile/104258-blackrack/) any opposition if I were to put together a quick PR to clean up this problem?  Seems that a boolean flag that is set at the time the arrays are populated would allow for a low runtime-cost for checking if things are setup or not (a null test in Unity is often far more than a simple reference check;  a boolean test is very quick).  Could probably be as small as ~3-4 lines of changes."},{"CreatedByName":"blackrack","CreatedById":104258,"CreatedDateTime":"2017-12-02T11:18:03Z","Content":"\u003E \n\u003E \n\u003E On 30/11/2017 at 5:22 PM, Shadowmage said:\n\u003E \n\u003E \n\u003E Currently I\u0027m able to capture the standard (non-scaled space) atmosphere scattering properly during cubemap creation (e.g. while on the surface/in the atmo) -- but the scaled space scatter appears to be done as a post-process effect rather than as a rendered mesh (e.g. no atmosphere/scattering in reflections when on-orbit).  Is this still the case / changing at all?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E (On that note, I would love for there to be a method to properly capture the post-process effects (ocean/scaled-space scatter) in cubemap reflection cameras; could possibly put together a PR if there was interest in such a feature/support)\n\u003E \n\nTo my knowledge it should be the opposite, scaledSpace effects should be fine while local post-processing should be messed up or disabled. I would like to see some screens of the local post-processing actually being captured in the cubemaps.\n\n\u003E \n\u003E \n\u003E On 01/12/2017 at 12:05 AM, Shadowmage said:\n\u003E \n\u003E \n\u003E Well, currently if you give your camera the same name as the Texture Replacer camera -- it ~~will~~ *should* remove the visual artifacts ( name:  TRReflectionCamera  ).  This is some code built-into Scatterer that disables the post-processing anytime a camera with that specific name is doing any rendering, and it works great so far from my interactions with it.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E But it does this by disabling post processing for those cameras -- which, by its nature, precludes any potential to use the effects from that post-processing (god-ray-shadows, ocean surfaces, probably more I haven\u0027t poked at).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E *If* I\u0027ve read the Scatterer code correctly -- it *might* be possible to properly setup the post-processing effects so that they are applied to the cubemap/other cameras properly.  I say -might-, because I\u0027m not sure how resource/computation the setup is for the different camera location/perspectives/frustum setups.  Potentially it could be \u0027as simple\u0027 as pushing a camera location, orientation and near/far clip data into the post-processing setup.\n\u003E \n\nYou can set up the camera effects to do that, but yo would also need to re-render the scatterer depth buffer for each camera as well.\n\nI\u0027m currently doing a bit of a hack to render one single high-accuracy depth buffer to use with the far and near local cameras (since they both share the same viewpoint), you would need to re-render this buffer for each custom camera, it\u0027s feasible. You would need to do the same with the godray depth buffer, or just ignore it and disable godrays for the secondary cameras.\n\nI would also advise against rendering the ocean for those cubemap reflections as I think the performance hit would be quite high for something you\u0027d barely notice in the reflections.\n\n\u003E \n\u003E \n\u003E On 01/12/2017 at 6:22 AM, Tynton said:\n\u003E \n\u003E \n\u003E [@blackrack](https://forum.kerbalspaceprogram.com/index.php?/profile/104258-blackrack/) I\u0027ve been trying to use some of JadeofMaar\u0027s lensflares for a mod that adds a number of new stars. Well what happened is that I ended up running out of RAM almost with only two stars after testing his lensflares. I\u0027m not certain entirely what is going wrong but I did use the stock scatterer lensflares without issue.\n\u003E \n\n\u003E \n\u003E \n\u003E On 01/12/2017 at 6:48 AM, Tynton said:\n\u003E \n\u003E \n\u003E Links to output log and KSP log: [https://www.dropbox.com/sh/ci6u0gqhwxd2i3b/AACjf47Tl8C9tAIAxYi_ulNFa?dl=0](https://www.dropbox.com/sh/ci6u0gqhwxd2i3b/AACjf47Tl8C9tAIAxYi_ulNFa?dl=0)\n\u003E \n\nHaven\u0027t looked at this log yet but if you could link me to the exact set of lensflares and the mod that adds stars as well it would help.\n\n\u003E \n\u003E \n\u003E 17 hours ago, Agustin said:\n\u003E \n\u003E \n\u003E I am trying but it\u0027s difficult. Recently I launched a rocket and everything was okay. Then I reverted to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and launched again, and full of constant nullreference messages. I reverted back and launched again(exact thing I did before, seconds after launchnig) and the errors were not there anymore. Maybe I am in space and it starts to happen again with no aparent reason...\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Next time it happens I will save and try to make it reproducable or something\n\u003E \n\nPlease provide instructions and mods to reproduce it.\n\n\u003E \n\u003E \n\u003E 15 hours ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Thanks for the confirmation.  Just had to check if it was yet another \u0027DX9\u0027 related problem.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E After a bit of reading through the Scatterer source-code, the problem would appear to be this:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [https://github.com/LGhassen/Scatterer/blob/master/scatterer/DisableEffectsForTextureReplacer.cs#L34](https://github.com/LGhassen/Scatterer/blob/master/scatterer/DisableEffectsForTextureReplacer.cs#L34)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Where neither the array, nor the elements in the array, are being checked for null prior to access.  This may or may not be an \u0027error\u0027 (you shouldn\u0027t always need to check for null) in that particular line of code, but would at least point to there being an error -somewhere- (if null is not a valid value for the array, then why is the preCull() method being called before the array is initialized/populated?).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I would -infer- that what is happening is that TU is rendering reflections before Scatterer is fully initialized, and thus the arrays are not populated when the method is first called.  Either way, not something that I can readily solve in TU code; the solution will need to come from Scatterer (I could potentially *work around* the problem in TU...but I only resort to such hacks as a last resort).  \n\u003E [@blackrack](https://forum.kerbalspaceprogram.com/index.php?/profile/104258-blackrack/) any opposition if I were to put together a quick PR to clean up this problem?  Seems that a boolean flag that is set at the time the arrays are populated would allow for a low runtime-cost for checking if things are setup or not (a null test in Unity is often far more than a simple reference check;  a boolean test is very quick).  Could probably be as small as ~3-4 lines of changes.\n\u003E \n\nI haven\u0027t investigated this, but my guess would be, after a planet is unloaded or a scene change, the destroyed ocean meshRenderers are not cleared from the array.\n\nGo ahead with the PR.\n\nHtw I haven\u0027t really been up to date with the KSP mod scene recently, but your Textures Unlimited mod looks great, I think I will go check it out.\n\n**Edited \u003Ctime datetime=\u00222017-12-02T11:22:52Z\u0022 title=\u002212/02/2017 11:22  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 2, 2017\u003C/time\u003E by blackrack**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-12-02T17:44:27Z","Content":"\u003E \n\u003E \n\u003E 5 hours ago, blackrack said:\n\u003E \n\u003E \n\u003E To my knowledge it should be the opposite, scaledSpace effects should be fine while local post-processing should be messed up or disabled. I would like to see some screens of the local post-processing actually being captured in the cubemaps.\n\u003E \n\nYou are more than likely correct.  I had assumed it was the scaled-space stuff that was not being captured, as the reflections appeared to not have much atmosphere while in-orbit, but look fine while in-atmo.\n\nBut looking at things a bit more in depth (read:   just watching the reflections as \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E flies...), it actually seems to be capturing things fairly well...\n\nLower in atmo (oceans missing, but that is to be expected, and hardly noticeable:\n\n![8DR18ux.png](https://i.imgur.com/8DR18ux.png)\n\n125km/\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E - seems to be working well here as well.  At least good enough for a reflection probe camera.\n\n![qWngujh.png](https://i.imgur.com/qWngujh.png)\n\nSo I guess this is a \u0027nothing to see here\u0027.\n\n(there -might- have been some rendering order/layering issues in TU that I cleaned up recently that was causing me to think the from-orbit atmosphere was not being captured;  as it obviously is working fine in the screnshots above)\n\n\u003E \n\u003E \n\u003E 5 hours ago, blackrack said:\n\u003E \n\u003E \n\u003E You can set up the camera effects to do that, but yo would also need to re-render the scatterer depth buffer for each camera as well.\n\u003E \n\nWhich was what I was kind of afraid of, and probably not worth it in the long run for these low(ish)-res reflections.  Normally these reflections are blurred / convolved, so the details like godrays/oceans would be obscured by the blurring anyway.\n\nThanks for the confirmation and information either way though.\n\n\u003E \n\u003E \n\u003E 6 hours ago, blackrack said:\n\u003E \n\u003E \n\u003E I haven\u0027t investigated this, but my guess would be, after a planet is unloaded or a scene change, the destroyed ocean meshRenderers are not cleared from the array.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Go ahead with the PR.\n\u003E \n\nYeah, that seems like it could be a likely culprit.   I\u0027ll work on a PR as soon as I can find out how to duplicate/trigger the problem -- it doesn\u0027t seem to happen during any of my normal play/testing workflow, so need to find how to duplicate it first.  After that, should be relatively simple to fix it up in one place or another (depending on exactly what the cause is).\n\n\u003E \n\u003E \n\u003E 6 hours ago, blackrack said:\n\u003E \n\u003E \n\u003E Htw I haven\u0027t really been up to date with the KSP mod scene recently, but your Textures Unlimited mod looks great, I think I will go check it out.\n\u003E \n\nThanks ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)   Yeah, TU is quite new, only been released for a few weeks... still going through some growing pains and optimization work.\n\nIts really not too much more than some Unity-Standard (PBR) shader analogues, a few config-based texture-set/texture-replacement handling functions, and a collection of hacks and workarounds to get reflection-probes working in KSP.  The PBR shaders though, once proper textures are created for them, can really be very visually stunning (and can even make the existing stock textures/parts much more appealing)."},{"CreatedByName":"blackrack","CreatedById":104258,"CreatedDateTime":"2017-12-02T17:55:29Z","Content":"\u003E \n\u003E \n\u003E 16 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Lower in atmo (oceans missing, but that is to be expected, and hardly noticeable:\n\u003E \n\n![rGVinF9.jpg](https://i.imgur.com/rGVinF9.jpg)\n\nNotice also that there is no scattering effects on the mountains. As it requires depth information, I\u0027ve disabled it for texture replacer so only the sky is visible.\n\nAnyway, from my own testing with texture replacer I noticed that the atmosphere may not reflect at 100km altitude but will reflect in scaledSpace (160km\u002B), not sure why here but maybe texture replacer stops rendering the local layers above a certain altitude (the sky is rendered in the background of the local camera until we switch to scaledSpace), if your reflections work everywhere however then all the better.\n\nI figured as well that we can get away with just the sky being visible as it\u0027s mostly not noticeable for reflections.\n\nAnyway, best of luck with your mod, and if you manage to reproduce the issue let me know so I can look at it as well.\n\n**Edited \u003Ctime datetime=\u00222017-12-02T18:01:36Z\u0022 title=\u002212/02/2017 06:01  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 2, 2017\u003C/time\u003E by blackrack**"},{"CreatedByName":"Javascap","CreatedById":74106,"CreatedDateTime":"2017-12-03T03:03:32Z","Content":"I\u0027m having a bit of an issue, it\u0027s so dark! I have a picture of an early probe I\u0027m launching, and even in full daytime, there\u0027s absolutely no sunlight on the probe. I actually wasn\u0027t having this issue until I upgraded to the most recent \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E version of Scatterer. The two snags I can think of are that I am running KScale set to a 6.4 rescale, and I also have Stock Visual Enhancements, but I am not sure if I have a config conflict or what the specific problem could be.  \n\nEdit: I also have the Valentine star system installed. Could having two light sources be causing the issue?\n\nEdit: Yup, it was the Extrasolar mod.  \n\nTwo pictures showing my problem - [https://imgur.com/a/ytagI](https://imgur.com/a/ytagI)\n\n**Edited \u003Ctime datetime=\u00222017-12-03T03:26:46Z\u0022 title=\u002212/03/2017 03:26  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 3, 2017\u003C/time\u003E by Javascap**"},{"CreatedByName":"Galileo","CreatedById":150430,"CreatedDateTime":"2017-12-03T05:51:38Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, Javascap said:\n\u003E \n\u003E \n\u003E I\u0027m having a bit of an issue, it\u0027s so dark! I have a picture of an early probe I\u0027m launching, and even in full daytime, there\u0027s absolutely no sunlight on the probe. I actually wasn\u0027t having this issue until I upgraded to the most recent \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E version of Scatterer. The two snags I can think of are that I am running KScale set to a 6.4 rescale, and I also have Stock Visual Enhancements, but I am not sure if I have a config conflict or what the specific problem could be.  \n\u003E   \n\u003E \n\u003E Edit: I also have the Valentine star system installed. Could having two light sources be causing the issue?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Edit: Yup, it was the Extrasolar mod.  \n\u003E   \n\u003E \n\u003E Two pictures showing my problem - [https://imgur.com/a/ytagI](https://imgur.com/a/ytagI)\n\u003E \n\nExtra solar needs to update the star cfgs to work properly with the latest Kopernicus.\n\nI also highly recommend not using Kscale, and not just because I made this mod. KScale is not as comprehensive as these cfgs and will make your scaled planets work seamlessly with SVE.\n\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5068307322\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/163965-131-rescale-comprehensive-sd-configs-1027-10-oct-2017/\u0026do=embed\u0022 style=\u0022height:211px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\n**Edited \u003Ctime datetime=\u00222017-12-03T05:54:00Z\u0022 title=\u002212/03/2017 05:54  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 3, 2017\u003C/time\u003E by Galileo**"},{"CreatedByName":"Vienetta","CreatedById":183409,"CreatedDateTime":"2017-12-09T00:56:45Z","Content":"Ok so when ever my clouds turn to scaled mode says console this happens and its flashing very rapidly\n\n[http://prntscr.com/hl1dpm](http://prntscr.com/hl1dpm)"},{"CreatedByName":"maxbgould","CreatedById":178108,"CreatedDateTime":"2017-12-11T17:49:40Z","Content":"Will you be bringing out a version for 1.3.1"},{"CreatedByName":"Juba","CreatedById":183260,"CreatedDateTime":"2017-12-12T08:08:07Z","Content":"Hi\n\nI have this issue when using Scatterer \u002B Windowshine\n\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/5ZPlhctqZD4?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\n[@blackrack](https://forum.kerbalspaceprogram.com/index.php?/profile/104258-blackrack/)   [@Avera9eJoe](https://forum.kerbalspaceprogram.com/index.php?/profile/80363-avera9ejoe/) \n\n**Edited \u003Ctime datetime=\u00222017-12-12T08:51:25Z\u0022 title=\u002212/12/2017 08:51  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 12, 2017\u003C/time\u003E by Juba**"},{"CreatedByName":"Brigadier","CreatedById":147109,"CreatedDateTime":"2017-12-12T15:23:57Z","Content":"\u003E \n\u003E \n\u003E 21 hours ago, maxbgould said:\n\u003E \n\u003E \n\u003E Will you be bringing out a version for 1.3.1\n\u003E \n\nWhat makes you think it isn\u0027t good for KSP 1.3.1?  I think you\u0027ll find your answers back 5-10 pages in the thread."},{"CreatedByName":"Jesusthebird","CreatedById":176735,"CreatedDateTime":"2017-12-14T21:31:55Z","Content":"Im not poking the bear ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) Just wondering if there are any plans to make cfgs stable/compatible with galactic neighborhood? Currently kerbin is half blue(looks like a thick atmophere) im going to try the fix mentioned with the known issues. But just wondering. It may be a graphic issue with planetshine or sve..but im not sure just yet. Sigma states GN would need some custom cfgs to work properly. Possibly in the works for the future? Thanks!"},{"CreatedByName":"olekopyto","CreatedById":137922,"CreatedDateTime":"2017-12-17T09:41:58Z","Content":"**Hello yes,**\n\ni would like to know what value in the config file is responsible for changing the colour of the atmosphere scatter. I\u0027m trying to get Jool to be blue for Alternis planet pack (the one with kerbin orbiting aroud blue jool with bop as the moon)."},{"CreatedByName":"cy4n","CreatedById":185531,"CreatedDateTime":"2017-12-17T17:30:14Z","Content":"[@olekopyto](https://forum.kerbalspaceprogram.com/index.php?/profile/137922-olekopyto/) I believe the value you\u0027re looking for is m\\_betaR, however, you will also require new textures from the [scatterer config tool](https://raw.githubusercontent.com/LGhassen/Scatterer/c17fe61a316d8e0e03b769ebc64741e1755ab2c4/configTool.zip)\n\nEdit: Also there is a section on how to use the config tool in the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E\n\n**Edited \u003Ctime datetime=\u00222017-12-17T17:31:04Z\u0022 title=\u002212/17/2017 05:31  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 17, 2017\u003C/time\u003E by Osmium**"},{"CreatedByName":"Autolyzed Yeast Extract","CreatedById":168053,"CreatedDateTime":"2017-12-18T07:58:13Z","Content":"Is there any way to improve performance with this?\n\nI have a computer that can run basically any KSP mod and have a solid 40 FPS (albeit run out of memory) with the exception of scatterer which bogs me to 10-20, and it\u0027s really bumming me out."},{"CreatedByName":"Tandoori","CreatedById":125040,"CreatedDateTime":"2017-12-19T17:07:39Z","Content":"Yeah, I\u0027m also having some serious performance issues with this and 1.3. I just got a new Surface Book 2 13.5\u0022  with an i7, 16GB RAM and GTX 1050, and the frame rate is terrible with Scatterer installed while running at 1900x1200 resolution. The specs on this machine should be more than sufficient to run smoothly at decent framerates with simple rockets."},{"CreatedByName":"Galileo","CreatedById":150430,"CreatedDateTime":"2017-12-19T17:23:02Z","Content":"\u003E \n\u003E \n\u003E 14 minutes ago, Tandoori said:\n\u003E \n\u003E \n\u003E Yeah, I\u0027m also having some serious performance issues with this and 1.3. I just got a new Surface Book 2 13.5\u0022  with an i7, 16GB RAM and GTX 1050, and the frame rate is terrible with Scatterer installed while running at 1900x1200 resolution. The specs on this machine should be more than sufficient to run smoothly at decent framerates with simple rockets.\n\u003E \n\nHave you turned off water refraction..? that is what is getting most people."},{"CreatedByName":"BigFish","CreatedById":177051,"CreatedDateTime":"2017-12-20T10:37:55Z","Content":"Good morning,\n\nFirstly, thanks Blackrack, and everyone else who has contributed to this mod, it is simply amazing and you should be proud of how much better you have made the game look.\n\nHowever, I have a couple of minor graphics glitches that I have chased back to Scatterer I think. I don\u0027t think any of them are a problem with Scatterer itself, but could both be fixed by changing some settings in the Scatterer config menu... however, I am not sure which ones\n\nFirstly, I have a thin darker line alongside the right side of all my craft in Kerbins atmosphere, it looks like there is a band a couple of pixels wide where the Scatterer effects aren\u0027t implemented and un-modded Kerbin is showing through. This seems particularly noticeable over water, and seems to fade away by the time my crafts are in space. Frustratingly, it is not present in screenshots so my vague description is all I have.\n\nSecondly, the whitecap effect only shows when there is something behind it. If i have a Kerbal floating in the ocean, the whitecaps only appear overlaid on the parts of his body that are refracted and don\u0027t appear on water with nothing behind it.\n\nNeither of these glitches is game breaking for me and are more likely a result of my creaky old laptop. If you think they are worth looking into and not issues that can be solved with the right settings tweaks, I can sort out a fresh install and submit logs, but don\u0027t worry about it if you are busy, have bigger problems to solve or cant be bothered!\n\nThanks again and happy xmas for those who celebrate it ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nBF"},{"CreatedByName":"chaos9830","CreatedById":113225,"CreatedDateTime":"2017-12-20T16:10:57Z","Content":"Are stars not supposed to show up at night on kerbin? Is there a way to turn them on?"},{"CreatedByName":"tsd","CreatedById":171278,"CreatedDateTime":"2017-12-21T15:35:57Z","Content":"I think you just need to wait a bit more for them to turn on"},{"CreatedByName":"Electrocutor","CreatedById":109593,"CreatedDateTime":"2017-12-21T16:50:18Z","Content":"\u003E \n\u003E \n\u003E On 12/2/2017 at 11:55 AM, blackrack said:\n\u003E \n\u003E \n\u003E ![rGVinF9.jpg](https://i.imgur.com/rGVinF9.jpg)\n\u003E \n\u003E \n\u003E \n\u003E Notice also that there is no scattering effects on the mountains. As it requires depth information, I\u0027ve disabled it for texture replacer so only the sky is visible.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Anyway, from my own testing with texture replacer I noticed that the atmosphere may not reflect at 100km altitude but will reflect in scaledSpace (160km\u002B), not sure why here but maybe texture replacer stops rendering the local layers above a certain altitude (the sky is rendered in the background of the local camera until we switch to scaledSpace), if your reflections work everywhere however then all the better.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I figured as well that we can get away with just the sky being visible as it\u0027s mostly not noticeable for reflections.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Anyway, best of luck with your mod, and if you manage to reproduce the issue let me know so I can look at it as well.\n\u003E \n\nMaybe this has something to do with the 3 layers of planet rendering. While on the ground, it uses terrain shader rendering; at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E it uses PQS shader rendering, higher up it uses scaled-space shader rendering.\n\n**Edited \u003Ctime datetime=\u00222017-12-24T04:33:47Z\u0022 title=\u002212/24/2017 04:33  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 24, 2017\u003C/time\u003E by Electrocutor**"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2017-12-22T18:35:24Z","Content":"\u003E \n\u003E \n\u003E On 18.12.2017 at 9:58 AM, Pavel ☭ said:\n\u003E \n\u003E \n\u003E Is there any way to improve performance with this?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I have a computer that can run basically any KSP mod and have a solid 40 FPS (albeit run out of memory) with the exception of scatterer which bogs me to 10-20, and it\u0027s really bumming me out.\n\u003E \n\n\u003E \n\u003E \n\u003E On 19.12.2017 at 7:07 PM, Tandoori said:\n\u003E \n\u003E \n\u003E Yeah, I\u0027m also having some serious performance issues with this and 1.3. I just got a new Surface Book 2 13.5\u0022  with an i7, 16GB RAM and GTX 1050, and the frame rate is terrible with Scatterer installed while running at 1900x1200 resolution. The specs on this machine should be more than sufficient to run smoothly at decent framerates with simple rockets.\n\u003E \n\nCan confirm. i7 2600K @ 4.4 GHz, GTX 970, 16GB RAM at 1920x1080 and my performance is also tanking like crazy with Scatterer installed on my modded KSP install. I get a solid 60fps without it and 30-40fps with it even though my CPU, GPU, RAM and VRAM are nowhere near maxed out\\*. Disabling ocean refractions as per [@Galileo](https://forum.kerbalspaceprogram.com/index.php?/profile/150430-galileo/)\u0027s instructions only gave me a few extra frames at most (I can\u0027t really even tell if it did anything because the framerate is all over the place).\n\n\\*CPU ~45%, GPU ~40%, VRAM ~40%, RAM ~75%\n\n**Edited \u003Ctime datetime=\u00222017-12-22T18:48:16Z\u0022 title=\u002212/22/2017 06:48  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 22, 2017\u003C/time\u003E by CaptainKorhonen**"},{"CreatedByName":"Autolyzed Yeast Extract","CreatedById":168053,"CreatedDateTime":"2017-12-23T23:13:22Z","Content":"Using Stock Visual Enhancements, for some reason the orange haze effect on the side of Kerbin and probably other planets is not present.\n\n[http://steamcommunity.com/sharedfiles/filedetails/?id=1241442497](http://steamcommunity.com/sharedfiles/filedetails/?id=1241442497)\n\nIs there a way to fix this myself? (increase a value for orange haze)"},{"CreatedByName":"BLN","CreatedById":182379,"CreatedDateTime":"2017-12-23T23:46:19Z","Content":"\u003E \n\u003E \n\u003E On 25/11/2017 at 6:16 PM, blackrack said:\n\u003E \n\u003E \n\u003E I think I may have fixed the **halo** issue for good, can you guys confirm?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [https://mega.nz/#!nN4EGRQB!Vi_QanmE9XdOQ2IBPQn6UZExvXL_xAEUBCZx6gPZ9mM](https://mega.nz/#!nN4EGRQB!Vi_QanmE9XdOQ2IBPQn6UZExvXL_xAEUBCZx6gPZ9mM)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E paging [@Epoxid](https://forum.kerbalspaceprogram.com/index.php?/profile/170132-epoxid/)\n\u003E \n\nHey everyone ! I just tested by replacing with this files and, yes the halo is gone but so is the water surface on Kerbin ... \n\nWhy me ?  \n[https://imgur.com/a/xK8Lc](https://imgur.com/a/xK8Lc)"},{"CreatedByName":"Errol","CreatedById":118622,"CreatedDateTime":"2017-12-25T02:32:04Z","Content":"\u003E \n\u003E \n\u003E On 01/10/2017 at 2:36 PM, Kearla said:\n\u003E \n\u003E \n\u003E Hey y\u0027all. Anyone know\u0027s what causes the white sky? I tried to remove all mods, only have scatterer and the Squad folder in GameData. When i removed Scatterer, it solved the problem, except i cannot use the mods that are using Scatterer.  \n\u003E [https://imgur.com/a/t0in8](https://imgur.com/a/t0in8)\n\u003E \n\nWas this question ever answered? I\u0027ve been searching the pages, and either I keep missing the reply, or it was missed and left unanswered. I\u0027m having this issue now too...  \n\nEDIT: I also had this issue when I tried SVE:  \n\n\u003E \n\u003E \n\u003E Using Stock Visual Enhancements, for some reason the orange haze effect on the side of Kerbin and probably other planets is not present.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [http://steamcommunity.com/sharedfiles/filedetails/?id=1241442497](http://steamcommunity.com/sharedfiles/filedetails/?id=1241442497)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Is there a way to fix this myself? (increase a value for orange haze)\n\u003E \n\n**Edited \u003Ctime datetime=\u00222017-12-25T02:33:55Z\u0022 title=\u002212/25/2017 02:33  AM\u0022 data-short=\u00226 yr\u0022\u003EDecember 25, 2017\u003C/time\u003E by Errol**"}]}