{"TopicId":106575,"ForumId":36,"TopicTitle":"Question: plugin career mode integration. how?","CreatedByName":"Geordiepigeonowner","CreatedById":116764,"CreatedDateTime":"2015-05-01T14:23:08Z","PageNum":1,"Articles":[{"CreatedByName":"Geordiepigeonowner","CreatedById":116764,"CreatedDateTime":"2015-05-01T14:23:08Z","Content":"Say have a plugin with no \u0027physical\u0027 parts but I only want the functionality available upon a certain teck unlock. How would I go about adding this in to my plugin?\n\nThanks in advance"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-05-01T14:31:42Z","Content":"Really nonspecifically (at work, not at home where I could get you code samples), you could check the status of the tech node in question. It should still be something like\n\n    var status = ResearchAndDevelopment.Instance.GetTechState(techID);\n\nwhich you would then check to see if it\u0027s \u0022Available\u0022. TechID is the internal name for the node, like (can\u0027t remember any specific names off the top of me head) \u0022advControl\u0022"},{"CreatedByName":"Geordiepigeonowner","CreatedById":116764,"CreatedDateTime":"2015-05-01T14:36:01Z","Content":"would that restrict it from being in a config file though? Also I\u0027m very new to modding. so actual working code snippet is probably what I\u0027ll need.....please ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2015-05-01T15:24:32Z","Content":"\u003E \n\u003E would that restrict it from being in a config file though? Also I\u0027m very new to modding. so actual working code snippet is probably what I\u0027ll need.....please ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nIf you\u0027re using VisualStudio I highly suggest taking a look through the Object Browser, specifically at what\u0027s available in the ResearchAndDevelopment class. It also will have code completion which will make things simpler.\n\nAs I said before, I\u0027m at work so I won\u0027t be able to provide working examples yet, but I can provide things that with a few corrections should work. It\u0027d be nice to know what you\u0027re trying to do specifically, so I can try to provide specific examples.\n\nAlso, I don\u0027t know what you mean by \u0022would that restrict it from being in a config file though?\u0022 If you mean that you want to have the option of defining which node has to be unlocked for your plugin to work, then you\u0027d just put the techID in the config file and people could change it to any other valid techID. If you\u0027re worrying about tech nodes that are added in the tech tree config file, those will be loaded and will have valid techIDs as well. So both of those cases should be fine (but you might need to check that the techID is valid first. You\u0027d find that out through testing).\n\nOk, say you have a function that does the work for your plugin called DoPluginWork() which gets called during the FixedUpdate(), or Start(), or on a button press, or whatever else condition you have. If you wanted it to only work when the \u0022survivability\u0022 tech node is unlocked, then you might have something like this (once again, you\u0027ll need to do a bit of correction on your own to make sure the comparison is correct):\n\n    public void DoPluginWork(){    if (ResearchAndDevelopment.Instance.GetTechState(\u0022survivability\u0022) == RDTech.State.Available)    {        //Do your plugin\u0027s job here    }}\n\nIf it\u0027s going to be doing something every single update, that might not be the best way of doing it (lot\u0027s of somewhat expensive calls to check the status), but it\u0027ll work. The other ways that might work better would be to update the status of a variable during Start() (so once per scene change) or to use the GameEvents.OnTechnologyResearched event.\n\nFor checking during Start() you could try this:\n\n    string techID = \u0022survivability\u0022;bool techIsUnlocked = false;public void Start(){    techIsUnlocked = (ResearchAndDevelopment.Instance.GetTechState(techID) == RDTech.State.Available)}public void DoPluginWork(){    if (techIsUnlocked)    {        //Do your plugin\u0027s job here    }}"}]}