{"TopicId":109629,"ForumId":36,"TopicTitle":"Space Shuttle Pack for ksp 1.0.4 dev thread","CreatedByName":"Mike-NZ","CreatedById":142683,"CreatedDateTime":"2015-05-17T09:20:30Z","PageNum":39,"Articles":[{"CreatedByName":"Drj3199","CreatedById":143663,"CreatedDateTime":"2015-06-16T00:33:10Z","Content":"Mike, I understand that you want to take a break, and honestly, you deserve one, you have done so much work on this mod and others. But you can\u0027t just give up. Take a break, maybe month, maybe more, but please come back to this. You\u0027ve done too much amazing work to just walk away."},{"CreatedByName":"daedaelus","CreatedById":113484,"CreatedDateTime":"2015-06-16T03:42:38Z","Content":"So many hands in the cookie jar is the problem and was the problem before. This project needs to be a bit less transparent.\n\nMike pick your team and use steam or skype to communicate without public involvement. Restrict information and do not give offical release dates. This is how many development games and mods go this way. This thread is way too active to get anything done.\n\nIts sad to see the shuttle die again. Please if you do quit release everything open source on github so maybe it can live another day."},{"CreatedByName":"Jeast","CreatedById":117273,"CreatedDateTime":"2015-06-16T04:45:34Z","Content":"This is exactly what I was afraid for and why I tried getting it a little bit more organized. Mike has litteraly worked days and nights and being the type who likes to please everyone, a burnout is inevitable.\n\nFirst of all its not my mod, its Mikes. He can do whatever he pleases whenever he pleases. I love the shuttle and I am a professional structural engineering 3D modeling teacher at university so when I found Mike was getting a little bussy I could step in to help a bit with the aero and the IVA. I have created a shuttle from scratch for RSS last year (for private use) and had a bit experience with getting the shuttles aero done okay. My work done is only a little drop in the bucked compared to what Mike did and I know that probably my continues pushing to get the development more structured is part of the reason Mike is burnt out. Mike my guess is you will come back, you just love this thing too much ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) I will leave the aero to you and let you handle it without me yelling and whining about organization here."},{"CreatedByName":"Mike-NZ","CreatedById":142683,"CreatedDateTime":"2015-06-16T05:04:30Z","Content":"Your support is grand.\n\n I will continue, but with those who understand the principal of testing prototype parts snd how to place or overwrite files in the game directory. I still need a team. No releases on the forum until its stable. \n\nReleases could be daily. Pm if willing or feel free to check back on the forum to find out about the next stable release\n\nProgress may be posted on forum but development discussion will be over pm messages or something we work out."},{"CreatedByName":"TheRag","CreatedById":144674,"CreatedDateTime":"2015-06-16T05:49:58Z","Content":"Mostly been semi-lurking since 1.1.5-6\n\nGlad to see this was sorted out. I hope with a tightly knit team that this project will become easier. Don\u0027t get too hard on yourself Mike, you did nothing wrong, and we certainly didn\u0027t meant to deject you. The STS is from what I can tell nearly cleaned up, it just the tedious testing and bug reporting that gets to us all. I do agree with Jeast with some-type of centralization and routine. \n\nI\u0027ve sailing on 64x bit unable to go back to 32 bit because of Chaka\u0027s SLS mod, EVE, et al, so I haven\u0027t been able to test as much."},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2015-06-16T05:56:05Z","Content":"The CSS burned another modder out this mod is cursed, close the thread rename the shuttle and start again fresh hopefully leave the bad demons here"},{"CreatedByName":"Mike-NZ","CreatedById":142683,"CreatedDateTime":"2015-06-16T06:15:46Z","Content":"Ditching the multi piece shuttle. Going down new road. Fucused on shuttle realism with the main variations that the player can choose from to perform different roles. Make all 5 and line them up outside ksp if you like, or outfit them for different missions with the nessusary addons...\n\nKsp integration with science performed in vessel and through components added.\n\nMay even have a \u0027futuristic ideas\u0027 parts pack to download seperately.\n\nAerodynamics will be Jeasts creation as it has proven to work well and I dont have much time for that.\n\nI will be doing alot of work and less releases for now. Preperation for releases takes alot of time.\n\nBut thats it for now. Will post back here with progress with what the team comes up with\n\n**Edited \u003Ctime datetime=\u00222015-06-16T06:21:47Z\u0022 title=\u002206/16/2015 06:21  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 16, 2015\u003C/time\u003E by Mike-NZ**"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-06-16T06:26:44Z","Content":"![Aye-Sir.jpg](http://cdn.neatorama.com/jill/Aye-Sir.jpg)\n\nWe will wait patiently and quiet."},{"CreatedByName":"Jovzin","CreatedById":105152,"CreatedDateTime":"2015-06-16T06:29:45Z","Content":"Hmm so everything what starts with CSS or shuttle is cursed on this forum. So it seems. \n\nGuys keep calm and get some pause or free time. Go to cinema there will be Minions so a lot of fun and no stress."},{"CreatedByName":"Jeast","CreatedById":117273,"CreatedDateTime":"2015-06-16T06:46:57Z","Content":"\u003E \n\u003E Ditching the multi piece shuttle. Going down new road. Fucused on shuttle realism with the main variations that the player can choose from to perform different roles. Make all 5 and line them up outside ksp if you like, or outfit them for different missions with the nessusary addons...\n\u003E Ksp integration with science performed in vessel and through components added.\n\u003E \n\u003E May even have a \u0027futuristic ideas\u0027 parts pack to download seperately.\n\u003E \n\u003E Aerodynamics will be Jeasts creation as it has proven to work well and I dont have much time for that.\n\u003E \n\u003E I will be doing alot of work and less releases for now. Preperation for releases takes alot of time.\n\u003E \n\u003E But thats it for now. Will post back here with progress with what the team comes up with\n\nYes it all starts with making clear goals! You can do it man, this is going to be an awesome mod."},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-06-16T06:52:03Z","Content":"Looking forward to it.\n\n\u002B1"},{"CreatedByName":"daedaelus","CreatedById":113484,"CreatedDateTime":"2015-06-16T23:59:00Z","Content":"Im glad this is going to continue Mike i sent you some specs on shuttle differences that might help you in a pm."},{"CreatedByName":"floravante","CreatedById":146428,"CreatedDateTime":"2015-06-17T02:57:08Z","Content":"I as been a long time voyeur in this forum, but this time i as been forced to register in here just to say thanks (really), for this guys, so Mike and Jeast thanks for yours time and effort, is impossible to say how many hours of and fun i have lately after a crap work day just because someone as been worked hard in my favorite mod, so again thanks! Sorry for the bad English and cheers from Brazil."},{"CreatedByName":"Mike-NZ","CreatedById":142683,"CreatedDateTime":"2015-06-17T05:29:22Z","Content":"\u003E \n\u003E I as been a long time voyeur in this forum, but this time i as been forced to register in here just to say thanks (really), for this guys, so Mike and Jeast thanks for yours time and effort, is impossible to say how many hours of and fun i have lately after a crap work day just because someone as been worked hard in my favorite mod, so again thanks! Sorry for the bad English and cheers from Brazil.\n\nWow thank you for registering just to say thank you, it means alot. Makes it all worth it.\n\nI have been working with my team in a more productive environment with a better use of time and we have some special things on the way including some new vehicles and extras for the orbiter.\n\nCheers from New Zealand"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-06-17T05:41:40Z","Content":"Indeed, the new additions will make this quite amazeballs."},{"CreatedByName":"daedaelus","CreatedById":113484,"CreatedDateTime":"2015-06-17T06:26:21Z","Content":"Mike i just want to throw this out there. Many dont talk on the on the fourms however numbers speak for themselves about how many are enjoying this mod. Kerbalstuff has over 2,300 downloads of 1.6 that does not include this threads links. People are loving your work im glad you decided to carry on. \n\nIm just a researcher with no modding experance but im here if you need anything."},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-06-17T06:50:36Z","Content":"Count me in."},{"CreatedByName":"Mike-NZ","CreatedById":142683,"CreatedDateTime":"2015-06-17T08:51:28Z","Content":"\u003E \n\u003E Mike i just want to throw this out there. Many dont talk on the on the fourms however numbers speak for themselves about how many are enjoying this mod. Kerbalstuff has over 2,300 downloads of 1.6 that does not include this threads links. People are loving your work im glad you decided to carry on. \n\u003E Im just a researcher with no modding experance but im here if you need anything.\n\nOnly just started haha lots to do..."},{"CreatedByName":"Mike-NZ","CreatedById":142683,"CreatedDateTime":"2015-06-18T14:10:35Z","Content":"![J9WUt2I.jpg](http://i.imgur.com/J9WUt2I.jpg)\n\nmore goodness!"},{"CreatedByName":"MrMeeb","CreatedById":84238,"CreatedDateTime":"2015-06-18T14:28:10Z","Content":"Some form of payload carrying system? Looks awesome!"},{"CreatedByName":"clivman","CreatedById":139191,"CreatedDateTime":"2015-06-18T15:19:51Z","Content":"Is this RO compatible like the old one?"},{"CreatedByName":"Strikeeagle345","CreatedById":69409,"CreatedDateTime":"2015-06-18T17:30:02Z","Content":"\u003E \n\u003E [http://i.imgur.com/J9WUt2I.jpg](http://i.imgur.com/J9WUt2I.jpg)\n\u003E more goodness!\n\nperfection at its finest."},{"CreatedByName":"MrMeeb","CreatedById":84238,"CreatedDateTime":"2015-06-18T18:40:22Z","Content":"\u003E \n\u003E Is this RO compatible like the old one?\n\nIn its current state, no (as far as I know), and I don\u0027t think it will be for a while (feel free to say otherwise, Mike)"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-06-18T19:40:43Z","Content":"Hmm ive always thought the compatibility patches were made by RO itself, dunno. :/"},{"CreatedByName":"Mike-NZ","CreatedById":142683,"CreatedDateTime":"2015-06-18T22:19:49Z","Content":"\u003E \n\u003E Hmm ive always thought the compatibility patches were made by RO itself, dunno. :/\n\nRo should be a compulsory mod with this one. Is ro out yet? I will make a module manager patch if it is."}]}