{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":171,"Articles":[{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2016-08-29T22:51:15Z","Content":"[@Pappystein](https://forum.kerbalspaceprogram.com/index.php?/profile/85755-pappystein/)And thats why I don\u0027t use \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E. \n\nFor your testing. If you use HyperEdit, quicksave and reload after editing. It fix most of the bugs (as far as I know). If you still incounter the bugs, do the same test in a regular lunch or on the ground with as few part as possible. And if you still have the same issues, make sure to \u003Cu\u003Eprovide your output_log\u003C/u\u003E!"},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2016-08-29T23:14:08Z","Content":"\u003E \n\u003E \n\u003E Just now, RedParadize said:\n\u003E \n\u003E \n\u003E [@Pappystein](https://forum.kerbalspaceprogram.com/index.php?/profile/85755-pappystein/)And thats why I don\u0027t use \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E.\n\u003E \n\nI had never tried it before and was giving it a go.    It is now GONE ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nI don\u0027t know/Don\u0027t think Hyperedit was the cause of most of my problems as I was not using it (it was installed but no functionality was used to launch the station parts.)   I DID use MechJeb for circulation and plotting maneuvers to build the station.    Quick saving Did NOTHING in my case (leading me to believe it is a different mod interaction.)  \n\nLastly for all my years playing this game (3 now I think?)   I have never looked for the logs.   I found it with a ton of NREs for \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E.... almost 87mb of NREs for \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E.  Awaiting on KSP launch with new version and slimmed down mod list."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-29T23:28:38Z","Content":"\u003E \n\u003E \n\u003E 23 hours ago, RedParadize said:\n\u003E \n\u003E \n\u003E [...]\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Do you think it will eventualy possible to have integrated docking port on the sides of the adapter 3?\n\u003E \n\nCertainly in the realm of doable from a technical standpoint, and I\u0027ve considered doing as much for at least the stand-alone hub parts (ST-HUB-XXX).  Would be nice to extend that to the station-core parts, as most/all of them will have one hub or another as an adapter choice.\n\nThere is one big usability problem though that I haven\u0027t quite worked out yet -- the UI.  For the DOS/COS/HAB station parts with top and bottom hubs, it would require adding an additional 8 in-editor port selection sliders \u002B 16 stock in-editor toggles on the ports (staging and crossfeed).  In flight you could have up to an additional 24 UI lines from the stock port options (crossfeed, staging, control-from-here, x8 additional ports).  Those are on top of already quite busy parts, UI-wise.   For the HUB parts it wouldn\u0027t be too terrible as they are only 5-6 ports and the part has no other functions.  On the HUB parts it would only add a total of 5-6 UI lines, and only in the editor; all other UI options already exist on the parts in their current state.\n\nSo, from a usability standpoint, I would say it is a bad idea to integrate them into the DOS/COS/HAB end-cap-hubs.  The stand alone ST-HUB-DOS already exists for this purpose; it is one additional part per hub, but makes for a nice clean separation of function and easier to use UI\u0027s.  Whether I add the port swapping function to the HUB parts... still thinking on it... it would require a new module specifically for the purpose, but could be quite a bit simpler (would only switch port models, transform locations, and a few module settings, with no support for any \u0027no port\u0027 options, so no module-switch functionality would be needed).\n\n\u003E \n\u003E \n\u003E 1 hour ago, Pappystein said:\n\u003E \n\u003E \n\u003E Sorry for the work then.  I had hoped that someone else was having problems, hence posting.   I am downloading the latest update and have cleaned out MOST of the mods I have in my build.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I WAS using \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E for the first time ever with this iteration of the game.   I found a bunch of crap that was never deleted by \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E out of my GameData folder.   It is all gone.  I went down from 57 mods to 9 not counting SSTU.  I will post after further testing.   If it is any of these mods it should show up quickly in sandbox.\n\u003E \n\nNo worries, I was already doing general docking testing on parts over the weekend so wasn\u0027t too hard to add some surface mounted ports into the testing.\n\nIf you can narrow it down, please let me know what you come up with for craft/steps/mods.  There very likely are bugs with the docking ports that I simply haven\u0027t encountered yet in my testing and craft designs.  Even if you do find that it was another mod conflicting I would be interested in knowing that; most of the time I can find the cause and implement some sort of solution once I know which mod it is. \n\nThanks for you help in tracking the problem down, hopefully your testing will have more informative results that can allow for some fixing to be done ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-30T00:08:55Z","Content":"When selecting an integrated docking port as a target, I literally flip a coin because I can never for the life of me remember top vs bottom. Guess I should make sure I have a flag on them."},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2016-08-30T00:20:31Z","Content":"\u003E \n\u003E \n\u003E 41 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E No worries, I was already doing general docking testing on parts over the weekend so wasn\u0027t too hard to add some surface mounted ports into the testing.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E If you can narrow it down, please let me know what you come up with for craft/steps/mods.  There very likely are bugs with the docking ports that I simply haven\u0027t encountered yet in my testing and craft designs.  Even if you do find that it was another mod conflicting I would be interested in knowing that; most of the time I can find the cause and implement some sort of solution once I know which mod it is. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Thanks for you help in tracking the problem down, hopefully your testing will have more informative results that can allow for some fixing to be done ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\nI have sent you a link with photos from the previous release as well as current release as well as log files from both.    Yesterdays log files were spammed with 87mb of \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E NREs but I don\u0027t think that was the cause as I have removed \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E and am still having issues.\n\nOne possibility...   just RE RE validated game cache after I uninstalled the 45 mods I removed.   5 files failed their validation.\n\nSending link and then re-testing game"},{"CreatedByName":"StickyScissors","CreatedById":144204,"CreatedDateTime":"2016-08-30T00:35:44Z","Content":"[@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) Am i correct in assuming that with the latest update note \u0022FIX - Node specifications for many hub adapters\u0022 will fix this issue. I\u0027m on the last update, not the latest (data cap ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022)).\n\n![IGFqLic.png](http://i.imgur.com/IGFqLic.png)"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-30T00:42:45Z","Content":"\u003E \n\u003E \n\u003E 1 minute ago, StickyScissors said:\n\u003E \n\u003E \n\u003E [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) Am i correct in assuming that with the latest update note \u0022FIX - Node specifications for many hub adapters\u0022 will fix this issue. I\u0027m on the last update, not the latest (data cap ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022)).\n\u003E \n\nYes, exactly that.\n\nIf you want you can replace just the model-data file for those adapters with the updated/fixed one from the release repository ( [https://github.com/shadowmage45/SSTULabs/raw/master/GameData/SSTU/Parts/StationCore/ST-ADPT/ModelData-ST-ADPT.cfg](https://github.com/shadowmage45/SSTULabs/raw/master/GameData/SSTU/Parts/StationCore/ST-ADPT/ModelData-ST-ADPT.cfg) )  (or otherwise manually fix the nodes).  That single text file should be almost unnoticeable from a data-use perspective."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-30T06:06:06Z","Content":"After some docking testing, I did my first munar landing of this 6.4X career. The 2-stage lander I built was a little \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E---I staged it after munar liftoff---, but it turned out useful as my KOR/MOR mission profile with a hydrolox munar injection stage was little under designed for contingencies, so I used the remaining hypergolics on the munar ascent stage for the trans-kerbin burn, then the CSM for setting up my EDL. Had 200 m/s left over.\n\n![6.4kMun%20landing.jpg](http://i121.photobucket.com/albums/o222/tatersw/KSP/6.4kMun%20landing.jpg)\n\n(yeah, I guess I didn\u0027t really need the fuel lines, I could have enabled crossfeed, but old habits die hard). It uses and lr-81 attached to the ascent stage, but at 6.4X, it\u0027s a little underpowered. Landing from a low munar orbit was a little scary. \n\n![Kerbinrise6.4x.jpg](http://i121.photobucket.com/albums/o222/tatersw/KSP/Kerbinrise6.4x.jpg)\n\nOTW home."},{"CreatedByName":"Fobok","CreatedById":73999,"CreatedDateTime":"2016-08-30T06:36:38Z","Content":"Ok, that screenshot (plus my own disastrous mun mission today which cost me the lives of Bill and Bob and /tons/ of science and cash) changed my mind. I\u0027m trying this mod, WIP though it may be. This whole thing looks so amazing."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-30T13:05:36Z","Content":"The entire mission had 4 non-SSTU part types in it (6 total parts), all visible in the 2 images above (and I didn\u0027t need the fuel lines I guess, dropping it to 4 total parts)."},{"CreatedByName":"falken","CreatedById":17316,"CreatedDateTime":"2016-08-30T17:13:19Z","Content":"I was having real trouble translating with the Apollo \u002B CSM, until I realised that I should turn off the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E on the command module and let the CSM \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E handle that."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-30T17:19:36Z","Content":"If you hit the fine mode control for \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, it balances \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for translation. That\u0027s my understanding, anyway.\n\nIt would be cool to have some simple color choices for the LC parts. All white for the crew section, and perhaps white or gold foil for the tanks as an option."},{"CreatedByName":"falken","CreatedById":17316,"CreatedDateTime":"2016-08-30T17:27:05Z","Content":"![SeMAFct.png](http://i.imgur.com/SeMAFct.png)  \n\nI put together a quick resupply module using SSTU parts for the propulsion system, which now serves as my current space station command module.\n\nI\u0027d quite like to see a stubby CSM for the Apollo, like this: \n\n![fetch.php?w=750\u0026tok=430418\u0026media=timelin](http://wiki.alternatehistory.com/lib/exe/fetch.php?w=750\u0026tok=430418\u0026media=timelines:blockv_ortho.png)"},{"CreatedByName":"VenomousRequiem","CreatedById":137373,"CreatedDateTime":"2016-08-30T17:37:36Z","Content":"\u003E \n\u003E \n\u003E 10 minutes ago, falken said:\n\u003E \n\u003E \n\u003E I\u0027d quite like to see a stubby CSM for the Apollo, like this:\n\u003E \n\nWe\u0027ll have one of those in BDB pretty soon. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)"},{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2016-08-30T17:51:27Z","Content":"\u003E \n\u003E \n\u003E 37 minutes ago, tater said:\n\u003E \n\u003E \n\u003E It would be cool to have some simple color choices for the LC parts. All white for the crew section, and perhaps white or gold foil for the tanks as an option.\n\u003E \n\nI think that the same mechanics tanks currently use is preferable. You can still chose to give fuel section a different color, or go for everyones the same if you wish. Its less restrictive that way.\n\nRegarding service module.  As they are right now it is much better to use a SSTU tanks \u002B engine, they are lighter, contain more resource for similar volume and you can put a better engine behind them.  In my custom SSTU build I buffed them quite allot. I think its something that should be done as well in stock SSTU.\n\n**Edited \u003Ctime datetime=\u00222016-08-30T18:03:19Z\u0022 title=\u002208/30/2016 06:03  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 30, 2016\u003C/time\u003E by RedParadize**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-30T18:30:50Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, RedParadize said:\n\u003E \n\u003E \n\u003E I think that the same mechanics tanks currently use is preferable. You can still chose to give fuel section a different color, or go for everyones the same if you wish. Its less restrictive that way.\n\u003E \n\n? The LC tanks are always orange, no? The LC pods are always gray, with orange tanks. I was merely discussing the texture map. The other tanks have white, striped, orange, green, etc, all available. The crew parts, OTOH, currently have no texture options (and that might not be possible, or it might be more complex because of details on their surfaces, I don\u0027t know). I could see the Soyuz parts as having some color options as well. I\u0027ve seen them painted a few colors, or with various thermal blankets (green, gray, silver, black).\n\n\u003E \n\u003E \n\u003E Quote\n\u003E \n\u003E \n\u003E Regarding service module.  As they are right now it is much better to use a SSTU tanks \u002B engine, they are lighter, contain more resource for similar volume and you can put a better engine behind them.  In my custom SSTU build I buffed them quite allot. I think its something that should be done as well in stock SSTU.\n\u003E \n\nI used a regular SSTU upper stage tank (with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E). The engine in my image above is actually a vacuum Merlin.\n\nBTW, [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/), the Progress (SMX?) craft also shows up as \u0022Debris\u0022 instead of as a probe or craft.\n\nFor 6.4X people: I was experimenting with 6.4X some more, and I made a Soyuz replica to test what worked in the upscale (with \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E). I have SMURFF on, but I\u0027m not sure if it does much with SSTU, frankly. Suffice it to say that with SMURFF on default, a Soyuz replica (I\u0027m a little unsure on the upper stage just below Progress) I just got it into a 100-something km orbit (I wanna say it was like 180x147). I have propellant in the SM to clean up the orbit, and to reenter (300 something m/s). If SMURFF on default is indeed doing nothing with SSTU, SSTU must be perfectly scaled to 6.4x out of the box, as it were.\n\nProbe core:\n\nObviously the probe core ring part is copied from the decoupler. It could use the same texture options ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) .\n\nOther observations on that part:\n\n1. the attachment node doesn\u0027t seem to scale with size---does that affect joint strength?\n\n2. Could it get a minimal flywheel as a toggle? That would be useful for small probes, particularly given how flakey \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E can be.\n\n3. Can core parts change shape? Ie: could you borrow the octogon shape you just added as an option for the probe core?\n\n**Edited \u003Ctime datetime=\u00222016-08-30T19:05:51Z\u0022 title=\u002208/30/2016 07:05  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 30, 2016\u003C/time\u003E by tater**"},{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2016-08-30T19:08:42Z","Content":"\u003E \n\u003E \n\u003E 45 minutes ago, tater said:\n\u003E \n\u003E \n\u003E ? The LC tanks are always orange, no? The LC pods are always gray, with orange tanks. I was merely discussing the texture map. The other tanks have white, striped, orange, green, etc, all available. The crew parts, OTOH, currently have no texture options (and that might not be possible, or it might be more complex because of details on their surfaces, I don\u0027t know). I could see the Soyuz parts as having some color options as well. I\u0027ve seen them painted a few colors, or with various thermal blankets (green, gray, silver, black).\n\u003E \n\nThats not what I said.\n\nFrom what I understood, you wanted a texture switch that follow content type. My answer is it should be selectable just as regular SSTU tank. Sorry if I was not clear.\n\n\u003E \n\u003E \n\u003E 45 minutes ago, tater said:\n\u003E \n\u003E \n\u003E For 6.4X people: I was experimenting with 6.4X some more, and I made a Soyuz replica to test what worked in the upscale (with \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E). I have SMURFF on, but I\u0027m not sure if it does much with SSTU, frankly. Suffice it to say that with SMURFF on default, a Soyuz replica (I\u0027m a little unsure on the upper stage just below Progress) I just got it into a 100-something km orbit (I wanna say it was like 180x147). I have propellant in the SM to clean up the orbit, and to reenter (300 something m/s). If SMURFF on default is indeed doing nothing with SSTU, SSTU must be perfectly scaled to 6.4x out of the box, as it were.\n\u003E \n\nIf you want I have \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E for 6.4x that adjust every engine separately. I must warn you that it is balanced to my personal taste. For example the RL-10 have more trust than it should. I am not that patient when manoeuvring. I have been thinking about doing a more simple \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E that multiply trust and \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E, divide mass by using a single formula applied to all. The thing is It won\u0027t work correctly for every part (and also won\u0027t adjust it to my taste). [@falken](https://forum.kerbalspaceprogram.com/index.php?/profile/17316-falken/)  Is also looking for something like that, so I might end up doing it anyway. It will end up looking like the global \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E patch near future propulsion have.\n\nI also have few custom tank setup like shielded, carbon, and carbon shielded. They are more expensive than original and sadly they are available at start in campaign... I also added some engines variant , pods that are just \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E cargo, buffed SM... extra tank resource type for Kerbalism, NFP NFF and probably other thing that I forgot about.\n\n**Edited \u003Ctime datetime=\u00222016-08-30T19:18:59Z\u0022 title=\u002208/30/2016 07:18  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 30, 2016\u003C/time\u003E by RedParadize**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-08-30T19:34:36Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, tater said:\n\u003E \n\u003E \n\u003E If you hit the fine mode control for \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, it balances \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for translation. That\u0027s my understanding, anyway.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E **It would be cool to have some simple color choices for the LC parts. All white for the crew section, and perhaps white or gold foil for the tanks as an option.**\n\u003E \n\n\u003E \n\u003E \n\u003E 19 minutes ago, RedParadize said:\n\u003E \n\u003E \n\u003E Thats not what I said.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E From what I understood, you wanted a texture switch that follow content type. My answer is it should be selectable just as regular SSTU tank. Sorry if I was not clear.\n\u003E \n\nWhat I said is written above. I said nothing at all about tank content.\n\n\u003E \n\u003E \n\u003E 19 minutes ago, RedParadize said:\n\u003E \n\u003E \n\u003E If you want I have \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E for 6.4x that adjust every engine separately. I must warn you that it is balanced to my personal taste. For example the RL-10 have more trust than it should. I am not that patient when manoeuvring. I have been thinking about doing a more simple \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E that multiply trust and \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E, divide mass by using a single formula applied to all. The thing is It won\u0027t work correctly for every part (and also won\u0027t adjust it to my taste). [@falken](https://forum.kerbalspaceprogram.com/index.php?/profile/17316-falken/)  Is also looking for something like that, so I might end up doing it anyway. It will end up looking like the global \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E patch near future propulsion have.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I also have few custom tank setup like shielded, carbon, and carbon shielded. They are more expensive than original and sadly they are available at start in campaign... I also added some engines variant , pods that are just \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E cargo, buffed SM... extra tank resource type for Kerbalism, NFP NFF and probably other thing that I forgot about.\n\u003E \n\nI\u0027d like to see carbon fiber tanks at some point... the dry mass savings for composites is probably pretty decent, and it all adds up, particularly at the top of the stack. \n\nI used to use KIDS for upscales. When I get sick of 6.4X and start messing with \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E/\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E I\u0027ll likely have to dive in and figure out what to do with SSTU for that myself, as I honestly don\u0027t use other parts at this point, they are too limiting/painful compared to SSTU. \n\nSince [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) has added a number of SpaceX engines, perhaps we\u0027ll see a Raptor once the crazy BFR/MCT concept is announced on Sept. 27. Looks like my retro-future dreams of 1963 VTVL monster rockets have someone actually working on them now... interesting times."},{"CreatedByName":"RedParadize","CreatedById":129285,"CreatedDateTime":"2016-08-30T23:07:14Z","Content":"[@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) Just a trough, I know its realy early but do you think the future mechanic to make a ring in orbit would also work on the ground?\n\nI always wanted to have a very simple ground base setup. Like a single part that do it all.  With your future deployable centrifuge mechanic, I think it could be possible. Something like a relatively light core module would be drop on a planet, then it would require like 200 tons of non extractable material to make it fonctional. Once fonctional it would hold \u002B20 kerbal and have EPL lunchpad capacity. I am obviously not asking you to create that part. But it would be cool if your code would allow that eventuality."},{"CreatedByName":"StickyScissors","CreatedById":144204,"CreatedDateTime":"2016-08-31T00:16:47Z","Content":"Not sure if this is a problem that shadow can solve, but holy god does the game drop to 5 seconds per frame when i try to use KVV with a craft that has station parts involved.\n\nUpon activating KVV, the log is annihilated with:\n\n**[Log]: [Warning] KRSVesselShotNo replacement for Standard (UnityEngine.Shader) in SSTU-ST-GEN-DSP-DOS-M (Part)/\\*/ST-GEN-DSP-2.000 (UnityEngine.MeshRenderer)**\n\nor some very similar variation of it for each station part on the vessel."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-31T15:30:46Z","Content":"\u003E \n\u003E \n\u003E On Monday, August 29, 2016 at 6:20 PM, Pappystein said:\n\u003E \n\u003E \n\u003E I have sent you a link with photos from the previous release as well as current release as well as log files from both.    Yesterdays log files were spammed with 87mb of \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E NREs but I don\u0027t think that was the cause as I have removed \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E and am still having issues.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E One possibility...   just RE RE validated game cache after I uninstalled the 45 mods I removed.   5 files failed their validation.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Sending link and then re-testing game\n\u003E \n\nThanks for the info;  I took a look at the logs and did not see any null-refs that would have caused any problems, or anything else worrisome.\n\nI\u0027ll take some time a bit later this week to do more testing on the docking ports.\n\nOne thing that would help would be craft files that are known to have the problem.  Do you have any stock\u002BSSTU craft that exhibit the issue?  (mostly asking as my previous attempts to duplicate this issue with self-built craft did not exhibit any problems.)\n\n\u003E \n\u003E \n\u003E 21 hours ago, falken said:\n\u003E \n\u003E \n\u003E I\u0027d quite like to see a stubby CSM for the Apollo, like this: \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E ![fetch.php?w=750\u0026tok=430418\u0026media=timelin](http://wiki.alternatehistory.com/lib/exe/fetch.php?w=750\u0026tok=430418\u0026media=timelines:blockv_ortho.png)\n\u003E \n\nYou and quite a few other people ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nI have no problem with the part in concept -- my problem is with the texturing.  Do you guys really want another 1024x texture for a single-use part?  (it won\u0027t fit on anything smaller at the same texture scale as the existing parts, nor can it re-use the existing texture).\n\nAside from the texturing, the rest of the part presents no problem aside from time constraints (I actually put together test geometry for it in a about 5 minutes yesterday, to see if it could re-use the existing textures).\n\n\u003E \n\u003E \n\u003E 20 hours ago, tater said:\n\u003E \n\u003E \n\u003E ? The LC tanks are always orange, no? The LC pods are always gray, with orange tanks. I was merely discussing the texture map. The other tanks have white, striped, orange, green, etc, all available. The crew parts, OTOH, currently have no texture options (and that might not be possible, or it might be more complex because of details on their surfaces, I don\u0027t know). I could see the Soyuz parts as having some color options as well. I\u0027ve seen them painted a few colors, or with various thermal blankets (green, gray, silver, black).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [...]\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E BTW, [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/), the Progress (SMX?) craft also shows up as \u0022Debris\u0022 instead of as a probe or craft.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E [...]\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Probe core:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Obviously the probe core ring part is copied from the decoupler. It could use the same texture options ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022) .\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Other observations on that part:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 1. the attachment node doesn\u0027t seem to scale with size---does that affect joint strength?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 2. Could it get a minimal flywheel as a toggle? That would be useful for small probes, particularly given how flakey \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E can be.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E 3. Can core parts change shape? Ie: could you borrow the octogon shape you just added as an option for the probe core?\n\u003E \n\nSMX -- noted.  Will get that fixed up for the next release\n\nProbe core textures -- noted.  They merely need the patch set added that will add the texture sets (the switching functionality is already in-place, but hidden unless multiple texture sets are enabled for the part).\n\nAttach Node -- as far as I know node strength has nothing to do with node size, at least not through any of the testing I\u0027ve done.  I could be wrong, but there is no way to know for certain without source-access to the stock code (or direct dev response to the question).\n\nReaction wheel -- I prefer it didn\u0027t have one.  Easy enough to patch in though if you really need it.\n\nDifferent shapes -- negative, at least with the current setup.  Certainly possible from a technical standpoint (though would require a new module to manage it).  I had considered making a simple model-switch-and-rescale plugin for the decouplers, and if/when I do I will likely do the same for probe cores.  For now though they use the procedural mesh-generation code which is incapable of any form of model switching or different shapes.\n\n\u003E \n\u003E \n\u003E 19 hours ago, tater said:\n\u003E \n\u003E \n\u003E [...]\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Since [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) has added a number of SpaceX engines, perhaps we\u0027ll see a Raptor once the crazy BFR/MCT concept is announced on Sept. 27. Looks like my retro-future dreams of 1963 VTVL monster rockets have someone actually working on them now... interesting times.\n\u003E \n\nMaybe... if/when they release some diagrams/schematics of the engine.  So far there is pretty much nothing usable available as far as modeling resources go (I don\u0027t even think the designs are finalized yet?)\n\n\u003E \n\u003E \n\u003E 15 hours ago, RedParadize said:\n\u003E \n\u003E \n\u003E [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) Just a trough, I know its realy early but do you think the future mechanic to make a ring in orbit would also work on the ground?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I always wanted to have a very simple ground base setup. Like a single part that do it all.  With your future deployable centrifuge mechanic, I think it could be possible. Something like a relatively light core module would be drop on a planet, then it would require like 200 tons of non extractable material to make it fonctional. Once fonctional it would hold \u002B20 kerbal and have EPL lunchpad capacity. I am obviously not asking you to create that part. But it would be cool if your code would allow that eventuality.\n\u003E \n\nYes, that plugin will work just fine for ground bases.  While it is called SSTUInflatable (for lack of a better name), all it really does is block of the playing of an animation until a certain number of resources are consumed.  As such it can work for... whatever ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\nHowever it -cannot- disable a part entirely; your example part with the EPL launchpad would -still- have the launchpad capability while deflated/before construction.  Though it would have zero crew capacity.  In short -- that module controls an animation, and does **not** do any form of module-switching.\n\nThe only (stock compatible) way to do that would be to replace the part wholesale; rather than play an animation it would destroy the current part and create/insert the replacement part (where the replacement part has all the functional modules, the base pre-inflated part only has the inflatable module).  Would be hacky as hell, result in tons of extra parts in the editor and research tree...  not really anything I\u0027m interested in implementing.\n\n\u003E \n\u003E \n\u003E 14 hours ago, StickyScissors said:\n\u003E \n\u003E \n\u003E Not sure if this is a problem that shadow can solve, but holy god does the game drop to 5 seconds per frame when i try to use KVV with a craft that has station parts involved.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Upon activating KVV, the log is annihilated with:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E **[Log]: [Warning] KRSVesselShotNo replacement for Standard (UnityEngine.Shader) in SSTU-ST-GEN-DSP-DOS-M (Part)/\\*/ST-GEN-DSP-2.000 (UnityEngine.MeshRenderer)**\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E or some very similar variation of it for each station part on the vessel.\n\u003E \n\nThat is due to KVV not supporting the Unity Standard Shader.  Nothing I can do about that.\n\nYour option there is - don\u0027t use KVV with the unfinished/prototype parts.  Those are the only parts that use the standard shader, as they are placeholder parts.  They will receive proper shaders/material setups as the parts are finished.\n\n\u003E \n\u003E \n\u003E 20 hours ago, tater said:\n\u003E \n\u003E \n\u003E ? The LC tanks are always orange, no? The LC pods are always gray, with orange tanks. I was merely discussing the texture map. The other tanks have white, striped, orange, green, etc, all available. The crew parts, OTOH, currently have no texture options (and that might not be possible, or it might be more complex because of details on their surfaces, I don\u0027t know). I could see the Soyuz parts as having some color options as well. I\u0027ve seen them painted a few colors, or with various thermal blankets (green, gray, silver, black).\n\u003E \n\nLC stuff -- once again, I\u0027m not touching any of those parts for a few months at least.  At which point it will be a complete re-do/reworking on all of those parts (pods, tanks, legs, accessories).\n\nTexture swapping on other parts (CM/SM/Etc) -- possible, but would quickly result in a 500mb download.  Each extra texture set for those parts adds 3-5mb per part (they are not small textures); multiply that out by 3-4 parts per series, 4 series of parts, = 4\\*4\\*5 = 80mb per additional set of textures for the ShipCore parts.  If I added 3 texture options for each ShipCore part, you would have an additional ~250mb of textures.\n\nI don\u0027t really have a problem with the download size... bandwidth is not as much of a problem as it was a decade ago.  Rather I\u0027m worried about overall GPU memory use... it is a finite resource that must be shared with stock resources and all other mods.  I\u0027m pretty sure KSP loads -all- textures into the GPU, and there is only limited GPU memory available.\n\nIf someone can provide verifiable proof that Unity is smart enough to dynamically upload textures to the GPU on a per-scene/as-needed basis (and thus the memory limit is per-scene, and not global), I would be much more willing to support further-reaching texture-swapping capabilities for other parts (still don\u0027t have time to make the textures... but at least I would be willing to if/when the time is found)."},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-08-31T16:08:25Z","Content":"\u003E \n\u003E \n\u003E 35 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E You and quite a few other people ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)\n\u003E \n\u003E \n\u003E \n\u003E I have no problem with the part in concept -- my problem is with the texturing.  Do you guys really want another 1024x texture for a single-use part?  (it won\u0027t fit on anything smaller at the same texture scale as the existing parts, nor can it re-use the existing texture).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Aside from the texturing, the rest of the part presents no problem aside from time constraints (I actually put together test geometry for it in a about 5 minutes yesterday, ***\u003Cu\u003Eto see if it could re-use the existing textures\u003C/u\u003E***).\n\u003E \n\nI was going to ask if that is possible ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)  \n\nbtw, apparently that engine is a LMDE, but if I could ask, could you leave the SM without engines? ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-31T16:50:33Z","Content":"Made fairly significant progress on the UV unwrap and layout on the DOS parts over the last couple of days.\n\nHave a -tiny- bit more texture space available that I can use for additional detail geometry, on the order of some ladder rungs/hand-holds, or other small geometry-based details.  Quite a bit of \u0027greeble\u0027 type details are going to be added through the textures (paneling lines, perhaps some wires or hoses and such); these are done at a reasonable-enough texture scale that I can get decent details in the normal and diffuse textures.\n\nSo -- **last call** on opinions/requests/desires for geometry based details on the DOS modules.  By Friday I expect that I\u0027ll have the models to a state where any additions will be prohibitive and will be very hesitant to make any geometry changes after that -- so if you have any requests, please put them forward now ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif \u0022:)\u0022)  (also please be specific/include examples, I\u0027m really not very good at coming up with random greeble on my own... my mind merely doesn\u0027t work that way).\n\nCurrent geometry with initial first-pass texturing (flat diffuse\u002BAO only, very basic/unfinished normals on the radiators, no spec mask, no noise, and nothing finalized yet):  \n![um2r8XI.png](http://i.imgur.com/um2r8XI.png)"},{"CreatedByName":"CobaltWolf","CreatedById":105588,"CreatedDateTime":"2016-08-31T16:52:07Z","Content":"\u003E \n\u003E \n\u003E 42 minutes ago, JoseEduardo said:\n\u003E \n\u003E \n\u003E I was going to ask if that is possible ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)  \n\u003E   \n\u003E \n\u003E btw, apparently that engine is a LMDE, but if I could ask, could you leave the SM without engines? ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif \u0022:P\u0022)\n\u003E \n\ncan you provide a source for that? I thought it was supposed to be an LMAE."},{"CreatedByName":"falken","CreatedById":17316,"CreatedDateTime":"2016-08-31T17:03:38Z","Content":"Those look good Shadowmage, and they look like they\u0027d fit in with CXAerospace \u0026 Habtech quite nicely.\n\nOn the subject of the stubby eyes turned skywards Apollo CSM, if you\u0027re reluctant to make a single use part that uses a texture like that, how about as a compromise another semi-procedural tank that doesn\u0027t have the piping on the side?\n\nAll in all, I can live with the true to life CSM, it is very nice."}]}