{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":201,"Articles":[{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2016-10-26T21:08:04Z","Content":"\u003E \n\u003E \n\u003E Just now, Shadowmage said:\n\u003E \n\u003E \n\u003E Known issue:  [https://github.com/shadowmage45/SSTULabs/issues/362](https://github.com/shadowmage45/SSTULabs/issues/362)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Yea, stock code completely screwed up the most efficient methods for updating the emissives.  The stock highlighting just loves to come along and overwrite things. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I\u0027ve exhausted the \u0027right\u0027 way to do things (stock code still overwrites it), and I\u0027m down to the terribly slow/inefficient methods for keeping things working -- basically I have to force-update the mesh rendering properties every frame whether it needs to be updated or not... ridiculous, and -terrible- for performance.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E --This is one of those places where the stock code really needs to be fixed so that it isn\u0027t blindly overwriting things.  It -should- pull the existing MaterialPropertiesBlock from the render, update the parameters that need changed, and then re-set the materials block to the material.  What it currently does is clear all properties from the block, set the single property for highlighting, and then re-sets the block to the material (thus overwriting whatever was -previously specified- by the existing block in the material).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Honestly, I did things the way they should be done (as per Unity best practices and examples), and the stock code is simply not doing things properly.  Putting this problem on the \u0027I\u0027ll check back with KSP 1.2.1...\u0027 list.\n\u003E \n\nI see, kinda expected it, but just wanted to check back. Did you take a look at the stock pods? They have all lighting now themselves, without any issues. Might be a new method?"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-10-26T21:19:01Z","Content":"\u003E \n\u003E \n\u003E 3 minutes ago, Pappystein said:\n\u003E \n\u003E \n\u003E Correct me if I am wrong (and I know I probably am at least not right if not straight out wrong,) but couldn\u0027t a Realchute integration and a Requires RealChute dependancy, fix most of your issues here?   I mean assuming you are not trying to make your own GUI etc for all the various portions?\n\u003E \n\nAs far as I\u0027m aware RealChutes requires that the parachute models be built into whatever part it is (which is how the stock parts are done).  My module has a completely detached setup -- the parachute models are completely separate from whatever part they are being added to and are defined entirely through config (models, textures, positions, orientations, scale, and drag are all defined through the text config).  Of course, I\u0027ve never actually used RealChutes, so could be off on some of that.\n\nEither way -- I need a stand-alone solution that works for my parts without requiring an external dependency.  So RealChutes is simply not an option.\n\n\u003E \n\u003E \n\u003E 4 minutes ago, Temeter said:\n\u003E \n\u003E \n\u003E I see, kinda expected it, but just wanted to check back. Did you take a look at the stock pods? They have all lighting now themselves, without any issues. Might be a new method?\n\u003E \n\nWill take a look -- as far as I\u0027m aware the stock pods use Animations which are not an option for my parts (they have no animations on them, is all done through the Module and config-defined emissive curves).\n\nAnimations, from my understanding, use the same inefficient methods that I would have to resort to (e.g. force-updating the render properties every tick even when not needed).\n\nWill also take a look at what Nertea did to fix his, but those are likely animation-based as well."},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2016-10-26T21:21:07Z","Content":"\u003E \n\u003E \n\u003E Just now, Shadowmage said:\n\u003E \n\u003E \n\u003E Will take a look -- as far as I\u0027m aware the stock pods use Animations which are not an option for my parts (they have no animations on them, is all done through the Module and config-defined emissive curves).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Animations, from my understanding, use the same inefficient methods that I would have to resort to (e.g. force-updating the render properties every tick even when not needed).\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E   \n\u003E \n\u003E Will also take a look at what Nertea did to fix his, but those are likely animation-based as well.\n\u003E \n\nAh, I see.\n\nIf you wanna try to give squad a pointer, maybe try the bug tracker? I\u0027d do it myself, but I dont really understand those systems. [http://bugs.kerbalspaceprogram.com/projects/ksp/issues](http://bugs.kerbalspaceprogram.com/projects/ksp/issues)"},{"CreatedByName":"Nertea","CreatedById":83952,"CreatedDateTime":"2016-10-26T23:49:37Z","Content":"Those are some beauteous inflatables sir!\n\n\u003E \n\u003E \n\u003E 2 hours ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Will also take a look at what Nertea did to fix his, but those are likely animation-based as well.\n\u003E \n\nYup, they are animations. Honestly you could probably write some code to construct the animations at loadtime (or even when the part is switched) for those parts - it might be a good compromise. You would get the animation method without having the tedium of creating and exporting animations.  I did runtime animation creation for a project of mine in Unity some time ago, so it\u0027s certainly possible."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-10-27T00:49:01Z","Content":"\u003E \n\u003E \n\u003E 2 hours ago, Temeter said:\n\u003E \n\u003E \n\u003E Ah, I see.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E If you wanna try to give squad a pointer, maybe try the bug tracker? I\u0027d do it myself, but I dont really understand those systems. [http://bugs.kerbalspaceprogram.com/projects/ksp/issues](http://bugs.kerbalspaceprogram.com/projects/ksp/issues)\n\u003E \n\nYeah, I probably will end up filing a bug report on this one.  There are actually a couple (inter-related) issues at play.\n\nI just tested the stock Mk1-2 pod, and while it is true that the highlighting doesn\u0027t break the cabin lights, it is also true that the cabin lights partially break the highlighting on the part.  So the stock code is already breaking other stock code when cabin lights are used.  The outline highlighting still works (as that is using a separate render path), but it breaks the rim-light highlighting.  This can be seen by comparing the highlighting on the Mk1-2 pod to one of the stock fuel tanks.  Note how the fuel tank gets a green outline as well as some green tinting on the mesh.  The Mk1-2 pod only gets the green outline and lacks the rim-highlighting/tinting on the mesh itself.\n\nIt seems that the stock module for handling lights (which actually is a config-based module now, ModuleColorChanger) simply overwrites the MPB used by the highlighter.  I\u0027m unable to dig into the stock code, but based on what I\u0027m seeing in the editor and from my own module, the stock module must be updating these properties every frame even when not needed.\n\nAs I already have a (mostly) functional Module and configs for these parts I can, at least for the time being, move my update code to update every frame.  ... rather I just have... and as a bonus, it doesn\u0027t break the stock highlighting as I\u0027m using the MPBs properly.  Still far from optimal as it shouldn\u0027t need to be updated every frame, but I\u0027ll have to go with \u0027hopefully good enough\u0027 on this one.\n\nHave also just finished fixing the solar panel code up a bit to allow for stuff such as:\n\n![3GInAeK.png](http://i.imgur.com/3GInAeK.png)\n\nNote the orientation of both panels, facing towards the camera.  Have enabled mirror symmetry for the BKT-D/E panels so they no longer face opposite directions when placed with the stock symmetry tool.  It does enable some skylab type setups to be created... but has some odd issues in general use (hard to control panel orientation, it flips whichever way it wants and there is no manual way to fix it).  Unsure if I\u0027ll be keeping it in place or moving to a custom solution that is a bit more controllable."},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2016-10-27T02:03:45Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Yeah, I probably will end up filing a bug report on this one.  There are actually a couple (inter-related) issues at play.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I just tested the stock Mk1-2 pod, and while it is true that the highlighting doesn\u0027t break the cabin lights, it is also true that the cabin lights partially break the highlighting on the part.  So the stock code is already breaking other stock code when cabin lights are used.  The outline highlighting still works (as that is using a separate render path), but it breaks the rim-light highlighting.  This can be seen by comparing the highlighting on the Mk1-2 pod to one of the stock fuel tanks.  Note how the fuel tank gets a green outline as well as some green tinting on the mesh.  The Mk1-2 pod only gets the green outline and lacks the rim-highlighting/tinting on the mesh itself.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E It seems that the stock module for handling lights (which actually is a config-based module now, ModuleColorChanger) simply overwrites the MPB used by the highlighter.  I\u0027m unable to dig into the stock code, but based on what I\u0027m seeing in the editor and from my own module, the stock module must be updating these properties every frame even when not needed.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E As I already have a (mostly) functional Module and configs for these parts I can, at least for the time being, move my update code to update every frame.  ... rather I just have... and as a bonus, it doesn\u0027t break the stock highlighting as I\u0027m using the MPBs properly.  Still far from optimal as it shouldn\u0027t need to be updated every frame, but I\u0027ll have to go with \u0027hopefully good enough\u0027 on this one.\n\u003E \n\nInteresting! I\u0027ve noticed the limited lighting on certain parts, and was wondering why that happened. But I think it\u0027s worth it; lighted modules, especially in the darkness when overshadowed by planets or in deep space, make craft feel much more lived in and less dead. One of those small details that make a difference.\n\nOn a positive note, if it is stock functionality, then there is a higher chance of it getting fixed in an official patch! Otherwise I did not notice larger performance issues when using stock capsules (even though doing something once per frame sounds incredibly wasteful).\n\n**Edited \u003Ctime datetime=\u00222016-10-27T02:05:55Z\u0022 title=\u002210/27/2016 02:05  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by Temeter**"},{"CreatedByName":"Jimbodiah","CreatedById":152759,"CreatedDateTime":"2016-10-27T06:25:39Z","Content":"Spoiler\n\n![jimbodiah_161027.jpg](http://kerbal.nl/jimbodiah_161027.jpg)  \n*click to enlarge*\n\n[@Nertea](https://forum.kerbalspaceprogram.com/index.php?/profile/83952-nertea/)\u0027s NF trusses, radiators and reactor, [@RoverDude](https://forum.kerbalspaceprogram.com/index.php?/profile/105198-roverdude/)\u0027s \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E MKS airlock and cupola, [@CobaltWolf](https://forum.kerbalspaceprogram.com/index.php?/profile/105588-cobaltwolf/)\u0027s BDB Apollo and SSTU for everything else.\n\n**Edited \u003Ctime datetime=\u00222016-10-27T08:09:44Z\u0022 title=\u002210/27/2016 08:09  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by Jimbodiah**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-27T18:43:46Z","Content":"\u0060Other than looking really cool, are there any advantages to spherical tanks?\n\nI made a kerlox tank in both the standard and spherical types at the default size.\n\nThe MFT-A has a dry mass that is 13.045% of the total mass.\n\nThe MFT-S dry mass is 13.040% of the total mass. \n\nLight tanks makes MFT-A and MFT-S both 10.11% dry mass.\n\nSeems odd."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-10-27T18:59:44Z","Content":"\u003E \n\u003E \n\u003E 10 minutes ago, tater said:\n\u003E \n\u003E \n\u003E \u0060Other than looking really cool, are there any advantages to spherical tanks?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I made a kerlox tank in both the standard and spherical types at the default size.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The MFT-A has a dry mass that is 13.045% of the total mass.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E The MFT-S dry mass is 13.040% of the total mass. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Light tanks makes MFT-A and MFT-S both 10.11% dry mass.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Seems odd.\n\u003E \n\nNope, no advantage.  They are different for looks/aesthetics only.  Theoretically they should have a much lower \u0027tankageVolumeLoss\u0027 compared to cylindrical tanks.  Also they haven\u0027t really been balanced, I\u0027m not even sure I got the volumes set up on them properly.  Either way I wouldn\u0027t expect the mass ratio to change.\n\nBit more work on inflatable textures.  Added some shading and more definition to the paneling sections, but I think it is overdone a bit.  Wanted some \u0027depth\u0027 to it, but ended up looking a bit dirty.  Not terrible, just...a bit dirty.  Still on a pretty good course to have these textures wrapped up in the next few days.  Models are mostly ready for exporting, configs are mostly done.   \n\nWARNING -- the finished hab parts will have different naming from the existing prototypes, so existing craft using the prototypes will need to be recreated (not unexpected, shouldn\u0027t be surprising, but thought I would mention it).  They also have different geometry than the prototypes (lengths, diameters), so they wouldn\u0027t really have been compatible even if the naming were unchanged.\n\n![ZES9xRH.png](http://i.imgur.com/ZES9xRH.png)"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-27T19:20:50Z","Content":"I agree on the stripes being a little overdone.\n\nIs the render above different than this?:\n\n![QPFs6if.png](http://i.imgur.com/QPFs6if.png)\n\nCause it might be the difference between in game and a regular render (cause this image in orbit looks pretty nice)."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-10-27T19:30:07Z","Content":"\u003E \n\u003E \n\u003E 10 minutes ago, tater said:\n\u003E \n\u003E \n\u003E I agree on the stripes being a little overdone.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Is the render above different than this?:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Cause it might be the difference between in game and a regular render (cause this image in orbit looks pretty nice).\n\u003E \n\nYea, the in-orbit img was taken a few days ago -- had zero shading or AO on the textures, and was missing the specular mask (is why everything is so shiny).  The render posted above has added AO as well as some shading on the panel sections.  Probably will lighten up the shading on them a bit -- I want them defined and bubbly, but not \u0027striped\u0027 looking.\n\nEdit: Updated render incoming that I think looks much better... only change was to turn down the shading on the paneling to 50% of what it was. \n\nMight still tweak things a bit further, but looking much closer to what i had intended.\n\n![XF7ck6f.png](http://i.imgur.com/XF7ck6f.png)\n\n**Edited \u003Ctime datetime=\u00222016-10-27T19:33:15Z\u0022 title=\u002210/27/2016 07:33  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by Shadowmage**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-27T19:39:56Z","Content":"Nice. It\u0027s clearly a pretty delicate balance, I \u0022get\u0022 exactly what you are looking for since there is no greeble possible on those otherwise smooth surfaces, this is where all the texture will come from that makes it not look \u0022plastic\u0022 (in the sense of hard, shiny, plastic).\n\nIf the inflated part was translucent with algae in a void between the outside and the inner, hab membrane those would be \u0022arklets\u0022 from *Seveneves*."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-10-27T22:47:45Z","Content":"Updated in-game screen with the latest textures -- looking pretty good, and about ready to call them finished.  Few more little touch-ups/details to go..\n\n![q8qtz0q.png](http://i.imgur.com/q8qtz0q.png)\n\nThat is all 10 inflatable modules; 2.5m capped/uncapped, 3.75m capped/uncapped, and 1.25m uncapped.\n\nThe 1.25m do look a bit comical... going to do a bit of testing to see how usable they are... but I\u0027ll likely end up making them 1.875m in the end (when deflated).\n\nEdit:  They may look a bit comical, but I suppose that is the Kerbal Way(tm).  Also, they do look quite appropriate when used on the SC-A-SM:\n\n![t90VXLr.png](http://i.imgur.com/t90VXLr.png)\n\n**Edited \u003Ctime datetime=\u00222016-10-27T22:50:42Z\u0022 title=\u002210/27/2016 10:50  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 27, 2016\u003C/time\u003E by Shadowmage**"},{"CreatedByName":"mechanicH","CreatedById":167929,"CreatedDateTime":"2016-10-27T22:56:03Z","Content":"Wow those look great mage.   For some reason I have an urge to make a balloon animal in orbit with those lol. \n\nAmazing work sir! I applaud you."},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-10-27T22:56:52Z","Content":"when inflated, do they have twice the diameter of when deflated?"},{"CreatedByName":"Duski","CreatedById":164162,"CreatedDateTime":"2016-10-27T23:42:14Z","Content":"Just updated to 1.2 for this mod finally after my break of KSP. Anyone else not able to see any of the station core parts and some other parts from this mod? ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022) Can\u0027t see their preview on the part list and not visible in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022)"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-27T23:45:05Z","Content":"\u003E \n\u003E \n\u003E 2 minutes ago, Duski said:\n\u003E \n\u003E \n\u003E Just updated to 1.2 for this mod finally after my break of KSP. Anyone else not able to see any of the station core parts and some other parts from this mod? ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022) Can\u0027t see their preview on the part list and not visible in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022)\n\u003E \n\nThat\u0027s the first 1.2 release, it had a boo boo. DL the current version."},{"CreatedByName":"Duski","CreatedById":164162,"CreatedDateTime":"2016-10-27T23:51:16Z","Content":"\u003E \n\u003E \n\u003E 5 minutes ago, tater said:\n\u003E \n\u003E \n\u003E That\u0027s the first 1.2 release, it had a boo boo. DL the current version.\n\u003E \n\nAha, Will do that right now ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022) \n\nWell I am on the latest version, if that is 0.5.33.127."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-28T01:05:54Z","Content":"That same issue was with the first version for 1.2. Works fine for me now.\n\nDo you have \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E installed latest version?"},{"CreatedByName":"Duski","CreatedById":164162,"CreatedDateTime":"2016-10-28T01:19:33Z","Content":"\u003E \n\u003E \n\u003E 14 minutes ago, tater said:\n\u003E \n\u003E \n\u003E That same issue was with the first version for 1.2. Works fine for me now.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Do you have \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E installed latest version?\n\u003E \n\nPretty sure I do, I just put the module manager on that comes with every mod usually.\n\nChecking now, but my KSP keeps crashing on startup due to runtime errors. :/\n\n**Edited \u003Ctime datetime=\u00222016-10-28T01:20:47Z\u0022 title=\u002210/28/2016 01:20  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 28, 2016\u003C/time\u003E by Duski**"},{"CreatedByName":"Pappystein","CreatedById":85755,"CreatedDateTime":"2016-10-28T02:09:59Z","Content":"\u003E \n\u003E \n\u003E 44 minutes ago, Duski said:\n\u003E \n\u003E \n\u003E Pretty sure I do, I just put the module manager on that comes with every mod usually.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Checking now, but my KSP keeps crashing on startup due to runtime errors. :/\n\u003E \n\n[@Duski](https://forum.kerbalspaceprogram.com/index.php?/profile/164162-duski/)\n\nBased on your statements it sounds like you have a Borked Mod or Install.   I would suggest UN-Installing KSP,  Deleting any directory that remains after un-installing and then install KSP 1.2 again.   I am running close to 60 mods on the KSP-X64 and other than a minor mod interaction issue that causes phantom forces at certain altitudes, All mods including SSTU are working great!\n\nYou need mod manager 1.7.1,  If you have OTHER Module manager DLLs in the GameData folder problems will ensue."},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2016-10-28T02:27:13Z","Content":"[@Pappystein](https://forum.kerbalspaceprogram.com/index.php?/profile/85755-pappystein/) [@Duski](https://forum.kerbalspaceprogram.com/index.php?/profile/164162-duski/) ModuleManager is designed to detect other versions of itself and only use the newest.  Deleting older versions never hurts though.\n\nIf you\u0027re getting errors on startup though, the only way to find out what\u0027s causing them is with logs."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-28T02:49:24Z","Content":"Can\u0027t wait to play with the new stuff, it\u0027s looking really awesome."},{"CreatedByName":"Duski","CreatedById":164162,"CreatedDateTime":"2016-10-28T03:47:06Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Pappystein said:\n\u003E \n\u003E \n\u003E [@Duski](https://forum.kerbalspaceprogram.com/index.php?/profile/164162-duski/)\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Based on your statements it sounds like you have a Borked Mod or Install.   I would suggest UN-Installing KSP,  Deleting any directory that remains after un-installing and then install KSP 1.2 again.   I am running close to 60 mods on the KSP-X64 and other than a minor mod interaction issue that causes phantom forces at certain altitudes, All mods including SSTU are working great!\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E You need mod manager 1.7.1,  If you have OTHER Module manager DLLs in the GameData folder problems will ensue.\n\u003E \n\nWell did a complete reinstall of KSP now but not currently for this, trying to get the debug menu to work but it\u0027s not working. D: Will do this asap.\n\nEDIT: Fixed console, now gonna start working my way around this. I think it could be from installing SSTU Nova but not too sure.\n\n**Edited \u003Ctime datetime=\u00222016-10-28T03:57:06Z\u0022 title=\u002210/28/2016 03:57  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 28, 2016\u003C/time\u003E by Duski**"},{"CreatedByName":"JoseEduardo","CreatedById":127759,"CreatedDateTime":"2016-10-28T04:35:06Z","Content":"\u003E \n\u003E \n\u003E 44 minutes ago, Duski said:\n\u003E \n\u003E \n\u003E Well did a complete reinstall of KSP now but not currently for this, trying to get the debug menu to work but it\u0027s not working. D: Will do this asap.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E EDIT: Fixed console, now gonna start working my way around this. I think it could be from installing SSTU Nova but not too sure.\n\u003E \n\nI didn\u0027t update that yet, so it\u0027s not officially working in 1.2 (so far only the max diameter is broken), but.... I\u0027m using the very same version as the last release in 1.2 right now and I have all the parts from the last SSTU release working..."}]}