{"TopicId":117090,"ForumId":36,"TopicTitle":"[WIP][1.8.x] SSTULabs - Low Part Count Solutions (Orbiters, Landers, Lifters) - Dev Thread [11-18-18]","CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2015-07-28T18:13:57Z","PageNum":242,"Articles":[{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-04-28T18:59:49Z","Content":"\u003E \n\u003E \n\u003E 8 hours ago, MaxZhao said:\n\u003E \n\u003E \n\u003E Hi! [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) In the process of making patches for the class-E shuttle I realised that there aren\u0027t any decouplers especially made for the shuttle? I\u0027m not sure if the booster decoupler was supposed to be used for the external tank, if so, I think it would be better if crossfeed can be allowed on it since a fuel duct would be needed otherwise. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E best regards\n\u003E \n\nYes, I use the RBDC for the shuttle external tank.  And also for the SRBs attached to the tank.  And yes, I use manual fuel lines; there was some sort of bug with crossfeed back when I setup those parts, no clue if it is still present or not (actually I think toggle-able crossfeed wasn\u0027t even a thing back then).\n\nIf you add crossfeed to the RBDC part are there any negative side effects in other uses of the part/craft designs?"},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2017-04-28T19:08:28Z","Content":"\u003E \n\u003E \n\u003E 34 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E If you add crossfeed to the RBDC part are there any negative side effects in other uses of the part/craft designs?\n\u003E \n\nI\u0027ve been wondering the same thing. I know if you add a reaction wheel to this part, it doesn\u0027t work. But, that was in 1.1.2/3. I don\u0027t see why it shouldn\u0027t work? Things that make you go hmmmm. \n\n-Update-\n\nUpon looking at the RBDC config file, there\u0027s already a fuelCrossFeed configuration that\u0027s set to false. Maybe that was done as a reason? \n\n**Edited \u003Ctime datetime=\u00222017-04-28T19:37:03Z\u0022 title=\u002204/28/2017 07:37  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 28, 2017\u003C/time\u003E by ComatoseJedi**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-04-28T20:39:32Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, ComatoseJedi said:\n\u003E \n\u003E \n\u003E I\u0027ve been wondering the same thing. I know if you add a reaction wheel to this part, it doesn\u0027t work. But, that was in 1.1.2/3. I don\u0027t see why it shouldn\u0027t work? Things that make you go hmmmm. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E -Update-\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Upon looking at the RBDC config file, there\u0027s already a fuelCrossFeed configuration that\u0027s set to false. Maybe that was done as a reason?\n\u003E \n\nThat field controls \u0027full time\u0027 crossfeed.\n\nWhat needs to be tested is the ModuleCrossfeedEnabler (or whatever it is called), the stock module that allows for in-editor (and in flight?) crossfeed toggling."},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2017-04-28T21:02:26Z","Content":"\u003E \n\u003E \n\u003E 55 minutes ago, Shadowmage said:\n\u003E \n\u003E \n\u003E What needs to be tested is the ModuleCrossfeedEnabler (or whatever it is called), the stock module that allows for in-editor (and in flight?) crossfeed toggling.\n\u003E \n\nThe stock module for this is ModuleToggleCrossfeed example from the stock TR-38-D\n\nMODULE  \n\n    {  \n\n        name = ModuleToggleCrossfeed  \n\n        crossfeedStatus = false  \n\n        toggleEditor = true  \n\n        toggleFlight = true  \n\n    }\n\nTrying it out now.  \n\n\\*Update\\*\n\nI added the ModuleToggleCrossfeed to the core RBDC file config. It gave the toggle for cross feeding, but using it on the Series E Fuselage resulted in a no go for a -pull- for the engines to use. So, I looked into the SC-E-FS config file and set the fuelCrossFeed=True. This allowed for cross feeding for use with the radial de-coupler and the E shuttle fuselage. Would you like me to put in a pull request on the GH for these features/changes [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) ? \n\n**Edited \u003Ctime datetime=\u00222017-04-28T21:42:09Z\u0022 title=\u002204/28/2017 09:42  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 28, 2017\u003C/time\u003E by ComatoseJedi**"},{"CreatedByName":"CVerts","CreatedById":168243,"CreatedDateTime":"2017-04-29T02:16:44Z","Content":"\u003E \n\u003E \n\u003E On 4/25/2017 at 7:10 AM, Shadowmage said:\n\u003E \n\u003E \n\u003E This isn\u0027t really a \u0027modpack\u0027, but more of a single really large mod.  Due to the use of texture and mesh/model sharing across many of the parts it is extremely difficult to have a clean separation between the different series\u0027 of parts.  For example many of the engine models and textures are re-used in the various ShipCore part-series, as are the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E blocks and docking ports.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E If you have a specific list of parts that you do want to keep I can probably give you a quick write-up of what all would be safe to delete/remove.\n\u003E \n\nI haven\u0027t really thought about which parts to remove in my \u0027Near Future\u0027 install. Maybe others beside the engines and cores and Series C? I would like to suggest an option for people to install a \u0027core\u0027 and install the other series as this would benefit a lot for those who wants specific parts or have a lower performance computer.\n\n**Edited \u003Ctime datetime=\u00222017-04-29T02:18:29Z\u0022 title=\u002204/29/2017 02:18  AM\u0022 data-short=\u00227 yr\u0022\u003EApril 29, 2017\u003C/time\u003E by CVerts**\n  \nAccidental multi-post."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-04-29T16:14:16Z","Content":"\u003E \n\u003E \n\u003E 19 hours ago, ComatoseJedi said:\n\u003E \n\u003E \n\u003E I added the ModuleToggleCrossfeed to the core RBDC file config. It gave the toggle for cross feeding, but using it on the Series E Fuselage resulted in a no go for a -pull- for the engines to use. So, I looked into the SC-E-FS config file and set the fuelCrossFeed=True. This allowed for cross feeding for use with the radial de-coupler and the E shuttle fuselage. Would you like me to put in a pull request on the GH for these features/changes [@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) ?\n\u003E \n\nYes, please (to pull-request).  As long as it is working appropriately and the crossfeed toggle works on it still, then it sounds good to me.  If you can, make the PR vs. the \u0027coloredAdapters\u0027 branch; will make it a bit easier to merge into the current dev stuff (but other branches as base should work as well, don\u0027t think I\u0027ve touched the SC-E or RBDC files in the dev stuff)."},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2017-04-29T16:25:53Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Yes, please (to pull-request).  As long as it is working appropriately and the crossfeed toggle works on it still, then it sounds good to me.  If you can, make the PR vs. the \u0027coloredAdapters\u0027 branch; will make it a bit easier to merge into the current dev stuff (but other branches as base should work as well, don\u0027t think I\u0027ve touched the SC-E or RBDC files in the dev stuff).\n\u003E \n\nYeah, I can tell you haven\u0027t touched the SC-E files in a while, because your fuel gen is still running off of monopropellant, LOL. But, I will get on it now. I haven\u0027t made a pull request before, but I think I can muddle my way through it. \n\n\\*Edit\\*\n\nSorry for dinging everyone\u0027s GitHub email address a million times. Figuring out how to make a pull request. But, I think I did it now. Thanks for not shooting me. BanG BanG. \n\n**Edited \u003Ctime datetime=\u00222017-04-29T17:34:52Z\u0022 title=\u002204/29/2017 05:34  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 29, 2017\u003C/time\u003E by ComatoseJedi**"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-04-29T19:36:20Z","Content":"Recoloring now has user-selectable specular control on masked portions of the texture; everything from super-shiny, to dull/matte:\n\n![lkV8NdD.png](http://i.imgur.com/lkV8NdD.png)\n\n![dPdX88v.png](http://i.imgur.com/dPdX88v.png)\n\n\u003E \n\u003E \n\u003E 3 hours ago, ComatoseJedi said:\n\u003E \n\u003E \n\u003E Yeah, I can tell you haven\u0027t touched the SC-E files in a while, because your fuel gen is still running off of monopropellant, LOL. But, I will get on it now. I haven\u0027t made a pull request before, but I think I can muddle my way through it. \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \\*Edit\\*\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Sorry for dinging everyone\u0027s GitHub email address a million times. Figuring out how to make a pull request. But, I think I did it now. Thanks for not shooting me. BanG BanG.\n\u003E \n\nNo worries, and thanks for submitting it.  Should be able to get it worked into the dev versions shortly."},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2017-04-29T20:59:10Z","Content":"\u003E \n\u003E \n\u003E 1 hour ago, Shadowmage said:\n\u003E \n\u003E \n\u003E No worries, and thanks for submitting it.  Should be able to get it worked into the dev versions shortly.\n\u003E \n\nyeah, it\u0027s a small, minute contribution considering the huge amount of coding that went into the mod. But, it seemed simple enough to make happen. I will look into if there are any problems with making cross feed true on the SC-E-FS/FSX parts (It shouldn\u0027t, but doesn\u0027t hurt to test)."},{"CreatedByName":"N3N","CreatedById":165167,"CreatedDateTime":"2017-04-30T03:45:28Z","Content":"Hey Shadowmage,\n\nI\u0027m currently trying to build a big space station and a spacecraft for longer travels and this mod (and its add-ons) is perfect for this. Thanks! ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)\n\n\u003E \n\u003E \n\u003E On 28.8.2016 at 5:35 PM, Shadowmage said:\n\u003E \n\u003E \n\u003E Couple other points:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E I will be using RocketParts as the construction resource for a base install, switching to MaterialKits/etc if UKS is installed.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Will be adding RocketParts/etc as resources to all MFT tanks so that they may be shipped/launched to the stations.  In the future I will be making custom container-style parts for \u0027dry\u0027 resources, but for now the tanks should be sufficient.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Initial balance for kit-out mass will be 20%/80% for all parts.  This will be adjusted/updated on a per-part basis in the future.\n\u003E \n\nMy Question is, if there is yet a possibility to change from RocketParts to the MKS resources, because I have installed all \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E mods and his LS, but not EL.\n\nSorry for my english, but it\u0027s only my third language."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-04-30T15:37:54Z","Content":"\u003E \n\u003E \n\u003E 11 hours ago, N3N said:\n\u003E \n\u003E \n\u003E My Question is, if there is yet a possibility to change from RocketParts to the MKS resources, because I have installed all \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E mods and his LS, but not EL.\n\u003E \n\nNot currently available as a built-in; but you could try to make a patch for it yourself.\n\nShould be something as simple as:\n\n    @PART[*]:HAS[@MODULE[SSTUInflatable]]:AFTER[SSTU]\n    {@resourceName = MaterialKits@inflationCost *= 1.33333\n    }\n\n(Warning:  Untested....)"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2017-04-30T18:33:00Z","Content":"The specular mask control looks pretty incredible, BTW."},{"CreatedByName":"N3N","CreatedById":165167,"CreatedDateTime":"2017-05-01T03:23:00Z","Content":"\u003E \n\u003E \n\u003E 11 hours ago, Shadowmage said:\n\u003E \n\u003E \n\u003E Not currently available as a built-in; but you could try to make a patch for it yourself.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Should be something as simple as:\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E     \n\u003E     \n\u003E     @PART[*]:HAS[@MODULE[SSTUInflatable]]:AFTER[SSTU]\n\u003E     {@resourceName = MaterialKits@inflationCost *= 1.33333\n\u003E     }\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E (Warning:  Untested....)\n\u003E \n\nHey Shadowmage,\n\nThank you! ![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022)\n\nIf I understand this right, it changes \u0022RocketParts\u0022 to \u0022MaterialKits\u0022 and set the cost to inflate it 1,33333x higher than before.\n\nIs this right? (I\u0027m just learning about \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E patches)"},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2017-05-01T14:54:28Z","Content":"engines have stopped gimbaling.\n\nMods: SSTU. RP-Stock\n\nLog: [https://www.dropbox.com/s/3rj2rv3zy7yvj70/KSP.log?dl=0](https://www.dropbox.com/s/3rj2rv3zy7yvj70/KSP.log?dl=0)"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-05-01T15:00:29Z","Content":"\u003E \n\u003E \n\u003E 4 minutes ago, DarthVader said:\n\u003E \n\u003E \n\u003E engines have stopped gimbaling.\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Mods: SSTU. RP-Stock\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Log: [https://www.dropbox.com/s/3rj2rv3zy7yvj70/KSP.log?dl=0](https://www.dropbox.com/s/3rj2rv3zy7yvj70/KSP.log?dl=0)\n\u003E \n\nWhatever it is, it is a problem with one of your mods or your particular install/setup.\n\nTry removing mods one at a time until the problem goes away.  Or start with a fresh install and add mods one at a time until the problem manifests.\n\nUnless/until you can tell me which mod it is, there is nothing that I can do."},{"CreatedByName":"Kerbal01","CreatedById":57322,"CreatedDateTime":"2017-05-01T15:05:11Z","Content":"Reinstalling everything fixed it."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-05-01T21:24:46Z","Content":"General development updates:\n\nWork on the recoloring system is coming along well.  Most models\u002Btextures that will have recoloring support have been converted.  Should be finishing of the rest of the engine-mount masks and textures this evening.  Many of the engine mounts have had minor UV layout changes to allow for a few additional texture patterns/layouts.  All recolorable parts will have at least two masks / patterns / texture-sets, with many having quite a few more (tanks have \u003E 10).  The old/existing color and pattern schemes should be able to be replicated with the new layouts, with most parts defaulting to a mask\u002Bcolor set equivalent to the old defaults. \n\nUp next will be working on converting the MUS models and textures to the new system.  Hoping to get the MUS models to use the same texture sheets as the rest of the MFT tank models, but they may still end up using their own textures.  Will also be breaking the model up a bit to allow for the top-cap / dome to be a modular adapter type.  Looking to also include a set of ICPS/HUS-style \u0027foam\u0027 domes/caps (probably ripped right from the HUS model\u002Btextures), for use on both the MUS and the rest of the MFTs.\n\nIf anyone is interested in giving the recolorable-parts-system a bit of a test-drive, send me a PM and we can work out the details (still doing dev on KSP 1.2.2).  Quite a few things in the dev version are....unstable.... so it is not ready for widespread/general testing yet, but quite a bit of it is usable enough for some feedback on the recoloring-system basics (and for creation of promo materials in prep for the next release)."},{"CreatedByName":"martinezfg11","CreatedById":59995,"CreatedDateTime":"2017-05-01T21:26:52Z","Content":"That recoloring system is awesome!!! I haven\u0027t checked your GitHub but will it\u0027s use be documented there?"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-05-01T21:41:18Z","Content":"\u003E \n\u003E \n\u003E 9 minutes ago, martinezfg11 said:\n\u003E \n\u003E \n\u003E That recoloring system is awesome!!! I haven\u0027t checked your GitHub but will it\u0027s use be documented there?\n\u003E \n\nProbably not initially.  It is pretty simple and straightforward to use though, even in its current rough prototype implementation.  I\u0027ll probably put together some quick-and-dirty instructions for it once I get the UI finalized; a bit too early to work on it right now though.\n\nAs the mod progresses towards the 1.0 version I plan on putting together full documentation of all of the systems, likely publish it as a .pdf to go along with the mod releases.  Still at least several months away though; only up to version 0.5 (current) -\u003E 0.6 (upcoming releases), and already have several existing systems and parts that will be replaced or see major changes between now and 1.0."},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2017-05-02T00:25:26Z","Content":"Quick question on preferred GUI setup for part-recoloring; options include:\n\n1. Single GUI for entire vessel, with a list of all recolorable parts for the craft.  Launched from a button on the stock app-launcher.  Button on the GUI to highlight which part each GUI entry corresponds to.  This is the current setup for the dev GUI.  It works, but can be a bit difficult to locate the exact part that you want to recolor, especially on craft with lots of parts (many of which may have up to 3 GUI entries each).  On smaller craft it is nice to be able to recolor the entire craft from a single GUI, but quickly grows difficult to use with addition of more parts.\n2. Per-part/module GUI controls from the stock part right-click menu.  Ideally it would only add a single button per part (\u0027Recolor Part\u0027), that would open a GUI showing each section for the part (up to 3 sections are used on the MFT parts).  Main downside is the extra buttons on the right-click menu, some of which are already quite busy.\n3. Hotkey to open the recolor GUI for the part currently under the cursor.  I really like this system, except for the inherent conflict that mod added hotkeys bring.  Hotkey can be made configurable, but conflicts will still arise given a large enough pool of mods installed and using hotkeys.  As per #2, this GUI would only show recoloring options for the currently selected part.  No additional per-tick overhead as the input-handling can be added to existing classes that already have per-update/frame methods."},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2017-05-02T00:43:41Z","Content":"#2 makes the most sense to me.  Key shortcuts can be handy but as you mention the chances of a conflict are high.  They\u0027re also harder for new players to find."},{"CreatedByName":"rasta013","CreatedById":140002,"CreatedDateTime":"2017-05-02T00:53:39Z","Content":"I love the idea of #3 but I completely understand the hesitation in introducing something that is likely going to result in support requests.  With this in mind I favor #1.  Even though the part list may be extensive the nightmare of recoloring by having to select each individual part and hunt down each button on each part is worse.  With #1, would it be possible to use part highlighting to identify which part is being targeted as you scroll over the list? That bit would make identifying the part you\u0027re working on easier for large craft and keep us from having to constantly hunt down buttons in complicated lists.  \n\nThis could even be easier if the part list was able to be sorted by name (not necessary but a consideration maybe).  Just spit balling a bit here..."},{"CreatedByName":"ComatoseJedi","CreatedById":91567,"CreatedDateTime":"2017-05-02T01:12:59Z","Content":"I am in favor of #1, too. When you look at the vessel as a whole and the intention of the mod to have a lower part count. The idea of overwhelming part count for a GUI based as #1 suggests wouldn\u0027t be as bad as it would seem. But, also with that said, I don\u0027t see a problem with the color/texture system that\u0027s there now, unless you are looking for a simpler way to change textures with the parts. If you know me, I\u0027m a \u0022If it ain\u0027t broke, don\u0027t fix it\u0022 sorta guy. But, the specular work is spectacular. I love that, long time... you party? lol."},{"CreatedByName":"Rocketology","CreatedById":152263,"CreatedDateTime":"2017-05-02T05:08:24Z","Content":"[@Shadowmage](https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/) Seriously, epic mod! The tweakable parts design is ingenious, I think Squad would be wise to take notice! As many mods as I use regularly, I am surprised I have not run across this gem before now.\n\n[@Akira_R](https://forum.kerbalspaceprogram.com/index.php?/profile/117470-akira_r/) Thank you for the .cfg for SMURFF! All I needed to do was lower the thrust multiplier a bit and it and it nails realish values for my 10.6X GPP career."},{"CreatedByName":"blowfish","CreatedById":119688,"CreatedDateTime":"2017-05-02T07:03:16Z","Content":"Had a chance to mess with the dev version a bit tonight and I can say that I\u0027m still firmly for #2, maybe even moreso.  With even a moderate number of recolorable parts on the vessel, the whole vessel list quickly becomes challenging to navigate, or to even remember where you are when you\u0027re trying to recolor just one part."}]}