{"TopicId":117215,"ForumId":36,"TopicTitle":"[WIP] [1.1.2] DIRECT - Super-Heavy Launchers - REVAMP RELEASE","CreatedByName":"benjee10","CreatedById":84110,"CreatedDateTime":"2015-07-29T23:04:48Z","PageNum":5,"Articles":[{"CreatedByName":"sharpspoonful","CreatedById":83734,"CreatedDateTime":"2015-11-03T15:16:34Z","Content":"So some suggestions:\n\nAt first glance the SLT, Atmospheric and non-atmospheric DV, and ISP seem to be correct and fit to payloads of this lifters\u0027 class. Artwork on the ET need some cleaning up, but they are not terrible. I will report more as I play with the parts this week.\n\nand photos:\n\n![zilUNt7.jpg](http://i.imgur.com/zilUNt7.jpg)\n\n![mqBZ3NV.jpg](http://i.imgur.com/mqBZ3NV.jpg)"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-11-17T22:07:53Z","Content":"EDIT: Okay, I\u0027ve spent a few hours tearing my install apart trying to find out why pieces are missing, ect. I thought it might have been a RAM problem.  \n\nWell, in the log file, I\u0027m getting a lot of errors that say something like: \u0022Cannot compile part/Cannot clone model/Model doesn\u0027t exist\u0022 for every model included in this mod, however somehow it fixes itself as the models show up in-game.  \n\nThe second part to this is that I was missing the SRB nosecone, and couldn\u0027t get it to show up. Turns out in the code, you have: \u0022model = Benjee10/DIRECT\\_LV/Parts/SRB/SRBnoseCone\u0022  \n\nBut the directory given in the download doesn\u0027t include the first \u0022Benjee10\u0022 folder, so the nosecone never shows up because KSP can\u0027t find the folder named \u0022Benjee10.\u0022  \n\nKinda blows because I spent a few hours frantically looking through my install of KSP, thinking there was something I screwed up or it was my computer, ect but in reality it was an \u0022oopsie\u0022 in the config file.  \n\nOther than that, I\u0027m having major issues getting a launch vehicle for a shuttle working. Not sure if it\u0027s a collision mesh issue or not but the physics upon loading up the launch pad are very strange, and it blows up immediately on throttling up. I\u0027ve been using a stock shuttle strapped to the orange ET tanks and using two 5-segment SRB\u0027s from this mod.\n\n**Edited \u003Ctime datetime=\u00222015-11-18T01:31:39Z\u0022 title=\u002211/18/2015 01:31  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 18, 2015\u003C/time\u003E by -ctn-**"},{"CreatedByName":"benjee10","CreatedById":84110,"CreatedDateTime":"2015-11-18T12:08:46Z","Content":"Ah, sorry about that! Forgot I\u0027d changed the directory in the middle of development, must have forgotten to change the .cfg for the nosecone.   \n\nI think 1.0.5 changed how part colliders work a little so I\u0027ll look into the exploding thing. Haven\u0027t tested with 1.0.5 yet.   \n\nThanks for the feedback!"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-11-18T13:29:38Z","Content":"Not a big deal.   \n\nI did try to replicate that obnoxiously huge Jupiter III-X rocket (two external shuttle tanks, four shuttle SRBs) and I had to scale the stock s-25 cluster up and change the thrust to 7000kN, empty half of the external tanks, and I still had a TWR ratio of less than 1.  \n\nSo for anyone looking to try that with 5m parts, your going to need a stupid powerful engine on the first stage.   \n\nI did however get that design working with 3.75m parts, and I used the configs to rescale this mod\u0027s external tank nose cone and end cap, and that worked beautifully with no collision errors or problems of any kind."},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-11-18T21:55:36Z","Content":"Also, I know it\u0027s a WIP release, but are the fairings supposed to be texture less? Cause they are on my machine."},{"CreatedByName":"xv323","CreatedById":151705,"CreatedDateTime":"2015-11-19T20:16:00Z","Content":"Just came across this and read through the thread. The large rocket parts look brilliant but personally I\u0027m getting grabby hands for that pod, it looks properly awesome! I\u0027m a massive fan of the Taurus HCV pod because a) it\u0027s huge and b) it\u0027s got lovely big windows and a great IVA - and from what I can tell your Fortuna pod very much fits that mold, except it\u0027s a 3.75m-2.5m pod instead of a 3.75m-1.25m pod like the Taurus is. Would be absolutely perfect to fill a niche for me! If I may ask, is it planned that the first release of the pod itself will include an IVA or will that come in a subsequent update?  \n\nThis mod as a whole looks fantastic, can\u0027t wait to see more and to get said grabby hands of mine on it! :D"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-11-19T20:19:47Z","Content":"Found out the fairing config file has that extra \u0022Benjee10\u0022 folder in the directory path as well.   \n\nOther than that, everything looks good. Wish we had a 5m engine for upper stages or a Saturn V style engine for the bottom stages."},{"CreatedByName":"benjee10","CreatedById":84110,"CreatedDateTime":"2015-11-19T21:58:02Z","Content":"Cheers for the feedback guys! Made some changes which should fix most issues and switched to using PorkJet\u0027s SSME model for the RS-25 engines (original Vector engine is still in place)  \n\nAlso made an External Tank part which makes balancing shuttles a whole lot easier since the CoM doesn\u0027t shift during flight:  \n\n[img]http://i.imgur.com/Nh7Giwg.png[/img]  \n\n[img]http://i.imgur.com/igJ1Gk7.png[/img]  \n\nI\u0027ve bundled the Shuttle craft file with the release. Flies pretty well. Can get into a 100x100km orbit pretty easily, haven\u0027t tested it with a payload yet though.  \n\n[SIZE=5][B][url=https://kerbalstuff.com/mod/1280/DIRECT%20-%20Launch%20Vehicles]Download on KerbalStuff![/url][/B][/SIZE]"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-11-19T22:12:31Z","Content":"Awesome! Can\u0027t wait to check it out after work."},{"CreatedByName":"VenomousRequiem","CreatedById":137373,"CreatedDateTime":"2015-11-19T23:38:54Z","Content":"So I have literally just this and the Squad folder in my GameData. Is there something else I need for the STS.craft? It says it can\u0027t open it because of locked parts.  \n\nUpdate- Also the boosters explode when I try to decouple them, but maybe it\u0027s a one time thing. Will continue testing.\n\n**Edited \u003Ctime datetime=\u00222015-11-19T23:41:52Z\u0022 title=\u002211/19/2015 11:41  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 19, 2015\u003C/time\u003E by VenomousRequiem**"},{"CreatedByName":"benjee10","CreatedById":84110,"CreatedDateTime":"2015-11-20T00:11:59Z","Content":"As far as I know it should work with only stock. You\u0027re running 1.0.5 right?"},{"CreatedByName":"VenomousRequiem","CreatedById":137373,"CreatedDateTime":"2015-11-20T00:13:17Z","Content":"[quote name=\u0027benjee10\u0027]As far as I know it should work with only stock. You\u0027re running 1.0.5 right?[/QUOTE]  \n\nYes sir.  \n\n\u0022Vessel was not loaded because missing part: 5mET\u0022\n\n**Edited \u003Ctime datetime=\u00222015-11-20T00:16:19Z\u0022 title=\u002211/20/2015 12:16  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 20, 2015\u003C/time\u003E by VenomousRequiem**"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-11-20T00:34:40Z","Content":"Forgive the basic question, but you are running sandbox mode and/or have everything unlocked in career mode? I personally haven\u0027t had time to check the update release out, so I can\u0027t confirm one way or the other."},{"CreatedByName":"benjee10","CreatedById":84110,"CreatedDateTime":"2015-11-20T00:51:48Z","Content":"Welp, I found the problem, I copied the External Tank model file into the release folder without the .cfg to go with it because I\u0027m an idiot :confused:  \n\nFixed now. Just re-download from KerbalStuff."},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2015-11-20T00:54:08Z","Content":"[quote name=\u0027benjee10\u0027]Welp, I found the problem, I copied the External Tank model file into the release folder without the .cfg to go with it because I\u0027m an idiot :confused:  \n\n.[/QUOTE]  \n\nDon\u0027t you just love modding? I can\u0027t tell you how many times I\u0027ve forgotten a line of code or misplaced a file."},{"CreatedByName":"VenomousRequiem","CreatedById":137373,"CreatedDateTime":"2015-11-20T03:13:42Z","Content":"[quote name=\u0027benjee10\u0027]Welp, I found the problem, I copied the External Tank model file into the release folder without the .cfg to go with it because I\u0027m an idiot :confused:  \n\nFixed now. Just re-download from KerbalStuff.[/QUOTE]  \n\nWhere would you be without me? :P"},{"CreatedByName":"-ctn-","CreatedById":130898,"CreatedDateTime":"2016-02-03T06:22:20Z","Content":"Any updates or future plans, benjee10?"},{"CreatedByName":"Daelkyr","CreatedById":149075,"CreatedDateTime":"2016-03-13T01:52:53Z","Content":"This looks awesome, but Kerbalstuff is down. Is there another download option?"},{"CreatedByName":"benjee10","CreatedById":84110,"CreatedDateTime":"2016-03-15T23:04:17Z","Content":"Will be returning to this mod when I have time, for now here is a re-release of the alpha version:  \n  \n[Download](http://spacedock.info/mod/415/DIRECT%20Launch%20Vehicles)\n\nProbably won\u0027t have time to work on this much for a while, will be focusing more on the HabTech parts when I have time."},{"CreatedByName":"Daelkyr","CreatedById":149075,"CreatedDateTime":"2016-03-15T23:11:27Z","Content":"Your back!!!!! Great to see you."},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2016-03-16T00:57:20Z","Content":"Oooooo.... That 2.5m -\u003E 3.75m capsule is DIVINE... ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)"},{"CreatedByName":"Neutrinovore","CreatedById":72520,"CreatedDateTime":"2016-03-17T07:15:08Z","Content":"\u003E \n\u003E \n\u003E On ‎3‎/‎16‎/‎2016 at 6:57 PM, Stone Blue said:\n\u003E \n\u003E \n\u003E Oooooo.... That 2.5m -\u003E 3.75m capsule is DIVINE... ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)\n\u003E \n\nI second this!  When will we see that command pod and its matching service/propulsion module?  That picture is what really got me interested in this mod in the first place, I\u0027m disappointed to learn that they\u0027re the ONLY things in that picture that aren\u0027t available yet.  ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022)"},{"CreatedByName":"benjee10","CreatedById":84110,"CreatedDateTime":"2016-04-03T14:50:27Z","Content":"Just a heads up, the current release seems to work with no problems with 1.1! I\u0027ll do a bit of a revamp soon since HabTech is nearing initial (non-alpha) release.\n\n\u003E \n\u003E \n\u003E On 15 March 2016 at 0:57 AM, Stone Blue said:\n\u003E \n\u003E \n\u003E Oooooo.... That 2.5m -\u003E 3.75m capsule is DIVINE... ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif \u0022:D\u0022)\n\u003E \n\n\u003E \n\u003E \n\u003E On 16 March 2016 at 7:15 AM, Neutrinovore said:\n\u003E \n\u003E \n\u003E I second this!  When will we see that command pod and its matching service/propulsion module?  That picture is what really got me interested in this mod in the first place, I\u0027m disappointed to learn that they\u0027re the ONLY things in that picture that aren\u0027t available yet.  ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif \u0022:(\u0022)\n\u003E \n\nI\u0027ll include that with the next update. I\u0027m going to have to recreate the .cfgs and everything because somehow I\u0027ve managed to lose them in transitioning between computers, but textures/models/unity set ups are still there so it shouldn\u0027t be too much hassle."},{"CreatedByName":"Bit Fiddler","CreatedById":103108,"CreatedDateTime":"2016-04-04T03:24:02Z","Content":"Can you add KSP-AVC and or support for CKAN so we can be notified of updates as they happen?\n\nOh and a heads up:  your link to deviant art in your sig is broken.\n\n**Edited \u003Ctime datetime=\u00222016-04-04T03:27:36Z\u0022 title=\u002204/04/2016 03:27  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 4, 2016\u003C/time\u003E by Bit Fiddler**"},{"CreatedByName":"benjee10","CreatedById":84110,"CreatedDateTime":"2016-04-14T17:02:48Z","Content":"\u003E \n\u003E \n\u003E On 4 April 2016 at 4:24 AM, Bit Fiddler said:\n\u003E \n\u003E \n\u003E Can you add KSP-AVC and or support for CKAN so we can be notified of updates as they happen?\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E  \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E Oh and a heads up:  your link to deviant art in your sig is broken.\n\u003E \n\nShould be automatically added to CKAN via SpaceDock. I\u0027ll take a look next time I update to make sure that\u0027s working ok!\n\nAnd cheers for the heads up ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif \u0022;)\u0022) \n\nWith HabTech in a released state now I\u0027ll do a rough outline of where I see DIRECT heading in future. Items in bold are things I anticipate happening soon. \n\n- **Revamp current parts.** They\u0027re lagging behind a little in terms of visual style and I want to bring them in line with HabTech and the Porkjet style. For most parts that\u0027ll just mean tweaking some textures here and there and tightening them up, whereas for others (looking at you SRBs) I\u0027ll be doing a complete remodel (keeping nodes and everything in the same place).\n- IVAs for credible parts.\n- **Give *Fortuna* Command/Service Module a separate release.** This pod doesn\u0027t really fit with my vision of the mod anymore but I\u0027ll be doing it up and releasing it on it\u0027s own.\n- Finish original DIRECT plans. That means adding the massive fuel tanks for the Jupiter III and a couple of structural adapters.\n- **Spacecraft parts**, starting with a 3.75m Porkjet style **Orion** and accompanying **Altair** lander.\n- Heavy Duna lander parts. Something that can be used to ferry either crew or cargo and offload it.\n- Heavy habitat parts (think modern Skylab, centrifuges etc.).\n- Various Shuttle-derivative parts, e.g. allowing building Shuttle-C."}]}