{"TopicId":121236,"ForumId":36,"TopicTitle":"[Plugin/Parts] Kerbal Foundries - Continuation [Latest: 1.9g]","CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-09-19T16:29:37Z","PageNum":3,"Articles":[{"CreatedByName":"linuxgurugamer","CreatedById":129964,"CreatedDateTime":"2015-11-09T14:11:12Z","Content":"\n\u003Cp\u003EGaalidas,\u003C/p\u003E\u003Cp\u003EI understand some of your frustration with CKAN. If you would be interested, I\u0027d be happy to work on that side to make sure that CKAN installs the mod properly, etc.\u003C/p\u003E\u003Cp\u003ETry to look at it from the player\u0027s side: A player can have over a hundred mods installed. Trying to keep track of each and every mod and it\u0027s updates can become a nightmare. Using CKAN, it can automatically detect changes and update those which need updating.\u003C/p\u003E\u003Cp\u003EIt does have a few problems, but overall, it is a big help to most people using it. And yes, I include myself among those.\u003C/p\u003E\u003Cp\u003ELet me ask you this: If you were going to come out with a 2.0 release, how difficult would it be to use a slightly different versioning system. Instead of letters and numbers, why not just have 4 numbers, which would be use ad the following:\u003C/p\u003E\u003Cp\u003Ea.b.c.d\u003C/p\u003E\u003Cp\u003Ewhere\u003C/p\u003E\u003Cp\u003Ea = major version number\u003C/p\u003E\u003Cp\u003Eb = minor version number\u003C/p\u003E\u003Cp\u003Ec = patch number\u003C/p\u003E\u003Cp\u003Ed = build number (optional).\u003C/p\u003E\u003Cp\u003EThis would also let you be able to include a .version file which would be usable by the KSP AVC mod, which simply notifies players about new versions when available.\u003C/p\u003E\u003Cp\u003EThe work on your side would be minimal; Simply use a new system for versions, and keep the .version file up-to-date with each release.\u003C/p\u003E\u003Cp\u003EHere is an example .version file:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E{\u003Cbr\u003E\t\u0022NAME\u0022:\u0022Better Science Labs Continued\u0022,\u003Cbr\u003E\t\u0022URL\u0022:\u0022http://ksp-avc.cybutek.net/version.php?id=177\u0022,\u003Cbr\u003E\t\u0022DOWNLOAD\u0022:\u0022https://kerbalstuff.com/mod/903/Better%20Science%20Labs%20Continued/download\u0022,\u003Cbr\u003E\t\u0022CHANGE_LOG_URL\u0022:\u0022https://kerbalstuff.com/mod/903/Better%20Science%20Labs%20Continued#changelog\u0022,\u003Cbr\u003E\t\u0022VERSION\u0022:\u003Cbr\u003E\t{\u003Cbr\u003E\t\t\u0022MAJOR\u0022:0,\u003Cbr\u003E\t\t\u0022MINOR\u0022:1,\u003Cbr\u003E\t\t\u0022PATCH\u0022:4,\u003Cbr\u003E\t\t\u0022BUILD\u0022:0\u003Cbr\u003E\t},\u003Cbr\u003E\t\u0022KSP_VERSION\u0022:\u003Cbr\u003E\t{\u003Cbr\u003E\t\t\u0022MAJOR\u0022:1,\u003Cbr\u003E\t\t\u0022MINOR\u0022:0,\u003Cbr\u003E\t\t\u0022PATCH\u0022:4\u003Cbr\u003E\t}\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe ksp avc online site will actually make this for you, once you enter the correct info. Or, I\u0027d be happy to. Once you have the file, the only thing you would need to update would be the version numbers.\u003C/p\u003E\u003Cp\u003ELet me know if you are interested. I think this is a really great mod, and think it would be a shame to prevent some people from using it simply because it wasn\u0027t in CKAN.\u003C/p\u003E\u003Cp\u003ELinuxgurugamer\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-11-09T15:32:47Z","Content":"\n\u003Cp\u003EHello? Gaalidas?? This is a rather serious bug here. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smjjames\u0022 data-cite=\u0022smjjames\u0022\u003E\u003Cdiv\u003EHey, I found a REALLY major bug, I\u0027m using the wheels on a VTOL craft that I\u0027m using trying to test something with TCA and when I pause the game with esc, the game doesn\u0027t actually pause. Those dustfx errors I mentioned earlier are happening at the same time.\u003Cp\u003ENot sure why nobody has noticed it before now actually, or has it been?\u003C/p\u003E\u003Cp\u003EEdit: Output log: \u003Ca href=\u0022http://sta.sh/0285g412sycp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://sta.sh/0285g412sycp\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-11-11T17:03:38Z","Content":"\n\u003Cp\u003EIs there a way to remove the dustFX from the folder? I would like to use the KF wheels, but there is something going on with the dustFX and the pause menu which is making the game not actually pause.\u003C/p\u003E\n"},{"CreatedByName":"ZodiusInfuser","CreatedById":76163,"CreatedDateTime":"2015-11-11T17:11:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smjjames\u0022 data-cite=\u0022smjjames\u0022\u003E\u003Cdiv\u003EIs there a way to remove the dustFX from the folder? I would like to use the KF wheels, but there is something going on with the dustFX and the pause menu which is making the game not actually pause.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI reported this bug to Gaalidas a while ago when getting my IR Mecanum wheels ready for pre-release. Would be great if it could be fixed so I could push ahead with a full release.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-11-11T22:26:28Z","Content":"\n\u003Cp\u003EHonestly, guys, I have no idea what is going on with your pause issues. I do not experience anything like that at all.\u003C/p\u003E\u003Cp\u003EWith 1.0.5, I was watching a video today on YouTube and noticed the KF app-launcher icon is duplicating itself a ton again. I\u0027m really annoyed by this considering I fixed that already a long time ago. Why must Squad screw everything up again?\u003C/p\u003E\u003Cp\u003EDisabling DustFX for the \u0022folder\u0022 isn\u0027t something you do here. In KSP, there are no \u0022folders\u0022 since everything is loaded into memory under a database of some sort. Now, if you mean to disable it for the parts, yes... you \u003Cem\u003Ecould\u003C/em\u003E remove the module from the parts. However, the code is set up to re-add that module if it doesn\u0027t already exist. When I get around to updating this mod properly, that will change to a certain degree. Right now, the in-game toggle only toggles the spawning of the individual effects for the dust. I\u0027m working on a way to disable the module completely on all parts in the game when that toggle is in the off position so it stops even checking for the \u0022enabled\u0022 variable. It\u0027s all a work in progress though.\u003C/p\u003E\u003Cp\u003EI\u0027m afraid it\u0027s going to take a bit more time before I can get an updated github repository up and release an update. So sorry that this is delaying other releases, but I\u0027ll see if I can accelerate things a little bit. In the mean time if anyone has any information about why previously working mods are now having their app-launcher icons duplicated again, and what needs to be done to fix it, I\u0027d love to hear it.\u003C/p\u003E\u003Cp\u003EAs well if anyone has any thoughts as to why the pause thing is broken, I\u0027m all ears. I have the pause events registered in my code, and I have methods for handling those events which disable the effects on pause, and reverse them when un-paused, but I don\u0027t see how anything I\u0027m doing (which is pretty much the same thing other mods have been doing forever) would be stopping the game from actually pausing itself. Nothing I do in the code is overriding any of the original KSP code, so it shouldn\u0027t be causing any malfunctions in said original code unless KSP has a bug of its own. Like I said above, I do not experience this bug in my game.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022linuxgurugamer\u0022 data-cite=\u0022linuxgurugamer\u0022\u003E\u003Cdiv\u003EGaalidas,\u003Cp\u003EI understand some of your frustration with CKAN. If you would be interested, I\u0027d be happy to work on that side to make sure that CKAN installs the mod properly, etc.\u003C/p\u003E\u003Cp\u003ETry to look at it from the player\u0027s side: A player can have over a hundred mods installed. Trying to keep track of each and every mod and it\u0027s updates can become a nightmare. Using CKAN, it can automatically detect changes and update those which need updating.\u003C/p\u003E\u003Cp\u003EIt does have a few problems, but overall, it is a big help to most people using it. And yes, I include myself among those.\u003C/p\u003E\u003Cp\u003ELet me ask you this: If you were going to come out with a 2.0 release, how difficult would it be to use a slightly different versioning system. Instead of letters and numbers, why not just have 4 numbers, which would be use ad the following:\u003C/p\u003E\u003Cp\u003Ea.b.c.d\u003C/p\u003E\u003Cp\u003Ewhere\u003C/p\u003E\u003Cp\u003Ea = major version number\u003C/p\u003E\u003Cp\u003Eb = minor version number\u003C/p\u003E\u003Cp\u003Ec = patch number\u003C/p\u003E\u003Cp\u003Ed = build number (optional).\u003C/p\u003E\u003Cp\u003EThis would also let you be able to include a .version file which would be usable by the KSP AVC mod, which simply notifies players about new versions when available.\u003C/p\u003E\u003Cp\u003EThe work on your side would be minimal; Simply use a new system for versions, and keep the .version file up-to-date with each release.\u003C/p\u003E\u003Cp\u003EHere is an example .version file:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E{\u003Cbr\u003E    \u0022NAME\u0022:\u0022Better Science Labs Continued\u0022,\u003Cbr\u003E    \u0022URL\u0022:\u0022http://ksp-avc.cybutek.net/version.php?id=177\u0022,\u003Cbr\u003E    \u0022DOWNLOAD\u0022:\u0022https://kerbalstuff.com/mod/903/Better%20Science%20Labs%20Continued/download\u0022,\u003Cbr\u003E    \u0022CHANGE_LOG_URL\u0022:\u0022https://kerbalstuff.com/mod/903/Better%20Science%20Labs%20Continued#changelog\u0022,\u003Cbr\u003E    \u0022VERSION\u0022:\u003Cbr\u003E    {\u003Cbr\u003E        \u0022MAJOR\u0022:0,\u003Cbr\u003E        \u0022MINOR\u0022:1,\u003Cbr\u003E        \u0022PATCH\u0022:4,\u003Cbr\u003E        \u0022BUILD\u0022:0\u003Cbr\u003E    },\u003Cbr\u003E    \u0022KSP_VERSION\u0022:\u003Cbr\u003E    {\u003Cbr\u003E        \u0022MAJOR\u0022:1,\u003Cbr\u003E        \u0022MINOR\u0022:0,\u003Cbr\u003E        \u0022PATCH\u0022:4\u003Cbr\u003E    }\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe ksp avc online site will actually make this for you, once you enter the correct info. Or, I\u0027d be happy to. Once you have the file, the only thing you would need to update would be the version numbers.\u003C/p\u003E\u003Cp\u003ELet me know if you are interested. I think this is a really great mod, and think it would be a shame to prevent some people from using it simply because it wasn\u0027t in CKAN.\u003C/p\u003E\u003Cp\u003ELinuxgurugamer\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen things calm down around here and I have more energy to spend working on this mod, I\u0027ll look into it. What gives me grief and headaches are when I get messages from people asking me to fix my mod so that they can use a 3rd party program to install the mod that I only just took over. I really have nothing directly against mod install helpers. Heck, I use one with all my Bethesda games and they\u0027re pretty much as simply to install for, manually, as KSP is. What I don\u0027t like are demanded updates to a mod because of a bug with the 3rd party program that I am, supposedly, obligated to implement a work-around for. Thus, I had to make it clear that I was not going to add any extra files or code-fixes or anything just because a 4rd party program didn\u0027t like what the original author did with his version numbers.\u003C/p\u003E\u003Cp\u003EThanks for providing such clear information, however. I\u0027ll stick it in my to-do list.\u003C/p\u003E\n"},{"CreatedByName":"ZodiusInfuser","CreatedById":76163,"CreatedDateTime":"2015-11-11T23:01:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaalidas\u0022 data-cite=\u0022Gaalidas\u0022\u003E\u003Cdiv\u003EAs well if anyone has any thoughts as to why the pause thing is broken, I\u0027m all ears. I have the pause events registered in my code, and I have methods for handling those events which disable the effects on pause, and reverse them when un-paused, but I don\u0027t see how anything I\u0027m doing (which is pretty much the same thing other mods have been doing forever) would be stopping the game from actually pausing itself. Nothing I do in the code is overriding any of the original KSP code, so it shouldn\u0027t be causing any malfunctions in said original code unless KSP has a bug of its own. Like I said above, I do not experience this bug in my game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s an exception that\u0027s at fault (I PMed you the error back when I encountered it a month ago). Because the exception isn\u0027t handled in your code it gets pushed in to KSP to handle, causing it to not finish all of its pause procedure. The solution is to prevent the exception from occurring or catch it when it does. I found it 100% reproducible with my mecanum wheels. Maybe try a fresh install of KSP with the Kerbal Foundries files bundled with those parts and see if it occurs then?\u003C/p\u003E\u003Cp\u003ERegarding the icon, that may have been an issue in 1.0.4 too. I know I encountered it after doing a database reload. See if you can get in contact with Ziw as he fixed the problem completely for Infernal Robotics.\u003C/p\u003E\u003Cp\u003EEdit: Here was the exception I encountered:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ENullReferenceException: Object reference not set to an instance of an object\u003Cbr\u003E  at KerbalFoundries.KFDustFX.OnPause () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at EventVoid.Fire () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at FlightDriver.SetPause (Boolean pauseState) [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at PauseMenu.Display () [0x00000] in \u0026lt;filename unknown\u0026gt;:0 \u003Cbr\u003E  at PauseMenu.Update () [0x00000] in \u0026lt;filename unknown\u0026gt;:0\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-11T23:05:35Z\u0022 title=\u002211/11/2015 11:05  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 11, 2015\u003C/time\u003E by ZodiusInfuser\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZodiusInfuser","CreatedById":76163,"CreatedDateTime":"2015-11-12T08:10:04Z","Content":"\n\u003Cp\u003EOk, that\u0027s interesting. Just downloaded 1.0.5 and copied over the version of IR \u0026amp; Kerbal Foundries I was using before, as well as the test craft that I encountered the bug on, and the pause menu is behaving fine for me. Assuming nothing crops up in my testing, I may actually be able to properly release my mecanum wheels! Is a 1.0.5 compatibility patch planned in the near future for KF? If not can I distribute the 1.0.4 version as per our PM discussion a while ago?\u003C/p\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-11-15T23:49:58Z","Content":"\nNope, still happens in 1.0.5. I grabbed a fresh download of KF as I wasn\u0026#39;t completely sure on the version (theres no version file) and checked with the small wheels and the bug is still there.\u003Cbr\u003E\n\u003Cbr\u003E\n[video=youtube;XCyotQRz2uk]https://www.youtube.com/watch?v=XCyotQRz2uk\u0026amp;feature=youtu.be[/video]\n"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-11-16T00:08:59Z","Content":"\n[quote name=\u0027smjjames\u0027]Nope, still happens in 1.0.5. I grabbed a fresh download of KF as I wasn\u0026#39;t completely sure on the version (theres no version file) and checked with the small wheels and the bug is still there.\u003Cbr\u003E\n\u003Cbr\u003E\n[URL]https://www.youtube.com/watch?v=XCyotQRz2uk\u0026amp;feature=youtu.be[/URL][/QUOTE]\u003Cbr\u003E\nOh wow was just coming to report this.\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-11-17T18:32:36Z","Content":"\nI thought that particular bug had been whacked, I have to admit. I\u0026#39;d be willing to bet its reappearance is probably caused by me stripping some of the superfluous stuff from CollisionFX out. I\u0026#39;m afraid I don\u0026#39;t have much more to add - haven\u0026#39;t looked at the code as I\u0026#39;ve probably forgotten most of the stuff I did by now. Is *Aqua* still about?\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-11-17T19:32:17Z","Content":"\n[quote name=\u0027lo-fi\u0027]I thought that particular bug had been whacked, I have to admit. I\u0026#39;d be willing to bet its reappearance is probably caused by me stripping some of the superfluous stuff from CollisionFX out. I\u0026#39;m afraid I don\u0026#39;t have much more to add - haven\u0026#39;t looked at the code as I\u0026#39;ve probably forgotten most of the stuff I did by now. Is *Aqua* still about?[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThey\u0026#39;re still acive, yeah, just haven\u0026#39;t posted in this thread yet I guess.\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-11-19T19:48:22Z","Content":"\nAlright guys, I\u0026#39;ll continue to poke around with this. My time is extremely limited. Quarter ends in the next few weeks I think, which means I can spend some time looking into this mess at that time. Thank you for the video, that is actually more helpful than simply providing the error message. I\u0026#39;m not as well versed in this stuff as others on these forums are, so the error reports mean very little to me. What does get my attention is a visual representation of what is happening so I can try and reproduce it.\u003Cbr\u003E\n\u003Cbr\u003E\nWhat confuses me about the pause menu is that the event for the pause state [I]is[/I] handled, in every module that runs during that time in the game. When I pause in my local game session, it pauses perfectly. I suspect some other mod is causing a conflict somewhere, but trying to nail that down is like trying to find a needle in an infinitely sized haystack that is expanding infinitely at the speed on light, what with the exponential growth of different mods available that make sweeping changes to one system or another is the KSP process. Not to mention official updates that throw extra crud into the fan.\u003Cbr\u003E\n\u003Cbr\u003E\nThat\u0026#39;s why I have made pleas to the community to help me nail this down. This is for the other mod developers mostly, as they will have access to source code (and know how to read it) and/or experience with managed code decompilers like ILSpy in which to figure out what could be doing what to cause a problem.\u003Cbr\u003E\n\u003Cbr\u003E\nEither way, I want you all to know that the only way this is going to be abandoned is if I come in here and declare it. Thus... lack of activity does not mean lack of attention. It simply means I\u0026#39;m super busy learning how to make delegates and derivative classes and interfaces (not to be confused with user interfaces, which would be easy in comparison) and developing API and/or console-level pseudo physics engines for simple arcade game interaction without helper assemblies to invent the wheel for me, metaphorically speaking that is. It\u0026#39;s brain-twisting and not very conductive to that sense of \u0022I wanna go home and mod KSP now!\u0022 So, I\u0026#39;m afraid all I can do is come in here and provide a status update from time to time. I will gladly look into anything constructive that is provided here, however. No promises that it will pan out, or end in a new release of any sort, but it\u0026#39;s a step in the right direction. Ultimately, I\u0026#39;ll have something updated before the new year (and I don\u0026#39;t mean 5 minutes before... more like weeks.)\u003Cbr\u003E\n\u003Cbr\u003E\nSo... hang in there, and pray (if you do that) that 1.1 doesn\u0026#39;t screw it all up.\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-11-19T23:17:43Z","Content":"\n[quote name=\u0027Gaalidas\u0027]Alright guys, I\u0026#39;ll continue to poke around with this. My time is extremely limited. Quarter ends in the next few weeks I think, which means I can spend some time looking into this mess at that time. Thank you for the video, that is actually more helpful than simply providing the error message. I\u0026#39;m not as well versed in this stuff as others on these forums are, so the error reports mean very little to me. What does get my attention is a visual representation of what is happening so I can try and reproduce it.\u003Cbr\u003E\n\u003Cbr\u003E\nWhat confuses me about the pause menu is that the event for the pause state [I]is[/I] handled, in every module that runs during that time in the game. When I pause in my local game session, it pauses perfectly. I suspect some other mod is causing a conflict somewhere, but trying to nail that down is like trying to find a needle in an infinitely sized haystack that is expanding infinitely at the speed on light, what with the exponential growth of different mods available that make sweeping changes to one system or another is the KSP process. Not to mention official updates that throw extra crud into the fan.\u003Cbr\u003E\n[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nThe video was done with just stock, KF, and exception detector (and maybe hangar extender, I forget if I included that), so there weren\u0026#39;t any other mods.\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2015-11-19T23:39:59Z","Content":"\n[quote name=\u0027Gaalidas\u0027]That\u0026#39;s why I have made pleas to the community to help me nail this down.[/quote]\u003Cbr\u003E\n[code] void OnPause()\u003Cbr\u003E\n{\u003Cbr\u003E\nisPaused = true;\u003Cbr\u003E\nkfdustFx.particleEmitter.enabled = false;\u003Cbr\u003E\n_[B]repLight[/B].enabled = false;\u003Cbr\u003E\n}\u003Cbr\u003E\n[/code]\u003Cbr\u003E\n[code] public void SetupParticles(bool repulsor)\u003Cbr\u003E\n{\u003Cbr\u003E\n[snip]\u003Cbr\u003E\nif ([B]repulsor[/B])\u003Cbr\u003E\n[B]SetupRepulsorLights[/B]();\u003Cbr\u003E\n}\u003Cbr\u003E\n\u003Cbr\u003E\nvoid SetupRepulsorLights()\u003Cbr\u003E\n{\u003Cbr\u003E\n[snip]\u003Cbr\u003E\n\u003Cbr\u003E\n_[B]repLight [/B]= _kfRepLight.AddComponent\u0026lt;Light\u0026gt;();[/code]\u003Cbr\u003E\n_repLight won\u0026#39;t be created for non-repulsors so your OnPause and OnUnpause methods will always throw if there\u0026#39;s a loaded wheel anywhere with dust enabled\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-11-19T23:47:22Z","Content":"\nOkay, I think I see what\u0026#39;s happening here. That was left over from lo-fi\u0026#39;s code I think. Alright, I\u0026#39;ll see about getting that patched up and updated sometime soon. I\u0026#39;m in class right now, but I\u0026#39;ll see what I can do.\n"},{"CreatedByName":"Lego8_bit","CreatedById":58076,"CreatedDateTime":"2015-11-23T19:40:46Z","Content":"\nsay I\u0026#39;ve been having a problem with the all the repulsors. the craft wants to flip over all the time and I don\u0026#39;t know why might be my building or not but i\u0026#39;m just putting this out there\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-11-23T19:50:26Z","Content":"\n[quote name=\u0027Lego8_bit\u0027]say I\u0026#39;ve been having a problem with the all the repulsors. the craft wants to flip over all the time and I don\u0026#39;t know why might be my building or not but i\u0026#39;m just putting this out there[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nCould you post a screenshot of your craft?\n"},{"CreatedByName":"Svm420","CreatedById":136047,"CreatedDateTime":"2015-11-24T07:12:14Z","Content":"\nPlease update for the pause issue. That is the most glaring issue atm, and I understand if you are busy IRL, so please take this as a polite plea. Thank you for continuing the mod :)\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-11-24T12:19:52Z","Content":"\n[quote name=\u0027lo-fi\u0027]Is *Aqua* still about?[/QUOTE]\u003Cbr\u003E\nSorry, guys!\u003Cbr\u003E\nI\u0026#39;m moving to a new place and didn\u0026#39;t had much time. May be I have more time in december. Also I didn\u0026#39;t noticed this new thread till now. :(\u003Cbr\u003E\n\u003Cbr\u003E\nDidn\u0026#39;t you said you\u0026#39;ll pause development until KSP 1.1?\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nEdit:\u003Cbr\u003E\nSo... Gaalidas is in charge now?\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-24T12:33:40Z\u0022 title=\u002211/24/2015 12:33  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 24, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-11-24T19:44:40Z","Content":"\n[quote name=\u0027Svm420\u0027]Please update for the pause issue. That is the most glaring issue atm, and I understand if you are busy IRL, so please take this as a polite plea. Thank you for continuing the mod :)[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nYeah, I don\u0026#39;t mind if you have to temporarily rip out the dust effects in order to fix it.\u003Cbr\u003E\n\u003Cbr\u003E\n[quote name=\u0027*Aqua*\u0027]Sorry, guys!\u003Cbr\u003E\nI\u0026#39;m moving to a new place and didn\u0026#39;t had much time. May be I have more time in december. Also I didn\u0026#39;t noticed this new thread till now. [IMG]http://forum.kerbalspaceprogram.com/images/smilies/k_sad.gif[/IMG]\u003Cbr\u003E\n\u003Cbr\u003E\nDidn\u0026#39;t you said you\u0026#39;ll pause development until KSP 1.1?\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nEdit:\u003Cbr\u003E\nSo... Gaalidas is in charge now?[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nHe is, however, he\u0026#39;s been busy with his own RL things, mainly college related.\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-11-26T01:11:27Z","Content":"\nYeah, I moved on from KSP months ago and handed over. Sounds like we\u0026#39;re all busy IRL, myself included.\u003Cbr\u003E\n\u003Cbr\u003E\nxEvilReeperx posted a clue to what\u0026#39;s wrong - it shouldn\u0026#39;t be hard to fix if one of us gets a few minutes to poke about with it. I\u0026#39;ll have a look if I\u0026#39;ve still got access and the dev tools, but it\u0026#39;ll be a while.. Absolutely 100% no way I\u0026#39;ll be in a position to reinvent the wheel again when 1.1 drops, though; got far too much on!\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-12-08T18:31:20Z","Content":"\n\u003Cp\u003E\nAlright, this forum change over really stinks... (I couldn\u0027t even log in until an administrator reset my password for me.  The standard password reset was failing to do the job.) )but I won\u0027t bore you all with my complaints and whatnot.  \u0022Finals\u0022 week is upon me and that means I\u0027ll be trying to get a new release for KF out sometime in the near future.  Most likely I\u0027ll release it as a new entry on KerbalStuff (meaning it won\u0027t be an update to the old mod, but rather a re-release) so that I\u0027ll have full control over the KerbalStuff page.  This will allow me to update the mod\u0027s background image, the description, the title, and everything else to match the current state of the mod.  The down side is that anyone using automated update tools will have to uninstall and reinstall from the new entry.  It\u0027s a small price to pay for cleaning things up though, so I\u0027m not going to dwell on that.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m still trying to figure out why KF is causing the pause to fail, but I will be looking into that as a priority.  There are a few new features and some reworked features going into the next release, but it\u0027s been so long since I\u0027ve looked at the code that I forget what has been done.  I\u0027ll have to get back to you on that.\n\u003C/p\u003E\n\u003Cp\u003E\nI will be honest now... I\u0027ve become really burnt out on KSP.  Long load times, coupled with memory issues and crashes, have driven me to insanity.  There\u0027s only so much hair one man can pull out before it stops growing back and I\u0027d like to quit pulling at it while I still have hair to grow... though if it did stop I could also save on hair cuts... so there\u0027s that.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile I dread the next major step for KSP (1.1) I am also thinking it is the only thing that will likely get me interested in KSP as more than a programming challenge to tackle in my spare time.\n\u003C/p\u003E\n\u003Cp\u003E\nThe future of the mod is something I really can\u0027t say much about right now.  I\u0027m not a model maker or texture designer, and I don\u0027t have any degrees in physics or mechanical engineering on the wheel or any other ground-based propulsion techniques.  I barely have any understanding of astrophysics or even standard physics.  Heck, I know more about theoretical physics than any other form of physics... in theory of course... so there\u0027s unlikely to be any new content for this mod in the near or even far future.  This is sad.  My goal right now, when I get my interest in redesigning this mod again, is to try to work it out as a sort of framework for the KF style of wheel modules to then be plugged in to by other mod makers.  I\u0027d like to make every separate feature into a module that can run on it\u0027s own or in conjunction with the other modules the mod provides.  This means the possibility of having a wheel that uses only the steering mechanisms but none of the others, but another wheel that might use only the suspension and not the steering while still allowing yet another wheel to use all of the features available.  This also means allowing the dust module to be applied to parts that do not use any of the other modules, but still allowing for the dust to be scaled with the suspension system if it is present.  I know now, after my recent classes in C# programming, how to make this happen, but it\u0027s a lot of freakishly boring coding sessions to make it all happen and includes using some more advanced coding techniques (for me at least) that are still a bit confusing me to (delegates, derived classes, abstract classes, etc.) so it\u0027ll take a while to get it all fleshed out, much less debugged and prepared for use.\n\u003C/p\u003E\n\u003Cp\u003E\nI did just remember a new feature I was working on before my burn-out.  If anyone here remembers the critter crawler, you\u0027ll get what I\u0027m talking about here.  Sticky feet was some amazing stuff.  At the core it was nothing more than what extreme craft builders were already doing: applying thrust to increase friction with vertical surfaces so that could climb walls and such.  The difference is that sticky-feet could compensate for the slowed movement of such craft by adjusting the angle of thrust when movement was detected along the relative-horizontal axis.  There is some KF code already owing its existence to that mod, and I\u0027ve been experimenting with the sticky-feet feature to make something I\u0027ve talked about on and off in the old thread a lot: Anti-repulsion.  Designed to work in conjunction with repulsors, this would allow the craft to regain a percentage of the lost friction with the ground due to being repulsed from the surface.  When used with wheels, this would allow the craft to be \u0022glued\u0022 to the surface in varying degrees to allow for better performance in low gravity environments, and allow for steeper climbing on normal and/or high gravity worlds.  I developed it with the plan of allowing it to be an extended feature for the standard repulsor parts, as well as a separate part with only this feature for use on craft with no other repulsion technology present.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m going to conclude this wall of text here and end with this: Work continues, slowly.  For those of you who have contributed in the past and feel you have something worth sharing, feel free to do so.  I don\u0027t want this mod to simply be another solo-administrated mod in the future.  I\u0027d like it if I could break it apart and make if more of a framework for other mods to hook into so that new content could be developed, and new features could be coded without having to modify the base mod\u0027s code, so that it could continue to live on past my interest in the game itself.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now I need to go.  Still have finals to prepare for.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222296250\u0022 data-ipsquote-contentid=\u0022121236\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221448394280\u0022 data-ipsquote-userid=\u0022134004\u0022 data-ipsquote-username=\u0022smjjames\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/24/2015, 11:44:40, smjjames said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nHe is, however, he\u0027s been busy with his own RL things, mainly college related.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is correct.  I\u0027m slightly autistic, so school was a real pain in the arse for me in the past.  In my late 20s/early 30s I\u0027ve finally gone back to college to try and get an education.  I\u0027m well on my way to doing so, but my older age is making it a bit of a slow process.  I rarely give up completely on anything, however, so KF ain\u0027t going to die any time soon.  It\u0027s just in a state of... suspension.  Alive, but not really living.\n\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-12-09T23:24:09Z","Content":"\n\u003Cp\u003E\nOooo, funky new forum. Glad you\u0027re still at it, Gaalidas, if only slowly. \n\u003C/p\u003E\n"},{"CreatedByName":"123nick","CreatedById":27488,"CreatedDateTime":"2015-12-12T16:16:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222313702\u0022 data-ipsquote-contentid=\u0022121236\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449599480\u0022 data-ipsquote-userid=\u0022111158\u0022 data-ipsquote-username=\u0022Gaalidas\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/8/2015, 1:31:20, Gaalidas said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAlright, this forum change over really stinks... (I couldn\u0027t even log in until an administrator reset my password for me.  The standard password reset was failing to do the job.) )but I won\u0027t bore you all with my complaints and whatnot.  \u0022Finals\u0022 week is upon me and that means I\u0027ll be trying to get a new release for KF out sometime in the near future.  Most likely I\u0027ll release it as a new entry on KerbalStuff (meaning it won\u0027t be an update to the old mod, but rather a re-release) so that I\u0027ll have full control over the KerbalStuff page.  This will allow me to update the mod\u0027s background image, the description, the title, and everything else to match the current state of the mod.  The down side is that anyone using automated update tools will have to uninstall and reinstall from the new entry.  It\u0027s a small price to pay for cleaning things up though, so I\u0027m not going to dwell on that.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m still trying to figure out why KF is causing the pause to fail, but I will be looking into that as a priority.  There are a few new features and some reworked features going into the next release, but it\u0027s been so long since I\u0027ve looked at the code that I forget what has been done.  I\u0027ll have to get back to you on that.\n\u003C/p\u003E\n\u003Cp\u003E\nI will be honest now... I\u0027ve become really burnt out on KSP.  Long load times, coupled with memory issues and crashes, have driven me to insanity.  There\u0027s only so much hair one man can pull out before it stops growing back and I\u0027d like to quit pulling at it while I still have hair to grow... though if it did stop I could also save on hair cuts... so there\u0027s that.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile I dread the next major step for KSP (1.1) I am also thinking it is the only thing that will likely get me interested in KSP as more than a programming challenge to tackle in my spare time.\n\u003C/p\u003E\n\u003Cp\u003E\nThe future of the mod is something I really can\u0027t say much about right now.  I\u0027m not a model maker or texture designer, and I don\u0027t have any degrees in physics or mechanical engineering on the wheel or any other ground-based propulsion techniques.  I barely have any understanding of astrophysics or even standard physics.  Heck, I know more about theoretical physics than any other form of physics... in theory of course... so there\u0027s unlikely to be any new content for this mod in the near or even far future.  This is sad.  My goal right now, when I get my interest in redesigning this mod again, is to try to work it out as a sort of framework for the KF style of wheel modules to then be plugged in to by other mod makers.  I\u0027d like to make every separate feature into a module that can run on it\u0027s own or in conjunction with the other modules the mod provides.  This means the possibility of having a wheel that uses only the steering mechanisms but none of the others, but another wheel that might use only the suspension and not the steering while still allowing yet another wheel to use all of the features available.  This also means allowing the dust module to be applied to parts that do not use any of the other modules, but still allowing for the dust to be scaled with the suspension system if it is present.  I know now, after my recent classes in C# programming, how to make this happen, but it\u0027s a lot of freakishly boring coding sessions to make it all happen and includes using some more advanced coding techniques (for me at least) that are still a bit confusing me to (delegates, derived classes, abstract classes, etc.) so it\u0027ll take a while to get it all fleshed out, much less debugged and prepared for use.\n\u003C/p\u003E\n\u003Cp\u003E\nI did just remember a new feature I was working on before my burn-out.  If anyone here remembers the critter crawler, you\u0027ll get what I\u0027m talking about here.  Sticky feet was some amazing stuff.  At the core it was nothing more than what extreme craft builders were already doing: applying thrust to increase friction with vertical surfaces so that could climb walls and such.  The difference is that sticky-feet could compensate for the slowed movement of such craft by adjusting the angle of thrust when movement was detected along the relative-horizontal axis.  There is some KF code already owing its existence to that mod, and I\u0027ve been experimenting with the sticky-feet feature to make something I\u0027ve talked about on and off in the old thread a lot: Anti-repulsion.  Designed to work in conjunction with repulsors, this would allow the craft to regain a percentage of the lost friction with the ground due to being repulsed from the surface.  When used with wheels, this would allow the craft to be \u0022glued\u0022 to the surface in varying degrees to allow for better performance in low gravity environments, and allow for steeper climbing on normal and/or high gravity worlds.  I developed it with the plan of allowing it to be an extended feature for the standard repulsor parts, as well as a separate part with only this feature for use on craft with no other repulsion technology present.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m going to conclude this wall of text here and end with this: Work continues, slowly.  For those of you who have contributed in the past and feel you have something worth sharing, feel free to do so.  I don\u0027t want this mod to simply be another solo-administrated mod in the future.  I\u0027d like it if I could break it apart and make if more of a framework for other mods to hook into so that new content could be developed, and new features could be coded without having to modify the base mod\u0027s code, so that it could continue to live on past my interest in the game itself.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd now I need to go.  Still have finals to prepare for.\n\u003C/p\u003E\n\u003Cp\u003E\nThat is correct.  I\u0027m slightly autistic, so school was a real pain in the nethers for me in the past.  In my late 20s/early 30s I\u0027ve finally gone back to college to try and get an education.  I\u0027m well on my way to doing so, but my older age is making it a bit of a slow process.  I rarely give up completely on anything, however, so KF ain\u0027t going to die any time soon.  It\u0027s just in a state of... suspension.  Alive, but not really living.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ncan one just completely delete the collisonfx plugin, if there is one, or just disable collision FX in the menu as a temporary fix?\n\u003C/p\u003E\n\u003Cp\u003E\nif you cant reply, due to IRL or being busy, can someone else?\n\u003C/p\u003E\n\u003Cp\u003E\nedit: i found a fix! deleting the KFDustFX module line seems to fix the bug, atleast it worked with the tiny wheels, so it should work with all other things.\n\u003C/p\u003E\n\u003Cp\u003E\ndouble edit: here should be a simple module manager config to fix it by automatically removing the module from all parts, here:\n\u003C/p\u003E\n\u003Cp\u003E\n @PART\u003Cbr\u003E\n[*]:HAS[@MODULE[KFDustFX]]:FINAL\u003Cbr\u003E\n{\u003Cbr\u003E\n    -MODULE[KFDustFX],* { }\u003Cbr\u003E\n}\n\u003C/p\u003E\n\u003Cp\u003E\nthis should work, just copy to a file that ends in .cfg and has no spaces in the name, and it might work.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-12T16:52:22Z\u0022 title=\u002212/12/2015 04:52  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 12, 2015\u003C/time\u003E by 123nick\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CommanderSpock","CreatedById":147594,"CreatedDateTime":"2015-12-12T17:10:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222319643\u0022 data-ipsquote-contentid=\u0022121236\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221449936983\u0022 data-ipsquote-userid=\u002227488\u0022 data-ipsquote-username=\u0022123nick\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n53 minutes ago, 123nick said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ncan one just completely delete the collisonfx plugin, if there is one, or just disable collision FX in the menu as a temporary fix?\n\u003C/p\u003E\n\u003Cp\u003E\nif you cant reply, due to IRL or being busy, can someone else?\n\u003C/p\u003E\n\u003Cp\u003E\nedit: i found a fix! deleting the KFDustFX module line seems to fix the bug, atleast it worked with the tiny wheels, so it should work with all other things.\n\u003C/p\u003E\n\u003Cp\u003E\ndouble edit: here should be a simple module manager config to fix it by automatically removing the module from all parts, here:\n\u003C/p\u003E\n\u003Cp\u003E\n @PART\u003Cbr\u003E\n[*]:HAS[@MODULE[KFDustFX]]:FINAL\u003Cbr\u003E\n{\u003Cbr\u003E\n    -MODULE[KFDustFX],* { }\u003Cbr\u003E\n}\n\u003C/p\u003E\n\u003Cp\u003E\nthis should work, just copy to a file that ends in .cfg and has no spaces in the name, and it might work.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCopy to any file?\n\u003C/p\u003E\n"}]}