{"TopicId":150428,"ForumId":36,"TopicTitle":"New O.R.C. and E.L.F. engines","CreatedByName":"CraftyDwarf","CreatedById":165987,"CreatedDateTime":"2016-10-20T13:39:30Z","PageNum":1,"Articles":[{"CreatedByName":"CraftyDwarf","CreatedById":165987,"CreatedDateTime":"2016-10-20T13:39:30Z","Content":"\n\u003Cp\u003E\nI have begun very basic work on a series of engines that combine mass driver, plasma creation, and the ultimate in recycling.\n\u003C/p\u003E\n\u003Cp\u003E\nEngines will have two grades, O.R.C. and E.L.F.\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise Really Cool Engines will heat its \u0022fuel\u0022 mass to high gaseous state, ionize and expel for force. High cost of energy to the matter\u0027s density and boiling point, a bit more for ionization andd magnetic expulsion. So far a 1.25 I call Pele and a 2.5 I call Vulcan. Only fuel at this moment is the junkiest, but would be universal otherwise in being Rock. Performance curves in atmo like LN-V. So no mining rock on kerbal to get to orbit, well not reasonably. I am not making a cheat, but basing this on real scientific principles. I said basing, accuracy will of course deviate and that can be debated, but will not be this threads sole purpose.\n\u003C/p\u003E\n\u003Cp\u003E\nStage two is in concept only ATM, everything is the same but more so, to get Electrodeless Lorentz Forces from a plasma you make from whatever. Thinking once I get how to flow and channel the thermal models in KSPI-E, I will use that as a power core.\n\u003C/p\u003E\n\u003Cp\u003E\nNext steps is an enigine module that will use a fuel data dictionary for settings about boiling points and specific heats, as well as density. Then the fuel determines the engines force, as all else will be as a level zone. This will make an interesting alternative for Depleted Fuel and similar things. It will be high density, so you would get 2-3 times the effect from rock in an ELF, but boiling points are much higher I believe, so an ORC maybe only 1.5 to 2, with higherr electric charge per second.\n\u003C/p\u003E\n\u003Cp\u003E\nThese engines will take nearly impractical amounts of power. Nearly because the nuclear option is literally on the table, and will tend to pay off, or at least get close.\n\u003C/p\u003E\n\u003Cp\u003E\nI am looking to Coordinate with \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E and KSPI-E, at least.\n\u003C/p\u003E\n\u003Cp\u003E\n~Rough Draft~\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-20T13:42:56Z\u0022 title=\u002210/20/2016 01:42  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 20, 2016\u003C/time\u003E by CraftyDwarf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-10-21T11:00:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/165987-craftydwarf/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022165987\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/165987-craftydwarf/\u0022 rel=\u0022\u0022\u003E@CraftyDwarf\u003C/a\u003E  Intresting, are you going to create new models for this yourself?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-21T11:07:12Z\u0022 title=\u002210/21/2016 11:07  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 21, 2016\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CraftyDwarf","CreatedById":165987,"CreatedDateTime":"2016-10-22T01:55:30Z","Content":"\n\u003Cp\u003E\nI may at somee point, but I am mostly into the functionals now. Also getting a feel of the desireability of what I am making.\n\u003C/p\u003E\n"}]}