{"TopicId":16034,"ForumId":36,"TopicTitle":"Starting a new project and need advice","CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-04T17:48:30Z","PageNum":1,"Articles":[{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-04T17:48:30Z","Content":"\n\u003Cp\u003EI know it\u0027s over-ambitious considering i\u0027ve never made any models or had much graphics program use but i want to make a scaled down and simplified version of both daedlus from the Stargate-SG1/Atlantis series and the same for Destiny from Stargate universe.\u003C/p\u003E\u003Cp\u003EWould someone possibly tell me what programs i need (that are user friendly) and which are free, as this is a hobby and i don\u0027t have money to throw away. I\u0027ll try going into it and learn as i go and if i have any future questions ill post here but i really need to know what program to get me started, which also makes scaling the model specifically for this game, easier. Thank you in advance to all who can help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-04T21:10:18Z","Content":"\n\u003Cp\u003EI\u0027m with you, I\u0027m currently working on my first mod pack, which is my first time modelling, ever.\u003C/p\u003E\u003Cp\u003EI use blender, there is a great tutorial on here somewhere that describes in detail what you need to do to make a model work in ksp.\u003C/p\u003E\u003Cp\u003EFor texturing we use GIMP, both are free.\u003C/p\u003E\u003Cp\u003EYou\u0027ll need to read some tutorials on blender, though. Especially knowing the keyboard shortcuts can save tons of time.\u003C/p\u003E\u003Cp\u003EEDIT: Also, my project is very ambitious too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-04T22:33:03Z","Content":"\n\u003Cp\u003EThank you, ive been trying with 3ds max 9 which is just a nightmare and i can only get but the most simple shapes and can transform them, ive also tried using google sketch up, exporting it to .dae then using unity with the ksp tools but thats a nightmare so maybe blender may be inbetween \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It would be nice to see a start to finish tutorial on creating ksp parts going from start to finish. All ive really seen on the wiki is a tutorial about how to create a part with file structure and animation through unity. Ill let you know how i get on with blender tomorrow\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-04T22:45:32Z","Content":"\n\u003Cp\u003EYes, I haven\u0027t got the parttools figured out yet either, but one step at a time, right? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-05T14:37:24Z","Content":"\n\u003Cp\u003EYes one step at a time, starting in the deep end haha I had a look at the project you are working on, it looks pretty good so far \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Maybe i can learn a lot from you haha My plan at the minute is to do a provisional design of all the parts, then once done i want to try and pull other people in to help with the stuff i cant do myself. Namely i want a gui to control weapon systems among other things, i need someone to do hotkeys to switch engines, i want to incorporate the fixed camera mod into each turret so they can be controlled manually and i need someone to help me design a way to get the thing into orbit as this ship will only be intended from the start for space flight only... No landing lol Also as a secondary project i want to add 2 of destiny\u0027s shuttles to the ship(Which will be able to land). I already have a perfect way of docking in my head but i need someone to help me design and animate those, aswell i need someone to help me take something similar to the laser mod, and create one that fires bursts of \u0027laser\u0027 instead of a continuous beam, and a very conceptual idea, is to be able to re-fuel by being under a certain AP \u002B PE orbiting the sun, though that may mean that rather than using the games fuel, i may have to get someone to create a fuel system similar to the solar panels \u002B battery \u002B ion engine system only on a bigger scale, so lots and lots but first if i get the provisional design done then other people are more likely to join the project. \u003C/p\u003E\u003Cp\u003EOkay one thing i am having a lot of annoyance and fighting with is scaling. Blender doesn\u0027t seem to do much in the way of telling me what dimensions an object, namely a cube is, nor can i find an easy menu that will allow me to create a shape using set dimesions. For instance i decided to start on the turret pieces first as they are relatively simple. I want to start with a cube x:2m y:2m z:1m. Then bevel the top 0.25cm into the cube by 0.25cm then i have a nice base for the turret to be added ontop. I can do everything apart from starting the cube at that size. Thanks in advance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-05T14:44:37Z\u0022 title=\u002208/05/2012 02:44  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 5, 2012\u003C/time\u003E by crimsonknight3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-05T15:07:40Z","Content":"\n\u003Cp\u003EWell in blender, to see dimensions , press N in the 3D view when in object mode. It will open a menu on the side of the 3D view. In that menu, under Transform are the basic properties like location, rotation, scale and dimensions. Changing the dimensions also changes the scale, which can prevent you from UV unwrapping your mesh.\u003C/p\u003E\u003Cp\u003EYou can scale by a certain amount by pressing S (enter scale mode), the axis along which you want to scale, how much you want to scale it. (if you want to scale along every axis but one, use shift \u002B x, y or z) \u003C/p\u003E\u003Cp\u003ESo in your case, you\u0027d type in the 3D view (just type it) S Z 0.5.\u003C/p\u003E\u003Cp\u003EIf you then go back to object mode and check the scale and dimensions, you\u0027d see that the dimensions are now x:2 y:2 z:1 while the scale is still 1 on all dimensions.\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-05T15:59:46Z","Content":"\n\u003Cp\u003EAwesome thank you! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027ve downloaded a 3d model of destiny in google sketchup which would be a good point of reference only the ship is about 1500 metres long with tons of separate components so moving the view around it on my laptop is nigh impossible lol\u003C/p\u003E\u003Cp\u003EI\u0027ve gone through all the tutorials but some of them seem to work differently, like the guy selecting multiple edges or verts, on mine sometimes if i try and select a few by holding shift and right clicking each time, the last one i selected gets deselected if i use middle mouse button to look around or even click anything to transform etc. \u003C/p\u003E\u003Cp\u003EAlso is it possible to take a model that has been compiled for ksp, to uncompile it back into blender? That way i can study how the turret movement is done with the laser mod and use that to create the movement needed for my turret?\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-05T16:08:48Z","Content":"\n\u003Cp\u003EYou can import .dae\u0027s into blender. But I think the laser mod handled its rotation in a plugin.\u003C/p\u003E\u003Cp\u003EAlso with blender tutorials, check for which version it is. After 2.6 apparently a lot was modified. Some stuff from pre 2.6x versions may still apply, but are found somewhere else in the GUI. A lot of blender tutorial material is still pre 2.6.\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-05T16:19:05Z","Content":"\n\u003Cp\u003EAhh that will maybe be why then. If its handled with a plugin then ill have to get someone onboard to help with that... Maybe ill design the turret itself now and build a turret mount into each \u0027wing\u0027 of the ship. So far ive broken the destiny up (in my mind) into Nose, main body 1 \u0026amp; 2, left wing, right wing, command centre (with Advanced sas incorporated somewhere), (engines will just be 2 large pieces with the same blue effect of destiny\u0027s when running despite the fact the ship technically has 36 engines), left engine, right engine, Rcs node, turret, main weapon and a dock or something for support whilst it spawns on the runway, ive been trying to think of a way to get it into orbit and all i can think of is 3 high power engines that will detach when orbit is achieved either that or somehow making something small enough with enough thrust to get it into orbit, that can then be toggled off and main engines toggled on (like the nostromo mod which i LOVE and which made me want to start this project)... Still thinking, i really should find some stargate fans on this forum haha\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-05T22:36:02Z","Content":"\n\u003Cp\u003EHey, just wanted to know what you think. I\u0027ve tried downscaling it a little whilst keeping similar proportions, i knew something had to give so i lowered the distance between barrels, what do you think for my first attempt making a model? \u003C/p\u003E\u003Cp\u003EMy model:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i211.photobucket.com/albums/bb77/Ricky16_2007/turretpic1.png\u0022 alt=\u0022turretpic1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe reference model i used in google sketchup:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i211.photobucket.com/albums/bb77/Ricky16_2007/GoogleRearTurretRef.jpg\u0022 alt=\u0022GoogleRearTurretRef.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-05T23:39:57Z","Content":"\n\u003Cp\u003EIve done some further work and have a question. In object and edit mode the top barrel seems fine but when i render it goes a bit.... Wrong lol It goes a bit wrong with both smooth and flat surfaces however its more noticable with smooth surfaces which is the picture i used. What do you think?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i211.photobucket.com/albums/bb77/Ricky16_2007/terrtpic2barrel.png\u0022 alt=\u0022terrtpic2barrel.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lord Wasteland","CreatedById":14093,"CreatedDateTime":"2012-08-05T23:45:31Z","Content":"\n\u003Cp\u003EEh... can you make weapons for KSP, such as turrets?\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-06T10:55:51Z","Content":"\n\u003Cp\u003EWith blender, use the edge split modifier.\u003C/p\u003E\u003Cp\u003EIn the right screen, with the object selected, under the list of objects is a row of icons. Click the wrench \u0026gt; Add modifier \u0026gt; Edge split (under generate). Mess with the parameters if you like, then click apply.\u003C/p\u003E\u003Cp\u003EThis fixed similar issues for me.\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-06T11:56:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lord Wasteland\u0022 data-cite=\u0022Lord Wasteland\u0022\u003E\u003Cdiv\u003EEh... can you make weapons for KSP, such as turrets?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes and no lol Someone has a mod that uses a laser (which i assume exudes HEAT to destroy stuff) whereas with my turret im looking to do the same except with bursts of heat instead of a constant beam and yes there is defo movable turrets lol \u003C/p\u003E\u003Cp\u003EHere\u0027s a link to that mod:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/6014-PLUGIN-PART-0-14-SUNBEAM-Laser-2-1?highlight=sunbeam\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/6014-PLUGIN-PART-0-14-SUNBEAM-Laser-2-1?highlight=sunbeam\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd thank you MrPwner, ill give that a go now before i head out for my bday dinner/my gf\u0027s nans bday dinner/my gf\u0027s sisters bday dinner/my gf\u0027s bday dinner........... lmao all our bdays are within 2 weeks\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-06T12:22:26Z","Content":"\n\u003Cp\u003EOkay, i tried edge split modifier and it made no noticable difference in object mode and when i render the same distortion on the top cannon is present. Will keep playing around. I think it may be because i extruded up the cannon the ridge then extruded it back down again and didnt notice any difference.\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-06T12:40:25Z","Content":"\n\u003Cp\u003EBe careful with extrusions, cancelling the movement of an extrusion doesn\u0027t remove the extra vertices created for the extrusion. You can remove double vertices by clicking the remove doubles button in edit mode in the left side menu.\u003C/p\u003E\u003Cp\u003EI don\u0027t know what else you could do, as I\u0027m still very much a blender noob \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-07T01:02:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MrPwner\u0022 data-cite=\u0022MrPwner\u0022\u003E\u003Cdiv\u003EBe careful with extrusions, cancelling the movement of an extrusion doesn\u0027t remove the extra vertices created for the extrusion. You can remove double vertices by clicking the remove doubles button in edit mode in the left side menu.\u003Cp\u003EI don\u0027t know what else you could do, as I\u0027m still very much a blender noob \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay ill keep that in mind. I didn\u0027t get anything done today really, i was too busy trying to beat the kerbal olympics speed record under 5km. I came close but gave up when i couldnt get a decent balance between speed and control. Will let you know how it goes tomorrow. If i can get more people on board to help with the mod i may start an official channel for the destiny add-on \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is what i am going to recreate \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.wikia.com/sgtng/images/archive/3/31/20110323074319%21Destiny.jpg\u0022 alt=\u002220110323074319%21Destiny.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.wikia.com/sgtng/images/3/31/Destiny.jpg\u0022 alt=\u0022Destiny.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-07T01:07:18Z","Content":"\n\u003Cp\u003EOh just as i side note, i just popped into blender and removed duplicates and that fixed the graphical errors i\u0027ve been having, thanks a bunch for that piece of advice!! I know blender is great but it\u0027s trying to learn what half the options does thats the problem haha G\u0027night!\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-07T09:02:10Z","Content":"\n\u003Cp\u003ENice! Glad to help. If you need more advice or something, just ask.\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-07T16:00:15Z","Content":"\n\u003Cp\u003EI actually could use a little advice. I\u0027m really having issues (in my mind) trying to figure out what scale to work with here, you can see the ship, what scale would fit for a runway launch? Really the main issue is nose to back and wing to wing, i really dont want to have to scale down the rear turret and main weapon too much otherwise it will start looking a bit weird, i dont want it to look all turret but at the same time i dont want the turrets to end up tiny and insignificant either. Like to nostromo i dont expect that in-game it will be able to fit \u0027entirely\u0027 when being assembled but im sure it will be mostly visible so what limits am i looking at \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-07T17:06:49Z","Content":"\n\u003Cp\u003EI\u0027m not a stargate fan, so I don\u0027t know how big it really is.\u003C/p\u003E\u003Cp\u003EBut IIRC the limit for length, width and height of a part is 2km \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think the runway is about 30m wide, and the SPH is pretty far from the runway. Also, you can just make smaller collision models so that even when it visible collides with something, it won\u0027t detect it physically.\u003C/p\u003E\u003Cp\u003EAnd you don\u0027t really have to worry about the scale when modelling, you can adjust the scale of everything by playing with the scale or rescaleFactor parameters in the part.cfg file (IIRC only rescaleFactor scales the node positions with it).\u003C/p\u003E\u003Cp\u003EYou could also release several scaled versions so people can choose what scale they think would suit them best. Just a suggestion.\u003C/p\u003E\n"},{"CreatedByName":"Kreuzung","CreatedById":21035,"CreatedDateTime":"2012-08-07T17:30:08Z","Content":"\n\u003Cp\u003EWell, parts can probably have any size, but remember that they\u0027ll only be loaded if you come in a 2.5km range of them, so you might want them to have a size that prevents strange errors with that border (like you come in, part is loaded, is so large that you\u0027re in it\u0027s collider, insta-BOOM).\u003C/p\u003E\u003Cp\u003EAlso remember that the assembly buildings have a limited size.\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-08T00:52:46Z","Content":"\n\u003Cp\u003EIts the assembly building bit that might be the problem but it\u0027s entirely possible to put together the ship using text rather than ingame right? Editing a .craft file manually? but im too far away from that to even comprehend yet. I\u0027ve had an idea that i wanted to pass by you guys. As getting the ship into orbit will be a nightmare as the ship was never intended for atmospheric flight i had an idea i hope is plausible. Model a very large \u0027space dock\u0027 then squish it up real small (dock will be almost entirely thin pylons as it were) Then animate it stretching back out to full size. Plop the shrunk part on a rocket and up into orbit then hit a key and it extends out into a full dock, then incoporating (if i get permission of course) with the orbitbal construction mod, which has a part with the ability to \u0027jump\u0027 straight into orbit near the station, which in my case is the activated space dock, spawn destiny on the runway, activate the jump drive in destiny\u0027s gui (will try and make it a single use part to save people using it to get out of tricky situations) and poof, it spawns inside the space dock (with obviously a fair amount of extra space to prevent collisions. Plausible??\u003C/p\u003E\n"},{"CreatedByName":"MrPwner","CreatedById":23671,"CreatedDateTime":"2012-08-08T01:10:43Z","Content":"\n\u003Cp\u003ESounds complicated, but possible.\u003C/p\u003E\u003Cp\u003EBut if I were you I\u0027d focus on the modelling and texturing for now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"crimsonknight3","CreatedById":33086,"CreatedDateTime":"2012-08-09T10:48:35Z","Content":"\n\u003Cp\u003EThats exactly my plan, though with real life things going on im not getting much chance to do any modelling at the moment, probably wont be able to get any more done until thursday coming \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 alt=\u0022-_-\u0022\u003E\u003C/p\u003E\n"}]}