{"TopicId":161531,"ForumId":36,"TopicTitle":"KSP Interstellar Extended Continued Development Thread","CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2015-02-20T10:23:31Z","PageNum":209,"Articles":[{"CreatedByName":"TheTaleteller","CreatedById":163164,"CreatedDateTime":"2016-05-13T21:36:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222580153\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463174696\u0022 data-ipsquote-userid=\u0022117389\u0022 data-ipsquote-username=\u0022FreeThinker\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, FreeThinker said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nActually, we can actual use this as property. I already use dynamic mass my in the generator. The Black hole reactor would generate a large amount of mass 1000 of ton while active, this means it will not be very effective to using in combination with any Newtonian propulsion, but it still can be used for to power the warp drive.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmm ... in terms of thermodynamics, this would require to feed the reactor with the equivalent of that mass in the first place, as well as getting rid of it without destroying the ship after warp, since warp does not change your newtonian vector and you may like to enter a valid orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2016-05-13T21:51:26Z","Content":"\n\u003Cp\u003E\nBut, if you create a virtual singularity, you can make it collapse when not needed. Of course this means you loose all the energy from the reactor and you\u0027ll need a lot of energy to recreat it.\n\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-13T21:52:41Z","Content":"\n\u003Cp\u003E\nThe idea is that you initially need a large amount of power to create the mini black hole which would create a local gravity fields  of 1000 ton. To prevent it from evaporating, you need to continuously feed it with an atoms..Depending on the atomic mass of the fed resource, a larger or smaller percentage of the inserted atoms is speed up to near light-speed, collide and escape the black hole horizon as charged particles of a higher mass. The particles that fail the speed up along the even horizon, fall into the black hole. The charged particles release the energy in the direct energy converter, are collected, cleaned of useless atoms and the remaining atoms are stored for future usage (is sufficient storage is available).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso note, it would probably not be a bright idea to initiate the black hole generator while landed on any planet or moon as the sudden increase in mass would crush the ship into the round. At least, that the theory\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-13T22:06:38Z\u0022 title=\u002205/13/2016 10:06  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 13, 2016\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UltimFlare0","CreatedById":120117,"CreatedDateTime":"2016-05-13T22:04:33Z","Content":"\n\u003Cp\u003E\nAnyone else getting a NaN heat production with the pebble bed reactor? Messing around with one in sandbox, and it shows NaN KW for total heat production in the thermal helper in the VAB/SPH.\n\u003C/p\u003E\n\u003Cp\u003E\nsceenshot for reference:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00221WJOjsT.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/1WJOjsT.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nAdmittedly this is on a heavily modded install (90something mods)\n\u003C/p\u003E\n\u003Cp\u003E\nsame thing on a stock install (only mods installed are what came with the KSPI-E download from the first page):\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZhAXrjl.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/ZhAXrjl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nImages in spoilers for size reasons\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-13T22:10:38Z\u0022 title=\u002205/13/2016 10:10  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 13, 2016\u003C/time\u003E by UltimFlare0\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheTaleteller","CreatedById":163164,"CreatedDateTime":"2016-05-13T22:28:36Z","Content":"\n\u003Cp\u003E\nThats still not sound. Due to laws of thermodynamic we cannot create mass out of nowhere, and an artificial gravity field, no matter of its density is not equal to an black hole of the same mass.\n\u003C/p\u003E\n\u003Cp\u003E\nI can imagine the generation of an black hole by feeding an artificial gravity well with plain matter, harvesting the resulting hawking radiation as charged particles. But i see no way feeding such an converter on energy since it would exceed the output of any energy source by far. The Antimatter reactor is converting milligrams, imagine a thousand tons. Thats nothing you can switch off, it will evaporate exponentially or in more plain words ... explode violently.\n\u003C/p\u003E\n\u003Cp\u003E\nBesides nothing escapes the schwarzschild radius. Hawking radiation is based on virtual particle pairs, where one partner escapes while the anti-counterpart falls into the black hole, reducing its mass.\n\u003C/p\u003E\n"},{"CreatedByName":"SciMan","CreatedById":12748,"CreatedDateTime":"2016-05-13T23:10:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222580283\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463178516\u0022 data-ipsquote-userid=\u0022163164\u0022 data-ipsquote-username=\u0022TheTaleteller\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, TheTaleteller said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThats still not sound. Due to laws of thermodynamic we cannot create mass out of nowhere, and an artificial gravity field, no matter of its density is not equal to an black hole of the same mass.\n\u003C/p\u003E\n\u003Cp\u003E\nI can imagine the generation of an black hole by feeding an artificial gravity well with plain matter, harvesting the resulting hawking radiation as charged particles. But i see no way feeding such an converter on energy since it would exceed the output of any energy source by far. The Antimatter reactor is converting milligrams, imagine a thousand tons. Thats nothing you can switch off, it will evaporate exponentially or in more plain words ... explode violently.\n\u003C/p\u003E\n\u003Cp\u003E\nBesides nothing escapes the schwarzschild radius. Hawking radiation is based on virtual particle pairs, where one partner escapes while the anti-counterpart falls into the black hole, reducing its mass.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe laws of thermodynamics don\u0027t prevent creating mass out of nothing. Remember, e=mc\u003Csup\u003E2\u003C/sup\u003E means mass and energy are interchangeable. You can\u0027t create energy from nothing, but exchanging existing mass for energy or energy for mass makes no difference as far as the laws of thermodynamics are concerned.\n\u003C/p\u003E\n\u003Cp\u003E\nBesides, I\u0027m not talking about violating conservation of mass/energy. By wanting a higher power output, I fully expected it would be converting a higher amount of mass into energy per second.\n\u003C/p\u003E\n\u003Cp\u003E\nA black hole reactor must be able to manipulate gravity in order to start. By manipulating gravity in a different way, it is possible to slow or stop the escape of hawking radiation from the black hole, therefore reducing the power output and the required matter input. The idea is to set up an artificial event horizon outside the naturally occurring event horizon, which redirects the particles that escape back towards the event horizon, therefore maintaining the mass of the black hole. This is, in effect, exactly how you \u0022switch off\u0022 a black hole\u0027s power output.\n\u003C/p\u003E\n\u003Cp\u003E\nBy manipulating the gravity around the black hole in a third way, you can actually cancel out its inertia. The idea here is to set up a second artificial event horizon outside the first one, but the gravity vector is in opposition to the first, and its magnitude is such that it will cancel out the gravity field of the black hole as well as the first artificial event horizon.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd if that\u0027s impossible, it also nullifies the ability to make a warp drive. But we already have the warp drive, so we\u0027ve proved these other things are possible as well.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTrust me, the existence of a warp drive that can travel FTL is bad enough for the laws of physics. It breaks causality, enables time travel, and creates the ability to make a perpetual motion machine.\n\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2016-05-13T23:18:24Z","Content":"\n\u003Cp\u003E\nYou can (teorically) create a black hole with a particle accelerator, compressing some atoms with great great energy. The tiny black hole you create isn\u0027t still strong enough to maintain itself but enough to produce power. When it\u0027s not needed, just stop to maintain it and it will evaporate in a moment. More little the black hole, more energy is needed to create and maintain it. It would be easier near a planet, so you can manipulate the planet\u0027s gravity and lower the energy needed. This is just pure theory, but it can be interesting. Also, if the black hole become too big, it will begin to maintain by itself and at that point you cannot switch it off anymore.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: on a side note, if you create two black holes of the same size and properties in two different parts of the universe, and you connect them by induction, they\u0027ll create a space/time tunnel, so you can theoretically fly from the first to the second in no time, better than the warp drive :-)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-13T23:23:00Z\u0022 title=\u002205/13/2016 11:23  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 13, 2016\u003C/time\u003E by Nansuchao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheTaleteller","CreatedById":163164,"CreatedDateTime":"2016-05-14T08:45:09Z","Content":"\n\u003Cp\u003E\nIf you got enough energy to create a stable black hole in the first place, there is no point of creating it, because there is nothing to gain for you. It cant give you more than you put into, its more like a battery than a reactor when feed with energy. The better usecase would be feeding the hole with plain matter, like rocks or gas. That way e=mc² comes into place. Such a system would still be highly unstable and hard to control.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, when your able to build a FTL, you are most likely in possession of the grand unifying theory. This gives you control not only over gravity but all four main forces. To gain high amounts of charged particles all you need to do is influencing the nuclear bounding. Your pretty much beyond the requirement of a black hole, you are probably even beyond the requirement of antimatter for more than giving starter power.\n\u003C/p\u003E\n\u003Cp\u003E\nAs you mention influencing gravity. KSPI-E has FLT, but why dont we have repulsor engines? It should be a breeze to cancel out a planets gravity for take off and landing when your able to fold space. Technically you would gain that ability long before your first FTL space folding test.\n\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-14T16:32:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222580974\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463215509\u0022 data-ipsquote-userid=\u0022163164\u0022 data-ipsquote-username=\u0022TheTaleteller\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, TheTaleteller said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you got enough energy to create a stable black hole in the first place, there is no point of creating it, because there is nothing to gain for you. It cant give you more than you put into, its more like a battery than a reactor when feed with energy. The better usecase would be feeding the hole with plain matter, like rocks or gas. That way e=mc² comes into place. Such a system would still be highly unstable and hard to control.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, when your able to build a FTL, you are most likely in possession of the grand unifying theory. This gives you control not only over gravity but all four main forces. To gain high amounts of charged particles all you need to do is influencing the nuclear bounding. Your pretty much beyond the requirement of a black hole, you are probably even beyond the requirement of antimatter for more than giving starter power.\n\u003C/p\u003E\n\u003Cp\u003E\nAs you mention influencing gravity. KSPI-E has FLT, but why dont we have repulsor engines? It should be a breeze to cancel out a planets gravity for take off and landing when your able to fold space. Technically you would gain that ability long before your first FTL space folding test.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo our first step would be to have the reactor create a micro black hole by converting a huge amount of energy into mass. Then keep it alive feeding light atoms which at the same time act as a particle accelerator. By oscillating gravity we allow charged particles to escape which we then use to convert directly into electric power.\n\u003C/p\u003E\n\u003Cp\u003E\nNow the big question is, what would be a conceivable minimum amount of power we need to create a micro black hole we can keep alive? Would 1 Peta Watt be enough?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-14T17:02:09Z\u0022 title=\u002205/14/2016 05:02  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 14, 2016\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-14T16:57:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222580358\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463181504\u0022 data-ipsquote-userid=\u0022135151\u0022 data-ipsquote-username=\u0022Nansuchao\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Nansuchao said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can (theorically) create a black hole with a particle accelerator, compressing some atoms with great great energy. The tiny black hole you create isn\u0027t still strong enough to maintain itself but enough to produce power. When it\u0027s not needed, just stop to maintain it and it will evaporate in a moment. More little the black hole, more energy is needed to create and maintain it. It would be easier near a planet, so you can manipulate the planet\u0027s gravity and lower the energy needed. This is just pure theory, but it can be interesting. Also, if the black hole become too big, it will begin to maintain by itself and at that point you cannot switch it off anymore.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nInteresting, but why would a nearby gravity well help in generating a black hole? seems to me the opposite it more likely as any nearby gravity will interfere and make it harder to focus are power on a single point in space. From a game-play perspective, this would also be balanced. But perhaps all we need is a zero gravity environment, which would mean any orbit in space will be enough. that will at least make it nessiary to activate the reactor only in space, and not while at the surface.\n\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-14T17:34:17Z","Content":"\n\u003Cp\u003E\nAnother question will be what part to use. As I see it, there are 3 options:\n\u003C/p\u003E\n\u003Cp\u003E\nA: an upgraded version of Laser Plasma Particle Accelerator (formally know as orbital super collider) will allow the production of miniature black hole by accelerating uranium atoms to light speed which is diverted to the center kept alive in the center. Before warp travel it can also be used to create atoms at a high energy cost.\n\u003C/p\u003E\n\u003Cp\u003E\nB use a compact spherical reactor only, which is capable of creating the black hole.\n\u003C/p\u003E\n\u003Cp\u003E\nC use a combination of Super Plasma Particle Accelerator  and compact spherical black hole reactor. The black hole reactor will require Laser Plasma Particle Accelerator  to create the miniature black hole which is then kept alive inside the a compact spherical reactor\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-14T17:40:32Z\u0022 title=\u002205/14/2016 05:40  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 14, 2016\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheTaleteller","CreatedById":163164,"CreatedDateTime":"2016-05-14T18:20:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222581498\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463245046\u0022 data-ipsquote-userid=\u0022117389\u0022 data-ipsquote-username=\u0022FreeThinker\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, FreeThinker said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nInteresting, but why would a nearby gravity well help in generating a black hole? seems to me the opposite it more likely as any nearby gravity will interfere and make it harder to focus are power on a single point in space. From a game-play perspective, this would also be balanced. But perhaps all we need is a zero gravity environment, which would mean any orbit in space will be enough. that will at least make it nessiary to activate the reactor only in space, and not while at the surface.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell OK lets ignore the big issues, its hard SciFi anyway. Actually i think the energy demand to produce a singularity like gravity field is way lesser, of what a warp field would require. besides Kerbal Alcubierre is extremely efficient compared to real world.\n\u003C/p\u003E\n\u003Cp\u003E\nI think there is another way we have not thinked of and its closer to the Dt-Reactor, and probably more controlable. Lets take the fast evaporating black hole to our advantage. Lets create very very small black holes at a high rate, induce matter for energy conversion, and let them also evaporate at high rate. The energy output wont be that insane, we might be able to direct the particle stream, and there is no insane inert mass we have to carry around. Antimatter is required for starting the process.\n\u003C/p\u003E\n\u003Cp\u003E\nThis would be an \u0022Antimatter Induced Nano Blackhole Reactor\u0022, and its output is supposed to be 95% charged particles. Fuel can be anything, density would regulate the maximum output. Its weight at least about a heavy warp drive. How about that?\n\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2016-05-14T18:22:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222581498\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463245046\u0022 data-ipsquote-userid=\u0022117389\u0022 data-ipsquote-username=\u0022FreeThinker\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, FreeThinker said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nInteresting, but why would a nearby gravity well help in generating a black hole? seems to me the opposite it more likely as any nearby gravity will interfere and make it harder to focus are power on a single point in space. From a game-play perspective, this would also be balanced. But perhaps all we need is a zero gravity environment, which would mean any orbit in space will be enough. that will at least make it nessiary to activate the reactor only in space, and not while at the surface.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou don\u0027t start a singularity simply accelerating particles, but using \u0022artificial gravity\u0022 to very strongly push some atoms on each other. If you can manipulate existing gravity instead of creating it out of nowhere, it would be much easier and less expensive, from a energy point of view.\n\u003C/p\u003E\n\u003Cp\u003E\nTo create a singularity on the ground, is probably the simplest way to destroy that planet, I don\u0027t suggest it, seen that planets cannot be destroyed in KSP, but it would happen really fast and slowly it will destroy all the Kerbol/Solar system.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom a gameplay point of view, probably 1TW would be the minimum, in a low orbit near Jool, for example. Just a suggestion.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222581652\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463250008\u0022 data-ipsquote-userid=\u0022163164\u0022 data-ipsquote-username=\u0022TheTaleteller\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, TheTaleteller said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell OK lets ignore the big issues, its hard SciFi anyway. Actually i think the energy demand to produce a singularity like gravity field is way lesser, of what a warp field would require. besides Kerbal Alcubierre is extremely efficient compared to real world.\n\u003C/p\u003E\n\u003Cp\u003E\nI think there is another way we have not thinked of and its closer to the Dt-Reactor, and probably more controlable. Lets take the fast evaporating black hole to our advantage. Lets create very very small black holes at a high rate, induce matter for energy conversion, and let them also evaporate at high rate. The energy output wont be that insane, we might be able to direct the particle stream, and there is no insane inert mass we have to carry around. Antimatter is required for starting the process.\n\u003C/p\u003E\n\u003Cp\u003E\nThis would be an \u0022Antimatter Induced Nano Blackhole Reactor\u0022, and its output is supposed to be 95% charged particles. Fuel can be anything, density would regulate the maximum output. Its weight at least about a heavy warp drive. How about that?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nReally interesting idea.\n\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-14T19:36:08Z","Content":"\n\u003Cp\u003E\nAright I tried to calculate the minimum amount of power required to generate a black hole by using E = m * sqr(c) then\n\u003C/p\u003E\n\u003Cp\u003E\naccording to \u003Ca href=\u0022https://en.wikipedia.org/wiki/Micro_black_hole\u0022 rel=\u0022external nofollow\u0022\u003Ewikipedia\u003C/a\u003E the minimum mass for a black hole is 0.22 miligram  * lightspeed squared =  20 GW\n\u003C/p\u003E\n"},{"CreatedByName":"TheTaleteller","CreatedById":163164,"CreatedDateTime":"2016-05-14T19:59:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222581780\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463254568\u0022 data-ipsquote-userid=\u0022117389\u0022 data-ipsquote-username=\u0022FreeThinker\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, FreeThinker said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAright I tried to calculate the minimum amount of power required to generate a black hole by using E = m * sqr(c) then\n\u003C/p\u003E\n\u003Cp\u003E\naccording to \u003Ca href=\u0022https://en.wikipedia.org/wiki/Micro_black_hole\u0022 rel=\u0022external nofollow\u0022\u003Ewikipedia\u003C/a\u003E the minimum mass for a black hole is 0.22 miligram  * lightspeed squared =  20 GW\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nErm, its micrograms not milligrams - planck mass. But since we need to produce an artificial event horizon using gravity, instead of the actual black hole it wont matter anyway.\n\u003C/p\u003E\n\u003Cp\u003E\n20GW sounds reasonable, we could also assume igniting the reactor requires like 1g of antimatter directly. Optionally the reactor could produce tiny amounts of antimatter while running, since hawking radiation might contain both kinds of particles.\n\u003C/p\u003E\n"},{"CreatedByName":"gary85","CreatedById":131308,"CreatedDateTime":"2016-05-14T20:31:35Z","Content":"\n\u003Cp\u003E\ni fixed air intakes finnaly by placing it off center and moving with move tool. Now im experimenting with plasma thrusters intead of vista for my ssto - they work rly bad on hydrogen and way better off liquid fuel is that intended?\n\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-14T20:45:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222581848\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463257895\u0022 data-ipsquote-userid=\u0022131308\u0022 data-ipsquote-username=\u0022gary85\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, gary85 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni fixed air intakes finnaly by placing it off center and moving with move tool. Now im experimenting with plasma thrusters intead of vista for my ssto - they work rly bad on hydrogen and way better off liquid fuel is that intended?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOf cource the thrust is much better but it\u0027s delta V is worse\n\u003C/p\u003E\n"},{"CreatedByName":"gary85","CreatedById":131308,"CreatedDateTime":"2016-05-14T20:47:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222581877\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463258701\u0022 data-ipsquote-userid=\u0022117389\u0022 data-ipsquote-username=\u0022FreeThinker\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, FreeThinker said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOf cource the thrust is much better but it\u0027s delta V is worse\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nso if it depend on mass xenon should be the best propelant because it in the middle - im getting this right?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-14T20:47:56Z\u0022 title=\u002205/14/2016 08:47  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 14, 2016\u003C/time\u003E by gary85\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-14T20:53:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222581883\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463258852\u0022 data-ipsquote-userid=\u0022131308\u0022 data-ipsquote-username=\u0022gary85\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, gary85 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nso if it depend on mass xenon should be the best propelant czu it in the middle - im getting this right?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes Xenon has 2 advantages, it is dense and ionisation effiency is higher, making the resulting thrust higher. There are ofcource also 2 downside to xenongas, which is cost and wetmass/drymass mass fraction is lower\n\u003C/p\u003E\n"},{"CreatedByName":"gary85","CreatedById":131308,"CreatedDateTime":"2016-05-14T20:57:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222581892\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463259188\u0022 data-ipsquote-userid=\u0022117389\u0022 data-ipsquote-username=\u0022FreeThinker\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, FreeThinker said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes Xenon has 2 advantages, it is dense and ionisation effiency is higher, making the resulting thrust higher. There are ofcource also 2 downside to xenongas, which is cost and wetmass/drymass mass fraction is lower\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nsth not right , 1 tank of xenon weight 200 tons.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nedit\n\u003C/p\u003E\n\u003Cp\u003E\naaa ok i got it what you meant by mass ratio ok then.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-14T20:59:09Z\u0022 title=\u002205/14/2016 08:59  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 14, 2016\u003C/time\u003E by gary85\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-14T21:33:58Z","Content":"\n\u003Cp\u003E\nYes the store mass is a big hidden disadvantage many players overlook. Isp isn\u0027t everything. \n\u003C/p\u003E\n"},{"CreatedByName":"captinjoehenry","CreatedById":163669,"CreatedDateTime":"2016-05-15T00:13:57Z","Content":"\n\u003Cp\u003E\nIs there anyway to make an efficient solar power to mega watts converter?  I was wondering as it would be really cool to be able to put a beamed power system into a close orbit of the sun and then beam that power everywhere else but all solar panels produce electric charge which is not easily convertible to mega watts even though they both more or less measure the same thing.\n\u003C/p\u003E\n"},{"CreatedByName":"Nansuchao","CreatedById":135151,"CreatedDateTime":"2016-05-15T00:59:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222582269\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463271237\u0022 data-ipsquote-userid=\u0022163669\u0022 data-ipsquote-username=\u0022captinjoehenry\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n43 minutes ago, captinjoehenry said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there anyway to make an efficient solar power to mega watts converter?  I was wondering as it would be really cool to be able to put a beamed power system into a close orbit of the sun and then beam that power everywhere else but all solar panels produce electric charge which is not easily convertible to mega watts even though they both more or less measure the same thing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt works, you can beam MW with solar panels, or at least you could, I don\u0027t know if something is changed. \n\u003C/p\u003E\n\u003Cp\u003E\nYou just couldn\u0027t use that power on that ship, but beaming it was ok.\n\u003C/p\u003E\n"},{"CreatedByName":"FreeThinker","CreatedById":117389,"CreatedDateTime":"2016-05-15T08:05:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222582269\u0022 data-ipsquote-contentid=\u0022100190\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221463271237\u0022 data-ipsquote-userid=\u0022163669\u0022 data-ipsquote-username=\u0022captinjoehenry\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, captinjoehenry said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there anyway to make an efficient solar power to mega watts converter?  I was wondering as it would be really cool to be able to put a beamed power system into a close orbit of the sun and then beam that power everywhere else but all solar panels produce electric charge which is not easily convertible to mega watts even though they both more or less measure the same thing.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually, KSPI already makes every solar panel in Ksp generate an equivalent in Megajoules. You can actually see it when you have any active solar panels and right click info screen or the Megajoule overview screen. However, the energy is wasted unless you have Super capacitor on board which will store it. The only thing that is still missing is a power distribution mechanism that allow high power parts to use the stored MJ energy without an inboard electric generator\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-15T08:09:04Z\u0022 title=\u002205/15/2016 08:09  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 15, 2016\u003C/time\u003E by FreeThinker\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ss8913","CreatedById":94747,"CreatedDateTime":"2016-05-15T08:11:40Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/117389-freethinker/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022117389\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/117389-freethinker/\u0022 rel=\u0022\u0022\u003E@FreeThinker\u003C/a\u003E So.. not sure if it\u0027s KSPIE or Tweakscale, but this only happens with one part - the plasma beam antimatter reactor.. right clicking on it generates a broken rightclick menu that grows out of control saying \u0022enter new text\u0022.  So you can\u0027t rescale it, set the starting state, anything \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E  Just started happening recently as far as I can tell.\n\u003C/p\u003E\n"}]}