{"TopicId":174551,"ForumId":36,"TopicTitle":"[WIP][1.4.3] Exotic Solutions 0.6.1b","CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-05-03T01:14:47Z","PageNum":1,"Articles":[{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-05-03T01:14:47Z","Content":"\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EExotic Solution is ultimately designed to provide alternative methods of doing a lot of tasks. It firmly leaves the realm of real-world physics and goes well in to science fiction, but makes an attempt to maintain the physics-oriented gameplay inherent to KSP. The mod focuses around Exotic Materials and Exotic Energies. Exotic Materials have to be refined in a zero-g environment, but can then be utilized anywhere. Exotics Cores convert Exotic Materials into Exotic Energies, which then power the advanced technology. When a vessel is recovered with exotic materials/energies stored they are all converted into exotic materials and stored in the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and can be used to launch ship again. There is no buying/selling of exotic materials. Exotic Solutions is \u0027Balanced\u0027 around extended techtrees and the inability to buy exotic materials at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, they must be produced and landed back at the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. I strongly recomend installing an extended tech tree for use with ES. Currently, I\u0027m building in support for CTT. I\u0027ll be happy to accept pull requests for other tech trees and may be willing implement support for some of them if I can easily find the information I need to do so.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EPart Types\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EExotics Cores: Convert Exotic Materials into Exotic Energies. Conversion is very slow, refilling an EE core takes a couple days. Only a single core can be active on a vessel at any time and all inactive cores convert their stores of EE back to EM slowly, but still faster than the generation rate.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EExotic Variability Drives(EVEs): By default, these drives are slightly worse versions of drives available earlier on, however by expending exotic energy they can be given far more powerful thrust and \u003Cabbr title=\u0022Specific Impulse (rocketry) or Internet Service Provider\u0022\u003EISP\u003C/abbr\u003E. Isp/thrust can be changed in flight, as it is increased the engine will consume progressively more EE.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EGravitic Drive: Runs on EE \u0026amp; EC, produces negative gravitational mass which effectively lifts the craft away from it\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E with force proportional to gravity. Not able to produce propulsion laterally.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003ERefineries: Refine Exotic Materials. Must be refined in-orbit, exotic materials will not be able to be refined on the ground, they require zero-g environments for formation.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EKinetic Shunts: Capable of locking on to surface of celestial bodies or other crafts. Transfers momentum between itself and locked on target. Allows for a wide variety of powerful maneuvers with fairly minimal weight, but requires something to transfer momentum to.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EKinetic Catapults: Capable of locking onto two targets and transferring momentum between them. Capable of launching other objects without moving themselves.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EEnergy shield: Serve as a craft-wide heat shield and air resistance to slow you down on re-entry. Also be able to soak collision and allow parts (solar panels, radiators, antenna) to ignore aerodynamic forces as long as the shield holds. Water collisions are real funny, and I may not be able to fix this. I may ultimately remove all of the collision soaking capabilities, resulting in these acting entirely as advanced craft-wide heat shields and to a limited extent parachutes due to the atmospheric slowing. Also, currently the only things that cost shield energy are atmospheric reentry heat and collision. I haven\u0027t been able to figure out how to figure out the aero forces that are being applied to a part to take that into account.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003E[Not yet implemented]\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003ETeleporter: Teleports stuff. Ideally, should be capable of teleporting resources, kerbals, and ships. Requires velocity matching to teleport.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EBlink drive: Ship self-teleportation. Preserves momentum, but can instantly teleport several hundred kilometers. Precise distance transportation.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EMass inversion generator and/or tank: Reduces it\u0027s mass and the mass of nearby parts. Increases delta-v, can substantially increase craft manueverability by doing things like placing it on a gimbling engine or other nearby heavy parts.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003ECurrent Parts\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EFlat Exotics Cores (0.625m, 1.25m, 2.5m): Look like batteries of their size.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EEVEs (0.625m, 1.25m, 2.5m): Look like existing engines of their appropriate size\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022color:#353c41;font-size:14px;\u0022\u003EExotic Materials Refinery (2.5M): Looks like the science lab\u003C/span\u003E\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003E\u003Cspan style=\u0022color:#353c41;font-size:14px;\u0022\u003EExotic Materials Containers (0.625m 20EM, 1.25m 50EM, 2.5 400EM, 3.75 1800EM): Look like small fuel tanks\u003C/span\u003E\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EGravitic Drives (1.25m, 2.5m, 3.75m): Look like medium fuel tanks\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EKinetic Shunt (1.25m, 2.5m): Look like ISRUs.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EKinetic Catapults (1.25m, 2.5m): Look like RA100 relay satelites.\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003EEnergy shields (1.25m, 2.5m): Custom models! Produce a 10m and 15m shield around the part.\u003C/span\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cspan\u003E\u003Ca href=\u0022https://github.com/Darinth/Exotic-Solutions\u0022 rel=\u0022external nofollow\u0022\u003EGithub\u003C/a\u003E\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nImages\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv\u003E\n\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E with takeoff engine stats displayed.\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cimg alt=\u0022BArgDhz.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/BArgDhz.png\u0022 width=\u00221024\u0022\u003E\u003C/div\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E with maximum engine stats displayed (Craft can\u0027y produce enough EE to reach those stats)\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cimg alt=\u0022rv1vRMd.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/rv1vRMd.png\u0022 width=\u00221024\u0022\u003E\u003C/div\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cdiv\u003E\nShip launching orbital refinery full of ore without access to EVEs for ascent\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cimg alt=\u0022D0ScwZ2.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/D0ScwZ2.png\u0022 width=\u00221024\u0022\u003E\u003C/div\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E Refinery using EVEs\n\u003C/div\u003E\n\u003Cdiv\u003E\n\u003Cimg alt=\u0022EkKAWut.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/EkKAWut.png\u0022 width=\u00221024\u0022\u003E\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/gallery/CF0otAY\u0022 rel=\u0022external nofollow\u0022\u003ENew imgur gallery\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/gallery/hug69S0\u0022 rel=\u0022external nofollow\u0022\u003EOld Imgur Gallery\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-14T02:06:54Z\u0022 title=\u002206/14/2018 02:06  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 14, 2018\u003C/time\u003E by Darinth\u003C/strong\u003E\n\u003Cbr\u003ENew stuff!\n\u003C/span\u003E\n"},{"CreatedByName":"IceTitan","CreatedById":187860,"CreatedDateTime":"2018-05-03T14:29:16Z","Content":"\n\u003Cp\u003E\nSounds like a good concept. Can you add pictures?\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-05-03T19:09:12Z","Content":"\n\u003Cp\u003E\nPosted up an image of a test craft and an imgur album of it in flight. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-05-08T03:48:58Z","Content":"\n\u003Cp\u003E\nOrbital refinery, Gravitic Drive, 2.5m \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E, and an EM tank added.\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-05-12T03:19:08Z","Content":"\n\u003Cp\u003E\nMostly full set of Flat cores, EVEs, Gravitic drives, EM Tanks, \u0026amp; a refinery.\n\u003C/p\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-05-16T04:14:26Z","Content":"\n\u003Cp\u003E\nWOW this sounds amazing \n\u003C/p\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-05-16T04:37:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223369862\u0022 data-ipsquote-contentid=\u0022174551\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221525310087\u0022 data-ipsquote-userid=\u0022186781\u0022 data-ipsquote-username=\u0022Darinth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/3/2018 at 10:44 AM, Darinth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan\u003EEnergy shield: At a bare minimum, should serve as a craft-wide heat shield and air resistance to slow you down on re-entry). Ideally, should also be able to soak collision and allow parts (solar panels, radiators, antenna) to ignore aerodynamic forces as long as the shield holds.\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nim really looking forward to this\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-05-16T12:27:13Z","Content":"\n\u003Cp\u003E\nCurrently working on the inertial shunts/catapults which have actually turned out a lot of fun to play with, which is actually why they\u0027ve taken a bit of time to get out. I may have spent a few hours building different crafts in attempts to do things like be able to make it to orbit exclusively on the propulsion they provide and seeing what their limitations are as far as orbital distance on their current stats.\n\u003C/p\u003E\n\u003Cp\u003E\nGiven where I\u0027m looking to put stuff in the tech tree atm, the energy shields are next. Once they\u0027re done, I\u0027m contemplating doing a balance pass and a first beta release as it\u0027ll be the first 2 big groups of technology complete and the EVEs later on.\n\u003C/p\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-05-17T00:40:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223379839\u0022 data-ipsquote-contentid=\u0022174551\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221526473633\u0022 data-ipsquote-userid=\u0022186781\u0022 data-ipsquote-username=\u0022Darinth\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Darinth said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nCurrently working on the inertial shunts/catapults\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ni wonder if we could make a Dyson sphere with this\n\u003C/p\u003E\n\u003Cp\u003E\nor am i misunderstanding what this means\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-05-17T00:41:21Z\u0022 title=\u002205/17/2018 12:41  AM\u0022 data-short=\u00226 yr\u0022\u003EMay 17, 2018\u003C/time\u003E by guesswho2778\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-05-17T02:03:40Z","Content":"\n\u003Cp\u003E\nThere would be no way in ksp to build a dyson sphere. The project would be ludicrous. A dyson swarm... maybe. But either way inertial/kinetic shunts aren\u0027t a technonolgy that would be useful for this.\n\u003C/p\u003E\n\u003Cp\u003E\nI expect their biggest uses are for near-celestial body maneuvers and space-station rendezvous, with the later having dangers related to changing your station\u0027s orbit (or even deorbiting it) on accident.\n\u003C/p\u003E\n\u003Cp\u003E\nThey allow you to transfer kinetic energy over distance. So, I apply thrust to an object in one direction, but must apply an equal and opposite thrust to another nearby object. If you\u0027re close enough to a celstial body, you can dump the kinetic energy into it giving you massive delta vs within a few km of the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nThe earliest ones will only be able to apply a force to themself by dumping that force into another object. Later ones will be able to directly transfer kinetic energy between two nearby objects. I may make another tier beyond that with tremendous range, but that may be a bit too broken for my tastes.\n\u003C/p\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-05-21T00:55:08Z","Content":"\n\u003Cp\u003E\nsorry i misunderstood what you meant got it now\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-05-23T01:48:33Z","Content":"\n\u003Cp\u003E\nBeen a bit since I updated, but really excited about this one. No energy shields yet, but the Kinetic tech is completed. I\u0027m hoping to get a video made, I\u0027m really happy with how this stuff has turned out. The first tier of it is designed to function similarly to atmospheric engines in that it\u0027s only useful close to celestial bodies, but it doesn\u0027t require air simply proximity to a planetary body. This makes it especially useful for maneuvering near airless bodies.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second tier is more useful for stations and bases. It\u0027s much more capable for affecting other objects, giving it more capability for A:orbital rendezvous, B: launching things into orbit from airless planets, C: catching incoming crafts.\n\u003C/p\u003E\n\u003Cp\u003E\nThe kinetic tech has options for killing surface velocity and orbital velocity automatically, allowing for effective automated hovering of craft.\n\u003C/p\u003E\n\u003Cp\u003E\nIt also has options for relative velocity killing for ease of rendezvous.\n\u003C/p\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-05-23T02:07:04Z","Content":"\n\u003Cp\u003E\nnice i hope you finish this mod it sounds great\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-06-03T17:02:27Z","Content":"\n\u003Cp\u003E\nAaaaaand Energy Shields! They feature my first custom made models, both a part model and the shield model are custom. I may actually remove the collision soaking capabilities from them. Realitsically, they\u0027re both A:not particularly useful, and B: a little wonky.\n\u003C/p\u003E\n\u003Cp\u003E\nAt this point, I\u0027m just going to be revisiting some of my earlier parts and updating their mechanics and then running a balance pass. Most of the 1st 4 tiers of tech that I\u0027m planning are implemented. After the balance pass, I\u0027m planning to release the first official beta. If anybody wants to look at it, github does have an alpha release up-to-date with this morning\u0027s work. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-06-05T23:30:06Z","Content":"\n\u003Cp\u003E\ncool ill have a look now\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: sorry cant look now maybe in the afternoon\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-05T23:35:00Z\u0022 title=\u002206/05/2018 11:35  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 5, 2018\u003C/time\u003E by guesswho2778\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-06-07T00:44:35Z","Content":"\n\u003Cp\u003E\ni had a look at the energy shields and maybe you could remove the collisions with the ground but keep collisions with parts (if thats possible) oh and none of the other parts are showing up for me i can see them in the folder but not in the game\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-06-12T23:23:19Z","Content":"\n\u003Cp\u003E\nI\u0027m going to guess you\u0027ve got something installed incorrectly or may simply be having trouble finding them. A number of the parts are difficult to spot because they look like squad parts. Folder structure should be \u0022Kerbal Space Program\\GameData\\Exotic Solutions\u0022. The Exotic Solutions folder should have CTT.cfg, Resources.cfg, ExoticSolutions.version, and the parts \u0026amp; plugins folders under it. If it looks right let me know. It\u0027s possible I\u0027ve done something odd.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, just uploaded a new version to github. Rework of the \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E drives, gravitic drives, and a balance pass on the kinetic tech.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Also, I don\u0027t think it\u0027s possible to have part collision without ground collision. \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-12T23:25:21Z\u0022 title=\u002206/12/2018 11:25  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 12, 2018\u003C/time\u003E by Darinth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-06-13T00:29:03Z","Content":"\n\u003Cp\u003E\n1 ive installed it correctly \n\u003C/p\u003E\n\u003Cp\u003E\n2 yes maybe i just didnt notice it\n\u003C/p\u003E\n\u003Cp\u003E\n3 nice\n\u003C/p\u003E\n\u003Cp\u003E\n4 oh \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E it\u0027d be nice if i could turn them off at least\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-06-13T01:12:52Z","Content":"\n\u003Cp\u003E\nWill probably move \u003Cs\u003Eall\u003C/s\u003E most of the parts into the science catagory and make sure that they\u0027ve all got tags on them to easily find them.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-13T01:13:47Z\u0022 title=\u002206/13/2018 01:13  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 13, 2018\u003C/time\u003E by Darinth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-06-14T02:02:40Z","Content":"\n\u003Cp\u003E\nNew release on github.\n\u003C/p\u003E\n\u003Cp\u003E\nChanges:\n\u003C/p\u003E\n\u003Cp\u003E\nOnly one exotic core active on a vessel at a time, inactive exotic cores slowly turn EE back into EM.\u003Cbr\u003E\nAdded es exotic solutions ee energy energies tags to all modules. Added a variety of other tags to parts as needed.\n\u003C/p\u003E\n\u003Cp\u003E\nPart recategorization\u003Cbr\u003E\nMoved cores to science, drives to engine.\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-06-15T04:41:33Z","Content":"\n\u003Cp\u003E\ni wish i could help but i dont know how\n\u003C/p\u003E\n\u003Cp\u003E\ni can make parts (almost) from scratch i just dont have the software to model them\n\u003C/p\u003E\n\u003Cp\u003E\nalso you should put this up on spacedock you might get more visitors in this thread\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-06-17T00:30:15Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/170733-guesswho2778/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022170733\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/170733-guesswho2778/\u0022 rel=\u0022\u0022\u003E@guesswho2778\u003C/a\u003E All of the software you need to do modeling is available for free. Blender and Unity are both completely free to use for these purposes. That said, right now I just need to know if it works. Were you able to find the rest of the parts and have you noticed any issues with them?\n\u003C/p\u003E\n\u003Cp\u003E\nSpacedock is probably not particularly likely. I\u0027ll probably rely on the forums and possibly \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E at some point, though that\u0027s not a priority atm. I\u0027ll probably be making a release thread if what I have to date seems to be all in working order.\n\u003C/p\u003E\n"},{"CreatedByName":"guesswho2778","CreatedById":170733,"CreatedDateTime":"2018-06-17T07:01:39Z","Content":"\n\u003Cp\u003E\nyeah i know its free it just my laptop is fairly basic and dosnt have much free space my ksp folder is just about 7 GB though since the newest update i have had to delete all of my \u0022archived\u0022 mods so i might have enough space for unity\n\u003C/p\u003E\n\u003Cp\u003E\noh and yes i found the parts and they seem to be working fine\n\u003C/p\u003E\n"},{"CreatedByName":"Darinth","CreatedById":186781,"CreatedDateTime":"2018-06-19T12:30:24Z","Content":"\n\u003Cp\u003E\nRelease thread is now up.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed7473274536\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/175993-143-exotic-solutions-061b/\u0026amp;do=embed\u0022 style=\u0022height:223px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}