{"TopicId":22870,"ForumId":36,"TopicTitle":"[WIP] THSS - Tri-Hexagonal Structural Strut","CreatedByName":"Semni","CreatedById":18709,"CreatedDateTime":"2013-04-19T15:46:09Z","PageNum":4,"Articles":[{"CreatedByName":"Bluegobln","CreatedById":59640,"CreatedDateTime":"2013-05-16T00:18:07Z","Content":"\n\u003Cp\u003EI\u0027ve been working on making a few parts to expand the THSS list a bit. Here is what I have so far!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s14.postimg.org/kioqv3hfl/GEParts.jpg\u0022 alt=\u0022GEParts.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDL link: \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/74868312/GoblinIndustries.zip\u0022 rel=\u0022external nofollow\u0022\u003EGoblin Industries parts for THSS\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tallinu","CreatedById":57810,"CreatedDateTime":"2013-05-16T07:58:25Z","Content":"\n\u003Cp\u003ESemni, the problem with the probe part is very simple and easy to fix (I just solved the \u0027anchoring\u0027 and blanked-out orbital information window for myself).\u003C/p\u003E\u003Cp\u003EYou have in the part.cft two MechJeb modules: MechJebCore (good!) and MechJebAR202 (Not good!) Remove the second one. Your part doesn\u0027t have the AR202 features, and the AR202 module apparently breaks things when applied to such a part.\u003C/p\u003E\u003Cp\u003EAlso, on the nano-probe, you\u0027ve left out the electrical consumption rate. I\u0027m not sure if you meant to leave MechJeb off of that one, but it\u0027s not there either.\u003C/p\u003E\u003Cp\u003ERegarding your post earlier on this page, the existing fuel tanks seem well balanced to me - the stock 1.25m tanks of the same length have the same amount of fuel, so I don\u0027t see a reason to change that.\u003C/p\u003E\u003Cp\u003EAnd one more thing: On the parts where you have panels, the panels only cover the wide sides, not the narrow sides... This is sad because those narrow sides would be perfect for mounting RCS thrusters and caseless solar panels and the like, but placing them there makes them appear to be floating, disconnected. Just a thought. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBlue Goblin, that 2-1 adapter and the open bays look awesome! I have now added those two to my collection. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-16T08:10:15Z\u0022 title=\u002205/16/2013 08:10  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 16, 2013\u003C/time\u003E by Tallinu\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-05-16T09:55:55Z","Content":"\n\u003Cp\u003EThose parts look really good.\u003C/p\u003E\u003Cp\u003EThe other day I was trying to mount two nuclear engines to the truss and couldn\u0027t really do it right with existing parts.\u003C/p\u003E\u003Cp\u003EThat adapter will work for the 1 meter engines, but most of the nuclear engines are two meters.\u003C/p\u003E\u003Cp\u003EI\u0027m trying to push this at higher speeds. It\u0027s 212 tons and it would be great if I could mount two 2 meter engines on it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/ks2Y18s\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ks2Y18s.png\u0022 alt=\u0022ks2Y18s.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Litterball","CreatedById":66421,"CreatedDateTime":"2013-05-16T10:04:07Z","Content":"\n\u003Cp\u003ESorry if this has already been asked, but is the THSS-3DS finned tristrut a functional docking port? I\u0027ve tried some docking maneuvers with two of these and they did pull together beautifully but never quite docked. The part description in the Vehicle Assembly Building doesn\u0027t actually mention docking, so I may have been making assumptions.\u003C/p\u003E\n"},{"CreatedByName":"Britich","CreatedById":42332,"CreatedDateTime":"2013-05-16T11:08:51Z","Content":"\n\u003Cp\u003ESorry but I cant say anything other than:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i0.kym-cdn.com/entries/icons/original/000/005/742/sweetjesus.jpg\u0022 alt=\u0022sweetjesus.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAbout this mod.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-05-16T17:58:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MaryG\u0022 data-cite=\u0022MaryG\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EGotta ask \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E what pack did those legs come from? I like em \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WhatsThisButtonDo\u0022 data-cite=\u0022WhatsThisButtonDo\u0022\u003E\u003Cdiv\u003EAnyone know what that engine is?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBoth components do indeed come from the NovaPunch pack. Nearly all of my landers use the aerospike as a descent engine, and I love the wide stance of the legs.\u003C/p\u003E\n"},{"CreatedByName":"kerry519","CreatedById":18146,"CreatedDateTime":"2013-05-16T19:49:19Z","Content":"\n\u003Cp\u003EI have found that if you remove the following lines in the part config it fixes the quantum anchoring problem.\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E MODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = MechJebAR202\u003Cbr\u003E} \u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-05-16T22:41:23Z","Content":"\n\u003Cp\u003EThe engine seemed a bit too underpowered to me, and as it stood it seemed pretty useless. So I bumped the vacuum ISP up to 600. Other then that, I really like these parts!\u003C/p\u003E\n"},{"CreatedByName":"Semni","CreatedById":18709,"CreatedDateTime":"2013-05-16T23:17:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tallinu\u0022 data-cite=\u0022Tallinu\u0022\u003E\u003Cdiv\u003EI love the look of that \u0022TriStrutMiniTank\u0022 part you posted the screenshot of. But is it just the angle, or are the tanks \u0027floating\u0027 inside it, only connected by their fuel lines? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s a bit of a flaw in the model that I need to address. Thanks for pointing it out though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tallinu\u0022 data-cite=\u0022Tallinu\u0022\u003E\u003Cdiv\u003ESemni, the problem with the probe part is very simple and easy to fix...\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kerry519\u0022 data-cite=\u0022kerry519\u0022\u003E\u003Cdiv\u003EI have found that if you remove the following lines in the part config ... \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks guys and other who suggested fixes, that\u0027s really helped.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Litterball\u0022 data-cite=\u0022Litterball\u0022\u003E\u003Cdiv\u003ESorry if this has already been asked, but is the THSS-3DS finned tristrut a functional docking port?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes it is, I havn\u0027t done all the descriptions and such properly yet, it\u0027s on the great big To Do pile.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tommygun\u0022 data-cite=\u0022Tommygun\u0022\u003E\u003Cdiv\u003EThose parts look really good.\u003Cp\u003EThe other day I was trying to mount two nuclear engines to the truss and couldn\u0027t really do it right with existing parts.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESweet jezus that is huge. I kind of have a solution for that in the works but meanwhile I do have some stuff I havn\u0027t shown off that is in the next release:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/3579841/J_OctoStrutSmallFuel.jpg\u0022 alt=\u0022J_OctoStrutSmallFuel.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd to everyone else who has commented, thanks for your support, you guys really have helped me and motivate me to continue developing this mod. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shadowsutekh","CreatedById":55189,"CreatedDateTime":"2013-05-17T04:30:23Z","Content":"\n\u003Cp\u003EHappy to be of service!\u003C/p\u003E\n"},{"CreatedByName":"lyndonguitar","CreatedById":61194,"CreatedDateTime":"2013-05-17T21:37:51Z","Content":"\n\u003Cp\u003EThanks, I am currently building a big station using this pack, I have one request. Can you make a battery?\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-05-18T04:13:43Z","Content":"\n\u003Cp\u003EHey, I was building an interplanetary ship for the past 2 weeks when I encountered your mod. I scappred the whole thing and designed a completely different one based around your mod. This is how much of a difference it makes to the game big ship and station building!\u003C/p\u003E\u003Cp\u003EI have a few requests, if possible. I guess you have plans to introduce more inline parts for the octagonal truss, but here\u0027s a few suggestions which will really help in my opinion, if you don\u0027t have them planned already:\u003C/p\u003E\u003Cp\u003E1. Bi-, Tri-, Quad-, Penta-, Hexa- adapters, which will allow 1.25m engine mounting(NERVAs hooray!)\u003C/p\u003E\u003Cp\u003E2. Bi- adapter, which will allow 2m engine mounting (I doubt more than 2 2m engines can fit on it, but who knows)\u003C/p\u003E\u003Cp\u003E3. Octa-monoprop tank, Xenon tank\u003C/p\u003E\u003Cp\u003E4. Different end for the Octagonal adaptor - maybe end in a triangle, so that it is inline with the rest of the trusses and allows more seamless transitiion to the stock circle game formats.\u003C/p\u003E\u003Cp\u003EThe squarely shape it ends in doesn\u0027t really fit well with anything(or did i miss some strange adapter, the cube ones don\u0027t look properly on it)\u003C/p\u003E\u003Cp\u003E5. Cube, containing only tri-truss mounts(no 1.25 circles).\u003C/p\u003E\u003Cp\u003E6. Octagonal and Triangle parts able to carry kerbals.\u003C/p\u003E\u003Cp\u003E7. Textures, but dark ones, industrial-ish (mostly unneeded,the parts are pretty good as they are)\u003C/p\u003E\u003Cp\u003ESorry if these have been already suggested.\u003C/p\u003E\u003Cp\u003EKeep up the good work.\u003C/p\u003E\n"},{"CreatedByName":"Wesmark","CreatedById":40871,"CreatedDateTime":"2013-05-18T18:52:43Z","Content":"\n\u003Cp\u003EMy kerbals request 2, 3, and 4 meter parts for their destined ship. Can you add that to this already wonderful mod?\u003C/p\u003E\n"},{"CreatedByName":"Bluegobln","CreatedById":59640,"CreatedDateTime":"2013-05-18T19:32:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E2m\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E2, 3, and 4 meter parts\u003C/div\u003E\u003C/blockquote\u003EIIRC the sizes for KSP are normally 0.5m, 1.25m, 2.5m, and other packs have introduced 2.18m, 3m, 3.75m and 5m as well (just from some packs I have seen). Technically, parts models can be any size you want though, it\u0027s just a matter of whether it matches or looks good and such.\u003Cp\u003EAs far as different sized parts, you can adjust the parts sizes by modifying the CFG files if you like. Right now THSS uses 2.57 part scaling which is because they\u0027re modeled in inches I think, if you double that to 5.14 all your tri-hex parts will go from 1.25m to 2.5m.\u003C/p\u003E\u003Cp\u003EI\u0027ll do the math for scaling numbers in the CFG for y\u0027all. (Untested)\u003C/p\u003E\u003Cp\u003EFor larger Tri-Hex pieces:\u003C/p\u003E\u003Cp\u003E- To make the 2.5m adapter into 3m you change your rescale factor to 3.084, which will make the Tri-Hex inscribed circle about 1.5m\u003C/p\u003E\u003Cp\u003E- To make the 2.5m adapter into 5m you change your rescale factor to 5.14, which will make the Tri-Hex inscribed circle about 2.5m (side effect, the 1.25m adapter becomes a 2.5m adapter, this is probably the most ideal)\u003C/p\u003E\u003Cp\u003EFor smaller Tri-Hex pieces:\u003C/p\u003E\u003Cp\u003E- To make the 3.75m adapter into 2.5m you change your rescale factor to 1.71333~, which will make the Tri-Hex inscribed circle about 83cm\u003C/p\u003E\u003Cp\u003E- To make the 2.5m adapter into 1.25m you change your rescale factor to 1.285, which makes the Tri-Hex inscribed circle (and the 1.25m adapter) about 62.5cm\u003C/p\u003E\u003Cp\u003ESo those three will give you Tri-Hex pieces of inscribed circle sizes 1.5m, 2.5m, 0.83m, and 0.625m (standard is ~1.25m). Since you\u0027re only really doing this to resize the Tri-Hex shape, its better to make the adapters line up with other sizes rather than the Tri-Hexs line up to other sizes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s not too hard to do the math for other sizes if you want to. Personally, I like the size they already are, though I might like some smaller stuff for making more fine details.\u003C/p\u003E\u003Cp\u003EAlso note: If you decide to do a rescale on the parts, you can create duplicate copies of the parts folders and rename them so you have the original sized parts still, but I am pretty sure you also have to rename the part inside the CFG file as well (which you\u0027ll be editing anyway so no problem). The one that matters is at the top of the CFG, but you can also edit the one further down which identifies the part to the player in-game (and change description, fuel amount, etc).\u003C/p\u003E\n"},{"CreatedByName":"Bluegobln","CreatedById":59640,"CreatedDateTime":"2013-05-18T19:56:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E1. Bi-, Tri-, Quad-, Penta-, Hexa- adapters, which will allow 1.25m engine mounting(NERVAs hooray!)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EAre you talking about a Tri-Hex -\u0026gt; 2, 3, 4, 5, 6 mount? That\u0027s not too tough to do, but with the current style of parts the poly count on the 6 mount for example is going to be immense. I\u0027m thinking to do that the actual mounting nodes would need to be made simple plates rather than the typical Tri-Hex strut type pieces. Honest question: why not just use a Tri-Hex adapter connected with a 2-6 adapter from a normal 2.5m or 1.25m set? It\u0027s only one extra part.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E2. Bi- adapter, which will allow 2m engine mounting (I doubt more than 2 2m engines can fit on it, but who knows)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EDo you mean like the adapter I made (2.5m into 2x Tri-Hex) but spaced wider so two 2.5m can connect? Again, that\u0027s going from 2.5m, to Tri-Hex, back to 2.5m again. Better to skip the Tri-Hex pieces in the center and place the adapters at the other end of the line.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E3. Octa-monoprop tank, Xenon tank\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EEasy to mod off of other tank parts (when he releases them) for the Octa pieces. I\u0027m pretty sure there\u0027s a model of that very thing on this page! \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E4. Different end for the Octagonal adaptor - maybe end in a triangle, so that it is inline with the rest of the trusses and allows more seamless transitiion to the stock circle game formats.\u003Cp\u003EThe squarely shape it ends in doesn\u0027t really fit well with anything(or did i miss some strange adapter, the cube ones don\u0027t look properly on it)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EThis one I totally agree with. I can see room for Octa -\u0026gt; 2.5m, Tri-Hex, 2x 2.5m (engine mount basically), and 2-6 1.25m (again engine mounts most likely). It\u0027s a large piece, after all, you\u0027d probably want to mount engines right to it.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E5. Cube, containing only tri-truss mounts(no 1.25 circles).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EI agree with this too. There is also room for 4x circle adapter with Tri-Hex top and bottom connections, I think (as a station hub piece). The real purpose of either of these, though, is just saving part counts: we have the Tri-Hex to 1.25m adapter already which can be used to get almost identical effect to both, albeit with additional parts.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E6. Octagonal and Triangle parts able to carry kerbals.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EPretty sure he\u0027s working on this already. I\u0027d like to make a command pod myself that is designed to look awesome on the end of a Tri-Strut stack. I\u0027m a ways off on that though.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E7. Textures, but dark ones, industrial-ish (mostly unneeded,the parts are pretty good as they are)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EYou mean like slightly tarnished or roughed up looking textures, mostly along edges for example, kinda like the B9 pack parts? Or you want a dark colored version of the parts as an optional different color palette? Personally I can see textures but only for non-strut parts, like maybe fuel tanks, crew modules, or engines. The struts are quite complex and would be very time consuming to texture (though perhaps it would look even better with enough work). These are just my opinions though, not Semni\u0027s... I\u0027m just hanging around lol.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"cxg2827","CreatedById":57380,"CreatedDateTime":"2013-05-19T00:29:47Z","Content":"\n\u003Cp\u003Eawesome parts!\u003C/p\u003E\u003Cp\u003EDefinitely going to use these for my manned interplanetary ships.\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-05-19T05:14:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bluegobln\u0022 data-cite=\u0022Bluegobln\u0022\u003E\u003Cdiv\u003E1.\u003Cspan style=\u0022color:#008000;\u0022\u003EAre you talking about a Tri-Hex -\u0026gt; 2, 3, 4, 5, 6 mount? That\u0027s not too tough to do, but with the current style of parts the poly count on the 6 mount for example is going to be immense. I\u0027m thinking to do that the actual mounting nodes would need to be made simple plates rather than the typical Tri-Hex strut type pieces. Honest question: why not just use a Tri-Hex adapter connected with a 2-6 adapter from a normal 2.5m or 1.25m set? It\u0027s only one extra part.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, i was talking about adapters to the octagonal cargo and truss sets. Something like this(forgive the very simple illustration) - \u003Ca href=\u0022https://www.dropbox.com/s/24kbw3nnagz8g05/Untitled.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/24kbw3nnagz8g05/Untitled.png\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bluegobln\u0022 data-cite=\u0022Bluegobln\u0022\u003E\u003Cdiv\u003E2. \u003Cspan style=\u0022color:#008000;\u0022\u003EDo you mean like the adapter I made (2.5m into 2x Tri-Hex) but spaced wider so two 2.5m can connect? Again, that\u0027s going from 2.5m, to Tri-Hex, back to 2.5m again. Better to skip the Tri-Hex pieces in the center and place the adapters at the other end of the line.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame as 1, except something like this(with bonus 1.25 nodes on the sides). - \u003Ca href=\u0022https://www.dropbox.com/s/2tv0o4jm5gyoyvx/Untitled1.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/2tv0o4jm5gyoyvx/Untitled1.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBoth of these parts would allow for simple multi-engine mounting at the end of the octagonal parts and number 2. would allow for more seemless transition between octagonal sections of interplanetary ships/stations connected with inline 2.5m docking ports from this pack, or standart 1.25m docking ports.\u003C/p\u003E\u003Cp\u003ERight now \u003Ca href=\u0022https://www.dropbox.com/s/rexq792tr5m1dlh/screenshot189.png\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003E\u003Cstrong\u003Ethis\u003C/strong\u003E\u003C/em\u003E\u003C/a\u003E is the most seamless/inline way possible to attach 2 tanks/engines at the back of an octagonal cargo bay. As you can see it takes 5 parts(3 without the adapters tri-2.5m) to get from the single node to a splitter for 2x 2.5m parts. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bluegobln\u0022 data-cite=\u0022Bluegobln\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EEasy to mod off of other tank parts (when he releases them) for the Octa pieces. I\u0027m pretty sure there\u0027s a model of that very thing on this page! \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, i saw it. I wonder if the parts can be opened in Wings3D and how? Yes, I know it\u0027s old school, but I haven\u0027t modeled in years.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bluegobln\u0022 data-cite=\u0022Bluegobln\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EThis one I totally agree with. I can see room for Octa -\u0026gt; 2.5m, Tri-Hex, 2x 2.5m (engine mount basically), and 2-6 1.25m (again engine mounts most likely). It\u0027s a large piece, after all, you\u0027d probably want to mount engines right to it.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly, you got my idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bluegobln\u0022 data-cite=\u0022Bluegobln\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EI agree with this too. There is also room for 4x circle adapter with Tri-Hex top and bottom connections, I think (as a station hub piece). The real purpose of either of these, though, is just saving part counts: we have the Tri-Hex to 1.25m adapter already which can be used to get almost identical effect to both, albeit with additional parts.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA large station or an interplanetary ship can have quite many parts. Each one spared is important, because of KSP\u0027s limitations on hardware. For instance check the part count of my interplanetary ship above. And it still has 2 miner platforms and a sky-crane to be attached.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bluegobln\u0022 data-cite=\u0022Bluegobln\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EPretty sure he\u0027s working on this already. I\u0027d like to make a command pod myself that is designed to look awesome on the end of a Tri-Strut stack. I\u0027m a ways off on that though.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, an IVA is too much to ask, since it\u0027s not the purpose of the pack. I personally would be content to see octagonal crew compartment, since it\u0027s the most likely place where kerbals can live during a long-year interplanetary voyage. Easily configurable too I guess, just by using the cargo bays from the current iteration, but needs windows \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bluegobln\u0022 data-cite=\u0022Bluegobln\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003EYou mean like slightly tarnished or roughed up looking textures, mostly along edges for example, kinda like the B9 pack parts? Or you want a dark colored version of the parts as an optional different color palette? Personally I can see textures but only for non-strut parts, like maybe fuel tanks, crew modules, or engines. The struts are quite complex and would be very time consuming to texture (though perhaps it would look even better with enough work). These are just my opinions though, not Semni\u0027s... I\u0027m just hanging around lol.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, roughed up, industrialized textures, signs of usage or decay, for example an EvE Online Orca - \u003Cimg src=\u0022http://go-dl.eve-files.com/media/0811/Orca.jpg\u0022 alt=\u0022Orca.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bluegobln","CreatedById":59640,"CreatedDateTime":"2013-05-19T05:23:09Z","Content":"\n\u003Cp\u003ESemni you sly devil you...\u003C/p\u003E\u003Cp\u003EIs it by chance a coincidence that your Octo parts look like the main structural section of the Icarus 2 from Sunshine?\u003C/p\u003E\n"},{"CreatedByName":"WhatsThisButtonDo","CreatedById":60877,"CreatedDateTime":"2013-05-20T09:19:23Z","Content":"\n\u003Cp\u003EThank you Semni for the great parts, I\u0027m using them for making ships to send out to orbit the planets:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://www.sugarsync.com/piv/D1140880_78395867_72544\u0022 alt=\u0022D1140880_78395867_72544\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://www.sugarsync.com/piv/D1140880_78395867_72656\u0022 alt=\u0022D1140880_78395867_72656\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://www.sugarsync.com/piv/D1140880_78395867_72658\u0022 alt=\u0022D1140880_78395867_72658\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://www.sugarsync.com/piv/D1140880_78395867_72651\u0022 alt=\u0022D1140880_78395867_72651\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-20T10:28:09Z\u0022 title=\u002205/20/2013 10:28  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 20, 2013\u003C/time\u003E by WhatsThisButtonDo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bluegobln","CreatedById":59640,"CreatedDateTime":"2013-05-20T18:45:36Z","Content":"\n\u003Cp\u003EI like that design WTBD, I might borrow a few things from it aye? *salute*\u003C/p\u003E\n"},{"CreatedByName":"lyndonguitar","CreatedById":61194,"CreatedDateTime":"2013-05-20T18:58:12Z","Content":"\n\u003Cp\u003ENice I can\u0027t wait to use those new parts you showed us! I\u0027ll probably hold my space station construction for a bit\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-05-20T19:15:58Z","Content":"\n\u003Cp\u003ESo\u0027s long story long, I was dicking around building a PoS little drone seeing how high I could make it fly by abusing intakes, and Tristruts are basically my favorite parts, I \u003Ca href=\u0022http://imgur.com/a/nDiXU\u0022 rel=\u0022external nofollow\u0022\u003Emake\u003C/a\u003E \u003Ca href=\u0022http://i.imgur.com/2M9bAZo.png\u0022 rel=\u0022external nofollow\u0022\u003Eall\u003C/a\u003E \u003Ca href=\u0022http://i.imgur.com/19MfrxD.jpg\u0022 rel=\u0022external nofollow\u0022\u003Esorts\u003C/a\u003E of \u003Ca href=\u0022http://i.imgur.com/wEzaCIe.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ecrap\u003C/a\u003E \u003Ca href=\u0022http://i.imgur.com/8QwqeiD.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eout\u003C/a\u003E of \u003Ca href=\u0022http://i.imgur.com/04yU8zE.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethem\u003C/a\u003E. So anyways I was making this plane, and the thing was so light that it would just spiral upwards until it ran out of air, while tinkering around I flipped the hexcan I was using for fuel inside the tristrut, I wanted a longer strut and there\u0027s no just-fuel tristrut that I have; and this happened\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/I4ZrlIk.jpg\u0022 alt=\u0022I4ZrlIk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a bit more tinkering it turns out the large hexcans aren\u0027t just a perfect fit for the corners, three of them precisely fit within, occupying most of the space; and the normal hexcans do the same to the small tristrut\u003C/p\u003E\u003Cp\u003Ealbum of it \u003Ca href=\u0022http://imgur.com/a/9oHXt\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/9oHXt\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt even extends just past the tristrut\u0027s collision box so you can still easily grab it and put things on it, it\u0027s great!\u003C/p\u003E\n"},{"CreatedByName":"JeBuSBrian","CreatedById":66324,"CreatedDateTime":"2013-05-20T19:55:13Z","Content":"\n\u003Cp\u003EWow, looks like a match made in heaven! Maybe these two guys should put their heads together. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-05-20T19:56:34Z","Content":"\n\u003Cp\u003EMine would make a resounding clonk\u003C/p\u003E\n"},{"CreatedByName":"Bluegobln","CreatedById":59640,"CreatedDateTime":"2013-05-20T20:39:40Z","Content":"\n\u003Cp\u003EFascinating. I\u0027m impressed, and now adding that to my .20 parts list...\u003C/p\u003E\n"}]}