{"TopicId":23162,"ForumId":36,"TopicTitle":"Need help with tweaking a custom engine","CreatedByName":"Lazarus78","CreatedById":57185,"CreatedDateTime":"2013-04-20T19:29:00Z","PageNum":1,"Articles":[{"CreatedByName":"Lazarus78","CreatedById":57185,"CreatedDateTime":"2013-04-20T19:29:00Z","Content":"\n\u003Cp\u003ESorry if this is in the wrong place. The forums don\u0027t seem to really have a section fitting for this type of question.\u003C/p\u003E\u003Cp\u003EAnyhoo, I made a custom engine, and by custom, I mean I duplicated an existing part and started messing with the settings.\u003C/p\u003E\u003Cp\u003EThe engine in question is an \u0022ion\u0022 engine which I am trying to make with greater thrust and lower resource usage, unfortunately its not a matter of changing the thrust, as it seems the higher the thrust, proportionately so does the resource usage go up. So my \u0022ion\u0022 engine with a thrust of 256 will drain all my ships 12000 electrical charge in a matter of seconds. This is not idea. I don\u0027t might high energy usage, but i don\u0027t want it draining faster then is usable.\u003C/p\u003E\u003Cp\u003EAlso, I would much prefer the engine to use ONLY electrical charge, but setting or removing the Xenon resource makes the engine not work at all. Is there a way to remove the gas requirement?\u003C/p\u003E\u003Cp\u003ERelevant information:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E// --- standard part parameters ---\u003Cbr\u003Emass = 2\u003Cbr\u003EdragModelType = default\u003Cbr\u003Emaximum_drag = 0.2\u003Cbr\u003Eminimum_drag = 0.2\u003Cbr\u003EangularDrag = 2\u003Cbr\u003EcrashTolerance = 7\u003Cbr\u003EmaxTemp = 3600\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = ModuleEngines\u003Cbr\u003E\tthrustVectorTransformName = thrustTransform\u003Cbr\u003E\texhaustDamage = False\u003Cbr\u003E\tignitionThreshold = 0.1\u003Cbr\u003E\tminThrust = 0\u003Cbr\u003E\tmaxThrust = 256\u003Cbr\u003E\theatProduction = 0\u003Cbr\u003E\tPROPELLANT\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = ElectricCharge\u003Cbr\u003E       \t\tratio = 1.0\u003Cbr\u003E\t\tDrawGauge = True\u003Cbr\u003E\t}\u003Cbr\u003E\tPROPELLANT\u003Cbr\u003E\t{\u003Cbr\u003E\t\tname = XenonGas\u003Cbr\u003E\t\tratio = 0.05\u003Cbr\u003E\t}\u003Cbr\u003E\tatmosphereCurve\u003Cbr\u003E \t{\u003Cbr\u003E   \t key = 0 256\u003Cbr\u003E \t}\u003Cbr\u003E\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T19:31:59Z\u0022 title=\u002204/20/2013 07:31  PM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by Lazarus78\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-04-20T19:58:11Z","Content":"\n\u003Cp\u003EBoth your questions stem from the fact that the engine module specifies fuel economy in ISP. ISP works out as mass use per unit thrust.\u003C/p\u003E\u003Cp\u003ESo increasing the thrust increases mass use, and you can\u0027t solely have a zero mass fuel because dividing mass flow by fuel density to get fuel weight results in a divide by zero error.\u003C/p\u003E\u003Cp\u003EThe first one is easily fixed by increasing the ISP.\u003C/p\u003E\u003Cp\u003EThe second one isn\u0027t, ModuleEngines doesn\u0027t support using only massless fuels.\u003C/p\u003E\u003Cp\u003EYou could potentially use the old 0.15 LiquidEngine class (not LiquidFuelEngine) but I don\u0027t know if that\u0027s been updated to support more modern introductions like action groups. Other than that, custom plugin time.\u003C/p\u003E\n"},{"CreatedByName":"Lazarus78","CreatedById":57185,"CreatedDateTime":"2013-04-20T20:21:23Z","Content":"\n\u003Cp\u003ESo lowing the isp will lower the fuel consumption?\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2013-04-20T20:43:45Z","Content":"\n\u003Cp\u003EIncreasing the ISP lowers the fuel consumption.\u003C/p\u003E\n"},{"CreatedByName":"Lazarus78","CreatedById":57185,"CreatedDateTime":"2013-04-20T20:53:33Z","Content":"\n\u003Cp\u003Eok, i got it sorted out. thanks a lot!\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2013-04-20T21:10:14Z","Content":"\n\u003Cp\u003EYou could make the engine \u0027generate\u0027 xenon, or another fuel, and use that for thrust..\u003C/p\u003E\n"},{"CreatedByName":"Lazarus78","CreatedById":57185,"CreatedDateTime":"2013-04-21T02:26:19Z","Content":"\n\u003Cp\u003EI made a separate part that does the generation to negate the gas usage.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2013-04-21T02:27:26Z","Content":"\n\u003Cp\u003EThose can be the same part\u003C/p\u003E\n"},{"CreatedByName":"RychschaX","CreatedById":65621,"CreatedDateTime":"2013-05-15T17:54:33Z","Content":"\n\u003Cp\u003Eor....we could go the other route and make a different electricity resource that acts like a fuel.....I imagine crews about to run out of power when they orbit around to the day side of the planet...they hastily deploy their solar panels and begin to refill their electricity tanks....its no wonder third-world countries on Kerbin tend to not have power in many places. think of all the pipes they would need to run to get the electricity everywhere...wow....I should totally do something with this....\u003C/p\u003E\n"}]}