{"TopicId":25360,"ForumId":36,"TopicTitle":"Open source models of a standard Kerbal?","CreatedByName":"Absolution","CreatedById":4156,"CreatedDateTime":"2013-05-04T02:29:36Z","PageNum":1,"Articles":[{"CreatedByName":"Absolution","CreatedById":4156,"CreatedDateTime":"2013-05-04T02:29:36Z","Content":"\n\u003Cp\u003EI am looking for a simple 3D model of a typical Kerbal I can use to help design interior spaces. Any ideas?\u003C/p\u003E\u003Cp\u003EI understand a typical Kerbal is 0.75m tall and from that I can model up my own \u0022Kerbal-dummy\u0022 for kinematics purposes but that can only take me so far. How long are their arms and where do they articulate? How far above the feet are the knees? I can probably make a hallway easy enough but what about more particular spaces like a chair? I need more information on how a Kerbal is built.\u003C/p\u003E\n"},{"CreatedByName":"LaydeeDem","CreatedById":5984,"CreatedDateTime":"2013-05-05T04:25:12Z","Content":"\n\u003Cp\u003EThe one I use is an awesome kerbal model by \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/member.php/19412-Anariaq\u0022 rel=\u0022external nofollow\u0022\u003EAnariaq\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i329.photobucket.com/albums/l389/anariaq/KSP%20album/kebal003.jpg\u0022 alt=\u0022kebal003.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDownload:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://db.tt/5qf4LXPm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://db.tt/5qf4LXPm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso, just a correction, Kerbals are 1 meter tall.\u003C/p\u003E\n"},{"CreatedByName":"ahappydude","CreatedById":458,"CreatedDateTime":"2013-05-05T13:07:57Z","Content":"\n\u003Cp\u003ENutt, thanks for sharing that and if you know the creator thank him to =) Been looking for a way to compare things making in unity and ksp cheers!\u003C/p\u003E\n"},{"CreatedByName":"ghost010","CreatedById":57302,"CreatedDateTime":"2013-05-06T01:22:24Z","Content":"\n\u003Cp\u003Ethanks allot,now i can finally start making iva\u0027s\u003C/p\u003E\n"},{"CreatedByName":"K3-Chris","CreatedById":61664,"CreatedDateTime":"2014-08-28T16:14:11Z","Content":"\n\u003Cp\u003EIs that model positioned and scaled correctly based upon the in-game assets ? So if I put it exactly on top of the seat transform can I basically wrap the model in stuff and have it fit and not clip any of it? (allowing for the idle animations moving the heads, legs nad arms a bit).\u003C/p\u003E\u003Cp\u003EA reference for where the camera is and it\u0027s FOV and how it turns would also be awesome, if I had all those parts I wouldn\u0027t have to move something 5mm in unity, re-load KSP\u0027s database and check if the angle/position is right so the kerbal can see it without something else being in the way, or doesn\u0027t clip into a kerbal etc.\u003C/p\u003E\n"}]}