{"TopicId":26277,"ForumId":36,"TopicTitle":"Orion aka \u0026quot;Ol\u0026#039; Boom-boom\u0026quot;","CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-10T17:17:02Z","PageNum":45,"Articles":[{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-01-26T17:22:32Z","Content":"\n\u003Cp\u003EThink I might make a few unmanned tests at full operational weight to see if this is a viable solution to the fuel to weight ratio!\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-01-27T09:23:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sampa\u0022 data-cite=\u0022Sampa\u0022\u003E\u003Cdiv\u003EThink I might make a few unmanned tests at full operational weight to see if this is a viable solution to the fuel to weight ratio!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPayload ratio on Orion was calculated to be about 45% payload, which pisses all over anything available for chemical rockets. The Orion engine obviously weighs a bit more than a rocket engine, but once you\u0027ve invested the tonnes for that, the payload can be quite large.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-01-30T23:29:54Z","Content":"\n\u003Cp\u003EI\u0027m seriously thinking of building some parts to have more Orion compatible structures to add to Nyrath\u0027s work here. I\u0027ll have to get around to learning one of them new fangled 3D modelling programs (all my tech drawing stuff in engineering was pre-computer-for-students) like blender, but space-craft parts are all fairly close to standard geometric shapes etc.\u003C/p\u003E\u003Cp\u003EThinking of heavier, stronger bits of fuselage for assorted purposes, scaled to fit 2m, 5m, 10, 25m, 40m, and 56m pusher plates. Probably many very short cylinders at first, extending to six way pie wedges, with and without cutouts at the inside corner.\u003C/p\u003E\u003Cp\u003EMany ideas, little time, and zero experience with blender/unity. But there\u0027s heaps of good tutes on yootubes etc. I guess it\u0027ll need to be an add on mod, or mod extender. Depends how Nyrathy I can make things look. :-)\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-01-31T04:07:11Z","Content":"\n\u003Cp\u003EI hate these 3D programs already. Yay spreadsheets and obj files!\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-01T12:16:49Z","Content":"\n\u003Cp\u003ESome basic items in play.\u003C/p\u003E\u003Cp\u003ESet (so far) at the 10m basic size of the normal Nyrath mod.\u003C/p\u003E\u003Cp\u003EGot two magazines (different yields) and mono-propellent so far. Needs a crew quarters, reaction wheel, generator, science lab and probably a few other parts yet. And different heights. Still swearing at getting 3d modelling software to do things I could do on paper in a tenth the time. :-/\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/705146710123932816/9CC339B19B95DC8F7A811A2CB3BF7A1EC976D934/\u0022 alt=\u00229CC339B19B95DC8F7A811A2CB3BF7A1EC976D934\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2015-02-01T14:32:35Z","Content":"\n\u003Cp\u003EI\u0027m sorry I\u0027m to busy to help right now, but there are some notes and diagrams about the 10-meter USAF Orion that the mod is based on here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/realdesigns.php#id--Project_Orion--USAF_10_Meter_Orion\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/realdesigns.php#id--Project_Orion--USAF_10_Meter_Orion\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUsing Blender:\u003C/p\u003E\u003Cp\u003E[1] The rule is: \u003Cstrong\u003EOne hand on the mouse, the other on the keyboard\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E[2] This means you have to memorize lots of hot keys\u003C/p\u003E\u003Cp\u003E[3] Print out a list of important hot keys\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.dummies.com/how-to/content/blender-for-dummies-cheat-sheet.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.dummies.com/how-to/content/blender-for-dummies-cheat-sheet.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://blendertips.com/hotkeys.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://blendertips.com/hotkeys.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E[4] Tape them to the wall next to the computer monitor\u003C/p\u003E\u003Cp\u003E[5] Start doing some tutorials\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.blender.org/support/tutorials/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.blender.org/support/tutorials/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ewhile frequently referring to the cheat sheet.\u003C/p\u003E\u003Cp\u003EOne hand on the mouse, the other on the keyboard.\u003C/p\u003E\u003Cp\u003E[6] For about a week you will feel like you are pounding your head on the wall.\u003C/p\u003E\u003Cp\u003EThen one fine day you\u0027ll try Blender again, and suddenly it will be childishly easy\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-02T09:32:11Z","Content":"\n\u003Cp\u003EThanks for the tips Nyrath. It\u0027s them hot keys that are ....ting me off the most. There\u0027s a lot of things you can\u0027t seem to do any other way. But it keeps me out of mischief.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-03T09:41:21Z","Content":"\n\u003Cp\u003EAnd it seems the notes I\u0027ve read on \u0022units\u0022 to meters is wrong. My 3.2m wide spine (aka 2.56unit wide or 3.2/1.25) is pretty close to the 2.5m size. :-( But the 10m \u0022main\u0022 section I made matches the 10m Orion drive, which means we\u0027ve both been following similar conversions. Which don\u0027t seem to match. Unless there\u0027s a special understanding about \u0022nominal sizes\u0022 I\u0027m unaware of. Or I\u0027m trusting sizes from mods that I\u0027ve had so long I\u0027ve forgotten they\u0027re not core KSP.\u003C/p\u003E\u003Cp\u003EAnyway, 10\u0022m\u0022 (possibly 8m) wide core crew quarter sections modelled. Need a main variant with windows yet. But coming along nicely.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steamusercontent.com/ugc/705146710131065865/75D60EA90E3E49BD42EABCC5EF22B3067DB5FB5E/\u0022 alt=\u002275D60EA90E3E49BD42EABCC5EF22B3067DB5FB5E\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-05T22:00:57Z","Content":"\n\u003Cp\u003EThe wiki certainly suggests 1unit = 1m. So I\u0027m moving forward based on that. And it matches items in game. I created a 3m to 2.5m adapter and crew quarters and unscaled some squad items to 3m for testing. Looks pretty good except the hitch-hiker can keeps self-undoing the rescale. Which looks pretty daft. \u003C/p\u003E\u003Cp\u003ETo do the rockets I\u0027m going to need to put in some serious blender time though I think. Definitely not standard rocket stuff.\u003C/p\u003E\n"},{"CreatedByName":"Angelo Kerman","CreatedById":106975,"CreatedDateTime":"2015-02-05T22:58:48Z","Content":"\n\u003Cp\u003EAtomic Rockets was instrumental in my creation of the Supernova. Nice to see another of Nyrath\u0027s research projects being continued in KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-06T12:57:02Z","Content":"\n\u003Cp\u003EWell, using some quick scaled up Squad pieces (2.5m to 3m is not a huge difference), plus a 3m to 2.5m adapter, and some very early editions of 7.2m personnel compartments, a vaguely similar to sketch Orion is taking off. Except that it turns out if you add a few tonnes to everything\u0027s weight, and your final payload is 250tonnes, 3.5MN pulses don\u0027t quite get you off the ground very far. Seeing the 1963 project reckoned only 30tonnes for everything above a 91tonne engine unit, I may need to adjust some component weights.\u003C/p\u003E\u003Cp\u003ETo do next.\u003C/p\u003E\u003Cp\u003E3.2m Spine pieces. The lower spine for the 10m Orion should be 3.2m Diameter, with upper spine at 3.0\u003C/p\u003E\u003Cp\u003ERounded caps for the side access tunnels.\u003C/p\u003E\u003Cp\u003EActual module interactivity for parts that should have it.\u003C/p\u003E\u003Cp\u003EGetting off my arse regarding textures that aren\u0027t vague murky off-white.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/706273152530887694/2353B2A4A5B8ABA24A97F16140059829C49E6A3B/\u0022 alt=\u00222353B2A4A5B8ABA24A97F16140059829C49E6A3B\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf anyone else is interested, I made the following alterations to Nyrath\u0027s base Orion.\u003C/p\u003E\u003Cp\u003Erescale = 1.2 Seems it used to be 1 unit = 1.25m, but it now appears that 1unit = 1m. \u003C/p\u003E\u003Cp\u003EIncreased the mass of the engine to it\u0027s official estimated 91tonnes (mentioned in the cfg file even).\u003C/p\u003E\u003Cp\u003EAdjusted the 3.5MN magazine to 92 units instead of 60.\u003C/p\u003E\u003Cp\u003EAltered the 6x10xmagazine stack to be 6x10x92 instead of 6x10x10.\u003C/p\u003E\u003Cp\u003ECan\u0027t figure out how to add a supply of pulse units to the engine itself, as it was originally specced for 900 or so internal storage pulse units. In case the 5000 nukes stored above wasn\u0027t enough.\u003C/p\u003E\u003Cp\u003EI haven\u0027t rescaled any of the magazines or magazine infrastructure, \u0027cos lazy, and because things go haywire when I mess with those. :-)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-06T12:57:38Z\u0022 title=\u002202/06/2015 12:57  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 6, 2015\u003C/time\u003E by TiktaalikDreaming\u003C/strong\u003E\n\u003Cbr\u003Eforgot screen grab\n\u003C/span\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2015-02-07T16:06:17Z","Content":"\n\u003Cp\u003EGood work TiktaalikDreaming!\u003C/p\u003E\u003Cp\u003EAdding internal storage pulse units will be a pain. The module code will have be be altered, and unfortunately I do not have time to do it (the source code is supplied with the mod, of course).\u003C/p\u003E\u003Cp\u003EThe trouble is the tricky coding used so that the mod magically found any attached pulse unit magazines and set the engine up to consume their pulse units. And keep the different sizes of pulse units separate.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-07T23:03:11Z","Content":"\n\u003Cp\u003EYeah, I\u0027m leaning towards skipping the internal units, or at least leaving that till last.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-08T02:20:25Z","Content":"\n\u003Cp\u003EI\u0027ve been working a bit on the escape rockets. My idea is a fuel tank/engine plate that has two diameters. A top diameter matching the upper spine, ie 3m, and then necks in to allow rockets around the neck (much like the Project Orion plans). Due to the lack of teeny rockets, I\u0027m using LEM Ascent rockets and the neck in is both thinner and longer than the original. But it works quite nicely.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/706273152536838579/DA1FEA5E7FB3824B936768BB6D0645874917B669/\u0022 alt=\u0022DA1FEA5E7FB3824B936768BB6D0645874917B669\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd in build stage,\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/706273152536834593/59B01B39956CA72BF7EE4DBC29F57605FDDB89AB/\u0022 alt=\u002259B01B39956CA72BF7EE4DBC29F57605FDDB89AB\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-08T09:42:12Z","Content":"\n\u003Cp\u003EAnd now with updated texture and model;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/706273152537999273/63E9D870E8392FA9192D21DCDCE66A5DE5108986/\u0022 alt=\u002263E9D870E8392FA9192D21DCDCE66A5DE5108986\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"John Nowak","CreatedById":67890,"CreatedDateTime":"2015-02-09T00:12:44Z","Content":"\n\u003Cp\u003EIt\u0027s probably out of scope, but I think it would be pretty amazing if Scott Lowther\u0027s Orion-based asteroid deflection suggestion could be implemented somehow.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-09T07:13:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John Nowak\u0022 data-cite=\u0022John Nowak\u0022\u003E\u003Cdiv\u003EIt\u0027s probably out of scope, but I think it would be pretty amazing if Scott Lowther\u0027s Orion-based asteroid deflection suggestion could be implemented somehow.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat sort of thing was my first plan, but then I got distracted with the specs for the real world plans for the 10mPlate Orion to Mars. Once I have parts for the 10m, I\u0027ll branch out to systems suitable for 20m, 25m etc. It\u0027s pretty much impossible to build things for bigger than about 30m diameter in KSP, so I\u0027d have to stop at the Battleship class. It could be some time before I have parts for all that though.\u003C/p\u003E\u003Cp\u003EEsp as I want to re-do the Orion engine models for the 20m and up, as they should have a double circle of secondary shockies.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-09T10:09:35Z","Content":"\n\u003Cp\u003ERighto, internal bomb supply (conceptually) solved.\u003C/p\u003E\u003Cp\u003EThis idea has been fermenting for a couple of days, so I thought I should give it a go.\u003C/p\u003E\u003Cp\u003EA bomb magazine part that has a two piece attachment point (ie, an almost identical set of two attachments) that sits at the top of the piece, so you can drop it into another large piece.\u003C/p\u003E\u003Cp\u003ESo I could see ... I was doing, I used an attachment piece 0.02 inside the piece, but it worked like a charm. Especially once the collision mesh ends up below the edge but some visual hint remains above.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/706273152541861438/BA582B90B927B8237A46DD855B21132E9207EE06/\u0022 alt=\u0022BA582B90B927B8237A46DD855B21132E9207EE06\u0022\u003E\u003C/p\u003E\u003Cp\u003EGoing to have to ignore the wedge shape in future though, rotation in KSP doesn\u0027t have the detail required.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-09T12:20:08Z","Content":"\n\u003Cp\u003EDropbox test: \u003Ca href=\u0022https://www.dropbox.com/s/wv54qzsvwt15p66/EnginePlate.7z?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/wv54qzsvwt15p66/EnginePlate.7z?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s just the engine plate. And the main outside surface is as yet subject to change, but basically OK except the cfg file isn\u0027t quite tidied up. Needs a symmetry setting and probably some waffle etc.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-12T21:16:12Z","Content":"\n\u003Cp\u003EOK.\u003C/p\u003E\u003Cp\u003EI\u0027ve spent a bit of time working on proof of concept idea to have the 7.2m crew compartment as a set of 45degree wedges that fit around a central spine. And I think I\u0027m giving up on the idea. It was based on the original plans being for dividing the space into 8ths and then in Kerbal, the idea of being able to mix and match each of those wedges really appealed to me. But I could only get sane attachment points by setting the core\u0027s 8 points to node_stack, but then with 10 in total, the piece didn\u0027t behave for actual stacking. Change them to attach, and the core behaves, but I can no longer add my external wedges. And I think I\u0027ve probably wasted enough time on it.\u003C/p\u003E\u003Cp\u003EGoing back to 7.2m diameter cylinders. Probably with more variations. So time to look at things like getting airlocks working and ladders etc.\u003C/p\u003E\u003Cp\u003ESome messing, a couple of hours, and I have a working airlock (which coincidentally messes up my texture mesh, which was pretty basic anyway for that part).\u003C/p\u003E\u003Cp\u003EAnyway, current (flyable) mock-up with the little (upside-down) crew hatch that makes me happy.\u003C/p\u003E\u003Cp\u003ENote: The only 3.2mD part I had for the lower spine was my test centre piece for the wedge plan, which is why it has alternating coloured hatchy type appendages and reminds me a little bit of octopus leg. mmmm octopus...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steamusercontent.com/ugc/711903286861114421/A028F2EC921699EBD2DE4E27E0E3CAAC93E8900E/\u0022 alt=\u0022A028F2EC921699EBD2DE4E27E0E3CAAC93E8900E\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2015-02-12T22:36:06Z","Content":"\n\u003Cp\u003EI was thinking about doing the same thing: making the internal bomb supply something the size of a matchbox that you attach.\u003C/p\u003E\u003Cp\u003EKeeping in mind that the magic bomb management code changes a bomb magazine\u0027s mass dynamically, as bombs are taken out. So that matchbox will have a mass of \u003Cem\u003Etons\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EBe cure you mount it on the thrust axis of the engine units, or the ship may be unbalanced.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-13T00:46:46Z","Content":"\n\u003Cp\u003EI created just that. A bit larger than a matchbox, but with the top AND bottom stack nodes both at 0.001 units under the top of the object. I set the top surface to show, with a piece of text saying what the yield is, then place them on the six nodes around the centre. Assuming you don\u0027t mismatch opposing bomb configurations, it should balance. \u003C/p\u003E\u003Cp\u003EHere\u0027s a set of 20MNx150 stacks, one upside down to show the mesh. Hopefully it helps explain what I mean. :-)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/711903286855795231/A23357A894C1871BDA31535E41E869AC2AE684BA/\u0022 alt=\u0022A23357A894C1871BDA31535E41E869AC2AE684BA\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo far, I only have the 20MN stack, so no chance of unbalancing. It shows in the bomb selector nicely.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-15T07:07:54Z","Content":"\n\u003Cp\u003EPutting stuff at;\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://kerbalstuff.com/mod/586/TD%20Industry%27s%20Orion%20bits%2010m\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalstuff.com/mod/586/TD%20Industry%27s%20Orion%20bits%2010m\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EStill pretty early stuff, esp as I don\u0027t really have any plain spine pieces in either 3m or 3.2m diameter.\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2015-02-19T09:04:08Z","Content":"\n\u003Cp\u003EWell, wasted a couple of days on Pulse Unit loading systems modelling that is unlikely to ever be used. Good Blender practice though.\u003C/p\u003E\u003Cp\u003EI\u0027ve been toying with the idea of knocking the top off the existing Orion engine models and then having various internal loadouts of pulse unit yields as separate floors above.\u003C/p\u003E\u003Cp\u003EI don\u0027t really have the tools/skills/knowledge to do that knocking the top off someone else\u0027s animated/scripted/tirggered model, so I doubt it will come to anything.\u003C/p\u003E\u003Cp\u003EWhat I might do is do a submergable edition of this to sink into the middle of the existing engines (like the bomb stack I\u0027ve already done), and maybe one to add stack above (the original plans had variable main engine body sizes after all).\u003C/p\u003E\u003Cp\u003EAnyway, I present (crappy textured) internal bomb loading thingies;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steamusercontent.com/ugc/710778107000735080/7A369D7B14DFE21EEA9335D19AFA0228388B6F41/\u0022 alt=\u00227A369D7B14DFE21EEA9335D19AFA0228388B6F41\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rulib","CreatedById":100379,"CreatedDateTime":"2015-02-23T03:08:05Z","Content":"\n\u003Cp\u003EI used TweakScale and Universal Storage to get their wedges up to the Orion diameter. Might make for a good wedge-shaped bomb magazine with a little ModuleManager. You can see them above the engine and below that procedural structural cone.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Pge1cZ8.jpg\u0022 alt=\u0022Pge1cZ8.jpg\u0022\u003E\u003C/p\u003E\n"}]}