{"TopicId":32479,"ForumId":36,"TopicTitle":"The L.O.G. Multiplayer Project","CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-06-11T19:57:07Z","PageNum":8,"Articles":[{"CreatedByName":"PringleMan","CreatedById":1396,"CreatedDateTime":"2013-09-28T00:15:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarkusA380\u0022 data-cite=\u0022MarkusA380\u0022\u003E\u003Cdiv\u003EHi Meatsauce!\u003Cp\u003EWell, I really see your point that there is a way to use mods for multiplayer, but on the other hand a multiplayer mod shouldn\u0027t have mods (or just very few) to make it worth playing. A real fun gameplay can only occur if you have the same difficulity of a vanilla version. In this case you have challenges to do worth playing together: What does multiplayer be worth if everyone builds his warp driven space cruisers and teleports to Laythe? Simply nothing.\u003C/p\u003E\u003Cp\u003EOnly creating bases and such together on moons and planets with much work and time envolved will make fun over a long time. (And yes, war is also possible) (and minigames and such...)\u003C/p\u003E\u003Cp\u003ESo, there are NO mods planned to be supported. Please take it as it is, no mod I know except Kethane is not changing the game difficulity.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you are also mistaking what mod support for this project would mean. It does not mean that mods are required, or that this would require other mods to make it worth playing. It means that they can be used IF desired. For me I find vanilla KSP to be quite boring. There are not really other goals than to fly to a planetary body. Sure we could try to land multiple objects in close proximity to each other, but even then that will get old fast. Mods offer an alternative to waiting months and years for the KSP devs to MAYBE add something that jives with your own ideas. Not to say they are doing a bad job, just that they have very different goals and standards since they are doing this for a living.\u003C/p\u003E\u003Cp\u003EAs well, can you please show me where it says that there is just one central server? Because it seems to me your argument is only worth having if there is only a single server for everyone to play on. Otherwise, if you don\u0027t like that a server is using mods, then play on a different server! And adding in a verification for a stock installation, if that is your preference, is not a huge deal compared to the other problems.\u003C/p\u003E\u003Cp\u003ENow having said all that, I do think that mod support should be the lowest of priorities.\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-09-28T12:42:06Z","Content":"\n\u003Cp\u003EOk, I see your point. Multiplayer in vanilla gets boring, yes.\u003C/p\u003E\u003Cp\u003EBut that was never the plan.\u003C/p\u003E\u003Cp\u003EWe are re-thinking the gameplay concept, ok?\u003C/p\u003E\n"},{"CreatedByName":"Hydralisk","CreatedById":83589,"CreatedDateTime":"2013-09-28T19:06:06Z","Content":"\n\u003Cp\u003EI think that if everyone clicks the warp key then you should all begin to warp at the fastest warp allowed. For instance, if you all click it but someone is near the atmosphere, the speed of the warp will be based off the person near atmosphere. That way, you don\u0027t all have to go to the command center and such to warp, but it also prevents the person near the atmosphere from being blown up. (I actually do not know what would happen if you forced warp someone near the atmosphere, but I am sure it is not pretty \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E).\u003C/p\u003E\n"},{"CreatedByName":"Heagar","CreatedById":67859,"CreatedDateTime":"2013-09-28T21:16:13Z","Content":"\n\u003Cp\u003EI would really like an mp-solution, in witch i can interact with other people (and/or their crafts). But that would mean that the server have too mutch to collect and distribute. After a little brainstorming of mine, the possible needed minimum data for following steps:\u003C/p\u003E\u003Cp\u003E//For the players own craft//\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Ethe *.craft file (please think of ships with more than 200 parts)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ecomparison of the actual craft with the *.craft file (i\u0027ll discuss this later on)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E//Additional data when the player can see other ships in the map-view.//\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Ethe velocity of the spacecraft and it\u0027s vector\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ealtitude above a gravity-source (Planet, moon, star)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E//Additional data when the player can see the other crafts in flight (he have to be down to 2 km, where KSP load the nearby crafts)//\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eattitude and accelaration of the spacescraft\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E//Additional data when docking etc. is implemented//\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Emass of the actual crafts (with fuel load etc.)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Edata of the physics simulation\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIf you really want a \u0022race to the mun\u0022 with different fractions only, the following is important:\u003C/p\u003E\u003Cp\u003E//There may no docking to an other players spacecraft needed for archieving the goal.//\u003C/p\u003E\u003Cp\u003EA single ship can do the work. Maybe you watch for a few hours your ship to land on the mun without time-warp.\u003C/p\u003E\u003Cp\u003E//Better wait for the career mode from SQUAD. Because://\u003C/p\u003E\u003Cp\u003EThis \u0022race to mun\u0022-scenario complicates this kind of mp in a manner, witch you should reconcider.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EA savegame on a local computer can be overwritten. And then a guy could easyly do this:\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/oRavSmQ1kQc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. Mission acomplished for her/his fraction.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EA player can quicksave and load a mission\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ea player can restart/abort the mission\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe solution would be, to store all regarding savegames and their *.craft files on the server, quite a heavy load. And that\u0027s mean further:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eto deactivate the debug menu\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eto make it impossible to use the F5-/F9-option and the \u0022revert\u0022-button.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eto use a plugin like \u0022mission-controller\u0022 without the option to start a flight without using it. A fraction then have to earn money with some \u0022goal-steps\u0022 or normal missions in order to be able to effort the building of a mun-rocket with lander. \u003Cbr\u003ELook at RiS to knew what i mean \u003Ca href=\u0022http://sourceforge.net/projects/raceintospace/?source=directory\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://sourceforge.net/projects/raceintospace/?source=directory\u003C/a\u003E. \u003Cbr\u003EIn this nice manager-style program even the reliabilty of a given mission is lowered if you jump to the next goal-step ahead, without performing the actual one (Going for an manned orbital flight without an succsessful completed manned suborbital flight first e.g.).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EYour plugin has prior to the connection to the server to check out, wether the part *.cfg\u0027s are altered or not (build in probecore/sience equipment in tank, or tank in wing e.g.). If the condition for that is true it have to deny the connection to the server. \u003Cbr\u003EThe source for comparison have to be on the server (and that will take it\u0027s time, longer as the loading screen).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eto destroy all debris automaticly, even ships witch are \u0022stranded\u0022 and no kerbal is in it. For this your plugin have to check, if the ship is operational and in use. Otherwise you quickly will have \u0022leftovers\u0022 everywhere, witch the server have to compute.\u003Cbr\u003EThis could be quite tricky to decide, especially when a craft (especially probes) \u0022dies\u0022 during a munar night, when using e.g. solar pannels or a landing leg is broken and so on (actual stage is different to the design). And e.g. a descend/ascend stage of an LM with a probecore after an mission is present (Is mission_end true or false?).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eto prevent a \u0022takeover\u0022 if the player is clicking on a alien vessel (map view in tracking station) of his fraction/competetive fraction or trying to change to an alien vessel nearby.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENearly all above is impossible to achieve, because you have to reverse engineer KSP for that purpose, i suppose. And that is against the law. \u003C/p\u003E\u003Cp\u003EOf course you can beg SQUAD to add the several needed points in their API .\u003C/p\u003E\u003Cp\u003EIf you wait for the career mode from SQUAD, a few points may be solved already. Because i think they will:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eencrypt the savegame in that mode\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Emake use of the prices for the parts for an craft\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Emake quicksave/-load and \u0022revert\u0022-button not accessible\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eadding research, in witch you can advance with: achieving mission goals / spending credits / (game)time passing by\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-28T21:51:13Z\u0022 title=\u002209/28/2013 09:51  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 28, 2013\u003C/time\u003E by Heagar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ace_Of_Spades","CreatedById":63298,"CreatedDateTime":"2013-09-28T21:28:59Z","Content":"\n\u003Cp\u003EMe wantz it\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-09-29T03:59:12Z","Content":"\n\u003Cp\u003E@Heagar\u003C/p\u003E\u003Cp\u003EJust let them do their \u0022work\u0022. There is a lot of stuff that needs to be worked around anyway, so there will be solutions to use. Craft files are a good example. No one sane would design a system that uses ksp craft or save files to update vessels. It might be good for a proof of concept or early dev version, but are horrible inefficient in creating them and you could easily safe 90% traffic and more by using a different format.\u003C/p\u003E\u003Cp\u003EAlso Squad won\u0027t change anything on their safe system for the career mode. Actually, the last updates change to the \u0022end flight\u0022 / revert system was made for the career mode or with it in mind. Also encrypting save game does not make any sense, since you cannot stop people from cheating in SP games if they want to.\u003C/p\u003E\u003Cp\u003E@mod-topic:\u003C/p\u003E\u003Cp\u003EThe question is not what mods will be supported by an multi-player, but what mods will support the MP. Lot of especially pure part mods would might work just fine, but others will require a lot of work to make them compatible... especially those that change the gameplay mechanics. Guess aiming for a mostly stock mp is difficult enough, for now.\u003C/p\u003E\n"},{"CreatedByName":"NGTOne","CreatedById":55972,"CreatedDateTime":"2013-09-29T04:33:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Faark\u0022 data-cite=\u0022Faark\u0022\u003E\u003Cdiv\u003E@mod-topic:\u003Cp\u003EThe question is not what mods will be supported by an multi-player, but what mods will support the MP. Lot of especially pure part mods would might work just fine, but others will require a lot of work to make them compatible... especially those that change the gameplay mechanics. Guess aiming for a mostly stock mp is difficult enough, for now.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe big problem is going to be gameplay mods that need persistent information that isn\u0027t saved in the persistence file (like Kethane, which randomly generates resource distributions in every new game). Most mods store 100% of the needed information in the ship\u0027s persistence file when the ship/game is unloaded. Stuff like RemoteTech and Kethane will be trickier.\u003C/p\u003E\u003Cp\u003EBut, to what I understand, it\u0027s effectively client/server-model savefile-synching (already been done, see the old Kessler plugin from 0.15 or whenever it was) with the added twist of future-position extrapolation (something Kessler didn\u0027t do). So the only problem, as I stated above, would be synching information that isn\u0027t stored in the savefile, and deciding who \u0022wins\u0022 a conflict (my money\u0027s on the server generating its own version of the information, like in Minecraft - server-side plugins enable certain mods that store information outside the savefile).\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-09-29T09:54:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hydralisk\u0022 data-cite=\u0022Hydralisk\u0022\u003E\u003Cdiv\u003EI think that if everyone clicks the warp key then you should all begin to warp at the fastest warp allowed. For instance, if you all click it but someone is near the atmosphere, the speed of the warp will be based off the person near atmosphere. That way, you don\u0027t all have to go to the command center and such to warp, but it also prevents the person near the atmosphere from being blown up. (I actually do not know what would happen if you forced warp someone near the atmosphere, but I am sure it is not pretty \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour idea isn\u0060t good at all. Think of someone docking in orbit, and someone wanting to warp to Jool... pure chaos. Please think through your ideas before posting them. And please, accept that I did think through my concept before opening up this project.\u003C/p\u003E\n"},{"CreatedByName":"Rofl47","CreatedById":72874,"CreatedDateTime":"2013-09-29T13:47:19Z","Content":"\n\u003Cp\u003EI think when itsdone, i will have KSP fun with my friends!\u003C/p\u003E\n"},{"CreatedByName":"Heagar","CreatedById":67859,"CreatedDateTime":"2013-09-29T13:53:36Z","Content":"\n\u003Cp\u003E@ Faark\u003C/p\u003E\u003Cp\u003EOk, let\u0027s say it this way:\u003C/p\u003E\u003Cp\u003EThe idea of an muliplayer in KSP in my opinion would be to play with other people rather than against them. \u003C/p\u003E\u003Cp\u003EAnd i mentioned that it would be a heavy server load nesseceary to make the given senario save.\u003C/p\u003E\u003Cp\u003EThe *.craft-files would be used to minimize debris and \u0022stranded\u0022 craft\u0027s in my suggestion.\u003C/p\u003E\u003Cp\u003EThere are people out there with weird constructions like that one in the first link. Copy that craft into the savegame for the mp and a game would then last 38 minutes for the player and 35 minutes MET.\u003C/p\u003E\u003Cp\u003EAnd there are guys like \u0022the winter owl\u0022 who are able to edit an part\u0027s *.cfg file manually (therefore the mentioned check). \u003C/p\u003E\u003Cp\u003EBTW: That ability is a must if you want to create new parts like e.g. the kethane mod, C7 pack and so on. So it\u0027s anything else than insane.\u003C/p\u003E\u003Cp\u003EBesides: There is a mod existing (i don\u0027t knew it\u0027s name at the moment) with witch you can automaticly resize fueltanks (creating an new part *.cfg file it seems) to match the diameter and length you want.\u003C/p\u003E\u003Cp\u003EA bit fiddeling with it\u0027s code, and you are able to equip nearly anything into an normal tank automaticly with the same name for the part *.cfg file.\u003C/p\u003E\u003Cp\u003EThe first FPS-games (like battlefied) - where is a sort of competition too - where suffering e.g. from so called \u0022wall-hacks\u0022. One person is coding, several other people are using the hack then to have an advantage. \u003C/p\u003E\u003Cp\u003EUnless you prevent this on serverside, there will be at all times people who will using hacks or bugs when playing.\u003C/p\u003E\u003Cp\u003EYou can\u0027t stop cheating in SP-mode, that\u0027s right. But when using the career mode with an encrypted savegame for the mp, it make sense:\u003C/p\u003E\u003Cp\u003E- you have to complete goal-steps\u003C/p\u003E\u003Cp\u003E- research have to be done\u003C/p\u003E\u003Cp\u003E- there are limited resources for a fraction\u003C/p\u003E\u003Cp\u003EWitch means: A longer game and more fun.\u003C/p\u003E\u003Cp\u003ETo say it in short:\u003C/p\u003E\u003Cp\u003EIf this mp would be released under the current conditions there would be only short, imbalanced games. Therefore i\u0027d argued to reconcider the senario.\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-09-29T14:00:54Z","Content":"\n\u003Cp\u003EI always enjoy watching people who know nothing about code engage in discussions about code, lol.\u003C/p\u003E\u003Cp\u003EGood luck with this project, would be kind of neat to have KSP as a LAN option.\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-09-29T15:23:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rofl47\u0022 data-cite=\u0022Rofl47\u0022\u003E\u003Cdiv\u003EI think when itsdone, i will have KSP fun with my friends!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMe too, indeed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E@haegar: You should learn a bit of coding to understand how KSP works. If you build a check program to look whether your KSP is vanilla or not, you would have a anti-cheat system halfway done.\u003C/p\u003E\u003Cp\u003EAnd, we are actually talking about a downloadable server software, where the host can decide which mods he will make necessary to play on it. Every other mod or plugin will be forbidden.\u003C/p\u003E\u003Cp\u003ESomebody hacking can easily be banned.\u003C/p\u003E\u003Cp\u003EBut to stop hacking completely we will need an anti-cheat engine.\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-09-30T05:03:51Z","Content":"\n\u003Cp\u003EThe server software is done!\u003C/p\u003E\u003Cp\u003EI am looking forward to the first testing! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-09-30T05:14:41Z","Content":"\n\u003Cp\u003EWhoah, testing already.\u003C/p\u003E\u003Cp\u003E*suddenly wants to test*\u003C/p\u003E\u003Cp\u003EI uh... worked for Bobcat as a tester \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-09-30T05:39:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Destroyer\u0022 data-cite=\u0022The Destroyer\u0022\u003E\u003Cdiv\u003EWhoah, testing already.\u003Cp\u003E*suddenly wants to test*\u003C/p\u003E\u003Cp\u003EI uh... worked for Bobcat as a tester \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it\u0027s not THAT far. The plugin isn\u0027t done yet and we need so called \u0022remote function calls\u0022 to let the client communicate with the plugin.\u003C/p\u003E\u003Cp\u003EBut I think the first connection will be etablished soon... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd I think we will invite some people to the first tests...\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-09-30T07:26:56Z","Content":"\n\u003Cp\u003EAh I see, I thought it was like early-alpha-2-players-can-dock kind of thing.\u003C/p\u003E\n"},{"CreatedByName":"nitrodoggy","CreatedById":78818,"CreatedDateTime":"2013-09-30T08:39:02Z","Content":"\n\u003Cp\u003EHi!\u003C/p\u003E\u003Cp\u003EI\u0027ve just been reading through the thread, and would like to become a tester if possible, especially since it seems to be getting close to testing time!\u003C/p\u003E\u003Cp\u003EI have been looking for a proper multiplayer mod for a while in KSP, and until now I have only been able to use the Kerbal LiveFeed mod. Me and alot of my friends play KSP, and we have always wanted to build awesome space stations together, or engage eachother in dogfights (Purely for testing purposes)\u003C/p\u003E\u003Cp\u003EThanks -\u003Cspan style=\u0022color:#FFA500;\u0022\u003ENitro\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"popeter45","CreatedById":56678,"CreatedDateTime":"2013-09-30T17:29:15Z","Content":"\n\u003Cp\u003Ewill it be open alpha of closed?\u003C/p\u003E\n"},{"CreatedByName":"Meatsauce","CreatedById":4499,"CreatedDateTime":"2013-09-30T18:37:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarkusA380\u0022 data-cite=\u0022MarkusA380\u0022\u003E\u003Cdiv\u003ENo, it\u0027s not THAT far. The plugin isn\u0027t done yet and we need so called \u0022remote function calls\u0022 to let the client communicate with the plugin.\u003Cp\u003EBut I think the first connection will be etablished soon... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd I think we will invite some people to the first tests...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGreat work guys!\u003C/p\u003E\n"},{"CreatedByName":"TheAlpha","CreatedById":83637,"CreatedDateTime":"2013-09-30T19:01:31Z","Content":"\n\u003Cp\u003ELooks very cool if it\u0027s not a fake \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarkusA380","CreatedById":45759,"CreatedDateTime":"2013-09-30T19:17:04Z","Content":"\n\u003Cp\u003EHaha! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI like you guys for this!\u003C/p\u003E\u003Cp\u003ESo, everyone will be able to test the mod soon, but I can\u0027t answer when and in which state of development...\u003C/p\u003E\u003Cp\u003EThe first \u0022community testing\u0022 will be with more or less famous people... I am thinking of some known YouTubers to show it to you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut I have to ask them first...\u003C/p\u003E\u003Cp\u003E@Meatsauce: Thank you, such posts cheer me up to continue the development with all of my dedication... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheAlpha\u0022 data-cite=\u0022TheAlpha\u0022\u003E\u003Cdiv\u003ELooks very cool if it\u0027s not a fake \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou didn\u0027t see the proof of concept video, did you?\u003C/p\u003E\u003Cp\u003E*slaps himself for deleting it out of the first post*\u003C/p\u003E\u003Cp\u003EReally, just trust me.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-01T04:52:28Z\u0022 title=\u002210/01/2013 04:52  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 1, 2013\u003C/time\u003E by shadowsutekh\u003C/strong\u003E\n\u003Cbr\u003ENo double posts please!\n\u003C/span\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-09-30T23:34:38Z","Content":"\n\u003Cp\u003EHow will you deal with say the 1st player timewarping for 400 days then exiting, then a 2nd player comes along and timewarps for 500 days.\u003C/p\u003E\u003Cp\u003EWhat will happen to the 1st player\u0027s flight if it was on say an interplanetary encounter?\u003C/p\u003E\u003Cp\u003EWill it just shoot off into a solar orbit then when player 1 rejoins jump back to its trajectory?\u003C/p\u003E\n"},{"CreatedByName":"ZingidyZongxxx","CreatedById":58363,"CreatedDateTime":"2013-09-30T23:52:57Z","Content":"\n\u003Cp\u003EInteresting solution for the time warp problem. The only problem I see is the one mentioned above, where anyone who leaves their flight on a transfer would miss their burn after the server jumps ahead when they come back. I guess that\u0027s easily solved by only leaving your ships on the ground or in orbit, but it would still be kind of annoying. It sounds great though and I have a few questions:\u003C/p\u003E\u003Cp\u003E1: Does everyone launch from the same place on Kerbin? If so, how will they be kept from crashing if other people try to launch too?\u003C/p\u003E\u003Cp\u003E2: How could people be prevented from destroying other people\u0027s creations? KSP has a nice community, but there are always people who do that sort of thing.\u003C/p\u003E\u003Cp\u003E3: What about mod compatibility? Would mods be possible at all? If so, I assume they would have to be installed to the server.\u003C/p\u003E\n"},{"CreatedByName":"SILENTnoobXD","CreatedById":70965,"CreatedDateTime":"2013-10-01T01:41:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZingidyZongxxx\u0022 data-cite=\u0022ZingidyZongxxx\u0022\u003E\u003Cdiv\u003E1: Does everyone launch from the same place on Kerbin? If so, how will they be kept from crashing if other people try to launch too?\u003Cp\u003E3: What about mod compatibility? Would mods be possible at all? If so, I assume they would have to be installed to the server.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI too have been wondering about how the mod compatibility will work. My guess was that its probably best to have the same mods, but I was curious what the Author\u0027s plans are. \u003C/p\u003E\u003Cp\u003EI\u0027ll likely put up a server for it if possible. If it\u0027s mod compatible, I\u0027d throw Kerbtown and Wayland Tower on there, then I\u0027d have 2 runways and several Heli/VTOL pads. That; or extraplanetary launchpads. \u003C/p\u003E\u003Cp\u003EI have a question though; has there been any thought given to cooperative ship editing? I and a few friends I used to play Hazeron with like building ships together. I was considering starting the grind of trying to build it myself, but I\u0027d love to know if somebody is already doing/planning to do it.\u003C/p\u003E\n"},{"CreatedByName":"CARROTSAREAWSOME","CreatedById":61645,"CreatedDateTime":"2013-10-01T05:00:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ZingidyZongxxx\u0022 data-cite=\u0022ZingidyZongxxx\u0022\u003E\u003Cdiv\u003EInteresting solution for the time warp problem. The only problem I see is the one mentioned above, where anyone who leaves their flight on a transfer would miss their burn after the server jumps ahead when they come back. I guess that\u0027s easily solved by only leaving your ships on the ground or in orbit, but it would still be kind of annoying. It sounds great though and I have a few questions:\u003Cp\u003E1: Does everyone launch from the same place on Kerbin? If so, how will they be kept from crashing if other people try to launch too?\u003C/p\u003E\u003Cp\u003E2: How could people be prevented from destroying other people\u0027s creations? KSP has a nice community, but there are always people who do that sort of thing.\u003C/p\u003E\u003Cp\u003E3: What about mod compatibility? Would mods be possible at all? If so, I assume they would have to be installed to the server.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. Were rethinking the gameplay. Probably there will be three or more places to start, lets call them clans for now. When you join to server first time, you can choose what clan you want to be part of. For the clans itself, there might be waiting system. Warp will be disabled for launch pad, becouse, well, if somebody time warps at the pad for 500 days, the pad becomes useless for those 500 days.\u003C/p\u003E\u003Cp\u003E2. Peoples from other clans cant collide with you, unless if its specified from servers config file.\u003C/p\u003E\u003Cp\u003E3. Mods. No mods for this super-alpha-hyper-closed-beta. Mods might be supported in the way Minecraft supports mod.\u003C/p\u003E\u003Cp\u003ENOTE: anything can and probably will change, so dont have too big hopes regarding these things.\u003C/p\u003E\n"}]}