{"TopicId":3352,"ForumId":36,"TopicTitle":"What is the standard strength?","CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-01T19:49:13Z","PageNum":1,"Articles":[{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-01T19:49:13Z","Content":"\n\u003Cp\u003EI\\\u0027m looking to add a stronger part to the game. But I don\\\u0027t know what the default strength is. I don\\\u0027t want it breaking on the launch pad and I don\\\u0027t want it to be a cheat part. Just a little bit stronger... so what is the default value? The struts are listed as:\u003C/p\u003E\u003Cp\u003EbreakingForce = 14\u003C/p\u003E\u003Cp\u003EbreakingTorque = 14\u003C/p\u003E\u003Cp\u003Eor something similar. But what is a standard part?!\u003C/p\u003E\n"},{"CreatedByName":"Killerhurtz","CreatedById":320,"CreatedDateTime":"2011-11-01T20:11:36Z","Content":"\n\u003Cp\u003EThat\\\u0027s only a hard limit. I find the weight to be more decisive than that - in the sense that your part might be heavy enough to hold well, but because it\\\u0027s under the threshold it\\\u0027ll break, while the other way around (huge strength, little weight), while your part MIGHT hold it will bend which will cause your ship to disintegrate most likely.\u003C/p\u003E\u003Cp\u003ESo yeah, there\\\u0027s no defining standard for this as far as I know.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2011-11-01T20:18:24Z","Content":"\n\u003Cp\u003ESorry. I just meant, what is the default value for a part. IE a booster or fuel tank. I\\\u0027m not worried about the weight, and I perfectly understand that it will still come into effect. But if I want a part \u002B1 (or \u002B10 or \u002B100!) strength for the connection, or twisting, what do I set it to?\u003C/p\u003E\n"},{"CreatedByName":"Killerhurtz","CreatedById":320,"CreatedDateTime":"2011-11-02T00:02:29Z","Content":"\n\u003Cp\u003EOh, in that sense. I have no idea what is the default value. HOWEVER. What I do know is that if you don\\\u0027t put a parameter in the .cfg, it SHOULD automatically be set to the default value.\u003C/p\u003E\n"}]}