{"TopicId":34398,"ForumId":36,"TopicTitle":"SciFi Mods - Legacy mk1 Pod","CreatedByName":"StarVision","CreatedById":44592,"CreatedDateTime":"2013-06-23T07:20:45Z","PageNum":20,"Articles":[{"CreatedByName":"mjy","CreatedById":69956,"CreatedDateTime":"2014-07-01T03:04:21Z","Content":"\n\u003Cp\u003Ewell thx for the info, its ok, I like English, so much easier to write then French anyway, just need to touch it up, ok, as for the mod\u003C/p\u003E\u003Cp\u003EI tried it again, went in space took a moon tour, np at all , a small hiccup as I turn the ship at a full rotation, almost not visible. could be anything for that part\u003C/p\u003E\u003Cp\u003Enow I didn\u0060t turn off the impulse drive it it runs very well, did what u say for saving the game, for me if I turn off the impulse on off it starts to lag , no idea if I got a conflict with other mods, etc, as I got a very heavy mod and even it doesn\u0060t lag, but like I say it runs very good up to 3.5 gig, running at 2.9 - 3.1 gig. not saying its your impulse mods that does it , just weird, can\u0060t figure it out.\u003C/p\u003E\u003Cp\u003E but really the most important part of the mod is u can slow down and stop, as it makes it the best driving pluging atm, now I can drive my ship the way I wanted to, the other driving pluging makes your ship moves around, this is better, perfect to dock, tried it , takes a bit of getting used to it. but for sure the voyager needs warp now as for long distances, might lower down the voyager textures, ksp normal are from 256 normal to 512 high , 1024 really high, after it need a beef up machine to not notice it 4096 x 4096 hehe is very nice, will see how much I can bring it down w/o losing to much quality, as I might leave it, it doesn\u0060t bother me to much. after my Daedalus ship which is going good\u003C/p\u003E\u003Cp\u003EI might make stuff for voyager and enterprise, still a nob to figuring out the right way to make stuff for this game\u003C/p\u003E\u003Cp\u003Equestion for starvision or any is how the heck can u make a hanger with collision, in my test I had to make a 5 piece box and add collision to all pieces of the mesh in unity, there another way to add collision??? as I want a cargo bay and a place to put your kerbal.or do u cut up your mesh in 3dmax first,mmm\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-01T03:07:31Z\u0022 title=\u002207/01/2014 03:07  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 1, 2014\u003C/time\u003E by mjy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-01T03:40:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mjy\u0022 data-cite=\u0022mjy\u0022\u003E\u003Cdiv\u003Ewell thx for the info, its ok, I like English, so much easier to write then French anyway, just need to touch it up, ok, as for the mod\u003Cp\u003EI tried it again, went in space took a moon tour, np at all , a small hiccup as I turn the ship at a full rotation, almost not visible. could be anything for that part\u003C/p\u003E\u003Cp\u003Enow I didn\u0060t turn off the impulse drive it it runs very well, did what u say for saving the game, for me if I turn off the impulse on off it starts to lag , no idea if I got a conflict with other mods, etc, as I got a very heavy mod and even it doesn\u0060t lag, but like I say it runs very good up to 3.5 gig, running at 2.9 - 3.1 gig. not saying its your impulse mods that does it , just weird, can\u0060t figure it out.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Emy game never grows in RAM that much - I would suggest, one of your other mods has a leak..\u003C/p\u003E\u003Cp\u003Eif it\u0027s a small leak 20-50Kb per minute, you won\u0027t notice this at first - but after a while it fills up the RAM..\u003C/p\u003E\u003Cp\u003ETo clarify - if I run my game with impulse for 30 minuts and fly to mun and back, it does only add some KB to the ram when mun loads - when I leave mun, those Kb will go away - RAM goes down!!!\u003C/p\u003E\u003Cp\u003EIf your ram NEVER goes down again, you have a leak somewhere - but I can confirm, planet scanner is in current published version the only leak - so it must be something else.\u003C/p\u003E\u003Cp\u003EI am certain because I test it daly and I run a leak analyzer script in the background since you found the first LOL\u003C/p\u003E\u003Cp\u003ESo thank\u0027s for that - I learned a lot about leaks since then..\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mjy\u0022 data-cite=\u0022mjy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E but really the most important part of the mod is u can slow down and stop, as it makes it the best driving pluging atm, now I can drive my ship the way I wanted to, the other driving pluging makes your ship moves around, this is better, perfect to dock, tried it , takes a bit of getting used to it. but for sure the voyager needs warp now as for long distances, might lower down the voyager textures, ksp normal are from 256 normal to 512 high , 1024 really high, after it need a beef up machine to not notice it 4096 x 4096 hehe is very nice, will see how much I can bring it down w/o losing to much quality, as I might leave it, it doesn\u0060t bother me to much. after my Daedalus ship which is going good\u003C/p\u003E\u003Cp\u003EI might make stuff for voyager and enterprise, still a nob to figuring out the right way to make stuff for this game\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood luck - I am a professional Webdesigner and application deveopper for internet apps - I know my way around textrure optimization as well..\u003C/p\u003E\u003Cp\u003EI went over all his textures and reached just minor improovements - the current one could be reduce for about 500Kb - that all..\u003C/p\u003E\u003Cp\u003EWhy? because a default KSP part is 300 times smaller than voyager - if you want a half ways good quality on this size of part, (300\u002Bmeter) you can\u0027t go with a 512\u003C/p\u003E\u003Cp\u003Eno chance..\u003C/p\u003E\u003Cp\u003Ebut if you can proofe me wrong, we will all benefit - I just hope you share it if it\u0027s an improovement \u0022without\u0022(!!!) quality loss.\u003C/p\u003E\u003Cp\u003EIf I had my way, I would put in a 8K jpeg with a resolution of 27.5dpi - than we\u0027d have a decent texture below one Mb - but with PNG it\u0027s almost the best we can get..\u003C/p\u003E\u003Cp\u003Ejpg can\u0027t be used in games - it\u0027s a shame..\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mjy\u0022 data-cite=\u0022mjy\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Equestion for starvision or any is how the heck can u make a hanger with collision, in my test I had to make a 5 piece box and add collision to all pieces of the mesh in unity, there another way to add collision??? as I want a cargo bay and a place to put your kerbal.or do u cut up your mesh in 3dmax first,mmm\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDisclaimer:\u003C/p\u003E\u003Cp\u003EI have no clue what I\u0027m taling about.. - only made this by script not by editor.. - blender is smething else..\u003C/p\u003E\u003Cp\u003Eyou go better if you export one (1) mesh from blender - I\u0027ve tried with a multimesh part last week - it was kind of confusing and didn\u0027t work at the end..\u003C/p\u003E\u003Cp\u003EAbout collider - try this:\u003C/p\u003E\u003Cp\u003E1st option I would try)\u003C/p\u003E\u003Cp\u003EYou can make in blender a collider that fits with low poly count and make a second, independent asset of it\u003C/p\u003E\u003Cp\u003EAfter that \u0022drag and drop\u0022 or what ever unity requires this collider in the \u0022collider\u0022 field (or what ever unity calls that) and you should be good to go..\u003C/p\u003E\u003Cp\u003E2nd option I would try:\u003C/p\u003E\u003Cp\u003EUnity has included colliders in different shapes (cube,sphere,etc..) - you can \u0022add\u0022 or what ever unity cals that such a collider template to the mesh by top menu option \u0022add\u0022 if I\u0027m not mistaken\u003C/p\u003E\u003Cp\u003EI think (?) unity will scale this collider to fit your mesh - if not, you can resize it..\u003C/p\u003E\u003Cp\u003EI know, because I\u0027ve done this by script for photon torpedos at the beginning..\u003C/p\u003E\u003Cp\u003EGameObject.AddCollider(\u0022cube\u0022); or something was it..\u003C/p\u003E\u003Cp\u003EIn editor, I just know what I can do in script has an option in unity..\u003C/p\u003E\u003Cp\u003EHappy searching :-P\u003C/p\u003E\u003Cp\u003EHTH\u003C/p\u003E\n"},{"CreatedByName":"mjy","CreatedById":69956,"CreatedDateTime":"2014-07-01T04:57:15Z","Content":"\n\u003Cp\u003Ety for the quick reply,i never really look if it was going up, I notice it on the last leak prob, but true, it might be another mod that does leak, conflict with your mod, mm more testing.\u003C/p\u003E\u003Cp\u003Eu said =the current one could be reduce for about 500Kb - that all.., mm not worth losing the quality, yes was wondering about the size, reason I ask starvision to make it so we could fool around and modified it, I guest were stuck with those nice textures for now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, myself I\u0060m stuck at watching what mods I add in, I added 2-3 mods to cut down the \u003C/p\u003E\u003Cp\u003Esize,etc,textures, so I could add tons of mods, work great, just might have a conflict with yours, as it seems to be, now to find that conflict will be very hard, I got a big list, will leave that for now.\u003C/p\u003E\u003Cp\u003Ek, as for the unity, I might have to break it up in 3dmax first, I think I figured out how, makes it a bit of a pain, but unity u got to add mesh collider/click convex, so kind of restricted for making collision, why in each game I mod its always the collision giving me prob lol. ty for the info\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-02T05:02:58Z","Content":"\n\u003Cp\u003EOk - I have a new version online..\u003C/p\u003E\u003Cp\u003EGo to first post, click on the plugin download link, select Beta4 and click raw - as described in the OP.\u003C/p\u003E\u003Cp\u003EWhat\u0027s new:\u003C/p\u003E\u003Cp\u003E- Fixed some minor bugs\u003C/p\u003E\u003Cp\u003E- made some GUI tweaks and updates..\u003C/p\u003E\u003Cp\u003E- added 4 subsystems\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1, CargoBay \u003C/strong\u003Eis growing - it now can store resources\u003C/p\u003E\u003Cp\u003EThe amount of cargo space depends on the ships configuration - I made a nifty algorythm to calculate individual capacities for each ship.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2. FuelTank Manager \u003C/strong\u003E- allows to create custom resource tanks in the cargobay\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3. Fueltransfer \u003C/strong\u003E- select a ship in range and transfer fuel from there or to there\u003C/p\u003E\u003Cp\u003EI found the most confortable way to empty dozens of tanks with one click - you will love it!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E 4. CrewQuartiers \u003C/strong\u003E- it allows to beam kerbals aboard even if the ship is full on seats.\u003C/p\u003E\u003Cp\u003EImagine, somewhere in the hull, small crew compartments, that can be used for passengers.\u003C/p\u003E\u003Cp\u003EThere are no IVAs for those cabins!\u003C/p\u003E\u003Cp\u003EThe amount of crew quartiers depends on the ships configuration - I made a nifty algorythm to calculate individual capacities for each ship.\u003C/p\u003E\u003Cp\u003EThis subsystem will also check if the ship has an airlock - if not, one will be provided.\u003C/p\u003E\u003Cp\u003EFueltransfer is completely intertwined with fueltank manager and offers shortcuts to reduce clicks..\u003C/p\u003E\u003Cp\u003EBoth Fueltransfer and fueltanks are completely dependent from CargoBay - if the Bay is full, or not present, no tanks can be created.\u003C/p\u003E\u003Cp\u003EI need you guys to find out if all features are working in all kind of situations, if there are bugs in certian circumstances and if you find the GUI useable or a pain.\u003C/p\u003E\u003Cp\u003EIf the latter, please describe how you would do it. I\u0027m open to improovements.\u003C/p\u003E\u003Cp\u003EThanks for many testers and many feedback reports.\u003C/p\u003E\u003Cp\u003EI mean several people anounced to volunteer to test the phasers - but no one reported back last weeks, except my french friend \u003C/p\u003E\u003Cp\u003E(mjy: 2:5 - I will never forgive you that!! but well - out is out - argentina had more luck in the 123rd minute - good luck for FR though.. but I\u0027d say the germans win :-P)\u003C/p\u003E\u003Cp\u003EStill present: the leak in planet scanner - use it with care!\u003C/p\u003E\u003Cp\u003EOHH!!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIMPORTANT!!!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eif you experiance some problems like \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u0022This system will not work today\u0022\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Eyou might need to update the CFG of voyager-saucer (and or shuttles)\u003C/p\u003E\u003Cp\u003ETo make the system future compatible with those modular parts, that Starvision is planning, I added for all subsystems strong requirements on different module entries in the part file.\u003C/p\u003E\u003Cp\u003EThe modules that are required for full working order at this moment are the following:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = StarTrekImpulseDrive\u003Cbr\u003E        RESOURCE\u003Cbr\u003E        {\u003Cbr\u003E            name = ElectricCharge\u003Cbr\u003E            rate = 0.1\u003Cbr\u003E        }\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = StarTrekShuttleBay\u003Cbr\u003E    }\u003Cbr\u003E   MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = StarTrekCargoBay\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = StarTrekFuelTransfer\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = StarTrekCloakingDevice\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = StarTrekCrewQuartier\u003Cbr\u003E    }\u003Cbr\u003E    MODULE // *\u003Cbr\u003E    {\u003Cbr\u003E        name = TransporterSystem\u003Cbr\u003E    }\u003Cbr\u003E    MODULE// *\u003Cbr\u003E    {\u003Cbr\u003E        name = WeaponSystems\u003Cbr\u003E    }\u003Cbr\u003E    MODULE// *\u003Cbr\u003E    {\u003Cbr\u003E        name = PhotonTorpedo\u003Cbr\u003E    }\u003Cbr\u003E    MODULE// *\u003Cbr\u003E    {\u003Cbr\u003E        name = TractorBeam\u003Cbr\u003E    }\u003Cbr\u003E\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E* these names are subject to change in next version - some changes are allready planned but not implementsd..\u003C/p\u003E\u003Cp\u003Eso be prepared to replace them soon..\u003C/p\u003E\u003Cp\u003Eprobbably they will change all - but that is not decided by now..\u003C/p\u003E\u003Cp\u003Eif one of them is missing, the respective system will simply be deactivated.\u003C/p\u003E\u003Cp\u003EThis allows to spread those codes on several parts and construct your own variety of SpaceShip.\u003C/p\u003E\u003Cp\u003EWell - as soon as the parts are done.\u003C/p\u003E\u003Cp\u003EFor now: Voyager saucer should get all of them.\u003C/p\u003E\u003Cp\u003EThe shuttles will work with all, but you can leave out what you think is missplaced..\u003C/p\u003E\u003Cp\u003Elike shuttle bay..\u003C/p\u003E\u003Cp\u003ENot all of them are doing something by the way..\u003C/p\u003E\u003Cp\u003Eshuttlebay is required but not working.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-02T05:07:43Z\u0022 title=\u002207/02/2014 05:07  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 2, 2014\u003C/time\u003E by philotical\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mjy","CreatedById":69956,"CreatedDateTime":"2014-07-02T21:29:20Z","Content":"\n\u003Cp\u003EI\u0060m French Canadian, east coast. great, will check out the new update, still working on my Daedalus, prob won\u0060t make a post for it, will prob release it later on, so 90% done.\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-03T01:47:16Z","Content":"\n\u003Cp\u003ECanadian - omg - \u0022Le Me\u0022 tryes to make a joke and runns in a wall whahah\u003C/p\u003E\u003Cp\u003EDeadalus - sounds like progress..\u003C/p\u003E\u003Cp\u003ECare to post a pic? Or too early for that?\u003C/p\u003E\u003Cp\u003EI\u0027m curiouse.\u003C/p\u003E\u003Cp\u003EI\u0027m working on the new subsystem \u0022StructuralIntegrityField\u0022\u003C/p\u003E\u003Cp\u003EI hope it will take some of StarVisions problems away when he makes modular parts..\u003C/p\u003E\u003Cp\u003Eand as a side effect, it will alow you to fly into and land on the sun *verry-big-and-childish-grin*\u003C/p\u003E\u003Cp\u003EThe CloakingDevice project seems to evaporate infront of my eyes - the functions I found, do nothing at all..\u003C/p\u003E\u003Cp\u003Eso not sure how to handle that..\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-04T05:56:21Z","Content":"\n\u003Cp\u003EI have a little problem - maybe some one has a clue how to solve it..\u003C/p\u003E\u003Cp\u003EThis thingy I made this afternoon..\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/CS2LA\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E..has no right click ability, no colisions and can not be saved for some reason..\u003C/p\u003E\u003Cp\u003EIt also screws up some KSP orbit displays on the map sometimes..\u003C/p\u003E\u003Cp\u003EIn unity, I added a \u0022mesh collider\u0022 - no collider-material and selected my mesh as once more as a collider..\u003C/p\u003E\u003Cp\u003E(it\u0027s VERY low poly so the collision mesh can\u0027t be reduced anyway..)\u003C/p\u003E\u003Cp\u003EI\u0027m not sure what I\u0027m missing, or what info I need to provide to debug..\u003C/p\u003E\u003Cp\u003Ecan anyone help? Just let me know what you need to know or have - I\u0027ll supply all..\u003C/p\u003E\u003Cp\u003E..would be cool.. :-)\u003C/p\u003E\u003Cp\u003Eby the way - it\u0027s not exactly DS9 but inspired - obviousely..\u003C/p\u003E\u003Cp\u003Eit\u0027s 100k tonns and holds up to 10\u0027000 Kerbals..\u003C/p\u003E\u003Cp\u003EAt least that is what crew compartment subsystem has calculated..\u003C/p\u003E\u003Cp\u003Emight be a little too much - but I can adjust it\u0027s mass to correct that..\u003C/p\u003E\u003Cp\u003EIt should be big enough to let 3 voyager\u0027s dock at the 3 upper pylons at the same time\u003C/p\u003E\u003Cp\u003Eso - original size.. - needs adjusting now - but it will be..\u003C/p\u003E\u003Cp\u003EDid I mention, I\u0027m megalomaniac muahahahah\u003C/p\u003E\u003Cp\u003EConsider this a new test object - it\u0027s not good enough for an official DS9 replica - but testing voyager\u0027s dockingport should be fun here..\u003C/p\u003E\u003Cp\u003EIt just needs to work and I\u0027ll post a link immediately..\u003C/p\u003E\n"},{"CreatedByName":"mjy","CreatedById":69956,"CreatedDateTime":"2014-07-04T21:59:19Z","Content":"\n\u003Cp\u003Eyour mesh collider isn\u0060t set right, so u can\u0060t click it.\u003C/p\u003E\u003Cp\u003Edid your mesh when in unity is what color?when I added a collision= mesh collider, for me its blue and turns green when I click convex, need that for ksp, any other don\u0060t work. best way to add a collision is use what is closest to your original mesh in size, I mean is if u got a complicated mesh u can use that same mesh for the collision, to much will make stuff lag for nothing, best way when u got your mesh built in 3dmax,etc [i did this for many games, just kind of forgot, but a tut reminded me.]\u003C/p\u003E\u003Cp\u003Eis to make a low poly mesh on top of the model u got built, cover it all up with simple low poly model, try to keep the same diameter as the model u are trying to make\u003C/p\u003E\u003Cp\u003Eit can be more then 1 pieces, as I will for mine. in unity put the collision, click convex, then removed the mesh u added for the collision , but u will see the green convex collision is still there.\u003C/p\u003E\u003Cp\u003Eoh by the way, the one way I figured out how to do a cargo baycollision is to add all sides for mesh collider, so 5 pieces of the box, might be another way.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-05T02:39:14Z\u0022 title=\u002207/05/2014 02:39  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 5, 2014\u003C/time\u003E by mjy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-05T05:40:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mjy\u0022 data-cite=\u0022mjy\u0022\u003E\u003Cdiv\u003Eyour mesh collider isn\u0060t set right, so u can\u0060t click it.\u003Cp\u003Edid your mesh when in unity is what color?when I added a collision= mesh collider, for me its blue and turns green when I click convex, need that for ksp, any other don\u0060t work. best way to add a collision is use what is closest to your original mesh in size, I mean is if u got a complicated mesh u can use that same mesh for the collision, to much will make stuff lag for nothing, best way when u got your mesh built in 3dmax,etc [i did this for many games, just kind of forgot, but a tut reminded me.]\u003C/p\u003E\u003Cp\u003Eis to make a low poly mesh on top of the model u got built, cover it all up with simple low poly model, try to keep the same diameter as the model u are trying to make\u003C/p\u003E\u003Cp\u003Eit can be more then 1 pieces, as I will for mine. in unity put the collision, click convex, then removed the mesh u added for the collision , but u will see the green convex collision is still there.\u003C/p\u003E\u003Cp\u003Eoh by the way, the one way I figured out how to do a cargo baycollision is to add all sides for mesh collider, so 5 pieces of the box, might be another way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh I see, these colors make a difference..\u003C/p\u003E\u003Cp\u003EI didn\u0027t even realize that there are different colors until you mentioned this - I\u0027m allways working late night and never sober - that might explain stuff lol\u003C/p\u003E\u003Cp\u003Ewill try it soon - currently reworking the texturing and UVs - so I have to try later - but thanks...\u003C/p\u003E\u003Cp\u003EI got the right click working by now, without convex - but the collider is just a small sphere at the CoM and it ignored my pylons..\u003C/p\u003E\u003Cp\u003E90% of the model goes below ground - I guess that was the missing convex and maybe some scaling screw up..\u003C/p\u003E\u003Cp\u003Ethanks..\u003C/p\u003E\u003Cp\u003ENow that you mention the shuttle bay..\u003C/p\u003E\u003Cp\u003Edo colliders also have \u0022normals\u0022 in Unity - they do in the game engine Ogre for example?\u003C/p\u003E\u003Cp\u003EIf yes, could it be, that your box collider just had it\u0027s normals outside instead of inside?\u003C/p\u003E\u003Cp\u003EI made buildings for other games - and there I had to make a double sided collider to make the wall solid from both sides..\u003C/p\u003E\u003Cp\u003Ecould that be the same issue for you? If so, select your collider in blender or what ever and look for the option \u0022recalculate outside\u0022 - but I guess that part you know..\u003C/p\u003E\u003Cp\u003EBy the way - the whole DS9 like model has 1160 Verteces and 1141 Faces..\u003C/p\u003E\u003Cp\u003EI have not one single vertex I could remove to make it \u0022lower\u0022 poly..\u003C/p\u003E\u003Cp\u003Eit is allready a absolute low poly mesh..\u003C/p\u003E\u003Cp\u003Eno details at all..\u003C/p\u003E\u003Cp\u003EIf I use a less detailed collider, you would not be able to fly through the open parts in the structure - so 1141 for the collider is the best I can give you..\u003C/p\u003E\u003Cp\u003Ehowever - the whole package has about 530Kb with model and texture - so I don\u0027t think lag is going to be my problem..\u003C/p\u003E\u003Cp\u003EAfter all it\u0027s a huge space station.. - for ~500Kb - should be cheap..\u003C/p\u003E\u003Cp\u003EI hope the reality won\u0027t prove me wrong lol - we will see..\u003C/p\u003E\u003Cp\u003EPlugin News:\u003C/p\u003E\u003Cp\u003EI\u0027m close to releasing Beta5..\u003C/p\u003E\u003Cp\u003Ebig improovements for the GUI and new stable powersystem..\u003C/p\u003E\n"},{"CreatedByName":"mjy","CreatedById":69956,"CreatedDateTime":"2014-07-05T20:15:16Z","Content":"\n\u003Cp\u003Enot sure how the collision works for this game yet with unity, I know u got to click convex , highlights it green for me,\u003C/p\u003E\u003Cp\u003Ewell after almost 2 weeks I got my Daedalus going, custom made from me and I added a few freeware parts to it like guns, etc, to lazy to do them. its around 25-30 k polygone, wanted it lower, but almost impossible to get it that low,[10 k] finally go a working animation, first time ever, easier with this game. need to add texture to the Daedalus. engines are on it also, which makes it higher by 5 k.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://cloud-4.steampowered.com/ugc/43098445064049753/4A5D2FC9C21B72BA49213E0BCC3547DAAF8EB015/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://cloud-4.steampowered.com/ugc/43098445064049753/4A5D2FC9C21B72BA49213E0BCC3547DAAF8EB015/\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-05T20:17:57Z\u0022 title=\u002207/05/2014 08:17  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 5, 2014\u003C/time\u003E by mjy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spork of Doom","CreatedById":104262,"CreatedDateTime":"2014-07-05T20:56:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mjy\u0022 data-cite=\u0022mjy\u0022\u003E\u003Cdiv\u003Enot sure how the collision works for this game yet with unity, I know u got to click convex , highlights it green for me,\u003Cp\u003Ewell after almost 2 weeks I got my Daedalus going, custom made from me and I added a few freeware parts to it like guns, etc, to lazy to do them. its around 25-30 k polygone, wanted it lower, but almost impossible to get it that low,[10 k] finally go a working animation, first time ever, easier with this game. need to add texture to the Daedalus. engines are on it also, which makes it higher by 5 k.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://cloud-4.steampowered.com/ugc/43098445064049753/4A5D2FC9C21B72BA49213E0BCC3547DAAF8EB015/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://cloud-4.steampowered.com/ugc/43098445064049753/4A5D2FC9C21B72BA49213E0BCC3547DAAF8EB015/\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat looks GREAT mjy. The Daedalus is easily one of my favorite sci-fi ships. I can\u0027t wait to try it out when your done. I saw one tread were someone started working on a puddle jumper but there hasn\u0027t been any word on it for a while now. Would be pretty sweet if that\u0027s get done to go with your ship. combined with the LCARS plugin to store the puddle jumpers (if the author finishes it) in the hanger bays.\u003C/p\u003E\n"},{"CreatedByName":"mjy","CreatedById":69956,"CreatedDateTime":"2014-07-06T02:45:20Z","Content":"\n\u003Cp\u003Ety, u can blame phil and starvision \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, for the inspiration to get me back to modding, well I really didn\u0060t take the easiest of ship to start out lol, tried it in ksp, works great,\u003C/p\u003E\u003Cp\u003Eneed to add texture and collision. it got the 4 cargo bays and I added a front cargo bay to capture orbit stuff. I took out the engines, to much for this game at 5 k poly, added low poly ones for now.\u003C/p\u003E\u003Cp\u003Ecan\u0060t wait to try out the new pluging, the other one works great, added bonus stuff will be nice.\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-06T05:03:45Z","Content":"\n\u003Cp\u003Emjy - that looks great - can\u0027t wait to test this..\u003C/p\u003E\u003Cp\u003Edo you need a beta tester? *looking-totally-unsuspiciouse-in-different-directions*\u003C/p\u003E\u003Cp\u003EFinally now, I got that green marker color in unity - I hope it works now - currently loading KSP..\u003C/p\u003E\u003Cp\u003EIt seems, my choices have gotten small - code that cargo bay or gtfo - right?\u003C/p\u003E\u003Cp\u003Elol\u003C/p\u003E\u003Cp\u003Ewill do next - but as with many other features before, I have no clue how to do it, be patient..\u003C/p\u003E\u003Cp\u003EI can\u0027t even garantee, that it will work afterall..\u003C/p\u003E\u003Cp\u003EEL is not known for stability - and an explosion rate of 80% (what I had with my launchpads in minmus orbit) would be totally unacceptable for me..\u003C/p\u003E\u003Cp\u003Eahh game has loaded - hang on..\u003C/p\u003E\u003Cp\u003Ebahh - still no luck..\u003C/p\u003E\u003Cp\u003EI made a great texture (works in game) and redid the model - also added bump map (not shown in game) and managed to get original dimensions (1.4~Km)\u003C/p\u003E\u003Cp\u003Ebut stil collider seems to be only a tiny one at the CoM and additionally the half of my mesh is gone ?#@\u003C/p\u003E\u003Cp\u003Eomg - coding is sooo much easier..\u003C/p\u003E\u003Cp\u003Ehowever - where was I - ahh right - next on the list cargo bay..\u003C/p\u003E\u003Cp\u003Esounds legit..\u003C/p\u003E\n"},{"CreatedByName":"mjy","CreatedById":69956,"CreatedDateTime":"2014-07-06T05:45:43Z","Content":"\n\u003Cp\u003Ethis is the tut I used ,worked good.for unity\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/EFWF6Qv9Dhk?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-06T07:09:25Z","Content":"\n\u003Cp\u003EWill have a look thanks..\u003C/p\u003E\u003Cp\u003Eanyway.. I think I\u0027ve made it allready..\u003C/p\u003E\u003Cp\u003Ethe only thing it does not have is ground collision - but everything else explodes on fast contact..\u003C/p\u003E\u003Cp\u003ENext I\u0027ll probbably attack animations and add a cargobay.. - I guess lol\u003C/p\u003E\u003Cp\u003EI\u0027ll include this station in the next beta release..\u003C/p\u003E\u003Cp\u003EIt\u0027s not that simple to place docking ports on it I had to realize lol - after all it\u0027s 1.4Km.\u003C/p\u003E\n"},{"CreatedByName":"Spork of Doom","CreatedById":104262,"CreatedDateTime":"2014-07-06T15:36:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022philotical\u0022 data-cite=\u0022philotical\u0022\u003E\u003Cdiv\u003EWill have a look thanks..\u003Cp\u003Eanyway.. I think I\u0027ve made it allready..\u003C/p\u003E\u003Cp\u003Ethe only thing it does not have is ground collision - but everything else explodes on fast contact..\u003C/p\u003E\u003Cp\u003ENext I\u0027ll probbably attack animations and add a cargobay.. - I guess lol\u003C/p\u003E\u003Cp\u003EI\u0027ll include this station in the next beta release..\u003C/p\u003E\u003Cp\u003EIt\u0027s not that simple to place docking ports on it I had to realize lol - after all it\u0027s 1.4Km.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice more massive station parts to add to the already ridiculously large 2500m Stanford Torus station parts. This is going to be good. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-07T04:36:07Z","Content":"\n\u003Cp\u003EBeta5 can be downloaded from the first posts link..\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIMPORTANT!!!:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou need to edit all cfg file of all impulse vessels..\u003C/p\u003E\u003Cp\u003Efinally the \u0022BIG renaming\u0022 is done - for the most part at least..\u003C/p\u003E\u003Cp\u003EThe new module names are mentioned in the readme in the download..\u003C/p\u003E\u003Cp\u003Ein case you want them here:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_ImpulseDrive\u003Cbr\u003E        RESOURCE\u003Cbr\u003E        {\u003Cbr\u003E            name = ElectricCharge\u003Cbr\u003E            rate = 0.1\u003Cbr\u003E        }\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_ShuttleBay\u003Cbr\u003E        volume = 450\u003Cbr\u003E    }\u003Cbr\u003E   MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_CargoBay\u003Cbr\u003E        maxTonnage = 200\u003Cbr\u003E    }\u003Cbr\u003E     MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_CloakingDevice\u003Cbr\u003E    }\u003Cbr\u003E     MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_StructuralIntegrityField\u003Cbr\u003E    }\u003Cbr\u003E   MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_FuelTransfer\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_CrewQuartier\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_TransporterSystem\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_WeaponSystems\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_PhotonTorpedo\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = LCARS_TractorBeam\u003Cbr\u003E    }\u003Cbr\u003E\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Ethe visibility of new features is quite limited this time..\u003C/p\u003E\u003Cp\u003ECloak - deactivated until something works..\u003C/p\u003E\u003Cp\u003EStructural Field - deactivated until a little more works\u003C/p\u003E\u003Cp\u003Ebut the Subsystem GUI rework is progressing well I think..\u003C/p\u003E\u003Cp\u003Ethe nav bar on top is due to be made right - but other than that..\u003C/p\u003E\u003Cp\u003Efor example: The subsystem panel does resize back to smaller now if you close something - may take a max. of 10 seconds but it does..\u003C/p\u003E\u003Cp\u003EThe power system was made new once more - now we can (soon) have detailed stats, wich subsystem used how much power..\u003C/p\u003E\u003Cp\u003EData is allready collected - just need to make a gui for this - that\u0027s all..\u003C/p\u003E\u003Cp\u003EI still would appreciate dozens of reports if there are further bugs in:\u003C/p\u003E\u003Cp\u003E- Transporter (I know of the leak - but anything else)\u003C/p\u003E\u003Cp\u003E- Tricorder\u003C/p\u003E\u003Cp\u003E- tractor beam\u003C/p\u003E\u003Cp\u003E- tactical\u003C/p\u003E\u003Cp\u003E- fuel transfer\u003C/p\u003E\u003Cp\u003E- fuel tanks\u003C/p\u003E\u003Cp\u003E- crew quartiers\u003C/p\u003E\u003Cp\u003E- Formation mode etc..\u003C/p\u003E\u003Cp\u003EDoes that stuff work or not?\u003C/p\u003E\u003Cp\u003EHere most works, but I can\u0027t test it in all situations - I rarly play the game at all since weeks - just coding - so I\u0027d appreciate the participation on this end..\u003C/p\u003E\u003Cp\u003EThank\u0027s for the support..\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spork of Doom\u0022 data-cite=\u0022Spork of Doom\u0022\u003E\u003Cdiv\u003Emassive station parts\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOhh btw - as promised - the package contains the Cardi Station..\u003C/p\u003E\u003Cp\u003EIt\u0027s still WIP - I\u0027m not as pleased as I want to be - but it does allready use a lot of space in space..\u003C/p\u003E\u003Cp\u003Elol - and it\u0027s below 1 MB..\u003C/p\u003E\u003Cp\u003EHave fun and report back if you find a bug, or the big karma guy in the briar patch named Sirok will reduce your replicator credits for this week by 0.1 credits..\u003C/p\u003E\u003Cp\u003ESo you see, you just have to report back or you will be totally broke on replicator credits when you reach the briar patch..\u003C/p\u003E\u003Cp\u003EDon\u0027t know what I\u0027m talking about?\u003C/p\u003E\u003Cp\u003Egoogle for \u0022Hidden Frontier\u0022\u003C/p\u003E\u003Cp\u003E..or just click here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://star-trek-fan-fiction.tumblr.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://star-trek-fan-fiction.tumblr.com/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"StarVision","CreatedById":44592,"CreatedDateTime":"2014-07-07T05:46:07Z","Content":"\n\u003Cp\u003EI\u0027m back for a couple days before I leave again, So I hope I can get some stuff done. Things are looking great.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022philotical\u0022 data-cite=\u0022philotical\u0022\u003E\u003Cdiv\u003EWill have a look thanks..\u003Cp\u003Eanyway.. I think I\u0027ve made it allready..\u003C/p\u003E\u003Cp\u003Ethe only thing it does not have is ground collision - but everything else explodes on fast contact..\u003C/p\u003E\u003Cp\u003ENext I\u0027ll probbably attack animations and add a cargobay.. - I guess lol\u003C/p\u003E\u003Cp\u003EI\u0027ll include this station in the next beta release..\u003C/p\u003E\u003Cp\u003EIt\u0027s not that simple to place docking ports on it I had to realize lol - after all it\u0027s 1.4Km.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou say the thing does not have ground collision? Do you have the collider set to convex? Post a screenshot or something, then maybe it can get figured out. It\u0027s looking pretty cool.\u003C/p\u003E\u003Cp\u003Emjy:\u003C/p\u003E\u003Cp\u003EThe Daedalus is looking really good. I have not seen much of Stargate, but it looks cool regardless. I\u0027m glad you got back into modding (and that I helped).\u003C/p\u003E\u003Cp\u003ELast weekend I started working on something after seeing Justin Kerbice\u0027s Flying Saucer. I was inspired to create my own. It\u0027s modeled after the C-57-D Space Cruiser, with a few changes. I\u0027m still not sure if I want the lights on there. Which would everyone else prefer? Also here\u0027s a few screenshots:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/8Pkod\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is what it looks like without lights:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3zOpEZi.png\u0022 alt=\u00223zOpEZi.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-07T06:01:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spork of Doom\u0022 data-cite=\u0022Spork of Doom\u0022\u003E\u003Cdiv\u003ENice more massive station parts to add to the already ridiculously large 2500m Stanford Torus station parts. This is going to be good. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StarVision\u0022 data-cite=\u0022StarVision\u0022\u003E\u003Cdiv\u003EI\u0027m back for a couple days before I leave again, So I hope I can get some stuff done. Things are looking great.\u003Cp\u003EYou say the thing does not have ground collision? Do you have the collider set to convex? Post a screenshot or something, then maybe it can get figured out. It\u0027s looking pretty cool.\u003C/p\u003E\u003Cp\u003Emjy:\u003C/p\u003E\u003Cp\u003EThe Daedalus is looking really good. I have not seen much of Stargate, but it looks cool regardless. I\u0027m glad you got back into modding (and that I helped).\u003C/p\u003E\u003Cp\u003ELast weekend I started working on something after seeing Justin Kerbice\u0027s Flying Saucer. I was inspired to create my own. It\u0027s modeled after the C-57-D Space Cruiser, with a few changes. I\u0027m still not sure if I want the lights on there. Which would everyone else prefer? Also here\u0027s a few screenshots:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/8Pkod\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/8Pkod\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is what it looks like without lights:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/3zOpEZi.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/3zOpEZi.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey look who\u0027s back.. :-)\u003C/p\u003E\u003Cp\u003Ejust posted beta5 - it\u0027s in there - if you want the blend just drop a word..\u003C/p\u003E\u003Cp\u003EIf I go on convex, the green marked collision mesh disspears in unity..\u003C/p\u003E\u003Cp\u003Emjy said it should be green - it also works different here than in the tut vid he sent - I had seen that allready for the torpedo - but for DS9 it does not work as it should..\u003C/p\u003E\u003Cp\u003Emaybe I have a different version or I just need more time practicing..\u003C/p\u003E\u003Cp\u003EUFO:\u003C/p\u003E\u003Cp\u003Elights are cool - maybe a bit smaller, less obnoxiouse if you think it\u0027s needed - but those lights are cool. - I like them..\u003C/p\u003E\u003Cp\u003ECargoBay/Shuttle Bay:\u003C/p\u003E\u003Cp\u003Eplease - we need to talk while your here..\u003C/p\u003E\u003Cp\u003EI need some info about unity features - I\u0027m sure together we can figure out the best way..\u003C/p\u003E\u003Cp\u003EI think it will be needed to add a \u0022trigger\u0022 to the shuttle bay parts to make it work..\u003C/p\u003E\u003Cp\u003Ethat is, if I understood correctly what a trigger mesh does..\u003C/p\u003E\u003Cp\u003EIf yes, that would be a required step for a working shuttle bay part..\u003C/p\u003E\u003Cp\u003EI\u0027m sure you can confirm or destroy my theories with ease..\u003C/p\u003E\u003Cp\u003Ebut now I go to sleep..\u003C/p\u003E\u003Cp\u003Eso no hurry.. - just wanted to warn you :-D\u003C/p\u003E\u003Cp\u003Esee ya\u003C/p\u003E\n"},{"CreatedByName":"StarVision","CreatedById":44592,"CreatedDateTime":"2014-07-07T08:08:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022philotical\u0022 data-cite=\u0022philotical\u0022\u003E\u003Cdiv\u003EHey look who\u0027s back.. :-)\u003Cp\u003Ejust posted beta5 - it\u0027s in there - if you want the blend just drop a word..\u003C/p\u003E\u003Cp\u003EIf I go on convex, the green marked collision mesh disspears in unity..\u003C/p\u003E\u003Cp\u003Emjy said it should be green - it also works different here than in the tut vid he sent - I had seen that allready for the torpedo - but for DS9 it does not work as it should..\u003C/p\u003E\u003Cp\u003Emaybe I have a different version or I just need more time practicing..\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EThe blend file would be great, then I could see if I could fix it. Your Unity scene file would be great as well, then I could actually tell you what was going wrong.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EUFO:\u003C/p\u003E\u003Cp\u003Elights are cool - maybe a bit smaller, less obnoxiouse if you think it\u0027s needed - but those lights are cool. - I like them..\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EThat sounds good. maybe I\u0027ll shrink them to tail light size and only put on a few.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ECargoBay/Shuttle Bay:\u003C/p\u003E\u003Cp\u003Eplease - we need to talk while your here..\u003C/p\u003E\u003Cp\u003EI need some info about unity features - I\u0027m sure together we can figure out the best way..\u003C/p\u003E\u003Cp\u003EI think it will be needed to add a \u0022trigger\u0022 to the shuttle bay parts to make it work..\u003C/p\u003E\u003Cp\u003Ethat is, if I understood correctly what a trigger mesh does..\u003C/p\u003E\u003Cp\u003EIf yes, that would be a required step for a working shuttle bay part..\u003C/p\u003E\u003Cp\u003EI\u0027m sure you can confirm or destroy my theories with ease..\u003C/p\u003E\u003Cp\u003Ebut now I go to sleep..\u003C/p\u003E\u003Cp\u003Eso no hurry.. - just wanted to warn you :-D\u003C/p\u003E\u003Cp\u003Esee ya\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve already thought of this beforehand. It should be like airlocks and ladders. I\u0027ll just add a box collider in the shuttlebay with the correct tags and layers. I can do that tomorrow hopefully. Luckily this week I\u0027ll have my computer, I just won\u0027t be as active as usual, but possibly more productive.\u003C/p\u003E\u003Cp\u003EIn other news, I\u0027ve discovered something in Unity I had never tried before. That is using the opacity values in animations. This will allow the Tardis to fade out, and the Car to cloak (although I\u0027ll probably redo it anyways). Of course Star Trek cloaking is another possibility. All it would take is a simple button to activate an animation and you\u0027d have a cloaking device. I\u0027d probably need to use a plugin for multiple animations, but I think it\u0027s worth it. The next week I\u0027m going to focus on finishing up half finished projects, like the Tardis, the Enterprise, and the Saucer. Then I\u0027ll finally release the whole mod.\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-07T18:28:08Z","Content":"\n\u003Cp\u003ELet me first give you some details about what I was planning:\u003C/p\u003E\u003Cp\u003ECloak has a slider - the more you slide up, the less is visible of the ship and the more power it\u0027ll use.\u003C/p\u003E\u003Cp\u003EThat will alow the cap\u0027tin to make his ship visible for him at least - from far way you won\u0027t see a ship that has 10% opacity in space.\u003C/p\u003E\u003Cp\u003ESo you might know why the following sentence cought my attention..\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u0026gt;That is using the opacity values in animations.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Edo I have to do this in blender first or only in unity?\u003C/p\u003E\u003Cp\u003Ebecause I know I can manipulate animations in script - I\u0027m however stuck with shaders..\u003C/p\u003E\u003Cp\u003Eand my cloaking device needs a new trick or it\u0027s gone..\u003C/p\u003E\u003Cp\u003EIf I got this right, the cloak as you described will only work, if the model has such an animation?\u003C/p\u003E\u003Cp\u003Ethat is bad - too many and complicated requirements for my subsystems will take the fun out for modders..\u003C/p\u003E\u003Cp\u003ECan such an animation be saved \u0022without\u0022 model - if yes, I could try to apply this animation to all parts in the vessel at runtime and hope that works lol\u003C/p\u003E\u003Cp\u003EI tried allready an option named Part.opacity = does nothing as it seems..\u003C/p\u003E\u003Cp\u003EAlso, Ive noticed, I can make the model in unity-editor AND KSP transparent if the unity materials are deactivated/removed (in unity editor set count to 0) - but I don\u0027t seem to be able to modify that on runtime.\u003C/p\u003E\u003Cp\u003EI also hoped to change the texture coorinates to move the UV into a alpha section - but not all textures will have that - KSP does not seem to allow to change the texture itselfe..\u003C/p\u003E\u003Cp\u003Ethat would have been cool - I could just add to dimensions and fill these areas with nothing and then move the UV there.\u003C/p\u003E\u003Cp\u003EThere is a dissolve shader in asset store - but it\u0027s not free and I have no clue how to use shaders in unity or KSP..\u003C/p\u003E\u003Cp\u003EI\u0027ve written/modified my own shaders allready now - but they don\u0027t get used by the game - no idea what I\u0027m missing..\u003C/p\u003E\u003Cp\u003EAlso KSP does not seem to offer possibilities to control such shaders - so I am at a loss there too..\u003C/p\u003E\u003Cp\u003ESiednote: Is anyone here willing to give me a start up hint how to modify/use a shaders and materials in KSP at runtime?\u003C/p\u003E\u003Cp\u003EThe DLL does not seem to contain one single functin related to shaders - well except the \u0022detonations\u0022 and particles - none for gameobjects or parts or vessels.\u003C/p\u003E\u003Cp\u003EI\u0027m at a loss..\u003C/p\u003E\u003Cp\u003Econclusion:\u003C/p\u003E\u003Cp\u003Eif the cloaking device shall work on all ships, we have to make a shader or prefab in unity that is generic and can be used with any ship.\u003C/p\u003E\u003Cp\u003Ethan I need to learn how to controll this prefab/shader in KSP script.\u003C/p\u003E\u003Cp\u003Eif something has to be done on the model to make it possible, I\u0027d rather skip this subsystem and move on..\u003C/p\u003E\u003Cp\u003EWhat are your thoughts?\u003C/p\u003E\u003Cp\u003EAm I making sense here or is it just a noob\u0027s brabble that sucks if you know more than a noob..\u003C/p\u003E\u003Cp\u003ELet me know..\u003C/p\u003E\u003Cp\u003EShuttleBay:\u003C/p\u003E\u003Cp\u003EFacts: I can add colliders/triggers and stuff with c# at runtime\u003C/p\u003E\u003Cp\u003EThese colliders can be unity default meshes (like box, sphere, etc) or I can load them from file as I do for the torpedo mesh.\u003C/p\u003E\u003Cp\u003Eso - if we could make part-independent triggers/shaders - that I can apply at runtime, the model-makers would not have a lot of trouble.\u003C/p\u003E\u003Cp\u003EI guess a generic shader is easier to create than a generic collider since all parts are different..\u003C/p\u003E\u003Cp\u003E(..just asking..)\u003C/p\u003E\u003Cp\u003ETo have it generic, the door/entrance might be the best place to have a trigger ..\u003C/p\u003E\u003Cp\u003EI\u0027d prefere a small area in th middle near the floor (the yellow marker in your texture i.E.) - but generically that is not to find by script.\u003C/p\u003E\u003Cp\u003EA box surrounding the bay can be added by script.\u003C/p\u003E\u003Cp\u003EOr do you think the requirement of such a model addition is no problem for the bay part?\u003C/p\u003E\u003Cp\u003EI mean you all have to do it for ladders and internals - so why not for shuttle bay!\u003C/p\u003E\u003Cp\u003EThe cloak can\u0027t make that requirement - because every part on the vessel would need that special treatment..\u003C/p\u003E\u003Cp\u003Eso not an option there in my opinion..\u003C/p\u003E\u003Cp\u003Eit needs to work with stock parts too..\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-07T18:33:54Z\u0022 title=\u002207/07/2014 06:33  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 7, 2014\u003C/time\u003E by philotical\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StarVision","CreatedById":44592,"CreatedDateTime":"2014-07-08T03:57:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022philotical\u0022 data-cite=\u0022philotical\u0022\u003E\u003Cdiv\u003ELet me first give you some details about what I was planning:\u003Cp\u003ECloak has a slider - the more you slide up, the less is visible of the ship and the more power it\u0027ll use.\u003C/p\u003E\u003Cp\u003EThat will alow the cap\u0027tin to make his ship visible for him at least - from far way you won\u0027t see a ship that has 10% opacity in space.\u003C/p\u003E\u003Cp\u003ESo you might know why the following sentence cought my attention..\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u0026gt;That is using the opacity values in animations.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Edo I have to do this in blender first or only in unity?\u003C/p\u003E\u003Cp\u003Ebecause I know I can manipulate animations in script - I\u0027m however stuck with shaders..\u003C/p\u003E\u003Cp\u003Eand my cloaking device needs a new trick or it\u0027s gone..\u003C/p\u003E\u003Cp\u003EIf I got this right, the cloak as you described will only work, if the model has such an animation?\u003C/p\u003E\u003Cp\u003Ethat is bad - too many and complicated requirements for my subsystems will take the fun out for modders..\u003C/p\u003E\u003Cp\u003ECan such an animation be saved \u0022without\u0022 model - if yes, I could try to apply this animation to all parts in the vessel at runtime and hope that works lol\u003C/p\u003E\u003Cp\u003EI tried allready an option named Part.opacity = does nothing as it seems..\u003C/p\u003E\u003Cp\u003EAlso, Ive noticed, I can make the model in unity-editor AND KSP transparent if the unity materials are deactivated/removed (in unity editor set count to 0) - but I don\u0027t seem to be able to modify that on runtime.\u003C/p\u003E\u003Cp\u003EI also hoped to change the texture coorinates to move the UV into a alpha section - but not all textures will have that - KSP does not seem to allow to change the texture itselfe..\u003C/p\u003E\u003Cp\u003Ethat would have been cool - I could just add to dimensions and fill these areas with nothing and then move the UV there.\u003C/p\u003E\u003Cp\u003EThere is a dissolve shader in asset store - but it\u0027s not free and I have no clue how to use shaders in unity or KSP..\u003C/p\u003E\u003Cp\u003EI\u0027ve written/modified my own shaders allready now - but they don\u0027t get used by the game - no idea what I\u0027m missing..\u003C/p\u003E\u003Cp\u003EAlso KSP does not seem to offer possibilities to control such shaders - so I am at a loss there too..\u003C/p\u003E\u003Cp\u003ESiednote: Is anyone here willing to give me a start up hint how to modify/use a shaders and materials in KSP at runtime?\u003C/p\u003E\u003Cp\u003EThe DLL does not seem to contain one single functin related to shaders - well except the \u0022detonations\u0022 and particles - none for gameobjects or parts or vessels.\u003C/p\u003E\u003Cp\u003EI\u0027m at a loss..\u003C/p\u003E\u003Cp\u003Econclusion:\u003C/p\u003E\u003Cp\u003Eif the cloaking device shall work on all ships, we have to make a shader or prefab in unity that is generic and can be used with any ship.\u003C/p\u003E\u003Cp\u003Ethan I need to learn how to controll this prefab/shader in KSP script.\u003C/p\u003E\u003Cp\u003Eif something has to be done on the model to make it possible, I\u0027d rather skip this subsystem and move on..\u003C/p\u003E\u003Cp\u003EWhat are your thoughts?\u003C/p\u003E\u003Cp\u003EAm I making sense here or is it just a noob\u0027s brabble that sucks if you know more than a noob..\u003C/p\u003E\u003Cp\u003ELet me know..\u003C/p\u003E\u003Cp\u003EShuttleBay:\u003C/p\u003E\u003Cp\u003EFacts: I can add colliders/triggers and stuff with c# at runtime\u003C/p\u003E\u003Cp\u003EThese colliders can be unity default meshes (like box, sphere, etc) or I can load them from file as I do for the torpedo mesh.\u003C/p\u003E\u003Cp\u003Eso - if we could make part-independent triggers/shaders - that I can apply at runtime, the model-makers would not have a lot of trouble.\u003C/p\u003E\u003Cp\u003EI guess a generic shader is easier to create than a generic collider since all parts are different..\u003C/p\u003E\u003Cp\u003E(..just asking..)\u003C/p\u003E\u003Cp\u003ETo have it generic, the door/entrance might be the best place to have a trigger ..\u003C/p\u003E\u003Cp\u003EI\u0027d prefere a small area in th middle near the floor (the yellow marker in your texture i.E.) - but generically that is not to find by script.\u003C/p\u003E\u003Cp\u003EA box surrounding the bay can be added by script.\u003C/p\u003E\u003Cp\u003EOr do you think the requirement of such a model addition is no problem for the bay part?\u003C/p\u003E\u003Cp\u003EI mean you all have to do it for ladders and internals - so why not for shuttle bay!\u003C/p\u003E\u003Cp\u003EThe cloak can\u0027t make that requirement - because every part on the vessel would need that special treatment..\u003C/p\u003E\u003Cp\u003Eso not an option there in my opinion..\u003C/p\u003E\u003Cp\u003Eit needs to work with stock parts too..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see what you mean with the animation. I\u0027m not really sure if it\u0027s possible to apply an animation. \u003C/p\u003E\u003Cp\u003EI do have one possibility. When I was testing the Tardis, I noticed that you could not see Voyager through it, just the stars. I might be able to create a box that has an opacity of 0, then you could just create that model around the ship, rendering it invisible. One problem is you might be able to zoom inside of it, so I\u0027m not sure.\u003C/p\u003E\u003Cp\u003ERegarding the shuttlebay: It\u0027s not like I\u0027m going to be modeling many of them. Creating the collider is really easy. Just tell me how you want it and I can get it done. Also I\u0027ve got the exterior of the Tardis done in-game now, including a take-off animation made possible by BahamutoD\u0027s plugin.\u003C/p\u003E\n"},{"CreatedByName":"philotical","CreatedById":109390,"CreatedDateTime":"2014-07-08T08:58:54Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ENew Version:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELCARS-Beta5b-08.07.2014.zip \u003C/strong\u003E- link is in first post..\u003C/p\u003E\u003Cp\u003Ejust overwrite the plugin..\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EChange log:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFixed a bug that prevented Tricirder from working\u003C/p\u003E\u003Cp\u003EFixed a bug that prevented Tricorder Transporter Link Up from working\u003C/p\u003E\u003Cp\u003EAdded Tricorder Auxiliary Helm Link Up!\u003C/p\u003E\u003Cp\u003EAdded base of new subsystem: Sensor Array\u003C/p\u003E\u003Cp\u003EAdded Subsystem: Power System\u003C/p\u003E\u003Cp\u003EFinished the rework of Subsystem GUI Layout. It\u0027s much easier to handle now..\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@StarVision\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnimation/Cloak:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI guess you are right..\u003C/p\u003E\u003Cp\u003Ehow well do you know your way with shaders..\u003C/p\u003E\u003Cp\u003EI have severlal transparancy shaders - but I don\u0027t know how to use/animate them..\u003C/p\u003E\u003Cp\u003EShall I send them to you?\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECardassian Station:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIve added now shape key animations in blender and internals for the shuttle bay..\u003C/p\u003E\u003Cp\u003Ebut in unity I have a complete mess with Animations, Animators and Animation controllers..\u003C/p\u003E\u003Cp\u003Eno clue what is what so far..\u003C/p\u003E\u003Cp\u003E..will try to learn more soon..\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eshuttlebay:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Egot you..\u003C/p\u003E\u003Cp\u003Ebut - I don\u0027t know what I \u0022need\u0022 - I have some ideas how it might work - but I don\u0027t know if those are the best way to do..\u003C/p\u003E\u003Cp\u003EI was hoping your unity experiance could shed some more light on the issue..\u003C/p\u003E\u003Cp\u003EWhat would you see as the best way and why?\u003C/p\u003E\u003Cp\u003EAll my knowledge of triggers and collision meshes are from other game engines.. - and also there quite limited..\u003C/p\u003E\u003Cp\u003EDo you have any experiance that could help figure the best way to go?\u003C/p\u003E\u003Cp\u003EI aquired some knowledge in KSP coding - but unity-editor and all it\u0027s features is still a book in ancient greek to me - and will stay for weeks..\u003C/p\u003E\u003Cp\u003EI know the API, you know the editor - the shuttle bay needs both sides - so both of us are in trouble to set the right way..\u003C/p\u003E\u003Cp\u003Etogether we might make it.. - though I need to double check all your suggestions in the API to see if I have the access to the stuff you sugest.. and vice versa\u003C/p\u003E\u003Cp\u003E..and honestly - don\u0027t expect much suggestions for unity editor from me lol\u003C/p\u003E\u003Cp\u003E..not yet..\u003C/p\u003E\n"},{"CreatedByName":"StarDrive85","CreatedById":103372,"CreatedDateTime":"2014-07-09T13:52:15Z","Content":"\n\u003Cp\u003Ehave you finished working on voyager then?\u003C/p\u003E\n"},{"CreatedByName":"StarVision","CreatedById":44592,"CreatedDateTime":"2014-07-09T18:54:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022philotical\u0022 data-cite=\u0022philotical\u0022\u003E\u003Cdiv\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not really sure what to do with shaders. Aside from the default KSP ones I have no idea, and even then I know very little. Regarding animations, you can only have one per part, and you have to make sure it\u0027s set to legacy when importing. Just look through the stickied tutorial thread and you\u0027ll know what I mean. Also I got the model working in-game fine, but there\u0027s something you should do that is crucial. Separate the model into several pieces. If you\u0027re using convex colliders You\u0027ll need to separate it, otherwise ships won\u0027t be able to get inside the station pylons. Another solution is to have non-convex colliders, but then you\u0027d need convex somewhere, otherwise it won\u0027t collide with the ground.\u003C/p\u003E\u003Cp\u003EBasically look into the tutorial thread.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StarDrive85\u0022 data-cite=\u0022StarDrive85\u0022\u003E\u003Cdiv\u003Ehave you finished working on voyager then?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not really sure. I guess I still have to fix some texture issues, and maybe up the quality on the windows. Aside from that I think it\u0027s basically done. I\u0027ll probably release Voyager apart from the plugin in the main thread, then there can be a module manager config to add Impulse drive support.\u003C/p\u003E\n"}]}