{"TopicId":36458,"ForumId":36,"TopicTitle":"SteamGauges Beta release 1.6.1b [27 Dec]","CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-07-09T18:23:50Z","PageNum":4,"Articles":[{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-12-17T00:25:42Z","Content":"\n\u003Cp\u003EFeel free to PM me the equations. I did some work along a direct solution as well, but didn\u0027t ever get a good solution. I agree it isn\u0027t super efficient, and there\u0027s still a bug or two. The good news is, I did get the changes to the Orbital gauge that people were looking for worked out, and they should be ready for the 0.23 release (tomorrow or Wed).\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-12-20T00:26:40Z","Content":"\n\u003Cp\u003EVersion 1.4 Beta 2 release is now available!\u003C/p\u003E\u003Cp\u003ENo compatible with 0.23.\u003C/p\u003E\u003Cp\u003EThe suicide burn calculations are now much cleaner thanks to some good maths from Hetsin. Functionality is unchanged except that auto cutoff will now cut any burn, not just automated ones.\u003C/p\u003E\u003Cp\u003EThe Node Gauge now has very similar automation functions to the radar altimeter. There is an auto burn start and stop function, accessed through obvious buttons on the gauge. It starts the burn (when armed) at 0 on the countdown as long as your are within 2 degrees of the burn vector. It continues burning until delta V is within 0.5 m/s of the target or the nose moves off more than 7.2 degrees. Like the RA, it will automatically cutoff a manually initiated burn. Enjoy!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://skydrive.live.com/redir?resid=131B3D0DB2B5645E%21118\u0022 rel=\u0022external nofollow\u0022\u003EDownload.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-12-25T05:07:06Z","Content":"\n\u003Cp\u003EVersion 1.4 Beta 3 release is now available!\u003C/p\u003E\u003Cp\u003EIntroducing the newest gauge, the Air Guage. Mostly an airspeed indicator, but with a few bonuses.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HhldAJM.jpg\u0022 alt=\u0022HhldAJM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EToolbar 1.2.2 included.\u003C/p\u003E\u003Cp\u003EThe outer ring displays calibrated airspeed in hundreds of meters per second. Note that CAS is pressure dependent, and will decrease with altitude. The HUD can be toggled between CAS and TAS (KSP\u0027s reported surface velocity).\u003C/p\u003E\u003Cp\u003EThe current Mach number is displayed at the top of the inner gauge.\u003C/p\u003E\u003Cp\u003EBellow that is the current Angle of Attack. Based on the critical AoA (default 25, editable in the settings window), the STALL warning will illuminate.\u003C/p\u003E\u003Cp\u003EAt the bottom of the gauge is the air intake efficiency. The green portion of the gauge is 200% to 600% of the current required amount of intake air. The yellow portion is 100% to 200%, and the red portion is below 100%. If the needle falls into the red, expect an engine flameout is immanent.\u003C/p\u003E\u003Cp\u003EThis gauge is only active in atmosphere, and is probably only meaningful in Kerbin\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://skydrive.live.com/redir?resid=131B3D0DB2B5645E%21118\u0022 rel=\u0022external nofollow\u0022\u003EDownload link.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-12-27T06:27:02Z","Content":"\n\u003Cp\u003EVersion 1.4 Beta 4 release is now available!\u003C/p\u003E\u003Cp\u003EQuick update for terminal velocity indications.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60863-0-23-0-Toolbar-1-3-0-Common-API-for-draggable-resizable-buttons-toolbar\u0022 rel=\u0022external nofollow\u0022\u003EBlizzy\u0027s Toolbar 1.3.0 included\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETerminal velocity is now displayed on the Air Gauge and the HUD\u0027s airspeed tape. The hashed maker or Vt\u0026gt; maker indicate terminal velocity at the current altitude. (The HUD will only display Vt up to 4000 m/s. If that limitation impacts you let me know, I can bump it up to the rest of the airspeed tape if you really want it.)\u003C/p\u003E\u003Cp\u003EThe Air Gauge can now be toggled between displaying CAS and TAS. Just click the button!\u003C/p\u003E\u003Cp\u003EUpdated gauge architecture (internal). If you notice any strange behaviors, this is probably the cause. Please let me know!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://skydrive.live.com/redir?resid=131B3D0DB2B5645E%21118\u0022 rel=\u0022external nofollow\u0022\u003EDownload link.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-12-27T08:45:07Z","Content":"\n\u003Cp\u003EIs there any point in all that CAS complexity over EAS? KSP crafts already can display altitude and velocity in complete vacuum, so they obviously use some kind of computer in there, and thus can compute EAS. FAR has an option to make the navball display EAS too.\u003C/p\u003E\u003Cp\u003EP.S. I\u0027ve just prepared a patch yesterday to make the gauge talk to FAR if it\u0027s installed to get the right density and mach numbers from it, but now I\u0027ll have to update and test it again first before sending - plus add terminal velocity too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-27T09:22:44Z\u0022 title=\u002212/27/2013 09:22  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 27, 2013\u003C/time\u003E by a.g.\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lincourtl","CreatedById":72218,"CreatedDateTime":"2013-12-27T15:16:32Z","Content":"\n\u003Cp\u003EThanks for the great addon. If it were the radar altimeter alone, the download would still be worth it. \u003C/p\u003E\u003Cp\u003EOne minor note: In your recent releases you\u0027ve been leaving the Thumbs.db file in every folder. I\u0027m not sure it affects anything, but I thought I\u0027d mention it anyway.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gVVQK4B.jpg\u0022 alt=\u0022gVVQK4B.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Abrexus","CreatedById":24715,"CreatedDateTime":"2013-12-27T16:38:10Z","Content":"\n\u003Cp\u003EI love you! Thanks so much for the air intake gauge!\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2013-12-28T22:30:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lincourtl\u0022 data-cite=\u0022lincourtl\u0022\u003E\u003Cdiv\u003EThanks for the great addon. If it were the radar altimeter alone, the download would still be worth it. \u003Cp\u003EOne minor note: In your recent releases you\u0027ve been leaving the Thumbs.db file in every folder. I\u0027m not sure it affects anything, but I thought I\u0027d mention it anyway.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re welcome.\u003C/p\u003E\u003Cp\u003EIt looks like that\u0027s the system\u0027s thumbnail file for all the textures. It doesn\u0027t show up in the folder once extracted (even with hidden files shown). If you do see it, it should be safe to delete though. Obviously the game doesn\u0027t need the thumbnails at all.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-01-08T20:10:53Z","Content":"\n\u003Cp\u003EIs it possible to keep track if our trajectory intersects with some terrain ABOVE sea level?\u003C/p\u003E\u003Cp\u003EFor example, low orbit over some moon, and mountain ahead us. \u003C/p\u003E\u003Cp\u003EIf yes, some counter, time to collision or something, woudl be nice.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-01-08T21:48:18Z","Content":"\n\u003Cp\u003EYeah, I\u0027m sure its possible. That being said, with the current beta versions that shouldn\u0027t be a huge issue unless you\u0027re doing some \u003Cem\u003Ereally\u003C/em\u003E low orbits. Or not using the orbital gauge/radar altimeter. If your Ap/Pe show a red or yellow light, you\u0027re probably in trouble. Also, the RA shows a time to impact and suicide altitude if you\u0027re on a descent path towards an airless world (though this is strictly vertical, so at high surface velocities it could be way off).\u003C/p\u003E\u003Cp\u003EThat\u0027s my intent anyway. If you\u0027re in a shallow orbit with a low Pe without a red or yellow light, please let me know (I might have to update my altitudes). If I do extend the RA\u0027s calculations to do atmosphere stuff, I may do some more work with actual trajectory, but that isn\u0027t on my short list. If I\u0027m way off of what you\u0027re thinking, please let me know that as well.\u003C/p\u003E\u003Cp\u003EBreak.\u003C/p\u003E\u003Cp\u003EI\u0027m also releasing 1.4 beta 5 today.\u003C/p\u003E\u003Cp\u003EThe biggest change is some FAR integration. The air gauge and HUD now use FAR data for EAS, terminal velocity, and Mach number. If you don\u0027t have FAR, it uses the stock atmosphere model instead.\u003C/p\u003E\u003Cp\u003ENext, the Air Gauge and HUD now use Equivalent Air Speed instead of Calibrated Air Speed. This is a bit more relevant at high airspeeds and altitudes, but as with CAS it will always be lower than TAS.\u003C/p\u003E\u003Cp\u003EThe Air Gauge now displays a Mach needle (small blue arrow), because its cooler than the digital readout.\u003C/p\u003E\u003Cp\u003EThere were a few performance tweaks to the HUD.\u003C/p\u003E\u003Cp\u003EFinally, the plugin should gracefully handle missing textures.\u003C/p\u003E\u003Cp\u003EIf this seems pretty stable, it might make for a full release, so please let me know if you encounter any problems. Special thanks goes out to a.g (as usual) for the FAR integration.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://skydrive.live.com/redir?resid=131B3D0DB2B5645E%21118\u0022 rel=\u0022external nofollow\u0022\u003EDownload\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-08T21:51:35Z\u0022 title=\u002201/08/2014 09:51  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 8, 2014\u003C/time\u003E by Trueborn\u003C/strong\u003E\n\u003Cbr\u003EForgot the mach needle!\n\u003C/span\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2014-01-08T21:51:22Z","Content":"\n\u003Cp\u003EJust an idea - is it possible to use SteamGauges as a sort of HUD for kerbals during EVA? It would require some sort of first person view to work though but I think this would be very attractive option \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027m talking about something like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GGxwyYg.jpg\u0022 alt=\u0022GGxwyYg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-08T21:54:44Z\u0022 title=\u002201/08/2014 09:54  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 8, 2014\u003C/time\u003E by czokletmuss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-01-08T23:24:08Z","Content":"\n\u003Cp\u003EI think someone already has a first person EVA mod somewhere. The HUD should work fine in it, although I don\u0027t believe it tracks jetpack fuel (which could be arranged). What else would you be looking for in an EVA HUD besides life support, which I don\u0027t believe is standardized enough yet for me to link to.\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2014-01-08T23:32:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trueborn\u0022 data-cite=\u0022Trueborn\u0022\u003E\u003Cdiv\u003EI think someone already has a first person EVA mod somewhere. The HUD should work fine in it, although I don\u0027t believe it tracks jetpack fuel (which could be arranged). What else would you be looking for in an EVA HUD besides life support, which I don\u0027t believe is standardized enough yet for me to link to.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKinda - if you have Lazor on your spacecraft you could switch to FPP during EVA. Life support indeed isn\u0027t standardized enough, although \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58127-0-23-asmi-s-ECLSS-Mod-%28current-version-1-0-15%29-Life-Support-Mod\u0022 rel=\u0022external nofollow\u0022\u003Easmis\u0027s ECLSS 2.0\u003C/a\u003E probably will became quite popular when released.\u003C/p\u003E\u003Cp\u003EWell, besides the obvious (being jetpack fuel) I think also things like:\u003C/p\u003E\u003Cp\u003E- velocity\u003C/p\u003E\u003Cp\u003E- orbit (apoapsis and periapis)\u003C/p\u003E\u003Cp\u003E- current altitude\u003C/p\u003E\u003Cp\u003E- remaining delta-v\u003C/p\u003E\u003Cp\u003E- distance from spacecraft (?)\u003C/p\u003E\u003Cp\u003E- and some kind of a navball showing pro/retrograde, rad\u002B/- and so on would be nice too: constant switching to map and back to make sure you are facing the right direction when trying to make single jetpack to orbit on Minmus/Gilly/Bop/Pol is very annoying\u003C/p\u003E\u003Cp\u003Ewould be cool to have. Thanks for showing interest in this idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-08T23:36:46Z\u0022 title=\u002201/08/2014 11:36  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 8, 2014\u003C/time\u003E by czokletmuss\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-01-08T23:47:40Z","Content":"\n\u003Cp\u003EThe only thing the current HUD won\u0027t do for you is delta V and jetpack fuel. Orbital mode shows you pro/retrograde and rad \u002B/-, Ap/Pe and time to both, velocity, and distance to target (with target cue, anti-target cue, and target velocity vectors). I\u0027ll look into the EVA fuel (already considering a delta V readout of some sort), but otherwise it seems to have you covered.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-01-09T00:25:36Z","Content":"\n\u003Cp\u003EAnnnnd, that\u0027s done. Well, the HUD jetpack fuel readout anyway. In EVA, it replaces the throttle readout. I\u0027ll have to look at jetpack ISP and Kerbal weight before I can crunch delta V though. I\u0027ll probably change the fuel gauge to read out jetpack fuel as well (when appropriate). Unless I need to make any significant changes in this beta though, expect it in the 1.4 stable release.\u003C/p\u003E\n"},{"CreatedByName":"czokletmuss","CreatedById":28063,"CreatedDateTime":"2014-01-09T09:16:41Z","Content":"\n\u003Cp\u003EFantastic! This was probably the quickest modder reaction to someone\u0027s idea on this forum ever \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Thank you very much!\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-01-09T10:57:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trueborn\u0022 data-cite=\u0022Trueborn\u0022\u003E\u003Cdiv\u003EYeah, I\u0027m sure its possible. That being said, with the current beta versions that shouldn\u0027t be a huge issue unless you\u0027re doing some \u003Cem\u003Ereally\u003C/em\u003E low orbits. Or not using the orbital gauge/radar altimeter. If your Ap/Pe show a red or yellow light, you\u0027re probably in trouble. Also, the RA shows a time to impact and suicide altitude if you\u0027re on a descent path towards an airless world (though this is strictly vertical, so at high surface velocities it could be way off).\u003Cp\u003EThat\u0027s my intent anyway. If you\u0027re in a shallow orbit with a low Pe without a red or yellow light, please let me know (I might have to update my altitudes). If I do extend the RA\u0027s calculations to do atmosphere stuff, I may do some more work with actual trajectory, but that isn\u0027t on my short list. If I\u0027m way off of what you\u0027re thinking, please let me know that as well.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think it was somewhere on Ike.. \u003C/p\u003E\u003Cp\u003EYou mentioned updating altitudes, so yellow and red light are toggled if aou orbit is just below specific altitude right?\u003C/p\u003E\u003Cp\u003EBut with specific inclintation, ship can fly next to mountain or even through canyon. And i was wandering if there is any way to detect such terrain obstacles that are high above surface, without just declaring all space above planet of their altitude danger zone.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-01-09T14:01:15Z","Content":"\n\u003Cp\u003ECorrect. I took the highest terrain feature, rounded up to the next 100m or so, and declared that as a \u0022safe\u0022 orbit. I\u0027m still not entirely sure that the orbital gauge is where I would want to put impending terrain impacts anyway.\u003C/p\u003E\u003Cp\u003EI almost want to say that if you plan on orbiting inside a canyon...good luck to you. If you are manually flying, you can use the HUD to see if you are going to clear the terrain in front of you (line up the W with the centerline of your ship, and then just keep the FPV above the mountains). Even better might be terrain following radar or \u003Ca href=\u0022https://en.wikipedia.org/wiki/TAWS\u0022 rel=\u0022external nofollow\u0022\u003ETAWS\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EIt looks like a radar map, but it uses a digital terrain database and shows terrain height relative to vessel altitude. Green stuff is safe, yellow is pretty close to you, and red is above (depending on mode). \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://shop.avionics.co.nz/image/cache/data/Products/sandel/sandel-st3400-topo-600x600.jpg\u0022 alt=\u0022sandel-st3400-topo-600x600.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://shop.avionics.co.nz/image/cache/data/Products/sandel/sandel-st3400-terrain-600x600.jpg\u0022 alt=\u0022sandel-st3400-terrain-600x600.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027m not really planning on doing either of those. What you\u0027re asking for is just some warning to come on if, somewhere in the next orbit the vessel will be below terrain level. I\u0027ll think about it, but no guarantee at this point.\u003C/p\u003E\n"},{"CreatedByName":"Abrexus","CreatedById":24715,"CreatedDateTime":"2014-01-09T15:31:25Z","Content":"\n\u003Cp\u003ETrueborn, I just have to say again what an amazing mod this is. Other than setting up maneuver nodes, I now never have to use the map view to find out the vital information the HUD provides. I have become a much better pilot because of it. Thanks again!\u003C/p\u003E\n"},{"CreatedByName":"Moach","CreatedById":9,"CreatedDateTime":"2014-01-19T08:10:18Z","Content":"\n\u003Cp\u003Ewanted to say a couple of things - \u003C/p\u003E\u003Cp\u003Efirst, this mod is quite possibly become one of my top-very-select-few favourites of all time -- even above MechJeb, IMO (which my main use before was for providing on-the-fly info otherwise available only on the map view as by default)\u003C/p\u003E\u003Cp\u003Ehaving recommended this mod to HarvesteR a few weeks ago, he said it himself: there\u0027s few other mods out there that keep up so well with the \u0022feel\u0022 intended for the game. i.e: Kerbal space science is intended to be a more seat-of-pants experience, rather than something that \u0022should\u0022 be done perhaps \u0022too precisely\u0022 as he finds most mods end up emphasising (even without really meaning to) -- these gauges instead, feel \u0022Kerbal\u0022 in every way!\u003C/p\u003E\u003Cp\u003Eand even though this is just an opinion of his own, and by no means any way of telling people how or not to conduct their own spacefare, I found it was something worth sharing here...\u003C/p\u003E\u003Cp\u003Econgrats!\u003C/p\u003E\u003Cp\u003Eas for me, I find myself more and more moving the Navball to the side (\u003Ca href=\u0022http://kerbalspaceprogram.com/sliding-nav-ball/\u0022 rel=\u0022external nofollow\u0022\u003ESliding NavBall\u003C/a\u003E still works on .23 - neat!) and relying mostly on the more precise HUD I got set as something of an alternative/extended flight display right next to it -- it\u0027s a handy device to have around, even on 3rd person view!\u003C/p\u003E\u003Cp\u003Eanyhow - that\u0027s a major thumbs up I was long overdue to give you for this mod - excellent stuff!\u003C/p\u003E\u003Cp\u003Efew points I wanted to make (suggestions really, if you feel like they\u0027re any good for ideas to boot)\u003C/p\u003E\u003Cp\u003Erandom thing 1 -- I find myself puzzled a bit by the speedometer tape on the HUD moving \u0022up\u0022 (higher values rise from below) as the value increases - this is odd for me, as most of such things I\u0027ve seen (standard on Boeing displays) have it the other way around, and the tape moves down as higher values are physically shown \u0022above\u0022 the indicated position in the middle of the thing\u003C/p\u003E\u003Cp\u003Erandom thing 2 -- the font used on the numbers on the radar altimeter and whiskey compass doesn\u0027t feel very well in tune with the rest of the UI... maybe it\u0027s just me, but I find it\u0027d look better if they were a little less times-new-roman-esque somehow...\u003C/p\u003E\u003Cp\u003Eedit: a brief research revealed that the vast majority of aviation gauge fonts are sans-serif (no \u0022bracketey thingies\u0022 at the tips):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.lcwprops.com/upload/catalog/lcw_5051.jpg\u0022 alt=\u0022lcw_5051.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...and a minor pet peeve - there\u0027s a weird thin white line that appears underneath some of the gauges when the bezels are off - specially visible at some scales around the 30~50% size range\u003C/p\u003E\u003Cp\u003Eagain - very large amounts of appreciation for this absolutely solid piece of modding awesomeness! congrats on a great idea greatly executed! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003Echeers!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-19T08:25:47Z\u0022 title=\u002201/19/2014 08:25  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 19, 2014\u003C/time\u003E by Moach\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-01-20T14:26:36Z","Content":"\n\u003Cp\u003EThanks for that glowing review, Moach.\u003C/p\u003E\u003Cp\u003E1) This HUD is based off of a McDonald Douglass HUD, which uses the \u0022backwards\u0022 speed tape. I\u0027m unlikely to change it, because that\u0027s the HUD I actually fly with, so I\u0027m quite biased.\u003C/p\u003E\u003Cp\u003E2) I\u0027ve gotten that before, and some day I\u0027ll get around to replacing them. \u003C/p\u003E\u003Cp\u003E3) Yeah, I either have to move my textures a tiny bit further apart or shrink the box I\u0027m drawing a bit. That\u0027ll get cleaned up someday as well.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-01-21T02:40:21Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://skydrive.live.com/redir?resid=131B3D0DB2B5645E!13261\u0026amp;authkey=!AMIUVDoo40a7LUE\u0026amp;ithint=file%2C.zip\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EBeta 6 is out\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESorry for the delay. I was working on the architecture stuff that took a bit longer than anticipated. Also, I got sidetracked writing \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66256-0-23-Custom-Biomes-1-3-19-Jan?highlight=custom\u002Bbiomes\u0022 rel=\u0022external nofollow\u0022\u003ECustom Biomes\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EChanges (besides the architecture stuff) are pretty minimal:\u003C/p\u003E\u003Cp\u003EThe most visible are the jetpack fuel gauges. The HUD displays jetpack fuel in place of the throttle readout when on EVA. The fuel gauge itself displays jetpack fuel on EVA.\u003C/p\u003E\u003Cp\u003EThe HUD\u0027s orbital mode works a little more like advertised, but I\u0027m still not totally happy with it.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-03-06T01:29:44Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gaFlhlL.png\u0022 alt=\u0022gaFlhlL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis isn\u0027t a beta release, but today I was working on the much requested round dial for the radar altimeter. It is based off of the radar altimeter found in some F-4 models, so the scale is \u0022realistic\u0022 for aircraft. The black area in the upper left will mask out the pointer at elevations above 5000m. It doesn\u0027t have the R/Y/G lights like the old one did. Would anyone really miss that? Tomorrow I\u0027ll work on getting it integrated into the mod, which should be fairly easy, and then I\u0027ll release a beta build for you guys to play with.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-03-06T02:06:37Z","Content":"\n\u003Cp\u003EThanks for your work, looking forward to it.\u003C/p\u003E\n"},{"CreatedByName":"Trueborn","CreatedById":65830,"CreatedDateTime":"2014-03-06T20:54:40Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://onedrive.live.com/redir?resid=131B3D0DB2B5645E!13943\u0026amp;authkey=!ANVnt7Mqre4mdQw\u0026amp;ithint=file%2C.zip\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E1.5 Beta 1 Download\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://onedrive.live.com/redir?resid=131B3D0DB2B5645E!13942\u0026amp;authkey=!AKUco4Izoai1M_w\u0026amp;ithint=file%2C.zip\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ESource\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBeta release now available! It looks the same as above. The suicide altitude (not pictured) is marked by an orange carrot along the outside of the gauge. As you can see, the time to impact counter and Red/Yellow/Green indicator light have been removed. There are also a few other minor fixes courtesy of a.g.\u003C/p\u003E\u003Cp\u003EPlease let me know if you run into any issues.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-06T20:56:52Z\u0022 title=\u002203/06/2014 08:56  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 6, 2014\u003C/time\u003E by Trueborn\u003C/strong\u003E\n\u003Cbr\u003EFormatting.\n\u003C/span\u003E\n"}]}