{"TopicId":39851,"ForumId":36,"TopicTitle":"[WIP] Leap Motion Plugin","CreatedByName":"nadvornm","CreatedById":6613,"CreatedDateTime":"2013-07-29T12:04:54Z","PageNum":1,"Articles":[{"CreatedByName":"nadvornm","CreatedById":6613,"CreatedDateTime":"2013-07-29T12:04:54Z","Content":"\n\u003Cp\u003EHi everyone!\u003C/p\u003E\u003Cp\u003EIt\u0027s finally there! Version 0.2 of my Leap Motion Plugin is online!\u003C/p\u003E\u003Cp\u003EWhat it does?\u003C/p\u003E\u003Cp\u003EYou can control your rover and fly your plane with just moving your hand in front of your screen.\u003C/p\u003E\u003Cp\u003EYou can download my latest build here: \u003Ca href=\u0022https://www.dropbox.com/s/i4pzx0vury5ggiz/LeapMotionPlugin.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/i4pzx0vury5ggiz/LeapMotionPlugin.zip\u003C/a\u003E (source code included)\u003C/p\u003E\u003Cp\u003EInstallation instruction:\u003C/p\u003E\u003Cp\u003EJust unzip the file you downloaded into your KSP Main directory. As with any plugin it is best to use it in a fresh install.\u003C/p\u003E\u003Cp\u003EHow to control a rover:\u003C/p\u003E\u003Cp\u003EMove hand towards the screen: forward\u003C/p\u003E\u003Cp\u003EMove hand towards you: backward\u003C/p\u003E\u003Cp\u003ERoll your hand to the left: steer left\u003C/p\u003E\u003Cp\u003ERoll your hand to the right: steer right\u003C/p\u003E\u003Cp\u003EFist or hover over the controller: just roll / not throttle, drive straight\u003C/p\u003E\u003Cp\u003EMove hand away from controller: brake\u003C/p\u003E\u003Cp\u003EHow to control a airplane:\u003C/p\u003E\u003Cp\u003EThe first hand you put over your leap motion controller is the steering hand. The second hand you put over your controller is the thrust hand.\u003C/p\u003E\u003Cp\u003EWith the steering hand you can control pitch, roll and yaw. Making a fist with the steering hand turns SAS on.\u003C/p\u003E\u003Cp\u003EWith the thrust hand you can control the thrust by moving your hand (spread your fingers) towards/away from your screen. Making a fist with the thrust hand halts the current thrust level.\u003C/p\u003E\u003Cp\u003EKnown issues:\u003C/p\u003E\u003Cp\u003E-when the plugin is loaded thrust can only be controlled with your thrust hand. Shift and Ctrl Key don\u0027t have any effect on thrust anymore.\u003C/p\u003E\u003Cp\u003E- the game crashes when exiting the game. Though while beeing in game everything works fine. I hope I can fix this soon.\u003C/p\u003E\u003Cp\u003E- depending on your CPU specs it is possible you experience some small legs or micro lags\u003C/p\u003E\u003Cp\u003EIn case something is not working for please post it here and send me the ksp.log file\u003C/p\u003E\u003Cp\u003EPlanned for the next update(s):\u003C/p\u003E\u003Cp\u003E- Activate action groups by using gestures\u003C/p\u003E\u003Cp\u003E--Changelog 0.2--\u003C/p\u003E\u003Cp\u003E-added airplane control\u003C/p\u003E\u003Cp\u003E-plugin is now partless\u003C/p\u003E\u003Cp\u003E-fixed stack overflow error\u003C/p\u003E\u003Cp\u003ESo have fun using your leap controller in KSP! Updates to this plugin will come soon\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-27T01:42:03Z\u0022 title=\u002210/27/2013 01:42  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 27, 2013\u003C/time\u003E by nadvornm\u003C/strong\u003E\n\u003Cbr\u003Eplanned updates\n\u003C/span\u003E\n"},{"CreatedByName":"igot2b","CreatedById":82251,"CreatedDateTime":"2013-10-27T13:20:21Z","Content":"\n\u003Cp\u003EHey nadvornm,\u003C/p\u003E\u003Cp\u003Ea little feedback for your plugin. \u003C/p\u003E\u003Cp\u003EDriving the rover with the above mentioned controls works as advertised except the steering control. I\u0027m not able to turn the rover by rolling my hand instead the rover steers when I move my hand on the yaw-axis. I however find this behavior very convenient in regards of the flying controls.\u003C/p\u003E\u003Cp\u003ELet\u0027s talk about flying \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It is great to control planes with your hand. This must be the feeling a Jedi has when using the force. Keeping in mind how the Leap recognises fingers I was getting used to the controls. I like the idea of using a steering and throttle hand, this kind of feels like I\u0027m using a HOTAS. Although I\u0027d call it HOLIA: Hands over Leap in Air. The steering is working as expected but the throttle could use some fine-tuning. I\u0027ve placed my Leap over my keyboard, so I can press buttons without getting my second hand into it\u0027s range. I somehow have to put my hand very far forward to get 100% throttle and it\u0027s not using all the space to the back. Another thing is, that if I\u0027m closing my hand too slow the throttle decrases like 1/3 which makes it nearly impossible to exactly set a specific value. \u003C/p\u003E\u003Cp\u003ETips for playing:\u003C/p\u003E\u003Cp\u003E- Take care when driving rovers that can\u0027t handle a full brake. This is what happens if your Leap can\u0027t find any hands.\u003C/p\u003E\u003Cp\u003E- Same goes for landing planes.\u003C/p\u003E\u003Cp\u003E- When flying, always enter your hand into the Leap\u0027s sensor range as a fist and then open it to control steering or throttle because this will prevent unwanted changes.\u003C/p\u003E\u003Cp\u003E- When controlling, make sure your Leap recognizes enough fingers, spreading your fingers is a good idea. \u003C/p\u003E\u003Cp\u003E- When setting the throttle, keep your hand closed and put it into the desired position then open and close your hand for a short moment. Repeat until desired throttle is set.\u003C/p\u003E\u003Cp\u003EKeep up your good work nadvornm, KSP is by far one of the best Leap games to play at the moment \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Also action groups would be really nice to fly SSTOs completly without interacting with the keyboard, I\u0027d totally enjoy this feature \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"retaliation","CreatedById":80952,"CreatedDateTime":"2013-11-13T01:06:43Z","Content":"\n\u003Cp\u003EHello there!\u003C/p\u003E\u003Cp\u003EHas there been any more progress on this plugin?? I haven\u0027t fired it up yet but I\u0027m just about to give it a whirl.\u003C/p\u003E\n"},{"CreatedByName":"nadvornm","CreatedById":6613,"CreatedDateTime":"2013-11-13T07:36:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022retaliation\u0022 data-cite=\u0022retaliation\u0022\u003E\u003Cdiv\u003EHello there!\u003Cp\u003EHas there been any more progress on this plugin?? I haven\u0027t fired it up yet but I\u0027m just about to give it a whirl.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi retaliation,\u003C/p\u003E\u003Cp\u003EI just recoded half the plugin yesterday to optimize the interface to the leap controller. My new code still needs some work and testing but you can expect a new update in the next few days. Feel free to test my plugin. It\u0027s always nice to get some feedback \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"keep_pabst_blue","CreatedById":69442,"CreatedDateTime":"2013-11-15T23:43:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nadvornm\u0022 data-cite=\u0022nadvornm\u0022\u003E\u003Cdiv\u003EHi retaliation,\u003Cp\u003EI just recoded half the plugin yesterday to optimize the interface to the leap controller. My new code still needs some work and testing but you can expect a new update in the next few days. Feel free to test my plugin. It\u0027s always nice to get some feedback \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs there support for VAB? Or is that not in the works? That is the main use I\u0027d have for it I think, being able to rotate the ship, inspect, and apply parts intuitively. My limited knowledge of Leap means I don\u0027t know if this will work but if it does I\u0027d probably consider getting one.\u003C/p\u003E\n"},{"CreatedByName":"nadvornm","CreatedById":6613,"CreatedDateTime":"2013-11-16T14:26:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022keep_pabst_blue\u0022 data-cite=\u0022keep_pabst_blue\u0022\u003E\u003Cdiv\u003EIs there support for VAB? Or is that not in the works? That is the main use I\u0027d have for it I think, being able to rotate the ship, inspect, and apply parts intuitively. My limited knowledge of Leap means I don\u0027t know if this will work but if it does I\u0027d probably consider getting one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs you are already the second one I hear from that VAB control is wanted I will plan to implement it. However before starting to work on this feature I will have a look at docking control.\u003C/p\u003E\u003Cp\u003EIt would be nice if you could send me your ideas about the VAB control. So what you think which gestures and which intuitive hand movements will do what\u003C/p\u003E\n"},{"CreatedByName":"nadvornm","CreatedById":6613,"CreatedDateTime":"2013-11-26T21:00:31Z","Content":"\n\u003Cp\u003EDEVELOPMENT UPDATE:\u003C/p\u003E\u003Cp\u003EMy new Version should be online within this week. Found out some weird behaviour during the testing so I had to fix a lot of stuff. I still need to fix a problem with the SAS though\u003C/p\u003E\n"},{"CreatedByName":"BGog42","CreatedById":82179,"CreatedDateTime":"2013-12-28T21:26:59Z","Content":"\n\u003Cp\u003EAny update on vab control?\u003C/p\u003E\n"},{"CreatedByName":"nadvornm","CreatedById":6613,"CreatedDateTime":"2013-12-29T21:42:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BGog42\u0022 data-cite=\u0022BGog42\u0022\u003E\u003Cdiv\u003EAny update on vab control?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHello BGog42,\u003C/p\u003E\u003Cp\u003EAs studying keeps me busy at the moment I didn\u0027t have much time to work on this project lately. However I might have some time when I get back home from 30C3 to finish the improvements I wrote about in my last post. Until end of frebruary I will have a lot of exames at my University so I might be able to start working on on VAB control as of March.\u003C/p\u003E\u003Cp\u003EI\u0027m sorry I can\u0027t develop faster. Altough any help would be very appreciated. So if there is a developer with a leap motion controller wanting to help me please just send me a message.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-30T11:02:50Z\u0022 title=\u002212/30/2013 11:02  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 30, 2013\u003C/time\u003E by nadvornm\u003C/strong\u003E\n\u003Cbr\u003Efalse quote answered. answer is for bgog42\u0026#039;s question\n\u003C/span\u003E\n"},{"CreatedByName":"dreadicon","CreatedById":117295,"CreatedDateTime":"2014-10-03T18:43:17Z","Content":"\n\u003Cp\u003ETHE TIME HAS COME:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.leapmotion.com/product/vr\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.leapmotion.com/product/vr\u003C/a\u003E\u003C/p\u003E\n"}]}