{"TopicId":44371,"ForumId":36,"TopicTitle":"Air intakes ( the beginning)","CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-08-30T11:02:52Z","PageNum":1,"Articles":[{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-08-30T11:02:52Z","Content":"\n\u003Cp\u003EI was wondering if it would be possible to make an air intake that sucked at low altitude and speed but was almost OP at high altitude and speed, some thing like a super ram air intake that gave you little to no air below 10,000 or 500 m/s but above that it made air like it was going out of style till 40,000 or 1,700 m/s .\u003C/p\u003E\u003Cp\u003EIm new to modding (I\u0027ve never done it) but I know how to edit CFGs for parts, and could I use the ISP key for engines in some way for the intakes?\u003C/p\u003E\u003Cp\u003EPs this may be in the wrong thread.\u003C/p\u003E\u003Cp\u003EP.s.s I was also thinking of making an intake for kintake air, just as an fyi making it should not be to hard.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-30T11:05:02Z\u0022 title=\u002208/30/2013 11:05  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 30, 2013\u003C/time\u003E by Tidus Klein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-08-30T16:09:27Z","Content":"\n\u003Cp\u003ENot without a plugin.\u003C/p\u003E\u003Cp\u003EAir intakes are just a bunch of static settings, you\u0027d need at least one curve to make that work, as is air intakes produce an amount of air relative to velocity and atmospheric density but that amount is otherwise constant.\u003C/p\u003E\u003Cp\u003EThe plugin would have to either entirely replace ModuleResourceIntake, which won\u0027t be entirely easy given that ModuleResourceIntake accounts for the angle of intakeTransform to the direction of travel in calculating it\u0027s efficiency.\u003C/p\u003E\u003Cp\u003EOr manipulate ModuleResourceIntake\u0027s area and intakeSpeed values based on a curve or two.\u003C/p\u003E\u003Cp\u003EDo note, anything that matching what you\u0027ve described will be highly unrealistic and will grossly unbalance the game.\u003C/p\u003E\u003Cp\u003EHave fun.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-30T16:16:32Z\u0022 title=\u002208/30/2013 04:16  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 30, 2013\u003C/time\u003E by Greys\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-08-30T16:59:22Z","Content":"\n\u003Cp\u003EMaking the game unbalanced? Keep in mind that this intake will only work till 40,000 if that and would be useless any lower then 15,000 It will also need a decent amount of electricity to run and be heavier then a normal intake, I could balance it out.\u003C/p\u003E\u003Cp\u003EAlso I was going though the cfg\u0027s for the air ramps on the B9 mod pack and found that it uses some kind of math equation to multiply intake air. \u003C/p\u003E\u003Cp\u003EBut what I was wondering is if I could some how use the ISP curve of the engines, and copy that over then change the keys so that the intake performed better or worse at varying altitude.\u003C/p\u003E\u003Cp\u003EI don\u0027t know maybe what Im saying can\u0027t be done, and I would need a plugin to vary the physics of just my intakes, If so \u003C/p\u003E\u003Cp\u003ESOME ONE TELL ME HOW TO CODE KSP PLEASE!!!\u003C/p\u003E\u003Cp\u003Eand make plugins \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-08-30T17:12:56Z","Content":"\n\u003Cp\u003EB9 uses mods to do things that aren\u0027t normally allowed, and even if you put the curves from an engine into ModuleResourceIntake, it won\u0027t use them.\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-09-03T13:18:18Z","Content":"\n\u003Cp\u003EHAHAHA IT CAN BE DONE!!!! \u003C/p\u003E\u003Cp\u003EI just made an Air intake ( with out using a plugin) that does the opposite of what I want it to do. UNlimited air below 20,000 but then almost none above I just have to mess with the code some more then find a modeling program to make a model for it.\u003C/p\u003E\u003Cp\u003EIM half way there!\u003C/p\u003E\u003Cp\u003EEdit: da crap now I can\u0027t get the game to use the normal ram intake its there in the SPH but when I put it on and launch a plane the game puts the one I made one it HELP!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-03T13:24:20Z\u0022 title=\u002209/03/2013 01:24  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 3, 2013\u003C/time\u003E by Tidus Klein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-03T20:11:49Z","Content":"\n\u003Cp\u003EDid you edit the .cfg for the stock Ram Intake? If the folder and part are named the same thing as the stock ram intake, then, in the game\u0027s eyes, you have two of the same part so it takes just one of them over the other. In this case, it took yours.\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-09-04T11:08:44Z","Content":"\n\u003Cp\u003EYes all I\u0027m doing is playing with the .cfg\u0027s but I did rename my Intake I just put aurora in front of it so that it reads Aurora Ram air intake. Ill try renaming the model to then work some more on the right curve. here is what I have so fair. ( I don\u0027t know how to do that little box for code so here it goes.)\u003C/p\u003E\u003Cp\u003E(\u003C/p\u003E\u003Cp\u003E// --- general parameters ---\u003C/p\u003E\u003Cp\u003Ename = Aurora AirIntake\u003C/p\u003E\u003Cp\u003Emodule = Part\u003C/p\u003E\u003Cp\u003Eauthor = Tidus Klein\u003C/p\u003E\u003Cp\u003E// --- asset parameters ---\u003C/p\u003E\u003Cp\u003Emesh = model.mu\u003C/p\u003E\u003Cp\u003Escale = 0.11\u003C/p\u003E\u003Cp\u003E// --- node definitions ---\u003C/p\u003E\u003Cp\u003E// definition format is Position X, Position Y, Position Z, Up X, Up Y, Up Z\u003C/p\u003E\u003Cp\u003Enode_stack_bottom01 = 0.0, 0.0, 0.0, 0.0, 1.0, 0.0\u003C/p\u003E\u003Cp\u003E// --- FX definitions ---\u003C/p\u003E\u003Cp\u003E// --- editor parameters ---\u003C/p\u003E\u003Cp\u003Ecost = 1000\u003C/p\u003E\u003Cp\u003Ecategory = Aero\u003C/p\u003E\u003Cp\u003Esubcategory = 0\u003C/p\u003E\u003Cp\u003Etitle = Aurora ram air\u003C/p\u003E\u003Cp\u003Emanufacturer = Aurora Areo tech\u003C/p\u003E\u003Cp\u003Edescription = \u003C/p\u003E\u003Cp\u003E// attachment rules: stack, srfAttach, allowStack, allowSrfAttach, allowCollision\u003C/p\u003E\u003Cp\u003EattachRules = 1,0,1,0,0\u003C/p\u003E\u003Cp\u003EstackSymmetry = 2\u003C/p\u003E\u003Cp\u003E// --- standard part parameters ---\u003C/p\u003E\u003Cp\u003Emass = 0.02\u003C/p\u003E\u003Cp\u003EdragModelType = default\u003C/p\u003E\u003Cp\u003Emaximum_drag = 0.3\u003C/p\u003E\u003Cp\u003Eminimum_drag = 0.2\u003C/p\u003E\u003Cp\u003EangularDrag = 1\u003C/p\u003E\u003Cp\u003EcrashTolerance = 10\u003C/p\u003E\u003Cp\u003EmaxTemp = 4400\u003C/p\u003E\u003Cp\u003EfuelCrossFeed = True\u003C/p\u003E\u003Cp\u003E// ----- DO NOT EDIT BELOW THIS POINT ,ha no ------ \u003C/p\u003E\u003Cp\u003EMODULE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E name = ModuleResourceIntake\u003C/p\u003E\u003Cp\u003E resourceName = IntakeAir\u003C/p\u003E\u003Cp\u003E checkForOxygen = true\u003C/p\u003E\u003Cp\u003E area = 0.03\u003C/p\u003E\u003Cp\u003E intakeSpeed = 20\u003C/p\u003E\u003Cp\u003E intakeTransformName = Intake\u003C/p\u003E\u003Cp\u003E useVelocityCurve = True \u003C/p\u003E\u003Cp\u003EatmosphereCurve\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E key = 0 100\u003C/p\u003E\u003Cp\u003E key = 0.3 1500\u003C/p\u003E\u003Cp\u003E key = 1 2500\u003C/p\u003E\u003Cp\u003E} \u003C/p\u003E\u003Cp\u003EvelocityCurve\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E key = 0 -0.0 0 1\u003C/p\u003E\u003Cp\u003E key = 1000 2 0 0 \u003C/p\u003E\u003Cp\u003E key = 2000 2 0 0\u003C/p\u003E\u003Cp\u003E key = 2500 0.2 5\u003C/p\u003E\u003Cp\u003E } \u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003ERESOURCE\u003C/p\u003E\u003Cp\u003E{\u003C/p\u003E\u003Cp\u003E name = IntakeAir\u003C/p\u003E\u003Cp\u003E amount = 0.0\u003C/p\u003E\u003Cp\u003E maxAmount = 0.5\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003E (Feel free to tell me if any thing looks wrong or you actually know what the keys mean in the atmosphere curve! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E)\u003C/p\u003E\u003Cp\u003EEdit: Hmm looking through my code I noticed something, I wonder if I can put the atmos curve where the area is and have it work that way so that the higher or faster you go the more area the intake has. EX:\u003C/p\u003E\u003Cp\u003E(area = atmospheric curve\u003C/p\u003E\u003Cp\u003E {\u003C/p\u003E\u003Cp\u003E key = 1 200\u003C/p\u003E\u003Cp\u003E key = 0.8 500\u003C/p\u003E\u003Cp\u003E key = 0.5 1000\u003C/p\u003E\u003Cp\u003E }\u003C/p\u003E\u003Cp\u003E}\u003C/p\u003E\u003Cp\u003E Or something like that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-04T12:44:07Z\u0022 title=\u002209/04/2013 12:44  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 4, 2013\u003C/time\u003E by Tidus Klein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Torminator","CreatedById":78617,"CreatedDateTime":"2013-09-04T14:13:10Z","Content":"\n\u003Cp\u003EAir intake area will also increase your drag. \u003C/p\u003E\u003Cp\u003EFor the atm curve, the key goes from 0,vaccum, to 1,sea level.\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-09-04T14:33:19Z","Content":"\n\u003Cp\u003Eo.0 OOO THATS GOING TO HELP A LOT! I thought it was the other way around. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-09-04T14:34:46Z","Content":"\n\u003Cp\u003EI think, we need, electric engines and propellors.\u003C/p\u003E\n"},{"CreatedByName":"Temeriki","CreatedById":3039,"CreatedDateTime":"2013-09-04T17:17:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zekes\u0022 data-cite=\u0022zekes\u0022\u003E\u003Cdiv\u003EI think, we need, electric engines and propellors.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAsk and ye shall receive \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24551-Firespitter-propeller-plane-and-helicopter-parts-v5-0-%28May-25th%29-for-KSP-0-20-0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/24551-Firespitter-propeller-plane-and-helicopter-parts-v5-0-%28May-25th%29-for-KSP-0-20-0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(its updated to .21 btw)\u003C/p\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2013-09-05T10:48:51Z","Content":"\n\u003Cp\u003EUmm I know a electric prop is in the fire-spiter mod, but making a turbo fan run off electricity wouldn\u0027t be a hard thing to do, unrealistic but very easily possible.\u003C/p\u003E\u003Cp\u003EPS tried making an air tank out of the stratus v mono tank, Lets just say I now know that air in ksp weighs some thing and 10.000 units of it is close to 50 tons o.0. My poor little plane feel apart on the runway.\u003C/p\u003E\u003Cp\u003EEdit oops I did\u0027ent know I had two pages going but ya the link up tops what you want. \u003C/p\u003E\u003Cp\u003Eo ya by the way I have successfully made an intake for kintake air, not hard at all.\u003C/p\u003E\u003Cp\u003EI will be downloading unity to day so that I can get this ball rolling for real!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-05T11:02:12Z\u0022 title=\u002209/05/2013 11:02  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 5, 2013\u003C/time\u003E by Tidus Klein\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EatVacuum","CreatedById":72754,"CreatedDateTime":"2013-10-28T18:53:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003EDo note, anything that matching what you\u0027ve described will be highly unrealistic and will grossly unbalance the game.\u003Cp\u003EHave fun.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt wouldn\u0027t unbalance the game if it has advantages in certain conditions but disadvantages in others. And it wouldn\u0027t be unrealistic necessarily - the US Airforce has been test flying hypersonic craft for years that use scamjets that are useless unless you can get get them up over the speed of sound and at high altitude before they will run. Conventional jets don\u0027t work well beyond about mach 2 and even to get that far they have to be engineered differently than subsonic turbofans. Scramjets only work at hypersonic. The only engine I\u0027m aware of that can handle zero to mach five as a jet is the Sabre, which looks promising but is only at the point of static tests. And speaking of realism, is it more realistic to cram 4 or 6 intakes per jet engine to fly at 20000 meters? Last time I checked, planes like the SR71 and others only needed one intake per engine and flew fine at 26km altitude and were most efficient at high altitude and mach 3.2 (just a hair under the max speed), which is about 1100m/s. And, btw the problem wasn\u0027t getting enough air into the engines it was handling what got in - they used a sort of bypass system to move the excess air around the turbojet part of the engine and then fed it back in after it as a sort of ramjet.\u003C/p\u003E\u003Cp\u003ECreating an engine that is more effective at high altitude than low is obviously realistic, in that it has been done in the real world. Pretty much any supersonic jet engine is optimized for high altitude, you don\u0027t tend to go mach 2 at sea level - even at 26km going Mach 3 causes huge heating problems, it would be way worse at lower altitudes.\u003C/p\u003E\u003Cp\u003EAnd correcting the need to \u0022airhog\u0022 (i.e. spam intakes) by building realistic intakes would be improving realism.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T04:33:08Z\u0022 title=\u002210/29/2013 04:33  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by EatVacuum\u003C/strong\u003E\n\u003C/span\u003E\n"}]}