{"TopicId":46007,"ForumId":36,"TopicTitle":"Alternative Planet Mapping mod - Ideas collection \u002B discussion","CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-09-15T10:53:25Z","PageNum":1,"Articles":[{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-09-15T10:53:25Z","Content":"\n\u003Cp\u003EIn my opinion, generating elevation maps of distant planets and moons is a must-have for a space game. And while i love ISA MapSat and it\u0027s approach to simulate the scanning process in a realistic way, i think it has some issues that probably won\u0027t be solved anytime soon:\u003C/p\u003E\u003Cp\u003E - Memory hog (dev version) and/or compatibility issues\u003C/p\u003E\u003Cp\u003E - Unknown state of the developer (Innsewerants)\u003C/p\u003E\u003Cp\u003E - scanning only with active vessel, at limited time warp\u003C/p\u003E\u003Cp\u003ETo address this issues, i am considering making a new attempt at a mapping mod. Most important aspect is overcoming the \u0022active vessel only\u0022 burden. I want to be able to have multiple scanning satellites working at the same time (scanning different planets or scanning a single planet with multiple sats). Obviously, ISA MapSats approach of actually scanning the planet via single scan rays that pull elevation data from the game itself won\u0027t work here. I am willing to trade realism for usability. Currently i am thinking of having an initially hidden high-resolution heightmap image that is uncovered as satellites pass overhead. It should be possible to perform these bitmap operations fast enough to allow multiple scanners at once. Maybe there could be several map images (low-res, high-res, elevation, photo) and different parts and conditions to acquire them (think of Narrow-Angle-Camera vs Wide-angle-camera on the Mars orbiters). I am not sure how these images could be aquired, but i\u0027m sure there will be a way.\u003C/p\u003E\u003Cp\u003EThe plugin would need a central controlling MonoBehaviour that keeps track of all mapping-equipped vessels, and triggers their scanning modules in each Update. Acquiring this list could be done by looking through FlightGlobals.Vessels.\u003C/p\u003E\u003Cp\u003ESo, this thread is here to test the waters. Throw your, feedback and criticism at me. Stop whining about how mods \u0022die out\u0022 and take this as a chance to rebuild something even better. Ideally, i would like to find fellow programmers and modellers willing to invest some time into this as well, because i think this mod is big enough to develop it with multiple persons once the basic plugin layout and interfaces are defined.\u003C/p\u003E\n"},{"CreatedByName":"pizzaoverhead","CreatedById":26349,"CreatedDateTime":"2013-09-15T12:24:16Z","Content":"\n\u003Cp\u003EPretty cool! It sounds like a workable plan. Do you have any thoughts on gathering the initial data? It would be easy to distribute pre-generated maps, but one of MapSat\u0027s strength was the ability to deal with any new terrain it saw, including anomalies. The Universe Replacer and Kerbtown mods will be making dealing with dynamic terrain more important in future.\u003C/p\u003E\u003Cp\u003EAs far as the multiple-resolutions go, you also have the option of taking a deterministic pixel average to generate the lower-resolution images. Multiple levels of detail depending on distance, equipment quality and power consumption is something I would like to see in the game. It would fit in well with the new tech-tree. You could also offer different colour arrangements such as heightmap, full colour and black and white. Early spy satellites used black and white film which required the film canisters be returned for processing.\u003C/p\u003E\u003Cp\u003EI\u0027ve developed some (unreleased) plugins myself, so I can offer some assistance. I\u0027m looking forward to seeing where this mod goes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-09-15T14:02:47Z","Content":"\n\u003Cp\u003ESubbed! I love ISA Mapsat too, but sadly it\u0027s too unstable and crashes the game at the drop of a hat. I\u0027m no modder though, i can only offer moral support and ideas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaius","CreatedById":66495,"CreatedDateTime":"2013-09-16T06:24:08Z","Content":"\n\u003Cp\u003EOne consideration: It really ought to work equally well at any time-warp. It always bugged me that ISA MapSat (and the Kethane detectors for that matter) start missing cells at higher time warps. You know where the satellite was the last time you added a cell, and you know where it is now -- it ought to be trivial to fill in all the data in between, rather than just at the current point...\u003C/p\u003E\u003Cp\u003E(\u0022It ought to be trivial\u0022 is what a usually say before I dig into the code and really come to understand the problem... lol)\u003C/p\u003E\n"},{"CreatedByName":"Neutrinovore","CreatedById":72520,"CreatedDateTime":"2013-09-16T13:00:02Z","Content":"\n\u003Cp\u003EA suggestion: If at all possible, the mapping software should be able to \u0027play nice\u0027 with other mods, i.e. one should be able to find a set of coordinates on this map, such as those of an anomaly, and carry them over to another part of the game like the MechJeb landing guidance module. Also, the ability to overlay map data from this mod directly onto the globe on the map screen would be awesome. Just a few ideas, but I have no idea how to implement these things, I\u0027m a player, not a modder. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2013-09-16T20:52:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaius\u0022 data-cite=\u0022Gaius\u0022\u003E\u003Cdiv\u003EOne consideration: It really ought to work equally well at any time-warp. It always bugged me that ISA MapSat (and the Kethane detectors for that matter) start missing cells at higher time warps. You know where the satellite was the last time you added a cell, and you know where it is now -- it ought to be trivial to fill in all the data in between, rather than just at the current point...\u003Cp\u003E(\u0022It ought to be trivial\u0022 is what a usually say before I dig into the code and really come to understand the problem... lol)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt also ought to work when not the active craft. This is the biggest thing keeping me away from mods like Kethane, Mapsat, Extraplanetary Launchpads, etc. It is possible to have this kind of information processed on an inactive flight, as we see in KSP Interstellar. \u003C/p\u003E\u003Cp\u003ESo, this sounds very promising, good luck!\u003C/p\u003E\n"},{"CreatedByName":"Greys","CreatedById":57109,"CreatedDateTime":"2013-09-16T21:39:32Z","Content":"\n\u003Cp\u003EISA\u0027s limitations are mostly built around how it functions. The actual height of terrain is based on a lot of independent systems so you can\u0027t just ask KSP \u0022What will the height at this point be\u0022, instead you have to fire a ray at the ground and see where it hits. ISA does this a bunch of times every second with slightly different angles, and it turns out that shooting rays at the PQS is \u003Cem\u003Ereally fricken expensive\u003C/em\u003E (technically speaking it\u0027s not supposed to happen at all)\u003C/p\u003E\u003Cp\u003EOther mapping systems don\u0027t have to deal with the in-game result being generated from many unknowable factors so they can figure all this stuff out in code and have tables to save time.\u003C/p\u003E\u003Cp\u003EMaybe you can do the same kind of thing to make mapping faster and work with fewer limitations, but you might run into problems with Squad depending on stuff...\u003C/p\u003E\u003Cp\u003EThat may sound pessimistic, but I am supportive of this idea, competition breeds excellence and it\u0027s been six months since the last time somebody tried to compete with ISA. I just wanted to frame the reasons for ISA being the way it is, so those can be taken into account.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-09-16T21:48:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greys\u0022 data-cite=\u0022Greys\u0022\u003E\u003Cdiv\u003EThe actual height of terrain is based on a lot of independent systems so you can\u0027t just ask KSP \u0022What will the height at this point be\u0022, instead you have to fire a ray at the ground and see where it hits.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can absolutely ask KSP for the terrain height at a point. (To be precise, you ask the planet\u0027s PQS controller.)\u003C/p\u003E\u003Cp\u003EFor what it\u0027s worth, I don\u0027t like \u0022reveal\u0022 schemes as they\u0027re being pitched, mainly because they focus way too much on textures. Forget about textures and images. Store the important data (\u0022what areas have been scanned?\u0022) and optionally cache the terrain data, but neither should be stored as a texture. You could get fancy with quadtrees or density maps or what have you, but it could also be a simple grid. I just don\u0027t want to see ISA replaced with another technical nightmare.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-16T22:12:04Z","Content":"\n\u003Cp\u003EMajiir, didn\u0027t you mention something a month or so back about working with the geodesic grid to make it more compatible with things like prospective ISA replacements? I think doing another mapping mod in geodesic would look insanely awesome. I\u0027m not well enough versed in coding to speak intelligently but I do agree with Majiir that actually extracting the terrain data off the planet is a much better idea than firing rays or revealing textures as that then eliminates any potential compatibility glitches when planets are changed/added.\u003C/p\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-09-16T22:20:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EMajiir, didn\u0027t you mention something a month or so back about working with the geodesic grid to make it more compatible with things like prospective ISA replacements? I think doing another mapping mod in geodesic would look insanely awesome. I\u0027m not well enough versed in coding to speak intelligently but I do agree with Majiir that actually extracting the terrain data off the planet is a much better idea than firing rays or revealing textures as that then eliminates any potential compatibility glitches when planets are changed/added.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was, but it involves reengineering the geodesic grid from scratch, and I\u0027ve run into trouble with a few of the necessary algorithms. It\u0027ll take a good few days of solid whiteboarding to solve, and I\u0027m unlikely to have that sort of time for a month or two. Something like a quadsphere would accomplish a similar objective but just look a little different, so I might even attempt \u003Cem\u003Ethat\u003C/em\u003E instead of holding out for the improved grid.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2013-09-17T06:49:23Z","Content":"\n\u003Cp\u003EFor what my small opinion is worth, I nominate Majir to make a new mapping mod!\u003C/p\u003E\n"},{"CreatedByName":"Aknar","CreatedById":68073,"CreatedDateTime":"2014-02-22T21:26:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003E I won\u0027t be adding anomalies or other data to the hexagonal grid, but I\u0027ve been working on another type of overlay that will be suitable for geographic data. I\u0027m still not sold on displaying anomalies, but other types of data (altitude, slope, biomes, et cetera) will likely be there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is what Majjir told me on the 3rd of January, so it\u0027s underway, and this would be the most important mod for me. It would give sense to probes that could actually give you science over time and useful information you could use to choose your next landing site.\u003C/p\u003E\n"},{"CreatedByName":"rbos","CreatedById":72073,"CreatedDateTime":"2014-02-22T22:32:30Z","Content":"\n\u003Cp\u003EI think it would be fun if planetary surfaces were not exposed in the map view until a map satellite has traversed them. Perhaps replace the surface texture with a grey featureless blob and then reveal them on a hex pattern like with kethane. That would make mapping both necessary and interesting.\u003C/p\u003E\n"},{"CreatedByName":"Aknar","CreatedById":68073,"CreatedDateTime":"2014-02-24T07:57:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rbos\u0022 data-cite=\u0022rbos\u0022\u003E\u003Cdiv\u003EI think it would be fun if planetary surfaces were not exposed in the map view until a map satellite has traversed them. Perhaps replace the surface texture with a grey featureless blob and then reveal them on a hex pattern like with kethane. That would make mapping both necessary and interesting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is too restrictive, and you can see the surface with telescopes or while in orbit around it. Plus it would be very compilcated to mod, just to make the game uglier. As Captaiin Sierra said:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E I do agree with Majiir that actually extracting the terrain data off the planet is a much better idea than firing rays or revealing textures as that then eliminates any potential compatibility glitches when planets are changed/added.\u003C/div\u003E\u003C/blockquote\u003E The probes are used for more precise readings giving you useful info like biomes (to be able to find every biome and visit it), and altitude readings that would sight anomalies due to altitude spikes. The mapping would be truly useful if they gave you 1 science point per hexagon of the grid, It would, over time, if you placed your probe in a nice orbit, a nice amount of science points that represent the amount of knowledge gained by radio wave readings that would give us info on the planet\u0027s composition but would have no use in-game.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-24T12:34:23Z\u0022 title=\u002202/24/2014 12:34  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 24, 2014\u003C/time\u003E by Aknar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-02-24T08:01:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aknar\u0022 data-cite=\u0022Aknar\u0022\u003E\u003Cdiv\u003EThis is too restrictive, and, You can see the surface with telescopes or while in orbit around it. Plus it would be very compilcated to mod, just to make the game uglier. The probes are used for more precise readings giving you useful info like biomes (to be able to find every biome and visit it), and altitude readings that would sight anomalies due to altitude spikes. The mapping would be truly useful if they gave you 1 science point per hexagon of the grid, It would, over time, if you placed your probe in a nice orbit, a nice amount of science points that represent the amount of knowledge gained by radio wave readings that would give us info on the planet\u0027s composition but would have no use in-game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYea...check out ScanSat. It\u0027s been out for a while and it allows for you to collect science based on maps.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-0-23-SCANsat-terrain-mapping\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-0-23-SCANsat-terrain-mapping\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso, that was kind of a necropost. This conversation ended months ago.\u003C/p\u003E\n"},{"CreatedByName":"Aknar","CreatedById":68073,"CreatedDateTime":"2014-02-24T08:14:55Z","Content":"\n\u003Cp\u003EYep, already checked it out, but I don\u0027t find it convincing enough, while Majiir is spot on. I hope to revive this thread since the mod idea isn\u0027t dead and I deamed fit to update by showing work is being done on this and I really hope to show there is still intrest in it so we can hope to see it come out in the next few months.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-24T09:19:53Z\u0022 title=\u002202/24/2014 09:19  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 24, 2014\u003C/time\u003E by Aknar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2014-02-24T16:50:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aknar\u0022 data-cite=\u0022Aknar\u0022\u003E\u003Cdiv\u003EYep, already checked it out, but I don\u0027t find it convincing enough, while Majiir is spot on.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPerhaps you could elaborate? This discussion (and my participation in it) was much more active before SCANsat came about. It seems people are mostly satisfied with it. What would you rather see?\u003C/p\u003E\n"},{"CreatedByName":"Aknar","CreatedById":68073,"CreatedDateTime":"2014-02-24T18:33:23Z","Content":"\n\u003Cp\u003EI spoke to you a while back (in January) and you told me that you where working on a display, somewhat like the hexagonal display you have for kethane for showing altitude, slope, biomes and more. Scan sat is a nice mod but I find it would be so much better with the kethane grid and your scanning units models that are both great eye candy. The display directly on planets would prove to be useful and it\u0027s simplicity would be truly appreciated as it would allow to scan the whole planet without those aggressive maps and annoying left undiscovered holes you can\u0027t get rid of. Science would be more rewarding and interesting. Also, this would allow for a finite amount of science points since once you scan each parcel of the planet, you retrieve all the useful data you can.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-02T19:58:13Z\u0022 title=\u002203/02/2014 07:58  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 2, 2014\u003C/time\u003E by Aknar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aknar","CreatedById":68073,"CreatedDateTime":"2014-03-02T19:58:03Z","Content":"\n\u003Cp\u003EEven the small drill would make a nice science instrument. Just need to change the color of theses meshes to use them again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}