{"TopicId":46848,"ForumId":36,"TopicTitle":"Universal Resources: Because Kethane is too Easy!","CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-09-29T05:54:31Z","PageNum":1,"Articles":[{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-09-29T05:54:31Z","Content":"\n\u003Cp\u003EEver since Kethane added support for multiple resources I was thinking of doing this. And hey, it\u0027s so darn easy to do I\u0027m surprised nobody else did it yet! So without any further ado, introducing the \u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EUniversal Resources Mod!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EA mod designed to run off of, but replace Kethane. It is significantly more difficult as well because it\u0027s not a \u0022one size fits all\u0022 resource. Some planets are pretty much useless altogether (may be changed) and most only have a few deposits of a few resources. The current resources are as follows:\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EWater:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EDark Blue\u003C/p\u003E\u003Cp\u003ECan be converted into Hydrogen and Oxidizer using an Electrolyzer.\u003C/p\u003E\u003Cp\u003ECommonly found on Kerbin and Vall. Also found on the Mun, Duna, Laythe, and Eeloo.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EHydrogen:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ELight Blue\u003C/p\u003E\u003Cp\u003ECan be used as fuel for nuclear engines, and mixed with oxidizer to make LFO in a fuel mixer.\u003C/p\u003E\u003Cp\u003EFound on all planets in medium to low quantities. Can also be made from water.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EUranium:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBrown-Green\u003C/p\u003E\u003Cp\u003ECan be converted into Plutonium using a centrifuge.\u003C/p\u003E\u003Cp\u003ECommonly found on Kerbin, Moho, Eve, and Bop. Also found on the Mun, Gilly, Dres, and Tylo.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EPlutonium:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EN/A\u003C/p\u003E\u003Cp\u003EUsed to power RTGs and other such atomic devices.\u003C/p\u003E\u003Cp\u003ENot found naturally. It can only be made from uranium.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ENitrogen:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYellow\u003C/p\u003E\u003Cp\u003EMixed with oxidizer in a fuel mixer to make LFO or Monopropellant.\u003C/p\u003E\u003Cp\u003ECommonly found on Kerbin, Minimus, Eve, and Duna. Also found everywhere else.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EPlans:\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EXenon or something to make it out of.\u003C/p\u003E\u003Cp\u003EAtmospheric resources/mining Jool (this may be possible with Kethane normally, but I\u0027m not sure)\u003C/p\u003E\u003Cp\u003EMod support for everything under the sun. Ideally.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EHELP WANTED\u003C/strong\u003E\u003C/span\u003E\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI really have no idea what I\u0027m doing. As it stands this mod is \u003Cstrong\u003Eillegal\u003C/strong\u003E to distribute because it uses modded Kethane parts. I plan on using recoloured stock tanks, but I need someone to make models for scanners and drills. I can model half decently, but I suck at texturing and I can\u0027t animate. So I basically need someone to do 90% of the real work.\u003C/p\u003E\u003Cp\u003EIf anyone has any suggestions or wants to offer help, please let me know! I should like to learn how to do all this stuff on my own one day and this is the first step!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-29T16:52:29Z\u0022 title=\u002209/29/2013 04:52  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 29, 2013\u003C/time\u003E by mushroomman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-09-29T07:28:21Z","Content":"\n\u003Cp\u003EThis sounds like a good mod.\u003C/p\u003E\u003Cp\u003EI would love to help- but I suck at modeling/texturing, but I can test, if you want to.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-09-29T12:20:37Z","Content":"\n\u003Cp\u003EXenon is also found in planetary atmosphere, in pretty small concentrations, but still. It can\u0027t be made out of anything. Hydrogen should be abundant on Jool, or possible to be made from water. Also, you should include oxygen for life support and making LOX out of it. I\u0027d also like to see helium-3 and deuterium, the former being abundant on Mun and Jool, the latter made from hydrogen at a fixed percentage. They\u0027d be good for fusion reactors.\u003C/p\u003E\n"},{"CreatedByName":"Kommitz","CreatedById":37526,"CreatedDateTime":"2013-09-29T12:31:20Z","Content":"\n\u003Cp\u003EI\u0027ve got designs a H2/O resource system that I\u0027m planning on doing for my engines eventually, using Kethane.\u003C/p\u003E\u003Cp\u003EHave a couple of ice drilling bits mocked up, I\u0027d be glad to share them once (or if) I have to time to finish them off. \u003C/p\u003E\u003Cp\u003E What level of detail are you looking to go in to with the resources though? In my plans I\u0027m just treating the preexisting Oxidiser as LOX, and I had thought about making a Hydrogen analogue at around 1/10th the density of the standard liquid resources to keep the numbers nice and rounded.\u003C/p\u003E\n"},{"CreatedByName":"Nupol","CreatedById":79253,"CreatedDateTime":"2013-09-29T12:55:30Z","Content":"\n\u003Cp\u003EI would help you with the Modeling but i have never done a part in KSP because iÃ‚Â´ve never read some of the tutorials but i released several objects for Rollercoaster Tycoon 3. IÃ‚Â´m quite good in modeling. if someone want to team up with me who can texture, animate and writing this config stuff i would start modeling several nice objects. Drills in different sizes like for little rovers, tanks and so on. it could be more efficient to work with several members on this project.\u003C/p\u003E\u003Cp\u003EWIP pictures of my canceled work in rct3. As you see i was not that good in texturing back then but im sure to do some nice textures.\u003C/p\u003E\u003Cp\u003Eremember these are low poly models with lots of alpha textures and far away from final: \u003Ca href=\u0022http://imgur.com/a/4qB3c#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/4qB3c#0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EiÃ‚Â´ve also learned to work with autocad in school but for modelling in ksp i would prefer sketchup and a export to blender.\u003C/p\u003E\u003Cp\u003Eif you are interested i would like to join your team. Pm me if you want.\u003C/p\u003E\u003Cp\u003Eregards\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-29T13:08:12Z\u0022 title=\u002209/29/2013 01:08  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 29, 2013\u003C/time\u003E by Nupol\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-09-29T16:11:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kommitz\u0022 data-cite=\u0022Kommitz\u0022\u003E\u003Cdiv\u003EI\u0027ve got designs a H2/O resource system that I\u0027m planning on doing for my engines eventually, using Kethane.\u003Cp\u003EHave a couple of ice drilling bits mocked up, I\u0027d be glad to share them once (or if) I have to time to finish them off. \u003C/p\u003E\u003Cp\u003E What level of detail are you looking to go in to with the resources though? In my plans I\u0027m just treating the preexisting Oxidiser as LOX, and I had thought about making a Hydrogen analogue at around 1/10th the density of the standard liquid resources to keep the numbers nice and rounded.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you do get around to finishing them I would appreciate it. Your models are very nice. But don\u0027t make it a priority or anything.\u003C/p\u003E\u003Cp\u003EAs for detail, I am just going to use Oxidizer as LOX. I try to keep the masses more or less realistic, but it\u0027s not 100%.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EXenon is also found in planetary atmosphere, in pretty small concentrations, but still. It can\u0027t be made out of anything. Hydrogen should be abundant on Jool, or possible to be made from water. Also, you should include oxygen for life support and making LOX out of it. I\u0027d also like to see helium-3 and deuterium, the former being abundant on Mun and Jool, the latter made from hydrogen at a fixed percentage. They\u0027d be good for fusion reactors.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf I can figure out how to gather atmospheric resources I\u0027ll definitely put xenon in there (also nitrogen). Hydrogen can already be made from water, giving you hydrogen and oxidizer. I\u0027ll probably add a converter for turning oxidizer into oxygen for life support mods. As for helium-3 and deuterium, I would add those but they\u0027re useless right now. They could probably come in handy for the warp drive mod, though I\u0027m not sure what resources it uses.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-09-29T16:22:27Z","Content":"\n\u003Cp\u003EWarp Plugin uses deuterium, so yeah - it would be useable. As for other resources: LFO, liquid fuel, antimatter, argon, xenon and aluminium. Also exotic matter, but it is synthetised directly in warp cores. Fractal_UK is working on adding heat radiators, and on his screenshots i\u0027ve seen something that could be lithium (and possibly molybdenium, but i might be completely off on this one). Really guys - i think you should cooperate. Fractal already made some cool parts for resource extraction, including atmospheric scoop. And ever-talented zzz made some seriously awesome custom models for these parts. So get talking already \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-09-30T00:59:03Z","Content":"\n\u003Cp\u003EI would love to have a more intricate resource system in the game. Kethane, RealFuels, and IonCross will never reach their full potential without a top-down unification. I don\u0027t have the time to implement it, but here is the set of resources and reactions I had planned, based on a simplified overview of feasible chemistry:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERaw elements (names based on the old Squad flowchart):\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Ehexagen (hydrogen)\u003C/p\u003E\u003Cp\u003Ekerbon (carbon)\u003C/p\u003E\u003Cp\u003Enitronite (nitrogen)\u003C/p\u003E\u003Cp\u003Eoxium (oxygen)\u003C/p\u003E\u003Cp\u003Elithite (double duty as lithium and silicon)\u003C/p\u003E\u003Cp\u003Ezeonium (xenon)\u003C/p\u003E\u003Cp\u003Eobtainium (iron, aluminum, titanium, etc.)\u003C/p\u003E\u003Cp\u003Eblutonium (radioactive elements)\u003C/p\u003E\u003Cp\u003Edepleted blutonium (radioactive byproducts)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECompounds:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Ewater, kerboxide, propellium (liquidfuel), oxidizer, monopropellant, snacks, kerblithite\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFuel processors:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Epropelliium converter: kerbon \u002B hexagen \u002B electricity -\u0026gt; propellium\u003C/p\u003E\u003Cp\u003Ehexagen reformer: propellium -\u0026gt; kerbon \u002B hexagen\u003C/p\u003E\u003Cp\u003Emonopropellant processor: hexagen \u002B nitronite \u002B electricity -\u0026gt; monopropellant\u003C/p\u003E\u003Cp\u003Emonopropellant cracker: monopropellant -\u0026gt; hexagen \u002B nitronite\u003C/p\u003E\u003Cp\u003Emonopropellant decomposer: monopropellant \u002B oxium -\u0026gt; oxidizer \u002B water\u003C/p\u003E\u003Cp\u003Ewater electrolyzer: water \u002B electricity -\u0026gt; hexagen \u002B oxium\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EElectrical generators:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Ealternator: propellium \u002B oxidizer -\u0026gt; kerboxide \u002B water \u002B nitronite \u002B electricity\u003C/p\u003E\u003Cp\u003Efuel cell: hexagen \u002B oxium -\u0026gt; water \u002B electricty\u003C/p\u003E\u003Cp\u003Efission reactor: blutonium -\u0026gt; depleted blutonium \u002B electricty\u003C/p\u003E\u003Cp\u003Efusion reactor: hexagen \u002B electricity -\u0026gt; lithite \u002B more electricity\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELife support:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003Ekerbals: snacks \u002B oxium -\u0026gt; kerboxide \u002B nitronite \u002B water\u003C/p\u003E\u003Cp\u003Egreenhouse: kerboxide \u002B nitronite \u002B water \u002B light -\u0026gt; snacks \u002B oxium\u003C/p\u003E\u003Cp\u003Egrowlamp: electricity -\u0026gt; light\u003C/p\u003E\u003Cp\u003E(light resource of course should also be generated from exposure to sunlight, attenuated by barometric pressure)\u003C/p\u003E\u003Cp\u003Ekerbon scrubber: kerboxide \u002B lithite \u002B hexagen -\u0026gt; kerblithite \u002B water\u003C/p\u003E\u003Cp\u003Ekerbon regenerator: kerblithite \u002B electricity -\u0026gt; kerbon \u002B lithite\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-30T12:57:25Z\u0022 title=\u002209/30/2013 12:57  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 30, 2013\u003C/time\u003E by rhoark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-09-30T01:31:21Z","Content":"\n\u003Cp\u003EI looked at resource placement as a combination of real-world analogues and creating balanced challenges. Fortunately, it works out pretty well to create situations where a single body won\u0027t meet all your needs, but you can get a good economy going within several of the planet-moon systems.\u003C/p\u003E\u003Cp\u003EMun -\u0026gt; (trace) water ice\u003C/p\u003E\u003Cp\u003EMinmus -\u0026gt; kerboxide dry ice\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBetween the two you can fuel hexagen/oxium or propellium/oxium engines, though liquid oxidizer will require nitronite imports.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EEve -\u0026gt; propellium ocean, kerboxide atmosphere, nitronite and blutonium soil\u003C/p\u003E\u003Cp\u003EGilly -\u0026gt; lithite, (trace) water ice\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEve will provide every kind of propellant, but Gilly can top off your life support\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E(Life support has reciprocal reactions to last a long time, but there should be a slight efficiency cost so as not to be perpetual-motion in a closed system.)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELaythe -\u0026gt; oxidizer ocean, oxium atmosphere, nitronite soil\u003C/p\u003E\u003Cp\u003EJool -\u0026gt; hexagen atmosphere (trace zeonium)\u003C/p\u003E\u003Cp\u003EBop -\u0026gt; lithite soil\u003C/p\u003E\u003Cp\u003ETylo -\u0026gt; blutonium soil\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI really like the idea that there\u0027s no hexagen of any kind on Laythe, so the ocean is actually oxidizer. Among Jool and its moons you can get everything you need. Probably the area best suited to export to the rest of the kerbol system.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDuna -\u0026gt; kerboxide ice at the poles, lithite soil elsewhere, kerboxide and nitronite atmosphere\u003C/p\u003E\u003Cp\u003EIke -\u0026gt; (trace) water ice\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENot a great place for resources overall, but has just enough to refuel for a return trip if you\u0027re willing to work at it.\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-30T01:45:22Z\u0022 title=\u002209/30/2013 01:45  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 30, 2013\u003C/time\u003E by rhoark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-09-30T02:20:11Z","Content":"\n\u003Cp\u003EWell that\u0027s a lot of stuff. I was wondering about whether or not I should use real names. I\u0027ll make a poll.\u003C/p\u003E\u003Cp\u003EAs for those added elements, I\u0027ll do pretty much exactly what you suggest for support with the life support mod. If I team up with the warp drive mod I could use their work to draw resources from the oceans and maybe atmospheres. So that would be good. I could have swore there was an option to have resource deposits only spawn at certain latitudes, but I can\u0027t remember what it is. I would definitely like to have certain resources at the polls. As for balancing, I may consider your suggestions but I think it would be best to wait until a Beta and let everyone decide what\u0027s fair. I appreciate the suggestions.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-09-30T03:12:07Z","Content":"\n\u003Cp\u003EAwesome idea! I\u0027ve always wanted to do something like this through cfg edits, because I don\u0027t like the whole kethane -\u0026gt; \u003Cstrong\u003Eeverything\u003C/strong\u003E system. It\u0027s been like that for a while.\u003C/p\u003E\u003Cp\u003EPersonally, I think it would be better to use SQUAD\u0027s slightly modified (hexagen / hydrogen) resource names. After all, this is the Kerbol system. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2013-09-30T03:20:41Z","Content":"\n\u003Cp\u003EI was thinking of adding a resource myself but may just piggy bank of yours if you\u0027re willing. Will send a pm.\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-09-30T08:34:14Z","Content":"\n\u003Cp\u003EFor the sake of simplicity i prefer normal names. When i have xenon and titanium i don\u0027t have to scratch my head wondering what would it be useful for - zeonium and lithite might cause such problems. Situation would be different if SQUAD officially published list of elements that would be included in resource update. But from what we know it\u0027s still in flux, and some elements shown before dropped off the chart since then.\u003C/p\u003E\n"},{"CreatedByName":"Ballistic Idiot","CreatedById":82736,"CreatedDateTime":"2013-09-30T12:36:04Z","Content":"\n\u003Cp\u003EI\u0027d love to see a mod that gives you some potential for resources on other planets but isn\u0027t as simplistic as Kethane. A robust interplanetary space program should be a technical feat needing multiple resource extraction points on Laythe and having to move resources on a planet that is tidally locked to another sounds like just the kind of complication that gets me going.\u003C/p\u003E\u003Cp\u003EI think you might be biting off quite a part count though. I\u0027d still love to see it, and cheers to you for taking it on.\u003C/p\u003E\u003Cp\u003EOoh, I think I just got all tingly thinking about needing a cargo truck on Laythe.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-09-30T12:52:25Z","Content":"\n\u003Cp\u003EThe greater simplicity can be had with invented names, because they give license for abstraction. It allows you to have just one kind of noble gas, one kind of hydrocarbon, one structural metal, one heavy (nuclear) element, etc.\u003C/p\u003E\u003Cp\u003EThe names aren\u0027t the important thing to me, though. It\u0027s having two or three intermediate products between what you dig up and what you put in your engines, and the different ways you can remix them.\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-09-30T13:08:55Z","Content":"\n\u003Cp\u003EI was working on this same thing, using the Squad names like Rhoark is, I ran into the same roadblock as you, can\u0027t make drills and pumps.\u003C/p\u003E\u003Cp\u003ESo my vote is phoney names. \u003C/p\u003E\u003Cp\u003EI think it allows a lot more flexibility.\u003C/p\u003E\u003Cp\u003EI can easily say we can\u0027t have lakes of hydrogen on Eve, but much harder to argue against lakes of Propellium. \u003C/p\u003E\u003Cp\u003EThere\u0027s no real world explanation Minmus, anything you say I can explain why it doesn\u0027t work. However I don\u0027t know how Nitronite works, or Hexagen so sure.\u003C/p\u003E\n"},{"CreatedByName":"Vulkan","CreatedById":83177,"CreatedDateTime":"2013-09-30T22:20:54Z","Content":"\n\u003Cp\u003EI am definitely interested and as a taster present to you a couple of screenshots for my newly started atmospheric collection plugin.\u003C/p\u003E\u003Cp\u003ESo far the module keeps track of available IntakeAir from the stock intakes and calculates the ratio of the individual components in the atmosphere based on height. \u003C/p\u003E\u003Cp\u003ECurrently it\u0027s a simple 50:50 Oxygen:Nitrogen at sea level with a linear transition to 100% Nitrogen at 69km. \u003C/p\u003E\u003Cp\u003EI used the KSP-PartGenerator v3.0 by Lando for the part file and texture.\u003C/p\u003E\u003Cp\u003EThe plan is to have a different profile for each planet with buttons on the GUI to separate each element into tanks. Power requirement for separation will increase with lower concentrations.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Fo4dQ9N.png\u0022 alt=\u0022Fo4dQ9N.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Lv7h84n.png\u0022 alt=\u0022Lv7h84n.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mushroomman","CreatedById":236,"CreatedDateTime":"2013-09-30T22:32:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vulkan\u0022 data-cite=\u0022Vulkan\u0022\u003E\u003Cdiv\u003EI am definitely interested and as a taster present to you a couple of screenshots for my newly started atmospheric collection plugin.\u003Cp\u003ESo far the module keeps track of available IntakeAir from the stock intakes and calculates the ratio of the individual components in the atmosphere based on height. \u003C/p\u003E\u003Cp\u003ECurrently it\u0027s a simple 50:50 Oxygen:Nitrogen at sea level with a linear transition to 100% Nitrogen at 69km. \u003C/p\u003E\u003Cp\u003EI used the KSP-PartGenerator v3.0 by Lando for the part file and texture.\u003C/p\u003E\u003Cp\u003EThe plan is to have a different profile for each planet with buttons on the GUI to separate each element into tanks. Power requirement for separation will increase with lower concentrations.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh man I would love you forever for this.\u003C/p\u003E\n"},{"CreatedByName":"Fractal_UK","CreatedById":61595,"CreatedDateTime":"2013-09-30T22:50:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EFor the sake of simplicity i prefer normal names. When i have xenon and titanium i don\u0027t have to scratch my head wondering what would it be useful for - zeonium and lithite might cause such problems. Situation would be different if SQUAD officially published list of elements that would be included in resource update. But from what we know it\u0027s still in flux, and some elements shown before dropped off the chart since then.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUsing a resource name that SQUAD is planning on using for a future resource system is probably a bad idea, it\u0027s asking for conflicts with a future stock resource system. Conflicts that could be seriously difficult and require a lot of work to fix in the worst cases.\u003C/p\u003E\n"},{"CreatedByName":"Hyratel","CreatedById":4486,"CreatedDateTime":"2013-09-30T23:57:38Z","Content":"\n\u003Cp\u003Emy suggestion is to have \u0022material roles\u0022\u003C/p\u003E\u003Cp\u003Eie, Ferrous like iron, Conductive, like copper or silver. Carbon is a universal\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-01T00:34:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fractal_UK\u0022 data-cite=\u0022Fractal_UK\u0022\u003E\u003Cdiv\u003EUsing a resource name that SQUAD is planning on using for a future resource system is probably a bad idea, it\u0027s asking for conflicts with a future stock resource system. Conflicts that could be seriously difficult and require a lot of work to fix in the worst cases.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr it could make it ready to work with the stock system out-of-the-box.\u003C/p\u003E\n"},{"CreatedByName":"Jahulath","CreatedById":78050,"CreatedDateTime":"2013-10-01T06:48:44Z","Content":"\n\u003Cp\u003EI\u0027ll make a drill this evening and post the model here if I come up with anything worth using.\u003C/p\u003E\n"},{"CreatedByName":"Radiokopf","CreatedById":74552,"CreatedDateTime":"2013-10-01T18:05:55Z","Content":"\n\u003Cp\u003EI made a pump (with a very very simple model) that knows when its in the Water and i makes some res. (e.g. Water on kerbin Propllant on Eve) dependet on the planet its on. You mount it on a KAS winch and eject it into the see basicly.\u003C/p\u003E\u003Cp\u003ECould be an idea for this one!\u003C/p\u003E\u003Cp\u003EI also made the LV-N toggleable between liquid fuel and \u0022Bluetonium\u0022 with having it have slighly more thrust with it.\u003C/p\u003E\u003Cp\u003EIts nuclear so it should use it, but make it need it would make it unusable.\u003C/p\u003E\u003Cp\u003EAlso, if you incorperate TAC\u0027s res we would have a full livesupport/resource System!\u003C/p\u003E\u003Cp\u003EWater is allready in.\u003C/p\u003E\u003Cp\u003ECO2 could be in some water or in the Athmosphere.\u003C/p\u003E\u003Cp\u003EFood is a bit more complicated.\u003C/p\u003E\u003Cp\u003EAs you see your not the frst one with this idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-01T18:11:35Z\u0022 title=\u002210/01/2013 06:11  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 1, 2013\u003C/time\u003E by Radiokopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2013-10-01T18:13:01Z","Content":"\n\u003Cp\u003EAh crap I wanted to make a mod like this, knew I shouldn\u0027t have waited \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-10-01T18:19:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NovaSilisko\u0022 data-cite=\u0022NovaSilisko\u0022\u003E\u003Cdiv\u003EAh crap I wanted to make a mod like this, knew I shouldn\u0027t have waited \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought they were waiting on you to make a stock like this...\u003C/p\u003E\n"}]}