{"TopicId":47211,"ForumId":36,"TopicTitle":"VaccerTech\u0026#039;s Lazy KSP Modding Showcase(Now with TARDIS and REPCONN)","CreatedByName":"Vaccer","CreatedById":2844,"CreatedDateTime":"2013-10-02T20:32:08Z","PageNum":1,"Articles":[{"CreatedByName":"Vaccer","CreatedById":2844,"CreatedDateTime":"2013-10-02T20:32:08Z","Content":"\n\u003Cp\u003EWell I\u0027m back(holds for applause, realizes no one remembers him) and better than ever... well not really \u0022better\u0022, but I am finally converting some of my old models from the grand old days of .12 and my Junk Parts Pack to the newest version, along with a few other surprises.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sjKMOrq.png\u0022 alt=\u0022sjKMOrq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3zKizEV.png\u0022 alt=\u00223zKizEV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EProgress From the Original Pack:\u003C/p\u003E\u003Cp\u003EBrass Cannon-Done\u003C/p\u003E\u003Cp\u003EMonolith TMA1-Done, but I might shrink it down a bit, the conversion makes me have to rescale everything manually in Unity but that\u0027s a simple task.\u003C/p\u003E\u003Cp\u003EWarp Nacelles; SAS Cap, Tank and Engine-Haven\u0027t started the conversion process yet. Might rework the textures, also yay no more need for 4 different rotations of them.\u003C/p\u003E\u003Cp\u003EBig Effin Engine-Still undecided if it\u0027s even needed after the intro of the mainsail but if anyone remembers it and wants that horrible looking thing I might add it in, although I might rework it completely if my skills improve at all from this exercise in 3d.\u003C/p\u003E\u003Cp\u003ENew Models:\u003C/p\u003E\u003Cp\u003ETardis\u003C/p\u003E\u003Cp\u003E Exterior: 90% finished, thinking of adding modeled on doorhandles and making some small texture tweaks, especially the window textures.\u003C/p\u003E\u003Cp\u003E Interior: completely unfinished in every possible way besides having a mockup of it ingame. Help with it would be nice, get you an invisible cookie and many thanks in the readme.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZsFk2vv.png\u0022 alt=\u0022ZsFk2vv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMoskit Cruise Missile - I have a model sitting around but I don\u0027t think I could do the thing justice texture wise. Still going to give it a shot though. I made it after seeing a thread long ago.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4mG0UlT.png\u0022 alt=\u00224mG0UlT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EREPCONN SERIES: As per an old request thread from 2012? Yes I take requests if I like them enough to put in the extra time and if I think it\u0027s something my limited modeling and texturing skills am capable of pulling off in a half decent manner.\u003C/p\u003E\u003Cp\u003EV29\u0022the red one\u0022\u003C/p\u003E\u003Cp\u003E Tank: Done but texture might get an upgrade, also might tweak the mesh a bit after playing New Vegas again.\u003C/p\u003E\u003Cp\u003E Main Engine: Same deal as tank.\u003C/p\u003E\u003Cp\u003E Fin: I\u0027m redoing the model from my old YouTube videos to more closely match the in game one.\u003C/p\u003E\u003Cp\u003ER77\u0022the blu one\u0022\u003C/p\u003E\u003Cp\u003E Nosecone: Mockedup\u003C/p\u003E\u003Cp\u003E Tank: Finished\u003C/p\u003E\u003Cp\u003E Engine: Finished\u003C/p\u003E\u003Cp\u003E Fin: Mockedup\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/y43cCaR.png\u0022 alt=\u0022y43cCaR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EZ43\u0022the green one\u0022\u003C/p\u003E\u003Cp\u003E Still in the early modeling stages, not really sure how I\u0027m getting this puppy working in game due to it\u0027s weird design. Pictures to come when I get a bit of time to make the thing a bit cleaner. Uv and texture will come when I decide how to split it up.\u003C/p\u003E\u003Cp\u003EThe One Those Crazy Ghouls Flew-no seriously I have no clue the designation number for it\u003C/p\u003E\u003Cp\u003E Still in extremely early modeling stages I just have a simple mockup until I get better pics and a bit more of the backstory, so I need to run a char through the beginning of NV again since I\u0027ve blasted them off in every other savefile I have. Unless of course there\u0027s a nice fallout-wiki page on it somewhere since the REPCONN HQ doesn\u0027t talk a lot about it in the displays.\u003C/p\u003E\u003Cp\u003ESo thats it so far, I\u0027m not planning any releases until I at least get the REPCONN stuff in a semi-working and stable state. Don\u0027t expect a speedy update process I get frustrated at unity sometimes and get distracted by shiny objects easily. \u003C/p\u003E\u003Cp\u003EI\u0027m also working on a series of YouTube video updates, be warned though the first 2 videos were made during a break from the internet but I decided to just upload them anyways instead of making new ones because I am the ultimate lazy modder/youtuber, thus the series and thread name. Hopefully my weird nature plus me making videos at 2am and having gigglefits at times from the sheer weirdness my parts cause in KSP will make people interested in it.\u003C/p\u003E\u003Cp\u003EFinally wondering if anyone has experience with off balance srbs/if I need to re-center certain models, some of them are as stable as ever and others like to buck like a wild bull.\u003C/p\u003E\u003Cp\u003EVaccerTech, we will rise again. Well I will rise again, no longer as junk parts but makers of stuff I want and maybe you do too. Questions welcome, answers uncommon.\u003C/p\u003E\u003Cp\u003EIf anyone\u0027s wondering VaccerTime is comparable to ValveTime.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-03T16:57:52Z\u0022 title=\u002210/03/2013 04:57  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 3, 2013\u003C/time\u003E by Vaccer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaccer","CreatedById":2844,"CreatedDateTime":"2013-10-03T16:21:19Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/p5mEEsFvnc0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/p5mEEsFvnc0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHow could I forget the video, the second prerecorded one will be up soon but in the meantime.\u003C/p\u003E\u003Cp\u003EUpdate: V29 Fin, old version on left, new untextured higher poly version in the middle, finless prototype on right. I was thinking about making a fin similar to the deltawing with built in flap for even more control for the finless nacelle. Textured version soonish?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VNGr9hr.png\u0022 alt=\u0022VNGr9hr.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EZ43, Seriously any ideas? Currently the fins are separate from the main body and so is part of the nose. So thats why everything isn\u0027t quite lined up.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zRZ7Saf.png\u0022 alt=\u0022zRZ7Saf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: Just read up on some things and found out about the new tga texture standards, thankfully I found that out early enough to enact it as I work on my new stuff.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-03T16:48:37Z\u0022 title=\u002210/03/2013 04:48  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 3, 2013\u003C/time\u003E by Vaccer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"natas","CreatedById":56957,"CreatedDateTime":"2014-09-10T17:55:43Z","Content":"\n\u003Cp\u003Ecan some1 revive this mainly the repconn stuff\u003C/p\u003E\n"},{"CreatedByName":"RDKILLERZ","CreatedById":30583,"CreatedDateTime":"2017-05-13T13:46:33Z","Content":"\n\u003Cp\u003E\nI remember this pack from the early days, it was my go to mod before I bought the game itself, fun times!\n\u003C/p\u003E\n"}]}