{"TopicId":48668,"ForumId":36,"TopicTitle":"Decouplers are for babies!","CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-16T19:02:27Z","PageNum":1,"Articles":[{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-16T19:02:27Z","Content":"\n\u003Cp\u003EHELLO MODDING COMMUNITY! First of all I would like to thank all the fellow modders, add-on developers, plug-in writers, just basically everyone, including the game devs for not only making this game, but making it so accessable to the modding community! That being said, Jebediah and I have been working on a decoupler and I have been having a frighteningly hard time trying to get the decoupler to stack in the builder. It stacks fine in the -Y axis but doesn\u0027t in the \u002BY. In fact, now that I\u0027ve mentioned it, since it only stacks in the -Y it means that the decoupler is upside down when it is selected from the Structural tab. Here is the code in case anyone is wondering. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E// --- general parameters ---\u003Cbr\u003Ename = TestDecoupler\u003Cbr\u003Emodule = Part\u003Cbr\u003Eauthor = valdimer\u003Cbr\u003E\u003Cbr\u003E// --- asset parameters ---\u003Cbr\u003Emesh = model.mu\u003Cbr\u003ErescaleFactor = .04\u003Cbr\u003E\u003Cbr\u003E// --- node definitions ---\u003Cbr\u003E// definition format is Position X, Position Y, Position Z, Up X, Up Y, Up Z\u003Cbr\u003Enode_stack_bottom = 0.0, -1.0, 0.0, 0.0, 1.0, 0.0, 2\u003Cbr\u003Enode_stack_top = 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 2\u003Cbr\u003E\u003Cbr\u003E// --- FX definitions ---\u003Cbr\u003E\u003Cbr\u003Efx_gasBurst_white = 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, decouple\u003Cbr\u003Esound_decoupler_fire = decouple\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E// --- editor parameters ---\u003Cbr\u003Ecost = 200\u003Cbr\u003Ecategory = Structural\u003Cbr\u003Esubcategory = 0\u003Cbr\u003Etitle = TestDecoupler\u003Cbr\u003Emanufacturer = Infinity Space INC\u003Cbr\u003Edescription = Basic branded decoupler.\u003Cbr\u003E\u003Cbr\u003E// attachment rules: stack, srfAttach, allowStack, allowSrfAttach, allowCollision\u003Cbr\u003EattachRules = 1,0,1,1,0\u003Cbr\u003E\u003Cbr\u003E// --- standard part parameters ---\u003Cbr\u003Emass = 0.4\u003Cbr\u003EdragModelType = default\u003Cbr\u003Emaximum_drag = 0.2\u003Cbr\u003Eminimum_drag = 0.2\u003Cbr\u003EangularDrag = 2\u003Cbr\u003EcrashTolerance = 9\u003Cbr\u003EbreakingForce = 200\u003Cbr\u003EbreakingTorque = 200\u003Cbr\u003EmaxTemp = 3400\u003Cbr\u003EfuelCrossFeed = True\u003Cbr\u003EstageOffset = 1\u003Cbr\u003EchildStageOffset = 1\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E    name = ModuleDecouple\u003Cbr\u003E    ejectionForce = 250\u003Cbr\u003E\texplosiveNodeID = top\u003Cbr\u003E}\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-10-16T19:17:23Z","Content":"\n\u003Cp\u003EMy Jeb just uses a hack saw while in flight. Admittedly he needs to cut fast. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2013-10-16T20:21:39Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EYour bottom attachment point is pointing up into the decoupler (vector 0, 1, 0 is straight up), it needs to be pointing away from your model, please try changing it too\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Enode_stack_bottom = 0.0, -1.0, 0.0, 0.0, -1.0, 0.0, 2\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EApparently not for decouplers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-17T00:07:16Z\u0022 title=\u002210/17/2013 12:07  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 17, 2013\u003C/time\u003E by NoMrBond\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-16T21:31:52Z","Content":"\n\u003Cp\u003ENoMrBond: I altered the vectors in the code, and no effect. I\u0027m beginning to wonder i there is another configuration file I should be editing in order to make decouplers work correctly? \u003C/p\u003E\u003Cp\u003EBostLabs: Your Jeb is one hardcore mofo, if I could get my Jeb to do that, I wouldn\u0027t even bother with my decouplers niether.\u003C/p\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-16T21:34:40Z","Content":"\n\u003Cp\u003EOh and by the way, If I am posting this in the wrong thread please inform me, and I apologize in advance. Jeb INSISTED that this is where I must go to ask for debugging tips.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-16T21:45:06Z","Content":"\n\u003Cp\u003EIf its upside down in VAB then you need to flip the model (the top level model bit...NOT the EmptyGameObject with part tools in it) in Unity.\u003C/p\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-16T22:02:24Z","Content":"\n\u003Cp\u003EKhaosCorp: Thank you for the speedy reply! So, anywho, I flipped it in max, re-exported to Unity, wrote it out with partools aaaand POOF! No change... I was just as surprised as you were, it doesn\u0027t make any sense. It should\u0027ve at least pointed in the Y\u002B direction but for some reason it isn\u0027t....although Jeb did point out to me that in the code of the stock decouplers, they are labed 1 and 2, yet there is only 1 .mu file but there are 2 texture files while most of the other stock parts that I\u0027ve flipped through, only have one.... am I missing something? Oh and yes, I double checked the direction of the model in Max just to make sure, and no change.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2013-10-16T22:31:52Z","Content":"\n\u003Cp\u003EGood point, I also forget to set X = 90\u0027 pretty frequently so make sure your model is pointing the right way\u003C/p\u003E\u003Cp\u003E(for blender it\u0027s Object mode X = -90, apply (ctrl\u002Ba) rotation, x = 90)\u003C/p\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-16T23:08:33Z","Content":"\n\u003Cp\u003ESoo, I was searching through another mod called the Deep Space Mining pack, and they had decouplers in their mod as well. They seem to be having the same issue with their decouplers as I am having with mine. There is only one attachment node located on the bottom (-Y) axis. I wonder if this is something that hasn\u0027t found a workaround. You know, Jeb really picked a beast of a first part for me to try and create.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2013-10-17T00:06:14Z","Content":"\n\u003Cp\u003EI checked a bunch of examples and they all have both the vectors for the top and bottom nodes pointing up for both separators and decouplers (0, 1, 0), so I guess that\u0027w wrong :\\ sorry about that.\u003C/p\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-17T00:24:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NoMrBond\u0022 data-cite=\u0022NoMrBond\u0022\u003E\u003Cdiv\u003EI checked a bunch of examples and they all have both the vectors for the top and bottom nodes pointing up for both separators and decouplers (0, 1, 0), so I guess that\u0027w wrong :\\ sorry about that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat makes me a sad panda....I wonder what could be wrong??? Everything seems to be in working order so why is this being such a bugger.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-17T00:54:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022valdimer\u0022 data-cite=\u0022valdimer\u0022\u003E\u003Cdiv\u003EKhaosCorp: Thank you for the speedy reply! So, anywho, I flipped it in max, re-exported to Unity, wrote it out with partools aaaand POOF! No change... I was just as surprised as you were, it doesn\u0027t make any sense. It should\u0027ve at least pointed in the Y\u002B direction but for some reason it isn\u0027t....although Jeb did point out to me that in the code of the stock decouplers, they are labed 1 and 2, yet there is only 1 .mu file but there are 2 texture files while most of the other stock parts that I\u0027ve flipped through, only have one.... am I missing something? Oh and yes, I double checked the direction of the model in Max just to make sure, and no change.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo no, thats not what i said =P Change its orientation in Unity, bugger all whats going on in your modeling software. Unity does odd things with rotation on import based on file type. Also make sure you set all mesh to 1:1 scale in your modeling program before export...good to zero out rotations too when possible (usually only animations bar you from doing this).\u003C/p\u003E\u003Cp\u003EI have made a set of hollow stage decouplers and they have 2 nodes, and work rather nice: \u003Ca href=\u0022http://www./download/028dd8v6i2pu7zi/HollowStageDecouplers.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/028dd8v6i2pu7zi/HollowStageDecouplers.zip\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tiberion","CreatedById":8356,"CreatedDateTime":"2013-10-17T01:15:30Z","Content":"\n\u003Cp\u003Eto make your nodes show up, use this:\u003C/p\u003E\u003Cp\u003Enode_stack_top = 0.0, 1.0, 0.0, 0.0, 1.0, 0.0, 2\u003C/p\u003E\u003Cp\u003Enode_stack_bottom = 0.0, -1.0, 0.0, 0.0, -1.0, 0.0, 2\u003C/p\u003E\u003Cp\u003EYou have your module set up right because explosiveNodeID = top means it will release the top node, detaching itself and whatever is attached below it from your ship.\u003C/p\u003E\u003Cp\u003EHaving the model flipped upside down should not affect the function, just the asthetics.\u003C/p\u003E\u003Cp\u003EAlso:\u003C/p\u003E\u003Cp\u003ErescaleFactor = .04\u003C/p\u003E\u003Cp\u003Ethis is an extremely small rescale, how big is the model in your 3d modeling software? That is 4% of its natural size. I have a feeling that the scaling may be off, try setting the scale in Unity to .04 on all three axis if your part is naturally that huge.\u003C/p\u003E\u003Cp\u003EAlso try adding scale = 1.0 right under the rescaleFactor entry in your config. I have a feeling it may be defaulting to something else and even though your nodes are \u00222\u0022 units apart, they still overlaps due to the huge scale. Or you can try setting the node \u002B/-Y positions to 10 and -10 or even 100 and -100 to see if they are showing up.\u003C/p\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-18T04:13:21Z","Content":"\n\u003Cp\u003EHello fellow modders! I will be redoing the decoupler from start to finish! As it turns out I completely forgot to reset Xform in max. So to answer your question tiberion I somehow managed to not pay attention to my scale size and ALTHOUGH I thought I was working with the right scale (which by the numbers, I was) as it turns out I did do a universal scale, which Max then saves as a transform in the mesh. So in doing so, I probably could have had both nodes of the decoupler showing up, but after being translated from Unity into Kerbal, the part stack nodes were on TOP of each other. Your right as well Tiberion as the rescale value was at an EXTREMELY small scale. As it turns out, no matter how you rescale your mesh, the code for the nodes MUST still match up to the original size of the mesh, and since I didn\u0027t know the original mesh size because of the universal scale FUBAR, I couldn\u0027t fix it although I\u0027m assuming my code probably would\u0027ve looked something like \u0022node_stack_top = 0.0, 47.0, 0.0, 0.0, 1.0, 0.0, 2\u0022 (yes my mesh turned out THAT huge! Just goes to show, PAY ATTENTION TO YOUR MESH SIZE WHILE MODELING and DOUBLE CHECK before entering into unity. But I did run a test cylinder model through WITH the correct size parameters and it worked like a charm! Can\u0027t be too mad though, it was my first attempt ever, and it wasn\u0027t a complete fail, plus you guys were INSANELY helpful! JEB LOVES YOU\u003C/p\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-18T04:16:00Z","Content":"\n\u003Cp\u003EOh and Khaoscorp, the mesh was always oriented in the right direction...turns out that that wasn\u0027t it but thanks for the advice!\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-18T04:43:16Z","Content":"\n\u003Cp\u003EEven going Blender\u0026gt;Unity\u0026gt;KSP i have had some issue with part where i forgot to reset scale of the mesh before export. Mainly with colliders clipping, but some other stuff.....\u003C/p\u003E\u003Cp\u003EIts the small stuff what gets ya when moddin....never huge easy to spot problems...always lil gremlins\u003C/p\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-18T06:03:25Z","Content":"\n\u003Cp\u003EKHAOSCORP: I\u0027m really beginning to get the feeling with that, although I\u0027d have to give Squad some credit. Unity has been the most unstable game engines i\u0027ve ever worked with or played games on (minus Torque), but they\u0027re doing a rock solid job with their programming so far.\u003C/p\u003E\u003Cp\u003EAlso I feel the need to ask, I\u0027ve noticed some mods need to be installed directly into the KSP/Gamedata folder while others can just go in the KSP/parts folder...why is that?\u003C/p\u003E\n"},{"CreatedByName":"valdimer","CreatedById":88223,"CreatedDateTime":"2013-10-18T06:09:19Z","Content":"\n\u003Cp\u003EThose are some smexy little decouplers you got there, although they do stack a bit wierd when attaching to the bottom node. It\u0027s as if the -Y node is set just a smidge to high. Maybe it\u0027s just me at 1am but i\u0027ll fart around with it and see if it\u0027s not just space dementia.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2013-10-18T06:13:15Z","Content":"\n\u003Cp\u003EThe way mods worked in earlier versions (0.19 and prior, legacy method) they went into the ..\\Kerbal Space Program\\Parts or ...\\Kerbal Space Program\\Plugins etc, but from 0.20 onwards mods are meant to go into their own directories inside the GameData directory (i.e. ...\\Kerbal Space Program\\GameData\\KOSMOS)\u003C/p\u003E\u003Cp\u003EI\u0027m sure there are specifics as to why, unfortunately I didn\u0027t really start getting into modding until after the changeover the \\GameData\\mod and the PART{} changes were all in\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-10-18T06:42:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022valdimer\u0022 data-cite=\u0022valdimer\u0022\u003E\u003Cdiv\u003EThose are some smexy little decouplers you got there, although they do stack a bit wierd when attaching to the bottom node. It\u0027s as if the -Y node is set just a smidge to high. Maybe it\u0027s just me at 1am but i\u0027ll fart around with it and see if it\u0027s not just space dementia.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf your talking about the hollow ones i linked you are correct. The bottom node is set up into the decoupler, allowing for the thinest stock probecore to be attached between the decoupler and the tank just below it..usefull for deorbiting stages. Also they have colliders kinda like a faring does, so they are truly hollow, allowing better internal stage struting/fuel sharing, they need work, but due to hard drive mishap i dont have the parts or models or nothing.\u003C/p\u003E\n"},{"CreatedByName":"NoMrBond","CreatedById":69263,"CreatedDateTime":"2013-10-18T07:02:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003EIf your talking about the hollow ones i linked you are correct. The bottom node is set up into the decoupler, allowing for the thinest stock probecore to be attached between the decoupler and the tank just below it..usefull for deorbiting stages. Also they have colliders kinda like a faring does, so they are truly hollow, allowing better internal stage struting/fuel sharing, they need work, but due to hard drive mishap i dont have the parts or models or nothing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you have the .mu files, Taniwha made a .mu loader for blender, through which you may be able to recover a significant portion of the work\u003C/p\u003E\u003Cp\u003E[Edit] \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43513-Blender-mu-import-export-addon\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E\u003C/p\u003E\n"}]}