{"TopicId":49779,"ForumId":36,"TopicTitle":"Realism Overhaul","CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-20T23:43:51Z","PageNum":12,"Articles":[{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-10-29T20:21:39Z","Content":"\n\u003Cp\u003EYes, pressing \u0027.\u0027 and then \u0027,\u0027 repetitively causes stuff to nudge to the East!\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-10-29T21:21:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AbeS\u0022 data-cite=\u0022AbeS\u0022\u003E\u003Cdiv\u003EYes, pressing \u0027.\u0027 and then \u0027,\u0027 repetitively causes stuff to nudge to the East!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrangely enough, even stock KSP does this as well (the weird re positioning), but not enough as to make you move. But I\u0027ve been able to screw up my launch clamps by doing so.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-29T21:34:22Z","Content":"\n\u003Cp\u003EOh! Of course! You said east.\u003C/p\u003E\u003Cp\u003EI wonder if it\u0027s to do with rotation? And the rescale has a higher linear velocity, despite lower angular velocity.\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-10-30T01:47:06Z","Content":"\n\u003Cp\u003ESo back to the realism overhaul, how hard would it be to scale all the rockets? Would we (you guys actually) just need to scale everything from 0.64 to 1.00? Or scale stuff based on real life parts? Or both?\u003C/p\u003E\u003Cp\u003EFor example Stock parts would go from 0.64 to 1.00 and FASA parts would go from their actual size to the real ones (like Nathan did).\u003C/p\u003E\u003Cp\u003EEDIT: Also the masses would vary and the engines stats too, that makes it more complicated I think?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-30T01:49:13Z\u0022 title=\u002210/30/2013 01:49  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 30, 2013\u003C/time\u003E by AbeS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-30T02:50:27Z","Content":"\n\u003Cp\u003EI wouldn\u0027t touch the existing tank and engine sizes; there\u0027s still a need for .625, 1.25, and 2.5m rocket cores. Addons give us 3.75m and 5m. All we need now are the sizes above that.\u003C/p\u003E\u003Cp\u003EProbe parts--MedievalNerd was working on a pack of smaller probe parts, for early probes. (Explorer 1? 13kg.) That should work well for this mod.\u003C/p\u003E\u003Cp\u003ESquad\u0027s crewed capsules, however, should be scaled by 1/.64, yes. Though the masses can stay as they are. If you add the recovery equipment and heatshield mass in each case, they come out about right.\u003C/p\u003E\u003Cp\u003EBut that leads us to the question of what our standard sizes should be. Should we stick with the existing 1.25m per step, and have the crewed parts be odd man out? Should we go to steps of 1m, to better fit US capsule and rocket diameter? (Mk1 rescaled by 1/.64 would have a 1m top and 2m bottom, and the Mk1-2 would have a 2m top and 4m bottom, and Titan II has a 3m core). Of course S-IVB (and the Saturn IB) had 6.6m diameter cores, so that doesn\u0027t fit so well. Back to fitting for Saturn V, with a 10m core.\u003C/p\u003E\u003Cp\u003EI don\u0027t know Russian cores off the top of my head, I\u0027m afraid.\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-10-30T03:46:27Z","Content":"\n\u003Cp\u003EI am no expert but by reading a bit about the R-7, Proton, Zenit and Energia families, the diameters are almost the same as the ones you mentioned:\u003C/p\u003E\u003Cp\u003ER-7 has 2.95 m\u003C/p\u003E\u003Cp\u003EProton 4.1 m\u003C/p\u003E\u003Cp\u003EZenit 3.9 m\u003C/p\u003E\u003Cp\u003EEnergia 3.9 m (strap-on boosters), 7.75 m (core stage)\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-30T04:03:53Z","Content":"\n\u003Cp\u003ESounds like it might be worth going to steps of 1m then. Or maybe steps of 2m above 4m.\u003C/p\u003E\u003Cp\u003EHow about: steps of 1m (size 0 = 0.5m) until 4m\u003C/p\u003E\u003Cp\u003EThen steps of 2m until 10m\u003C/p\u003E\u003Cp\u003EThat means we only need 6m, 8m, and 10m diameter tanks/engines/decouplers. That can be done with rescales.\u003C/p\u003E\u003Cp\u003EWhat we really need are more realistic engine models. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-10-30T04:19:56Z","Content":"\n\u003Cp\u003EI think those diameters sound good! And a dumb question, what do you mean with the more realistic engine models?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-30T04:40:18Z","Content":"\n\u003Cp\u003EWe have vacuum engines with tiny, wrongly-curved nozzles, lower-stage engines with nozzles that...I just can\u0027t even, and engines that are all nozzle and no turbopump. Squad\u0027s (and, following suit, modders\u0027) engines\u0027 nozzles usually bear no relation to the role of the engine or it\u0027s performance. Consider for example Apollo\u0027s Service Propulsion System. It\u0027s nozzle is gigantic in KSP terms--2.5m diameter or so, ~3m length. But the throat is miniscule--as small as the throat on an LV-T45 at most, if not rather smaller. And it delivers ~70kN thrust. Vacuum-rated nozzles should be very large, very light, and have a very high area ratio (exit:throat). Sea-level-optimized nozzles should have low area ratios (which almost all of Squad\u0027s nozzles do, fine) but they should also be rather longer. Only the LV-T30 and T45 even approach the right aspect ratio.\u003C/p\u003E\u003Cp\u003EThis is _not_ my area of expertise. Just what I\u0027ve picked up. IIRC regex, rhoark, asmi, and others know rather more.\u003C/p\u003E\n"},{"CreatedByName":"AbeS","CreatedById":80644,"CreatedDateTime":"2013-10-30T05:01:12Z","Content":"\n\u003Cp\u003EI get it! I thought you meant the fact that thrust and isp are independent or something like that, but thinking about it that also should be related to the nozzle like in real life!\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-10-30T06:59:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AbeS\u0022 data-cite=\u0022AbeS\u0022\u003E\u003Cdiv\u003EI get it! I thought you meant the fact that thrust and isp are independent or something like that, but thinking about it that also should be related to the nozzle like in real life!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suppose, but sooner or later suspension of disbelief has to come into play as well.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-10-30T17:42:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESquad\u0027s crewed capsules, however, should be scaled by 1/.64, yes. Though the masses can stay as they are. If you add the recovery equipment and heatshield mass in each case, they come out about right.\u003C/p\u003E\u003Cp\u003EBut that leads us to the question of what our standard sizes should be. Should we stick with the existing 1.25m per step, and have the crewed parts be odd man out? Should we go to steps of 1m, to better fit US capsule and rocket diameter?\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI still do not understand why you would go through all that trouble to end up with not proportionally scaled craft, especially if those are not proportional amongst each other. First we were playing with scale models of planets, with the planets fixed we will be flying with scale models of rockets.\u003C/p\u003E\n"},{"CreatedByName":"SFJackBauer","CreatedById":82269,"CreatedDateTime":"2013-10-30T19:28:00Z","Content":"\n\u003Cp\u003EAlthough it is good to reuse existing models from a practical standpoint, in the long-term, isn\u0027t it better to develop an independent pack, with real-life modular parts possessing the correct size, mass, and fuel amount?\u003C/p\u003E\u003Cp\u003EFor example, building a Delta IV could be broken down into assemblying:\u003C/p\u003E\u003Cp\u003E- RS-68\u003C/p\u003E\u003Cp\u003E- 5m x 25m tank with 40t of LH2\u003C/p\u003E\u003Cp\u003E- 5m x 10m tank with 160t of LOX\u003C/p\u003E\u003Cp\u003E- 5m interstage with decoupler\u003C/p\u003E\u003Cp\u003E- RL-10\u003C/p\u003E\u003Cp\u003E- 5m x 6m tank with 22t of LOX\u003C/p\u003E\u003Cp\u003E- 5m x 2m tank with 5t of LH2\u003C/p\u003E\u003Cp\u003E- 5m payload and fairing adapter\u003C/p\u003E\u003Cp\u003EThose parts could be mixed and reused to create other realistic rocket models. The shuttle external tank for example, its about the same length of the Delta IV first stage, only exchanging the round cylindrical LH2 tank for a conical one, and a bottom round seal. Also the Ares or SLS could be built from it since they had/will have cryogenic cores. The solid boosters could be built from individual segments.\u003C/p\u003E\u003Cp\u003EThe same philosophy could be carried through everything else. What I wonder is what is more demanding - keeping track of all the released rocketry packs, tweaking their mass/fuel values as Modular Fuels does now, and also resizing them as it is being proposed, or develop pre-built modular parts from scratch?\u003C/p\u003E\n"},{"CreatedByName":"p3asant","CreatedById":83235,"CreatedDateTime":"2013-10-30T20:20:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SFJackBauer\u0022 data-cite=\u0022SFJackBauer\u0022\u003E\u003Cdiv\u003EAlthough it is good to reuse existing models from a practical standpoint, in the long-term, isn\u0027t it better to develop an independent pack, with real-life modular parts possessing the correct size, mass, and fuel amount?\u003Cp\u003EFor example, building a Delta IV could be broken down into assemblying:\u003C/p\u003E\u003Cp\u003E- RS-68\u003C/p\u003E\u003Cp\u003E- 5m x 25m tank with 40t of LH2\u003C/p\u003E\u003Cp\u003E- 5m x 10m tank with 160t of LOX\u003C/p\u003E\u003Cp\u003E- 5m interstage with decoupler\u003C/p\u003E\u003Cp\u003E- RL-10\u003C/p\u003E\u003Cp\u003E- 5m x 6m tank with 22t of LOX\u003C/p\u003E\u003Cp\u003E- 5m x 2m tank with 5t of LH2\u003C/p\u003E\u003Cp\u003E- 5m payload and fairing adapter\u003C/p\u003E\u003Cp\u003EThose parts could be mixed and reused to create other realistic rocket models. The shuttle external tank for example, its about the same length of the Delta IV first stage, only exchanging the round cylindrical LH2 tank for a conical one, and a bottom round seal. Also the Ares or SLS could be built from it since they had/will have cryogenic cores. The solid boosters could be built from individual segments.\u003C/p\u003E\u003Cp\u003EThe same philosophy could be carried through everything else. What I wonder is what is more demanding - keeping track of all the released rocketry packs, tweaking their mass/fuel values as Modular Fuels does now, and also resizing them as it is being proposed, or develop pre-built modular parts from scratch?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see any real need for editing/adding bigger tanks. Using stretchytanks is pretty easy solution and adapters can be re-scaled ( e.g i have the novapunch 3.75m-5m rescaled for 5-6.5 and 6.5-11.25 or so).\u003C/p\u003E\u003Cp\u003EOnly problem is the lack of big (and small) realistic engines.\u003C/p\u003E\u003Cp\u003EAlso for upper stage engines adding couple versions of the KwRocketry service engine in different sizes would probably work because it looks like a real vacuum engine.\u003C/p\u003E\n"},{"CreatedByName":"SFJackBauer","CreatedById":82269,"CreatedDateTime":"2013-10-30T21:54:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022p3asant\u0022 data-cite=\u0022p3asant\u0022\u003E\u003Cdiv\u003EI don\u0027t see any real need for editing/adding bigger tanks. Using stretchytanks is pretty easy solution and adapters can be re-scaled ( e.g i have the novapunch 3.75m-5m rescaled for 5-6.5 and 6.5-11.25 or so).\u003Cp\u003EOnly problem is the lack of big (and small) realistic engines.\u003C/p\u003E\u003Cp\u003EAlso for upper stage engines adding couple versions of the KwRocketry service engine in different sizes would probably work because it looks like a real vacuum engine.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe service engine looks like a real \u003Cstrong\u003EApollo SM\u003C/strong\u003E vacuum engine.\u003C/p\u003E\u003Cp\u003ESee that\u0027s the problem. With resizing you end up with a bunch of things of different sizes that look the same, losing identity. When in real-life they will probably look completely different. For example the KW Wildcat XR makes for a good J-2/J-2X model - a high-thrust, high ISP vacuum engine. You can\u0027t just downsize it and pretend it is its smaller counterpart, the RL-10 - well you can, but that defeats the purpose of having different models (I\u0027d say the KW equivalent for the RL-10 would be the Vesta VR9D for the dual version and Wildcat V for the single).\u003C/p\u003E\u003Cp\u003EThe same about tanks - the NP 5m tanks are kerolox, Saturn-V style. You see KW actually included two variants of their largest tanks - a white and a orange one - because the orange large first stage is always correlated to a cryogenic stage like in Delta IV or the shuttle, due to the insulation. I know you can\u0027t judge what is inside the tank from the appearance only, but it counts.\u003C/p\u003E\u003Cp\u003EAnd lastly, we could give things their real names and their real stats directly into the part configs. This way you could quickly see - ah I want to use an F-1 engine, then I need a kerosene/lox tank - without the plethora of configurations and overrides present in MFS, with different tech levels, different modes for some engines, and different fuel for tanks. IRL you wouldn\u0027t take a Delta IV first stage and fill it with kerosene - you would design a completely new tank.\u003C/p\u003E\n"},{"CreatedByName":"pina_coladas","CreatedById":9346,"CreatedDateTime":"2013-10-30T22:21:32Z","Content":"\n\u003Cp\u003EJust change the tank texture to something orange on the fly when using LH2! Stretchy tanks allows that kind of texture swapping already. It\u0027s too bad that the current version of stretchy tanks is so finnicky to use with modular fuels though... Is a fork possible?\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2013-10-30T23:36:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pina_coladas\u0022 data-cite=\u0022pina_coladas\u0022\u003E\u003Cdiv\u003EJust change the tank texture to something orange on the fly when using LH2! Stretchy tanks allows that kind of texture swapping already. It\u0027s too bad that the current version of stretchy tanks is so finnicky to use with modular fuels though... Is a fork possible?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat\u0027s finicky about it? \u003C/p\u003E\u003Cp\u003EYou know there\u0027s a patch for it right? Originally mine but Nathan took it and incorporated a metric **** ton of other features and you should totally go get it.\u003C/p\u003E\u003Cp\u003EBetween us we fixed a bunch of stuff.\u003C/p\u003E\n"},{"CreatedByName":"pina_coladas","CreatedById":9346,"CreatedDateTime":"2013-10-31T01:22:56Z","Content":"\n\u003Cp\u003EI\u0027m using Nathan\u0027s patch. My experience has been that it does make stretchy tanks work with MFS, but the MFS dry mass and fuel density values are sort of tacked-on and constantly being overwritten by the default stretchy tanks values. So every time I re-size a tank its values are recalculated with the \u0022stock\u0022 ratios. That\u0027s not too terrible, but the MFS values also seem to get overwritten whenever I grab and move a tank, and whenever I load a craft in the VAB. So every time I revert to the VAB or load the craft in the VAB I have to go through each tank in the MFS menu to get the values right and then try not to touch anything before I hit launch.\u003C/p\u003E\u003Cp\u003EAm I an idiot who installed something wrong? I assumed the lack of support from the stretchy tanks author made it difficult to add MFS compatibility and it was this way for everyone. It really takes the joy and wonder out of making Saturn V replicas unfortunately.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-31T01:40:23Z","Content":"\n\u003Cp\u003Epina_coladas, try the latest patch in my signature, and MFS v3 full (both just released). I believe it is finally working correctly now. It used to only half work (sometimes giving the symptoms you describe), that\u0027s why I recently fixed it.\u003C/p\u003E\u003Cp\u003EI\u0027m currently trying to get the colliders to play nice with ferram\u0027s KJR.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-31T01:50:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EI still do not understand why you would go through all that trouble to end up with not proportionally scaled craft, especially if those are not proportional amongst each other. First we were playing with scale models of planets, with the planets fixed we will be flying with scale models of rockets.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUm...since feram released KJR, we\u0027re plannng on doing full-scale rockets.\u003C/p\u003E\u003Cp\u003E(Although even if we _were_ playing with scale rockets, that wouldn\u0027t matter as long as the ballistic coefficients matched, as ferram and I were discussing above; the point of rescaling planets is that it changes the deltaV [and therefore DRASTICALLY changes the mass ratio required], but playing with 64% scale rockets just means they suffer a few hundred m/s more drag if you play with scaled masses, or 50 m/s less drag if you play with real masses. Unless you fix the ballistic coefficients, in which case it\u0027s no different at all than 1:1 scale. Velocities and forces don\u0027t scale with the rocket size, and a 100m rocket vs a 64m rocket, well, hard to tell the difference vs. a 13000m diameter planet)\u003C/p\u003E\u003Cp\u003ESFJackBauer, since there already are released and playable Delta II, Delta IV, and Atlas V mods available, if you want to give them realistic size, mass, and other stats that would be awesome.\u003C/p\u003E\u003Cp\u003EI do not necessarily support using real engines and tanks generally, however, as it gives us much more flexibility to have just a few different engines per type per size, and let MFSC rescale their tech levels. Same with tanks; with StretchyTanks we can clone any existing tank size, and with an update I\u0027ll soon add to MFSC we can use the same tech levels system to change their dry mass fraction to be tech-appropriate.\u003C/p\u003E\u003Cp\u003EThe real issue is--as I\u0027ve found with MFSC, whose new spreadsheet supports over a hundred engines and solid motors, that there _still_ is far from enough variety, and I\u0027ve had to make do horribly. For instance, there are like _five_ engines that have decent vacuum nozzles. And we have to pretend they\u0027re open-cycle, closed-cycle, _and_ pressure-fed. We just don\u0027t have the models.\u003C/p\u003E\u003Cp\u003EThat said, there _are_ a number of models that are clones of real tanks/engines/etc., and it\u0027s worth having fully-real versions to use. I did that with Gemini, for instance, and it wouldn\u0027t be hard to do for the 1:1 F-1 engine, or the 1-1 S-IC somebody released, or the NK-33 (called RD-33) in the KOSMOS pack (if cBBp et al let us).\u003C/p\u003E\u003Cp\u003EFinally, regarding the orange foam. That was a comparatively recent invention, a new kind of insulation for cryo tanks. You\u0027ll note that the S-II and S-IVB on Saturn V (and the S-IVB on Saturn IB and the S-IV on Saturn I) all did not have it. And that some rockets that only have cryo LOX still have that foam (it\u0027s better cryo insulation, and LOX itself is cryo, though less so than LH2!).\u003C/p\u003E\u003Cp\u003EI do definitely support its existence as a tank paintscheme choice for ST and others, though!\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-10-31T02:23:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EThat said, there _are_ a number of models that are clones of real tanks/engines/etc., and it\u0027s worth having fully-real versions to use. I did that with Gemini, for instance, and it wouldn\u0027t be hard to do for the 1:1 F-1 engine, or the 1-1 S-IC somebody released, or the NK-33 (called RD-33) in the KOSMOS pack (if cBBp et al let us).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m gonna try to convince BobCat to make RD-170 engine, because I just love it, and he is the best man for the job \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EFinally, regarding the orange foam. That was a comparatively recent invention, a new kind of insulation for cryo tanks. You\u0027ll note that the S-II and S-IVB on Saturn V (and the S-IVB on Saturn IB and the S-IV on Saturn I) all did not have it. And that some rockets that only have cryo LOX still have that foam (it\u0027s better cryo insulation, and LOX itself is cryo, though less so than LH2!).\u003Cp\u003EI do definitely support its existence as a tank paintscheme choice for ST and others, though!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EShuttle\u0027s ET needed insulation because it was flying in the airstream (and as such was subjected to airloads and \u003Cstrong\u003Eheating\u003C/strong\u003E), while inline HydroLOx stages are in the aerodynamic shadow of the PLF, and as such are not heated by airflow (remember that in supersonic and hypersonic flight regime airstream behind the shockwave is almost nonexistent). Look at Centaur for example - although it uses HydroLOx, there is no insulation. DIV has insulation since its\u0027 CCB is supposed to be common with DIVH, which again has its\u0027 boosters flying in the airstream.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-31T02:26:46Z\u0022 title=\u002210/31/2013 02:26  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 31, 2013\u003C/time\u003E by asmi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-10-31T02:43:15Z","Content":"\n\u003Cp\u003EAh, thanks for that!\u003C/p\u003E\u003Cp\u003EHeh, and thanks for poking BobCat too. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI gather the orange on the Atlas\u0027s Centaur is just paint? The orange on the CCB is presumably for the same CCB reason you cite, unless again it\u0027s just paint because LOX doesn\u0027t need the foam?\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-11-01T01:16:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003Eand a 100m rocket vs a 64m rocket, well, hard to tell the difference vs. a 13000m diameter planet)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI kind of disagree there - as explained before- since a planet that is ~156% of what it visually should be at a certain height \u003Cem\u003Ewill\u003C/em\u003E show. That much difference is quite pronounced. However, as you wonderful lads intend to do full scale rockets, this will not be any issue at all. \u003C/p\u003E\u003Cp\u003E[Camacha sits back down quite happily]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T01:25:49Z\u0022 title=\u002211/01/2013 01:25  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by Camacha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-01T14:00:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022asmi\u0022 data-cite=\u0022asmi\u0022\u003E\u003Cdiv\u003EI\u0027m gonna try to convince BobCat to make RD-170 engine, because I just love it, and he is the best man for the job \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECBBP made such an engine once, along with RD-180 and RD-191. I think I might still have them around, but they\u0027re very old and might not work properly. They still look great, though.\u003C/p\u003E\n"},{"CreatedByName":"philonius","CreatedById":20174,"CreatedDateTime":"2013-11-01T15:23:04Z","Content":"\n\u003Cp\u003ENot sure if this has been discussed in this thread before, but I just rewatched BBC\u0027s \u0027Space Race\u0027 (which I highly recommend, awesome miniseries) , and one of the things that strikes me was just how experimental these rocket designs were, in other words, how often an unforeseen design flaw / manufacturing error caused the rocket to explode. \u003C/p\u003E\u003Cp\u003EHas there been any thought about incorporating failure probabilities in the realism overhaul? Fuel line ruptures, stuck fairings, \u0027Houston, we\u0027ve had a problem here\u0027 ? Perhaps a per-part failure chance, which can be influenced by techlevel and experience with flying the part. First time trying a new rocket? Expect debris. \u003C/p\u003E\u003Cp\u003EPerhaps a mod could be made that uses subassemblies for this purpose: When you design a booster, save it as subassembly. Then the mod tracks how often the subassembly has flown, with failure chance decreasing with flight rate. A new rocket\u0027s failure chance would be a function of tech level and how new the components are. A rocket comprising of an proven design with a modified upper stage would be more reliable than a new rocket. \u003C/p\u003E\u003Cp\u003EIf this can\u0027t be done automatically, it might be done manually. Upon launch, a dialog window could ask the player to identify the rocket\u0027s stages, and the failure chance is then set. Perhaps the bravery/stupidity of the crew (if any) might modify this setting. \u003C/p\u003E\u003Cp\u003ENot sure if this would significantly add to the fun in the end, but it would introduce some choices to the gameplay. Do I chance the lives of my brave kerbals on an unproven rocket, or do I do some test flights first? Obviously, this will be a more pressing choice when the money system goes live. Also, it provides a use for launch escape systems.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T15:43:11Z\u0022 title=\u002211/01/2013 03:43  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by philonius\u003C/strong\u003E\n\u003C/span\u003E\n"}]}