{"TopicId":51073,"ForumId":36,"TopicTitle":"[PLUGIN\u002BPARTS][0.23] SCANsat terrain mapping","CreatedByName":"damny","CreatedById":78621,"CreatedDateTime":"2013-10-29T16:06:22Z","PageNum":60,"Articles":[{"CreatedByName":"Zeroignite","CreatedById":1377,"CreatedDateTime":"2014-05-08T15:01:26Z","Content":"\n\u003Cp\u003EI still want to figure out which of the devs put that in.\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-05-08T17:41:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zeroignite\u0022 data-cite=\u0022Zeroignite\u0022\u003E\u003Cdiv\u003EI still want to figure out which of the devs put that in.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou mean the \u003C/p\u003E\u003Cp\u003E[spoiler below]\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FFFFFF;\u0022\u003Esmiley face in the ocean?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E[spoiler end]\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-05-08T19:22:06Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ESCANSAT and resource mapping.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis subject was already mentioned on a number of posts in February, but since then it has subsided. Any effective implementation of resources mapping is still to be achieved with SCANsat.\u003C/p\u003E\u003Cp\u003EI am considering planetary resources in general, most notably what is made available by the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64595\u0022 rel=\u0022external nofollow\u0022\u003EOpen Resources System\u003C/a\u003E (ORS), that is the resources system used by the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43839\u0022 rel=\u0022external nofollow\u0022\u003EInterStellar mod\u003C/a\u003E, and by the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/23979\u0022 rel=\u0022external nofollow\u0022\u003EKethane mod\u003C/a\u003E. \u003C/p\u003E\u003Cp\u003EAs with any other localized item, resources could be made to appear in a mapping tool. Map layers with already detected resources may be implemented with SCANsat, just like biome maps currently are.\u003C/p\u003E\u003Cp\u003EAs it is now, Interstellar only shows resources when a detector is close enough, but there is no memory of what has been detected (scanned).\u003C/p\u003E\u003Cp\u003EInterStellar brings a number of png maps in the install, to show the locations and relative density of uranium, thorium, water, alumina on different celestial bodies. The maps dimensions are different, and a config file holds all the required information for management of map data.\u003C/p\u003E\u003Cp\u003ESCANsat could use some of the techniques already in place to implement those maps. A section in the savegame about what has been scanned and where on any body, and code to reveal only those parts of a map already scanned. Being the maps readily available makes me guess this feature would require much less effort (from such good programmers as those already taking care of SCANsat) than other features already planned.\u003C/p\u003E\u003Cp\u003EAs for Kethane data, the system is pretty different (list of locations in savegame where deposits are), so SCANsat would require a method to render those locations on a map to be displayed. Kethane\u0027s author showed interest towards this feature (notably, in post \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55832-PLUGIN-PARTS-0-23-SCANsat-terrain-mapping?p=987092\u0026amp;viewfull=1#post987092\u0022 rel=\u0022external nofollow\u0022\u003E#1037\u003C/a\u003E), and sure knows how to help.\u003C/p\u003E\u003Cp\u003EI hope, now that SCANsat is getting improved again, that the above features may also come into planning.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2014-05-08T21:50:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starstrider42\u0022 data-cite=\u0022Starstrider42\u0022\u003E\u003Cdiv\u003EHmmm... that seems like an issue that could affect other plugins as well. Do you have any advice for the \u0022safest\u0022 way for modders to set up their plugin versions?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m hardly an expert on the subject, you\u0027d probably want to ask Mihara, because everything I know I learned from reading his thread.\u003C/p\u003E\u003Cp\u003ETrick being, I gather that it only applies in cases where one plugin is trying to call functions from another. It\u0027s not a problem within any particular mod, just when one mod tries to use parts of another.\u003C/p\u003E\u003Cp\u003EHe said something in one of the posts about being able to use \u0027reflection\u0027 to get around it, which I\u0027d guess is normally what gets used. Problem is, for RPM purposes, SCANSat/Mechjeb *itself* would have to be set up in some specific way in order to use it. If they were, it\u0027d work without the secondary plugins, a-la Vesselview (which has a specific version just for RPM.)\u003C/p\u003E\u003Cp\u003EBasically, RPM has a problem with it because Mihara\u0027s using a dirty, dirty hack to hook into a couple of mods that weren\u0027t really designed to be hooked into at all.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-05-09T05:16:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022diomedea\u0022 data-cite=\u0022diomedea\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003ESCANSAT and resource mapping.\u003C/strong\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve never looked at the Open Resources System, but I have spent some time with the Kethane code. I think it stores the data in a somewhat similar manner to SCANsat, basically a publicly accessible list of which cells have been scanned and whether or not they contain Kethane.\u003C/p\u003E\u003Cp\u003ESCANsat works entirely with positions described by longitude and latitude, whereas Kethane uses the grid system. It seems relatively straightforward to figure out which cell is below any given point above the surface and that could be translated to something that SCANsat understands. \u003C/p\u003E\u003Cp\u003EThe issue that needs to be worked out though, is how everything should be displayed. For one, I think the Kethane map should be shown as an optional overlay that can be activated on any map type rather than a separate map, that seems like the most useful method. The other issue is how Kethane\u0027s grid should be shown on the map. As far as I can tell there is no granularity below the level of an individual cell, so any map overlay would end up looking like a stretched out version of the Kethane grid (I think even the polar projection would be distorted). I think this would look somewhat awkward, especially on the rectangular map where cells at high latitudes would be very warped, but I don\u0027t see any simple way of doing otherwise.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-09T05:23:51Z\u0022 title=\u002205/09/2014 05:23  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 9, 2014\u003C/time\u003E by DMagic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Virtualgenius","CreatedById":67644,"CreatedDateTime":"2014-05-09T05:42:57Z","Content":"\n\u003Cp\u003EPerhaps lock the Kethane map to one particular format rectangular polar etc the one that gives the most clarity. Is there any fix yet for ScansatRPM when its used inconjunction with MJ\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-05-09T07:43:33Z","Content":"\n\u003Cp\u003EFor me the big benefit of integration of ressource scanning would be the scan-in-background part and not necessarily ressource maps viewable in SCANsat\u0027s windows.\u003C/p\u003E\u003Cp\u003EIf you say that it would be relatively easy to determine which cell a SCANsat scanner is flying over, would it be equally easy for SCANsat to find and edit the section of the save file used by Kethane to mark scanned cells, so that a SCANsat user could MM-edit the Kethane scanners to use a SCANsat MODULE?\u003C/p\u003E\n"},{"CreatedByName":"technogeeky","CreatedById":107155,"CreatedDateTime":"2014-05-09T11:59:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EFor me the big benefit of integration of ressource scanning would be the scan-in-background part and not necessarily ressource maps viewable in SCANsat\u0027s windows.\u003Cp\u003EIf you say that it would be relatively easy to determine which cell a SCANsat scanner is flying over, would it be equally easy for SCANsat to find and edit the section of the save file used by Kethane to mark scanned cells, so that a SCANsat user could MM-edit the Kethane scanners to use a SCANsat MODULE?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor scanning purposes, there are two methods that we could use:\u003C/p\u003E\u003Cp\u003E1. Use the standard Kethane hexagonal grid, and incorporate that into a second fundamental type of scanning.\u003C/p\u003E\u003Cp\u003E2. Use the same method that SCANsat uses for scanning and storing data, and use the fact that you can approximate Kethane scanners using a specific FOV/swath width.\u003C/p\u003E\u003Cp\u003EThe honorable gentleman Psawhn has \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75854-Ideal-Altitude-Calulator-%28Revitalized%29?p=1125480\u0026amp;viewfull=1#post1125480\u0022 rel=\u0022external nofollow\u0022\u003Esome Octave/Matlab code\u003C/a\u003E that does a rough job of calculating ideal altitudes for scanning Kethane, using the approximate method. Either direct inspection of the code, or evaluation of the output of the code versus the behaviour of Kethane in-game should tell us if the method will work or not.\u003C/p\u003E\u003Cp\u003EThe general answer to your question is yes: if it\u0027s stored in the persistent file, then it is possible to use (and edit) all of the Kethane data.\u003C/p\u003E\n"},{"CreatedByName":"technogeeky","CreatedById":107155,"CreatedDateTime":"2014-05-09T12:06:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Virtualgenius\u0022 data-cite=\u0022Virtualgenius\u0022\u003E\u003Cdiv\u003EPerhaps lock the Kethane map to one particular format rectangular polar etc the one that gives the most clarity. Is there any fix yet for ScansatRPM when its used inconjunction with MJ\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have read and understood all of the arguments about what to do, and have made the decision to change SCANsat to having fully hardcoded version numbers. However, I do not accept that it is a good idea for me (after having released v6rc1, v6rc2) to manually edit the version number to be identical to that of v5 (the last damny release). First of all, it would be going backwards in version number (which is a horrible idea). But secondly, I have made changes to the part cfgs that I do not want to revert.\u003C/p\u003E\u003Cp\u003EI intend to release the official version of SCANsat this weekend. I hope that Mihara will be around to produce a new triplet of RPM, ssRPM, and mjRPM against my new release, before I release it -- so everyone can get the whole package, all at once.\u003C/p\u003E\u003Cp\u003EThereafter, there won\u0027t be a problem. I won\u0027t be changing the version number on dev builds, so you will be able to use the latest dev build of SCANsat until I change the version number manually (which I will only do when breaking compatibility).\u003C/p\u003E\u003Cp\u003EI would ask that someone inform me if part.cfg changes are going to break savegames (or not). I think DMagic should be able to take a guess. I think he mentioned doing something with MM, instead of editing them. I\u0027d be happy to revert the changes and do it that way, if it will guarantee that nobody\u0027s saves will get messed up. I suppose I could have tried it out on my career savegame, but I don\u0027t have any scanners on any vessels (I did kerbal recovery missions before switching back to development mode).\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Virtualgenius\u0022 data-cite=\u0022Virtualgenius\u0022\u003E\u003Cdiv\u003EPerhaps lock the Kethane map to one particular format rectangular polar etc the one that gives the most clarity. Is there any fix yet for ScansatRPM when its used inconjunction with MJ\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have read and understood all of the arguments about what to do, and have made the decision to change SCANsat to having fully hardcoded version numbers. However, I do not accept that it is a good idea for me (after having released v6rc1, v6rc2) to manually edit the version number to be identical to that of v5 (the last damny release). First of all, it would be going backwards in version number (which is a horrible idea). But secondly, I have made changes to the part cfgs that I do not want to revert.\u003C/p\u003E\u003Cp\u003EI intend to release the official version of SCANsat this weekend. I hope that Mihara will be around to produce a new triplet of RPM, ssRPM, and mjRPM against my new release, before I release it -- so everyone can get the whole package, all at once.\u003C/p\u003E\u003Cp\u003EThereafter, there won\u0027t be a problem. I won\u0027t be changing the version number on dev builds, so you will be able to use the latest dev build of SCANsat until I change the version number manually (which I will only do when breaking compatibility).\u003C/p\u003E\u003Cp\u003EI would ask that someone inform me if part.cfg changes are going to break savegames (or not). I think DMagic should be able to take a guess. I think he mentioned doing something with MM, instead of editing them. I\u0027d be happy to revert the changes and do it that way, if it will guarantee that nobody\u0027s saves will get messed up. I suppose I could have tried it out on my career savegame, but I don\u0027t have any scanners on any vessels (I did kerbal recovery missions before switching back to development mode).\u003C/p\u003E\n"},{"CreatedByName":"technogeeky","CreatedById":107155,"CreatedDateTime":"2014-05-09T12:11:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tiron\u0022 data-cite=\u0022Tiron\u0022\u003E\u003Cdiv\u003EFrom reading Mihara\u0027s stuff on the subject, it\u0027s actually Squad\u0027s fault. Something in the way their plugin loading setup is arranged makes it so that directly calling functions from another .dll only works if it\u0027s the exact right version of the .dll, otherwise it doesn\u0027t allow it. He\u0027s got a couple posts on the subject, talking mostly with Sarbian after a change to Mechjeb\u0027s buildbot broke compability with the dev mechjebs.\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57603-0-23-5-RasterPropMonitor-make-your-IVA-a-glass-cockpit-%28v0-16%29-20-Apr?p=1106211\u0026amp;viewfull=1#post1106211\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s one\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57603-0-23-5-RasterPropMonitor-make-your-IVA-a-glass-cockpit-%28v0-16%29-20-Apr?p=1108880\u0026amp;viewfull=1#post1108880\u0022 rel=\u0022external nofollow\u0022\u003EAnother\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGiven what happened with the Mechjeb Dev version and the nature of it, it seems like the pluginloader\u0027s going off the version number on the .dll for the purposes of enforcing this.\u003C/p\u003E\u003Cp\u003EBasically what happened was this: Mechjeb\u0027s version numbers are hard-coded in the code itself, and are only changed when a release is pulled. All the mechjeb dev-builds since version 2.2.1.0 was released (225/226-242 at the moment) if you pull the code down and compile it yourself, will show up as version 2.2.1.0.\u003C/p\u003E\u003Cp\u003EThey also have an automated build bot set up, which every time there\u0027s a commit to the project automatically compiles the new version and hosts it for people to download. At some point here recently they changed how it does so: instead of just compiling it straight up, it now automatically appends the commit # onto the last digit of the version number. So instead of it coming out at 2.2.1.0 like it would if you compiled it yourself, the one the buildbot spits out comes out as 2.2.1.242 (or whatever.)\u003C/p\u003E\u003Cp\u003EJudging by the forum posts, before that change to the buildbot, the dev versions of mechjeb worked with RPM without any modification. You could just drop them in and they\u0027d work...apparently because they had the same version number as the last release. I\u0027ve seen people mentioning a specific commit where the change took place and the compatibility broke.\u003C/p\u003E\u003Cp\u003EMy understanding is that dropping the version numbering on the .dll wouldn\u0027t fix it in and of itself: the new one would still register as \u0027different\u0027, but if the version number didn\u0027t change after that, and the functions that were being hooked into didn\u0027t either, each subsequent version after that would continue to work after it\u0027d been recompiled once.\u003C/p\u003E\u003Cp\u003EIn fact, if my understanding is correct, you could make your versions of scansat work as a drop-in on the unmodified RPM simply by setting it up in such a way that your .dlls always came out with a version number of 1.0.5.32015, the version of the release that RPM\u0027s been compiled with.\u003C/p\u003E\u003Cp\u003EIt\u0027s not great practice, and it\u0027d remove the ability to tell what version you had by checking the plugin... but it should allow it to work without having to rebuild RPM constantly.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for this and the follow up post.\u003C/p\u003E\u003Cp\u003EI have thought about it, and I see only two routes that will let me develop as actively as I want without breaking compatibility.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EStrip the versioning from the assembly entirely, effectivelly setting it to \u00220.0.0.0\u0022 for all time. (BAD)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHardcode all four components of the version for each release, and store the development build in some other field (which is not checked by the PluginLoader -- like the description or the copyright field). In which case, I might use something like \u00221.0.6.0\u0022\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI will not be be officially releasing a DLL with version number \u00221.0.5.32015\u0022 because that seems dangerous and silly. Except: I would like to release such a version to two or three people who are currently straddling SCANsat v5/v6rc2 with RPM, and who wish to help us at SCAN by telling us if indeed that method (hard-coding to the same version number) solves the problem.\u003C/p\u003E\u003Cp\u003EIf you would (or anyone else) wants to verify that such a scenario works, please chime in and I will give you guys a link to a download in private message. To be safe, I should probably revert to an earlier build than my master, to get rid of part.cfg changes.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-05-09T13:18:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003EI\u0027ve never looked at the Open Resources System, but I have spent some time with the Kethane code. \u003Cp\u003E....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for giving a thought about this (also about your interest on the same subject in the past). Hope you may want to check ORS, I guess it is even simpler to implement in SCANsat than Kethane.\u003C/p\u003E\u003Cp\u003EYes, Kethane stores data (seemingly compressed as SCANsat does) about the areas scanned with each body. But Kethane and Ore deposits coordinates are separately stored, unlike SCANsat (that I guess peeks directly from body texture files).\u003C/p\u003E\u003Cp\u003EYou are absolutely right any of SCANsat maps would result in distortions of the hex grid used by Kethane. But that is a general problem of topography, and the prime reason there are many different map projections in use. A rectangular map is best to show features close to the equator, and heavily distort anything close to the poles; the opposite with a polar map. We can only accept this fact; the same kind of distortions already occur with the body textures applied to SCANsat maps. With Kethane topographic grid, we also have a different distortion issue, as the cells better follow the contour of the body mesh, while topographic maps are drawn with the assumption the body is an ellipsoid (or a sphere, in KSP).\u003C/p\u003E\u003Cp\u003EAbout granularity, we know Kethane choice to represent only generic cell content, and each cell being 2.25Ã‚Â° wide, brings to maps of such apparent limited resolution (160 cells along the equator, horizontal map axis; about 80 cells along a meridian). No way out about this fact, but I would believe an overlay showing those cell contents is really what SCANsat users would like to see, even if at a low resolution.\u003C/p\u003E\u003Cp\u003EYes, map overlays would be the correct approach, as you suggest. Believe you know enough of Geographic Information Systems (GIS), the way those use map overlays to present geo-localized data would be amazing if replicated in SCANsat.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-05-09T16:40:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EFor me the big benefit of integration of ressource scanning would be the scan-in-background part and not necessarily ressource maps viewable in SCANsat\u0027s windows.\u003Cp\u003EIf you say that it would be relatively easy to determine which cell a SCANsat scanner is flying over, would it be equally easy for SCANsat to find and edit the section of the save file used by Kethane to mark scanned cells, so that a SCANsat user could MM-edit the Kethane scanners to use a SCANsat MODULE?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAdding another SCANsat scanner type wouldn\u0027t be very difficult, and using that to check Kethane data should work fine.\u003C/p\u003E\u003Cp\u003EIt is possible to read data from Kethane\u0027s cache of scanned cells and I think it is possible to write to that as well, so a SCANsat scanner should be able to update both the SCANsat database and the Kethane database (or rather, SCANsat shouldn\u0027t need to keep its own record of Kethane data). The simpler solution is not doing any scanning with SCANsat and only reading the existing database directly from Kethane. And while it\u0027s possible to also access anything that Kethane stores in the persistent file, I don\u0027t think doing so is a good idea; anything that SCANsat uses should probably go through the Kethane code, not go around it and directly access the persistent file.\u003C/p\u003E\u003Cp\u003EMy problem with this is that I don\u0027t really like the idea of working around the very carefully setup method that Kethane uses for scanning. If you really want to change how that works I think it\u0027s better to petition Majiir to do that (which probably isn\u0027t going to happen) rather than to work around it with another mod.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI would ask that someone inform me if part.cfg changes are going to break savegames (or not). I think DMagic should be able to take a guess. I think he mentioned doing something with MM, instead of editing them. I\u0027d be happy to revert the changes and do it that way, if it will guarantee that nobody\u0027s saves will get messed up. I suppose I could have tried it out on my career savegame, but I don\u0027t have any scanners on any vessels (I did kerbal recovery missions before switching back to development mode).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only way to truly screw up a save file with part.cfg changes is to alter the \u0022name = \u0022 field, usually found at the top of the file (not to be confused with the \u0022title = \u0022 field which controls what the part is called in the VAB). This is what the persistent file and craft files use to identify parts, changing it will result in that part not being found and the craft not loading. It\u0027s really easy to check if part.cfg changes break anything because you can reload the database without restarting KSP, you just have to be in the spacecenter to do it; I do this all the time and it\u0027s rare that changing a part.cfg does any real harm.\u003C/p\u003E\u003Cp\u003EUsing Model {} nodes adds some other ways to break a savefile, but SCANsat parts don\u0027t use those, so it\u0027s not an issue.\u003C/p\u003E\u003Cp\u003EThere is also some amount of changes that can necessitate re-purchasing a part in the R\u0026amp;D center, I\u0027ve never been clear on exactly what (besides tech-node position) triggers this, but it won\u0027t affect any flights in progress. You won\u0027t be able to load a craft file in the VAB until you repurchase the part, but it won\u0027t delete anything.\u003C/p\u003E\u003Cp\u003EAbout Module Manager, and this goes for adding SCANsat to Kethane scanners or for adding the MapTraq to command modules, I don\u0027t think there\u0027s any particular reason why MM is actually required for this. It\u0027s not that difficult to dynamically add and remove modules from parts when necessary. You have to be careful about removing the modules and about not saving anything with that module, but that\u0027s not really any trouble. xEvilReeperx\u0027s Science Alert does this with his transmitter module and I don\u0027t think it causes any problems (and that mod seems to have a good method for making sure the module gets properly added and removed). I think it\u0027s generally a good idea not to make dependencies unless it\u0027s absolutely necessary, even if it is just MM or Toolbar.\u003C/p\u003E\u003Cp\u003EThat would also open up the possibility of managing these things from the settings menu. Turning off MapTraq for all command pods, or integrating Kethane (or maybe even adding Kethane background scanning) could be controlled through the settings menu so that everyone could configure it how they want.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-09T17:05:41Z\u0022 title=\u002205/09/2014 05:05  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 9, 2014\u003C/time\u003E by DMagic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zeroignite","CreatedById":1377,"CreatedDateTime":"2014-05-09T19:06:50Z","Content":"\n\u003Cp\u003EI am really looking forward to having SCANsat, MJ, and RPM play nice again! Definitely hideous that you have to keep a static version number in the file, hardcoded... but hey, workarounds... work. \u003C/p\u003E\u003Cp\u003EHonestly I often have an easier time reading scansat via an RPM display (especially in ALCOR) than I do on the big map!\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-05-09T20:56:02Z","Content":"\n\u003Cp\u003EOne thought that hasn\u0027t been brought up.. why add another projection that can handle the hex layout of Kethane? Rather than squishing either the poles or equator, why not add in some variation of a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Goode_homolosine_projection\u0022 rel=\u0022external nofollow\u0022\u003EGoode homolosine\u003C/a\u003E or something? Yeah, it might have disadvantages in other areas, but it\u0027d keep the hexes fairly accurate.\u003C/p\u003E\n"},{"CreatedByName":"Tiron","CreatedById":51836,"CreatedDateTime":"2014-05-09T23:53:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zeroignite\u0022 data-cite=\u0022Zeroignite\u0022\u003E\u003Cdiv\u003EI am really looking forward to having SCANsat, MJ, and RPM play nice again! Definitely hideous that you have to keep a static version number in the file, hardcoded... but hey, workarounds... work. \u003Cp\u003EHonestly I often have an easier time reading scansat via an RPM display (especially in ALCOR) than I do on the big map!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m still gonna be doing my own RPM compiles because Mechjeb Dev Version, at least for the moment. I might look at trying again to get Mechjeb itself to compile, since its version numbers are already hardcoded and it\u0027s just the stupid buildbot messing things up.\u003C/p\u003E\u003Cp\u003EBut yeah, same thing with the RPM SCANsat display...mostly. There are two problems with it that I\u0027ve seen: \u003C/p\u003E\u003Cp\u003EIt\u0027s slower than heck to render, almost as slow as the full bigmap. \u003C/p\u003E\u003Cp\u003EIt\u0027s nigh-useless near the poles, because the RPM map apparently uses either the rectangular or the kavrayskiy projections all the time (I strongly suspect but cannot prove it\u0027s using rectangular), with no way I\u0027ve found to change it. It leads to hugely distorted output in the polar regions and pretty much entirely loses directional alignment.\u003C/p\u003E\u003Cp\u003EWhen I tried to use the zoom-in function on the bigmap instead it seemed to be doing something similar (albeit with MUCH faster rendering but a much smaller window), so I almost wonder if the RPM version isn\u0027t calling the function for that little zoom window.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-05-10T05:30:13Z","Content":"\n\u003Cp\u003ESay it with me everyone, proof-of-concept...\u003C/p\u003E\u003Cp\u003EIt\u0027s pretty simple actually, I\u0027m just reading from Kethane\u0027s database, I\u0027m not doing any scanning with SCANsat. The colors show up a bit better in the grayscale mode, but that can obviously be improved upon. The distortion of the grid isn\u0027t too bad until you get to very high latitudes, the rectangular projection is only slightly worse. And this becomes less noticeable the more you have scanned. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uLTnDRG.png\u0022 alt=\u0022uLTnDRG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Av8eclX.png\u0022 alt=\u0022Av8eclX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut, once again, this isn\u0027t a workable solution. I\u0027m just slapping one or the other shade of green on top of the altimetry map if the given cell has been scanned. Ideally the Kethane overlay should be toggleable on any map type and should be more easily visible. Showing the Kethane deposit amount under the mouse would also be a good idea and shouldn\u0027t be difficult at all.\u003C/p\u003E\n"},{"CreatedByName":"Zeroignite","CreatedById":1377,"CreatedDateTime":"2014-05-10T06:04:36Z","Content":"\n\u003Cp\u003EI think I love you. And yes, I am saying \u0022proof of concept\u0022.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-05-10T10:06:22Z","Content":"\n\u003Cp\u003EYes, DMagic, that is a nice demonstration of the feasibility (really a proof-of-concept) for displaying Kethane. Bringing overlays management into SCANsat would make this an important playable feature. Drooling about the possibility to see this become reality.\u003C/p\u003E\u003Cp\u003EAgain, thanks.\u003C/p\u003E\n"},{"CreatedByName":"PizzaMore","CreatedById":92544,"CreatedDateTime":"2014-05-10T16:53:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003ESay it with me everyone, proof-of-concept...\u003Cp\u003EIt\u0027s pretty simple actually, I\u0027m just reading from Kethane\u0027s database, I\u0027m not doing any scanning with SCANsat. The colors show up a bit better in the grayscale mode, but that can obviously be improved upon. The distortion of the grid isn\u0027t too bad until you get to very high latitudes, the rectangular projection is only slightly worse. And this becomes less noticeable the more you have scanned. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/uLTnDRG.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/uLTnDRG.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Av8eclX.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Av8eclX.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBut, once again, this isn\u0027t a workable solution. I\u0027m just slapping one or the other shade of green on top of the altimetry map if the given cell has been scanned. Ideally the Kethane overlay should be toggleable on any map type and should be more easily visible. Showing the Kethane deposit amount under the mouse would also be a good idea and shouldn\u0027t be difficult at all.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m totally loving the progress of SCANsat! you\u0027all are all too damn smart!\u003C/p\u003E\u003Cp\u003EQuick question and with acknowledgement that this is just a concept exercise; so it is possible to load the Kethane data into SCANsat. Would it also mean that a SCANsat survey would also update the Kethane grid? (not implying that any of the Kethane user experience would occur ie. the Kethane scan tones /variations) From the sounds of it, the data is coming from Kethane, thus the Kethane map would be as current as the SCANsat Kethane data.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-11T00:19:19Z\u0022 title=\u002205/11/2014 12:19  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 11, 2014\u003C/time\u003E by PizzaMore\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pantheis","CreatedById":57108,"CreatedDateTime":"2014-05-11T05:03:57Z","Content":"\n\u003Cp\u003EI absolutely hate Kethane requiring the vessel to be active for the sole purpose of electrical use. There are so many ways to make sure you always have enough power to scan it\u0027s absurd that I have to timewarp around a planet to get it scanned. The way Scansat works is much better. If you add Kethane scanning into Scansat, that would be absolutely awesome!\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-05-11T05:04:32Z","Content":"\n\u003Cp\u003EDoes anyone particularly care if the SCANsat map\u0027s Kethane overlay actually looks like a grid of hexagons? The performance impact of really accurately matching every pixel to the Kethane grid is significant. Displaying the grid at a lower resolution is very easy to do and reduces the performance impact to almost negligible levels.\u003C/p\u003E\u003Cp\u003ENote the \u0022Kethane\u0022 button below, next to the \u0022Grid\u0022 button, that can be used to turn the overlay on and off, and the Kethane quantity indicator showing the amount in the cell under the mouse pointer. The color of the overlay is a little bit more saturated now and it\u0027s easier to see on colored maps; cells that actually have resources under them are emphasized. The overlay works on all map types now, but the polar projection breaks my low resolution grid method, so I\u0027m using a higher resolution (though still not as high as possible) for that.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Y0wZw3d.png\u0022 alt=\u0022Y0wZw3d.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xBcChF0.png\u0022 alt=\u0022xBcChF0.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"pantheis","CreatedById":57108,"CreatedDateTime":"2014-05-11T05:14:59Z","Content":"\n\u003Cp\u003EI don\u0027t care if it looks like a kethane grid or not. Personally I find the kethane overlay on the map view hard to use, except when targeting a landing with mechjeb.\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2014-05-11T05:17:36Z","Content":"\n\u003Cp\u003EDon\u0027t care about the grid at all. As long as the position of the resource is correct it would be fantastic! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-05-11T05:57:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaPatman\u0022 data-cite=\u0022DaPatman\u0022\u003E\u003Cdiv\u003EOf course it\u0027s possible to calculate a craft\u0027s trajectory relative to the surface, but that\u0027s not the problem. As I understand it, the problem stems from the fact that kethane scanning divides the surface of a body into hexagons, and working out exactly which hexagons said trajectory passes through is very much not an easy task.\u003Cp\u003EActually, an algorithm for solving the generalised version of that problem would probably make a good doctoral thesis for a maths student, if anyone\u0027s looking for any ideas.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Majiir\u0022 data-cite=\u0022Majiir\u0022\u003E\u003Cdiv\u003EBasically this. To make performance reasonable while maintaining accuracy is non-trivial. If anyone has a serious proposal for how to solve this, by all means, share it. So far, everything I\u0027ve seen is along the lines of \u0022just record the trajectory and then turn that into hexes, easy, duh.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo apparently this isn\u0027t really difficult at all. Ok, SCANsat already has a method for background scanning built in, but still, it took me literally five minutes to come up with a workable solution. The trick is that SCANsat doesn\u0027t actually scan anything in the background, it just records what sensors have flown over what area of the planet. The elevation and biome scanning is all done when the map is drawn. The same thing is possible with Kethane, you just check which areas of the planet have been scanned and which cell those areas correspond to.\u003C/p\u003E\u003Cp\u003EThe active vessel, with the blue orbit, does not have a Kethane scanner and is orbiting at ~750km. The inactive vessel, in grey, has a small Kethane scanner with a SCANsat module attached to it and is orbiting at ~250km. It took about 15 sec at max time warp to go from the map shown in my last post to this map. The Kethane grid doesn\u0027t seem to accept my additions to its database until I reload, but the SCANsat map (note the \u0022Rebuild Kethane\u0022 button) works fine.\u003C/p\u003E\u003Cp\u003EI added a Kethane sensorType to SCANsat (using sensorType = 4, the old slope scanner number), set the fov = 1 and the best alt = 250000. The rebuild button checks which cells have been scanned and adds them to the Kethane database. I\u0027m guessing you need an active Kethane sensor or part on the vessel for the grid to update without reloading. \u003C/p\u003E\u003Cp\u003ESo if the reason for not having background scanning really is technical and not philosophical then I don\u0027t see any reason why this can\u0027t be added to SCANsat. Working out how best to handle the part modules is another question, but that\u0027s not really a big deal.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Wxzksl3.png\u0022 alt=\u0022Wxzksl3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: The code for all of this is available on a \u003Ca href=\u0022https://github.com/DMagic1/SCANsat_DM/tree/Kethane_Branch\u0022 rel=\u0022external nofollow\u0022\u003Ebranch of my Github page\u003C/a\u003E, the base is technogeeky\u0027s latest build.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-11T06:57:28Z\u0022 title=\u002205/11/2014 06:57  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 11, 2014\u003C/time\u003E by DMagic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-05-11T07:05:12Z","Content":"\n\u003Cp\u003Estupid forum wouldn\u0027t let me give you more rep \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E This is awesome.\u003C/p\u003E\n"}]}