{"TopicId":51073,"ForumId":36,"TopicTitle":"[PLUGIN\u002BPARTS][0.23] SCANsat terrain mapping","CreatedByName":"damny","CreatedById":78621,"CreatedDateTime":"2013-10-29T16:06:22Z","PageNum":8,"Articles":[{"CreatedByName":"TinyPirate","CreatedById":77813,"CreatedDateTime":"2013-11-01T22:45:56Z","Content":"\n\u003Cp\u003EI like different altitude brackets for various sensors. Perhaps optical sensors (accessing a high-res surface texture, eg, universe replaced) requires 80-100k (or equivelant on other objects), radar higher, anomy, something in the lower bracket, and so on. But I imagine displaying the optimal/bracket for each sensor around various bodies might be tricky.\u003C/p\u003E\n"},{"CreatedByName":"OrtwinS","CreatedById":19144,"CreatedDateTime":"2013-11-01T23:24:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TinyPirate\u0022 data-cite=\u0022TinyPirate\u0022\u003E\u003Cdiv\u003EI like different altitude brackets for various sensors. Perhaps optical sensors (accessing a high-res surface texture, eg, universe replaced) requires 80-100k (or equivelant on other objects), radar higher, anomy, something in the lower bracket, and so on. But I imagine displaying the optimal/bracket for each sensor around various bodies might be tricky.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think it\u0027ll be that tricky, most bodies can be orbited in the 80-1000 range. That gives enough room to play.\u003C/p\u003E\u003Cp\u003ELow-altitude sensors can still have their operating range like \u0027\u0026gt;20km\u0027 which will keep them functional for even Mun, Minmus or Gilly.\u003C/p\u003E\u003Cp\u003EMaybe sensors shouldn\u0027t have a fixed \u0027vision angle\u0027. The optimal sensor altitude can be simulated by different sized scan surfaces!\u003C/p\u003E\u003Cp\u003ESay sensor X works best at alt 120-200, \u003C/p\u003E\u003Cp\u003EIt will still work below 120, and above 200, but with a smaller scan surface (simulating less than ideal conditions). This wouldn\u0027t make sense at all if you argue form a fixed view-angle, but it might be a cheap way to simulate \u0027optimal\u0027 altitudes.\u003C/p\u003E\u003Cp\u003EThe most advanced version of this method would use a (rough) gaussian-like curve that has a \u0027full size scan\u0027 at a certain height (A flattened top to simulate an ideal range), and reducing performance above and below that, going all the way down to no scan surface at all (out of functional range). This might actually be implemented by a series of steps in stead of a curve, or a trapezoid graph, whatever works best.\u003C/p\u003E\u003Cp\u003EEdit: If such a mechanic is implemented, the defining values for the curve (or step-graph) might be nice to have in the .cfg file. Makes them easy to edit during beta.\u003C/p\u003E\u003Cp\u003E*feature creep alert* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T23:38:39Z\u0022 title=\u002211/01/2013 11:38  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by OrtwinS\u003C/strong\u003E\n\u003Cbr\u003Egrammar\n\u003C/span\u003E\n"},{"CreatedByName":"Milkshakefiend","CreatedById":70644,"CreatedDateTime":"2013-11-02T00:52:25Z","Content":"\n\u003Cp\u003EI\u0027m not sure this has been suggested or not (forgive me if it has) but what about some dedicated aeroplane scanners? Those high altitude high velocity monstrosities need a functional use and I though using one fitted with some sensors could be good for localised high-res detail.\u003C/p\u003E\n"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2013-11-02T00:56:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Milkshakefiend\u0022 data-cite=\u0022Milkshakefiend\u0022\u003E\u003Cdiv\u003EI\u0027m not sure this has been suggested or not (forgive me if it has) but what about some dedicated aeroplane scanners? Those high altitude high velocity monstrosities need a functional use and I though using one fitted with some sensors could be good for localised high-res detail.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s basically what the BTDT is for.\u003C/p\u003E\n"},{"CreatedByName":"killer420","CreatedById":36177,"CreatedDateTime":"2013-11-02T02:39:41Z","Content":"\n\u003Cp\u003ESomebody informed me today that this is using Surfer 11 if that\u0027s true will there be a way of exporting the files to it so I can mess around with them in there. Im sure if so you havnt thought about it as its a very expensive program and there wont be a high demand for it.\u003C/p\u003E\n"},{"CreatedByName":"Nostromo","CreatedById":85730,"CreatedDateTime":"2013-11-02T03:01:02Z","Content":"\n\u003Cp\u003EMaybe aesthetically, there could be something like this for aircraft, without the nose cone covering, later on in development.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://shamazkhan.files.wordpress.com/2011/01/elec_an-apg-68v9_radar_f-16_lg.jpg\u0022 alt=\u0022elec_an-apg-68v9_radar_f-16_lg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T03:09:54Z\u0022 title=\u002211/02/2013 03:09  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by Nostromo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DarthJazno","CreatedById":57464,"CreatedDateTime":"2013-11-02T06:58:31Z","Content":"\n\u003Cp\u003EIs there a way to adjust the \u0022sea level\u0022. My wife likes a pink Mun, but I\u0027d like to tone it down a bit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"simmy2109","CreatedById":72110,"CreatedDateTime":"2013-11-02T07:00:38Z","Content":"\n\u003Cp\u003EOH MY GOD. You sir have made an incredibly amazing mod, and I don\u0027t think you realize it. Those of us who loved ISA Mapsat have been looking for a new developer to worship. You remade ISA.... but WAY better. I applaud this tremendously. Take advantage of all the people offering to help you model/texture!\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-11-02T07:09:57Z","Content":"\n\u003Cp\u003EI may have overlooked or missed it, but, will multiple sensors of the same type give better results for high speed (warp) scanning? Not an issue, just a curiosity. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"damny","CreatedById":78621,"CreatedDateTime":"2013-11-02T08:31:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BananaDealer\u0022 data-cite=\u0022BananaDealer\u0022\u003E\u003Cdiv\u003EHmmm... It uses the bulkier grey GUI on my end... When I warp however it switches to the lighter, transparent GUI...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy best guess is you have a mod that I don\u0027t have that switches the skin and draws its stuff before SCANsat... if that\u0027s the case, the next build might stop that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OrtwinS\u0022 data-cite=\u0022OrtwinS\u0022\u003E\u003Cdiv\u003EEh, I did, but that is beside the point.\u003Cp\u003EThe only scanners I can think of that \u003Cem\u003Eshould \u003C/em\u003Eactually be combined into one is the Altitude and Slope RADARS.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI half regret making slope a separate sensor. I thought it might make sense from a gameplay point of view to have it separate and make it more expensive to use, but I think I\u0027d rather fold it back into altimetry and try to find some other possible sensors to implement that actually do something different.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBiome/terrain regions are a specific type (I imagine spectroscopy to detect different elements).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECurrently it\u0027s also RADAR (SAR), but I\u0027m thinking about changing it to a multispectral sensor. When I worked with SAR data we \u003Cem\u003Edid\u003C/em\u003E use it to detect terrain type, but I think it would make more sense if the low resolution altimetry sensor was conventional RADAR altimetry and the high resolution one was SAR.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnomaly Scan \u003Cem\u003Ecould/might \u003C/em\u003Ebe integrated in the altitude RADAR at the higher tech levels (the adv. altimeter radar could be precise enough to detect \u0027anomalies\u0027). Detecting something the size of a monolith from orbit requires a pretty high tech level.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d like to keep this one separate, because I might want to tune its parameters independently of the other sensors. In reality it could be any sensor, of course, because people look at the data or images and find the anomalies. When I worked with SAR, we used SAR images to (automatically) detect structures, but we also did that with visible band images. The advantage of SAR over optical sensors is that it works at night and through clouds, but in reality you can use almost anything to find unspecified \u0022anomalies\u0022.\u003C/p\u003E\u003Cp\u003EIt might actually be interesting if anomaly detection used some kind of optical sensor, because if it doesn\u0027t work at night, it would be more important to get into a good orbit and it would make the sensors more different...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMaptraq is also unique. It will probably have a significant smaller model and lower energy consumption, the kind of part that you put on everything to allow it to access mapdata (I imagine Kerbals prefer a stand-alone system that can quickly scan it\u0027s surroundings and compare that to the known database, in stead of a system relying on an external and complex network of sats like GPS)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually like the idea of requiring a GPS satellite network, but how do I explain that if KSP already shows you your position in map view?\u003C/p\u003E\u003Cp\u003EI\u0027m thinking that the position indicator could only be visible in the zoom box if you\u0027re either above a certain altitude or in range of three or so satellites...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnd that leaves us the optical sensor (which does not exist, and perhaps never will). Another completely different type of sensor.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really want one, I just don\u0027t know how to implement it in a way that makes sense. I don\u0027t want to just show another \u003Cem\u003Eslightly\u003C/em\u003E different looking map. An optical sensor would still do that (maybe a shaded relief using actual colors from the planet texture?) but I\u0027m thinking that at this point, any additional sensor would also have to add another benefit. Unfortunately there\u0027s not a lot of things one can detect on planets in KSP. At least until we get resources.\u003C/p\u003E\u003Cp\u003EIf I had infinite time, I\u0027d just add things to the game along with the sensors. Like roaming animal herds on Kerbin \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But I don\u0027t have infinite time. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe scanning surface restriction is also \u0027part of the game\u0027. I don\u0027t think it has ever been the intention of any mapping plugin to *poof* supply you with all info you want. We have a wiki for that. If you just want an ingame map display I think you should request a seperate plugin for that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe thing is, the way this plugin works, I could add a button next to \u0022Forget Map\u0022 that says \u0022Remember Map\u0022, since the actual scanning is deferred to when the map is rendered. But that\u0027s not what I\u0027m trying to do...that would just make the game shorter, but I\u0027m trying to make it longer by adding more goals you can set for yourself.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Milkshakefiend\u0022 data-cite=\u0022Milkshakefiend\u0022\u003E\u003Cdiv\u003EI\u0027m not sure this has been suggested or not (forgive me if it has) but what about some dedicated aeroplane scanners? Those high altitude high velocity monstrosities need a functional use and I though using one fitted with some sensors could be good for localised high-res detail.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s hard for me to think of something that would work. The BTDT sensor is quite nice for airplanes, and while it doesn\u0027t work at high altitudes, you might still need a high altitude plane to get to the point where you want to use it. But anything that actually results in a map would probably just be annoying for people who want to complete their maps.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022killer420\u0022 data-cite=\u0022killer420\u0022\u003E\u003Cdiv\u003ESomebody informed me today that this is using Surfer 11\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have no idea what Surfer 11 is so I don\u0027t think I\u0027m using it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drtedastro\u0022 data-cite=\u0022drtedastro\u0022\u003E\u003Cdiv\u003EI may have overlooked or missed it, but, will multiple sensors of the same type give better results for high speed (warp) scanning? Not an issue, just a curiosity. Thanks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot when they\u0027re on the same craft. Multiple sensors of the same type on the same craft should deliver exactly the same results as one sensor of that type.\u003C/p\u003E\n"},{"CreatedByName":"Nostromo","CreatedById":85730,"CreatedDateTime":"2013-11-02T09:40:55Z","Content":"\n\u003Cp\u003EHey damny, sorry to bug again. I was thinking about some other radar type that could be fun to add. \u003C/p\u003E\u003Cp\u003ERWR (Radar warning receiver)\u003C/p\u003E\u003Cp\u003EThis would show objects/vessels near by on the same plane (well somewhat, give or take). The \u0022map\u0022 could look like that real RWR and just mark them abstractly on there: \u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/en/f/fc/Rwr_example.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/en/f/fc/Rwr_example.gif\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T09:44:16Z\u0022 title=\u002211/02/2013 09:44  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by Nostromo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ilikemoneygreen","CreatedById":10776,"CreatedDateTime":"2013-11-02T13:00:05Z","Content":"\n\u003Cp\u003EI for one would just like to extend a \u002B1 and vocal support for the idea of roaming animal herds on kerbin. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E Get it done Damny. Get it done. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-11-02T14:57:48Z","Content":"\n\u003Cp\u003EI\u0027m scanning Kerbin and Mun right now - and loving it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It looks good, feels science-y and works without hiccuping or crashing. Now we need only better models for the parts, and ability to gather science and it will become \u0027must have\u0027 mod for everyone, not just mapping nuts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"therealcrow999","CreatedById":19331,"CreatedDateTime":"2013-11-02T15:10:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EI\u0027m scanning Kerbin and Mun right now - and loving it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E It looks good, feels science-y and works without hiccuping or crashing. Now we need only better models for the parts, and ability to gather science and it will become \u0027must have\u0027 mod for everyone, not just mapping nuts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m sure somebody is working on some new models or will be. It takes time with new mods. I think the models currently in mod were only there to test mod and see if it worked, a simple model design. Most programmers aren\u0027t modelers.\u003C/p\u003E\n"},{"CreatedByName":"KhaosCorp","CreatedById":61149,"CreatedDateTime":"2013-11-02T15:59:56Z","Content":"\n\u003Cp\u003ELook back through the thread..few of us are making replacement parts....\u003C/p\u003E\u003Cp\u003EI got a set going, but work is kinda slow, on account that my daughter was real sick..and now I am lol...hate this time of year....\u003C/p\u003E\u003Cp\u003ECouple others had mentioned workin on parts too.\u003C/p\u003E\n"},{"CreatedByName":"simmy2109","CreatedById":72110,"CreatedDateTime":"2013-11-02T16:01:37Z","Content":"\n\u003Cp\u003EGetting a very strange problem... trying to use these in my KSP career save, but the parts claim I don\u0027t have the science researched. Except that I do have Science Tech. Worse... I tried modifying the files to \u0022TechRequired = start\u0022 but I still have the same problem. Suggestions?\u003C/p\u003E\u003Cp\u003EEDIT: So this is apparently more of a general KSP thing. If you install a mod that adds parts, the parts will not automatically be unlocked just because you already have that science node. You have to go back to that node in the tech tree, look at the parts window on the right, and then manually \u0022research\u0022 each new part (it\u0027s free).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T16:07:27Z\u0022 title=\u002211/02/2013 04:07  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by simmy2109\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DarthJazno","CreatedById":57464,"CreatedDateTime":"2013-11-02T16:09:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022simmy2109\u0022 data-cite=\u0022simmy2109\u0022\u003E\u003Cdiv\u003EGetting a very strange problem... trying to use these in my KSP career save, but the parts claim I don\u0027t have the science researched. Except that I do have Science Tech. Worse... I tried modifying the files to \u0022TechRequired = start\u0022 but I still have the same problem. Suggestions?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGo to your tech tree and find the parts. They are in the middle somewhere. Click on the individual parts to make them available in the VAB. I think it\u0027s part of the future money or more research so you may have to \u0022buy\u0022 or research each individual part.\u003C/p\u003E\n"},{"CreatedByName":"therealcrow999","CreatedById":19331,"CreatedDateTime":"2013-11-02T16:38:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KhaosCorp\u0022 data-cite=\u0022KhaosCorp\u0022\u003E\u003Cdiv\u003ELook back through the thread..few of us are making replacement parts....\u003Cp\u003EI got a set going, but work is kinda slow, on account that my daughter was real sick..and now I am lol...hate this time of year....\u003C/p\u003E\u003Cp\u003ECouple others had mentioned workin on parts too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah I hear you, it\u0027s going around. I always get sick in spring after everyone else has spread it around, lol.\u003C/p\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-11-02T17:02:01Z","Content":"\n\u003Cp\u003EGreat! Just tested it and must say that i am very happy to have a ISA Mapsat replacement that works better as the original. Multiple scanners simulatneos is incredibly useful, and the markers/orbital info pieces are a nice addon. Thanks a lot for making this!\u003C/p\u003E\u003Cp\u003EI have one little suggestion for the magnified zoom window on the big map: The \u0022click again to zoom in even more\u0022 feature works, but is somewhat painful to use if you want to go from 10x zoom (initial) to a much higher zoom like 50x or 100x, as i have to step through all of the small intermediate steps (12, 15, 19 and whatnot) . I don\u0027t know how the \u0022next zoom step size\u0022 is calculated (guessing its something like \u0022increase zoom by a factor of 1.25\u0022), but i think such fine stepping is not really required. My suggestion would be to simplify this to a fixed stepping like 10x, 20x, 50x, 100x or to increase this factor to 2 or something like that. Also, it would be nice to let the user resize the zoom window or make its size somehow configurable.\u003C/p\u003E\u003Cp\u003EAs you can see, these are very minor issues, probably something to add to the bottom of the issue list. This is already a must-have in it\u0027s current form.\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-11-02T17:15:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022damny\u0022 data-cite=\u0022damny\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENot when they\u0027re on the same craft. Multiple sensors of the same type on the same craft should deliver exactly the same results as one sensor of that type.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the reply. Any \u0027thoughts\u0027 on the ability to select to save data to work on post mission?\u003C/p\u003E\n"},{"CreatedByName":"damny","CreatedById":78621,"CreatedDateTime":"2013-11-02T17:36:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drtedastro\u0022 data-cite=\u0022drtedastro\u0022\u003E\u003Cdiv\u003EThanks for the reply. Any \u0027thoughts\u0027 on the ability to select to save data to work on post mission?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve put it on my list, but there are some bits missing that I need to implement first, so it\u0027s not going to happen soon.\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-11-02T17:38:42Z","Content":"\n\u003Cp\u003ENo worries. I appreciate that you are looking into doing it.... Thanks.\u003C/p\u003E\n"},{"CreatedByName":"damny","CreatedById":78621,"CreatedDateTime":"2013-11-02T19:27:15Z","Content":"\n\u003Cp\u003EI\u0027ve uploaded \u003Ca href=\u0022http://discordia.erinye.com/ksp/SCANsat_b3.zip\u0022 rel=\u0022external nofollow\u0022\u003Ebuild 3 here\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EIn this build, I removed the slope detection sensor. Instead, the slope view is now a feature of the altimetry sensors. This does \u003Cstrong\u003ENOT\u003C/strong\u003E break save file compatibility: The part is still there, it just doesn\u0027t affect scanning anymore. If you want to get rid of it, you can make it explode from the right-click menu.\u003C/p\u003E\u003Cp\u003ECan you spot all the other changes?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cCblOtb.png\u0022 alt=\u0022cCblOtb.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(The answer is \u0022no\u0022, because some changes aren\u0027t visible...)\u003C/p\u003E\u003Cp\u003EI\u0027m still looking for performance feedback. In this build, the grid and markers have negligible impact and the performance hit from the ground track is much reduced.\u003C/p\u003E\u003Cp\u003EFull changelog:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003ENames in () are forum names of people who suggested the feature/found the bug.\u003Cbr\u003E\u003Cbr\u003EBuild 3 - 2013-11-02\u003Cbr\u003E--------------------\u003Cbr\u003E\u003Cbr\u003E- Map overlays are rendered in a more efficient way. (DMagic, OrtwinS)\u003Cbr\u003E\u003Cbr\u003E- The polar orthographic projection doesn\u0027t choke on the antimeridian \u003Cbr\u003E  anymore. (DMagic)\u003Cbr\u003E\u003Cbr\u003E- Greyscale mode changes more colors to barrier free colors.\u003Cbr\u003E\u003Cbr\u003E- The big map is now resizable and its size and position are saved in the \u003Cbr\u003E  persistance file.\u003Cbr\u003E\u003Cbr\u003E- Map markers now use the stock KSP icons, if applicable. (Sochin)\u003Cbr\u003E\u003Cbr\u003E- More text has black outlines now to make it more readable.\u003Cbr\u003E\u003Cbr\u003E- Map markers and the ground track are now visible in the zoom box. (Ortwins)\u003Cbr\u003E\u003Cbr\u003E- Polar projection now displays handy S and N markers. (Thourion, OrtwinS)\u003Cbr\u003E\u003Cbr\u003E- All parts now consume electrical charge. The amounts are not finalized yet\u003Cbr\u003E  but can be configured in the part.cfg files.\u003Cbr\u003E\u003Cbr\u003E- Slope detection has been folded into altimetry. (OrtwinS)\u003Cbr\u003E\u003Cbr\u003E- Existing slope sensors have become broken, and a small explosive charge has\u003Cbr\u003E  been activated remotely for your convenience. You can trigger it via the\u003Cbr\u003E  right-click menu to get rid of the part on existing vessels.\u003Cbr\u003E\u003Cbr\u003E- If there are maneuver nodes on the active orbit during the time span for \u003Cbr\u003E  which the ground track is rendered, the first maneuver node\u0027s position will\u003Cbr\u003E  be indicated on the ground track along with the ground track for one period\u003Cbr\u003E  of the resulting orbit.\u003Cbr\u003E\u003Cbr\u003E- The GUI style should not flip between Unity and KSP style. (BananaDealer)\u003Cbr\u003E\u003Cbr\u003E- Rendered maps are not exported automatically anymore. Instead, there\u0027s a\u003Cbr\u003E  button in the big map window that exports the current map without any of\u003Cbr\u003E  the overlays. Exported images are still saved in the same location. (MOARdV)\u003Cbr\u003E\u003Cbr\u003E- Flags are now visible on the map.\u003Cbr\u003E\u003Cbr\u003E- Double clicking a ship name in the small window now switches to that ship.\u003Cbr\u003E\u003Cbr\u003E- The vessel list in the small window can now be toggled, and the window can\u003Cbr\u003E  be minimized to an icon only. (OrtwinS)\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"drtedastro","CreatedById":70911,"CreatedDateTime":"2013-11-02T19:47:25Z","Content":"\n\u003Cp\u003EGood stuff, checking it out now. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-11-02T19:48:48Z","Content":"\n\u003Cp\u003EVery nice work! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI have only one criticism: The little x symbol\u0027s asymmetry annoys me a bit. I don\u0027t suppose you could change it to a regular x (or maybe a \u002B or Ã¢â‚¬Â¢ or even a Ã‚Âº)?\u003C/p\u003E\n"}]}