{"TopicId":53285,"ForumId":36,"TopicTitle":"Multi Level Life Support - Drawing board","CreatedByName":"dnulho","CreatedById":83752,"CreatedDateTime":"2013-11-16T09:07:50Z","PageNum":1,"Articles":[{"CreatedByName":"dnulho","CreatedById":83752,"CreatedDateTime":"2013-11-16T09:07:50Z","Content":"\n\u003Cp\u003EI was reading through the ECLSS, IC-LS and TAC-LS threads and was wondering why not build several levels of Life Support that would all run off the same GUI, with the same basic plugin, but would have different cfg files depending on the level of Life Support you wanted, with each stage getting progressively more complex and realistic. I started a basic outline of what I was thinking about and decided to publish it on it\u0027s own dedicated thread. Please let me know what you think of the idea. If you have any more pieces/parts/resources/ideas to add to the outline, you are more then welcome to post them and I will do my best to keep the first post up to date. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EI. No LS installed\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EII. Easy LS\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EResources: \u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ea) LS Resource\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E LS Waste\u003C/p\u003E\u003Cp\u003Ec) Garbage\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EParts:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ea) Storage for each resource (in w/e sizes)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Regenerator\u003C/p\u003E\u003Cp\u003E1) Kerbals consume LSR and produce LSW. Regenerator consumes LSW and produces 95% LSR, 5% Garbage. (Or some ratio that makes sense)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EIII. Medium (Standard)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EResources:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ea) Oxygen\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E CO2\u003C/p\u003E\u003Cp\u003Ec) Water\u003C/p\u003E\u003Cp\u003Ed) Waste Water\u003C/p\u003E\u003Cp\u003Ee) Biomass?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EParts:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Ea) Storage for all resources\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Regenerator\u003C/p\u003E\u003Cp\u003Ec) Air scoop?\u003C/p\u003E\u003Cp\u003Ed) Greenhouse?\u003C/p\u003E\u003Cp\u003E1) ECLSS/TAC-LS/IC-LS All currently fall under this category.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EIV. Hard (Realistic)\u003C/span\u003E \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ERequired Mods:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EMFS - RF\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ERecommended mods:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ERealism Overhaul Pack\u003C/p\u003E\u003Cp\u003E~ Deadly Reentry\u003C/p\u003E\u003Cp\u003E~ Stretchy Tanks\u003C/p\u003E\u003Cp\u003E~ RSS\u003C/p\u003E\u003Cp\u003E~ MFS - RFRM\u003C/p\u003E\u003Cp\u003EKethane\u003C/p\u003E\u003Cp\u003EInterstellar\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003ESuggested mods:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EKAS\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EResources:\u003C/span\u003E (use MFS to store in tanks instead of providing more specialized ones that take up another page in the SPH/VAB)\u003C/p\u003E\u003Cp\u003EA1. O2/Oxygen\u003C/p\u003E\u003Cp\u003EA2. CO2\u003C/p\u003E\u003Cp\u003EA3. H2\u003C/p\u003E\u003Cp\u003EA5. LH2\u003C/p\u003E\u003Cp\u003EA6. LO2 (MFS equivalent)\u003C/p\u003E\u003Cp\u003EA7. N2 (sits in cabin at about 70% right now. Plans to use it to make N2O4 fuel later.)\u003C/p\u003E\u003Cp\u003ES1. LiOH Canisters (low efficiency Scrubber, use once and turned to garbage)\u003C/p\u003E\u003Cp\u003ES2. 5A Zeolite (higher efficiency Scrubber, dumps into space, see part)\u003C/p\u003E\u003Cp\u003EW1. Potable Water\u003C/p\u003E\u003Cp\u003EW2. Gray Water/Sea Water/non-potable Water\u003C/p\u003E\u003Cp\u003EW3. Sewage\u003C/p\u003E\u003Cp\u003EW4. Solid Waste\u003C/p\u003E\u003Cp\u003EW5. Ice (Kethane)\u003C/p\u003E\u003Cp\u003EF1. Food\u003C/p\u003E\u003Cp\u003EF2. Plants (raw Food/low Oxygen recovery/Low growth)\u003C/p\u003E\u003Cp\u003EF3. Algae (raw Fuel/high Oxygen recovery/fast growth)\u003C/p\u003E\u003Cp\u003EG. Garbage \u003C/p\u003E\u003Cp\u003E?M. Medicine (see 3, below)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EFlowchart:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.so-kids-can.com/RLSv3.jpg\u0022 alt=\u0022RLSv3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E1) Kerbals constantly consume the average usage of resources, even though they may not be constantly eating/drinking/using the bathroom/whatever at a specific time. Kerbals die after a certain time without specific resources (O2, Water, Food) or when other resources are too high (CO2).\u003C/p\u003E\u003Cp\u003E2) When kerbals go on EVA they bring Oxygen and Monopropellant with them from the ship, they also use whatever CO2 Scrubbing tech their capsule has, LiOH, 5A Zeolite, etc.\u003C/p\u003E\u003Cp\u003E3) While we are at it, would it be possible to add some basic diseases that kerbals can be afflicted with? Diarrhea would be a good place to start. Their Sewage and Potable Water usage increases x3, and without medicine they are unable to EVA, or do anything else. 1 unit of medicine heals them and everything returns to normal. Kerbals can become sick if there is gray water but no potable water.\u003C/p\u003E\u003Cp\u003EPS I am not a programmer, but a civil engineering guy with some network and hardware familiarity, and have no clue how to write plugin\u0027s, only a minimum clue how to write something as simple as a cfg file, and get lost just looking at trying to figure out 3d modeling... any help in all of those areas are greatly appreciated.\u003C/p\u003E\u003Cp\u003EProgress,\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-24T23:19:04Z\u0022 title=\u002211/24/2013 11:19  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 24, 2013\u003C/time\u003E by dnulho\u003C/strong\u003E\n\u003Cbr\u003EFlowchart v3\n\u003C/span\u003E\n"},{"CreatedByName":"Nahim","CreatedById":78568,"CreatedDateTime":"2013-11-16T09:37:52Z","Content":"\n\u003Cp\u003EI liked the greenhouse idea.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-16T16:19:12Z","Content":"\n\u003Cp\u003EGood idea. I think you should work with Asmi, his GUI is the best one I\u0027ve seen. Also, he solved some very important problems that LS systems usually suffer from. If this gets integrated into ECLSS, MFT-style (in there, you can chose between 3 different versions by swapping a few configs), then you won\u0027t have to \u0022reinvent the wheel\u0022 and solve these very problems yourself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T16:35:26Z\u0022 title=\u002211/16/2013 04:35  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BLUAV8R","CreatedById":83302,"CreatedDateTime":"2013-11-16T17:37:29Z","Content":"\n\u003Cp\u003EGood idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E like the concept and i hope it catches on\u003C/p\u003E\n"},{"CreatedByName":"sidfu","CreatedById":70409,"CreatedDateTime":"2013-11-16T19:34:33Z","Content":"\n\u003Cp\u003Easami already mentioned this same stuff.\u003C/p\u003E\n"},{"CreatedByName":"betaking","CreatedById":58281,"CreatedDateTime":"2013-11-16T20:10:53Z","Content":"\n\u003Cp\u003EI would prefer that life-support mods avoid adding parts. though that\u0027s mostly due to the build system encouraging somewhat aesthetically unappealing designs. (tweakables may fix that though, as would part-bays/covers). As for greenhouses, I think they should be kinda heavy and only really work at a certain scale.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-16T21:15:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dnulho\u0022 data-cite=\u0022dnulho\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E//Does anyone know if it\u0027s possible to to have a max resource that applies to the sum of several resources? \u003C/p\u003E\u003Cp\u003E//Ex: 300 units max, can be 0 Plants:300 Algae, 150:150, 200:100, or any combination you want.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can do that with Modular Fuel Tanks. With such a complex LS system, they\u0027d be a necessity anyway, otherwise you\u0027re looking at an enormous part overhead. Ideally, a customizable, stretchy tank in maybe two versions (radial/inline), a greenhouse and one model for each basic element (intake, compressor, etc.) should be enough.\u003C/p\u003E\n"},{"CreatedByName":"dnulho","CreatedById":83752,"CreatedDateTime":"2013-11-17T06:11:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022betaking\u0022 data-cite=\u0022betaking\u0022\u003E\u003Cdiv\u003E I would prefer that life-support mods avoid adding parts...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats the beauty if this design, if you want less parts, get a simpler LS system. The only part Tier II adds is a Regenerator, if you have MFT, you wouldn\u0027t even need separate tanks.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022betaking\u0022 data-cite=\u0022betaking\u0022\u003E\u003Cdiv\u003E... As for greenhouses, I think they should be kinda heavy and only really work at a certain scale.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe idea that I am having as I type this ( \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ) is that there should be several styles of greenhouse, one style is a vacuum greenhouse, this is going to be designed for interplanetary/interstellar ships and would not be for landing, there is then a \u0022low atmosphere\u0022 greenhouse that is collapsible and lighter than the vacuum but heavier and less portable than the \u0022high atmosphere\u0022 greenhouse. The high atmosphere greenhouse is small and light enough that a kerbal can carry it with KAS, and set it up separate from the ship if you so choose. (there would also be a pipe connector so that you can connect it to the main base/colony and work as a converter. Each type would also be modular or stretchy/procedural, but only in the SPH/VAB. This would allow the most flexibility and realism while keeping the part count to a minimum.\u003C/p\u003E\u003Cp\u003Ein regards to scale: The idea is that they do only work at a certain scale. Using a \u0022tech levels\u0022 such as that implemented in MFT, and perhaps a conversion efficiency that is slightly exponential (base O2 production^#Plants(or Algae)/1000 or similar) should work.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003EYou can do that with Modular Fuel Tanks. With such a complex LS system, they\u0027d be a necessity anyway, otherwise you\u0027re looking at an enormous part overhead. Ideally, a customizable, stretchy tank in maybe two versions (radial/inline), a greenhouse and one model for each basic element (intake, compressor, etc.) should be enough.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo with MFT you can change the size of the different tanks while in flight? I am specifically looking at the greenhouses as you can grow anything in them: Plants, Algae, some other Biomass that we might come up with, but the greenhouse only has a limited space to grow them in. \u003C/p\u003E\u003Cp\u003EHere\u0027s an example: You take off from KSP with the greenhouse empty, and stowed. After flying to Minmus and landing, you deploy the Greenhouse and start cultivating plants. Your next mission you bring 3 more kerbals and a kethane mining platform. The plants that were handling the CO2 load of the previous crew can\u0027t cope with the increased CO2 production and you decrease the plant production as you have plenty of food, and begin producing some Algae instead. Does MFT do/allow that?\u003C/p\u003E\u003Cp\u003EProgress,\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-17T07:06:34Z\u0022 title=\u002211/17/2013 07:06  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 17, 2013\u003C/time\u003E by dnulho\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"isdel","CreatedById":93509,"CreatedDateTime":"2013-11-17T23:12:28Z","Content":"\n\u003Cp\u003EI hope it\u0027s OK to post this here. Don\u0027t mean to threadjack or anything, but it doesn\u0027t really deserve its own thread yet and I didn\u0027t think it\u0027d fit the main Ioncross thread; hopefully this one has the attention of people interested in complex life support.\u003C/p\u003E\u003Cp\u003EI started trying to implement the system below in Ioncross last week. It didn\u0027t occur to me to use MFS at the time so it\u0027s currently using retextured stock parts (and yeah, there\u0027s a fair amount of part overhead, though it only fills up slightly under one page of the VAB for me at the moment).\u003C/p\u003E\u003Cp\u003EIt\u0027s not quite the Hard setting above - while I\u0027d love to have something like that, it would probably require a custom plugin. I don\u0027t plan on implementing the ruleset exactly as in the flowchart, since, for example, there\u0027s probably not much point to including stuff like methane if it\u0027s going to get vented immediately anyway. I\u0027m also not sure yet how to balance stuff like O2 candles vs. just bringing up oxygen or how to implement fuel cells without making solar panels redundant.\u003C/p\u003E\u003Cp\u003EI didn\u0027t include food production as I didn\u0027t give that part much thought yet. I guess a greenhouse part is the only real answer, though it still gives me some pause as it\u0027s the only element that can\u0027t really be modeled on existing real-world examples.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DiUCJex.png\u0022 alt=\u0022DiUCJex.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-17T23:41:48Z","Content":"\n\u003Cp\u003EIf you\u0027re going to use MFS, methane can be usable as cheap rocket fuel. And yeah, food production would require greenhouses.\u003C/p\u003E\n"},{"CreatedByName":"pina_coladas","CreatedById":9346,"CreatedDateTime":"2013-11-18T02:57:58Z","Content":"\n\u003Cp\u003EThe whole point of modeling a sabatier reactor is for methane-fueled mars missions imo. So no you don\u0027t always have to dump it!\u003C/p\u003E\n"},{"CreatedByName":"dnulho","CreatedById":83752,"CreatedDateTime":"2013-11-18T03:29:33Z","Content":"\n\u003Cp\u003E@isdel\u003C/p\u003E\u003Cp\u003EI really like your flowchart, and will probably build one for hard mode. I also like the Sabatier Reactor/Methane and hope you don\u0027t mind if I steal/use it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dnulho","CreatedById":83752,"CreatedDateTime":"2013-11-23T02:52:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022isdel\u0022 data-cite=\u0022isdel\u0022\u003E\u003Cdiv\u003E... I\u0027m also not sure yet how to balance stuff like O2 candles vs. just bringing up oxygen or how to implement fuel cells without making solar panels redundant. ... I guess a greenhouse part is the only real answer, though it still gives me some pause as it\u0027s the only element that can\u0027t really be modeled on existing real-world examples \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFuel Cells require heavy resources that have to be carried along, while solar panels do not. Weight vs power generation argument. \u003C/p\u003E\u003Cp\u003EThere is at least one example of a greenhouse/closed system biosphere that worked for two years.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Biosphere_2\u0022 rel=\u0022external nofollow\u0022\u003EBiosphere 2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENOTE: Updated the flowchart to v2. Added Sabatier Reactor and related resources, cleaned up and sorted lines and links.\u003C/p\u003E\n"},{"CreatedByName":"isdel","CreatedById":93509,"CreatedDateTime":"2013-11-23T05:25:38Z","Content":"\n\u003Cp\u003EI\u0027ve been working on my ruleset for the past week, it\u0027s more or less feature complete. I\u0027ve just started a save to playtest it and check out the balance. It\u0027s an RSS and RT2 save though so it\u0027s taking a while; I haven\u0027t actually put any crew in space yet. I\u0027m realizing now I probably made the modules way too heavy.\u003C/p\u003E\u003Cp\u003EOh, by the way, I should point out there\u0027s a screw-up in my flowchart, the Sabatier reactor should output water in place of oxygen. I hadn\u0027t read the article in a while and goofed.\u003C/p\u003E\n"},{"CreatedByName":"dnulho","CreatedById":83752,"CreatedDateTime":"2013-11-23T08:18:57Z","Content":"\n\u003Cp\u003EThanks for pointing out the error, I had skimmed the article, but hadn\u0027t read it in-depth...\u003C/p\u003E\u003Cp\u003EUpdated the flowchart to v2.1\u003C/p\u003E\n"},{"CreatedByName":"mvronsky","CreatedById":93409,"CreatedDateTime":"2013-11-24T10:26:45Z","Content":"\n\u003Cp\u003EWhy can\u0027t solid waste go into garbage?\u003C/p\u003E\u003Cp\u003EAnyways, great idea!\u003C/p\u003E\u003Cp\u003EI currently do not use any life support system, mostly because I think they are too hard to manage.\u003C/p\u003E\u003Cp\u003EThis might be a great introduction to life support!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T09:04:19Z\u0022 title=\u002211/28/2013 09:04  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by mvronsky\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fail-Man 3D","CreatedById":67177,"CreatedDateTime":"2013-11-24T12:44:16Z","Content":"\n\u003Cp\u003EWhether or not methane will be usable in engines, why not allow pyrolysis* to hydrogen and carbon?\u003C/p\u003E\u003Cp\u003EThe converter could store PyrolyticCarbon as a non-transferrable resource, with conversion efficiency decreasing as carbon accumulates; a Kerbal will eventually have to EVA to go and chisel the carbon out (PyrolyticCarbon--\u0026gt;Garbage, initiated from right-click menu, canceled if Kerbal drifts beyond a certain minimum distance).\u003C/p\u003E\u003Cp\u003EMaybe even unlock a Bosch reactor at a higher tech node (draws more power than pyrolysis reactor alone, but still less then Sabatier reactor \u002B pyrolysis chamber; doesn\u0027t have to be manually cleaned as often; produces water\u002BElementalCarbon instead of oxygen\u002Bmethane).\u003C/p\u003E\u003Cp\u003E* This should, ideally, require a large amount of power and generate lots of waste heat. KSP Interstellar already has a fairly mature implementation of thermal power \u0026amp; waste heat, so I\u0027d suggest getting permission to integrate with it.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-11-24T16:43:11Z","Content":"\n\u003Cp\u003EYou had me until you added \u0022suggested mods\u0022. Hard Mode life support should stand independent of any other part or plug-in, let the user choose how hard his own Hard Mode is. (Which also allows for incrementally increasing how hard the game is.)\u003C/p\u003E\n"},{"CreatedByName":"dnulho","CreatedById":83752,"CreatedDateTime":"2013-11-24T23:12:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fail-Man 3D\u0022 data-cite=\u0022Fail-Man 3D\u0022\u003E\u003Cdiv\u003EWhether or not methane will be usable in engines, why not allow pyrolysis* to hydrogen and carbon?\u003Cp\u003EThe converter could store PyrolyticCarbon as a non-transferrable resource, with conversion efficiency decreasing as carbon accumulates; a Kerbal will eventually have to EVA to go and chisel the carbon out (PyrolyticCarbon--\u0026gt;Garbage, initiated from right-click menu, canceled if Kerbal drifts beyond a certain minimum distance).\u003C/p\u003E\u003Cp\u003EMaybe even unlock a Bosch reactor at a higher tech node (draws more power than pyrolysis reactor alone, but still less then Sabatier reactor \u002B pyrolysis chamber; doesn\u0027t have to be manually cleaned as often; produces water\u002BElementalCarbon instead of oxygen\u002Bmethane).\u003C/p\u003E\u003Cp\u003E* This should, ideally, require a large amount of power and generate lots of waste heat. KSP Interstellar already has a fairly mature implementation of thermal power \u0026amp; waste heat, so I\u0027d suggest getting permission to integrate with it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETHe pyrolysis reaction is one of adding heat to a fuel, without the presence of O2. As such, there could be an onboard \u0022Heater unit\u0022 that converts EC to heat if needed, but you can also use heat that is produced (in a reactor for example) to heat it. The efficiency of the chamber is also directly related to its temperature.\u003C/p\u003E\u003Cp\u003EA Sabatier Reactor converts CO2(g) \u002B 4 H2(g) -\u0026gt; CH4(g) \u002B 2 H2O(l). The pyrolysis reactor then converts CH4(g) -\u0026gt; C(s) \u002B 2 H2(g). The complete reaction is then CO2(g) \u002B 4 H2(g) -\u0026gt; 2 H2O(l) \u002B 2 H2(g) \u002B C(s)\u003C/p\u003E\u003Cp\u003EA Bosch Reaction outputs CO2(g) \u002B 2 H2(g) Ã¢â€ â€™ C(s) \u002B 2 H2O(g). Same reaction in 1 step instead of 2, perhaps different amounts of needed and waste energy (heat), but same basic principle. I will definitely hold onto the idea of a Bosch reactor, but not implement it into this flowchart as it doesn\u0027t add any new concepts or reactions.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DerekL1963\u0022 data-cite=\u0022DerekL1963\u0022\u003E\u003Cdiv\u003EYou had me until you added \u0022suggested mods\u0022. Hard Mode life support should stand independent of any other part or plug-in, let the user choose how hard his own Hard Mode is. (Which also allows for incrementally increasing how hard the game is.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere are several mods that would break this idea if they were not added. MFS is probably the biggest one. not sure whether RF should be required or not. I would have to study the necessity of KSPI (and its heat mechanics) in more detail to determine how critical it is. To some extent I do agree with you that the number of mods that you add allows you to incrementally increase the difficulty of the game. However, that can very easily be done with other things as well. I am not going to try to add G-force mechanics (DRE), Probe control (RT2), or realistic flight mechanics (FAR). If you want to add those, be my guest. It is my goal with RLS to complement the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59207-0-22-Realism-Overhaul-ROv1-Modlist-for-RSS?highlight=Realism\u002BOverhaul\u0022 rel=\u0022external nofollow\u0022\u003ERealism Overhaul\u003C/a\u003E pack with realistic life support. The RO pack already requires MFS-RFRM, so why not this one as well. On top of that, if you want a \u0022less\u0022 hard life support downgrade to the medium LSS. \u003C/p\u003E\u003Cp\u003EUPDATE: Flowchart to v3, Mod lists\u003C/p\u003E\u003Cp\u003EProgress,\u003C/p\u003E\n"}]}