{"TopicId":53744,"ForumId":36,"TopicTitle":"[WIP] Gizmo Rocketry Concepts","CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-11-20T05:27:57Z","PageNum":1,"Articles":[{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-11-20T05:27:57Z","Content":"\n\u003Cp\u003EHello folks!\u003C/p\u003E\u003Cp\u003EI\u0027m just your average everyday college student who finds things to keep him busy when not focusing on school. \u003C/p\u003E\u003Cp\u003EI figured I\u0027d just throw out a few models that I put together out there for people to gauge interest.\u003C/p\u003E\u003Cp\u003EThe first one I\u0027ve gotten done is an Atlas V knockoff, I understand that the ULA Group made a scale model of the Atlas V and Delta IV, this project is IN NO WAY designed to step on their toes. They\u0027ve made a great pack, and, when they get around to updating it, I admit that I\u0027ll get it and use it quite often! So, props to them!\u003C/p\u003E\u003Cp\u003EAnyways, this Atlas V (Affectionately named \u0022Katlas\u0022), is completely not to scale, and I have absolutely no experience with Unity. I\u0027ve tried it, but everytime I get it to the point where I think it\u0027s going to work in KSP, it never loads. Suggestions are welcome!!!\u003C/p\u003E\u003Cp\u003ENow, here\u0027s the 3d model;\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003EAtlas 5\u003C/strong\u003E (\u003Ca href=\u0022http://sketchfab.com/n5l32da\u0022 rel=\u0022external nofollow\u0022\u003Eclick to view in 3D\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://sketchfab.com/n5l32da\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://sketchfab.com/urls/8b1c10eeebb54e1493cf6ef4d326dfb6/1384921072/thumbnail_448.png\u0022 alt=\u0022thumbnail_448.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI couldn\u0027t figure out Sketchfab after a long day at school, so, here\u0027s some profile pictures to show the VERY VERY basic textures that I\u0027ve managed to put together!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uUzljqM.png\u0022 alt=\u0022uUzljqM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/I7mnOpl.png\u0022 alt=\u0022I7mnOpl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny comments and feedback, both positive and negative, would be greatly appreciated!\u003C/p\u003E\u003Cp\u003EThanks for your support!\u003C/p\u003E\u003Cp\u003ECluelessModeler\u003C/p\u003E\n"},{"CreatedByName":"The Destroyer","CreatedById":36109,"CreatedDateTime":"2013-11-20T05:40:51Z","Content":"\n\u003Cp\u003EI do like!\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-11-20T05:45:36Z","Content":"\n\u003Cp\u003EAppreciate it Destroyer! Any ideas/suggestions for it?\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-02T22:59:57Z","Content":"\n\u003Cp\u003ESo, I\u0027ve been doing some more modelling. Got a .64 scale model of the Minotaur One!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nEQbD00.png\u0022 alt=\u0022nEQbD00.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oQqVZqR.png\u0022 alt=\u0022oQqVZqR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LpQqVSV.png\u0022 alt=\u0022LpQqVSV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny thoughts?\u003C/p\u003E\u003Cp\u003ESince the last update, I\u0027ve been studying up on how to work Unity. But, seeing as how finals are next week, I doubt I\u0027ll have much time to work on it. But I will try!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-02T23:28:28Z","Content":"\n\u003Cp\u003ELooks nice. While we do a have a nice Atlas V in the United Launch Alliance pack, nobody has yet tackled Minotaur family. Maybe you could do an American solid rocket stage pack, too? Altair, Castor and Star families were very common on early Atlas and Delta rockets, while Orion, Algol and Antares families were often used in stand-alone launchers. Upper stage solids are pretty simple-looking, and there\u0027s plenty of commonality, so you\u0027d create a lot of options with such a pack.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T23:41:17Z\u0022 title=\u002212/02/2013 11:41  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-02T23:33:26Z","Content":"\n\u003Cp\u003ESounds like a challenge! And I accept! I\u0027ll start right now!\u003C/p\u003E\u003Cp\u003EThe Atlas V was really just an experiment to see if I could do it. Like I\u0027ve said before, that I like the one that the ULA team put together! I just wanted to maybe give them another option, if they want it, I\u0027ll gladly send them the models!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T23:34:29Z\u0022 title=\u002212/02/2013 11:34  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by CluelessModeler\u003C/strong\u003E\n\u003Cbr\u003EHit enter too soon...\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-02T23:44:55Z","Content":"\n\u003Cp\u003EThat would be great, I can help you with configs. You could really make a lot with just a few cans of gunpowder. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E For example:\u003C/p\u003E\u003Cp\u003ERight now, you\u0027ve already made Orion 50XL and Orion 38 (3rd and 4th Minotaur 1 stages). Orion 50S is a shortened Orion 50XL. If you made a wing module and tailfins for that, you could have a Pegasus. A Castor 120 booster (or an SR-118) and additional Orion versions (ST and T, also seem to vary mostly by length) would make you a Taurus. By adding a Star-48V and Star-37FMV, you could have the rest of Minotaur family. There are some nice possibilities there. You\u0027d probably want HAPS and Super HAPS stages to make fine-tuning an orbit after a solid-only launch easier, but that\u0027s not completely necessary.\u003C/p\u003E\u003Cp\u003EHere\u0027s a nice reference for how this stuff looks like: \u003Ca href=\u0022http://andegraf.com/rockets/us_solid.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://andegraf.com/rockets/us_solid.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter that, you could probably look into Conestoga. Castor booster family would be useful for various applications, and you can re-use the Star-48V.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T23:48:01Z\u0022 title=\u002212/02/2013 11:48  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-02T23:54:54Z","Content":"\n\u003Cp\u003EThat seems reasonable, but, I\u0027m going to start with the ATK customer Guide. I just downloaded it, and wow... There\u0027s a metric crap ton of variations of Solid Rocket Motors that are in service. I guess I really never paid attention to what I couldn\u0027t see looking out my window in Florida.\u003C/p\u003E\u003Cp\u003EI figured I\u0027d start with a few, just to gauge interest.\u003C/p\u003E\u003Cp\u003EOrion 38\u003C/p\u003E\u003Cp\u003EOrion 50\u003C/p\u003E\u003Cp\u003EOrion 50XL\u003C/p\u003E\u003Cp\u003EOrion 50XLG\u003C/p\u003E\u003Cp\u003ECastor IVB\u003C/p\u003E\u003Cp\u003ECastor 120\u003C/p\u003E\u003Cp\u003ELCS I\u003C/p\u003E\u003Cp\u003ELCS III\u003C/p\u003E\u003Cp\u003EGEM-40 VN\u003C/p\u003E\u003Cp\u003EGEM-46\u003C/p\u003E\u003Cp\u003EGEM-60\u003C/p\u003E\u003Cp\u003EIf possible, I\u0027ll get in contact with whoever made the custom SRB\u0027s to see if I can make the RSRM stackable in KSP. (Or, if they want I\u0027ll just make the models for them to release, I\u0027m not too particular.)\u003C/p\u003E\u003Cp\u003EI figure that order would give people relatively useful sized upper stage SRB\u0027s to use on their Kerbal Creations. With tweakables, I don\u0027t think it\u0027d be going too far to assume that I could put out only 1 or 2 models per size group and then people could use that to customize them to whatever they need.\u003C/p\u003E\u003Cp\u003ENow, all that being said, I would be greatly appreciative if you could help me out with the configs! That\u0027d be pretty much awesome!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-02T23:59:02Z\u0022 title=\u002212/02/2013 11:59  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 2, 2013\u003C/time\u003E by CluelessModeler\u003C/strong\u003E\n\u003Cbr\u003EOrion 32 needs to be 38\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-03T00:27:48Z","Content":"\n\u003Cp\u003EI\u0027m not sure if Large Class Stage is used anywhere but in ICBMs. GEMs don\u0027t make sense unless you\u0027re also making the Delta series rockets, which are the only ones using them. As for RSRMs, we\u0027ve got a lot of models for those already. BobCat made both 5 and 4 segment versions, and there\u0027s another 4-segment one in 1-1 size. I agree with other choices though. I\u0027d also add some Star motors. Star-37 and 48 were the most notable ones, but there were many, many others. You may check this out, this features most important ATK motors: \u003Ca href=\u0022http://www.atk.com/wp-content/uploads/2013/02/ATK-Motor-Catalog-2012.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.atk.com/wp-content/uploads/2013/02/ATK-Motor-Catalog-2012.pdf\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-03T00:35:10Z","Content":"\n\u003Cp\u003EOk, so I\u0027ll cancel the RSRMs, add some of the Star series for now... I\u0027ve already remodeled my version of the Orion-38.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0pNeOUf.png\u0022 alt=\u00220pNeOUf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut, should I set these to the smallest size that stock KSP uses? Or should I just do very literal .64 scale versions of these? My kinda thought process is that I should use the stock sizes just because in my own experience, if I can\u0027t use a part without matching scales, within reason, I don\u0027t use them.\u003C/p\u003E\u003Cp\u003EAlso, does KSP accept using the Mirror effect in blender? I haven\u0027t seen much of that going around.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-03T00:49:34Z","Content":"\n\u003Cp\u003EWell, I prefer a precise 64% rescale, but that\u0027s not the only option. Remember, small upper stage boosters like Orion-38 and most Stars are hidden under a fairing along with the payload, so their radius is not really important. So, it depends on what you\u0027re going for with your 1st stage motors. If you\u0027re interested in making complete LVs from them, then it\u0027d be better tho scale them precisely. If you just want to make a lot of boosters, then \u0022stock\u0022 sizes would be better. That said, if you go to stock scale, it\u0027d be impossible to make the boosters have proper proportions with regards to each other. You could also go 1:1 scale. Castor 120 would then end up being 3m (not 3.75m, but you can get parts in that size, and there are always procedural adapters), which isn\u0027t ideal, but manageable in KSP size. However, unless using Real Solar System, it won\u0027t go well with existing historical rocket packs (with which those upper stages would go really well if properly scaled).\u003C/p\u003E\n"},{"CreatedByName":"BlazingAngel665","CreatedById":30182,"CreatedDateTime":"2013-12-03T02:34:29Z","Content":"\n\u003Cp\u003EGood looking stuff. The Atlas looks quite nice. The Delta I did was a write off but I never finished the remake. Wish I had but school kinda has a way of sucking the time right out of your life. Glad to see the ULA stuff lives on. If you need any unity help then drop me a line. Ditto for configs, reference photos or anything really. Carry on.\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-03T02:44:05Z","Content":"\n\u003Cp\u003EThanks BlazingAngel! Will probably hit you up tomorrow for help with Unity!\u003C/p\u003E\u003Cp\u003EBut, WRT your last post Dragon, I guess you\u0027re right. No one wants a 3m upper stage booster. (At least, I can\u0027t imagine the need for that being very large.) So, it\u0027s only logical to build 64% rescales of the original model. I guess that\u0027s what I\u0027ll do. I\u0027ll have more updates tomorrow! Thanks a lot for the help man!\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2013-12-03T07:40:46Z","Content":"\n\u003Cp\u003ESo, since the use case of these are probably going to be 50% with Real Solar System (making and using the actual launchers with real Earth), I\u0027m going to second Dragon01 and ask for exact scale copies--in whatever scale you choose, as long as it\u0027s easily rescalable to 100% real size. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat list was good; I\u0027d add some older stuff though, like the original Castor (aka Sergeant, or rather the SRM inside the Sergeant)--needed for TONS of early stuff like Scout, Juno, Little Joe; Algol, for Scout and Little Joe II; Antares and Altair, the Scout\u0027s upper stages (and used for the Vanguard upper stage, and early Thor-Deltas)...\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-03T11:20:03Z","Content":"\n\u003Cp\u003ENow that I\u0027ve slept on it, it does make more sense to go with the 64% scale. However, for the people who want to use it with the Real Solar System mod, could I just build it at a 1:1 scale in Blender, and scale it 64% using the config file? That way, all one would have to do is just change the scale value to 1.0, as opposed to 0.64?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-03T12:11:39Z","Content":"\n\u003Cp\u003EYou could do it like that, sure. That would simplify things a bit and make size calculations more intuitive.\u003C/p\u003E\u003Cp\u003EAlso, Castor 1 and \u0022Baby Sergeant\u0022 are two different things. I think it\u0027d be better to leave the latter to Frizzank, it\u0027d go well with FASA lineup. It was used, in large clusters, as upper stages for Redstone-derived Juno I LV (as well as Juno II, but FASA doesn\u0027t have a Jupiter core for it) and Jupiter-C suborbital rocket.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-03T12:17:40Z\u0022 title=\u002212/03/2013 12:17  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 3, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Themorris","CreatedById":73387,"CreatedDateTime":"2013-12-03T12:40:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CluelessModeler\u0022 data-cite=\u0022CluelessModeler\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso, does KSP accept using the Mirror effect in blender? I haven\u0027t seen much of that going around.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, the mirror-effect is a blender internal(I think you mean the material setting for mirror) setting for the old render engine in blender. It also doesn\u0027t work in blenders internal game engine in realtime, unless you write a shader. Because this mirror effect needs a environment box which has a mirror texture, it isn\u0027t a real mirror reflection. I think unity can somehow do a realtime mirror effect, but I have no clue how. Also I don\u0027t know, if ksp accepts custom materials.\u003C/p\u003E\u003Cp\u003Egreetings,\u003C/p\u003E\u003Cp\u003EThemorris\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-03T13:20:01Z","Content":"\n\u003Cp\u003EThanks Morris! I kinda figured that was the case, but I do remember someone writing a shader to make a mirrored effect. I can\u0027t recall the name of the mod, but, it\u0027s somewhere out there. Think I\u0027ll just leave that to someone smarter than I.\u003C/p\u003E\u003Cp\u003EDragon, I was going to just go with the original list for a first release. If memory serves, I believe he was planning to do something with the Jupiter concepts. But, I\u0027ll probably put more Castor series later on down the road, I think that releasing just a few variations of sizes and types of upper stages will be best suited for an initial release. Then, I can do more specialized things later. Sound fair?\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-03T13:36:27Z","Content":"\n\u003Cp\u003EAnd the finished Orion 38!!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lgaOHvD.png\u0022 alt=\u0022lgaOHvD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VXNLZMi.png\u0022 alt=\u0022VXNLZMi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHarray!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-03T17:04:47Z","Content":"\n\u003Cp\u003EGood idea. The lineup in the OP would make us most of the Minotaur-Taurus-Pegasus lineup, so it\u0027d be good to just go with it. We could add older stuff later.\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-03T21:41:26Z","Content":"\n\u003Cp\u003ESounds like a plan!\u003C/p\u003E\u003Cp\u003EIn other news, I finally got a part into KSP. So, I might be figuring stuff out after all!\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-04T19:43:30Z","Content":"\n\u003Cp\u003EOk, I\u0027ve got a few questions...\u003C/p\u003E\u003Cp\u003EI\u0027m working on the calculations for changing different values for these engines, and I\u0027m getting kind of confused. Please tell me if I\u0027m doing something wrong.\u003C/p\u003E\u003Cp\u003EThrust for the Orion 50T is (According to ATK Product Guide) 122,099 LbF. I\u0027m trying to change this to Kilonewtons (kN), for the config file...\u003C/p\u003E\u003Cp\u003ETherefore, 122,099 lbF would equal roughly 890 kN? Correct?\u003C/p\u003E\u003Cp\u003EThen, WRT to config files, the Mass would be the dry mass. So the weight of the fuel would be added to that, right? Or do I have to do the entire mass and it\u0027ll subtract the mass of the fuel from the total mass?\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-04T20:04:21Z","Content":"\n\u003Cp\u003EDon\u0027t scale performance, this is not worth the effort. Unless you\u0027re doing an RSS-based config, that is. For basic KSP, just use whatever works, don\u0027t bother with using real values, because they\u0027ll be massively overpowered.\u003C/p\u003E\u003Cp\u003EThe \u0022mass\u0022 field in the config file is indeed dry mass, given in tons. Fuel mass is volume (in KSP units) times density (found in ResourcesGeneric.cfg in Squad folder).\u003C/p\u003E\n"},{"CreatedByName":"CluelessModeler","CreatedById":58172,"CreatedDateTime":"2013-12-05T00:05:16Z","Content":"\n\u003Cp\u003EI was going to do two configs, just to make it more user friendly, so you could just change out cfgs based on if you\u0027re using RSS or not.\u003C/p\u003E\u003Cp\u003EI figured it was also dry mass, but I couldn\u0027t find anything on whether or not it was for sure! Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-12-05T23:07:34Z","Content":"\n\u003Cp\u003EGood idea. Two configs, one for RSS, the other for stock-size KSP. That would save me some work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}