{"TopicId":55798,"ForumId":36,"TopicTitle":"[1.0] XT Landertron - Smart Retrorockets for Landers and Spaceplanes v0.08 Oct 10","CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2013-12-11T09:27:57Z","PageNum":3,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-01-01T08:42:27Z","Content":"\n\u003Cp\u003ELooks like these may help a lot with MechJeb landings on Eve.\u003C/p\u003E\n"},{"CreatedByName":"aquilux","CreatedById":23859,"CreatedDateTime":"2014-01-06T04:11:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XanderTek\u0022 data-cite=\u0022XanderTek\u0022\u003E\u003Cdiv\u003EI am looking for more modes to add. I started playing around with a launch escape mode that fires automatically when it detects a part of the ship breaking/exploding. However so far, I think it might be a bit too hard to accurately determine which circumstances actually warrant an abort. Many minor mishaps can be recovered from. Without this automated functionality, the Landertrons would just be firing on command which is no different than sepratrons.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Speaking of input, I just had an idea that may help here. I\u0027ve seen many people complicate their mods by trying to add mod specific GUIs that you then have to navigate. I suggest using Module manager to add a custom module to all parts (or certain sets of parts is desired). Each part with the module would get an additional button in its context menu that when toggled on, would make the part flag itself to the plugin as a part to watch. In case of destruction or detachment of any part along the branch to that part, the plugin would trigger the abort action group, though I\u0027m not sure how to make it aware of the difference between spontaneous disassembly and decoupling events. Do parts, or could a part, equipped with a decoupler module, report the decouple command? That way, anything further along the branch could be unflagged before the abort is triggered.\u003C/p\u003E\u003Cp\u003E Hmmm. Looking at it now, It\u0027d probably do well as its own plugin based mod. If you decide to make it, I request tweakables compatibility, and the ability to apply the flag to all parts in the same symmetry group if I choose.\u003C/p\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2014-01-06T06:04:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022aquilux\u0022 data-cite=\u0022aquilux\u0022\u003E\u003Cdiv\u003ESpeaking of input, I just had an idea that may help here. I\u0027ve seen many people complicate their mods by trying to add mod specific GUIs that you then have to navigate. I suggest using Module manager to add a custom module to all parts (or certain sets of parts is desired). Each part with the module would get an additional button in its context menu that when toggled on, would make the part flag itself to the plugin as a part to watch. In case of destruction or detachment of any part along the branch to that part, the plugin would trigger the abort action group, though I\u0027m not sure how to make it aware of the difference between spontaneous disassembly and decoupling events. Do parts, or could a part, equipped with a decoupler module, report the decouple command? That way, anything further along the branch could be unflagged before the abort is triggered.\u003Cp\u003E Hmmm. Looking at it now, It\u0027d probably do well as its own plugin based mod. If you decide to make it, I request tweakables compatibility, and the ability to apply the flag to all parts in the same symmetry group if I choose.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA part exploding or a \u0022joint\u0022 breaking are considered different than a decoupling event. There might be some exceptions, but from my limited testing the events seemed distinct. I suppose I could allow the user to pick out which parts are important and which aren\u0027t, but it seems like a pain to go through your ship and flag half the parts, even with symmetry. Personally, I barely ever use LES systems (though I do find them cool), so if it required much work to set one up I probably wouldn\u0027t bother with it. \u003C/p\u003E\u003Cp\u003EYou make a good point about this perhaps being outside the scope of this mod. I was just trying to come up with other situations that could benefit from smart, powerful rockets that fire for less than a second.\u003C/p\u003E\u003Cp\u003EOn a different note, I think I found a cool real-world reference for how the Landertrons should look. \u003Ca href=\u0022https://youtu.be/WKCl3lfAx1Q?t=50s\u0022 rel=\u0022external nofollow\u0022\u003EThis video\u003C/a\u003E shows a modified C-130 airplane with rockets for short takeoff and landing. The forward facing ones that pop out would be a good fit for what I\u0027m doing here.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-01-06T08:51:31Z","Content":"\n\u003Cp\u003EOperation \u0022Credible Sport\u0022. The tests all went great, except the final one before mission launch. The crew lit the retro rockets before the landing ones, causing it to smack down hard. Broke off a wing and caught fire.\u003C/p\u003E\u003Cp\u003EScott Manley built a plane in an earlier version of KSP using solid rockets and sepratrons for super short takeoffs and landings. I\u0027d like to see one done closer to the real plane, and capable of actually rescuing some Kerbal \u0022hostages\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Lucid Hills","CreatedById":66394,"CreatedDateTime":"2014-02-03T02:02:30Z","Content":"\n\u003Cp\u003EI can\u0027t seem to find the landatrons anywhere in game. The Hexcans are there but no landertrons.\u003C/p\u003E\u003Cp\u003EI have downloaded 0.06a and copied the files in source and gamedata to those folders.\u003C/p\u003E\u003Cp\u003EIdeas?\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit:\u003C/strong\u003E I opened up a sandbox game and found them so I just haven\u0027t unlocked them in my campaign yet. Where are they in the tech tree then?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-03T03:16:33Z\u0022 title=\u002202/03/2014 03:16  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 3, 2014\u003C/time\u003E by Lucid Hills\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2014-02-04T02:43:43Z","Content":"\n\u003Cp\u003EThey\u0027re unlocked when you research \u0022Advanced Landing\u0022, which is a tier 6 tech. Now that I think about it, that might be a bit late in the game to unlock them...\u003C/p\u003E\n"},{"CreatedByName":"Lucid Hills","CreatedById":66394,"CreatedDateTime":"2014-02-04T04:12:32Z","Content":"\n\u003Cp\u003EMaybe put them in the survivability one?\u003C/p\u003E\n"},{"CreatedByName":"undercoveryankee","CreatedById":103505,"CreatedDateTime":"2014-02-19T21:41:31Z","Content":"\n\u003Cp\u003EI\u0027ve been trying to build a probe that lands uncontrolled, then extends an antenna once it\u0027s on the ground to receive further commands. These will help a lot.\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2014-06-08T20:04:50Z","Content":"\n\u003Cp\u003Eis this abandoned?\u003C/p\u003E\n"},{"CreatedByName":"Xaelath","CreatedById":106084,"CreatedDateTime":"2014-06-10T15:15:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Helix935\u0022 data-cite=\u0022Helix935\u0022\u003E\u003Cdiv\u003Eis this abandoned?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIunno. Looks good, so I\u0027ll try it out.\u003C/p\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2014-06-13T23:25:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Helix935\u0022 data-cite=\u0022Helix935\u0022\u003E\u003Cdiv\u003Eis this abandoned?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it\u0027s not abandoned. I achieved my initial goals, and haven\u0027t had the time to learn how to model my own parts. So... it\u0027s kinda on hold until I come up with something else cool to do with it. There shouldn\u0027t be any issues using the parts with the latest version of the game. If you do run into any issues, let me know and I\u0027ll try to put out a patch.\u003C/p\u003E\u003Cp\u003EI\u0027d be happy to hear from anyone who has suggestions for additional features. I have been considering a two-stage escape tower that fires the rockets once to escape, and then a second time to land, removing the need for parachutes. Maybe a claw with built in retrorockets for easy asteroid grabbing? I don\u0027t have a lot of free time this summer, but I would like to revisit the mod at some point. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Orionkermin","CreatedById":91013,"CreatedDateTime":"2014-06-14T00:13:45Z","Content":"\n\u003Cp\u003EGlad to hear that you\u0027re still going to be supporting this. I\u0027be been working on adding the landertron module to my soyuz style pod. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67164-HGR-R-D-Thread-Stock-like-Soyuz-Shenzhou-and-1-875m-parts-in-Development\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/67164-HGR-R-D-Thread-Stock-like-Soyuz-Shenzhou-and-1-875m-parts-in-Development\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks for the great plug-in \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-06-14T00:22:07Z","Content":"\n\u003Cp\u003EOMG I just discovered this mod and it\u0027s brilliant! I was just thinking I oughta try my hand at powered landings - if SpaceX can do it in Real Life, surely I can do it in KSP.\u003C/p\u003E\u003Cp\u003EThis will of course make it way easy xD\u003C/p\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2014-06-14T09:07:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Orionkermin\u0022 data-cite=\u0022Orionkermin\u0022\u003E\u003Cdiv\u003EGlad to hear that you\u0027re still going to be supporting this. I\u0027be been working on adding the landertron module to my soyuz style pod. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67164-HGR-R-D-Thread-Stock-like-Soyuz-Shenzhou-and-1-875m-parts-in-Development\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/67164-HGR-R-D-Thread-Stock-like-Soyuz-Shenzhou-and-1-875m-parts-in-Development\u003C/a\u003E\u003Cp\u003EThanks for the great plug-in \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECool! The soyuz lander was my original inspiration. I\u0027m glad to see this is getting some use. In theory it should be as simple as editing the cfg file for your pod. I tried to code the plug-in in such a way that it could be used by other parts without any changes to the dll, but I never tested the module on a part as complex as a command pod. Let me know if you need any help getting it working. Also, we can talk if you\u0027re looking for some additional functionality. \u003C/p\u003E\u003Cp\u003EYou are of course free to include my dll with your download.\u003C/p\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2014-06-20T10:14:26Z","Content":"\n\u003Cp\u003EI\u0027ve started work on a new version. Some of the changes I have planned:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EReplace the stock models with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/82341-23-5-Bahamuto-Dynamics-CritterCrawler-AnimatedEngines-etc-v1-0-%28Jun7%29\u0022 rel=\u0022external nofollow\u0022\u003EBahamuto\u0027s very pretty retractable engines\u003C/a\u003E. 2 radial styles, 1 bottom mounted. Engines will pop out when armed, and retract when refueled. Not sure yet if I\u0027ll bundle his models, or make his mod a requirement.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGive the Landertrons some limited ability to adjust throttle. This is kinda cheating, but allows for much more reliable landings. It\u0027s really not noticeable to the user, I\u0027m talking about fractions of a second difference in burn time, but it makes a difference! Hopefully I can get it to a point where there will no longer be a need to tweak activation height settings to get it working just right on different landers.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHave a cfg option that hides the right-click settings, so that other devs can use can use the plugin without displaying confusing options that may not be relevant\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBetter handling of the situation where the Landertrons lack the delta-v to bring the vehicle to a full stop. (No more early activation)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EImproved refueling process\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/T8xUhc9.png\u0022 alt=\u0022T8xUhc9.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-20T10:23:18Z\u0022 title=\u002206/20/2014 10:23  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 20, 2014\u003C/time\u003E by XanderTek\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-06-20T10:57:05Z","Content":"\n\u003Cp\u003ESweet cant wait for the new models! Ill be downloading this ASAP after the models come out:)\u003C/p\u003E\n"},{"CreatedByName":"Orionkermin","CreatedById":91013,"CreatedDateTime":"2014-06-21T05:11:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XanderTek\u0022 data-cite=\u0022XanderTek\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHave a cfg option that hides the right-click settings, so that other devs can use can use the plugin without displaying confusing options that may not be relevant\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis would be great! Looking forward to it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2014-06-22T00:14:13Z","Content":"\n\u003Cp\u003EDo Landertrons work with RemoteTech2 in situations with signal delay?\u003C/p\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2014-06-22T01:13:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fraz86\u0022 data-cite=\u0022Fraz86\u0022\u003E\u003Cdiv\u003EDo Landertrons work with RemoteTech2 in situations with signal delay?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmm, good question. I don\u0027t play with RemoteTech, so I\u0027ve never tried it. Once armed, everything is being calculated onboard so signal delay shouldn\u0027t have an impact... at least in theory. A few things to keep in mind though:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe Landertrons have limited delta-V. If you\u0027re landing on a body without atmosphere, you\u0027ll probably need something else to partially slow you down as you descend.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe Landertrons won\u0027t control the orientation of your ship. If you still have horizontal velocity as you approach the ground, you\u0027ll need some means to keep your ship angled correctly so that the thrust kills both your horizontal and vertical velocity. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ELet me know how it works out. If I get a chance maybe I\u0027ll try fooling around with RemoteTech after I get the new version out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-22T01:15:39Z\u0022 title=\u002206/22/2014 01:15  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 22, 2014\u003C/time\u003E by XanderTek\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2014-06-22T19:26:58Z","Content":"\n\u003Cp\u003ENew version is up! Details are in the first post. Please give it a try.\u003C/p\u003E\u003Cp\u003EIf there are no major issues I may move this project over to the Releases subforum.\u003C/p\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2014-06-22T20:33:58Z","Content":"\n\u003Cp\u003EThe update looks great! Any chance you could include a config option for non-KAS refueling? Similar to how refueling worked before the update (i.e., requiring EVA, but not actually moving any parts), for those of us who don\u0027t use KAS?\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-06-23T00:29:00Z","Content":"\n\u003Cp\u003EJust to check - I don\u0027t know if this is a bug or an intentional feature - after I touch down I find that no matter how little of the landertrons\u0027 fuel was used to brake, they suddenly become completely empty. Is that supposed to happen? Are landertrons not meant to be reusable?\u003C/p\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2014-06-23T03:10:03Z","Content":"\n\u003Cp\u003EFor whatever reason, the landertron\u0027s animations don\u0027t seem to be working correctly for me. The larger radial engine starts deployed and remains deployed, while the other two start retracted and remain retracted. They all seem to function as intended (the retracted landertrons will actually fire despite appearing to be closed); it\u0027s solely an animation problem. Also, BahaD\u0027s standard (non-landertron) engines animate just fine, so it seems to be a problem specifically with the landertrons.\u003C/p\u003E\n"},{"CreatedByName":"XanderTek","CreatedById":92553,"CreatedDateTime":"2014-06-23T03:28:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fraz86\u0022 data-cite=\u0022Fraz86\u0022\u003E\u003Cdiv\u003EThe update looks great! Any chance you could include a config option for non-KAS refueling? Similar to how refueling worked before the update (i.e., requiring EVA, but not actually moving any parts), for those of us who don\u0027t use KAS?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll consider it. I\u0027d rather not have to support two completely different refueling methods, but I\u0027ll see if I can come up with some simple alternative to KAS. Just a thought: I could turn SolidFuel into a pumpable resource, so that you can transfer it between parts the same as liquid fuel.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022parameciumkid\u0022 data-cite=\u0022parameciumkid\u0022\u003E\u003Cdiv\u003EJust to check - I don\u0027t know if this is a bug or an intentional feature - after I touch down I find that no matter how little of the landertrons\u0027 fuel was used to brake, they suddenly become completely empty. Is that supposed to happen? Are landertrons not meant to be reusable?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s working as intended. It started as a vague attempt at realism. Solid fuel rockets can\u0027t easily be turned off half way through, so in this case I pretend that at the end of the burn I eject/vent the remaining fuel. I think it also works as a decent balancing mechanism. They are reusable though, you just need to add a new fuel cartridge. Just EVA, and use KAS to attach a hex can to the Landertron (as shown in the video on the first page).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fraz86\u0022 data-cite=\u0022Fraz86\u0022\u003E\u003Cdiv\u003EFor whatever reason, the landertron\u0027s animations don\u0027t seem to be working correctly for me. The larger radial engine starts deployed and remains deployed, while the other two start retracted and remain retracted. They all seem to function as intended (the retracted landertrons will actually fire despite appearing to be closed); it\u0027s solely an animation problem. Also, BahaD\u0027s standard (non-landertron) engines animate just fine, so it seems to be a problem specifically with the landertrons.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAk... that doesn\u0027t sound good. Might be a conflict with another mod. Can you upload your output_log.txt? It\u0027s found in the \u0022KSP_Data\u0022 folder within the main KSP directory. Does the large radial appear deployed even when you\u0027re in the VAB? \u003C/p\u003E\u003Cp\u003EEdit: Oh, I think I might know what the problem is... If you\u0027re using the HGR mod, make sure you don\u0027t have a duplicate Landertron.dll in that folder. I was able to reproduce your bug when a duplicate dll was present.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-23T03:45:45Z\u0022 title=\u002206/23/2014 03:45  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 23, 2014\u003C/time\u003E by XanderTek\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2014-06-23T03:46:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XanderTek\u0022 data-cite=\u0022XanderTek\u0022\u003E\u003Cdiv\u003EI\u0027ll consider it. I\u0027d rather not have to support two completely different refueling methods, but I\u0027ll see if I can come up with some simple alternative to KAS. Just a thought: I could turn SolidFuel into a pumpable resource, so that you can transfer it between parts the same as liquid fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d rather not make SolidFuel a pumpable resource; that would definitely feel like cheating to me. I like the requirement for an EVA Kerbal to manually refuel the landertrons, I just don\u0027t like dependencies on other plugins unless completely necessary.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XanderTek\u0022 data-cite=\u0022XanderTek\u0022\u003E\u003Cdiv\u003EAk... that doesn\u0027t sound good. Might be a conflict with another mod. Can you upload your output_log.txt? It\u0027s found in the \u0022KSP_Data\u0022 folder within the main KSP directory. Does the large radial appear deployed even when you\u0027re in the VAB? Oh, if you\u0027re using the HGR mod, make sure you don\u0027t have a duplicate Landertron.dll in that folder.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, thank you! The duplicate Landertron.dll from HGR was the culprit.\u003C/p\u003E\n"}]}