{"TopicId":58123,"ForumId":36,"TopicTitle":"Possible resources mod?","CreatedByName":"jimj316","CreatedById":19313,"CreatedDateTime":"2013-12-29T11:20:42Z","PageNum":1,"Articles":[{"CreatedByName":"jimj316","CreatedById":19313,"CreatedDateTime":"2013-12-29T11:20:42Z","Content":"\n\u003Cp\u003EHi, I\u0027m jimj316 and I\u0027ve been lurking these forums since about 0.14 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you all know, recently the long-awaited and much delayed stock resource mining was finally shelved for good, such to the dismay of many in the community. Now, while I respect the decision of the developers (it\u0027s their game, after all) I can\u0027t help but feel disappointed by this decision; it honestly seems like a very good idea, and not really that difficult to implement.\u003C/p\u003E\u003Cp\u003EI had the idea of making a mod to implement the system myself. The mod would attempt to stay as faithful to the developer\u0027s original plan (see: \u003Ca href=\u0022http://i.imgur.com/lGlWdyn.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/lGlWdyn.png\u003C/a\u003E) as possible. The details of some systems were never revealed, I may have to take liberties in a few places \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. I already have lots of notes about how some things would work, which will be released once I turn them from insomnia-driven-text-document format into something readable. x3\u003C/p\u003E\u003Cp\u003EAs for my own experience, I am professionally skilled in Java and C\u002B\u002B, which seems to be translating well to C#, and this is not the first mod I will have made; just the first I will have published. I can (kinda) design static models for use in the game, but not texture them very well, and I don\u0027t even know where to begin with animating.\u003C/p\u003E\u003Cp\u003EDoes anyone have any feedback as to if this is a good idea, too ambitious, etc? Is anyone already doing this?\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2013-12-29T12:01:28Z","Content":"\n\u003Cp\u003EKethane already has all the things you need to make a resources mod, basically you only need to add the new resources and their scanner and collector parts(and remove the Kethane resource if needed).\u003C/p\u003E\n"},{"CreatedByName":"Talisar","CreatedById":62035,"CreatedDateTime":"2013-12-29T12:01:35Z","Content":"\n\u003Cp\u003EI would love to see this be implemented. While I can\u0027t be much direct help, I\u0027d suggest you get in touch with Skyrender regarding his thread \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61605-Modding-Team-Wanted-the-Resource-Expansion-Module-Project\u0022 rel=\u0022external nofollow\u0022\u003EHERE\u003C/a\u003E. It looks like he\u0027s got a good start on this, and was looking for people to bring on board.\u003C/p\u003E\u003Cp\u003EI\u0027d also suggest talking to Ackander regarding his thread \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61296-Unified-Resource-Guidelines-and-Catalog-for-Modders\u0022 rel=\u0022external nofollow\u0022\u003EHERE\u003C/a\u003E, as the two subjects are pretty closely related.\u003C/p\u003E\n"},{"CreatedByName":"Peder","CreatedById":57860,"CreatedDateTime":"2013-12-29T12:13:56Z","Content":"\n\u003Cp\u003E- Hi and welcome to the forum ;-)\u003C/p\u003E\u003Cp\u003EI do not know if someone are making such a material mining mod, only thing i know of is a mining mod named \u0022 Kethane \u0022 that allow players to drill in the ground and extract kethane and then convert it to fuel/mono. I personal like this mod since it is simple to use.\u003C/p\u003E\u003Cp\u003ERegarding making a material mod that look like the one the developers talked about, well it do sound interesting but I do just like the developers fear that it will be a bit difficult as a player and maybe make it less fun to play the game if there are to many different kinds of materials.. SO i do understand why they did not put it in the game, simply since the original kerbal need to be for \u0022everyone\u0022 and not just very experienced players.\u003C/p\u003E\u003Cp\u003EI like to suggest to keep it simple, and here is an idea.\u003C/p\u003E\u003Cp\u003E- You need a scanner to be able to find the material from space. But the scanner do not need to be to powerful. The reason are I think it would be more fun if people need to land in a resource area but have to example drive a little with a rover to find it and so to speak \u0022work\u0022.\u003C/p\u003E\u003Cp\u003E- I also like to suggest that there only are 4 types of material.\u003C/p\u003E\u003Cp\u003E- And all resource locations on a planet should have all 4 materials, but in various % concentrations. For example iron is 20% pure in this area, and 40% pure in another area. So what ever the player need to mine, they can choose to focus their attention in the specific area..\u003C/p\u003E\u003Cp\u003E- maybe there could be like 4 resource places on a planet and they do not even have to be that large. That way people also need to work a little harder with their sattelites to find it.\u003C/p\u003E\u003Cp\u003EBut as you can imagine, the resource mining mod can be interesting, but I think it will mostly be for very experienced players who build advanced spacecraft.\u003C/p\u003E\n"},{"CreatedByName":"jimj316","CreatedById":19313,"CreatedDateTime":"2013-12-29T13:12:40Z","Content":"\n\u003Cp\u003EAlright, I\u0027ll contact SkyRender :3\u003C/p\u003E\u003Cp\u003EThanks, guys :3\u003C/p\u003E\n"},{"CreatedByName":"Redjoker","CreatedById":68444,"CreatedDateTime":"2013-12-29T17:30:28Z","Content":"\n\u003Cp\u003EI also suggest working with Kethane, since it would save a lot of work on your end. For example Extraplanetary Launchpads uses it and has its deposits and equipment.\u003C/p\u003E\n"},{"CreatedByName":"Porkjet","CreatedById":92433,"CreatedDateTime":"2013-12-29T18:01:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://i.imgur.com/lGlWdyn.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/lGlWdyn.png\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis was squads plan?\u003C/p\u003E\u003Cp\u003EPersonally, I think this is a bit too complicated.\u003C/p\u003E\u003Cp\u003EI\u0027ve been thinking about resource gathering parts for some time, this is my rough idea how it could work:\u003C/p\u003E\u003Cp\u003ELiquid fuel:\u003C/p\u003E\u003Cp\u003EA big part that extracts liquid fuel from the atmosphere. like, apparently Nasa made plans on Mars to process CO2 from the atmosphere to Methane and use that as fuel. In kerbal that could just be liquid fuel. Venus atmosphere is also largely composed of CO2 so it would work on Eve too, and the atmosphere on Laythe could also also contain some CO2.\u003C/p\u003E\u003Cp\u003EOxydizer:\u003C/p\u003E\u003Cp\u003EWhere there is CO2 in the atmosphere, a greenhouse module can be used to produce Oxygen, and that can be cooled and liquified to liquid oxygen.\u003C/p\u003E\u003Cp\u003EHydrogen:\u003C/p\u003E\u003Cp\u003EIdeally this will be added to the game and used for Nuclear thermal rockets. There could be a drilling part that extracts it from surface soil.\u003C/p\u003E\u003Cp\u003EThis would be the method of choice on atmosphere-less planets and moons. And Coincidentally, these usually have rather low gravity, so Landers with Nuke Rockets could have a good enough TWR to make advantage of the hydrogen there.\u003C/p\u003E\u003Cp\u003ETo keep the game interresting and challanging, these parts would generate recources at very slow rates, require huge amounts of electricity, and be very heavy and thus difficult to launch/land.\u003C/p\u003E\n"},{"CreatedByName":"Kanddak","CreatedById":55380,"CreatedDateTime":"2013-12-30T01:02:47Z","Content":"\n\u003Cp\u003EI feel the need to post here because there are a couple posters who think Squad\u0027s old resource plan is too complicated.\u003C/p\u003E\u003Cp\u003EI\u0027m a Dwarf Fortress veteran and I think that Squad\u0027s old plan is adorably simplistic. I would be utterly delighted to see a much more complicated ISRU mod.\u003C/p\u003E\u003Cp\u003EI would respectfully ask that you guys who\u0027d prefer a simpler system don\u0027t try too hard to talk this guy out of making the mod of my dreams \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-12-30T01:21:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kanddak\u0022 data-cite=\u0022Kanddak\u0022\u003E\u003Cdiv\u003EI feel the need to post here because there are a couple posters who think Squad\u0027s old resource plan is too complicated.\u003Cp\u003EI\u0027m a Dwarf Fortress veteran and I think that Squad\u0027s old plan is adorably simplistic. I would be utterly delighted to see a much more complicated ISRU mod.\u003C/p\u003E\u003Cp\u003EI would respectfully ask that you guys who\u0027d prefer a simpler system don\u0027t try too hard to talk this guy out of making the mod of my dreams \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou play Dwarf Fortress, your opinion on \u0022simple\u0022 versus \u0022complex\u0022 is not valid.\u003C/p\u003E\u003Cp\u003E(I kid, of course. Your opinion is valid. But dang that game has a complex resource system. And all other systems. Including controls and UI)\u003C/p\u003E\n"},{"CreatedByName":"jimj316","CreatedById":19313,"CreatedDateTime":"2013-12-30T14:16:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kanddak\u0022 data-cite=\u0022Kanddak\u0022\u003E\u003Cdiv\u003EI feel the need to post here because there are a couple posters who think Squad\u0027s old resource plan is too complicated.\u003Cp\u003EI\u0027m a Dwarf Fortress veteran and I think that Squad\u0027s old plan is adorably simplistic. I would be utterly delighted to see a much more complicated ISRU mod.\u003C/p\u003E\u003Cp\u003EI would respectfully ask that you guys who\u0027d prefer a simpler system don\u0027t try too hard to talk this guy out of making the mod of my dreams \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t worry, I play DF as well, so evidently I think more complexity is a good thing x3\u003C/p\u003E\u003Cp\u003EAfter all, the more complex the system is, there more player options are possible, and more options means more interesting gameplay experiences!\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-12-30T15:10:04Z","Content":"\n\u003Cp\u003EResources are all well and good but they have to be fun. Adding a part for CO2 and a part for O2 and a part for collecting toilet waste and a part that recycles toilet waste and a scrubber for the O2 and another part for mining kethane and a part for mining Deuterium and a part for collecting H3 and a part for mapping and scanning and a part to attach to your craft to show the maps created and a part that provides exercise and recreation and a part so they can phone home to protect sanity and a part that recycles water and a part that collects condensation and a cleaning part for the mould and mildew that will collect and a part for making balloon animals and by god it will get very dull, repetitive, boring and insanely annoying.\u003C/p\u003E\u003Cp\u003ETheir is a very fine line to tread between complexity and fun.\u003C/p\u003E\n"},{"CreatedByName":"TimMartland","CreatedById":68334,"CreatedDateTime":"2013-12-30T16:27:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jimj316\u0022 data-cite=\u0022jimj316\u0022\u003E\u003Cdiv\u003EHi, I\u0027m jimj316 and I\u0027ve been lurking these forums since about 0.14 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EAs you all know, recently the long-awaited and much delayed stock resource mining was finally shelved for good, such to the dismay of many in the community. Now, while I respect the decision of the developers (it\u0027s their game, after all) I can\u0027t help but feel disappointed by this decision; it honestly seems like a very good idea, and not really that difficult to implement.\u003C/p\u003E\u003Cp\u003EI had the idea of making a mod to implement the system myself. The mod would attempt to stay as faithful to the developer\u0027s original plan (see: \u003Ca href=\u0022http://i.imgur.com/lGlWdyn.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/lGlWdyn.png\u003C/a\u003E) as possible. The details of some systems were never revealed, I may have to take liberties in a few places \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. I already have lots of notes about how some things would work, which will be released once I turn them from insomnia-driven-text-document format into something readable. x3\u003C/p\u003E\u003Cp\u003EAs for my own experience, I am professionally skilled in Java and C\u002B\u002B, which seems to be translating well to C#, and this is not the first mod I will have made; just the first I will have published. I can (kinda) design static models for use in the game, but not texture them very well, and I don\u0027t even know where to begin with animating.\u003C/p\u003E\u003Cp\u003EDoes anyone have any feedback as to if this is a good idea, too ambitious, etc? Is anyone already doing this?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EResources are not cancelled, simply postponed due to their complexity and the fact that it would take a very long time to develop. SQUAD has decided to allocate their time differently, namely in making the current game a more \u0027finished\u0027 product. Its kinda unfortunate that SQUAD, when announcing that resources were postponed, said it in a way that made the community thing it was abandoned for good, but don\u0027t worry, its coming eventually.\u003C/p\u003E\u003Cp\u003EAlso, multiplayer is on the way \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tychochallenge","CreatedById":85444,"CreatedDateTime":"2014-03-09T19:56:49Z","Content":"\n\u003Cp\u003EI feel like kethane mod is a little too simple, as all you have to do is repeat the same process over and over again: scan, mine, transform; scan, mine, transform; a little like alchemy. I feel like there should be at least a few other resources added such as hydrogen, helium, oxygen, CO2, (or their kerbal counterparts) just to name a few, but too many of them might make it hard and confusing for some people. Also, they should be located around different parts of the kerbal system. For ex: CO2 is common on Duna and Eve, hydrogen/chlorine on Jool, water ice at planetary poles and icy bodies.\u003C/p\u003E\n"},{"CreatedByName":"Space_Kraken","CreatedById":102655,"CreatedDateTime":"2014-03-09T20:16:41Z","Content":"\n\u003Cp\u003EYou should take a look at kethane plus, it makes the kethane system more realistic.\u003C/p\u003E\n"}]}