{"TopicId":59710,"ForumId":36,"TopicTitle":"HotRockets! Particle FX Replacement \u002B Tutorial","CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2014-01-12T03:35:15Z","PageNum":24,"Articles":[{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-04-04T11:06:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoneyFox\u0022 data-cite=\u0022HoneyFox\u0022\u003E\u003Cdiv\u003EIsn\u0027t that orange color intentionally given by adding some \u0022additives\u0022 into the fuel? Pure hydroLOX flame should be quite transparent and white, might be only a little blue-ish I guess?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, it\u0027s because of a). ablatively cooled nozzle. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E. hydrogen being ran through the nozzle at not stoichometric ratio. Mass ratio of hydroLOX is usually around 5.5:1 instead of 0.125:1 that a purely chemical reaction would have. The reason is that exhaust velocity (and therefore efficiency) becomes greater when you\u0027ve got a lighter gas expelled from the nozzle, not to mention the exhaust is cooler, putting less strain on the nozzle. So the Delta IV\u0027s exhaust is red because of lower temperature, and very non-transparent due to nozzle material present in it. Regeneratively cooled SSMEs have a much fainter flame, but it\u0027s still orange-ish, with a blue bit inside the flame (where the actual combustion takes place, presumably).\u003C/p\u003E\u003Cp\u003ENazari made some great SSME flames for CSS, but they\u0027re quite unique (well, would do for NP SSME-lookalike, I suppose). Delta IV exhaust looks somewhat more universal.\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-04T11:48:26Z","Content":"\n\u003Cp\u003EI\u0027ve tried what I have read in the tutorial to make my own FX. When I export the mu no texture is exported, when I add the module, no textures appear.\u003C/p\u003E\u003Cp\u003EI\u0027m so noob. How do I really make one? @_@\u003C/p\u003E\n"},{"CreatedByName":"MOARdV","CreatedById":60950,"CreatedDateTime":"2014-04-04T12:32:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sarbian\u0022 data-cite=\u0022sarbian\u0022\u003E\u003Cdiv\u003EWhat\u0027s really needed is for me to add a few config option in SmokeScreen to disable some of the more expensive effect for those whose computer can\u0027t handle it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEven a higher powered computer struggles when there are multiple engines. My i5 3570K can handle a single engine just fine. I get a bit of lag from two engines. The one time I tried five, it was very slow. Is there a way to keep track of how much time the module is using per frame, and reduce the effects when it\u0027s above a particular value? I haven\u0027t looked into your code and Unity to see if there\u0027s a way to do that, so maybe dynamic adjustments isn\u0027t feasible.\u003C/p\u003E\n"},{"CreatedByName":"BrutalRIP","CreatedById":59065,"CreatedDateTime":"2014-04-04T12:49:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Raptor831\u0022 data-cite=\u0022Raptor831\u0022\u003E\u003Cdiv\u003EThe Poodle was changed to a more \u0022orbital engine\u0022 exhaust after all the screens on the OP were made. It almost looks like just smoke coming from the engine, but that\u0027s intentional. You can read about it by going back through the thread if you want, but basically it\u0027s a bit more realistic given the Poodle\u0027s role in the game.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethanks for clearing that up though i must say i dont like it im gunna remove the poodle from the cfgs on my pc there is ONLY smoke comming from it\u003C/p\u003E\n"},{"CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2014-04-04T14:35:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dragon01\u0022 data-cite=\u0022Dragon01\u0022\u003E\u003Cdiv\u003ENo, I want a fainter, more orange, visibly transparent flame. Shock diamonds would be nice, but what I really want is the \u0022feel\u0022 of a hydroLOX engine, as opposed to them being all keroLOX.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can try using \u0022ssmeflame\u0022 as the effect, as it should be just the clear orange component of the CSS flame. Some of the kw engines have pretty large differences in their effect position though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blackheart612\u0022 data-cite=\u0022blackheart612\u0022\u003E\u003Cdiv\u003EI\u0027ve tried what I have read in the tutorial to make my own FX. When I export the mu no texture is exported, when I add the module, no textures appear.\u003Cp\u003EI\u0027m so noob. How do I really make one? @_@\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou need to create a material and assign the material at the top of the effect in unity. I\u0027ll look over my tutorial.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BrutalRIP\u0022 data-cite=\u0022BrutalRIP\u0022\u003E\u003Cdiv\u003Ethanks for clearing that up though i must say i dont like it im gunna remove the poodle from the cfgs on my pc there is ONLY smoke comming from it\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you sure you have all of the newest versions of the files? The poodle has a wider and much weaker looking flame than the other engines.\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-04T14:43:14Z","Content":"\n\u003Cp\u003EI have checked it over and over again, I have a material, I have the textures applied to it, Unity is pretty much animating the particles, anything Im missing?\u003C/p\u003E\n"},{"CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2014-04-04T14:48:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blackheart612\u0022 data-cite=\u0022blackheart612\u0022\u003E\u003Cdiv\u003EI have checked it over and over again, I have a material, I have the textures applied to it, Unity is pretty much animating the particles, anything Im missing?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you can see your image on the particle effect in unity? If you can, it should only be a matter of exporting everything with Part Tools.\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-04T14:55:42Z","Content":"\n\u003Cp\u003EI also have exported it, mu is done, no png though, no texture, no nothing.\u003C/p\u003E\n"},{"CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2014-04-04T15:01:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blackheart612\u0022 data-cite=\u0022blackheart612\u0022\u003E\u003Cdiv\u003EI also have exported it, mu is done, no png though, no texture, no nothing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI might need screens of your emitter settings, and you might have another version of unity/parttools\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-04-04T15:13:38Z","Content":"\n\u003Cp\u003EHere it is for your contemplation:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/mPhQ7hg.png\u0022 alt=\u0022mPhQ7hg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHad to cut my screen because you might see my cute anime wallpaper\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2014-04-05T00:33:03Z","Content":"\n\u003Cp\u003ECheers for making this mod chaps, Makes the effects Much nicer on most rocket engines, and fills the nozzles with effect rather than having an effect a meter or so away from the end of the nozzle, and the nozzle empty \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever the Effects for the Closed cycle part of the Larger Sabre-M Engine seemed to be broken.....\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot0_zpsf2944e8b.png\u0022 alt=\u0022screenshot0_zpsf2944e8b.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot2_zps38f83cb6.png\u0022 alt=\u0022screenshot2_zps38f83cb6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI noticed that the Smaller Sabre-S was not affected by the Issue, and noticed that the Sabre-S had The extra Line fixedEmissions = false in it\u0027s running_closed section that the Sabre-M did not have in It\u0027s version of the \u0022running_closed\u0022 section\u003C/p\u003E\u003Cp\u003ESo I added in the fixedEmissions = false line in, and it Fixed the issue :-)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot4_zpsa47c7079.png\u0022 alt=\u0022screenshot4_zpsa47c7079.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELink to changed file to fix the Sabre-M: \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/85344120/b9_hotrockets.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://dl.dropboxusercontent.com/u/85344120/b9_hotrockets.cfg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(Right Click and save link as, or Brower tends to open the file in-Browser)\u003C/p\u003E\u003Cp\u003EAlso I Didn\u0027t like what this modification did to some of the jet engines very much, as Copious flames coming out of the B9 airliner style TurboFan engines didn\u0027t do it for me, As I\u0027ve never seen this much fire coming out of a Turbofan engine other than some of the Birdstrike videos I\u0027ve seen.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot11_zps87ddd206.png\u0022 alt=\u0022screenshot11_zps87ddd206.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot13_zpsdd59e4c3.png\u0022 alt=\u0022screenshot13_zpsdd59e4c3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI Much prefer the more subtle Gas fire Ceramic Back element fuzzy heat glow effect of the B9 Turbo fans as they are, as it\u0027s much more convincing an effect :-)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot15_zpsd35a308e.png\u0022 alt=\u0022screenshot15_zpsd35a308e.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever not really a big Issue in my honest opinion, as it was pretty easy to cut out the Parts of the b9_hotrockets.cfg that referred to the TurboFans, and some people might even like the Kerbalness of airliner engines which belch out worryingly large amounts of smoke and fire.....\u003C/p\u003E\u003Cp\u003EOne thing I did notice is it seems to break the Spinning element of the Compressor fans in the B9 Turbofans (Updated Firespitter DLL, they spin when Hotrockets is not installed), as with the Mod installed the fans simply sit still.\u003C/p\u003E\u003Cp\u003EAnother little Issue, at least for me is that the sounds of all the jet engines don\u0027t have the spool up and down effect, the thrust seems to, as normal but the sound seems to match the throttle setting at all times, So if you max the throttle and activate the engine, the sound is for max trust and RPM instantly, and when you hit X to kill throttle the sound is gone instantly too. \u003C/p\u003E\u003Cp\u003EI like The effects for the other more Turbojetty engines, But not the Whole Sound is tied directly to throttle thing....\u003C/p\u003E\u003Cp\u003EThanks again for being awesome and spending your time and effort making cool mods like this, and hope my feedback helps you make it better, and apologize in advance if anything I said was inadvertently lame and sucky, as I appear to be dying of some kind of aggressive brain tumor right now the way my head feels all like muggy fog..... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-04-05T04:45:05Z","Content":"\n\u003Cp\u003EWould you mind sharing these configs? I don\u0027t like flamey turbofan engines too. P.M. works too, as to not break any license.\u003C/p\u003E\n"},{"CreatedByName":"Mekan1k","CreatedById":48750,"CreatedDateTime":"2014-04-05T04:52:07Z","Content":"\n\u003Cp\u003ESince updating to 0.23.5, I have noticed that the engines all have two flames- the ones from the parts pack, and the Hotrockets versions. Is there a reason why?\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2014-04-05T18:49:27Z","Content":"\n\u003Cp\u003EIt\u0027s pretty easy to open up the .CFG files in the MP_Nazari folder, and find the @PART[partnamehere] line that refers to the engine your out to remove or edit the HotRockets effects of.\u003C/p\u003E\u003Cp\u003EThen select it, and everything down to the next @PART line for another engine, and remove. Not touching the next @partline for the next engine in the file.\u003C/p\u003E\u003Cp\u003ESent you a PM anyhow with an Example file with fixed Sabre-M and The HotRockets sections for the Two B9 Jet airliner type engines cut out. \u003C/p\u003E\u003Cp\u003EExpanding on the Jet engine Sound Issues, Is the Sound Is Locked to the Throttle no matter the state of the engine, for example this jet/missile/thingie is flying at pretty much the max speed a stock turbojet will go, hence is only generating about 16kn thrust, Yet the sound is still exactly the same as when the thing took off at max throttle, infact the sound does not change at all from Launch at full throttle on the pad, to Flameout a few seconds later...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot13_zpsb2bb611a.png\u0022 alt=\u0022screenshot13_zpsb2bb611a.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnother funny thing I noticed about the Jet engines having their sound directly tied to the throttle rather the engine\u0027s spool up/down state is that the Sabres seem to be exempt from the issue, and have their sound spool up and down properly with the engine\u0027s Spool/Thrust state as normal....\u003C/p\u003E\u003Cp\u003ETalking about the sabres sound, This Sabre Is at a fair throttle setting, and generating a considerable 233KN of thrust, yet is almost whisper silent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot12_zpsd8509352.png\u0022 alt=\u0022screenshot12_zpsd8509352.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENormally jets have a prettly loud idle sound even at miniscule throttle, and mostly its the pitch that raises as the engine spools up/Generates more thrust.\u003C/p\u003E\u003Cp\u003EAll the jet engines seem to loose their Idle sound with HotRockets installed at the moment, Ive actually removed all the jet engine references from the B9 CFG file, Except the Sabre, as After the Sabre-M fix the Sabres are Worlds better than stock B9 Sabres, With Proper jet sound/Spoolup/Effects in Jet mode, and A Completely Different and Proper rocket effect when in rocket mode, They Just need a Good loud Idle sound When activated in jet mode even with low throttle \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-05T18:55:27Z\u0022 title=\u002204/05/2014 06:55  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 5, 2014\u003C/time\u003E by GorillaZilla\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nazari1382","CreatedById":62013,"CreatedDateTime":"2014-04-05T20:30:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GorillaZilla\u0022 data-cite=\u0022GorillaZilla\u0022\u003E\u003Cdiv\u003E They Just need a Good loud Idle sound When activated in jet mode even with low throttle \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m looking at the sounds. It\u0027s just a matter of them being on the runningEffect instead of the directThrottleEffect. Do you know of a sound file that could be used for an idle sound...? (without license issues)\u003C/p\u003E\n"},{"CreatedByName":"Pulsar","CreatedById":83347,"CreatedDateTime":"2014-04-06T09:58:08Z","Content":"\n\u003Cp\u003EI found that when I use this mod with Stock Rebalance mod by stupid_chris. The maximum thrust and Isp don\u0027t change like it\u0027s suppose to.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75272-0-23-x-Stock-Rebalance-Project-v1-1-6-04-14\u0022 rel=\u0022external nofollow\u0022\u003EThe rebalance mod that I\u0027m talking about.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"GorillaZilla","CreatedById":100625,"CreatedDateTime":"2014-04-07T02:37:14Z","Content":"\n\u003Cp\u003ESince your using stock sounds, as Jet engines with Hotrockets installed at full throttle sound exactly like the stock Basic jet engine when it is generating 75kn thrust at partial throttle without the mod you could just do what stock does, the stock jet engines just use their normal running sound for idle, They just seem to leave the volume at a set level at all times as long as the engine is producing any thrust at all. And just increase the pitch as their Thrust increases.\u003C/p\u003E\u003Cp\u003EAnother thing I noticed while testing is that the stock jets have another layer to their sound, like a low thunderous rush of air that seems directly connected to, and comes on when the engine produces enough thrust for it\u0027s particles to start being generated, and that may or may not have it\u0027s pitch increase as the engine ramps up in thrust....\u003C/p\u003E\u003Cp\u003EI can\u0027t help much in this kind of thing except test a lot and post my observations, Took me ages just to figure out how to paint Markers in just the right places on the KW rocketry decoupler .png textures so its easy to see which side they decouple from.... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1239.photobucket.com/albums/ff520/gorillazilla/screenshot14_zpsea2f241e.png\u0022 alt=\u0022screenshot14_zpsea2f241e.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo not going to be much use, Specially when it comes to license issues, That stuff just Eludes me X-|\u003C/p\u003E\n"},{"CreatedByName":"shael6636","CreatedById":84164,"CreatedDateTime":"2014-04-07T04:27:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022shael6636\u0022 data-cite=\u0022shael6636\u0022\u003E\u003Cdiv\u003EYeah i have been it also could be because im using [.23] KSP Mod Pack Manager (Standalone) to \u0022manage\u0022 all the mods I use, when using that program it asks where to extract the files to and I always select the GameData Folder.\u003Cp\u003EI might try a clean install and extract HotRockets the old fashioned way:). I have had some previous issues when having to extract to a specific folder i.e. Kerbal Engineer but that works fine when using ModpackManager when the GameData folder is selected.\u003C/p\u003E\u003Cp\u003EIm suspecting in hindsight this might be the issue will let you know.\u003C/p\u003E\u003Cp\u003EThanks Nazari\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Efyi Nazari, clean install without using the Mod Pack Manager worked fine. As soons as I installed my normal mods and used the Mod Pack Manager I had the same issue so it looks like a conflict with one of my mods.\u003C/p\u003E\u003Cp\u003EWhen I work it out will post ths uspect mod.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Captain_Party","CreatedById":59820,"CreatedDateTime":"2014-04-07T17:34:12Z","Content":"\n\u003Cp\u003EDoes this work with RealFuels now?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-04-07T18:53:20Z","Content":"\n\u003Cp\u003EIt has for quite a while--since RF v5.0 from, oh, 2-3 weeks ago... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spanier","CreatedById":57247,"CreatedDateTime":"2014-04-07T20:17:18Z","Content":"\n\u003Cp\u003EIs someone working on better effects for RCS?\u003C/p\u003E\n"},{"CreatedByName":"Captain_Party","CreatedById":59820,"CreatedDateTime":"2014-04-07T20:21:32Z","Content":"\n\u003Cp\u003ECan someone make a HotRockets config for BobCats SovietEngines pack? Right now I\u0027d be fine with a config for just the RD-0146. I think the poodle effect would look best on it, as it is a vacuum engine.\u003C/p\u003E\n"},{"CreatedByName":"Mecripp","CreatedById":181994,"CreatedDateTime":"2014-04-08T06:29:38Z","Content":"\n\u003Cp\u003EMaking a cfg not work anymore for adding this FX ? or does something have to be set in Unity ?\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-04-08T06:42:59Z","Content":"\n\u003Cp\u003EUnfortunately HotRockets breaks certain other mods\u0027 functionality by replacing ModuleEngine in its cfg files.\u003C/p\u003E\u003Cp\u003EOne such mod is TriggerAu\u0027s Alternate Resource Panel. This, doubled by the other issues people are reporting with engines having incorrect thrust values, even though I have not had issues personally(or I just haven\u0027t followed closely how my engines behave), made me delete the mod.\u003C/p\u003E\u003Cp\u003ESad, but true \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I think that this ModuleEngine replacement is the cause of most issues and would be happy to know that there is some different way to apply the effects, rather than injecting them with MM cfgs and replacing modules which are vital to the proper engine operation.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-08T10:11:20Z\u0022 title=\u002204/08/2014 10:11  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 8, 2014\u003C/time\u003E by smunisto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DasBananenbrot","CreatedById":70900,"CreatedDateTime":"2014-04-08T07:19:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smunisto\u0022 data-cite=\u0022smunisto\u0022\u003E\u003Cdiv\u003EUnfortunately HotRockets breaks certain other mods\u0027 functionality by replacing ModuleEngine in its cfg files.\u003Cp\u003EOne such mod is TaranisElu\u0027s Alternate Resource Panel. This, doubled by the other issues people are reporting with engines having incorrect thrust values, even though I have not had issues personally(or I just haven\u0027t followed closely how my engines behave), made me delete the mod.\u003C/p\u003E\u003Cp\u003ESad, but true \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I think that this ModuleEngine replacement is the cause of most issues and would be happy to know that there is some different way to apply the effects, rather than injecting them with MM cfgs and replacing modules which are vital to the proper engine operation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe New ModuleEngineFX introduced in 0.23 makes the creation of new effects so easy. So I guess there won\u0027t be an alternative way. Molders should just convert their mods to the new ModuleEngineFX. I mean Deadly Reentry and RealFuels are compatible, so I guess mods like the KSP Alternate Ressource Panel can be made compatible too\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-08T15:07:40Z\u0022 title=\u002204/08/2014 03:07  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 8, 2014\u003C/time\u003E by DasBananenbrot\u003C/strong\u003E\n\u003C/span\u003E\n"}]}