{"TopicId":62301,"ForumId":36,"TopicTitle":"[WIP] \u0026quot;Connected Living Space\u0026quot;- API for connected habs (new download 9 June 14)","CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-05T23:05:04Z","PageNum":1,"Articles":[{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-05T23:05:04Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/70161\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003ECurrent Version can be downloaded from the release thread\u003C/span\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYou will also need \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55219\u0022 rel=\u0022external nofollow\u0022\u003EModuleManager \u003C/a\u003Eto load the config.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can access the \u003Ca href=\u0022https://github.com/codepoetpbowden/ConnectedLivingSpace\u0022 rel=\u0022external nofollow\u0022\u003Esource code here\u003C/a\u003E. If you spot a bug please let me know. Ideally bugs should be raised in Github, but if that is too much to ask then post on this thread. More helpful than raising a bug report is to raise a bug report with lots of information about how to reproduce the problem, and with logs files, save files, craft files etc. Even more helpful is to write a fix by forking the code in Github, and then generating a pull request \u003Cimg alt=\u0022:)\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EIntroduction\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis mod is intended to identify areas within a vessel that can be crewed by Kerbals and through which kerbals can pass internally to reach other parts that can be crewed. It is envisioned that this information could be used for restricted crew manifest style movement of kerbals within a craft, and also a future sanity mod that takes into account who the kerbal\u0027s bunk mates are. (Other mod developpers have also contacted me privately to suggest other exciting uses for this mod, but it is for them, not me to announce their ideas.)\n\u003C/p\u003E\n\u003Cp\u003E\nThere are two key pieces of information that are needed by this mod:\n\u003C/p\u003E\n\u003Cp\u003E\n1) Can a part house a kerbal or allow a kebal to pass through it?\n\u003C/p\u003E\n\u003Cp\u003E\n2) Can an attachment node on a part allow a kerbal to pass through it?\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently the config only allows us to know if a part can hold crew. Therefore it is envisioned that the config will be extended, and a set of configs for well known part packs written to ship with the mod. Heuristics will try to provide config for parts with no config available (such as the size of the node and whether or not it is a crewable part).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003EProgess report\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA download is now available. It looks a bit like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot125.png\u0022 src=\u0022http://s16.postimg.org/agui7ugud/screenshot125.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA vessel with contain 1 continuous living space made up of 2 pods (green) that can house kerbals, some tubes (yellow) that kerbals can move through internally and two docking ports that have been joined docked together (cyan).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022screenshot55.png\u0022 src=\u0022http://s29.postimg.org/vkmz2w5rb/screenshot55.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAn image from my main save (yes I trust this code on my own main save). Here is a deep space transport vessel docked at an LKO transfer station with 3 crew shuttles also attached.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EHelping to develop this mod\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere are several ways in which you can help this project:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nReport bugs. Please do this on \u003Ca href=\u0022https://github.com/codepoetpbowden/ConnectedLivingSpace\u0022 rel=\u0022external nofollow\u0022\u003Egithub \u003C/a\u003Eif you can. If you can\u0027t then it is better to post to this thread than do nothing.\n\u003C/li\u003E\n\u003Cli\u003E\nWrite a ModuleManager style set of config for a part pack that you use, adn then make that available to be included in this project.\n\u003C/li\u003E\n\u003Cli\u003E\n{DONE - thanks austizmo}Design a toolbar button. I am a coder really - I am no good at making things pretty!\n\u003C/li\u003E\n\u003Cli\u003E\nOffer ideas for how the API should work, so other modders can use this concept of connected spaces in their mods\n\u003C/li\u003E\n\u003Cli\u003E\nOffer ideas for mods where this functionaily would be useful.\n\u003C/li\u003E\n\u003Cli\u003E\nWrite a mod that uses ConnectedLivingSpace. Do please let me know if you are doing, or even thinking of doing this, so I can ensure that CLS meets your needs.\n\u003C/li\u003E\n\u003Cli\u003E\nPost pictures to this thread of interesting things you do with this CLS to encourage me!\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EIdeas that have been suggested for mods using CLS\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCrew transfer\n\u003C/li\u003E\n\u003Cli\u003E\nSanity mod\n\u003C/li\u003E\n\u003Cli\u003E\nIVA enhancements\n\u003C/li\u003E\n\u003Cli\u003E\nPressurisation / airlocks\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ERoadmap\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOther mods have started to get involved with the development of CLS which is greatly apprechiated. However this does mean that a roadmap is needed so we direct our efforts in the same direction! It is divided up into two sections - \u0022Vision\u0022 (all the things that would be really cool, and we would love to see included) and \u0022scope\u0022 (this things that we are realistically targeting for now.)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EVision\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nProvide configuration for every part pack anyone has ever heard of.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EScope\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nProvide configuration for Stock parts and the most popular part packs.\n\u003C/li\u003E\n\u003Cli\u003E\nProvide a default config that adds the CLSModule to all parts with that can house crew to enable the persistance of space names\n\u003C/li\u003E\n\u003Cli\u003E\nImpliment the concept of openable / closeable hathes on docking ports.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EAlready Implimented\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBe able to detect different habitable spaces within a craft, and dectect which one are joined together and hich are not.\n\u003C/li\u003E\n\u003Cli\u003E\nAllow the user to highlight the different spaces, to see which parts make up those spaces. Also display habitable and passable/navigable parts differently.\n\u003C/li\u003E\n\u003Cli\u003E\nProvide an well documented API that allows 3rd party modders to use the Connected Living Space information.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EConfig documentation\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E - of interest to modders adding CLS support to existing mods.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere is a\u003Ca href=\u0022https://github.com/codepoetpbowden/ConnectedLivingSpace/blob/master/CLS%20Config%20HOWTO.txt\u0022 rel=\u0022external nofollow\u0022\u003E HOWTO\u003C/a\u003E to explains how the CLS config works.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EAPI - of interest to modders using CLS in their own mods.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe API provided by CLS is in the form of five classes that can be used to get information about a Vessel, the Habitable Spaces with in it, the Parts that make up that Habitable Space, and the Kerbals in those parts. CLS therefore provides 5 classes:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ECLSAddon\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis class provides an entry point for other mods that are interested in the CLS information\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003ECLSAddon Instance\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA static property that can be used to get access to the CLSAddon\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003ECLSVessel Vessel\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA property that returns an instance of the CLSVessel object that represents CLS understanding of the active vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nTypically a mod developper would use a line like:\n\u003C/p\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\nCLSVessel clsData = CLSAddon.Instance.Vessel;\u003C/pre\u003E\n\u003Cp\u003E\nto get access to the CLS data.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ECLSVessel\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCLSVessel is used to describe the vessel from CLS\u0027s point of view. It can be used to access the Parts and Spaces that make up the Vessel. It has methods and properties as described below:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EList\u0026lt;CLSSpace\u0026gt; Spaces\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis property provides access to the list of Spaces that are contained withing the Vessel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EList\u0026lt;CLSPart\u0026gt; Parts\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis property provides access to the list of Parts that make up the vessel from CLS\u0027s point ov view. The is a CLSPart that represents all of the Parts in the vessel even the ones that are neither Habitable nor Navigable (ie passable). This means that for any part in a vessel you can ask the question \u0022Is this Navigable? Is this Habitable?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003Evoid Highlight(bool)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Highlight method allows modders to ask CLS to hightlight all the Habitable Spaces within a vessel, or to turn this highlighting of. It is anticipated that it will be most useful for turning the highlighting all off, so that other highlighting schemes can be employed. Note that CLS itself provides a simple GUI to allow a player to visually see which parts are in which spaces.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ECLSSpace\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nCLSSpace is the heart of what CLS provides. While KSP already has the concept of Vessels, Parts and Kerbals, Habitable Spaces is a genuinely new concept, and is likely to be of most interest to modders. A CLSSpaces represents a group of one or more connected parts all of which a kerbal can pass through, and at least one of which a kerbel can live in. Note that one or more Naviagable but not Habitable Parts that are joined together to not make a Habitable Space.\n\u003C/p\u003E\n\u003Cp\u003E\nThe class has the following properties and methods:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EList\u0026lt;CLSKerbal\u0026gt; Crew\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Crew property provides a list of CLSKerbals which represents CLS\u0027s understanding of which kerbals are in currently in that particular Habitable Space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003Eint MaxCrew\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe MaxCrew property provides access to a single number that is the larest number of Kerbals that can be housed in the Habitable Space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EName\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Name property returns the name that has been given to a particular Habitable Space. While the habitable space\u0027s default name it taken either from the first Part that makes up the Habitable Space (or if that part has no CLS configuration available then a generic name generate by CLS), CLS does provide a GUI that allows the user to change the name of a paricular space.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that the name of the Habitable space is associated with and stored in each Part that makes up that space. Therefore if parts from that Space a removed (undocked) and docked with other parts to create a new Habitable Space, then that new Habitable space night have the same name as the old one. (The name of the Space might also be taken from the other parts that make up the space, depending on which parts where docked to which.)\n\u003C/p\u003E\n\u003Cp\u003E\nAlso be aware that if a part does not have any CLS configuration it will not be able to store the name of the Space that it is part of, so this will be lost between save or between the VAB and flight. CLS does recognise parts with seats for at least one Kerbal as Habitable and Navigable, even if there is not config to say that they are so.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EList\u0026lt;CLSPart\u0026gt; Parts\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Parts property returns list of CLSPart objects that represent the Parts that make up a particular Habitable Space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003ECLSVessel Vessel\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Vessel property provides a reference back to the CLSVessel object that represents the Vessel of which this Space is a part. Via this it is possible to access the other Habitable Spaces.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003Evoid Highlight(bool)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Highlight method allows a particular Habitable space to be Highlighted so that the user can see which parts make up the Space. Note that CLS provides a GUI that allows the player to highlight the different Spaces via this method.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ECLSPart\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe CLSPart class represents CLS\u0027s understanding of a particular Part in the Vessel. It can be cast into a Part in order to access the Part object that it is attached to. The contains the following properties and methods:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EList\u0026lt;CLSKerbal\u0026gt; Crew \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Crew property returns a List of all the CLSKerbal objects that represents the kerbals that are currently housed in a particular part.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003Ebool Docked\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Docked property returns a bool that indicates hether or not a particular Part has been identified as one half of a docked connection. When such Parts are highlighted via a call to the Highlight method they will be displayed as cyan (unless they are also Habitable in which case they will be displayed green). Be aware that when two docking ports are placed next to each other in a craft that is assembled in the VAB the two docking ports are not considered by the game to be docked, but instead are attached (this is reflected by the fact that right clicking on then displays the option to detach, rather than undock. It is only after they have been detached and then docked together again that they are considered to be docked by the game. CLS reflects this in the value of the Docked property.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003Ebool Habitable\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Habitable property returns a bool that indicates if one or more Kerbals can be housed in a particular part. If a part is Habitable then it will be Highlighted in green when the Highlight method is called.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003Ebool Navigable\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Navigable property returns a bool that indicates if a part can allow a kerbal to pass along it in order to get from one Habitable Part to another. Parts are considered to be Navigable if the \u0022passable\u0022 option is set in the configuration for that part. Be aware though that even if a part is marked as being passable, each of the attachment nodes on the parts can also either be passable or not. If no configuration relating to the attachment nodes is provided in the configuration then all the attachment nodes are considered passable by default. However configuration can be provided to indicate that some attachment nodes are not passable while others are.\n\u003C/p\u003E\n\u003Cp\u003E\nParts that are consider by CLS to be Navigable are highlighted in yellow when the Highlight method is called.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003ECLSSpace Space\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Space property returns a CLSSpace object that reffers back ti the Habitable Space that this Part is a part of. This allows a mod writter to discover what other Parts are in the same Habitable Space as this particular Part.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EHatchStatus\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe property provides information about the hatch status of a part that is docked (ie a docking port). A hatch in a docking port can be either Open, Closed or marked as not a docking port. Closed hatches split one Connected Living Space into two.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003Evoid Highlight(bool)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Highlight method allows a mod writter to ask CLS to highlight a particular Part with a colour to indicate what CLS knows about that part. They can be highlighted in one of the following colours:\n\u003C/p\u003E\n\u003Cp\u003E\nGreen - the part is Habitable, which means that kerbals can live in the part.\n\u003C/p\u003E\n\u003Cp\u003E\nYellow - the part is Navigable which means that kerbals can move through the part to access other habitable parts, but the part can not house a kerbal itself.\n\u003C/p\u003E\n\u003Cp\u003E\nCyan - the part is Docked which means that it is one of a pair of parts that have been docked together creating a Navigable passage. Note that is two non Navigable docking ports are docked together (ie the Jr Clampotrons) they will not create a Navigable passage and will not be highlighted in cyan.\n\u003C/p\u003E\n\u003Cp\u003E\nRed - the part is not Naviagable and therefore is not part of any of the Habitable spaces in a vessel.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ECLSKerbal\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe CLSKerbal class represents CLS\u0027s understanding of a particular Kerbal. You can access instances of this object from the Crew properites on the CLSVessel, CLSSpace and CLSPart classes. A CLSKerbal object can be cast into a ProtoCrewMember class to access the ProtoCrewMember object that it is associated with.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EOriginal thoughts (where this thread started):\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo although I am busy working on \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66694\u0022 rel=\u0022external nofollow\u0022\u003Eone mod that is pre-release\u003C/a\u003E, my mind is wandering through all the possibilities that KSP offers for modding, and am already plotting the next project! I thought I would just ask for some thoughts on the idea, and see if anyone has any suggestions of where it might go.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the idea is to identify habitable space in a craft that is contiguous, in order to create an extra consideration in the design of craft. So for example a command pod is habitable space, as is a Hitchhiker container. A docking port is not habitable, but it seems to me that all docking ports other than the junior size should be \u0022kerbal-passable\u0022 meaning a kerbal could pass through one. So if you had a command pod attached to a docking port, docking with a hitchhiker container attached to a docking port, then that would create one contiguous habitable space. However if you had a fuel tank inbetween that docking port and the hitchhiker container, then the space would not be congituous, and so the conbined docked craft would have two seperate habitable spaces.\n\u003C/p\u003E\n\u003Cp\u003E\nSo what use is this? Well it occurs to me that it could be taken into consideration for various features. Top of my list are:\n\u003C/p\u003E\n\u003Cp\u003E\n1) Crew transfer. If parts in components of the same contiguous living space then a mod could allow transfer of crew without the need for eva, but if they are not contiguous then this is not an option.\n\u003C/p\u003E\n\u003Cp\u003E\n2) Sanity mods. I know that at least a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/66009\u0022 rel=\u0022external nofollow\u0022\u003Ecouple \u003C/a\u003Eof people have suggested sanity mods. It seems to me that a sanity mod could take into account the way in which kerbal\u0027s sharing living space affect each other\u0027s sanity. Of course if the kerbals are living in non-continuous living spaces then they are not going to have the same affect on each other as if they are living together.\n\u003C/p\u003E\n\u003Cp\u003E\nMy proposal is to write a very light weight mod that identifies the contiguous habitable spaces (taking into account other types of part such as adapters, dockingports etc that could be considered passable), and allows the user to visually see which parts of the vessel make up each habitable space. However the main purpose of the mod is to expose this infomation as an API so that other mods can easily use the infomation for whatever functionaiity is envisioned, without having to worry about working out which spaces are continguous. It would also allow players to easily see if living psaces where connected or not, and so role play whatever rules they wanted to impose on themselves.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/60936\u0022 rel=\u0022external nofollow\u0022\u003Ecrew manifest mod \u003C/a\u003Ealready allows players to move kerbals betwen parts without EVA, so that feeds into 1) in my list above. I did mention this idea on the crew manifest thread, and the idea was recieved like a fart on a bus, but then I suppose that is understandable as many players are using crew manifest in order to avoid EVA. However that does not mean that me writting this mod need create a problem for such users.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I wanted to put the idea out there, and see if anyone had any further ideas for features that might benefit from the concept of connected living space.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-10T16:20:41Z\u0022 title=\u002202/10/2016 04:20  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 10, 2016\u003C/time\u003E by codepoet\u003C/strong\u003E\n\u003Cbr\u003EAdding information about the API\n\u003C/span\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2014-02-05T23:17:21Z","Content":"\n\u003Cp\u003Euhh is this a suggestion or are you making this mod ? Because i am confused now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-05T23:58:27Z","Content":"\n\u003Cp\u003EI am considering writing the mod myself. However I would welcome ideas, and suggestions of how it might be used as an API , both in features that I might impliment myself and features that might be writen by other modders too.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-02-06T12:37:48Z","Content":"\n\u003Cp\u003EI dont really have some usefull suggestions or comments.. just looking forward to this - immportant component of hypotetical sanity mod.\u003C/p\u003E\n"},{"CreatedByName":"Themorris","CreatedById":73387,"CreatedDateTime":"2014-02-06T13:34:41Z","Content":"\n\u003Cp\u003EJust for the open ports between the two vessels, this coud be archieved, by animating the hatch and set its size to zero to make it invisible(kind of), when two vessels are docked together.\u003C/p\u003E\n"},{"CreatedByName":"blackheart612","CreatedById":42741,"CreatedDateTime":"2014-02-06T15:07:51Z","Content":"\n\u003Cp\u003EYou can make it like fuel. With \u0022In\u0022 and \u0022Out\u0022 events but for crews. If you want, you can make IVA anims for it.... I dunno if that\u0027s possible. Just a crazy idea\u003C/p\u003E\n"},{"CreatedByName":"Parkaboy","CreatedById":64208,"CreatedDateTime":"2014-02-06T16:20:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blackheart612\u0022 data-cite=\u0022blackheart612\u0022\u003E\u003Cdiv\u003EYou can make it like fuel. With \u0022In\u0022 and \u0022Out\u0022 events but for crews.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI second this. It could also include a highlighting of all the contiguous space to a part, when that part was clicked; an easy way to visualize all the space available.\u003C/p\u003E\u003Cp\u003EBut it would be great to have an interface that allowed you to move the kerbal between spots, even inside the same cockpit. That way you could have your guy on the pilot seat while driving, and then switch him to a bed or a table when idle (Porkjet\u0027s habitats, for instance, have beds and tables).\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-06T20:51:36Z","Content":"\n\u003Cp\u003EOK, I was starting to wonder if it was an idea without merit, but it seems that some folks might be interested in this sort of functionality. I will look into starting this once I have got my other current project to a stable position that I can make a release.\u003C/p\u003E\u003Cp\u003EIs there anyone who is currently working on a sanity mod at the moment? I am full of ideas of how it could work, but I do not want spend time on it if someone else has a project that is making progress.\u003C/p\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-02-06T21:37:25Z","Content":"\n\u003Cp\u003EMoving around in IVA is one of the most wanted features for me. Having a truly interconnected base is one of the things that would greatly increase the enjoyment of the game for me. Hope this gets off the ground (pun very much intended)!\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-02-07T00:58:01Z","Content":"\n\u003Cp\u003EThis sounds good to me!\u003C/p\u003E\u003Cp\u003EHow will you handle the use of, say, stretchy conics as adapters between a hitchhiker and a docking port? (or either rockomax adapter).\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2014-02-07T01:34:46Z","Content":"\n\u003Cp\u003EIt\u0027s a great idea!\u003C/p\u003E\u003Cp\u003EI would suggest that the best way to decide which parts are navigable is to declare this to be the case in configs. For instance, you could create a new module...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EMODULE {\u003Cbr\u003E    MODULE = Navigability (or whatever name you choose for the module)\u003Cbr\u003E    navigablenode = nodename1\u003Cbr\u003E    navigablenode = nodename2\u003Cbr\u003E    ...\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAdd an entry such as this to a part so as to declare which nodes can be used as entrances and exits from a part. Parts without such listings are un-navigable, so parts which have obviously not-hatch-like nodes (such as the top stack node on the cupola) won\u0027t be free to be misused.\u003C/p\u003E\u003Cp\u003EAdvantages:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EIt simplifies your code enormously\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt prevents Kerbals teleporting through solid walls!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt allows Kerbals to use fuselage parts and other parts without IVAs as access corridors\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDisadvantages:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EA config entry has to be created for each part\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-07T06:40:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022softweir\u0022 data-cite=\u0022softweir\u0022\u003E\u003Cdiv\u003EIt\u0027s a great idea!\u003Cp\u003EI would suggest that the best way to decide which parts are navigable is to declare this to be the case in configs. For instance, you could create a new module...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EMODULE {\u003Cbr\u003E    MODULE = Navigability (or whatever name you choose for the module)\u003Cbr\u003E    navigablenode = nodename1\u003Cbr\u003E    navigablenode = nodename2\u003Cbr\u003E    ...\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAdd an entry such as this to a part so as to declare which nodes can be used as entrances and exits from a part. Parts without such listings are un-navigable, so parts which have obviously not-hatch-like nodes (such as the top stack node on the cupola) won\u0027t be free to be misused.\u003C/p\u003E\u003Cp\u003EAdvantages:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EIt simplifies your code enormously\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt prevents Kerbals teleporting through solid walls!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt allows Kerbals to use fuselage parts and other parts without IVAs as access corridors\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDisadvantages:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EA config entry has to be created for each part\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is pretty much what I had in mind. I was considering marking parts as passable/navigable in the config, and for parts where then config was absent, using a few hueristics to make a guess. I was also thinking of the mod having a list of predefined config list for all the major part packs, so that it mostly worked \u0022out of the box\u0022, but part makers could specify their own config if they were interested to.\u003C/p\u003E\u003Cp\u003EI like the idea of defining passablity/navigability on attachment nodes rather than parts though - like you say it stops people doing cheeky things like trying to break out through the cupla windows.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-07T07:31:53Z\u0022 title=\u002202/07/2014 07:31  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 7, 2014\u003C/time\u003E by codepoet\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"},{"CreatedByName":"Garek","CreatedById":73214,"CreatedDateTime":"2014-02-07T14:51:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022codepoet\u0022 data-cite=\u0022codepoet\u0022\u003E\u003Cdiv\u003Elike trying to break out through the cupla windows.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENow I imagine Jebediah breaking one of those windows with a hammer to get into SPAAACEEE \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut seriously, I like this concept. It would propably be nice to have more area-types than habitable and navigable, e.g.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ENavigable (can go through, but not stay)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECorridor (can stay, but doesn\u0027t do anything)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHabitat (can stay and regenerates sanity/required for Life Support/....)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E... (Command, Lab, ... but I don\u0027t know what those would actually do)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThat would allow us to differentiate between actual habitat units and stuff like the FusTek nodes, where Kerbals could stay and have IVA (e.g. RPMs walkthrough feature), but shouldn\u0027t for a long time.\u003C/p\u003E\n"},{"CreatedByName":"Crater","CreatedById":48907,"CreatedDateTime":"2014-02-07T15:31:04Z","Content":"\n\u003Cp\u003ENothing much to add from a suggestion perspective, since everything I thought up as I read through the thread has already been said, but I definitely want to add another voice in support of this being an excellent idea for a mod!\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-07T21:50:55Z","Content":"\n\u003Cp\u003EWell I have been sufficently encouraged to start coding. Keep the encouragement coming \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"boberts314","CreatedById":69216,"CreatedDateTime":"2014-02-07T23:33:52Z","Content":"\n\u003Cp\u003EI feel like I\u0027ve been seeing more and more IVA related mods and IVA-only missions lately. I kind of like the thought that you might eventually be able to do everything in the game from a first person perspective. Something like this would obviously be an important step in that direction, certainly.\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-09T00:05:57Z","Content":"\n\u003Cp\u003EThe tiniest amount of progress to report, but I have started coding. It really is not much to look at, but here is a picture:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s13.postimg.org/r6dv9e9sn/screenshot99.png\u0022 alt=\u0022screenshot99.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat this shows is that in the \u0022Connected Living Space\u0022 window the mod is displaying its understanding of the living spaces in the craft on the pad. It has identified that there is a living space made up of the Mark1-2 pod and the mk1pod, and there is another, seperate living space made up of the Mk2LanderCabin and the landerCabinSmall.\u003C/p\u003E\u003Cp\u003ELike I say not terribly exciting, but the information it is displaying will be the heart of this mod - the ability to work out which habitable parts are connected to which other habitable parts, and which habitable parts are cut off from others.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-09T00:06:36Z\u0022 title=\u002202/09/2014 12:06  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 9, 2014\u003C/time\u003E by codepoet\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"aeTIos","CreatedById":17032,"CreatedDateTime":"2014-02-09T00:58:45Z","Content":"\n\u003Cp\u003EThat looks like a great start already!\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-02-09T01:01:20Z","Content":"\n\u003Cp\u003EThat\u0027s really awesome. I\u0027m curious to see where this goes. Though, the one flaw I see is that the Mk1 pod has a heat shield on it\u0027s bottom, not a port, like all the other pods do, so it would logically not be able to transfer crew.\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-09T06:51:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EThat\u0027s really awesome. I\u0027m curious to see where this goes. Though, the one flaw I see is that the Mk1 pod has a heat shield on it\u0027s bottom, not a port, like all the other pods do, so it would logically not be able to transfer crew.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe will be able to take that into account by providing config for the various attachment nodes for each part - so we will be albe to say that the tope node for a mk1-2pod is navigable, but the bottom node (heatshield) is not. I have not yet written the code to read in that config, so at the moment you can transfer through the heatshield.\u003C/p\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2014-02-09T07:27:14Z","Content":"\n\u003Cp\u003EThe mk1-2 pod actually does visually have hatches on both the top and bottom nodes (and it does not have a heatshield).\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-02-09T07:52:07Z","Content":"\n\u003Cp\u003EThis is a really cool idea and using PartModules with ModuleManager will make things a lot easier to code, good to see you\u0027re heading that way.\u003C/p\u003E\u003Cp\u003EA suggestion, if I may? Provide an automatic means for Kerbals to move through the living area. As in, have them move around the craft randomly. This could be done via a random check every hour or so while the vessel is focused and a random \u0022scrambling\u0022 of the Kerbals when switching to a vessel (if the time delta is enough) or after timewarping. Have the moving time delta reset when engines are ignited or some sort of human input has been done. Just an idea, but I feel it will increase the immersion this mod will provide.\u003C/p\u003E\u003Cp\u003ELooking forward to seeing where you take this!\u003C/p\u003E\n"},{"CreatedByName":"CaptainBlue","CreatedById":45847,"CreatedDateTime":"2014-02-09T11:02:11Z","Content":"\n\u003Cp\u003EHmm, what about adding a time required for a kerbal to move from one area to another feature? Also, the more parts between one living space to another the longer it takes?\u003C/p\u003E\n"},{"CreatedByName":"aeTIos","CreatedById":17032,"CreatedDateTime":"2014-02-09T11:13:25Z","Content":"\n\u003Cp\u003EGreat work. What about coloring the different living spaces with a kind of glow, just like the hover glow?\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2014-02-09T13:40:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022aeTIos\u0022 data-cite=\u0022aeTIos\u0022\u003E\u003Cdiv\u003EGreat work. What about coloring the different living spaces with a kind of glow, just like the hover glow?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, that is what I am planning. At the moment I am just writing the code to wall the part tree, identifying which part in in which space, reading the config to take into account which parts are habitable / navigable / passable which attachment nodes are navigable / passable etc etc.\u003C/p\u003E\u003Cp\u003EBut once I have done all that boring sort of work, I hope to be able to add some pretty as well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}