{"TopicId":62900,"ForumId":36,"TopicTitle":"Kerbal Construction Time/StageRecovery Dev Thread","CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2014-02-11T19:11:39Z","PageNum":53,"Articles":[{"CreatedByName":"Benti","CreatedById":161870,"CreatedDateTime":"2017-03-03T15:59:35Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/157548-eberkain/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022157548\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/157548-eberkain/\u0022 rel=\u0022\u0022\u003E@eberkain\u003C/a\u003E awesome dude!\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-03T17:03:50Z","Content":"\n\u003Cp\u003E\nHmm. I may look into that but it\u0027d be an after-release kind of thing. A lot of work for a \u0022nice to have\u0022 rather than a \u0022need to have\u0022 when the current system is plenty functional, just not as cool. It\u0027s something that someone else could try to add in as well post-release.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: \u003Ca href=\u0022http://magico13.net:8080/\u0022 rel=\u0022external nofollow\u0022\u003EThe build server is back up and running\u003C/a\u003E (mostly)! It\u0027s only got MagiCore fully working and the Modlets half-working (their GameData folders aren\u0027t in source control yet, so I can\u0027t autogenerate .zips yet). Adding in StageRecovery, KCT, and anything else will be trivial now since I can just copy an existing project. The hard part was getting the first builds running (building .NET projects on Linux is always an adventure).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat this means is that any time I push code to GitHub, it\u0027ll automatically get built into a .dll that can be downloaded and installed. For full releases I typically have it be automatically packaged in a .zip file with a full GameData structure, but for small dev builds it\u0027s usually just the .dll (I may change that this time around). Not every build is really useable since I may make breaking changes between builds, but I will frequently tell testers to grab a specific build and it makes full releases much simpler and safer (multiple times I\u0027ve released an update with the wrong versions of the .dlls in it...)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNot having the build server has kinda sucked, so I\u0027m really happy to have it running again. It\u0027ll make dev builds much, much easier to manage and I won\u0027t have to manually copy them over to dropbox and rename them so they have unique names.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-04T04:55:20Z\u0022 title=\u002203/04/2017 04:55  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 4, 2017\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-03-06T22:41:13Z","Content":"\n\u003Cp\u003E\nI broke it again...\n\u003C/p\u003E\n\u003Cp\u003E\ndo I have to delete the KCT settings in my savefiles?\n\u003C/p\u003E\n\u003Cp\u003E\ndoes anyone have step by step instructions for installation?\n\u003C/p\u003E\n\u003Cp\u003E\nis  reason it broke above?\n\u003C/p\u003E\n\u003Cp\u003E\nNEVERMIND\n\u003C/p\u003E\n\u003Cp\u003E\nI just had to delete my settings from my savefile\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-07T03:11:04Z\u0022 title=\u002203/07/2017 03:11  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 7, 2017\u003C/time\u003E by StupidAndy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-03-11T22:37:03Z","Content":"\n\u003Cp\u003E\nOkay, I finally got around to testing a little. And yes, just as expected: KCT and CustomBarnKit \u003Cem\u003Ereally\u003C/em\u003E don\u0027t get along. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E This is a major bummer, since I definitely do want both of them. They were supposed to be among the core of mods for my next install.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273338\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0022 rel=\u0022\u0022\u003E@magico13\u003C/a\u003E - Is there any chance that you might be able to look at this? I mean, I\u0027ll understand if you\u0027re short on time and this is just too specific and obscure of an interaction to deal with... but well, I can at least ask, right? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s a summary of things I noticed breaking in my tests:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nTested on KSP 1.2.2\n\u003C/p\u003E\n\u003Cp\u003E\nMods present:\u003Cbr\u003E\n- Module Manager 2.7.5\u003Cbr\u003E\n- CustomBarnKit 1.1.10\u003Cbr\u003E\n- KerbalConstructionTime Prerelease 1.2_3\n\u003C/p\u003E\n\u003Cp\u003E\nWhen CustomBarnKit is present alone, a custom config with four building upgrade tiers works as intended.\u003Cbr\u003E\nWhen KCT is present alone, stock building upgrades (both instant and timed building upgrades) work as intended.\n\u003C/p\u003E\n\u003Cp\u003E\nWith both mods present, a 4-tier building config loaded, and timed building upgrades active, things break hard at the completion of any building upgrade. The process gets stuck at 100% in the building list, impossible to remove; framerate drops as CPU load shoots up; a message is displayed that \u0022this building upgrade is already requested\u0022 (paraphrased); and funds first gets reset to zero, but then starts rapidly ticking upwards, never stopping.\n\u003C/p\u003E\n\u003Cp\u003E\nSolution: disable timed building upgrades. That way, upgrades no longer completely bug out. However, there are other problems. Since there are only three building tier assets available, you can tell CustomBarnKit that the middle visual building tier should be used for buildings levels 2 and 3, and the third and final one would only get used for level 4. But! If KCT is present and the order of of visual building tiers is configured to be anything other than 1,2,3 for the first three stages, the visual building tiers go haywire.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, if a level 1 building is directed to have anything other than tier 1 graphics, then upon starting a new save, the building is assigned a random graphics tier. Sometimes it looks like first-tier, sometimes like second-tier, sometimes like third tier. Also, the first upgrade conducted always switches a building to tier 2 graphics; and if the order is changed in any way from stock, you never get to see the third tier at all (unless it randomly gets selected for something at save start).\n\u003C/p\u003E\n\u003Cp\u003E\nSolution: stick with stock tier progression, and the fourth upgrade tier will just have to be the one that\u0027s visually indistinguishable from the tier before it. This prevents bugs with the visual building tiers. But unfortunately it breaks something else:\n\u003C/p\u003E\n\u003Cp\u003E\nif a building has the tier 3 graphics active, then doing anything that reloads the space center screen will magically set that building to its maximum level. In essence, KCT seems to look at the building and go \u0022Hey, this building has maximum tier graphics. Clearly it must be maximum level. What is the maximum level, 4? Okay, I don\u0027t care what level this building was before, it is now level 4.\u0022 So the player gets all their level 4 upgrades instantly and free of charge right after they can afford the level 3 upgrades.\n\u003C/p\u003E\n\u003Cp\u003E\nSolution: I have not found any.\n\u003C/p\u003E\n\u003Cp\u003E\nBut wait, there\u0027s more!(tm) Apparently KCT scales the time it takes to roll out a vessel to the pad by the level of the pad. (Is this even intended? It doesn\u0027t make much sense to me to have that in the first place.) And if you have a launchpad of a level that is not 1 or 2 or 3, then the result of the vessel rollout time calculation is \u0022Infinity, NaN:NaN:NaN\u0022. And the rollout literally never finishes.\n\u003C/p\u003E\n\u003Cp\u003E\nSolution: I have not found any.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-12T17:43:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222982966\u0022 data-ipsquote-contentid=\u002262900\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489271823\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut wait, there\u0027s more!(tm) Apparently KCT scales the time it takes to roll out a vessel to the pad by the level of the pad. (Is this even intended? It doesn\u0027t make much sense to me to have that in the first place.)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt is intended. The rollout and reconditioning are both linked (they\u0027re internally the same thing) and reconditioning of the pad takes less time for the more basic launch pads. It\u0027s reasonable that the facilities to put a rocket vertical are simpler at a more basic pad and require less time. If you want to disable that, just remove the \u0022/ (3-[L])\u0022 from the reconditioning formula. In fact, that\u0027s probably why the rollout goes to infinity, since a 4th level launchpad will have [L] = 3 and you\u0027re dividing by zero.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it sounds like Custom Barnkit is completely incompatible with KCT right now. I\u0027ll try to look into it, but it\u0027ll be a while from now.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-03-13T12:34:07Z","Content":"\n\u003Cp\u003E\nAh, so if that part of the formula was \u0022/ (4-[L])\u0022 it would no longer divide by zero? Good to know. That means the only thing that\u0027s really a dealbreaker is the unintentional auto-upgrading to max level of anything that has tier 3 graphics.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, I understand. I am in no hurry myself; I am doing so much customizing work that I probably won\u0027t start this playthrough until 1.3 and its associated mod updates. I\u0027ll check back come 1.3 to see if you were able to wrap up a release for it, and then I\u0027ll test again.\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-13T17:30:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222984158\u0022 data-ipsquote-contentid=\u002262900\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489408447\u0022 data-ipsquote-userid=\u002298962\u0022 data-ipsquote-username=\u0022Streetwind\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Streetwind said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAh, so if that part of the formula was \u0022/ (4-[L])\u0022 it would no longer divide by zero? Good to know. That means the only thing that\u0027s really a dealbreaker is the unintentional auto-upgrading to max level of anything that has tier 3 graphics.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, I understand. I am in no hurry myself; I am doing so much customizing work that I probably won\u0027t start this playthrough until 1.3 and its associated mod updates. I\u0027ll check back come 1.3 to see if you were able to wrap up a release for it, and then I\u0027ll test again.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat might have been why it was infinite. Except that based on what you\u0027re reporting I\u0027m not sure it would work correctly anyway.\n\u003C/p\u003E\n"},{"CreatedByName":"Bornholio","CreatedById":173101,"CreatedDateTime":"2017-03-14T14:01:06Z","Content":"\n\u003Cp\u003E\n\u0026lt;----- On sidelines cheering magico13 on.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022cub_rockets_lesson0_figure1.JPG\u0022 class=\u0022ipsImage\u0022 src=\u0022https://teachengineeringprod.blob.core.windows.net/content/cub_/curricular_units/cub_rockets/cub_rockets_lesson0_figure1.JPG\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-16T03:24:17Z","Content":"\n\u003Cp\u003E\nAnyone feeling particularly bored and want to test a few things for StageRecovery? Two main areas need to be tested: Integration with FMRS and kerbal recovery (both through pre-recovery and old-style post-recovery). It\u0027s also a test to make sure the build server is producing functional builds, since for a while it was making builds that wouldn\u0027t actually load despite compiling,\n\u003C/p\u003E\n\u003Cp\u003E\nGet build #14 (or later) \u003Ca href=\u0022http://magico13.net:8080/job/StageRecovery%20Beta/\u0022 rel=\u0022external nofollow\u0022\u003Efrom the build server\u003C/a\u003E (just download the StageRecovery.zip file under \u0022Last Successful Artifacts\u0022).\n\u003C/p\u003E\n\u003Cp\u003E\nAs always, I\u0027ll need logs. If you don\u0027t know what logs, check \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83212-how-to-get-support-read-first/\u0022 rel=\u0022\u0022\u003Ethis post\u003C/a\u003E. The wrong logs probably don\u0027t help and snippets pulled out of logs really don\u0027t help either.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFMRS testing\u003C/strong\u003E:\u003Cbr\u003E\nIf FMRS isn\u0027t installed, SR should work as normal.\u003Cbr\u003E\nIf FMRS is installed but not armed, SR should work as normal.\u003Cbr\u003E\nIf FMRS is armed, handling parachutes, and hasn\u0027t deferred to SR, then SR shouldn\u0027t do anything at all.\u003Cbr\u003E\nIf FMRS is armed, handling chutes, but has deferred to SR, then SR will handle chute only stages and FMRS will handle kerbal/probes.\u003Cbr\u003E\nFMRS armed, not handling chutes (deferred doesn\u0027t matter), then SR handles chutes and FMRS gets kerbals/probes.\u003Cbr\u003E\nOutside of flight scene, SR should handle everything.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EKerbal recovery testing:\u003C/strong\u003E\u003Cbr\u003E\nBoth pre-recovery (where the kerbals are recovered before the stage is destroyed, by SR guessing that the stage will be deleted) and normal SR styled recovery (where the kerbals are recovered after the OnVesselDestroyed event is fired, when everything else is handled). Whether Pre-recovery is enabled is now a setting you can change in-game.\n\u003C/p\u003E\n\u003Cp\u003E\nEnsure that any kerbals recovered by SR appear in the Astronaut Complex as available and have the flight added to their flight log (they get XP as expected).\u003Cbr\u003E\nI\u0027m curious if contracts will still fail (like tourist ones). Probably, but if someone tests it then let me know the results (ideally with and without pre-recovery active).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSome notes about pre-recovery. Below 25km altitude it\u0027s basically the same as regular recovery. It\u0027s still worth testing there but it isn\u0027t as big of a deal. The best point to test it with is dropping something suborbital from 30\u002Bkm altitude while still continuing on so the stage unloads above 25km. That will cause it to get added to the watch list, then SR will wait for it to just about be destroyed and pull out the kerbals, then when destroyed it associates the kerbals and either recovers them or lets them die. Contracts might not fail here, since the kerbals never actually die. With post-recovery the kerbals are killed and then resurrected when the stage is processed, which will fail contracts but has the kerbals available at least.\n\u003C/p\u003E\n\u003Cp\u003E\nBtw, pre-recovery has been active for a while now. The option to turn it off is new though. It sometimes has issues with firing at the wrong time and just randomly stealing kerbals out of ships and killing them. Naughty kraken.\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-18T22:39:37Z","Content":"\n\u003Cp\u003E\nStageRecovery has been officially updated and the links on the \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E have been changed to point back to the build server instead of dropbox links. As a result, you don\u0027t have to grab the old release and pop the new .dll in, instead you can just grab that and it will have the latest MagiCore and all the required files. I merged in the PR from a while back that removes a bunch of simulation related code, but haven\u0027t made any changes myself yet. I\u0027m going to look at Custom Barn Kit tonight.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150041-thunder175/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022150041\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150041-thunder175/\u0022 rel=\u0022\u0022\u003E@thunder175\u003C/a\u003E Would either of you be willing to test out the latest build (#5 or later, from \u003Ca href=\u0022http://magico13.net:8080/job/Kerbal%20Construction%20Time%20Beta/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E) with Custom Barnkit? From my testing it doesn\u0027t appear to break everything horribly anymore, but I think the last tier isn\u0027t getting the right model for some reason, but it could just be that my CB config isn\u0027t correct since I\u0027ve not used it before. Preferably test with and without having \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E build times active and in a save you don\u0027t care about (a new one or a copy)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T00:44:29Z\u0022 title=\u002203/19/2017 12:44  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-03-19T11:41:35Z","Content":"\n\u003Cp\u003E\nYou are a steely-eyed modding man, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273338\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0022 rel=\u0022\u0022\u003E@magico13\u003C/a\u003E! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve tested the new version, and indeed the only thing that still doesn\u0027t work is switching the building tier graphics if level 3 is defined with second-tier and level 4 is defined with third-tier graphics. But if I use 1, 2, 3, 3 for building tier graphics progression instead of 1, 2, 2, 3, then everything works as intended. No more spontaneous self-destruct of the savegame when using \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E build times, no more accidental auto-upgrades of buildings, no more random building tier graphics on savegame start if level 1 is defined with anything other than first-tier.\n\u003C/p\u003E\n\u003Cp\u003E\nI still got an infinite/NaN rollout time on the level 4 launchpad. I then went into the settings and changed the formula to be (4-[L]) instead of (3-[L]), as discussed further up. That fixed the problem, and the level 4 launchpad works perfectly now.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNote: i have not toyed with multiple launchpads yet. I don\u0027t know how those work even without CBK present. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Oh, and it seems like the auto-upgrading buildings bug may have been a CBK issue all along. I just got it again, but amusingly enough while testing something \u003Cem\u003Ewithout\u003C/em\u003E KCT installed. I\u0027ve submitted a bug report to sarbian, let\u0027s see what he says. I\u0027m telling you this just in case somebody tries to bug report this to you at a later date.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-19T14:04:25Z\u0022 title=\u002203/19/2017 02:04  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 19, 2017\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thunder175","CreatedById":150041,"CreatedDateTime":"2017-03-19T13:47:08Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273338\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0022 rel=\u0022\u0022\u003E@magico13\u003C/a\u003E I reverted back to my changes in CustomBarnKit that were causing the issues, and after installing the new version of KCT with my current (backed up) save all seems to be working fine. The only significant changes to my custombarnkit config were adding levels to the astronaut complex and mission control. So I can\u0027t comment on \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E issue with the launchpad. \n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-22T02:10:15Z","Content":"\n\u003Cp\u003E\nFrom a purely hypothetical perspective at this point, how do you all feel about Patreon? I know other modders have had some success with it (linuxgurugamer and RoverDude to name some that I know of). It\u0027s never enough to actually cover bills, but it\u0027s a solid commitment tying me to supporting and improving my mods (other than \u0022because I want to play with them\u0022) and would help justify spending entire evenings and weekends on modding. I\u0027d want to do something fun with it too, like have a stretch goal of having monthly live streams or something like that. Or like with \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E where different levels get you different things, like access to the lolcommits. I have no idea what I\u0027d actually do for those though, so if you have ideas let me know.\n\u003C/p\u003E\n\u003Cp\u003E\nAt this point I\u0027m just gauging opinions by you all. There\u0027s certainly less of an audience here than the other threads, but anyone reading this is also likely more involved with mods than in a release thread.\n\u003C/p\u003E\n"},{"CreatedByName":"JeffreyCor","CreatedById":93167,"CreatedDateTime":"2017-03-22T02:29:03Z","Content":"\n\u003Cp\u003E\nIt certainly doesn\u0027t give any negative connotations. I think it would be a good idea providing an avenue for those with both desire and means to be able to send in something to contribute to development as the are able to.\n\u003C/p\u003E\n"},{"CreatedByName":"Aaron S R","CreatedById":176128,"CreatedDateTime":"2017-03-22T04:07:32Z","Content":"\n\u003Cp\u003E\nI have just registered this account for the express purpose of saying I would gladly donate my spare dollars! I think its only fair considering you spend some of your free time making my game better.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"eberkain","CreatedById":157548,"CreatedDateTime":"2017-03-22T08:23:31Z","Content":"\n\u003Cp\u003E\nSince KCT is such an integral part of my kerbal experience I would definitely contribute.  I really think the Paetron model is the way to go anyhow, instead of paid mods in general as Steam seems heart set on implementing at some point.  \n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-23T02:14:03Z","Content":"\n\u003Cp\u003E\nWell, I\u0027ve made a Patreon now. If you have ideas for rewards or goals then let me know. The current ones are subject to change. For anyone who does contribute, thank you in advance!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.patreon.com/magico13\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.patreon.com/magico13\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDay later edit but I don\u0027t want to double post: I just made a build because of a WIP update to MagiCore that I\u0027d be wary of using with any other mods that reference MagiCore (of released things that\u0027s currently just Sensible Screenshot and Dated QuickSaves I think). They shouldn\u0027t have been affected since the methods they use weren\u0027t modified, but it\u0027s something to be aware of.\n\u003C/p\u003E\n\u003Cp\u003E\nThe reason for this change is that if you\u0027ve got a mod and you want to add your own variables to any formulas, there\u0027s now an event called onMCVariableReplacing that sends an identifier for the formula (like \u0022KCT_BUILD_RATE\u0022) and a dictionary that you can add your variables and their values to. Then after the event has finished the replacement occurs, so another mod could easily add new variables or change existing ones if they wanted, without referencing KCT\u0027s assemblies at all. Combine that with a Preset and another mod could conceivably completely override KCT\u0027s own processing of pretty much everything without ever referencing KCT in code. Which is pretty awesome.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-24T03:05:11Z\u0022 title=\u002203/24/2017 03:05  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 24, 2017\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-03-26T02:05:30Z","Content":"\n\u003Cp\u003E\nis there a way to get more then 45 build points in sandbox? do I have to transmit science back to Kerbin to get more like in career? does it do that in career?\n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-26T02:40:21Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222997434\u0022 data-ipsquote-contentid=\u002262900\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221490493930\u0022 data-ipsquote-userid=\u0022171175\u0022 data-ipsquote-username=\u0022StupidAndy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n33 minutes ago, StupidAndy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nis there a way to get more then 45 build points in sandbox? do I have to transmit science back to Kerbin to get more like in career? does it do that in career?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can just increase the number in the settings. It\u0027s the third number in a field that should say \u002215,15,45\u0022. In career it\u0027s based on how many tech nodes you\u0027ve unlocked.\n\u003C/p\u003E\n"},{"CreatedByName":"thunder175","CreatedById":150041,"CreatedDateTime":"2017-03-26T12:33:50Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273338\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0022 rel=\u0022\u0022\u003E@magico13\u003C/a\u003E I\u0027ve noticed something over the past couple days that I want to report. I have three launch pads. The first (default) is still Level 2. My other two pads are Level 3. I like keeping one pad level 2 for lighter launchers. Usually on initial load, the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E timers are only rolling for the first two entries in the construction queue, everything else is awaiting construction. When I change pads using the buttons, the other queue\u0027d items begins constructions again (up to 4) and all is well. I haven\u0027t tried or verified this behavior in a fresh save. When I downloaded your latest dev build you recommended a few posts up, I started noticing this behavior. I\u0027ll see if I can get some screenshots next time it happens. \n\u003C/p\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-26T17:58:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222997722\u0022 data-ipsquote-contentid=\u002262900\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221490531630\u0022 data-ipsquote-userid=\u0022150041\u0022 data-ipsquote-username=\u0022thunder175\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, thunder175 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273338\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0022 rel=\u0022\u0022\u003E@magico13\u003C/a\u003E I\u0027ve noticed something over the past couple days that I want to report. I have three launch pads. The first (default) is still Level 2. My other two pads are Level 3. I like keeping one pad level 2 for lighter launchers. Usually on initial load, the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E timers are only rolling for the first two entries in the construction queue, everything else is awaiting construction. When I change pads using the buttons, the other queue\u0027d items begins constructions again (up to 4) and all is well. I haven\u0027t tried or verified this behavior in a fresh save. When I downloaded your latest dev build you recommended a few posts up, I started noticing this behavior. I\u0027ll see if I can get some screenshots next time it happens. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEasily reproduced with just KCT. Probably related to issue \u003Ca href=\u0022https://github.com/magico13/KCT/issues/119\u0022 rel=\u0022external nofollow\u0022\u003E#119\u003C/a\u003E. I\u0027m guessing the rates just aren\u0027t being recalculated at scene start, even though they should be. Hopefully an easy fix.\n\u003C/p\u003E\n\u003Cp\u003E\nActually, it\u0027s probably related to the change to support CustomBarnKit, since the facility levels aren\u0027t fully up to date right at scene change. They\u0027ll report 0 for max levels for a little while until it actually loads, and then they\u0027ll say the right amount later. It\u0027s probably caching the 0 value, since a level 0 \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E only allows two rates.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150041-thunder175/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022150041\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150041-thunder175/\u0022 rel=\u0022\u0022\u003E@thunder175\u003C/a\u003E it should be fixed in build #8 from the build server.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-26T19:01:44Z\u0022 title=\u002203/26/2017 07:01  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 26, 2017\u003C/time\u003E by magico13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyKaptn","CreatedById":153990,"CreatedDateTime":"2017-03-26T22:19:16Z","Content":"\n\u003Cp\u003E\nI skimmed through the last pages back to november, but I could not see any reports of airplanes being placed vertically on the runway. To avoid this I have to edit my stored plane before every launch so it faces horizontally. But as soon as I recover it back to \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E, it reverts back to vertical.\n\u003C/p\u003E\n\u003Cp\u003E\nRunning latest dev build (I think.. downloaded it 4 or 5 days ago).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-26T22:21:17Z\u0022 title=\u002203/26/2017 10:21  PM\u0022 data-short=\u00227 yr\u0022\u003EMarch 26, 2017\u003C/time\u003E by SkyKaptn\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magico13","CreatedById":73338,"CreatedDateTime":"2017-03-26T22:27:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222998344\u0022 data-ipsquote-contentid=\u002262900\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221490566756\u0022 data-ipsquote-userid=\u0022153990\u0022 data-ipsquote-username=\u0022SkyKaptn\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, SkyKaptn said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI skimmed through the last pages back to november, but I could not see any reports of airplanes being placed vertically on the runway. To avoid this I have to edit my stored plane before every launch so it faces horizontally. But as soon as I recover it back to \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E, it reverts back to vertical.\n\u003C/p\u003E\n\u003Cp\u003E\nRunning latest dev build (I think.. downloaded it 4 or 5 days ago).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://quaternion\u0022 rel=\u0022external nofollow\u0022\u003EKnown issue\u003C/a\u003E for a long time. It\u0027s been there since the beginning. I have an idea of where to fix it, but need to figure out how to use quaternions. \n\u003C/p\u003E\n"},{"CreatedByName":"Rodhern","CreatedById":144074,"CreatedDateTime":"2017-03-27T05:53:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222998352\u0022 data-ipsquote-contentid=\u002262900\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221490567251\u0022 data-ipsquote-userid=\u002273338\u0022 data-ipsquote-username=\u0022magico13\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, magico13 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://quaternion\u0022 rel=\u0022external nofollow\u0022\u003EKnown issue\u003C/a\u003E for a long time. It\u0027s been there since the beginning. I have an idea of where to fix it, but need to figure out how to use quaternions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think you can use Transform.Rotate in Unity with just a three dimensional parameter, if you don\u0027t want to study quaternions.\n\u003C/p\u003E\n"},{"CreatedByName":"PhoenixSpaceIndustries","CreatedById":176275,"CreatedDateTime":"2017-03-27T09:15:42Z","Content":"\n\u003Cp\u003E\nHi there \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0026amp;do=hovercard\u0022 data-mentionid=\u002273338\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/73338-magico13/\u0022 rel=\u0022\u0022\u003E@magico13\u003C/a\u003E! I\u0027ve been using KCT for a while, and have now updated to the latest KSP. I wonder whether this release is compatible, and if so, would you be happy with me joining the testing? Also, I notice you\u0027ve been asking about FMRS - I can\u0027t find a version of that for 1.2, any idea where there is one? \n\u003C/p\u003E\n\u003Cp\u003E\nThanks! \n\u003C/p\u003E\n"}]}