{"TopicId":65500,"ForumId":36,"TopicTitle":"[WIP] Kerbal Space Engine - bring Space Engine to KSP","CreatedByName":"darkside","CreatedById":69433,"CreatedDateTime":"2014-03-11T23:45:21Z","PageNum":1,"Articles":[{"CreatedByName":"darkside","CreatedById":69433,"CreatedDateTime":"2014-03-11T23:45:21Z","Content":"\n\u003Cp\u003EI made a program, or rather a script because it is written in Perl, that takes a solar system of your choice from \u003Ca href=\u0022http://spaceengine.org/\u0022 rel=\u0022external nofollow\u0022\u003ESpace Engine\u003C/a\u003E and tries it\u0027s best to build a solar system based on it that can be played in KSP. The only requirement is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55145-0-23-WIP-Alpha-Real-Solar-System-v5-5-KSP23-fix-12-23-13\u0022 rel=\u0022external nofollow\u0022\u003EReal Solar System\u003C/a\u003E, it does all the heavy lifting here. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/56993-Krag-s-Planet-Factory-New-Planets\u0022 rel=\u0022external nofollow\u0022\u003EPlanet Factory\u003C/a\u003E is strongly recommended although not 100% required. I haven\u0027t come up with a good name so I am calling it Kerbal Space Engine for now, going to change that as it may be confusing.\u003C/p\u003E\u003Cp\u003ESingle and binary solar systems are supported, binary are not done quite right because the sun always wants to be in the center, but I think they are still good enough. Planet Factory is required for binary systems.\u003C/p\u003E\u003Cp\u003EI was adding the ability to auto import planet textures by the means of a plugin called Texture Replacer, but it didn\u0027t work as good as I\u0027d like it to, especially if you try to land on a modified planet. And then (just yesterday) I discovered Planet Factory CE, that seems to be just perfect for the task, so I\u0027ll be rewriting my program to work with that and should release soon.\u003C/p\u003E\u003Cp\u003EUsing the program in it\u0027s current state is a little complicated so I was going to release it as a web tool, source code of course would be released too. But right now I am looking at rewriting a significant portion of it and also developing a web frontend, so before proceeding with all that I want to make sure that someone is actually interested in such tool. As of right now it is good enough for my personal use but certainly not in shape for public release. So tell me what do you think.\u003C/p\u003E\u003Cp\u003EAnd here is an example of it\u0027s work and a few pictures.\u003C/p\u003E\u003Cp\u003EExample RealSolarSystem.cfg includes a system handpicked in Space Engine by me and converted using this tool I am talking about, no editing was done so if you look inside you\u0027ll probably see many horrible things.\u003C/p\u003E\u003Cp\u003EMake sure you have Real Solar System installed, download RealSolarSystem.cfg and put in in your GameData\\RealSolarSystem. Back up the original file before overwriting.\u003C/p\u003E\u003Cp\u003EThis particular system requires Planet Factory. \u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EMake a new save!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55145-0-23-WIP-Alpha-Real-Solar-System-v5-5-KSP23-fix-12-23-13\u0022 rel=\u0022external nofollow\u0022\u003ERealSolarSystem\u003C/a\u003E by NathanKell\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/krags-planet-factory/\u0022 rel=\u0022external nofollow\u0022\u003EPlanetFactory\u003C/a\u003E by Kragrathea\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/dx9pvrxcg4nfiqy/RealSolarSystem1_real.zip\u0022 rel=\u0022external nofollow\u0022\u003ERealSolarSystem.cfg - real scale system\u003C/a\u003E - an example of converted system you can try right now\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/hx5s1g7l5qds78w/RealSolarSystem1_small.zip\u0022 rel=\u0022external nofollow\u0022\u003ERealSolarSystem.cfg - same system in 1/10 scale\u003C/a\u003E (WARNING: small scale is broken in many ways and physically incorrect even for KSP, not recommended)\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EIn case it is not clear enough, first 5 images are side to side comparisons between SE and KSP, those are SE screenshots overlayed on top of KSP screenshots.\u003C/em\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Tcsl3\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Daemoria","CreatedById":103696,"CreatedDateTime":"2014-03-12T00:47:46Z","Content":"\n\u003Cp\u003EI\u0027ve not played around with space engine in a while, but don\u0027t binary star systems have a Barycenter? Can\u0027t you load that for the \u0027sun\u0027 as an empty node, and load the two suns as orbiting that point?\u003C/p\u003E\u003Cp\u003EAltho now that I remembering back to how SE handles binary stars, some of the systems have essentially 2 separate orbital paths/separate solar systems orbiting their relative stars... That might be a bit tougher to calculate the SOIs if the planets get too close to each other.\u003C/p\u003E\u003Cp\u003EMy rambling observations aside, this looks awesome. I\u0027ll try it out as soon as I get some free time.\u003C/p\u003E\n"},{"CreatedByName":"Space_Kraken","CreatedById":102655,"CreatedDateTime":"2014-03-12T01:42:09Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027comic sans ms\u0027;\u0022\u003ESpace Engine uses an N-body physics system, while Kerbal uses straight Newtonian physics. Hopefully everything will work out there.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"darkside","CreatedById":69433,"CreatedDateTime":"2014-03-12T11:11:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daemoria\u0022 data-cite=\u0022Daemoria\u0022\u003E\u003Cdiv\u003EI\u0027ve not played around with space engine in a while, but don\u0027t binary star systems have a Barycenter? Can\u0027t you load that for the \u0027sun\u0027 as an empty node, and load the two suns as orbiting that point?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo far I didn\u0027t find a way to make center empty, sun demands to be there and if something is not to it\u0027s liking then bad things happen. But keeping it in place just making it \u0027empty\u0027 I didn\u0027t think of, possibly it is a good idea. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daemoria\u0022 data-cite=\u0022Daemoria\u0022\u003E\u003Cdiv\u003EAltho now that I remembering back to how SE handles binary stars, some of the systems have essentially 2 separate orbital paths/separate solar systems orbiting their relative stars... That might be a bit tougher to calculate the SOIs if the planets get too close to each other.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately for me it is not \u0027some of the systems\u0027 but actually most of them. Currently I am treating binary stars as secondary star orbiting the sun. In SE binary stars are usually in orbital resonance so even if their orbits are close to each other at some point, the two stars never come close to one another. With the way I have it in KSP there are surely a potential for planets crashing into one another but I tried dozens of systems and it still didn\u0027t happen. Anyway, safe distance is very easy to calculate, all required data is there. Also I am switching to Planet Factory CE now and it has makeshift barycenters so it is going to be easier.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Space_Kraken\u0022 data-cite=\u0022Space_Kraken\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:\u0027comic sans ms\u0027;\u0022\u003ESpace Engine uses an N-body physics system, while Kerbal uses straight Newtonian physics. Hopefully everything will work out there.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, with some workarounds it works, not always exactly like it should but close enough.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-03-12T12:06:12Z","Content":"\n\u003Cp\u003EI was hoping this was a terrain improving mod, although this could be nice too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"_Augustus_","CreatedById":115084,"CreatedDateTime":"2015-01-04T02:00:36Z","Content":"\n\u003Cp\u003ECould you make a download for this? Sorry for necro.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-01-04T02:41:15Z","Content":"\n\u003Cp\u003EI was actually thinking of holding a contest on the SpaceEngine forums for people to find the best 16-body system and I would make a RSS config of that system for them. A script to do that instead would be better for everyone.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022_Augustus_\u0022 data-cite=\u0022_Augustus_\u0022\u003E\u003Cdiv\u003ECould you make a download for this? Sorry for necro.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHe means a download for the program, not just the config.\u003C/p\u003E\n"},{"CreatedByName":"Spanier","CreatedById":57247,"CreatedDateTime":"2015-01-05T14:02:13Z","Content":"\n\u003Cp\u003EWould it be possible to even merge Space Engine and KSP, so you can fly through a procedural universe with high level of detail.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-01-05T14:20:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spanier\u0022 data-cite=\u0022Spanier\u0022\u003E\u003Cdiv\u003EWould it be possible to even merge Space Engine and KSP, so you can fly through a procedural universe with high level of detail.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. Although, if KSP 2 is announced after Space Engine is complete, then KSP 2 might use Space Engine instead of Unity as it\u0027s game engine. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nubeees","CreatedById":28735,"CreatedDateTime":"2015-01-20T02:52:25Z","Content":"\n\u003Cp\u003EAre you never going to release this script? It seems great!\u003C/p\u003E\n"}]}