{"TopicId":75938,"ForumId":36,"TopicTitle":"[1.0.x] [V1.9f] Kerbal Foundries wheels, anti-grav repulsors and tracks","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-25T17:24:04Z","PageNum":77,"Articles":[{"CreatedByName":"Haifi","CreatedById":108817,"CreatedDateTime":"2015-01-16T01:41:31Z","Content":"\n\u003Cp\u003EJust wondering, there should be other mods with the same problems... If i knew what to look for maybe there are similarities, even if its just using for example blender in a certain version that causes unity to behave like this... Just a thought.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"mike9606","CreatedById":90275,"CreatedDateTime":"2015-01-16T01:45:37Z","Content":"\n\u003Cp\u003EDangit lofi, the 0.90 in the title had me tricked for a second into thinking 1.8 was out.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-16T01:56:42Z","Content":"\n\u003Cp\u003EThe issue is something to do with the way KSP handles SkinnedMeshRenderer, which is used to make the tracks flex as the suspension moves. It\u0027s a little like bones in character animation. There are very few other parts that need such a function, but the thread for Part Icon Resizer may point you in the right direction if some exist. I\u0027m afraid this is no mere Blender export snafu (and I use 3D Studio anyway) - it\u0027s some kind of technical problem with Unity/KSP.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mike9606\u0022 data-cite=\u0022mike9606\u0022\u003E\u003Cdiv\u003EDangit lofi, the 0.90 in the title had me tricked for a second into thinking 1.8 was out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHehe, sorry dude! We\u0027re literally at the tidying phase now, just tying up loose ends.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-01-16T02:11:50Z","Content":"\n\u003Cp\u003ETexture sharing should be rather easy once any remaining texture names with spaces are eliminated. KSP really doesn\u0027t handle spaces very well when referencing models and textures using \u0022MODEL{}\u0022 nodes. The actual texture \u003Cem\u003Enames\u003C/em\u003E don\u0027t necessarily have to be different though, just the content.\u003C/p\u003E\u003Cp\u003EThe way I generally set it up, when modifying other people\u0027s work to same my ram, is to move all the textures that share the same \u003Cem\u003Econtent\u003C/em\u003E into a new folder that I commonly call \u0022CommonTex\u0022 within the root directory on the mod (or in the mod\u0027s \u0022parts\u0022 folder if it uses one). I then go into all the parts which are going to have the shared textures and replace those shared-content textures with a 2x2 blank texture. Why not 1x1? Good question, but considering all the fuss with \u0022divisible-by-2\u0022 rules, it seems a good precaution. Then I just have to set up the \u0022MODEL{}\u0022 node to reference the model from the root \u0022GameData\u0022 folder and do the same for the textures which need to be replaced. Interesting thing to note here is that textures which are still going to be loaded from the same folder as the model itself do not need to be defined in the node, only the ones that are going to be replaced. Also, the texture to be replaced can have a different name than the one you are replacing it with. I\u0027m prepared to do some work on the configurations once you\u0027ve got all the files named and assembled.\u003C/p\u003E\u003Cp\u003EAlternatively, you can rename all of your \u0022part.cfg\u0022 files into files named for the part they are configuring. You then eliminate all the folders and just throw everything into a single folder. this works best if your textures not only share content, but also the same file names. You still use \u0022MODEL{}\u0022 nodes to be sure that everything is referenced properly, but the textures can remain un-replaced in the configs because the models are all referencing the same files as local files. You also eliminate the need for dummy textures in the individual part folders. This would have been a good idea to set up from the start, but the way you have it set up now suggests that this method would be more trouble than it is worth. For a good example of this particular setup is the KSO mod. Everything is piled into a single folder for the parts. Another really good example is how USI sets up many of their assets in separate folders where all the textures and models are, and the configs in another directory entirely.\u003C/p\u003E\u003Cp\u003EAnother texture I\u0027m wondering about is the one on the medium wheel which looks like a repulsor texture. I know that the model originally came from the repulsor wheel, and I see that the model references this texture, but I also know the wheel doesn\u0027t actually use it.\u003C/p\u003E\u003Cp\u003EWell... that post was longer than I intended.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-16T02:34:00Z","Content":"\n\u003Cp\u003EAhh, gotcha.\u003C/p\u003E\u003Cp\u003EI think the first option is probably best, it would take a lot of editing and quite a change of workflow to lump everything into one folder, but I do like the idea of a common textures folder. By no means critical to do before next release, though..\u003C/p\u003E\u003Cp\u003EThe medium wheel will deprecated shortly, and the repulsor wheel will be toggleable between repulsor wheel/plain wheel once I\u0027ve got it all smoothed out. note the ObjectDestroy module in the config which is a placeholder for that function and simply\u003C/p\u003E\u003Cp\u003E removes the repulsor mesh for the moment.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-01-16T04:54:53Z","Content":"\n\u003Cp\u003EYeah, I figured that method could be eventually made into a toggle so that you could use the same part for a single-function or a multifunction mode. Honestly, I\u0027d like to see an option for the medium wheel to remain animate-able (the turning over on it\u0027s side) like the repulsor wheel does, but without the repulsor, so that they can be made into a landing leg of some sort. Another idea would be to have a second object, like the repulsor object but without the repulsor surface, that would instead resemble a platform that a craft could sit on when not wanting to be mobile. Even better would be if the object the repulsor was attached to could be switched between repulsor and landing leg mode in-flight (switch it to the other mode and the little circular panel just flips over) and you\u0027d have the ultimate one-part solution... until we think of something else to make it \u003Cem\u003Emore \u003C/em\u003Eultimate.\u003C/p\u003E\u003Cp\u003EAnyway, all this stuff will not be eneded for this release, like you said. This is \u003Cem\u003Enot\u003C/em\u003E the time to be coming out with insane new ideas for features we want to see. Lets get this stuff out to the public and let them do the hard work of testing them first.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-16T11:44:40Z","Content":"\n\u003Cp\u003EStop giving me ideas, man \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-01-16T18:48:15Z","Content":"\n\u003Cp\u003EI can\u0027t! It\u0027s a sickness. It\u0027s all \u003Cem\u003Eyour\u003C/em\u003E fault... you started it! You just \u003Cem\u003Ehad\u003C/em\u003E to go and reinvent the wheel didn\u0027t you? And they just \u003Cem\u003Ehad\u003C/em\u003E to be superior to every other wheel out there, didn\u0027t they? Gah!\u003C/p\u003E\u003Cp\u003EBy the way, already added TS support to those new tracks and the dev part MainGear with its own scaletype, even though I have no clue what it even looks like.\u003C/p\u003E\u003Cp\u003EEDIT: Oh, just had another one... what about a track-like structure comprised of wheels all attached to each other... sort of like a prefab four-wheel rack, complete with steering optimization built in. It\u0027d be basically a track, without the track, and rubber on the wheel bits, along with a combo of track-steering and multi-wheel steering. When stationary, it\u0027d use track-style steering. When moving, it\u0027d use the other form of steering.\u003C/p\u003E\u003Cp\u003EGAH, there I go again! See what you\u0027ve done? I\u0027m ruined!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-16T18:53:23Z\u0022 title=\u002201/16/2015 06:53  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 16, 2015\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-16T19:51:24Z","Content":"\n\u003Cp\u003EMuwahaha!\u003C/p\u003E\u003Cp\u003EUmmm, yeah.\u003C/p\u003E\u003Cp\u003ECareful with TS on the new tracks, it didn\u0027t seem to like the way I destroy bits of the part when I first set them up! I\u0027ve no idea what was going on, I just removed it from the config as a \u0027fix later\u0027 thing. Main gear is just as experimental, I couldn\u0027t stand to have another set of symmetrical gear parts. Yes, I am insane.\u003C/p\u003E\u003Cp\u003ECan\u0027t do multiple tracks on one part, would take a huge plugin recode I\u0027m afraid..\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2015-01-16T21:18:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaalidas\u0022 data-cite=\u0022Gaalidas\u0022\u003E\u003Cdiv\u003EI can\u0027t! It\u0027s a sickness. It\u0027s all \u003Cem\u003Eyour\u003C/em\u003E fault... you started it! You just \u003Cem\u003Ehad\u003C/em\u003E to go and reinvent the wheel didn\u0027t you? And they just \u003Cem\u003Ehad\u003C/em\u003E to be superior to every other wheel out there, didn\u0027t they? Gah!\u003Cp\u003EBy the way, already added TS support to those new tracks and the dev part MainGear with its own scaletype, even though I have no clue what it even looks like.\u003C/p\u003E\u003Cp\u003EEDIT: Oh, just had another one... what about a track-like structure comprised of wheels all attached to each other... sort of like a prefab four-wheel rack, complete with steering optimization built in. It\u0027d be basically a track, without the track, and rubber on the wheel bits, along with a combo of track-steering and multi-wheel steering. When stationary, it\u0027d use track-style steering. When moving, it\u0027d use the other form of steering.\u003C/p\u003E\u003Cp\u003EGAH, there I go again! See what you\u0027ve done? I\u0027m ruined!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehmmm... i would like to suggest something a bit more... boring \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E(well in my opinion it would be): landing gear tracks... it should be able to be done via IR when the new smaller \u0022micro\u0022 (as i\u0027ve named them) tracks come out.\u003C/p\u003E\u003Cp\u003Eanother idea would be unfolding tracks. so you have them stored in a cylinder or compartment and they pop out and unfold into tracks... (Warning: this may be imposible to innovate since i\u0027m no programmer and have no idea what sort of limits your code has)\u003C/p\u003E\u003Cp\u003ESidenote: i was thinking about the landing gear idea and was wonding if your tracks are able to be stowed away and deployed like the stock landing gear... then again it might be imposible.\u003C/p\u003E\u003Cp\u003Ei\u0027m just throwing ideas at you here and seeing what sticks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-17T01:02:11Z","Content":"\n\u003Cp\u003EGreat ideas, but some \u003Cem\u003Eserious\u003C/em\u003E technical challenges with unfolding tracks! Retractable, maybe, but the problem is always making something that can stow away without clipping into the part they\u0027re mounted to. The plugin currently supports a retract animation, but I\u0027ve yet to make something that actually makes use of it, aside from the insanely complicated landing gear that\u0027s in the works.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-01-17T02:08:56Z","Content":"\n\u003Cp\u003EDidn\u0027t those really huge wheels have the retract action available to them? I remember I could reduce the suspension to zero and then retract them and basically have an immobile rover. That was a long time ago, though.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2015-01-17T05:37:36Z","Content":"\n\u003Cp\u003EWouldn\u0027t mind a set of Retract-A-Tracks, or perhaps a set of folding wheels. Wheels that retract into a box that conveniently sticks onto the side of a RoveMate box would be nice.\u003C/p\u003E\u003Cp\u003EAlso wouldn\u0027t mind, if it\u0027s not too tricky, a set of wheels with attached fenders and lights. Would make some of my rovers a little better (I keep forgetting to add lights!). Perhaps based around that awesome Small Wheel.\u003C/p\u003E\u003Cp\u003EAnd, yet another bit of fun from my overly tired mind: An old (think vintage) car styled cockpit. Two seats, connects to a chassis pan that allows the easy mounting of some wheels, an electrical generator, and some fuel. And of course, a rumble-seat inspired EVA seat and a trunk full of batteries. It\u0027s just an idea, but I know ideas can sometimes create other ideas.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-01-17T06:02:32Z","Content":"\n\u003Cp\u003EWe do definitely need some vintage stylish car parts for our kerbals to ride around in. Even better if those little wheels can turn on their sides and become miniature repulsors. It\u0027d be like that flying car in that TV show \u0022Agents of Shield\u0022 that we only really see doing anything in one or two episodes.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-17T06:37:36Z","Content":"\n\u003Cp\u003EOh yes, there\u0027s a retract function, but needs a config line to enable! Ought to retest after changing all the suspension code...\u003C/p\u003E\u003Cp\u003EI do sort of have some ideas for a folding wheel, just not got round to modelling. Last time I tried I slipped and made the small wheel instead (which nli2work has just made an awesome texture for). Sort of shied away from doing fenders until I\u0027ve updated the plugin to make them toggleable like TT, but would be great with integrated lights \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E speaking of which, lights are something I need to learn how to do!\u003C/p\u003E\u003Cp\u003EOpen cockpit rover body could be cool. I suppose there\u0027s two good ways to go about it: either as an external command seat to be used with Through the eyes of a Kerbal, or a normal pod, just open and use JSI transparent pod. Either way, could be quite cool.\u003C/p\u003E\u003Cp\u003ESmall repulsor wheels? That shouldn\u0027t be too hard, actually.\u003C/p\u003E\u003Cp\u003EThis stuff is definitely next-next version material, though! The other thing I\u0027d like to do is set up some subtle particle emitters to kick up a little dust from where the wheels contact the ground, as well as vary the sound depending on torque or brake application, and slip, but these things are really all just icing on the cake sort of stuff.\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2015-01-17T11:32:23Z","Content":"\n\u003Cp\u003Eoh whoops what i meant by \u0022unfolding tracks\u0022 is just an animation of the tracks coming out of something while the actual wheelmesh lowers to the ground so that it provides traction... i have no idea what i just said o.o\u003C/p\u003E\u003Cp\u003Ei\u0027ve noticed with the stock landing wheels that the mesh for the wheel is still there even when the landing gear is pulled up... maybe you could do the same?\u003C/p\u003E\u003Cp\u003Eor another idea would be to put the \u0022wheely bit\u0022 on the bottom of the track and then have the track rotate upwards into a compartment to make the mesh face upward into the comparment rather than downwards at the ground...\u003C/p\u003E\u003Cp\u003Esorry i\u0027ll be back with pictures of what i mean by using IR and this mod.\u003C/p\u003E\u003Cp\u003Ealso how to i suscribe to a thread...\u003C/p\u003E\u003Cp\u003EEDIT: here\u0027s what i mean... i had to hack gravity for this because the servos aren\u0027t strong enough to hold up the tracks without \u0022bending\u0022\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/7VPTf\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003Esee i\u0027d like tracks that flip over then go into the body of the craft....\u003C/p\u003E\u003Cp\u003Eif you have something better in mind then that\u0027s ok o.o\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-17T12:12:40Z\u0022 title=\u002201/17/2015 12:12  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 17, 2015\u003C/time\u003E by AntiMatter001\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-17T12:11:08Z","Content":"\n\u003Cp\u003EHehe, still not really sure what you mean. Drawings are always good!\u003C/p\u003E\u003Cp\u003ELook in thread tools up the top, or the little yellow star icon on the mobile version.\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2015-01-17T12:53:41Z","Content":"\n\u003Cp\u003Ei got pictures up of what i mean but it\u0027s probably mostlikely a bad idea due to various problems i\u0027ve been having so far with my constructions.\u003C/p\u003E\u003Cp\u003Ethey are there as ideas only i\u0027m not saying you should do them. if they turn out to be hard to do then forget them.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-17T15:50:51Z","Content":"\n\u003Cp\u003EOh, I see. No need for IR, standard animation is ok for that. Gives me a few ideas, yes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AntiMatter001","CreatedById":100129,"CreatedDateTime":"2015-01-17T15:57:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EOh, I see. No need for IR, standard animation is ok for that. Gives me a few ideas, yes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyes i knew you would \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E also i was just testing that pod that is in devolopment that you made and unfortunatly the IVA is just untextured in 0.90 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E but i\u0027m happy to report that the tracks are awesome for fast moving ground to air (with help from hills) vehicles. i just made a half track that reached mach 1 XD\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2015-01-17T16:14:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EOh yes, there\u0027s a retract function, but needs a config line to enable! Ought to retest after changing all the suspension code...\u003Cp\u003EI do sort of have some ideas for a folding wheel, just not got round to modelling. Last time I tried I slipped and made the small wheel instead (which nli2work has just made an awesome texture for). Sort of shied away from doing fenders until I\u0027ve updated the plugin to make them toggleable like TT, but would be great with integrated lights \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E speaking of which, lights are something I need to learn how to do!\u003C/p\u003E\u003Cp\u003EOpen cockpit rover body could be cool. I suppose there\u0027s two good ways to go about it: either as an external command seat to be used with Through the eyes of a Kerbal, or a normal pod, just open and use JSI transparent pod. Either way, could be quite cool.\u003C/p\u003E\u003Cp\u003ESmall repulsor wheels? That shouldn\u0027t be too hard, actually.\u003C/p\u003E\u003Cp\u003EThis stuff is definitely next-next version material, though! The other thing I\u0027d like to do is set up some subtle particle emitters to kick up a little dust from where the wheels contact the ground, as well as vary the sound depending on torque or brake application, and slip, but these things are really all just icing on the cake sort of stuff.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDefinitely, I place my vote in with normal pod with JSI. I\u0027ve never managed to get Through the Eyes of a Kerbal to work.\u003C/p\u003E\n"},{"CreatedByName":"mike9606","CreatedById":90275,"CreatedDateTime":"2015-01-17T18:34:04Z","Content":"\n\u003Cp\u003ETo be honest, I just want the long tracks so I can build tracked things easier.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-17T18:59:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AntiMatter001\u0022 data-cite=\u0022AntiMatter001\u0022\u003E\u003Cdiv\u003Eyes i knew you would \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E also i was just testing that pod that is in devolopment that you made and unfortunatly the IVA is just untextured in 0.90 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E but i\u0027m happy to report that the tracks are awesome for fast moving ground to air (with help from hills) vehicles. i just made a half track that reached mach 1 XD\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOutstanding! Which pod do you mean?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Madrias\u0022 data-cite=\u0022Madrias\u0022\u003E\u003Cdiv\u003EDefinitely, I place my vote in with normal pod with JSI. I\u0027ve never managed to get Through the Eyes of a Kerbal to work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHas the other advantage you can launch with the pod manned. I like that idea, goes on the list too.\u003C/p\u003E\n"},{"CreatedByName":"BoomShroom","CreatedById":124216,"CreatedDateTime":"2015-01-17T19:01:03Z","Content":"\n\u003Cp\u003EI remember in the SP\u002B thread porkjet mentioned something about some of the elevons being turned wonky so KSP\u0027s symmetry would spit out both sides correctly. Would it be possible to make wheel somewhat like a motorcycle\u0027s back wheel and still have its symmetry work right?\u003C/p\u003E\u003Cp\u003EThis is almost entirely because I want to make a rover with suspension like the Warthog in the Halo series.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/raO4HcZ.jpg\u0022 alt=\u0022raO4HcZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EImage solely for reference.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-01-17T19:37:14Z","Content":"\n\u003Cp\u003Eif only it were that simple with complicated parts like wheels..\u003C/p\u003E\u003Cp\u003EI\u0027ve built a plugin that makes it possible, but it\u0027s a huge amount of work setting up asymmetric parts. For simple stuff, you can pull the invert one scale axis trick, but anything that needs a lookat, hierarchy or wheel collider is an absolute, 100% fail using that method.\u003C/p\u003E\n"}]}