{"TopicId":75938,"ForumId":36,"TopicTitle":"[1.0.x] [V1.9f] Kerbal Foundries wheels, anti-grav repulsors and tracks","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-25T17:24:04Z","PageNum":46,"Articles":[{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-20T06:40:31Z","Content":"\n\u003Cp\u003EThe hovercraft maneuvering system sounds a lot like the Firespitter swamp-boat fan. Okay, so it\u0027s an extremely low-tech example, but it\u0027s the best image my brain could conjure.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-20T09:38:04Z","Content":"\n\u003Cp\u003EI have to admit, now that I\u0027ve had a good long run with the Medium Wheels, I like them. Made it half way to the North Pole with wheels that were comfortable with everything but the occasional terrain seam (which I put the blame squarely on SQUAD\u0027s shoulders. Seriously, how am I supposed to drive a rover around a planet if the planet insists on ripping my wheels off with invisible seams).\u003C/p\u003E\u003Cp\u003EI put \u0027em through some significant abuse. Hills, jumps, 40\u002B m/s downhill dashes, zig-zagging up and down hills, not a hint of trouble. Heck, not even the traditional \u0022KSP Suspension jitter\u0022 came up. Smooth as silk at 20 m/s, even over some of the roughest terrain I\u0027ve driven in a while. These wheels are a lot of fun.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-20T09:50:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Madrias\u0022 data-cite=\u0022Madrias\u0022\u003E\u003Cdiv\u003EI have to admit, now that I\u0027ve had a good long run with the Medium Wheels, I like them. Made it half way to the North Pole with wheels that were comfortable with everything but the occasional terrain seam (which I put the blame squarely on SQUAD\u0027s shoulders. Seriously, how am I supposed to drive a rover around a planet if the planet insists on ripping my wheels off with invisible seams).\u003Cp\u003EI put \u0027em through some significant abuse. Hills, jumps, 40\u002B m/s downhill dashes, zig-zagging up and down hills, not a hint of trouble. Heck, not even the traditional \u0022KSP Suspension jitter\u0022 came up. Smooth as silk at 20 m/s, even over some of the roughest terrain I\u0027ve driven in a while. These wheels are a lot of fun.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is exactly what I\u0027m aiming for \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe collider seams are annoying, and I\u0027m not even sure I can do anything to fix it. I\u0027ve devised a little test to confirm, but it looks like the ground is made up of sections of mesh collider - I guess because having one huge collider for the entire planet would be impossible. They either don\u0027t overlap enough, or there are differences in height going between the two, but either way it\u0027s frustrating.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-20T15:08:09Z","Content":"\n\u003Cp\u003ESo, today I started messing around with the medium tracks (yours, not the RBI stuff) and I noticed something a little odd. I don\u0027t have the capability to put up an image at this moment, but here\u0027s my best description. The wheel-thingers are alright, the bottom half of the treads works okay, but the top half is clipped downwards so that it clips with the bottom half of the treads and/or the rest of the track body. Otherwise it functions just fine.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT: \u003C/strong\u003EI just tried out the RBI invertible tracks and they\u0027re all whacko as well. Instead of the top portion clipping into the bottom portion, the upper row of wheels and the track rubber-banding over them are super high compared to the rest of the tread. It\u0027s all connected as far as I can tell, but man is it really funky looking. You sure did a crazy one on these babies in your last code updates.\u003C/p\u003E\u003Cp\u003ESomething else I\u0027ve noticed about all the wheels is that anything below 50% ride height is pretty much ineffective. As it appears, 50% is the lowest that any of them can achieve. I wonder if 50% could be reset to read 0% and give the wheels another 50% ride height above the default height? This would provide more flexibility and give the under-50% range something to do. The one exception seems to be in the mole tracks. While subtle, the lower-than-50% does have a noticeable effect.\u003C/p\u003E\u003Cp\u003ELast observation for the moment. The action groups to change torque (specifically the tracks, haven\u0027t tried the wheels yet) work pretty well except that, like the repulsor ride-height stuff before we fixed it, you have to right click and tell it to apply the setting to all (even when the action group is activating a track that is symmetrically attached, which should make that group affect all symmetrical parts.) I haven\u0027t been code diving is a while, so I can\u0027t direct you at the exact bit of code. Maybe later if I feel industrious.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-20T16:16:40Z\u0022 title=\u002210/20/2014 04:16  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 20, 2014\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-20T21:16:37Z","Content":"\n\u003Cp\u003EHaha! Ooops, I know exactly what I did... Won\u0027t take a moment to fix. I was working on fixing the annoying tendency of wheels to stay at their compressed position at launch before the physics kicks in. I didn\u0027t bother to test the tracks after \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003EGiving extra ride height above the max I\u0027ve set for each wheel will sadly cause huge issues with the suspension visuals. As it is it\u0027s a fudge between the purely linear motion of the wheel collider raycast and the arc nature of my setups. As the angles get greater the disparity becomes all too apparent and the wheel meshes with simply float. Nice idea, but not something I can achieve within the limits of Unity/PhysX. I gave full travel to aid the base builders, rather than for dynamic effect, though I do need to review on some of the newer wheels because I was testing with the large ones...\u003C/p\u003E\u003Cp\u003EWheels and tracks are driven with the same module, don\u0027t forget. This is how I keep getting into a pickle and breaking something on tracks when it works fine on wheels or vice versa \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I\u0027ll have a look at that, it definitely needs fixing the same as the repulsors did.\u003C/p\u003E\u003Cp\u003EEDIT: the ride height is somewhat counter intuitive, but here\u0027s what\u0027s going on. At reasonable spring settings, you should have about half compression with the vehicle at rest. Take away half the suspension movement, and you\u0027ve got 0. Not really sure what to do about that, as there is no easy way I can adjust for the set spring rate. Currently it all hinges off vehicle weight verses the set spring on the wheels, and as I can\u0027t adjust the springing in flight, I\u0027m a little stuck :/\u003C/p\u003E\u003Cp\u003EEDIT2: I can\u0027t reproduce the problem with the torque action groups. The AG directly modifies a value used in calculation of the applied torque every physics frame, so there\u0027s nothing to apply in the same way.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-20T22:38:34Z\u0022 title=\u002210/20/2014 10:38  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 20, 2014\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-20T22:02:06Z","Content":"\n\u003Cp\u003EWoah there, I think I saw something about a raycast and some gibberish about physics and other good suggestions when moving things, and that\u0027s where my ability to understand things fudged up. Nice to know you understand it though. Oh well. Still, might be a great idea to revisit the range for the tweakable. The mole tracks responded all the way to 0%, but the rest of the wheels/tracks seem to respond only down to 50%.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-20T22:12:56Z","Content":"\n\u003Cp\u003EI\u0027m just about to take a look at that... possible I messed something else up!\u003C/p\u003E\u003Cp\u003EFix for weird suspension issues has just been published, btw. Repulsor water stuff should be back up and running too.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-21T00:15:48Z","Content":"\n\u003Cp\u003EWow, you\u0027re good. I\u0027m finishing an update as I type. Well, not literally as I type because I sorta need my keyboard to do it... but in a moment I will.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-21T00:27:54Z","Content":"\n\u003Cp\u003EI AM INVINCIBLE! \u0026lt;Cue tons of liquid nitrogen falling on my head\u0026gt; \u003C/p\u003E\u003Cp\u003E Texturing aside, I think we\u0027re getting to another release point... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E Decided to ditch the medium wheel in favour of the repulsor wheel model. It\u0027s much nicer, already textured and there seemed little point in having two almost identical parts. Still haven\u0027t anywhere near nailed the repulsor conversion, but they can go in in pure wheel form and can be config updated to full conversion goodness later. I really need to get some MODEL{} nodes and texture sharing going, though.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-21T01:10:47Z","Content":"\n\u003Cp\u003EOh, so just after I praise the heck out of the medium wheel, you decide it needs to be wiped out... I see how it is. (Just so you know, I\u0027m joking. I don\u0027t mind. Just had to play along, after all.)\u003C/p\u003E\u003Cp\u003EAlso got around to trying the Large Wheels and had a lot of fun driving around KSC. They make good monster trucks if combined with Lack Luster Labs...\u003C/p\u003E\u003Cp\u003EThe small wheels, I think I need to update my pack because I\u0027m still running an older version, I think. Yes, I\u0027m from the Department of Redundancy Department, deal with it. Still, from what variation I have, they\u0027re fun.\u003C/p\u003E\u003Cp\u003EI\u0027ll go grab the latest and greatest Dev Build and see if I can break something.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-21T01:23:53Z","Content":"\n\u003Cp\u003EWell, of course... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve updated the large wheels with new collider settings, though may have the grip a tad too high. Jeb does like his monster truck, it\u0027s great for snack runs!\u003C/p\u003E\u003Cp\u003EInterested to see what you make of the small (and tiny) wheels now. Hopefully I haven\u0027t broken them; I didn\u0027t test after fixing a few other things.. Thank you both, as ever. This would be almost impossible on my own.\u003C/p\u003E\u003Cp\u003ETexturing aside, I\u0027m aiming to have the following release ready for 1.8:\u003C/p\u003E\u003Cp\u003ELarge, medium, small wheels \u002B one variant of the tiny wheels.\u003C/p\u003E\u003Cp\u003EMedium, small, RBI Oval, RBI Mole tracks \u002B long tracks I have yet to export to game.\u003C/p\u003E\u003Cp\u003EAPU, skids, hypnodrive.\u003C/p\u003E\u003Cp\u003ERepulsor \u0026amp; surface version.\u003C/p\u003E\u003Cp\u003EOpinions please (plus what is currently broken?) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Skids need to be revisited (too big), but won\u0027t take a lot of work.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-21T09:17:44Z","Content":"\n\u003Cp\u003ESmall wheels are as good as ever, and I\u0027m glad to see an ability to adjust ride height on the fly now. No more bottoming out on hills because I set my suspension too low. No more tipping over because I was set too high.\u003C/p\u003E\u003Cp\u003EHaven\u0027t tried the tiny wheels yet. Was having too much fun breaking the KSC with Jeb\u0027s monster truck.\u003C/p\u003E\u003Cp\u003EAs for a reference to the small wheels, as far as the version I was using before... No texture and the curvy springs. Much more impressed with the new design.\u003C/p\u003E\u003Cp\u003EThough, I must admit, it looks like the textures are moving even when the tire is parked and the brakes are on.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-21T09:29:18Z","Content":"\n\u003Cp\u003EOhhhh! Haha. I used the small wheels to demo my news texture animator plugin. Ooops. Yes, the texture is being moved by random number generating code.\u003C/p\u003E\u003Cp\u003EI think they fit with the range much better as they now; glad you agree. Texture is entirely temporary just to stop the white obscuring how they look in game, hope to have that sorted soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027m just fixing a bug with the ride height where it won\u0027t save properly. Other than that I\u0027m kinda happy with the plugin right now.\u003C/p\u003E\u003Cp\u003EHow big a bill did Jeb rack up? We ought to have a challenge to see who can destroy every destructible thing in the KSC the quickest with a rover under a certain tonnage \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-21T13:50:39Z","Content":"\n\u003Cp\u003EHi, does the texture mover have some adjustable parameters? could it be used to simulate an animated belt or chain texture? Is it purely random or is it adjustable as to direction timing etc?\u003C/p\u003E\u003Cp\u003EReally like the look of the new smaller wheels although I dont as you know build small, still awaiting docs so experiments can continue.\u003C/p\u003E\u003Cp\u003Ethoughts/requests ; I\u0027d like a medium track unit that mounted via a pivoted arm to the chassis, with something like a 30/40 degree swing of the track, this would enable a better climbing ability as I\u0027ve found that although they behave as expected on reasonably rough ground and the translation between a level and sloping terrain, they have trouble climbing steps etc and frequently become detached in the process.\u003C/p\u003E\u003Cp\u003EThe tracks have surprised me in how useful they are, and have rapidly become one of my fave things to use , although I still feel that they are a bit wooden, perhaps more panzer(torsionBar) than T28 (christie) for my taste.\u003C/p\u003E\u003Cp\u003EAs an aside I\u0027m working on a smaller surface mount landing gear type skid that retracts into a housing a little larger than the stock gear, although the skid still acts as the lid, so it\u0027s not perfect but it\u0027s getting there.\u003C/p\u003E\u003Cp\u003EPS still got originals of all the parts if you need to revert, don\u0027t remember making the skid that big!!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-21T15:30:07Z","Content":"\n\u003Cp\u003EWow, this thread really took off all of the sudden. I didn\u0027t get to see the texture animation mishap, but I can sure see some awesome uses for such a plugin if the controls are pretty flexible. I look forward to seeing the next iteration of the track. As for the wheel replacement, I see no problem as long as it functions in the same awesome way. In fact, I can see a use for those even without the repulsor side added to them. If they could sit on the ends on the wheels when turned for repulsor mode, you\u0027d basically have a wheel that transforms into a landing leg. If we end up with the ability to completely disable the repulsors, then this functionality can continue to work even after the repulsor is added. Just need to make sure the wheels quit responding to input once they are changed.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-21T16:18:04Z","Content":"\n\u003Cp\u003EI\u0027ll be releasing the texture mover shortly separately. Yup, it\u0027s all configurable, will be suitable for all of that.\u003C/p\u003E\u003Cp\u003EGood good, I\u0027m quite pleased with the smaller wheels myself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I think its all settled enough to document, so I\u0027ll comment a config file for a wheel and a track unit for you; should get you going.\u003C/p\u003E\u003Cp\u003EHmm, that sounds like an interesting idea. Probably one for IR like your wheels... Step climbing is a pain with one dimensional collider \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat suspension settings you running on the tracks? Almost sounds like they\u0027re a bit under sprung. Travel is a little limited due to the way the skinned mesh works, or they look a little weird sadly.\u003C/p\u003E\u003Cp\u003EI think I run different system unit setup to you, so I messed up the size of the skids! Retractable version sounds excellent; KF plugin now supports retract animation..\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-21T20:35:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EKF plugin now supports retract animation..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, now we just need some wheels that actually \u003Cem\u003Edo\u003C/em\u003E that. Or Skids... or Landing Legs... or whatever.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EI\u0027ll be releasing the texture mover shortly separately. Yup, it\u0027s all configurable, will be suitable for all of that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome... cause I was thinking that would be amazing for creating sci-fi styled engines with lights running down the edges and stuff.. to name but one application.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-21T20:37:45Z\u0022 title=\u002210/21/2014 08:37  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 21, 2014\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-21T20:56:00Z","Content":"\n\u003Cp\u003EHonestly, I\u0027m really surprised nobody has created an animated texture plugin before. It really was ridiculously simple. For something that took me half a (very hungover) hour, there are at least five mod makers asking when I\u0027m going to release it... I would have already had I not broken so many bits in KF!\u003C/p\u003E\u003Cp\u003EYes, wheels with retract... It means landing gear is quite easy with the same module, though I have yet to create any wheels with a retract animation. I do have some ideas, but they\u0027re somewhat complicated and will take a bit of time.\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2014-10-21T22:08:06Z","Content":"\n\u003Cp\u003EIn one of the games I used to mod they had a sliding uv shader which was fantastic for animated signs , lighting effects etc I\u0027ve always wished for one in ksp, you could do all sorts such as tinting windows during atmospheric flight or re entry , color changing landing lights, ooo and some real moody lighting around KSC, looking fwd to experimenting with that\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-21T22:54:40Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/97751-PLUGIN-0-25-Texture-Animation-Util?p=1494654#post1494654\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/97751-PLUGIN-0-25-Texture-Animation-Util?p=1494654#post1494654\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere you go buddy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-21T23:35:50Z","Content":"\n\u003Cp\u003ENoticed today that the alpha repulsors were missing. did a little research and found this:\u003C/p\u003E\u003Cp\u003E[LOG 15:09:27.305] Load(Model): KerbalFoundries/AlphaRepulsor/AlphaRepulsor\u003C/p\u003E\u003Cp\u003E[WRN 15:09:27.320] File \u0027C:\\Program Files (x86)\\Steam\\SteamApps\\common\\Kerbal Space Program\\GameData\\KerbalFoundries\\AlphaRepulsor\\AlphaRepulsor.mu\u0027 is an incorrect type.\u003C/p\u003E\u003Cp\u003E[WRN 15:09:27.322] Model load error in \u0027C:\\Program Files (x86)\\Steam\\SteamApps\\common\\Kerbal Space Program\\GameData\\KerbalFoundries\\AlphaRepulsor\\AlphaRepulsor.mu\u0027\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-21T23:40:40Z","Content":"\n\u003Cp\u003EHmm, that\u0027s odd. Though you seem to have a space in the name of the .mu? I\u0027ve just got them loaded fine in-game, and I haven\u0027t touched those models in ages :/\u003C/p\u003E\n"},{"CreatedByName":"achroma","CreatedById":101412,"CreatedDateTime":"2014-10-21T23:49:33Z","Content":"\n\u003Cp\u003EIf anybody knows off the top of their head (\u0027cause i\u0027m at work), how much weight can a single maxed out repulsor unit handle? I have a very large boat (700 or 7,000 tons, can\u0027t remember) that i\u0027m trying to get seaborne. I\u0027m using over 20 of the small kind, and tried over 10 of the big, but either way it\u0027s a hell of a trick to keep it above the surface. One slip and they all fall in. The idea was to have them inside the body, more than halfway up the side so that i could retract them and lower the bottom into the water for a normal looking boat effect (but they would still be on all the time). I\u0027m doing this because B9 HX parts seem to sink quite readily. If this doesn\u0027t work i\u0027ll move on to USI mod floaties. Oof. Such work.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-22T00:49:09Z","Content":"\n\u003Cp\u003E*cringes at the mention of \u0022maxed out repulsor\u0022 despite knowing it\u0027s the Alpha repulsors, not the Dev repulsors.*\u003C/p\u003E\u003Cp\u003EI don\u0027t know how much weight a single repulsor can handle. I think the biggest thing I\u0027ve moved was my mobile base, but even that was only maybe a little over 100 tons, and I fired 24 repulsors to keep it nice and steady. I\u0027ve moved a 35 ton tank on 8 repulsors, though.\u003C/p\u003E\u003Cp\u003EAs for my cringe... Lo-fi, if you haven\u0027t tried it already, try a dev repulsor set to, say, 30 on any vehicle of any weight, then load it in. It\u0027s amusingly destructive.\u003C/p\u003E\n"},{"CreatedByName":"achroma","CreatedById":101412,"CreatedDateTime":"2014-10-22T03:21:58Z","Content":"\n\u003Cp\u003ENevermind, guise. Figured it out on my lunch break. I\u0027m dumb and should have used TweakScale. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PYnrAds.png\u0022 alt=\u0022PYnrAds.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dPUp3u1.jpg\u0022 alt=\u0022dPUp3u1.jpg\u0022\u003E\u003C/p\u003E\n"}]}