{"TopicId":75938,"ForumId":36,"TopicTitle":"[1.0.x] [V1.9f] Kerbal Foundries wheels, anti-grav repulsors and tracks","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-25T17:24:04Z","PageNum":51,"Articles":[{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-29T18:45:45Z","Content":"\n\u003Cp\u003ESo cool catching your own smoke trail, and I love the interesting use of the small tracks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E How are your finding the DSR2, btw?\u003C/p\u003E\u003Cp\u003EI think I might have this water thing nailed, though I\u0027ve just found a bug with the repulsors which means you can\u0027t reactivate them if they turn off due to low power, even when you have plenty of power again.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-29T19:25:31Z","Content":"\n\u003Cp\u003EI like the DSR2, actually. And, yeah, I caught that repulsor bug, too, shortly after running a while. With the repulsor wheels, it\u0027ll also jam them in the repulsor position. Not sure if they function as wheels or not, though, when jammed (8 wheeled craft, stable on 6. Rear wheels and fronts steer, fronts jammed (action groups 1-4 controlled individual wheel sets) as I was powering down due to a lack of sufficient power).\u003C/p\u003E\u003Cp\u003EThe DSR2 is actually a nice rover pod, containing nearly everything one could need. It\u0027s stable, has a chunky amount of reaction torque for use with repulsorcraft (or unrolling yourself), and actually looks good. Just wishing I had more parts to match it so that I could go cruising around with it and not worry about the fact that anything I put on it looks out of place.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-29T19:46:37Z","Content":"\n\u003Cp\u003EWorking on fixing now, I messed it up when I changed to the smoothed height update method.\u003C/p\u003E\u003Cp\u003EFair comments, it does have an external style all of its own. Spanner is working on sleeker version, and I have some ideas for larger bits that blend things together nicely, along with the texture tweaking in progress.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-29T20:13:10Z","Content":"\n\u003Cp\u003ESomething in that last post reminded me of something I thought to mention. Actually, two things.\u003C/p\u003E\u003Cp\u003EFirst off, I did something really stupid (stupidly awesome, but still \u003Cem\u003Ereally \u003C/em\u003Estupid). I loaded up an ASET rover body (around 12 segments long) with four sets of four medium wheels each (y\u0027know, the ones that look like repulsor wheels but don\u0027t transform, though I wish they could still transform and act like landing-legs). So that\u0027s four wheels, set in standard rover format around a central tube, then copied three more times and put into a square formation. I know, it\u0027s pretty nuts. I was trying to see if the module could make the necessary adjustments for wheels in this nutty arrangement, taking inspiration from that kethane mining rig shown early on in the mod\u0027s development, and taking it a little bit further.\u003C/p\u003E\u003Cp\u003EPerformance from the start was pretty good, though I couldn\u0027t tell if the wheels on the inside track were reacting properly considering they were attached to a part facing the opposite direction than would be expected considering the side of the craft they were attached to. So, I begin rolling with this giant 16 wheeled monstrosity (abomination possibly?) and performance is great... until... one of the wheels from the four quads gets stuck in full suspension extension and refuses to turn. In fact, it causes so much friction that it is tearing the rest of the craft apart. On top of that, the rest of the wheels were spinning in place. Long story short, I pushed it to get it unstuck and ripped one of the quads off the thing. It still worked after that, just sagged a bit in the front.\u003C/p\u003E\u003Cp\u003EEDIT: I just realized that\u0027s only one thing! Now for Number 2!\u003C/p\u003E\u003Cp\u003EOkay... now, what was number 2 again? Think brain, \u003Cem\u003ETHINK!\u003C/em\u003E Gah! I\u0027ve got nothing. okay, just that one little weird thing then. I\u0027ll think of the other one later I\u0027m sure.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-29T20:21:31Z\u0022 title=\u002210/29/2014 08:21  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 29, 2014\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-29T20:15:31Z","Content":"\n\u003Cp\u003EOut of curiosity, seeing as it\u0027d been mentioned NOT to do earlier (regarding multiple pods and their views), what exactly is the issue with running multiples? I\u0027ve coupled a pair of DSR2\u0027s back-to-back and other than not being able to EVA (cause I\u0027ve blocked up the hatches in doing so), things seem to still work okay. Other than, of course, massive loading lag.\u003C/p\u003E\u003Cp\u003EYes, I do sometimes wonder why, exactly, I do these kind of things. Tell me not to do something and what do I go and do? Exactly what someone said not to do.\u003C/p\u003E\u003Cp\u003EStill, I\u0027ll keep trying to break things. Or find broken things.\u003C/p\u003E\u003Cp\u003EOh, the Alpha Wheels aren\u0027t working right now. Looks like an elephant sat on the suspension and crushed it into the wheel.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-29T20:20:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaalidas\u0022 data-cite=\u0022Gaalidas\u0022\u003E\u003Cdiv\u003ESomething in that last post reminded me of soemthing I thought to mention. Actually, two things.\u003Cp\u003EFirst off, I did something really stupid (stupidly awesome, but still \u003Cem\u003Ereally \u003C/em\u003Estupid). I loaded up an ASET rover body (around 12 segments long) with four sets of four medium wheels each (y\u0027know, the ones that look like repulsor wheels but don\u0027t transform, though I wish they could still transform and act like landing-legs). So that\u0027s four wheels, set in standard rover format around a central tube, then copied three more times and put into a square formation. I know, it\u0027s pretty nuts. I was trying to see if the module could make the necessary adjustments for wheels in this nutty arrangement, taking inspiration from that kethane mining rig shown early on in the mod\u0027s development, and taking it a little bit further.\u003C/p\u003E\u003Cp\u003EPerformance from the start was pretty good, though I couldn\u0027t tell if the wheels on the inside track were reacting properly considering they were attached to a part facing the opposite direction than would be expected considering the side of the craft they were attached to. So, I begin rolling with this giant 16 wheeled monstrosity (abomination possibly?) and performance is great... until... one of the wheels from the four quads gets stuck in full suspension extension and refuses to turn. In fact, it causes so much friction that it is tearing the rest of the craft apart. On top of that, the rest of the wheels were spinning in place. Long story short, I pushed it to get it unstuck and ripped one of the quads off the thing. It still worked after that, just sagged a bit in the front.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUmmmmmm... Screen grab???\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Madrias\u0022 data-cite=\u0022Madrias\u0022\u003E\u003Cdiv\u003EOut of curiosity, seeing as it\u0027d been mentioned NOT to do earlier (regarding multiple pods and their views), what exactly is the issue with running multiples? I\u0027ve coupled a pair of DSR2\u0027s back-to-back and other than not being able to EVA (cause I\u0027ve blocked up the hatches in doing so), things seem to still work okay. Other than, of course, massive loading lag.\u003Cp\u003EYes, I do sometimes wonder why, exactly, I do these kind of things. Tell me not to do something and what do I go and do? Exactly what someone said not to do.\u003C/p\u003E\u003Cp\u003EStill, I\u0027ll keep trying to break things. Or find broken things.\u003C/p\u003E\u003Cp\u003EOh, the Alpha Wheels aren\u0027t working right now. Looks like an elephant sat on the suspension and crushed it into the wheel.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think we all suffer from this affliction! Which wheel, could could you do me a screen grab? I\u0027ve been messing with the suspension stuff, so I\u0027d be very interested to see what I broke..\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-29T20:30:30Z","Content":"\n\u003Cp\u003EOh! I remembered the second thing! So, this is probably how it\u0027s supposed to function, but I discovered that a set of wheels with a group number 2 don\u0027t work too well with another set of wheels (even of the same type) with a group number 1. I had a rover with four wheels, but the front ones needed different torque settings than the back ones so it wouldn\u0027t do the monster truck flip on me when I accelerated. What happened was that the back wheels still reversed their steering like the stock wheels would do, taking into account their position on the craft, but they didn\u0027t necessarily work together, if you get my meaning. I reset the back wheels during the trip to group one again, and the steering started working the way it should from what I could tell. I took the test a bit further though, and put another set of wheels between the two sets and set the back four to group 2, Sure enough, the separate torque settings worked great but the middle two wheels were turning as if they were the front wheels. They didn\u0027t start acting like middle wheels until I set all the wheels to use group 1 again. So, I\u0027m faced with a small problem of over-active wheel torque causing acceleration flips but turning amazingly well, or having less turning performance and being ably to manipulate things separately without hitting every single wheel settings sliders separately. Am I making sense?\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-29T20:49:07Z","Content":"\n\u003Cp\u003ENow that I\u0027ve grabbed the latest dev build, I\u0027ll see if those wheels are still broken, or whether I just had a minor quirk at my end. That, and I\u0027m trying to come up with something just outright crazy to pull off...\u003C/p\u003E\u003Cp\u003EEdit: Alpha Medium Wheel is still broken. Doesn\u0027t drive, doesn\u0027t steer. I\u0027ll upload screencaps when Imgur stops being a butt.\u003C/p\u003E\u003Cp\u003EEdit 2:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/UY0Cm\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EShould shed some light on the subject. One taken from under the vehicle, showing that it\u0027s floating, despite not installing repulsors. One taken from above the vehicle, showing me inputting full steering and getting nothing in return (other than reaction wheel torque) and one from 3/4 view.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-29T21:00:41Z\u0022 title=\u002210/29/2014 09:00  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 29, 2014\u003C/time\u003E by Madrias\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-29T21:02:27Z","Content":"\n\u003Cp\u003EWeird, I use it all the time without issue. Be sure your craft doesn\u0027t have an errant collider that\u0027s sitting at the same level or lower than the wheels. I attempted to put wheels on those new wider RetroFuture parts and discovered that the hull was colliding with the ground below the wheel colliders, despite the visual appearance showing that I had plenty of clearance.\u003C/p\u003E\u003Cp\u003EI won\u0027t be able to put up any screen caps of my misadventures. Trying to reproduce these things is rather difficult and time-consuming. besides, the craft that I messed up with no longer exists since I tend to not keep broken designs, I just fix them and re-save to the same file.\u003C/p\u003E\u003Cp\u003EAlmost wish I had the processing power to run a vid-cap program in the background during every play-through so I could document my stupidity in designing rovers.\u003C/p\u003E\u003Cp\u003EEDIT: Probably a stupid question, but you are updating \u003Cem\u003Eall\u003C/em\u003E of the files when lo-fi dumps his stuff (that sounds so wrong, sorry) right? Cause, if he updates the .mu and the .dll and only one gets updated on your machine, things will go funky sometimes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-29T21:09:55Z\u0022 title=\u002210/29/2014 09:09  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 29, 2014\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-29T21:04:14Z","Content":"\n\u003Cp\u003EThat same body works just fine with the Repulsor Conversion wheels. Still, I\u0027ll try throwing a few other craft at it, including one of my simple testing designs.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-29T21:09:42Z","Content":"\n\u003Cp\u003EThanks guys, I\u0027ll do a bit of replication...\u003C/p\u003E\u003Cp\u003EEDIT: Madrias, I just noticed you\u0027re using the old medium model. I\u0027ve not tested with that, I have to admit. Anything in the logs? It may well be a victim of my refactoring. Which config are you using?\u003C/p\u003E\u003Cp\u003EGaalidas, I think you\u0027ve discovered an edge case, and one where the settings menu is possibly not clear. I\u0027ve modified to give different buttons to update steering and wheel settings independently, though still using the same group number slider. See what you think; hopefully it\u0027s not too confusing...\u003C/p\u003E\u003Cp\u003EI think I\u0027ve fixed that bug with the repulsors (and hopefully not caused any more), as well as\u003Cem\u003E finally\u003C/em\u003E fixed the water code to my satisfaction.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-29T21:38:34Z\u0022 title=\u002210/29/2014 09:38  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 29, 2014\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-29T21:12:01Z","Content":"\n\u003Cp\u003EAdded another to the album, as simple as it gets. Two RTG\u0027s, two batteries, the flat-wide I-beams, and four wheels. Still not behaving.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-29T21:44:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Madrias\u0022 data-cite=\u0022Madrias\u0022\u003E\u003Cdiv\u003EAdded another to the album, as simple as it gets. Two RTG\u0027s, two batteries, the flat-wide I-beams, and four wheels. Still not behaving.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I\u0027d say a config fubar, as I changed quite a bit in the plugin and done several repasses over all the models since I stopped testing with those. Any particular reason you like them over the repulsor wheels? I\u0027ve updated so the (as-yet) unused repulsor mesh is removed on the new medium wheel that\u0027s using the repwheel mesh, which should sort it all out for you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E This needs to happen for release anyway.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-29T22:03:50Z","Content":"\n\u003Cp\u003ENot so much that I prefer them over the repulsor wheels, but I have a lot of crafts on other saves that use the Alpha wheels instead. It\u0027s just one of those things. With the new functionality built into the Rep. wheels (split modes that actually allow independant suspension/repulsor control), I\u0027ll be using them more often. Otherwise, it\u0027s a preference for a cleaner, sleeker looking craft.\u003C/p\u003E\u003Cp\u003EAs for what I\u0027m up to... Making that new rover pod fly.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-29T22:08:56Z","Content":"\n\u003Cp\u003EAh got ya. If you don\u0027t mind backing up a save and testing, you ought to find that the new version is a direct replacement for the old model, as I set the name the same in the config. Hopefully nothing bad should happen with craft in flight...\u003C/p\u003E\u003Cp\u003EFlying DSR2 sounds brilliant! I\u0027ve been giving some thought to how to launch the thing on a rocket, which actually won\u0027t be easy as it stands.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-29T22:19:36Z","Content":"\n\u003Cp\u003EAh. I went the easy way instead of trying to put it on a rocket and send it screaming into the sky that way.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ACDg4XP.jpg\u0022 alt=\u0022ACDg4XP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EJeb decided to space-tape his remote control glider to the roof. Well, after they put the batteries in the shrink ray backwards and made it bigger, then glued some engines on.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-29T22:22:16Z\u0022 title=\u002210/29/2014 10:22  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 29, 2014\u003C/time\u003E by Madrias\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-29T23:07:18Z","Content":"\n\u003Cp\u003EI believe the russians came up with just such a contraption in WW2 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Very cool! Jebs half hidden expression in the screen grab is absolutely priceless too.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-29T23:52:17Z","Content":"\n\u003Cp\u003EOne can air-drop the rover, too. Very useful in a pinch. Sure, it can\u0027t get off-world, but it was designed to drop the rover on Kerbin. I\u0027ve used similar planes to explore Eve in the past, after getting them there. It\u0027s just how I am. I have no problems landing when there\u0027s atmosphere to exploit, but you yank that out from under me and I struggle to do anything.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-30T00:08:42Z","Content":"\n\u003Cp\u003EI\u0027ll give that new code a test in a few minutes. I figure, at the very least, a way to get separate control groups to work together in steering properly would be great.\u003C/p\u003E\u003Cp\u003ELets see... next up on my insane testing procedure (really just making it up as I go) will be to see how multiple types/sizes of wheels work together. Oh, one thing I did do a while back was add surface repulsors to a heavy craft to relieve the wheels from taking all of the weight, leaving them to handle the propulsion mostly. I ended up with a more stable craft in the forward/backward range. However, upon catching a little air the thing decided to flip over and explode. I have no idea what happened, but overall it was a success. No one will miss that intern anyway.\u003C/p\u003E\u003Cp\u003EJeb looks a bit nervous to me in that picture. That\u0027s saying a lot considering Jeb will grin like an idiot when strapped with duct-tape to half a dozen boosters aimed at something hard like... the ground.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-30T00:10:43Z\u0022 title=\u002210/30/2014 12:10  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 30, 2014\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-30T00:14:23Z","Content":"\n\u003Cp\u003EJeb was the pilot for the first flight where I didn\u0027t have any struts. The thing shook apart and collapsed the VAB when the pod hit it. Without parachutes.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-30T00:24:45Z","Content":"\n\u003Cp\u003ESo he has good reason to be a bit nervous.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-10-30T00:25:34Z","Content":"\n\u003Cp\u003EGotta love a bit of VAB destruction. Surely Jeb was looking around for snacks?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cbr\u003EPART\u003Cbr\u003E{\u003Cbr\u003Ename = KFroverWheel2\u003Cbr\u003Emodule = Part\u003Cbr\u003Eauthor = Squad \u0026amp; Kerbal Foundries\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Emesh = model.mu\u003Cbr\u003Escale = 1\u003Cbr\u003ErescaleFactor = 1\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Enode_attach = 0.2233052, 0.5248517, 0.00, 1.0, 0.0, 0.0, 1\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003ETechRequired = fieldScience\u003Cbr\u003EentryCost = 3100\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Ecost = 300\u003Cbr\u003Ecategory = Utility\u003Cbr\u003Esubcategory = 0\u003Cbr\u003Etitle = KF RoveMax Model S2\u003Cbr\u003Emanufacturer = Kerbal Motion LLC \u0026amp; Kerbal Foundries\u003Cbr\u003Edescription = Seeing an untapped market for a smaller design of rover wheel, Kerbal Motion quickly pounced upon this opportunity with the Model 2 - designed for robotic vehicles or smaller crewed vehicles.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EattachRules = 0,1,0,1,0\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Emass = 0.05\u003Cbr\u003EdragModelType = default\u003Cbr\u003Emaximum_drag = 0.3\u003Cbr\u003Eminimum_drag = 0.2\u003Cbr\u003EangularDrag = 1\u003Cbr\u003EcrashTolerance = 7\u003Cbr\u003EmaxTemp = 3600 \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EcrashTolerance = 20\u003Cbr\u003EbreakingForce = 20\u003Cbr\u003EbreakingTorque = 20\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = ObjectDestroy\u003Cbr\u003E objectName = bustedwheel\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = OverrideWheelCollider\u003Cbr\u003E susTravName = suspensionTraverse\u003Cbr\u003E moveCollider = true\u003Cbr\u003E moveColliderBy = 0.05\u003Cbr\u003E suspensionDistance = 0.2\u003Cbr\u003E spring = 1\u003Cbr\u003E damper = 0.05\u003Cbr\u003E mass = 0.25\u003Cbr\u003E targetPosition = 0\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = ModuleTrack\u003Cbr\u003E raycastError = -0.015\u003Cbr\u003E springRate = 0.8\u003Cbr\u003E damperRate = 0.05\u003Cbr\u003E smoothSpeed = 8\u003Cbr\u003E chargeConsumptionRate = 0.2\u003Cbr\u003E hasSteering = true\u003Cbr\u003E torqueCurve\u003Cbr\u003E {\u003Cbr\u003E key = 0 60 0 0\u003Cbr\u003E key = 2 60 0 0\u003Cbr\u003E key = 6 30 0 0\u003Cbr\u003E key = 12 0 0 0\u003Cbr\u003E }\u003Cbr\u003E\u003Cbr\u003E steeringCurve\u003Cbr\u003E {\u003Cbr\u003E key = 0 30 0 0\u003Cbr\u003E key = 6 10 0 0\u003Cbr\u003E key = 12 5 0 0\u003Cbr\u003E\u003Cbr\u003E } \u003Cbr\u003E\u003Cbr\u003E torqueSteeringCurve\u003Cbr\u003E {\u003Cbr\u003E key = 0 0 0 0\u003Cbr\u003E }\u003Cbr\u003E brakeSteeringCurve\u003Cbr\u003E {\u003Cbr\u003E\u003Cbr\u003E key = 0 0 0 0\u003Cbr\u003E }\u003Cbr\u003E brakingTorque = 70\u003Cbr\u003E rollingResistance = 0\u003Cbr\u003E maxRPM = 600\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = TrackWheel\u003Cbr\u003E wheelName = wheel\u003Cbr\u003E colliderName = wheelCollider\u003Cbr\u003E sustravName = suspensionTraverse\u003Cbr\u003E steeringName = lateral\u003Cbr\u003E isIdler = false\u003Cbr\u003E isSprocket = false\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E smoothSpeed = 40\u003Cbr\u003E wheelRotationX = 0\u003Cbr\u003E wheelRotationY = 1\u003Cbr\u003E wheelRotationZ = 0\u003Cbr\u003E susTravAxis = Y\u003Cbr\u003E steeringAxis = Y\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = FXModuleLookAtConstraint\u003Cbr\u003E CONSTRAINLOOKFX\u003Cbr\u003E {\u003Cbr\u003E targetName = susp1\u003Cbr\u003E rotatorsName = susp2\u003Cbr\u003E }\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E CONSTRAINLOOKFX\u003Cbr\u003E {\u003Cbr\u003E targetName = susp2\u003Cbr\u003E rotatorsName = susp1\u003Cbr\u003E }\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EEFFECTS\u003Cbr\u003E{\u003Cbr\u003E WheelEffect\u003Cbr\u003E {\u003Cbr\u003E AUDIO\u003Cbr\u003E {\u003Cbr\u003E channel = Ship\u003Cbr\u003E clip = KerbalFoundries/Sounds/wheel\u003Cbr\u003E volume = 0.0 0.0\u003Cbr\u003E volume = 0.1 0.2\u003Cbr\u003E volume = 1.0 1.0\u003Cbr\u003E pitch = 0.0 0.6\u003Cbr\u003E pitch = 1.0 1.5\u003Cbr\u003E loop = true\u003Cbr\u003E }\u003Cbr\u003E }\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E}\u003Cbr\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cbr\u003EPART\u003Cbr\u003E{\u003Cbr\u003Ename = KFwheelMed\u003Cbr\u003Emodule = Part\u003Cbr\u003Eauthor = Squad \u0026amp; Kerbal Foundries\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Emesh = model.mu\u003Cbr\u003Escale = 1\u003Cbr\u003ErescaleFactor = 1\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Enode_attach = 0.0, 0.0, 0.0, 1.0, 0.0, 0.0\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003ETechRequired = advancedMotors\u003Cbr\u003EentryCost = 6000\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Ecost = 580\u003Cbr\u003Ecategory = Utility\u003Cbr\u003Esubcategory = 0\u003Cbr\u003Etitle = KF TR-2L Ruggedized Vehicular Wheel\u003Cbr\u003Emanufacturer = Kerbal Motion LLC \u0026amp; Kerbal Foundries\u003Cbr\u003Edescription = The TR-2L is an extremely tough wheel made for mobilizing medium sized vehicles across a large variety of terrain. The extremely high traction tread ensures firm grip on any surface, providing reliability and reducing the chances of being used for high-speed tomfoolery. \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EattachRules = 0,1,0,1,0\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Emass = 0.15\u003Cbr\u003EdragModelType = default\u003Cbr\u003Emaximum_drag = 0.3\u003Cbr\u003Eminimum_drag = 0.2\u003Cbr\u003EangularDrag = 1\u003Cbr\u003EcrashTolerance = 7\u003Cbr\u003EmaxTemp = 3600 \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EcrashTolerance = 100\u003Cbr\u003EbreakingForce = 80\u003Cbr\u003EbreakingTorque = 80\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003ECoMOffset = -0.75, 0, 0 \u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = ObjectDestroy\u003Cbr\u003E objectName = bustedwheel\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = OverrideWheelCollider\u003Cbr\u003E susTravName = suspensionTraverse\u003Cbr\u003E moveCollider = true\u003Cbr\u003E moveColliderBy = 0\u003Cbr\u003E suspensionDistance = 0.15\u003Cbr\u003E spring = 1\u003Cbr\u003E damper = 0.05\u003Cbr\u003E mass = 0.6\u003Cbr\u003E targetPosition = 0\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = ModuleTrack\u003Cbr\u003E raycastError = -0.015\u003Cbr\u003E springRate = 0.8\u003Cbr\u003E damperRate = 0.05\u003Cbr\u003E smoothSpeed = 8\u003Cbr\u003E chargeConsumptionRate = 0.2\u003Cbr\u003E hasSteering = true\u003Cbr\u003E torqueCurve\u003Cbr\u003E {\u003Cbr\u003E key = 0 60 0 0\u003Cbr\u003E key = 5 60 0 0\u003Cbr\u003E key = 10 30 0 0\u003Cbr\u003E key = 20 0 0 0\u003Cbr\u003E }\u003Cbr\u003E\u003Cbr\u003E steeringCurve\u003Cbr\u003E {\u003Cbr\u003E key = 0 20 0 0\u003Cbr\u003E key = 6 10 0 0\u003Cbr\u003E key = 12 5 0 0\u003Cbr\u003E\u003Cbr\u003E } \u003Cbr\u003E\u003Cbr\u003E torqueSteeringCurve\u003Cbr\u003E {\u003Cbr\u003E key = 0 0 0 0\u003Cbr\u003E }\u003Cbr\u003E brakeSteeringCurve\u003Cbr\u003E {\u003Cbr\u003E\u003Cbr\u003E key = 0 0 0 0\u003Cbr\u003E }\u003Cbr\u003E brakingTorque = 70\u003Cbr\u003E rollingResistance = 0\u003Cbr\u003E maxRPM = 300\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E name = TrackWheel\u003Cbr\u003E wheelName = wheel\u003Cbr\u003E colliderName = wheelCollider\u003Cbr\u003E sustravName = suspensionTraverse\u003Cbr\u003E steeringName = trackSteering\u003Cbr\u003E isIdler = false\u003Cbr\u003E isSprocket = false\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E smoothSpeed = 40\u003Cbr\u003E wheelRotationX = 1\u003Cbr\u003E wheelRotationY = 0\u003Cbr\u003E wheelRotationZ = 0\u003Cbr\u003E susTravAxis = Y\u003Cbr\u003E steeringAxis = Y\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003EEFFECTS\u003Cbr\u003E{\u003Cbr\u003E WheelEffect\u003Cbr\u003E {\u003Cbr\u003E AUDIO\u003Cbr\u003E {\u003Cbr\u003E channel = Ship\u003Cbr\u003E clip = KerbalFoundries/Sounds/wheel\u003Cbr\u003E volume = 0.0 0.0\u003Cbr\u003E volume = 0.1 0.2\u003Cbr\u003E volume = 1.0 1.0\u003Cbr\u003E pitch = 0.0 0.6\u003Cbr\u003E pitch = 1.0 1.5\u003Cbr\u003E loop = true\u003Cbr\u003E }\u003Cbr\u003E }\u003Cbr\u003E}\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E}\u003Cbr\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-30T01:21:38Z\u0022 title=\u002210/30/2014 01:21  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 30, 2014\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-10-30T02:47:54Z","Content":"\n\u003Cp\u003EStill messing around with the DSR2, and about the only thing I can really think of that would be really nice to have is a matching design of science lab. Well, that, and some method to mount it that doesn\u0027t block up the rear door. I know, I know, you\u0027re not supposed to drag science labs with you while using a rover, but I always want to do things like that.\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2014-10-30T05:44:41Z","Content":"\n\u003Cp\u003EWe could rig some sort of truss mount so you could carry the thing on the roof. Yeah, it\u0027d be \u003Cem\u003Ereally\u003C/em\u003E top heavy and hard to use, but I\u0027m sure you could find some way of making it work, right? After all, Kerbals do things the hard way because... well... Science! And physics... and all that crazy stuff.\u003C/p\u003E\u003Cp\u003EJust got those two new configs set up as patches. I realized that if you wanted to simply add new parts made out of stock models, you wouldn\u0027t need to use a patch to do it really. So, I\u0027m focusing on replacement patches. Still haven\u0027t had a chance to do any personal testing of things since my major fail earlier. I guess that\u0027ll have to wait for tomorrow.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-30T06:06:28Z\u0022 title=\u002210/30/2014 06:06  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 30, 2014\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AccidentalDisassembly","CreatedById":110936,"CreatedDateTime":"2014-10-30T05:45:38Z","Content":"\n\u003Cp\u003EI\u0027ve tried tweakscaling various tracks and whatnot, and had a question. Sorry if this has already been addressed. Thinking of the alpha tracks or mole tracks as an example:\u003C/p\u003E\u003Cp\u003E- Scaled up (like to 200 or 400%), the force of the tracks seems to increase way more than it should - at 400% and mashing W for forward, they\u0027re powerful enough to fling a 20,000-ton ship up off the ground (4 pairs, 8 total tracks). Is there some tweakscale exponent controlling this that can be adjusted? Didn\u0027t see one in the scaleexponents cfg...\u003C/p\u003E\u003Cp\u003E- Same is more or less true for the springiness of the tracks - they tend to be pretty bouncy for their apparent size.\u003C/p\u003E\u003Cp\u003EAny others experience this?\u003C/p\u003E\n"}]}