{"TopicId":75938,"ForumId":36,"TopicTitle":"[1.0.x] [V1.9f] Kerbal Foundries wheels, anti-grav repulsors and tracks","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-25T17:24:04Z","PageNum":162,"Articles":[{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-05-02T16:15:51Z","Content":"\n\u003Cp\u003E\nSo, for anyone who is interested in testing or contributing to the development of the replacement Wheel Collider component/module/code, I have set up a github repository with the current WIP implementation:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://github.com/shadowmage45/KSPWheel\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/shadowmage45/KSPWheel\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt currently is only geared towards setup and testing in the Unity Editor, and the repo thus far consists mostly of a Unity Project with a few example/test vehicles.  It is semi-function in its current state as far as suspension and basic friction model go, but there is still a lot to be done.\n\u003C/p\u003E\n\u003Cp\u003E\nDevelopment of a KSP PartModule will come after the basic physics stuff has been worked out (friction, suspension, etc); I might actually leave that up to individual mods to implement (as everyone\u0027s preferred model rigging is different, as is their required feature-set).\n\u003C/p\u003E\n\u003Cp\u003E\nThe goal for this week is to get the default spring/damper model in place and functioning properly under all circumstances.  It is currently mostly there but needs a bit of... attention.  Will also be looking into a \u0027dynamic\u0027 spring/damper model where it can be easily auto-adjusted for the vehicle mass (e.g. just input \u0027stiffness\u0027 and \u0027damping ratio\u0027 and it will be auto-scaled for the current vehicle; not exactly realistic, but needed for KSP type setups).\n\u003C/p\u003E\n\u003Cp\u003E\nNext week will be cleaning up the default dynamic friction model.  After that will be static friction and adherence (likely the most difficult to figure out).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf anyone out there is familiar with Unity physics (and/or physics in general) and wants to contribute... by all means, do so \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  I\u0027m open to regular PRs, or if you feel you would like to contribute more regularly I am willing to add a few more people as collaborators to the project (push access).\n\u003C/p\u003E\n\u003Cp\u003E\nThe aim of this project is to create a replacement low-level Wheel Collider component that -just works-.  Due to familiarity it will likely very closely resemble the U4 WheelCollider component when finished (at least externally), though it may have some additional internal features or customization options as well (such as switching of spring or friction models).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLooking forward to collaborating with you guys and seeing Kerbal Foundries continued for the latest KSP versions.  Has always been one of the first part-mods that I install on my games and I won\u0027t even start my next career game without it \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2016-05-02T16:59:21Z","Content":"\n\u003Cp\u003E\nI never thought the original post would be resumed again... considering it is a pretty hefty topic as it was when we closed it.  Anyway... despite my plans and ideas and whatnot, it is obvious i don\u0027t have the time to actively work on this and likely won\u0027t in the near future.  Don\u0027t forget about me, though, when assigning any permissions and whatnot.  Summer comes relatively soon and i may yet have some time to look into this mod again.\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I have been doing is a bit of research considering how the wheels are implemented in this and other Unity-based games.  For instance: I have been watching a LOT (I mean a -insert expletive here- load) of Space Engineers content on YouTube lately and they are plagued by the barely-manageable wheel physics that we are now dealing with here such as the extreme slipping and sliding (drifting anyone?) but they also have a lot of adjustable settings on the fly without having to reinitialize things and whatnot.  I don\u0027t know if that\u0027s as much of a problem in the new engine, but I remember a while back we had to give up changing certain values when the flight scene was loaded due to limitations in the engine... unless that was squad-side in which case I am totally wrong... and it wouldn\u0027t be the first time either.\n\u003C/p\u003E\n\u003Cp\u003E\nNothing has really come out of this research other than the fact that is sucks for everyone, cross-game-platform even.  On the up side, for the SE players anyway, a lot of the innovations in KSP vehicles are starting to filter into SE builds as more KSP players are picking up the other title as well.  I\u0027m still waiting for someone to make an SE version of that crazy Kethane rig lo-fi showed off in the early days of KF.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway... looking forward to see if you guys can make it work.  I\u0027d be interested to know if anyone has actually managed to make any of the modules load up in the game and if any of the features at all are still functioning.  The only thing I can think of that could still work okay would be the basic rendering of the GUI menu since they left a lot of the old GUI API still accessible, but I doubt the activation icon still functions properly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI really like the idea of auto-adjustments by the way...\n\u003C/p\u003E\n\u003Cp\u003E\nThat was one of my long term goals when I set up the GUI to be able to handle adjustment sliders and whatnot.  I wanted those to, in the end, become more of a debug option and have the wheels actually grab their settings from a craft-based module (vessel modules I think they were called) which would determine if the craft is even in need of such a module (if not it would kill itself... suicidal modules?  Depression in module AI when its purpose is determined to be null?  I know the feeling...) and, if so, would then calculate all the necessary variables and make them available to each wheel to then include in its individual computations based on its position on the craft and how much of a load it is being asked to carry.  I also wanted to find some way to have the wheels be able to adjust their suspension to keep the craft either as level with the ground as possible \u003Cem\u003Eor\u003C/em\u003E as level with with upright vector as possible (and also apply this to legs) and, possibly, provide IR-style bookmark points for suspension height and such to help with fixed-height ramps for back or side-loading cargo bays (or drop-down bays even).  It\u0027s a long list of improvements to the craft control scheme that would all rely on some way of auto-adjusting dynamic variables while in the flight scene without re initializing anything.\n\u003C/p\u003E\n\u003Cp\u003E\nOther than that, i wanted to make KF into an extendable project which I am learning more and more about in school right now.  (Technically \u0022right now\u0022 is a loose term since the current topics are all on Unit Testing which I am beginning to \u003Cem\u003Ereally\u003C/em\u003E hate with a \u003Cem\u003Epassion\u003C/em\u003E.  \u003Cem\u003EThat\u003C/em\u003E and doing web-development with Linux which is completely new to me despite my geeky upbringing.)\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway... I hope this project sees the light of day before the next big release of some unknown title from an unknown developer blows the world away and sucks us all into it.  I\u0027ll be sure to keep an eye on it and pipe up if I see anything useful.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-02T17:11:45Z\u0022 title=\u002205/02/2016 05:11  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 2, 2016\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2016-05-02T17:15:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222549340\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461970499\u0022 data-ipsquote-userid=\u0022111099\u0022 data-ipsquote-username=\u0022lo-fi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/29/2016 at 3:54 PM, lo-fi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThread re-opened as Gaalidas is AWOL and I couldn\u0027t update the OP on the other thread. 1.0.x download link is live, plus info about 1.1 status.\n\u003C/p\u003E\n\u003Cp\u003E\nWe\u0027re back in business! I\u0027d forgotten how gargantuan this thread was. Good to be back \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: and a small thanks to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/66272-sumghai/\u0026amp;do=hovercard\u0022 data-mentionid=\u002266272\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/66272-sumghai/\u0022 rel=\u0022\u0022\u003E@sumghai\u003C/a\u003E for working his moderator magic!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah... sorry about that.  Seems I overestimated what I could handle with school and real-life stuff going absolutely nuts on me.  I appreciate you wanting to move away from this stuff lo-fi, but we need someone to take command who can handle at least some of the pressure.  I\u0027m still lurking around, but I fully support the closing of my thread and the re-opening of this one.  My thread was going nowhere quickly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: As for the project linked above... I had an initial look at the code and I must say I\u0027m impressed so far.  Actually, I only looked at a single file... \u003Cem\u003EBUT\u003C/em\u003E (You gotta \u003Cstrong\u003Eshout\u003C/strong\u003E those awkward words out with \u003Cem\u003Eemphasis\u003C/em\u003E to get the attention of the sleepy forum lurkers) I like where you\u0027re heading with defining objects for the various wheel-related modules instead of sticking everything into the module class.  This \u003Cem\u003Eshould\u003C/em\u003E end up with much cleaner code overall.  This is something mod authors for KSP could really use more of.  I used to download sources for just about everything I downloaded to use in KSP to take a look at the magic behind the DLL.  I can\u0027t even express the messy and down-right ugly code I would find in those projects.  If you manage to revolutionize the world with your product, but the sources are ugly as -insert expletive here- then you\u0027ve done a disservice to the world in the long run.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-02T17:25:38Z\u0022 title=\u002205/02/2016 05:25  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 2, 2016\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003Cbr\u003EI had more to say... deal with it.\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2016-05-02T18:46:58Z","Content":"\n\u003Cp\u003E\nGreat things happening here \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve had a crazy weekend playing steam engines, getting drunk and misbehaving, so not had time to even look over the code. I\u0027ll have a few free evenings this week to get stuck in. Good to see you\u0027re still around, Gaalidas!\n\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2016-05-03T13:01:33Z","Content":"\n\u003Cp\u003E\nI\u0027m at about the \u0022hello world\u0022 stage with C#, and have some mods of my own to fix up for 1.1.X, but I\u0027ve stumbled on a NEED for tracks.  OK, a want for tracks.  There\u0027s really stuff all I can do to help, except to say it\u0027s appreciated.\n\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2016-05-03T18:56:11Z","Content":"\n\u003Cp\u003E\nThank you. It helps, in so much as reminding those of us who are scratching heads over physics models and code ourselves that we\u0027re not working in isolation, and there are people eager to see what we produce. A little like writing in to a late night radio presenter just to say \u0022Loved that last track, keep up the good work\u0022. Go get stuck in with C# - it\u0027s really not that hard to pick up. Took me about 3 months to be able to do something useful, I guess. Steep learning curve, but it\u0027s worth sticking at it.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve just set up GitHub desktop and opened the project to look over the code, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022138730\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/138730-shadowmage/\u0022 rel=\u0022\u0022\u003E@Shadowmage\u003C/a\u003E. It\u0027s embarrassingly well organised! I\u0027m afraid my efforts are rather amateur by comparison - I\u0027ll try and learn from your example as I go along...\n\u003C/p\u003E\n\u003Cp\u003E\nI have two ways to attack the friction problem, which are a little different to yours. Firstly, create joints between the ground and the rigidbody of the part and use parameters in that to simulate friction. It may not work at all, but I\u0027ve got a lot of experience bashing Unity joints about, so it won\u0027t take long to try. Secondly, building on top of what you\u0027re done, I think as I mentioned before, we can probably use rigidbody.setposition() after some calculation. This may also be useful for setting the suspension hard compression limit.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d best get to it, I guess....\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-03T18:57:16Z\u0022 title=\u002205/03/2016 06:57  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 3, 2016\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-05-03T19:40:32Z","Content":"\n\u003Cp\u003E\nGood thing you are just getting around to it, as I -just barely- got the Unity project to come through Git unscathed this morning (or at least it appeared to be working).  Code I\u0027m decent at... git... not so much (or maybe its just Unity that doesn\u0027t get along with me very well).\n\u003C/p\u003E\n\u003Cp\u003E\nYah, going to be a bit of fun and learning getting the friction stuff figured out.  What is there currently is... a bit of a buggy guess at how to handle it.  The normal tire-friction models don\u0027t seem to work well in Unity (or games in general?) as they don\u0027t take into account the current velocity in the slip direction and end up applying a massive force even when the slip velocity is near zero; as such all of my attempts at handling friction have been velocity * downForce derived.\n\u003C/p\u003E\n\u003Cp\u003E\nI like the idea of joints for simulation of friction.  Is there a way to set them with a spring value of 0 and a damp value to simulate the friction?  I guess the spring might be needed to try and help it keep position properly.... hmmm...  interested to see what you come up with for those \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAt least the spring/damper/target code appears to function about like it should.  Might still be some errors in it, and certainly some cleanup that could be done regarding simulating an actual tire (rather than just a ray), but seems to be working pretty well at the moment in all regards except punch-through (which might need to be solved at the model level with some actual colliders).\n\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2016-05-03T19:59:06Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222559070\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462304432\u0022 data-ipsquote-userid=\u0022138730\u0022 data-ipsquote-username=\u0022Shadowmage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Shadowmage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYah, going to be a bit of fun and learning getting the friction stuff figured out.  What is there currently is... a bit of a buggy guess at how to handle it.  The normal tire-friction models don\u0027t seem to work well in Unity (or games in general?) as they don\u0027t take into account the current velocity in the slip direction and end up applying a massive force even when the slip velocity is near zero; as such all of my attempts at handling friction have been velocity * downForce derived.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can get the current velocity by subtracting the last hit point from the current one, compare to the wheel direction and factor that in, I guess?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222559070\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462304432\u0022 data-ipsquote-userid=\u0022138730\u0022 data-ipsquote-username=\u0022Shadowmage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Shadowmage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI like the idea of joints for simulation of friction.  Is there a way to set them with a spring value of 0 and a damp value to simulate the friction?  I guess the spring might be needed to try and help it keep position properly.... hmmm...  interested to see what you come up with for those \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think you can do that, yes. You can also use projection to force things back into position if they get moved out of limits, which is handy.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222559070\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462304432\u0022 data-ipsquote-userid=\u0022138730\u0022 data-ipsquote-username=\u0022Shadowmage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 minutes ago, Shadowmage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAt least the spring/damper/target code appears to function about like it should.  Might still be some errors in it, and certainly some cleanup that could be done regarding simulating an actual tire (rather than just a ray), but seems to be working pretty well at the moment in all regards except punch-through (which might need to be solved at the model level with some actual colliders).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActual colliders won\u0027t work, but Unity lets us use wonderful things call sphere casts \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  If they don\u0027t cause too much of a performance hit, they will allow us to make a far, far superiour wheel model. Wheels will actually roll over sharp bits of terrain, rather than simply jolt upwards when the ray gets to the point of change. The hit info will be improved as we can get a tangent plane against the terrain, as opposed to a simple position. Something I\u0027ve been thinking about for some time. If anyone listening in has the skills, an analysis of spherecast vs raycast performance would be most enlightening!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I\u0027m so, so rusty on this stuff. Struggling to even remember the correct bits of vector math \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-03T20:02:38Z\u0022 title=\u002205/03/2016 08:02  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 3, 2016\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2016-05-03T21:06:54Z","Content":"\n\u003Cp\u003E\nWell, my joint based model is out for friction. It can be made to work very effectively as the suspension spring, though. The advantage, I suppose, would be that punch through is simply not possible, all the wheels calculate their load bearing properly within the physics engine, and we have joint info available. In fact, they make very good repulsors...\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-05-03T21:47:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222559282\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462309614\u0022 data-ipsquote-userid=\u0022111099\u0022 data-ipsquote-username=\u0022lo-fi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n39 minutes ago, lo-fi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, my joint based model is out for friction. It can be made to work very effectively as the suspension spring, though. The advantage, I suppose, would be that punch through is simply not possible, all the wheels calculate their load bearing properly within the physics engine, and we have joint info available. In fact, they make very good repulsors...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWould still be interested in a joint-based suspension setup; sounds like it might be a bit more robust than the simple raycast/depth based setup.  Feel free to push to the repo in a new branch if you come up with something cool \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2016-05-03T21:55:53Z","Content":"\n\u003Cp\u003E\nAt the moment, rather than bashing your nice code around, I\u0027m messing about with something very, very simple of my own. They\u0027ve done something weird with the configurable joints in U5, so I\u0027ve got that to fight with before anything productive arrives. I mean, who has most of the component in local space, only to define the anchor point in world space? It just doesn\u0027t make any sense at all.\n\u003C/p\u003E\n\u003Cp\u003E\nI have kind of figured out another potential way to implement friction using the joint drives, so all is not lost yet.... Time spent messing with Unity joints out of idle curiousity was well spent! \n\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2016-05-03T23:05:02Z","Content":"\n\u003Cp\u003E\nFurther reading on why we need to get this nailed:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://forum.unity3d.com/threads/wheel-friction-curve-revealed.153340/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.unity3d.com/threads/wheel-friction-curve-revealed.153340/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnderstand the graph, and you\u0027ll suddenly understand why rovers flip over so readily in KSP... \n\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2016-05-04T00:12:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222559534\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462316702\u0022 data-ipsquote-userid=\u0022111099\u0022 data-ipsquote-username=\u0022lo-fi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, lo-fi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFurther reading on why we need to get this nailed:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://forum.unity3d.com/threads/wheel-friction-curve-revealed.153340/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.unity3d.com/threads/wheel-friction-curve-revealed.153340/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnderstand the graph, and you\u0027ll suddenly understand why rovers flip over so readily in KSP... \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow, that explains a lot.  Also, the horrid chain of \u0022someone else\u0027s code\u0022 explained.  Damn yooo nvidea!\n\u003C/p\u003E\n"},{"CreatedByName":"SmashBrown","CreatedById":102799,"CreatedDateTime":"2016-05-04T00:38:50Z","Content":"\n\u003Cp\u003E\nGood luck with this, i really am looking forward to botting up ksp again, and this mod is so much fun.\n\u003C/p\u003E\n"},{"CreatedByName":"vontreigo","CreatedById":107351,"CreatedDateTime":"2016-05-04T04:53:12Z","Content":"\n\u003Cp\u003E\nYeah good luck guy I miss this mod so much. Actually the most used part to me is the small air breathing generator. I used it in all my airplanes. \n\u003C/p\u003E\n"},{"CreatedByName":"TiktaalikDreaming","CreatedById":136290,"CreatedDateTime":"2016-05-05T09:38:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222559534\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462316702\u0022 data-ipsquote-userid=\u0022111099\u0022 data-ipsquote-username=\u0022lo-fi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/3/2016 at 9:05 AM, lo-fi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFurther reading on why we need to get this nailed:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://forum.unity3d.com/threads/wheel-friction-curve-revealed.153340/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.unity3d.com/threads/wheel-friction-curve-revealed.153340/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnderstand the graph, and you\u0027ll suddenly understand why rovers flip over so readily in KSP... \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAlso, it contrasts nicely with how Unity believes it works, \u003Ca href=\u0022http://docs.unity3d.com/Manual/class-WheelCollider.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://docs.unity3d.com/Manual/class-WheelCollider.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-05-05T14:37:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222559534\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462316702\u0022 data-ipsquote-userid=\u0022111099\u0022 data-ipsquote-username=\u0022lo-fi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn Tuesday, May 03, 2016 at 5:05 PM, lo-fi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFurther reading on why we need to get this nailed:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://forum.unity3d.com/threads/wheel-friction-curve-revealed.153340/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.unity3d.com/threads/wheel-friction-curve-revealed.153340/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnderstand the graph, and you\u0027ll suddenly understand why rovers flip over so readily in KSP... \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIndeed, those graphs explain a lot of what was seen from the old wheels.  I love the incoherent mess that it makes \u0026lt; 0.5m/s.  Pretty sure they are supposed to look something closer to one side of : \u003Cimg alt=\u0022ctsrcurve.gif\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.asawicki.info/Mirror/Car%20Physics%20for%20Games/Car%20Physics%20for%20Games_files/ctsrcurve.gif\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyhow, getting things nearly wrapped up on my mod, so should have more time to dedicate to getting these wheels working this weekend / next week.  Still have a few ideas on how to solve a few of the issues I was facing regarding friction, and will be taking a bit of time to experiment with spherecasts for the suspension checks.\n\u003C/p\u003E\n\u003Cp\u003E\nBut yeah.... the wheel problem needs to be solved; the old U4 colliders had their issues (e.g. friction/tipping), but the U5 ones just don\u0027t work at all for these situations (and even if the did they have some silly limitations regarding orientation).\n\u003C/p\u003E\n\u003Cp\u003E\nIf needs-be, I\u0027ll dig into other physics libraries and figure out how its done on a low-level basis (bullet, havok, phsyx if I can find source).  Might at least give me some ideas on how to solve the outstanding issues with the current custom implementation.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Have subbed into the Physx codebase; so will be exploring how they have the current wheel collider implemented in their native code and see what I can do to bring some of the (good) parts of that into c#/script land.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-05T15:20:32Z\u0022 title=\u002205/05/2016 03:20  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 5, 2016\u003C/time\u003E by Shadowmage\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Neutrinovore","CreatedById":72520,"CreatedDateTime":"2016-05-05T15:47:00Z","Content":"\n\u003Cp\u003E\nOh my G0d Lo-Fi, Squad\u0027s wheels are so g0dd@m messed up, you need to set up the Red Bull I.V., down a bottle of no-doze, and GET US SOME DECENT WHEELS STAT, A.S.A.P., PLEASE FOR KRAKEN\u0027S SAKE!!!\n\u003C/p\u003E\n\u003Cp\u003E\nSigh, calming down...\n\u003C/p\u003E\n\u003Cp\u003E\nOkay, the preceding... rant, flip-out, nervous breakdown, whatever... was an only partially humorous plea, because the stock wheels are so freaking USELESS!  They\u0027re WORSE than useless, I don\u0027t even know why Squad bothers to put them in the game, I cannot find or create any combination of parts that actually functions as a \u0022rover\u0022 that uses the stock wheels!  They either don\u0027t work at all, meaning the thing just sits there on the runway, immobile, with the wheels doing NOTHING, or if I can actually get the thing to move it does so at one of two speeds:  Glacial, acceleration (and I use that word VERY loosely here) can only be measured accurately with a CALENDAR, or \u0027So Much Torque and Wheel Slip\u0027 that it would be better to replace the word \u0027Rover\u0027 in a description of the vehicle with the phrase \u0027Drift-O-Matic Crash-O-Tron\u0027.  And turning?  Fuggeddaboudit!  Again, either wheel-slippage-city, or the good-ol\u0027 Squad control method of \u0027try to turn when moving faster than about 3 m/s and automatically catapult your rover into the air because the wheels dig into the ground sideways, immediately followed by landing upside down creating very much lots of explosions\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, I know that they\u0027ve added all kinds of tweakables to the wheels so that we can supposedly \u0027tune\u0027 them to work better, but to me all that illustrates is that they KNOW the wheels are F\u0027d up, but here, let\u0027s just put a Band-Aid on that severed artery, maybe nobody will notice.  They shouldn\u0027t NEED to have their \u0027traction\u0027 and/or \u0027friction\u0027 adjusted, they should just WORK!\n\u003C/p\u003E\n\u003Cp\u003E\nBah... I just got up to do some stuff for about 10 minutes, and I\u0027m calm now.  Just had to get that off my chest.  Anyway, since wheels obviously confound Squad all to heck, I just figured I\u0027d get on here to encourage Lo-Fi \u0026amp; Co. here at Kerbal Foundries to redouble their efforts so that I (we, the players) can create a vehicle that actually moves on the ground, as opposed to having to create VTOLs and whatnot for exploring the surface of a planet or moon.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, anyway, for what that\u0027s worth.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Keep on keepin\u0027 on, folks.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-05-05T16:42:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222559282\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462309614\u0022 data-ipsquote-userid=\u0022111099\u0022 data-ipsquote-username=\u0022lo-fi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn Tuesday, May 03, 2016 at 3:06 PM, lo-fi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, my joint based model is out for friction. It can be made to work very effectively as the suspension spring, though. The advantage, I suppose, would be that punch through is simply not possible, all the wheels calculate their load bearing properly within the physics engine, and we have joint info available. In fact, they make very good repulsors...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, looking through the PhysX code explains quite a bit of what we are seeing regarding the behaviour of the U5 wheel colliders.  A large portion of the code is \u0027optimized\u0027 for simple 4-wheeled vehicles; entire classes and code-paths dedicated to the over-simplified 4-wheeled-vehicle setup.  It looks as if arbitrary use of wheel colliders was implemented more as an afterthought, and in many spots is unfinished (littered with TODO notes...).\n\u003C/p\u003E\n\u003Cp\u003E\nHowever I\u0027ve found how they handle static friction (sticky friction they call it) and will possibly be able to bash together something in the near future.  Their implementation relies on timers, examining movement speed in a direction vs a threshold, and basically force-repositioning the rigidbody along a local axis if it should have had static friction applied.\n\u003C/p\u003E\n\u003Cp\u003E\nPunch through also seems to be handled in a similar seemingly-hacky manner; they basically examine the movement of the vehicle/wheel during the last update, do a raycast along that vector, and if anything -should- have stopped the vehicle they reposition it manually.\n\u003C/p\u003E\n\u003Cp\u003E\nNow... I could be a bit off on a few of these points, my C\u002B\u002B skills are quite rusty... but what I\u0027m seeing in the code explains a ton of what we see in-game/in-editor.  Hopefully I\u0027ll be able to put together a decent c# implementation of some of the valid concepts, and find ways to clean up some of the others.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerenatus","CreatedById":151246,"CreatedDateTime":"2016-05-05T17:28:55Z","Content":"\n\u003Cp\u003E\nYes! The wheels ARE coming back!\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-05-05T18:32:25Z","Content":"\n\u003Cp\u003E\nCouple resources for general research into physx vehicle/wheel physics models:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://docs.nvidia.com/gameworks/content/gameworkslibrary/physx/guide/Manual/RigidBodyDynamics.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://docs.nvidia.com/gameworks/content/gameworkslibrary/physx/guide/Manual/RigidBodyDynamics.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://docs.nvidia.com/gameworks/content/gameworkslibrary/physx/guide/Manual/Vehicles.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://docs.nvidia.com/gameworks/content/gameworkslibrary/physx/guide/Manual/Vehicles.html\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.eggert.highpeakpress.com/ME485/Docs/CarSimEd.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.eggert.highpeakpress.com/ME485/Docs/CarSimEd.pdf\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe linked .pdf is actually the source/reference that the physx vehicle model is implemented after, so likely the best place to start from a low-level perspective.  Is some pretty heavy reading though (at least for me)... so... going to be some learning involved before I can implement much of it.\n\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2016-05-06T10:27:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222562950\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462463220\u0022 data-ipsquote-userid=\u002272520\u0022 data-ipsquote-username=\u0022Neutrinovore\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, Neutrinovore said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOh my G0d Lo-Fi, Squad\u0027s wheels are so g0dd@m messed up\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGlad it\u0027s not just me that had a \u0022\u003Cabbr title=\u0022what\u0022\u003EWTF\u003C/abbr\u003E????\u0022 moment... \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222563121\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462469335\u0022 data-ipsquote-userid=\u0022151246\u0022 data-ipsquote-username=\u0022Kerenatus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Kerenatus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYes! The wheels ARE coming back!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, yes they are!\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222563262\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462473145\u0022 data-ipsquote-userid=\u0022138730\u0022 data-ipsquote-username=\u0022Shadowmage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Shadowmage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe linked .pdf is actually the source/reference that the physx vehicle model is implemented after, so likely the best place to start from a low-level perspective.  Is some pretty heavy reading though (at least for me)... so... going to be some learning involved before I can implement much of it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou absolute legend - this is far beyond the lengths I\u0027d have gone to. So my idea about \u0022sticky friction\u0022 (lets call it that from now on, shall we?) being implemented by forcing the object to a certain position wasn\u0027t far off, and I bet that explains the jittering under 0.5m/s. Recreating this should not be hard \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I\u0027ll have a read through over the weekend and see if I can bring any other insights. Interesting that they\u0027re geared to simple, 4 wheel vehicles, and probably explains why the tracks go so beserk! Either way, I feel that writing out own colliders - no matter how hard it may be - is absolutely the right way forward, and can probably benefit other Unity games as Gaalidas pointed out. Your generic Unity model \u002B KSP specific wrapper seems all the more pragmatic!\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I\u0027ve been puzzling over, and haven\u0027t come up with a good answer for, is how to calculate how much weight each collider is bearing. You can check the mass of attached rigidbodies, count colliders and divide, but this is expensive, and won\u0027t take into account other collisions such as a body scraping on the floor. Any thoughts? Maybe some kind of two pass approach, but I still can\u0027t get my head around it. Maybe the Nvidia docs will yield some answers....\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, on behalf of all involved, thanks for the encouragement, and thanks for sticking with us as we tackle this thing!\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-05-06T14:43:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222564668\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462530475\u0022 data-ipsquote-userid=\u0022111099\u0022 data-ipsquote-username=\u0022lo-fi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, lo-fi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I\u0027ve been puzzling over, and haven\u0027t come up with a good answer for, is how to calculate how much weight each collider is bearing. You can check the mass of attached rigidbodies, count colliders and divide, but this is expensive, and won\u0027t take into account other collisions such as a body scraping on the floor. Any thoughts? Maybe some kind of two pass approach, but I still can\u0027t get my head around it. Maybe the Nvidia docs will yield some answers....\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, on behalf of all involved, thanks for the encouragement, and thanks for sticking with us as we tackle this thing!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nCalculating the sprung mass is... difficult... with arbitrary vehicle setups.  My current method is to use the upwards force that the suspension generates; as this exact force is how much that particular wheel is exerting at any moment against the ground; they are one and the same.  Now... converting that force back into a mass becomes much more difficult (or is it?  N -\u0026gt; KG = N * 0.1?).  However I have not thought of a reliable method to get the supported mass by a wheel while it is not being suspended; and even then there are... problems with that implementation such as when the suspension is first stopping downward motion the force will be \u0026gt; than the actual mass would imply, only when the spring has reached \u0027steady state\u0027 would the forces==mass supported.\n\u003C/p\u003E\n\u003Cp\u003E\nThe actual solution is a bunch of trig to figure out the position of the wheel vs the COM; but this method would not work reliably for KSP vehicles... you know.. the type who like to have wheels on the roof/etc.  So you would have to first know how many wheels were in contact with the ground (not hard, just do the suspension raycast before querying mass; this is actually how physx does it; all wheels do their raycast in a single pass, and all other calculations come afterwards).  Still not sure how this would work for wheels used as bumpers though; e.g. the vehicle is on the ground supported by 4 wheels but has another set on the front end being pressed into a wall; obviously the two being pressed into the wall aren\u0027t \u0027supporting\u0027 any weight, but they -would- exert a force to resist the compression.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the suspension-force based method is the only reliable metric of how much force a given wheel is exerting; but it seems to fall short for several necessary calculations -- such as determining how much friction force is needed to bring something to a complete stop; for that you need to know the precise mass that each wheel collider is responsible to ensure there are no over-corrections.  Physx itself has low-level access to the per-update accumulated forces and resultant delta-velocity and delta-angular rotation values directly (as does Unity), but I\u0027m not sure we\u0027ll have access to those.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyhow.. you can register to get access to the physx source from:  \u003Ca href=\u0022https://developer.nvidia.com/physx-source-github\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://developer.nvidia.com/physx-source-github\u003C/a\u003E  Pretty short signup, takes them about an hour to approve the account, but a mostly painful process in the end.  Is some interesting reading going through the source (note it is all C\u002B\u002B code, so some background with C/C\u002B\u002B helps when reading it and understanding the various variable/pointer/reference types).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Joshwoo70","CreatedById":111345,"CreatedDateTime":"2016-05-06T14:51:09Z","Content":"\n\u003Cp\u003E\ncurious.. what if some people use those not with nvidia\u0027s? would\u0027t they be left out?\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-05-06T14:59:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222565023\u0022 data-ipsquote-contentid=\u002275938\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462546269\u0022 data-ipsquote-userid=\u0022111345\u0022 data-ipsquote-username=\u0022Joshwoo69\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Joshwoo69 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ncurious.. what if some people use those not with nvidia\u0027s? would\u0027t they be left out?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPhysX is a physics engine and independent of what video card is installed in the computer; in fact most of it (the phsyics anyhow) runs on the CPU.\n\u003C/p\u003E\n\u003Cp\u003E\nUnity / KSP -already- use PhysX, and as far as I\u0027m aware there are no problems with people using AMD/ATI or Intel gfx (aside from the Intel stuff is always underpowered).\n\u003C/p\u003E\n"}]}