{"TopicId":75938,"ForumId":36,"TopicTitle":"[1.0.x] [V1.9f] Kerbal Foundries wheels, anti-grav repulsors and tracks","CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-06-25T17:24:04Z","PageNum":130,"Articles":[{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-14T17:34:41Z","Content":"\n\u003Cp\u003EI didn\u0027t include the project file because of not messing up your local projects.\u003C/p\u003E\u003Cp\u003EWinmerge... don\u0027t know about that. I\u0027ll look it up.\u003C/p\u003E\u003Cp\u003EHow about my code? Is it ok? Is my programming style weird? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hellbrand","CreatedById":65742,"CreatedDateTime":"2015-07-14T17:50:30Z","Content":"\n\u003Cp\u003Edid we ever fix the issue with tweakscale?\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-14T18:05:08Z","Content":"\n\u003Cp\u003EIt will be fixed when we do our next update. Until then, I\u0027m afraid there have been too many changes made both to TweakScale and to the KF parts for anything to be done. Right now It works as intended in our dev copies though, so it should be fine when we release.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022*Aqua*\u0022 data-cite=\u0022*Aqua*\u0022\u003E\u003Cdiv\u003EI didn\u0027t include the project file because of not messing up your local projects.\u003Cp\u003EWinmerge... don\u0027t know about that. I\u0027ll look it up.\u003C/p\u003E\u003Cp\u003EHow about my code? Is it ok? Is my programming style weird? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eweird? nah... I just did some cleanup and redundancy reduction passes a few minutes ago. I\u0027m actually impressed with it, for the most part. I might even learn a thing or two.\u003C/p\u003E\u003Cp\u003ERealistically I likely \u003Cem\u003Ewon\u0027t\u003C/em\u003E learn anything... but I \u003Cem\u003Eshould\u003C/em\u003E be if I were so inclined.\u003C/p\u003E\u003Cp\u003EI haven\u0027t tried to compile it yet, though, so don\u0027t get relaxed yet.\u003C/p\u003E\u003Cp\u003EWinmerge is awesome. Granted, no merger program is perfect, but it\u0027s pretty good so far. I have it set up to check the entire folders between my local dev project and the github synced folder. It then can tell me what binary files are different as well as track specific changes between textual files and allows merging them visually on a per-different-line basis. I still have to do some editing sometimes, but I can do that right within the program and see the differences in real time, if I have the auto-detect-changes setting on. It handles XML files really screwy and can mess things up sometimes, but for the rest it seems to be okay. I\u0027ve been using this since before I even knew KSP existed.\u003C/p\u003E\u003Cp\u003EEDIT: Also... I did actually do something with the camera toggle in the dust color stuff. Basically, if the camera is disabled, the colerAverage is set to just the biome color, otherwise it does the math to combine the camera with the preset.\u003C/p\u003E\u003Cp\u003EAlso, it should be noted that I never actually set all the presets to the actual biomes on the specified bodies, so they won\u0027t all represent the actual colors seen in the textures. We\u0027ll need to run through those sometime.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-14T18:44:35Z\u0022 title=\u002207/14/2015 06:44  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 14, 2015\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-07-14T20:57:37Z","Content":"\n\u003Cp\u003EYou lost me competely these past pages...but suggestion: let\u0027s make a feature cut here and polish it for a release, i can somehat smell the completion of an awesome mod update \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-14T23:42:04Z","Content":"\n\u003Cp\u003EThat\u0027s pretty much where we\u0027re headed. May not be many new parts in the next release, but a bunch of nice features. Parts will follow as they are completed. However, both Zodius and ElectronÃƒÂ®cfox have parts in the pipeline that are set to use the plugin, plus we have configs for stock and some other mod wheels. And new repulsors, of course...\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-15T01:50:07Z","Content":"\n\u003Cp\u003EI looked into the PQS stuff how we could get the color of the exact point of collision and then it came into my mind that there\u0027s no efficient solution to that.\u003C/p\u003E\u003Cp\u003EIf I understood correctly the PQS system stacks material layers* on a more or less round sphere (which are made of several bent rectangular shapes) which are then merged to a texel (pixel in a texture) during rendering in the GPU. To get that texel we would need to access the video RAM and believe me, you don\u0027t want to do that. We would replicate how the camera works you already use to get the ground color.\u003C/p\u003E\u003Cp\u003E* There\u0027s at least a material for height color maps, \u0022biomes\u0022 (to make grasslands look different to deserts), details (\u0022grass leaves\u0022) and maybe more.\u003C/p\u003E\u003Cp\u003EIMO the current system is good enough and works for everything except some parts of the KSC complex.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T01:52:30Z\u0022 title=\u002207/15/2015 01:52  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by *Aqua*\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-15T01:53:38Z","Content":"\n\u003Cp\u003EIt\u0027s actually pretty insane what we\u0027ve been working on, and yet for the end user there won\u0027t be much different other than the visual effects and such. If they look into how we did it though, I\u0027m sure we\u0027ll be setting a new bar as to what can be done in KSP right now.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022*Aqua*\u0022 data-cite=\u0022*Aqua*\u0022\u003E\u003Cdiv\u003EI looked into the PQS stuff how we could get the color of the exact point of collision and then it came into my mind that there\u0027s no efficient solution to that.\u003Cp\u003EIf I understood correctly the PQS system stacks material layers* on a more or less round sphere which are then merged to a texel (pixel in a texture) during rendering in the GPU. To get that texel we would need to access the video RAM and believe me, you don\u0027t want to do that. We would replicate how the camera works you already use to get the ground color.\u003C/p\u003E\u003Cp\u003E* There\u0027s at least a material for height color maps, \u0022biome\u0022 colors (to make grasslands look different to deserts), detail colors (\u0022grass leaves\u0022) and maybe more.\u003C/p\u003E\u003Cp\u003EIMO the current system is good enough and works for everything except some parts of the KSC complex.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETechnically the biome colors are based on the biome identification maps, which really have nothing to do with the appearance of the region. It has more to do with science and/or tracking what region of the planetary body the craft is in. That\u0027s why some biomes are given utterly ridiculous colors, such as a grassy area perhaps receiving a default biome color of deep purple (just an example, I didn\u0027t actually look the color up). Some trial and error will be needed to fine tune the biome colors for non-Kerbin locations.\u003C/p\u003E\u003Cp\u003EThere are, however, some issues with how the biome maps are set up. There\u0027s at least one area around the KSC that is marked as a tundra region, but the texture is obviously grassy. That\u0027s why I wanted to find a way to get the color visually, which led to then original idea to use a camera which, after a while, became possible with the \u0022vessel module\u0022 feature. I have no idea how to detect these errant biomes and squash them, however, unless we were to override the biome maps in certain areas, such as around the KSC.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T01:59:49Z\u0022 title=\u002207/15/2015 01:59  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-15T03:22:24Z","Content":"\n\u003Cp\u003EAlright, we\u0027re not in the clear yet with the GUI. I just did a test launch and I have absolutely no icon in the app launcher. \u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ENullReferenceException: Object reference not set to an instance of an object\u003Cbr\u003E    KerbalFoundries.KFPersistenceManager.ReadConfig ()\u003Cbr\u003E    KerbalFoundries.KFPersistenceManager..cctor ()\u003Cbr\u003E    Rethrow as TypeInitializationException: An exception was thrown by the type initializer for KerbalFoundries.KFPersistenceManager\u003Cbr\u003E    UnityEngine.GameObject:AddComponent(Type)\u003Cbr\u003E    AddonLoader:StartAddon(LoadedAssembly, Type, KSPAddon, Startup)\u003Cbr\u003E    AddonLoader:StartAddons(Startup)\u003Cbr\u003E    :MoveNext()\u003Cbr\u003E    UnityEngine.MonoBehaviour:StartCoroutine(IEnumerator)\u003Cbr\u003E    :MoveNext()\u003Cbr\u003E    UnityEngine.MonoBehaviour:StartCoroutine(IEnumerator)\u003Cbr\u003E    GameDatabase:StartLoad()\u003Cbr\u003E    :MoveNext()\u003Cbr\u003E    UnityEngine.MonoBehaviour:StartCoroutine(IEnumerator)\u003Cbr\u003E    LoadingScreen:Start()\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EA little more insight into what could cause the icon to not load. First off, I switched it from [\u003Cspan style=\u0022color:#004085;\u0022\u003EKSPAddon\u003C/span\u003E(\u003Cspan style=\u0022color:#004085;\u0022\u003EKSPAddon\u003C/span\u003E.\u003Cstrong\u003E\u003Cspan style=\u0022color:#004085;\u0022\u003EStartup\u003C/span\u003E\u003C/strong\u003E.\u003Cem\u003EEveryScene\u003C/em\u003E, \u003Cstrong\u003Etrue\u003C/strong\u003E)] to [\u003Cspan style=\u0022color:#004085;\u0022\u003EKSPAddon\u003C/span\u003E(\u003Cspan style=\u0022color:#004085;\u0022\u003EKSPAddon\u003C/span\u003E.\u003Cstrong\u003E\u003Cspan style=\u0022color:#004085;\u0022\u003EStartup\u003C/span\u003E\u003C/strong\u003E.\u003Cem\u003EEveryScene\u003C/em\u003E, \u003Cstrong\u003Efalse\u003C/strong\u003E)] so that it would load more than once, which seemed to squash the above exception. However, I\u0027m still getting no icon. I remember a while back reading something about the event \u0022onGUIApplicationLauncherReady\u0022 not always firing properly in the current version of KSP. that would explain why there\u0027s no icon in the scenes that the class is supposed to run in. We need an alternative method to detect if the launcher is ready to receive buttons.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T04:06:20Z\u0022 title=\u002207/15/2015 04:06  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-07-15T05:54:39Z","Content":"\n\u003Cp\u003EDid I read config for stock parts? A dream comes true \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-15T06:54:42Z","Content":"\n\u003Cp\u003EI remember xEvilReeperx saying that pulling stuff out of the GPU memory would be expensive too. Looks like its mostly under control with the gui and dust, minor bugs aside, so I won\u0027t poke my nose in \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYep Tyren, we\u0027ve had then for a while, though they may well need updating. Also the ERS wheel and something else I can\u0027t remember. Any wheel can have a KF config made, so long as its not a complete vehicle in one part.\u003C/p\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2015-07-15T09:26:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EI remember xEvilReeperx saying that pulling stuff out of the GPU memory would be expensive too. Looks like its mostly under control with the gui and dust, minor bugs aside, so I won\u0027t poke my nose in \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is. The current routine you have takes 4-5ms on average on my machine. If you eliminate the unnecessary allocations in there you can drop the average to 1-2ms. That\u0027s faster than I thought it would be though, so if you go with your strategy of only sampling every x frames it works out I guess\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T09:42:26Z\u0022 title=\u002207/15/2015 09:42  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by xEvilReeperx\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-15T09:49:57Z","Content":"\n\u003Cp\u003EThanks for the input. Just out of interest, how were you benchmarking? I set up using the stopwatch, but is there an easier method? Every frame is certainly too much. Or is there a better method in general? A few other mods - RPM, reflective windows etc. seem to use cameras to capture and apply somewhere, but is there just a price to pay for doing so no matter what you do?\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-15T11:00:43Z","Content":"\n\u003Cp\u003EThanks to a wildcard suggestion from V8Jester, I finally made some solid progress with this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/UwuiPtsmvW4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAlso a big thanks to Baha for showing me the way with the Burn Together code. Still a lot of work to do on that before it gets released into the wild, but I\u0027m no longer terminally stuck! Thanks to Gaalidas and *Aqua* for dealing with other bits while I\u0027m off playing with crazy stuff. More to come \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I\u0027d also like to see an end to the need for docking ports to tie rovers down for transport...\u003C/p\u003E\u003Cp\u003ESeeing some null refs by the way, guys. Mostly related to DustFX when the game is paused. I\u0027ll do some more investigation later and report back. I assume it\u0027s probably just some stuff that needs hooks into the OnPause and OnUnPause methods, so should be no big deal.\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-15T12:16:45Z","Content":"\n\u003Cp\u003E@Gaalidas\u003C/p\u003E\u003Cp\u003EDid you change the KFGUIManager or KFPersistenceManager to run more than once? KFPersistenceManager only needs to do it\u0027s work once during startup.\u003C/p\u003E\u003Cp\u003EThe ApplicationLauncher has a broken life cycle system. It\u0027s present during nearly all scenes but doesn\u0027t always get destroyed immediately on scene changes. I have an idea to adapt to that but it\u0027ll take some work.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E[WRN 18:32:35.917] [HighLogic]: =========================== Scene Change : From SPACECENTER to FLIGHT (Async) =====================\u003Cp\u003E[LOG 18:32:37.347] AddonLoader: Instantiating addon \u0027KFGUIManager\u0027 from assembly \u0027KF_plugin\u0027\u003C/p\u003E\u003Cp\u003E[WRN 18:32:38.452] ApplicationLauncher already exist, destroying this instance\u003C/p\u003E\u003Cp\u003E[LOG 18:32:38.464] AddonLoader: Instantiating addon \u0027NavWaypoint\u0027 from assembly \u0027KSP\u0027\u003C/p\u003E\u003Cp\u003E[LOG 18:32:38.468] AddonLoader: Instantiating addon \u0027KFGUIManager\u0027 from assembly \u0027KF_plugin\u0027\u003C/p\u003E\u003Cp\u003E[LOG 18:32:38.517] ------------------- initializing flight mode... ------------------\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, you are reading right. That\u0027s how broken it is. Also there could be a more fundamental error in Squad\u0027s code (why is the MonoBehavoir loaded twice?).\u003C/p\u003E\u003Cp\u003EAlso you get the NulRef in the method KerbalFoundries.KFPersistenceManager.ReadConfig(). I think it\u0027s related to the new DustColors.cfg which is in the other repo. Maybe you missed to pull it.\u003C/p\u003E\u003Cp\u003EBtw, I think it\u0027s wrong to read the .cfgs using ConfigNode.Load(). KSP should already read those .cfgs during startup thus we only have to get them through GameDatabase.Instance.GetConfigNodes(\u0022node_name\u0022).\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003EI stumbled upon the small tundra area near the KSC some time ago too. I\u0027m not sure why it\u0027s there. I found player speculations that it\u0027s either an artifact Squad don\u0027t know about or that it\u0027s intentionally placed there for not-so-good players to grab science during early career play.\u003C/p\u003E\u003Cp\u003EThen I heard of some players reporting the same\u0027s happening on Minmus. So I believe they are artifacts.\u003C/p\u003E\u003Cp\u003EI don\u0027t feel like correcting errors Squad made. I could also be costly to fix that if we are able to get our hands on the biome maps data. On slower computers the game might stop for a second or two when processing all the maps.\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003EAnd now something completely different (not really ^^):\u003C/p\u003E\u003Cp\u003EIn which scenes you want to see the app icon? And what should be displayed when you click it in that scene?\u003C/p\u003E\u003Cp\u003ESo far I imagined this:\u003C/p\u003E\u003Cp\u003EFlight scene -\u0026gt; Enable dustFX \u0026amp; Enable dustFX camera\u003C/p\u003E\u003Cp\u003EEditor scene -\u0026gt; Enable part orientation markers\u003C/p\u003E\u003Cp\u003ESpace center scene -\u0026gt; all three toogles visible\u003C/p\u003E\u003Cp\u003Eall other scenes -\u0026gt; disable app icon\u003C/p\u003E\u003Cp\u003EWhat do you think?\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003E@lo-fi\u003C/p\u003E\u003Cp\u003EGreat! You made it work! Incredible! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere, cookies for you and Gaalidas\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://media.tumblr.com/tumblr_krmqfbCdeO1qa400q.jpg\u0022 alt=\u0022tumblr_krmqfbCdeO1qa400q.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll look into the exceptions you mentioned.\u003C/p\u003E\n"},{"CreatedByName":"Tyren","CreatedById":76757,"CreatedDateTime":"2015-07-15T12:33:43Z","Content":"\n\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E more gimmicks, you say? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-15T12:46:57Z","Content":"\n\u003Cp\u003EI see what you mean - that\u0027s not ideal! The Gui stuff seems to be behaving, but the icon is no longer present in the space centre (which may be deliberate?)... If you open it in flight, you can\u0027t then close it when back in the space centre, though. That list seems pretty sensible to me.\u003C/p\u003E\u003Cp\u003EI know almost nothing about the config node stuff, so I\u0027ll leave it to you guys. Agreed on the biome placements, that\u0027s a little out of our scope.\u003C/p\u003E\u003Cp\u003EAhhhhh, cookies!!!! Thanks, quite pleased about that. Though there\u0027s still the issue of what to do about orbits when the game is merrily going about its thing and the coupled vessels are nothing more than masses in orbit.\u003C/p\u003E\u003Cp\u003EI\u0027ll get back about the nullrefs from DustFX.. EDIT: Then they magically disappeared....\u003C/p\u003E\u003Cp\u003EGotta love a good gimmick \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T13:10:55Z\u0022 title=\u002207/15/2015 01:10  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xEvilReeperx","CreatedById":75857,"CreatedDateTime":"2015-07-15T13:16:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EThanks for the input. Just out of interest, how were you benchmarking? I set up using the stopwatch, but is there an easier method? Every frame is certainly too much. Or is there a better method in general? A few other mods - RPM, reflective windows etc. seem to use cameras to capture and apply somewhere, but is there just a price to pay for doing so no matter what you do?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame, StopWatch. Using a camera isn\u0027t what\u0027s expensive, it\u0027s the ReadPixels. You can have your camera send its output directly to a texture property on a material set up to use a custom shader that does whatever work you need and avoid that performance penalty. That\u0027s what those other mods do.\u003C/p\u003E\u003Cp\u003EI think the current solution is good enough for now though, aside from a little texture memory leak\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2015-07-15T13:36:35Z","Content":"\n\u003Cp\u003EAh, I see. I\u0027ll have a poke about and see what I can find in other mods - if nothing else it\u0027s always instructive.\u003C/p\u003E\u003Cp\u003EEdit: actually, something I struggled with on the camera, and related to your comment about the redundant allocations.. unless I destroyed the camera, KSP kept rendering the flight view through it. Which isn\u0027t massively helpful. I\u0027ll have to try and figure out why that kept happening.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T13:55:29Z\u0022 title=\u002207/15/2015 01:55  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by lo-fi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-15T14:04:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022*Aqua*\u0022 data-cite=\u0022*Aqua*\u0022\u003E\u003Cdiv\u003E@Gaalidas\u003Cp\u003EDid you change the KFGUIManager or KFPersistenceManager to run more than once? KFPersistenceManager only needs to do it\u0027s work once during startup.\u003C/p\u003E\u003Cp\u003EThe ApplicationLauncher has a broken life cycle system. It\u0027s present during nearly all scenes but doesn\u0027t always get destroyed immediately on scene changes. I have an idea to adapt to that but it\u0027ll take some work.\u003C/p\u003E\u003Cp\u003EYes, you are reading right. That\u0027s how broken it is. Also there could be a more fundamental error in Squad\u0027s code (why is the MonoBehavoir loaded twice?).\u003C/p\u003E\u003Cp\u003EAlso you get the NulRef in the method KerbalFoundries.KFPersistenceManager.ReadConfig(). I think it\u0027s related to the new DustColors.cfg which is in the other repo. Maybe you missed to pull it.\u003C/p\u003E\u003Cp\u003EBtw, I think it\u0027s wrong to read the .cfgs using ConfigNode.Load(). KSP should already read those .cfgs during startup thus we only have to get them through GameDatabase.Instance.GetConfigNodes(\u0022node_name\u0022).\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003EI stumbled upon the small tundra area near the KSC some time ago too. I\u0027m not sure why it\u0027s there. I found player speculations that it\u0027s either an artifact Squad don\u0027t know about or that it\u0027s intentionally placed there for not-so-good players to grab science during early career play.\u003C/p\u003E\u003Cp\u003EThen I heard of some players reporting the same\u0027s happening on Minmus. So I believe they are artifacts.\u003C/p\u003E\u003Cp\u003EI don\u0027t feel like correcting errors Squad made. I could also be costly to fix that if we are able to get our hands on the biome maps data. On slower computers the game might stop for a second or two when processing all the maps.\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003EAnd now something completely different (not really ^^):\u003C/p\u003E\u003Cp\u003EIn which scenes you want to see the app icon? And what should be displayed when you click it in that scene?\u003C/p\u003E\u003Cp\u003ESo far I imagined this:\u003C/p\u003E\u003Cp\u003EFlight scene -\u0026gt; Enable dustFX \u0026amp; Enable dustFX camera\u003C/p\u003E\u003Cp\u003EEditor scene -\u0026gt; Enable part orientation markers\u003C/p\u003E\u003Cp\u003ESpace center scene -\u0026gt; all three toogles visible\u003C/p\u003E\u003Cp\u003Eall other scenes -\u0026gt; disable app icon\u003C/p\u003E\u003Cp\u003EWhat do you think?\u003C/p\u003E\u003Cp\u003E---\u003C/p\u003E\u003Cp\u003E@lo-fi\u003C/p\u003E\u003Cp\u003EGreat! You made it work! Incredible! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere, cookies for you and Gaalidas\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://media.tumblr.com/tumblr_krmqfbCdeO1qa400q.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://media.tumblr.com/tumblr_krmqfbCdeO1qa400q.jpg\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EI\u0027ll look into the exceptions you mentioned.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd they say \u003Cem\u003EI\u003C/em\u003E have large postings. You have a ways to go yet before you can best me, Aqua, but you\u0027re well on your way.\u003C/p\u003E\u003Cp\u003ESo, I\u0027ve done some fiddling and I think I know why it\u0027s not showing up properly. First off, it seems the event for the application launcher being \u0022ready\u0022 only fires now between main menu and space center (as of 1.0) and the best way to check the ready state is using \u0022ApplicationLauncher.Ready\u0022 instead.\u003C/p\u003E\u003Cp\u003EAlso, I discovered that the button definition was set to be visible only in the flight scene. Messed up.\u003C/p\u003E\u003Cp\u003EBiome maps have been overridden before, and it wasn\u0027t all that costly really from what I could tell, but I wasn\u0027t a developer back then. Just a regular peon. A simple peasant. A wee underling... \u003C/p\u003E\u003Cp\u003EAs to the config node loading... I did that because it was the easiest way to then handle saving back to the file. I really would prefer if we simply grabbed the already-loaded information that the game grabs on its own. I simply couldn\u0027t wrap my brain around how to re-save that information without first loading it in the same way. Feel free to revamp it.\u003C/p\u003E\u003Cp\u003ESo, I wasn\u0027t going to have different GUIs in different scenes, but I suppose it would make the most sense to me if all the options were available in the space center, but only the editor specific options allowed in the editor itself. The arrows disappear in flight anyway, so no need to have that option there.\u003C/p\u003E\u003Cp\u003EAny other changes I\u0027ve made can be reverted if they weren\u0027t related to the problem I was having. I\u0027m just trying to get it to work correctly on my end. If I\u0027m not seeing an icon when I\u0027m trying to tell it to render one, I\u0027m going to start changing everything I see that \u003Cem\u003Ecould\u003C/em\u003E have anything to do with it. I\u0027m not \u003Cem\u003Enearly \u003C/em\u003Eeducated enough in C# to properly diagnose this stuff.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EEDIT: Then they magically disappeared....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt always works that way. Just when you start to narrow down what\u0027s going on, they disappear robbing you of the pleasure of squashing them. They\u0027ll reappear just when you think everything is going as it should.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xEvilReeperx\u0022 data-cite=\u0022xEvilReeperx\u0022\u003E\u003Cdiv\u003EI think the current solution is good enough for now though, aside from a little texture memory leak\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConsidering the extremely tiny resolution of an image we\u0027re capturing, and the fact that it\u0027s only reading the scenery layers, it\u0027s likely an extremely small cost overall. That is, until I try something really crazy like per-wheel cameras. \u003Cem\u003EThat\u003C/em\u003E might not go over too well.\u003C/p\u003E\u003Cp\u003EAs to all that talk about materials and shaders, I think I ran into that stuff when I was trying to see if I could get the TextureReplacer reflection module to use a different texture to define reflectivity instead of relying on the alpha layer of the part\u0027s diffuse texture, or at least use the inverse of what it currently uses instead, to make modification of textures easier to handle while still allowing reflectivity on parts where the reflective areas are not separate objects that could be targeted. In the end I gave up because of the custom shader stuff that I couldn\u0027t figure out. My goal was to do something similar to how KerbPaint (I miss that mod sometimes) had a bunch of extension-less files that were basically png masks that defined paintable regions, and what layer of paint would be used. These files had no extension in their file name, so the game would ignore them (since they served no purpose being loaded into the game\u0027s allocated memory) and KerbPaint would process them itself.\u003C/p\u003E\u003Cp\u003EI gave up pretty quickly. I don\u0027t speak \u0022shader\u0022 very well. In fact, not at all.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-07-15T14:21:43Z\u0022 title=\u002207/15/2015 02:21  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 15, 2015\u003C/time\u003E by Gaalidas\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-15T14:17:38Z","Content":"\n\u003Cp\u003ENow I\u0027m sure there\u0027s a fundamental bug in KSP. KFGUIManager instances do not get unloaded/destroyed on scene switch. The number of instances just keeps increasing. WTH? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EIs that why there\u0027s a memory leak between scene changes?\u003C/p\u003E\n"},{"CreatedByName":"V8jester","CreatedById":136093,"CreatedDateTime":"2015-07-15T14:24:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EThanks to a wildcard suggestion from V8Jester, I finally made some solid progress with this:\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/UwuiPtsmvW4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/UwuiPtsmvW4\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso a big thanks to Baha for showing me the way with the Burn Together code. Still a lot of work to do on that before it gets released into the wild, but I\u0027m no longer terminally stuck! Thanks to Gaalidas and *Aqua* for dealing with other bits while I\u0027m off playing with crazy stuff. More to come \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I\u0027d also like to see an end to the need for docking ports to tie rovers down for transport...\u003C/p\u003E\u003Cp\u003ESeeing some null refs by the way, guys. Mostly related to DustFX when the game is paused. I\u0027ll do some more investigation later and report back. I assume it\u0027s probably just some stuff that needs hooks into the OnPause and OnUnPause methods, so should be no big deal.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re giving me way more credit than I deserve. You and BD are the wizards here. I\u0027m glad it worked though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I knew there had to be a similarity there.\u003C/p\u003E\n"},{"CreatedByName":"*Aqua*","CreatedById":103926,"CreatedDateTime":"2015-07-15T14:44:32Z","Content":"\n\u003Cp\u003EI pushed out two commits. The app button should now only be displayed in editor, flight and space center scenes. Also the window is disabled on game scene switch. Furthermore the contents of the window change depending on the current game scene.\u003C/p\u003E\u003Cp\u003EI hope the changes works for everybody.\u003C/p\u003E\u003Cp\u003EWhat\u0027s left for the GUI is to change the window position and size depending on game scene and window contents. Gaalidas, do you want to do that?\u003C/p\u003E\n"},{"CreatedByName":"Gaalidas","CreatedById":111158,"CreatedDateTime":"2015-07-15T18:52:49Z","Content":"\n\u003Cp\u003EIsn\u0027t the size handled automatically now, or did you not get around to changing that? You seem to have a better hold on GUI layout stuff than I do. As for position, I\u0027ll do a bit more digging. I know that a GUI can be made to appear below/above (depending on scene) the button that calls it, but I have no idea how that\u0027s done just yet. In all, those are pretty unnecessary additions since, as long as the window opens within the user\u0027s screen space, I believe it is drag enabled and, since no information is really displayed in the window, we don\u0027t need it to stay open. One thing I\u0027d like to see is whenever the window is closed, either by scene change, save button, or re-clicking the button, that it commits the changes to file. Some testing needs to be done also to see if the parts will respond to changes such as disabling the global dust toggle. I have code in dustFX that changes the visible state of the context menu dust toggle (for per-part toggles) but I have no idea if the conditions for its visibility are checked per frame or some sort of heatbeat timer, or if it\u0027s only checked on the scene loading. The idea is to not allow the per-part toggle to show up if the global toggle is disabled. Ideally, I\u0027d love to have the button in the context menu be replaced with a textual field that displays something like \u0022Dust system disabled\u0022 when globally disabled.\u003C/p\u003E\u003Cp\u003EFirst, I\u0027ll grab those commits and see what\u0027s happened.\u003C/p\u003E\n"},{"CreatedByName":"Cyrious","CreatedById":146131,"CreatedDateTime":"2015-07-15T18:53:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EThanks to a wildcard suggestion from V8Jester, I finally made some solid progress with this:\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/UwuiPtsmvW4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/UwuiPtsmvW4\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso a big thanks to Baha for showing me the way with the Burn Together code. Still a lot of work to do on that before it gets released into the wild, but I\u0027m no longer terminally stuck! Thanks to Gaalidas and *Aqua* for dealing with other bits while I\u0027m off playing with crazy stuff. More to come \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I\u0027d also like to see an end to the need for docking ports to tie rovers down for transport...\u003C/p\u003E\u003Cp\u003ESeeing some null refs by the way, guys. Mostly related to DustFX when the game is paused. I\u0027ll do some more investigation later and report back. I assume it\u0027s probably just some stuff that needs hooks into the OnPause and OnUnPause methods, so should be no big deal.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAWESOME! Is this going to be a part of the main mod in terms of code (single DLL for all functions) or will it be split (DLL for the wheels, DLL for the hitch)?\u003C/p\u003E\n"},{"CreatedByName":"riocrokite","CreatedById":129319,"CreatedDateTime":"2015-07-15T18:59:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lo-fi\u0022 data-cite=\u0022lo-fi\u0022\u003E\u003Cdiv\u003EThanks to a wildcard suggestion from V8Jester, I finally made some solid progress with this:\u003Cp\u003E\u003Ca href=\u0022https://youtu.be/UwuiPtsmvW4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://youtu.be/UwuiPtsmvW4\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso a big thanks to Baha for showing me the way with the Burn Together code. Still a lot of work to do on that before it gets released into the wild, but I\u0027m no longer terminally stuck! Thanks to Gaalidas and *Aqua* for dealing with other bits while I\u0027m off playing with crazy stuff. More to come \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E I\u0027d also like to see an end to the need for docking ports to tie rovers down for transport...\u003C/p\u003E\u003Cp\u003ESeeing some null refs by the way, guys. Mostly related to DustFX when the game is paused. I\u0027ll do some more investigation later and report back. I assume it\u0027s probably just some stuff that needs hooks into the OnPause and OnUnPause methods, so should be no big deal.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESuperb stuff guys \\o/ congrats \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}