{"TopicId":78798,"ForumId":36,"TopicTitle":"[24.2] Karbonite Ongoing Dev and Discussion","CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-07-21T12:34:45Z","PageNum":84,"Articles":[{"CreatedByName":"J3ansley","CreatedById":113709,"CreatedDateTime":"2014-10-01T00:19:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EOne is consumables - basically drill bits and such - coupled with thresholds on what an extractor can dig out.\u003Cp\u003ESmall drills can only drill on the heavier concentrations, but are more consumable efficient.\u003C/p\u003E\u003Cp\u003ELarger drills can drill almost anywhere, but are less consumable efficient.\u003C/p\u003E\u003Cp\u003ESecond is mechanics for \u0027prospecting\u0027 where you have to land and extract samples to unlock portions of the resource map (which can then be viewed from orbit).\u003C/p\u003E\u003Cp\u003EA subset (third mechanic) is the idea of resource depletion and amplification. Heavy drills will tend to reduce efficacy over time (but never to zero) in a prospecting area. Additional exploration and deep drilling can tap (increase) the abundance in a prospecting area.\u003C/p\u003E\u003Cp\u003EThoughts?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. I don\u0027t mind consumables if it\u0027s say ReplacementParts or something that you already have. I\u0027m pretty close to the resource max for my play interests. When I click on an OKS part the infobar already goes down past my screen and on some I can\u0027t see half the box.Too bad we can\u0027t move those infoboxes around. With that said, consumables, nor the difference with small vs large drills will add any enjoyment to my play. I\u0027ll add more X consumable which will make me take more fuel and that\u0027s about it. I guess with the small drill limitation, I\u0027d only drop a rover down on the heavier concentration parts and not bother with exploring outside of that area. \u003C/p\u003E\u003Cp\u003E2. Sounds promising I guess, but I am not at the level of play where I do much rovering around. So, hopefully I will still be able to get karbonite without this. I tried the K\u002B surveying and it just increased this time sink of a game by a magnitude which means I don\u0027t use K\u002B at all yet.\u003C/p\u003E\u003Cp\u003E3. What exactly do you mean by \u0022Additional exploration and deep drilling\u0022? I think this would force me to placing a singular base with a couple mobile miners spread out and then using the logistics hub more. Maybe if there was a tier\u0027d system with your drills. If the drill had say 100 Basic Machinery or something then it can drill this much area. After the area is consumed maybe you could \u0022upgrade\u0022 it with Advanced Machinery and then Spec Machinery too? Maybe have it set up so a straight vertical drill would not need anything, but if you wanted to increase your area of drill then you need to consume Robotics and Adv Machinery. In order to increase the rate (say sim Frakking) then you need to consume Robotics, Spec Machinery and water.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-10-01T01:24:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022endl\u0022 data-cite=\u0022endl\u0022\u003E\u003Cdiv\u003Eyour proposal sounds awfully similar to armor repair, these are traditionally there for the purpose of slowing down player progress to end game as they are resource sinks. for a game like kerbal thats basically a design space for the imagination i dont think this mechanic is warented unless you wish to limit it to something like career mode. i like the idea of prospecting but thats about it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDifferent mechanic. The goal is not to slow folks down, but rather to differentiate between hitting a high concentration spot vs a low concentration one.\u003C/p\u003E\u003Cp\u003EGiven that energy is essentially free, as is time, both are ineffective levers (no matter how high the power draw or how slow the rate, it\u0027s trivial to overcome). So the intent is to add another lever of cost - where there\u0027s a point that digging through 1,000,000 tons of soil for 100 years to get one unit of Karbonite does not make financial sense.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022J3ansley\u0022 data-cite=\u0022J3ansley\u0022\u003E\u003Cdiv\u003E1. I don\u0027t mind consumables if it\u0027s say ReplacementParts or something that you already have. I\u0027m pretty close to the resource max for my play interests. When I click on an OKS part the infobar already goes down past my screen and on some I can\u0027t see half the box.Too bad we can\u0027t move those infoboxes around. With that said, consumables, nor the difference with small vs large drills will add any enjoyment to my play. I\u0027ll add more X consumable which will make me take more fuel and that\u0027s about it. I guess with the small drill limitation, I\u0027d only drop a rover down on the heavier concentration parts and not bother with exploring outside of that area. \u003Cp\u003E2. Sounds promising I guess, but I am not at the level of play where I do much rovering around. So, hopefully I will still be able to get karbonite without this. I tried the K\u002B surveying and it just increased this time sink of a game by a magnitude which means I don\u0027t use K\u002B at all yet.\u003C/p\u003E\u003Cp\u003E3. What exactly do you mean by \u0022Additional exploration and deep drilling\u0022? I think this would force me to placing a singular base with a couple mobile miners spread out and then using the logistics hub more. Maybe if there was a tier\u0027d system with your drills. If the drill had say 100 Basic Machinery or something then it can drill this much area. After the area is consumed maybe you could \u0022upgrade\u0022 it with Advanced Machinery and then Spec Machinery too? Maybe have it set up so a straight vertical drill would not need anything, but if you wanted to increase your area of drill then you need to consume Robotics and Adv Machinery. In order to increase the rate (say sim Frakking) then you need to consume Robotics, Spec Machinery and water.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUse the middle mouse button to move the camera and see longer boxes btw \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Which specific boxes are problematic? I\u0027ve been on a crusade to reduce the more complex ones.\u003C/p\u003E\u003Cp\u003EAnything in this discussion would be an extension for folks into exploring and mining and such (much as MKS is not for everyone unless you really dig base building).\u003C/p\u003E\u003Cp\u003ERE item 3 - basically a mechanic where there\u0027s variance in concentrations directly affected by the player, both in a positive and negative light. Strip mine an area, it becomes harder to mine (hence the tie in to consumables). Invest in infrastructure and increase output (and reduce the consumables lever).\u003C/p\u003E\n"},{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2014-10-01T03:18:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EDifferent mechanic. The goal is not to slow folks down, but rather to differentiate between hitting a high concentration spot vs a low concentration one.\u003Cp\u003EGiven that energy is essentially free, as is time, both are ineffective levers (no matter how high the power draw or how slow the rate, it\u0027s trivial to overcome). So the intent is to add another lever of cost - where there\u0027s a point that digging through 1,000,000 tons of soil for 100 years to get one unit of Karbonite does not make financial sense.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Enot really they are both progression hurdles, i just dont see it adding much value to something like sandbox. for career mode its definitely cool\u003C/p\u003E\n"},{"CreatedByName":"J3ansley","CreatedById":113709,"CreatedDateTime":"2014-10-01T06:38:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EUse the middle mouse button to move the camera and see longer boxes btw \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Which specific boxes are problematic? I\u0027ve been on a crusade to reduce the more complex ones.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHoly moses that trick is amazing. I\u0027m running TAC LS and EL so I think the boxes are longer than your normal run. But for me the longest box is the Assembly Plant. It has 4 lines per MEP output along with the normal \u0022Control From Here\u0022 and RT2 SPU lines.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-10-01T08:24:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022endl\u0022 data-cite=\u0022endl\u0022\u003E\u003Cdiv\u003Enot really they are both progression hurdles, i just dont see it adding much value to something like sandbox. for career mode its definitely cool\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ll agree to disagree on game design then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022J3ansley\u0022 data-cite=\u0022J3ansley\u0022\u003E\u003Cdiv\u003EHoly moses that trick is amazing. I\u0027m running TAC LS and EL so I think the boxes are longer than your normal run. But for me the longest box is the Assembly Plant. It has 4 lines per MEP output along with the normal \u0022Control From Here\u0022 and RT2 SPU lines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah this is why I tried to keep most down to three or less.\u003C/p\u003E\n"},{"CreatedByName":"J3ansley","CreatedById":113709,"CreatedDateTime":"2014-10-01T09:02:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EDifferent mechanic. The goal is not to slow folks down, but rather to differentiate between hitting a high concentration spot vs a low concentration one.\u003Cp\u003EAnything in this discussion would be an extension for folks into exploring and mining and such (much as MKS is not for everyone unless you really dig base building).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAre you saying this would be an extension of OKS/MKS like Karbonite \u002B is to normal Karbonite? If so, then my vote is absolutely yes.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-10-01T09:08:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022J3ansley\u0022 data-cite=\u0022J3ansley\u0022\u003E\u003Cdiv\u003EAre you saying this would be an extension of OKS/MKS like Karbonite \u002B is to normal Karbonite? If so, then my vote is absolutely yes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt would be an extension of sorts, yes. How I tie in that extension depends. I do not want to force people to use MKS/OKS and it\u0027s infrastructure, so your flip side is shipping in the consumables. Granted, they will be light enough that it\u0027s not much of an issue, but where it does gently nudge people to be a bit more selective and not just land on the first spot they see and start digging.\u003C/p\u003E\n"},{"CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2014-10-01T09:30:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EIt would be an extension of sorts, yes. How I tie in that extension depends. I do not want to force people to use MKS/OKS and it\u0027s infrastructure, so your flip side is shipping in the consumables. Granted, they will be light enough that it\u0027s not much of an issue, but where it does gently nudge people to be a bit more selective and not just land on the first spot they see and start digging.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy thought is the \u0022cheaty\u0022 aspect, and I exploit it like crazy, is that you can land just about everywhere mine karbonite and reliably make fuel fairly quickly in lander sized amounts. Choosing a landing site requiring re-fueling on the surface gets more interesting if it would take a year to dig up enough at site A, but at site B it will take 30 minutes.\u003C/p\u003E\u003Cp\u003ESo rate of extraction probably needs to be much lower and the concentrations generally lowered, except for some really hot spots. In those cases I think the fields should be a little bigger so a super precision landing isn\u0027t necessary.\u003C/p\u003E\u003Cp\u003EI\u0027m not a super huge fan of consumable parts like drill bits. Maybe some sort of re-fit kit for certain substrates? I\u0027m thinking like the Cacteye Telescope mod. You could use KAS to pop in a drill module or something, then maybe some kind of mechanic so you don\u0027t burn it out. If you\u0027re careful you don\u0027t have to worry about it though. That would require scouting and prospecting to know what bit to put in (reason to do EVA!), but if you brought a sufficient enough tool kit (weight penalty of course) you could do what I am now - but slower, and you\u0027d need to think about what you\u0027re doing after you land, and there would be weight penalty.\u003C/p\u003E\u003Cp\u003EThen for bases you\u0027d know what you\u0027re doing so you could bring a specialized drill that wouldn\u0027t be re-fitable and that would have certain advantages other than not needing multiple kinds of bits.\u003C/p\u003E\u003Cp\u003EJust some ideas.\u003C/p\u003E\n"},{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2014-10-01T16:45:43Z","Content":"\n\u003Cp\u003Ei was thinking about the direction you want to take so that mining isnt so brain dead, and i have a counter proposal what if instead of consumables you create an enhancement system. where your mining efficiency starts off low but by interfacing components you can increase it.\u003C/p\u003E\u003Cp\u003Efor example you have a deploy able that attaches like KAS from a 2ndary site that does stuff like \u0022filters ore\u0022. it would make the deploy able large and expand from a radial mounting so it doesnt make sense to slap it onto the same mission vehicle due to the stability problems it would cause but rather design one thats dedicated also it should require a kerbal to interface the two modules.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-01T17:23:18Z\u0022 title=\u002210/01/2014 05:23  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 1, 2014\u003C/time\u003E by endl\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2014-10-01T18:26:44Z","Content":"\n\u003Cp\u003EI like the idea of different kits for different circumstances. Do an initial site survey to determine concentration and local strata and then develop a drill kit to pierce said strata. Maybe even swap kit as you hit different layers until the bore hole is at the lode, whereupon you swap to extraction.\u003C/p\u003E\n"},{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2014-10-01T19:34:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022forsaken1111\u0022 data-cite=\u0022forsaken1111\u0022\u003E\u003Cdiv\u003EI like the idea of different kits for different circumstances. Do an initial site survey to determine concentration and local strata and then develop a drill kit to pierce said strata. Maybe even swap kit as you hit different layers until the bore hole is at the lode, whereupon you swap to extraction.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei love the idea for drill swapping to get deeper/better resource efficiency.\u003C/p\u003E\u003Cp\u003Eit totally hits all the requirements.\u003C/p\u003E\u003Cp\u003E1. not brain dead\u003C/p\u003E\u003Cp\u003E2. requires EVA\u003C/p\u003E\u003Cp\u003E3. cant just be launched with all the parts.\u003C/p\u003E\n"},{"CreatedByName":"gigaboom2","CreatedById":112218,"CreatedDateTime":"2014-10-02T19:31:07Z","Content":"\n\u003Cp\u003EI have a request. I noticed that the drill does not need to be in the ground to remove karbonite. You van have it sticking straight up and still collect it. Could you make it so that the drill needs to be underground to work?\u003C/p\u003E\n"},{"CreatedByName":"forsaken1111","CreatedById":2703,"CreatedDateTime":"2014-10-02T19:41:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gigaboom2\u0022 data-cite=\u0022gigaboom2\u0022\u003E\u003Cdiv\u003EI have a request. I noticed that the drill does not need to be in the ground to remove karbonite. You van have it sticking straight up and still collect it. Could you make it so that the drill needs to be underground to work?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe right now it just checks to see if the vessel is landed. Having it actually check for a terrain collision will be interesting, if its even possible since I don\u0027t think the drill bit has a collider at all.\u003C/p\u003E\n"},{"CreatedByName":"nli2work","CreatedById":106805,"CreatedDateTime":"2014-10-02T19:53:14Z","Content":"\n\u003Cp\u003Eyea no collider on the drill tips or you won\u0027t be able to get into the ground at all. some kind of raycast check is probably the easiest way to check whether the drill is actually pointed at the ground or sky.\u003C/p\u003E\n"},{"CreatedByName":"gigaboom2","CreatedById":112218,"CreatedDateTime":"2014-10-02T20:17:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nli2work\u0022 data-cite=\u0022nli2work\u0022\u003E\u003Cdiv\u003Eyea no collider on the drill tips or you won\u0027t be able to get into the ground at all. some kind of raycast check is probably the easiest way to check whether the drill is actually pointed at the ground or sky.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is possible, the kethane drills need to be submerged. (I have since quit kethane and have become a loyal karbonite-ist)\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-10-02T20:54:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gigaboom2\u0022 data-cite=\u0022gigaboom2\u0022\u003E\u003Cdiv\u003EIt is possible, the kethane drills need to be submerged. (I have since quit kethane and have become a loyal karbonite-ist)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, it was one of the features cut when making this project launch in two weeks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EA Kethane-style transform check would work, but would necessitate retro-fixing all of the drills and doing it in a way that did not hose people over \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"smart013","CreatedById":106088,"CreatedDateTime":"2014-10-03T04:34:07Z","Content":"\n\u003Cp\u003ESorry for repeating a question thats posted before, but since then there were a lot of changes. So, right now, does the collector get karbonite from anywhere around duna? In orbit, not in the atmosphere. Af if it is still working as intended that there should be none, where and how can i change it in the configs so that the collector can collect (maybe small) amounts of karbonite?\u003C/p\u003E\u003Cp\u003ERight now i play with the actual version of karbonite, ors, orsx, kspi (not lite), and everything besides this works great. No k\u002B installed, because i dont want to lose the option to convert karbonorum for my jump beacons\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-10-03T04:38:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smart013\u0022 data-cite=\u0022smart013\u0022\u003E\u003Cdiv\u003ESorry for repeating a question thats posted before, but since then there were a lot of changes. So, right now, does the collector get karbonite from anywhere around duna? In orbit, not in the atmosphere. Af if it is still working as intended that there should be none, where and how can i change it in the configs so that the collector can collect (maybe small) amounts of karbonite?\u003Cp\u003ERight now i play with the actual version of karbonite, ors, orsx, kspi (not lite), and everything besides this works great. No k\u002B installed, because i dont want to lose the option to convert karbonorum for my jump beacons\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDuna is surface only. You could create a new atmospheric config (don\u0027t edit the ones we already have or they will get stomped over) that adds karbonite to duna\u0027s atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2014-10-03T05:39:23Z","Content":"\n\u003Cp\u003Eis there a resource i can look at for karbonite levels/rates. im trying to figure out why im getting so little fuel from my kerbin orbital collector. do resources dry up atm?\u003C/p\u003E\n"},{"CreatedByName":"smart013","CreatedById":106088,"CreatedDateTime":"2014-10-03T06:43:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EDuna is surface only. You could create a new atmospheric config (don\u0027t edit the ones we already have or they will get stomped over) that adds karbonite to duna\u0027s atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry again, but it tried to make the necessary changes in karbonite and /or CRP Pack, ORS / ORSX, community ressource pack but failed miserably. Whatever i did i could toggle karbonite for collecting, but nothing gets collected in the process. Any help from anyone would be highly appreciated. \u003C/p\u003E\u003Cp\u003EOn a personal note - if any planet in the kerbol system should have karbonite for athmospheric collection imho its duna. I understand your intention to make a lot of things in and around karbonite (imho) artificially hard and complicated to prevent to get labelled \u0022too easy\u0022 or \u0022cheating\u0022 by the hardcore crowd, but i as a humble player with only challenging fun on his mind dont like too many restrictions .)\u003C/p\u003E\u003Cp\u003ENeedless to say that i really admire your work, these are just my 2c worth of critique.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-10-03T10:02:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smart013\u0022 data-cite=\u0022smart013\u0022\u003E\u003Cdiv\u003ESorry again, but it tried to make the necessary changes in karbonite and /or CRP Pack, ORS / ORSX, community ressource pack but failed miserably. Whatever i did i could toggle karbonite for collecting, but nothing gets collected in the process. Any help from anyone would be highly appreciated. \u003Cp\u003EOn a personal note - if any planet in the kerbol system should have karbonite for athmospheric collection imho its duna. I understand your intention to make a lot of things in and around karbonite (imho) artificially hard and complicated to prevent to get labelled \u0022too easy\u0022 or \u0022cheating\u0022 by the hardcore crowd, but i as a humble player with only challenging fun on his mind dont like too many restrictions .)\u003C/p\u003E\u003Cp\u003ENeedless to say that i really admire your work, these are just my 2c worth of critique.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy Duna? Also what Karbonite version? And are you using a particle collector and an atmospheric scopp? \u003C/p\u003E\u003Cp\u003EAnd I\u0027d say less about being \u0027hard\u0027 and more about having some variety \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2014-10-03T22:15:15Z","Content":"\n\u003Cp\u003Eare there any additional \u0022rules\u0022 to orbital collection for kerbin besides being at 73km? does it matter if your using the regular orbital collector or the advanced one?\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-10-03T23:17:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022endl\u0022 data-cite=\u0022endl\u0022\u003E\u003Cdiv\u003Eare there any additional \u0022rules\u0022 to orbital collection for kerbin besides being at 73km? does it matter if your using the regular orbital collector or the advanced one?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECollection range is max atmospheric height to max atmo height \u002B 10%, with an added bonus in the config file that the larger collector from K\u002B has.\u003C/p\u003E\n"},{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2014-10-04T00:20:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003ECollection range is max atmospheric height to max atmo height \u002B 10%, with an added bonus in the config file that the larger collector from K\u002B has.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT:\u003C/strong\u003E ok i figured out whats going on its the conversion rates, the build up is so slow it looks like its doing nothing because it instantly converts whatever its trying to make but its not enough for the value to actually be visable, even at higher time warp it still looks like its doing nothing.\u003C/p\u003E\u003Cp\u003Ecan i make a suggestion for better clarity, can you leave the collection rate the same for karbonite but change the conversion rate so that it doesn\u0027t use the karbonite until it can make 1 useable unit of whatever this would help trouble shooting design problems much better.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-04T03:25:29Z\u0022 title=\u002210/04/2014 03:25  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 4, 2014\u003C/time\u003E by endl\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2014-10-05T06:06:14Z","Content":"\n\u003Cp\u003ERoverDude can you roll into Karbonite your mini-drill? Karbonite really should have as default parts for all standard scale sizes.\u003C/p\u003E\n"}]}