{"TopicId":79536,"ForumId":36,"TopicTitle":"[Early development, 0.24] Kopernicus Planetary System Modifier","CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-25T22:31:54Z","PageNum":1,"Articles":[{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-25T22:31:54Z","Content":"\n\u003Cp\u003EIn response to the license terms that are preventing community maintenance of the existing planet creator mod (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65401-WIP-PlanetFactory-CE/page75\u0022 rel=\u0022external nofollow\u0022\u003Ediscussed here\u003C/a\u003E), I\u0027ve started working on a replacement mod for KSP. I am interested in community input about what people desire in such a mod.\u003C/p\u003E\u003Cp\u003EPlanned features:\u003C/p\u003E\u003Cp\u003E - Free software (LGPL) license\u003C/p\u003E\u003Cp\u003E - Well-documented code\u003C/p\u003E\u003Cp\u003E - Create the system de novo, rather than be based on copying stock planets.\u003C/p\u003E\u003Cp\u003E - Particular attention given to supporting the Sol system.\u003C/p\u003E\u003Cp\u003ENot part of the scope of this project:\u003C/p\u003E\u003Cp\u003E - Extensive new planets created by me. I might create some kind of example planetary system, but it will not be very sophisticated or detailed.\u003C/p\u003E\u003Cp\u003E - Any in-game interface other than possibly selection of which system to use.\u003C/p\u003E\u003Cp\u003EThanks to aftokinito, for technical input, and metaphor, for suggesting the name \u0022Kopernicus.\u0022\u003C/p\u003E\u003Cp\u003EAt this point, I haven\u0027t done much, although I do have code for a plugin now that executes just before the default (i.e. Kerbol) system is spawned, and should be able to insert its own planetary system instead and have KSP spawn that one through the same means it would normally use to spawn the default system. (Which is, I think, the essential proof of concept for aftokinito\u0027s plan described in the other thread.)\u003C/p\u003E\u003Cp\u003EGitHub link, for the adventurous: \u003Ca href=\u0022https://github.com/BryceSchroeder/Kopernicus\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/BryceSchroeder/Kopernicus\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote that this mod is NOT COMPLETE, even in a beta state; it currently just adds one planet. The released version will allow essentially arbitrary planets to be added. See the readme file for details.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-05T20:10:35Z\u0022 title=\u002208/05/2014 08:10  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 5, 2014\u003C/time\u003E by BryceSchroeder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-07-25T22:35:48Z","Content":"\n\u003Cp\u003EI\u0027ve never used PF. Are you talking about procedural generation of planets?\u003C/p\u003E\n"},{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-25T22:38:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EI\u0027ve never used PF. Are you talking about procedural generation of planets?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, although that is a really cool idea (and I will try not to do things that would preclude the use of this project as a basis for such a mod).\u003C/p\u003E\u003Cp\u003EThis is intended as an open-source replacement for PlanetFactory, with a specific emphasis on supporting the needs of realism mods that replace the Kerbol system with the Sol system. (I suppose that might include procedurally generated microterrain, but first things first.)\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-07-26T02:37:39Z","Content":"\n\u003Cp\u003ENow this definitely has my interest \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-26T04:05:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003ENow this definitely has my interest \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you have any specific requests or suggestions for supporting RealSolarSystem? I used to use RSS with a configuration file that also made use of the PlanetFactory planets, but what I\u0027d really like to see, of course, is something with all major moons and dwarf planets supported, not just a small selection. I don\u0027t yet know how feasible that is, or if KSP necessarily loads all the planet data at once (in which case the answer is probably \u0022not very feasible,\u0022 at least without overcoming that first.)\u003C/p\u003E\n"},{"CreatedByName":"Avalon304","CreatedById":68304,"CreatedDateTime":"2014-07-26T04:11:05Z","Content":"\n\u003Cp\u003EWill this also support StarSystems?\u003C/p\u003E\n"},{"CreatedByName":"tygoo7","CreatedById":57345,"CreatedDateTime":"2014-07-26T04:17:25Z","Content":"\n\u003Cp\u003EVery nice idea! I look forward to seeing where this mod goes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-26T04:35:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avalon304\u0022 data-cite=\u0022Avalon304\u0022\u003E\u003Cdiv\u003EWill this also support StarSystems?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see why it wouldn\u0027t support this in the basic sense of having multiple stars orbiting, say, a black hole, and each in turn orbited by a planetary system, but I have no specific plans to do the other things that would be properly necessary to support this (deal with solar panels correctly, for example.) That said, it will be open source, and I wouldn\u0027t refuse a high-quality contributed patch adding this functionality.\u003C/p\u003E\u003Cp\u003EThanks for your encouragement.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-07-26T07:18:22Z","Content":"\n\u003Cp\u003EThis is a dawn of a new age in KSP modding community \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, everyone now finally realize license is a two sides coin and the \u0022evil\u0022 one can be really, really a curse !\u003C/p\u003E\u003Cp\u003ESo, you\u0027re plan looks great and I really hope you\u0027ll not fall into the same pit and clearly state people can do almost what they want just in case you left one day leaving a lot\u0027s of users stuck with a license terms which prevent them to improve or even just upload your work elsewhere (as spacesport was deleted, there is no insurance the curse website will last forever).\u003C/p\u003E\u003Cp\u003EYour planned feature doesn\u0027t include a user-friendly UI, hope you\u0027ll make something a lot more better than mere text editing like PF CE \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-26T13:34:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Eeveryone now finally realize license is a two sides coin and the \u0022evil\u0022 one can be really, really a curse\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I think many people, especially people coming mainly from the Windows world, \u003Ca href=\u0022http://linuxmafia.com/faq/Licensing_and_Law/forking.html\u0022 rel=\u0022external nofollow\u0022\u003Edo not understand how forking works in practice\u003C/a\u003E and in particular how rare it is. As for me, well, I\u0027m only doing this because I need a mod that does this... so I really have no problem with not having tight control. I\u0027m quite interested in collaborators. I\u0027ll be setting up a repository for the source, either when it comes time to release or when someone seriously wants to collaborate.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E Your planned feature doesn\u0027t include a user-friendly UI, hope you\u0027ll make something a lot more better than mere text editing like PF CE . \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have no plans to have anything other than text-editing as a UI, but as with stars mentioned above, I would be happy to accept a patch in the future which added that.\u003C/p\u003E\u003Cp\u003EBasically, I\u0027m very comfortable with editing text files, as are most current modders -- but there\u0027s a definite selection effect there; presumably some people don\u0027t create mods because of the text-file editing involved. So this would be a good feature - just not one I\u0027m personally highly motivated to prioritize. Another way of doing this would be to make a cross-platform GUI program running external to KSP that can generate the requisite text configuration files for a planet mod (using this or some other planet replacer mod) based on the user\u0027s interaction with the program.\u003C/p\u003E\n"},{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-26T14:53:37Z","Content":"\n\u003Cp\u003EAs of now I have succeeded in creating a new PSystem object, however I have not yet meaningfully tested it. (I know it worked only because I replaced the Sun with Kerbin, a decidedly ironic test in light of the name of this plugin, and achieved interesting results such as asteroids orbiting Kerbin and perpetual darkness o\u0027er the land.)\u003C/p\u003E\n"},{"CreatedByName":"aftokinito","CreatedById":66811,"CreatedDateTime":"2014-07-26T15:17:08Z","Content":"\n\u003Cp\u003ESo tell me, are you going to use the proper way I explained at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65401-WIP-PlanetFactory-CE?p=1294503\u0026amp;viewfull=1#post1294503\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/65401-WIP-PlanetFactory-CE?p=1294503\u0026amp;viewfull=1#post1294503\u003C/a\u003E or are just going to instantiate like Krag, with all the problems that implies?\u003C/p\u003E\n"},{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-26T15:21:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022aftokinito\u0022 data-cite=\u0022aftokinito\u0022\u003E\u003Cdiv\u003ESo tell me, are you going to use the proper way I explained at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65401-WIP-PlanetFactory-CE?p=1294503\u0026amp;viewfull=1#post1294503\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/65401-WIP-PlanetFactory-CE?p=1294503\u0026amp;viewfull=1#post1294503\u003C/a\u003E or are just going to instantiate like Krag, with all the problems that implies?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m already creating my own PSystem, but, presently lacking any infrastructure for creating or loading planets, I just rearranged the stock ones. I\u0027m working on creating PSystemBody objects now and the goal is to create and arrange the celestial objects \u003Cem\u003Ede novo\u003C/em\u003E from a configuration file, rather than duplicating and modifying stock planets. \u003C/p\u003E\u003Cp\u003EIn any case, the hook I am using is the one you suggested - Kopernicus replaces PSystemManager.systemPrefab before KSP uses PSystemManager.systemPrefab; KSP does all the spawning of planets. I agree that this seems like the best approach and seems less likely to be disturbed by changes to KSP. (By not having as much redundant code.)\u003C/p\u003E\n"},{"CreatedByName":"aftokinito","CreatedById":66811,"CreatedDateTime":"2014-07-26T15:35:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BryceSchroeder\u0022 data-cite=\u0022BryceSchroeder\u0022\u003E\u003Cdiv\u003EI\u0027m already creating my own PSystem, but, presently lacking any infrastructure for creating or loading planets, I just rearranged the stock ones. I\u0027m working on creating PSystemBody objects now and the goal is to create and arrange the celestial objects \u003Cem\u003Ede novo\u003C/em\u003E from a configuration file, rather than duplicating and modifying stock planets. \u003Cp\u003EIn any case, the hook I am using is the one you suggested - Kopernicus replaces PSystemManager.systemPrefab before KSP uses PSystemManager.systemPrefab; KSP does all the spawning of planets. I agree that this seems like the best approach and seems less likely to be disturbed by changes to KSP. (By not having as much redundant code.)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn that case, you might want to work with OvenProofMars (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86999-0-24-StarSystems-v0-2/page30\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/86999-0-24-StarSystems-v0-2/page30\u003C/a\u003E) as he was also going to use the method I explained.\u003C/p\u003E\u003Cp\u003EFeel free to PM me if you need assitance with anything, I\u0027ve been working with planets for almost a year but I refused to release anything by myself anymore after the community accused me of stealing Krag\u0027s code.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-07-26T19:44:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BryceSchroeder\u0022 data-cite=\u0022BryceSchroeder\u0022\u003E\u003Cdiv\u003EDo you have any specific requests or suggestions for supporting RealSolarSystem? I used to use RSS with a configuration file that also made use of the PlanetFactory planets, but what I\u0027d really like to see, of course, is something with all major moons and dwarf planets supported, not just a small selection. I don\u0027t yet know how feasible that is, or if KSP necessarily loads all the planet data at once (in which case the answer is probably \u0022not very feasible,\u0022 at least without overcoming that first.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eaftokinito would know more, I think, but my understanding is the planets themselves don\u0027t have much overhead. What actually matters, in adding new planets, is the greater texture memory usage, since KSP loads all textures at startup. Essentially, it would be worth adding a \u0022Load on Demand\u0022 for planet textures as well as part textures, so placeholder 32x32 textures are used until you can actually see the planet.\u003C/p\u003E\u003Cp\u003EMight do the same for meshes, but might not; even 32k faces is not a lot for a modern GPU to toss around.\u003C/p\u003E\u003Cp\u003EWhat\u0027s expensive (in RAM and cycles) is PQS, but they do thankfully get disabled for all but the active body, now.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-26T19:46:35Z\u0022 title=\u002207/26/2014 07:46  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 26, 2014\u003C/time\u003E by NathanKell\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-26T21:09:21Z","Content":"\n\u003Cp\u003EThanks for the info.\u003C/p\u003E\u003Cp\u003EThere is a git repository now: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/BryceSchroeder/Kopernicus\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/BryceSchroeder/Kopernicus\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENOTE: This currently does nothing useful for the non-developer user, I\u0027m just pointing out the existence of the repository here for those who may be interested in following this as it progresses.\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-07-26T21:25:03Z","Content":"\n\u003Cp\u003EOh cool! Definitely will check it out. Probably in more ways than one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"aftokinito","CreatedById":66811,"CreatedDateTime":"2014-07-26T23:43:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BryceSchroeder\u0022 data-cite=\u0022BryceSchroeder\u0022\u003E\u003Cdiv\u003EThanks for the info.\u003Cp\u003EThere is a git repository now: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://github.com/BryceSchroeder/Kopernicus\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/BryceSchroeder/Kopernicus\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENOTE: This currently does nothing useful for the non-developer user, I\u0027m just pointing out the existence of the repository here for those who may be interested in following this as it progresses.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have not extensively checked the source but the method seems to be correctly implemented.\u003C/p\u003E\u003Cp\u003ENow all you have to do is create new PSystemBodys and add them to the PSystem using the PSystem.Add(PSystemBody body) method.\u003C/p\u003E\u003Cp\u003EThis is the hard part (well not hard but lengthy) and it is the reason why Squad does not add 3-4 planets each update.\u003C/p\u003E\u003Cp\u003EMaking planets from scratch takes time because you have to add all the PQSMods and components manually one by one instead of instantiating a similar object and just changing a few parameters and the textures.\u003C/p\u003E\n"},{"CreatedByName":"KCreator","CreatedById":95721,"CreatedDateTime":"2014-07-27T00:39:18Z","Content":"\n\u003Cp\u003EImpressive work. This should prove to be a powerful API for planet creation. Nice job on figuring out PSystem and its helper classes.\u003C/p\u003E\u003Cp\u003EI will help in any way I can, for instance: providing some of my research, and hierarchy dumps. If you would like.\u003C/p\u003E\u003Cp\u003EFeel free to use my code as utils. I wrote functions to create and load PQSMods from a file, that would save you time writing your own.\u003C/p\u003E\n"},{"CreatedByName":"BryceSchroeder","CreatedById":74203,"CreatedDateTime":"2014-07-27T02:28:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022aftokinito\u0022 data-cite=\u0022aftokinito\u0022\u003E\u003Cdiv\u003Eyou have to add all the PQSMods and components manually one by one instead of instantiating a similar object and just changing a few parameters and the textures. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the long term solution to that is something along the lines of letting the planet author define the broad strokes (mountains and oceans, biomes, etc) and then letting them specify parameters for procedurally generated local terrain features (i.e. features on the order of 100m and smaller.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E I wrote functions to create and load PQSMods from a file\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks; is it on github or some other place already?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-27T02:33:54Z\u0022 title=\u002207/27/2014 02:33  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 27, 2014\u003C/time\u003E by BryceSchroeder\u003C/strong\u003E\n\u003Cbr\u003Eoh right\n\u003C/span\u003E\n"},{"CreatedByName":"KCreator","CreatedById":95721,"CreatedDateTime":"2014-07-27T02:39:01Z","Content":"\n\u003Cp\u003EYep, here it is: \u003Ca href=\u0022https://github.com/KCreator\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/KCreator\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIgnore the forked PlanetFactory, I was trying to make a pull request.\u003C/p\u003E\n"},{"CreatedByName":"Dooz","CreatedById":74263,"CreatedDateTime":"2014-07-27T04:51:50Z","Content":"\n\u003Cp\u003EWhat so far can this Planet mod accomplish, basic black sphere with no surface, Tracking station orbital path ect ect..\u003C/p\u003E\n"},{"CreatedByName":"Teknoman117","CreatedById":53200,"CreatedDateTime":"2014-07-27T08:59:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dooz\u0022 data-cite=\u0022Dooz\u0022\u003E\u003Cdiv\u003EWhat so far can this Planet mod accomplish, basic black sphere with no surface, Tracking station orbital path ect ect..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHello! I\u0027m the other guy working on this mod. We\u0027ve only been working on this for a short time, and I only *just* got custom PSystemBody objects into the planetary system. And at that, its just a name, orbit, and a very broken scaledVersion. There is still a lot of research to be done until even a black sphere in space is possible. The tough part is understanding the hierarchy (aftokinito, KCreator?) to the point of being able to create the objects from scratch, even with the massive help KCreator\u0027s PQS data utilities will be. I imagine we will start with understanding how the simplest KSP objects are put together and go from there. I just want the custom PSystemBody to follow its darn orbit and not materialize out of the space center .... (yes I cloned Dres\u0027 PSystemBody.scaledVersion object for testing purposes)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/8061287/Kopernicus/Screenshot.2014.07_01.54.28.png\u0022 alt=\u0022Screenshot.2014.07_01.54.28.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/8061287/Kopernicus/Screenshot.2014.07_01.57.00.png\u0022 alt=\u0022Screenshot.2014.07_01.57.00.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEdit - Turns out kerbin is the thing that is moving, the custom planet is not moving relative to the sun at all. Huh...\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- Nathaniel R. Lewis\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-27T10:53:57Z\u0022 title=\u002207/27/2014 10:53  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 27, 2014\u003C/time\u003E by Teknoman117\u003C/strong\u003E\n\u003Cbr\u003Emore info\n\u003C/span\u003E\n"},{"CreatedByName":"Teknoman117","CreatedById":53200,"CreatedDateTime":"2014-07-27T09:38:35Z","Content":"\n\u003Cp\u003EHaha. All it ended up taking was two lines of code to fix it. Orbit Driver doesn\u0027t automatically get set to update mode. This custom planet even works with stock HyperEdit. Although when you teleport a ship to it the game explodes ... I guess not having a surface defined with do that lol.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\t\t\t\u003Cbr\u003Ebody.orbitDriver.updateMode = OrbitDriver.UpdateMode.UPDATE;\u003Cbr\u003Ebody.orbitDriver.UpdateOrbit (); \u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/8061287/Kopernicus/Screenshot.2014.07_02.36.46.png\u0022 alt=\u0022Screenshot.2014.07_02.36.46.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E- Nathaniel R. Lewis\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-27T10:51:29Z\u0022 title=\u002207/27/2014 10:51  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 27, 2014\u003C/time\u003E by Teknoman117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"1of6Billion","CreatedById":46191,"CreatedDateTime":"2014-07-27T12:40:04Z","Content":"\n\u003Cp\u003EI have always envisioned a \u0027Kerbal Galaxy\u0027. 1 central black hole, orbited by Kerbol and a gazillion user generated star systems. Maybe you guys can make this come true \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}