{"TopicId":81421,"ForumId":36,"TopicTitle":"Umbra Space Industries - (Roadmap and WIPs)","CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-08-11T15:54:10Z","PageNum":8,"Articles":[{"CreatedByName":"Doctor Axel","CreatedById":64944,"CreatedDateTime":"2014-12-17T19:02:51Z","Content":"\n\u003Cp\u003EI am ALL OVER the idea of a USI shipyard. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think I\u0027m a little more into the idea of it working like Karbonite, though, rather than MKS - MKS is beautiful but waaaaay more complicated than I\u0027m into. =P Just a nice and straightforward \u0022drill extracts rocks, refinery makes rocks into parts, assembler builds vehicles from parts.\u0022\u003C/p\u003E\u003Cp\u003EThat would also make it dovetail nicely with ART, which I am a big fan of.\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-17T20:08:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yski\u0022 data-cite=\u0022Yski\u0022\u003E\u003Cdiv\u003EAre there any plans for larger base parts? I love the way USI parts look, and while the \u003Ca href=\u0022http://www.curse.com/ksp-mods/kerbal/221761-stanford-torus-0-5\u0022 rel=\u0022external nofollow\u0022\u003EStanford Torus mod\u003C/a\u003E is amazing, it does look kind of out of place when surrounded by my amazing yet relatively small MKS outposts. Just imagine the glory of a USI base the size of Gilly! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, on the list.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ss8913\u0022 data-cite=\u0022ss8913\u0022\u003E\u003Cdiv\u003Eso, Karbonite is clean for 0.90, I assume MKS/OKS will be getting the same Love \u0022soon\u0022? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlready done \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022almagnus1\u0022 data-cite=\u0022almagnus1\u0022\u003E\u003Cdiv\u003EOut of curiosity, where are you with this objective:\u003Cp\u003EWould you also consider making on OKS variant? I would love to be able to make a fully functional SkyDock Shipyard =)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Doctor Axel\u0022 data-cite=\u0022Doctor Axel\u0022\u003E\u003Cdiv\u003EI am ALL OVER the idea of a USI shipyard. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EI think I\u0027m a little more into the idea of it working like Karbonite, though, rather than MKS - MKS is beautiful but waaaaay more complicated than I\u0027m into. =P Just a nice and straightforward \u0022drill extracts rocks, refinery makes rocks into parts, assembler builds vehicles from parts.\u0022\u003C/p\u003E\u003Cp\u003EThat would also make it dovetail nicely with ART, which I am a big fan of.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlready done, the current MKS/OKS version ships with it (minus two parts I am finishing). And FYI - for the production chain you only need a few parts for EPL, so it\u0027s pretty simple.\u003C/p\u003E\n"},{"CreatedByName":"Fraz86","CreatedById":90101,"CreatedDateTime":"2014-12-17T22:00:53Z","Content":"\n\u003Cp\u003EAny chance of getting USI Shipyards as a separate pack? MKS/OKS isn\u0027t my cup of tea, but I would love to have a pack of attractive parts to overhaul EPL, utilizing resources obtained with AMT.\u003C/p\u003E\n"},{"CreatedByName":"Akira_R","CreatedById":117470,"CreatedDateTime":"2014-12-18T18:49:50Z","Content":"\n\u003Cp\u003EHey RoverDude first let me offer you the customary praise to our benevolent robot overlord, the amount of work you put into this game and community for free is astounding, thank you.\u003C/p\u003E\u003Cp\u003ELong post incoming so I hope you or someone who knows a little more than I can take the time to read it fully.\u003C/p\u003E\u003Cp\u003EFirst I am currently still on KSP .24.2 as my career game is highly customized with all kinds of personal tweaks and custom parts etc.\u003C/p\u003E\u003Cp\u003EMy USI version file is 0.2.3.0\u003C/p\u003E\u003Cp\u003EMy MKS version file is 0.21.2.0\u003C/p\u003E\u003Cp\u003EWhat I am looking for is documentation for the KolonyTools dll, I may be blind and just can\u0027t find it but I have looked around your GitHub. I have looked at some of the source code but to be honest I have no idea what exactly I\u0027m looking at lol, I learned some C\u002B\u002B when I was in highschool but that has helped me very little in sifting through and finding the info I am looking for.\u003C/p\u003E\u003Cp\u003EHere is what I am trying to do.\u003C/p\u003E\u003Cp\u003EI want to construct a space station that has a very specific look/form factor, stockish looks with ISS inspired form and OKS/EPL functions, it must also have a very low part count as i am running KSP on a couple of potatoes.\u003C/p\u003E\u003Cp\u003ETo this end I am making some custom welded parts to form the core modules of the station, and I am adding OKS functionality to them. Adding the modules of course is very easy however what I don\u0027t know is what exactly all the fields in and of themselves do in regards to their function and efficiency.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E//OKS stuff\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = MKSModule\u003Cbr\u003E        workSpace = 2\u003Cbr\u003E        livingSpace = 2\u003Cbr\u003E    }\u003Cbr\u003E    MODULE\u003Cbr\u003E    {\u003Cbr\u003E        name = ExWorkshop\u003Cbr\u003E        ProductivityFactor = 1\u003Cbr\u003E    }\u003Cbr\u003E    //End OKS stuff\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESpecifically this stuff, I know that adding more work space will effect the efficiency of all the modules, if there isn\u0027t enough work space for the number of kerbals on board the efficiency throughout the vessel starts to drop (at least that is how I understand it).\u003C/p\u003E\u003Cp\u003EWhat about living space what exactly does it do? Can a part have both?\u003C/p\u003E\u003Cp\u003EI notice that the only part that has livingSpace is the habring, I also notice that the Kerbitat has \u003Cem\u003EefficiencyPart = OKS_HabRing\u003C/em\u003E does the living space effect this efficiency but only if the part is listed as an \u003Cem\u003EefficiencyPart\u003C/em\u003E?\u003C/p\u003E\u003Cp\u003EAnd how does the EXWorkshop ProductivityFactor relate to all of this?\u003C/p\u003E\u003Cp\u003EAn explanation of how these feilds all work would be greatly appreciated.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-19T19:03:50Z\u0022 title=\u002212/19/2014 07:03  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 19, 2014\u003C/time\u003E by Akira_R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Venusgate","CreatedById":125730,"CreatedDateTime":"2014-12-20T03:20:33Z","Content":"\n\u003Cp\u003EBug on Machinery Plant when trying to build rocket parts\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jG5TAfd.jpg\u0022 alt=\u0022jG5TAfd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EConfirmed that does actually just make machinery.\u003C/p\u003E\n"},{"CreatedByName":"Uzcil999","CreatedById":118959,"CreatedDateTime":"2014-12-20T04:38:03Z","Content":"\n\u003Cp\u003EHey RoverDude thank you for the mods. I use the whole USI catalog, they are amazing. With how quick you have updated everything I am just going to assume that you don\u0027t sleep. I am really excited about the EPL addition, it was the reason I first tried to setup a Mun base. Will there be a rocket parts hatch for ART? \u003C/p\u003E\u003Cp\u003EAlso, with the expansion to mining, will there be a resource that can be gathered for pure profit? There was a small mod a while ago that allowed you to mine precious metals. The extraction rate was extremely low for balance, but I really enjoyed it. Gave a nice side bonus to mining for EPL as well as a reward for building massive kracken attracting bases.\u003C/p\u003E\u003Cp\u003EThank your work, Cheers!\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2014-12-20T09:31:48Z","Content":"\n\u003Cp\u003EPossibly an ART hatch - we\u0027ll see \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E RE profit mining stuff - already in place with both Karborundum and MKS refineries.\u003C/p\u003E\n"},{"CreatedByName":"NihilRex","CreatedById":130956,"CreatedDateTime":"2014-12-24T04:55:26Z","Content":"\n\u003Cp\u003ERover - Can you possibly give those of us not in the loop an idea of what would be nice, profit making things to return to the KSC for a profit? Preferably ones that don\u0027t require a trip to Eeloo to get...\u003C/p\u003E\n"},{"CreatedByName":"Jivaii","CreatedById":75048,"CreatedDateTime":"2015-01-02T06:00:19Z","Content":"\n\u003Cp\u003ERoverDude, what happened to the USI_ALLMODS download in Dropbox? =(\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-01-02T06:13:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NihilRex\u0022 data-cite=\u0022NihilRex\u0022\u003E\u003Cdiv\u003ERover - Can you possibly give those of us not in the loop an idea of what would be nice, profit making things to return to the KSC for a profit? Preferably ones that don\u0027t require a trip to Eeloo to get...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERefine Ore and Minerals into RareMetals and ExoticMinerals.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jivaii\u0022 data-cite=\u0022Jivaii\u0022\u003E\u003Cdiv\u003ERoverDude, what happened to the USI_ALLMODS download in Dropbox? =(\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESoon - it was out of date.\u003C/p\u003E\n"},{"CreatedByName":"Jivaii","CreatedById":75048,"CreatedDateTime":"2015-01-02T06:20:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003ERefine Ore and Minerals into RareMetals and ExoticMinerals.\u003Cp\u003ESoon - it was out of date.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI gets a new laptop specifically to play KSP while traveling, and no USI \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Sad kerbal is sad. But, you have provided snacks while we wait \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kolago","CreatedById":103729,"CreatedDateTime":"2015-01-03T12:40:16Z","Content":"\n\u003Cp\u003EProposal for regolith:\u003C/p\u003E\u003Cp\u003EPlease allow a split up of the parameters RecipeInputs and RecipeOutputs:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E  {\u003Cbr\u003E     name = REGO_ModuleResourceConverter\u003Cbr\u003E     ConverterName = Reactor\u003Cbr\u003E     StartActionName = Start Reactor\u003Cbr\u003E     StopActionName = Stop Reactor\u003Cbr\u003E     RecipeInputs = EnrichedUranium, 0.00003\u003Cbr\u003E     RecipeOutputs = DepletedUranium, 0.00003, True, ElectricCharge, 100, False\u003Cbr\u003E  }\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhy: Easier access to them with ModuleManager and TweakScale.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E    name = REGO_ModuleResourceConverter\u003Cbr\u003E    ConverterName = Reactor\u003Cbr\u003E    StartActionName = Start Reactor\u003Cbr\u003E    StopActionName = Stop Reactor\u003Cbr\u003E    INPUT_RESOURCE\u003Cbr\u003E    {\u003Cbr\u003E       name = EnrichedUranium\u003Cbr\u003E       rate = 0.00003\u003Cbr\u003E    }\u003Cbr\u003E    OUTPUT_RESOURCE\u003Cbr\u003E    {\u003Cbr\u003E       name = DepletedUranium\u003Cbr\u003E       rate = 0.00003\u003Cbr\u003E       dump = True\u003Cbr\u003E    }\u003Cbr\u003E    OUTPUT_RESOURCE\u003Cbr\u003E    {\u003Cbr\u003E       name = ElectricCharge\u003Cbr\u003E       rate = 100\u003Cbr\u003E       dump = False\u003Cbr\u003E    }\u003Cbr\u003E    REQUIRED_RESOURCE\u003Cbr\u003E    {\u003Cbr\u003E       name = EnrichedUranium\u003Cbr\u003E       rate = 0.00003\u003Cbr\u003E    }\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-03T15:25:51Z\u0022 title=\u002201/03/2015 03:25  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 3, 2015\u003C/time\u003E by Kolago\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Astrofox","CreatedById":135785,"CreatedDateTime":"2015-01-22T12:48:29Z","Content":"\n\u003Cp\u003ERoverdude, I was wondering if you could potentially create an add-on to the sounding rockets mod that contains the materials for stockalike cubesats and tubesats and just small satellites in general. Please tell me your decision, or create a poll for this on the page with this option in the poll. Love the Pre-release of sounding rockets BTW.\u003C/p\u003E\u003Cp\u003E- Thanks\u003C/p\u003E\u003Cp\u003EAstrofox\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-01-22T13:08:29Z","Content":"\n\u003Cp\u003ESure, log a github issue.\u003C/p\u003E\n"},{"CreatedByName":"Astrofox","CreatedById":135785,"CreatedDateTime":"2015-01-22T13:32:30Z","Content":"\n\u003Cp\u003EOkay, Roverdude, how do I do that?\u003C/p\u003E\n"},{"CreatedByName":"parrots","CreatedById":2796,"CreatedDateTime":"2015-01-26T04:36:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Astrofox\u0022 data-cite=\u0022Astrofox\u0022\u003E\u003Cdiv\u003EOkay, Roverdude, how do I do that?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the USI catalog page there\u0027s a \u0022Github Repo\u0022 page for all the projects, click that and there should be an \u0022Issues\u0022 link in the column on the right side of the page. Click it, then click the green New issue\u0022 button at the top of the list. It prompts for a login at that point, so I can\u0027t help you past there but it\u0027s probably pretty simple. As with all things technical or scientific, clear writing with lots of detail is important.\u003C/p\u003E\u003Cp\u003EEDIT: Hope this helps, sorry if it comes off as abrupt. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cairan","CreatedById":85361,"CreatedDateTime":"2015-02-16T01:37:59Z","Content":"\n\u003Cp\u003EI\u0027ve been wondering about doing something in regards with permanent outposts.\u003C/p\u003E\u003Cp\u003EIn the ART (Asteroid parts) of Umbra Space Industries conglomerate \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E we can hollow out an asteroid for storage...\u003C/p\u003E\u003Cp\u003EI was thinking... If we used a drill on a planet, to create an underground space, it would be possible to have underground facilities.\u003C/p\u003E\u003Cp\u003EIf there was a \u0022mole\u0022 or \u0022tunnel boring\u0022 function to the REGO_Excavator, we could create storage for Machinery, SpareParts and RocketParts below the surface, and when we reached a certain number of RocketParts, we could transform RocketParts resources into MKS/OKS functions into the excavated underground base...\u003C/p\u003E\u003Cp\u003ESay you build a base on Minmus. You land all your MKS modules, have a nice cozy surface setup for your Kerbals to be self-sufficient food wise. Then you add more drills, karbonite processing, and soon enough you land the big Mk3 modules and start off-world manufacturing. Add a Launch Pad to the mix, and your computer lags itself into oblivion every time you switch to your \u003Cstrong\u003E\u003Cem\u003EK\u003C/em\u003E\u003C/strong\u003E\u003Cem\u003Eetroit\u003C/em\u003E outpost... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow let\u0027s take the other approach. You land your ships after a nice survey on a nice spot on Minmus. You build a surface outpost, but you realize that this is such a sweet spot you hit resource-wise, you want to build your fleet of kolonization vessels from there. So you send your tunnel boring machine up, and hook it up to your base. Soon enough, \u0022empty space\u0022 gets created and associated with the tunnel boring machine part... When you get up to a certain point, you can transform this space for storage, like in ART, but you\u0027d also have the option to \u0022Equip Bunker\u0022.\u003C/p\u003E\u003Cp\u003ESo you click on the part\u0027s menu \u0022Equip Bunker\u0022 and a UI shows up to offer you a list of available MKS modules you can add to your underground facility, the underground space required, and their cost in RocketParts. If you click on \u0022Add Module\u0022 then the RocketParts and Empty Space gets deducted from the tunnel boring machine\u0027s resources, and you have access to the added module\u0027s functionality. All the underground modules would share the resources, so if your underground facility has storage for 3500 Machinery, 300 Spareparts, 5000 Karbonite, and so on, your underground Colony Control Center, Biolab, Refinery, Fuel Refinery, Aeroponics, Repair facility, etc. would share it, so if you had modules needing a total of machinery greater than 3500, their operation would proportional to the available Machinery parts stored in the underground part.\u003C/p\u003E\u003Cp\u003EYour huge Minmus sprawling (and lagging...) industrial complex on the surface would now mostly be underground, and from the surface you\u0027d now have a couple of solar panels and lights, your tunnel boring machine\u0027s surface access structure for EVA egress by Kerbals, and a FlexOTube linking your tunnel boring machine to a LaunchPad module on the surface. We\u0027re talking less than ten parts having to be rendered, but with the full functionality of hundreds of parts linked precariously by KAS tubing... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Your underground facility could then grow to hosting hundreds of Kerbals, if not thousands, without any hit on graphic rendering.\u003C/p\u003E\u003Cp\u003EThe great news is you\u0027d now have much more convenience in using your outpost for manufacturing and trade. You\u0027d still need to build a surface outpost first with MKS, set up drilling parts, set up some manufacturing prior to building your underground facility, but once you start building underground, you could drill mine shafts, increase production capacity, increase workspace and living capacity, add more food and oxygen production, as long as you ferry Kerbals to move into the bunker.\u003C/p\u003E\u003Cp\u003ESoon enough, you could then take your surface modules, unlink them and move them elsewhere to start another facility.\u003C/p\u003E\u003Cp\u003ENow for the gamaplay balancing, a few notes:\u003C/p\u003E\u003Cp\u003E- The Community tech tree node required to build underground living spaces should be at the very least Off World Manufacturing or Self-sufficient Outposts. \u003C/p\u003E\u003Cp\u003E- Drilling underground space should take some time.\u003C/p\u003E\u003Cp\u003E- Adding facilities should also take some time, similar to building vessels with Extraplanetary Launchpads.\u003C/p\u003E\u003Cp\u003E- There should be an \u0022happiness\u0022 penalty, hence a productivity hit, to living underground... Maybe keep track of how long Kerbals have been down there to justify doing crew rotations, provide a bonus for doing some rover derbies on Kerboldays with your Kerbals, etc. (aka Sundays \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\u003Cp\u003E- To limit infinite digging from a single tunnel boring machine, the total volume available to excavation should be limited. As a ballpark figure, let\u0027s say no more than 1/100 of the ground volume available, because you need to keep ground above and below your tunnels if you have multiple levels, and to the sides too, so it is a safe value. Also, half of the physic\u0027s bubble is open sky, the other half is ground. \u003C/p\u003E\u003Cp\u003E- We do not want underground facilities to overlap, so let\u0027s prevent them from being closer than 2.5 km (physics range) from each other. If they are, the option to \u0022Dig\u0022 on the part\u0027s UI should not be available, or not activate with an error message saying \u0022Another tunnel boring operation is nearby\u0022 ... something like that.\u003C/p\u003E\u003Cp\u003E- Digging in low gravity is probably easier than on Eve or Kerbin, so maybe the available space should be restrained by the body\u0027s gravity... Ie: you can dig a lot more deeper without collapse on Gilly than Minmus, on Minmus than Duna, on Duna than Eve, etc.\u003C/p\u003E\u003Cp\u003E- The tunnel boring machine part on the surface, to conserve mass, would increase in mass as digging progresses and resources get assigned to it.... Those 10000 Machinery parts are no feathers. However, it would be ridiculous and quite possibly bug inducing if we end up with something weighing 300 000 tons landed... so maybe a workaround would be needed, I don\u0027t know yet. It depends on how Unity would handle such large figures.\u003C/p\u003E\u003Cp\u003E- The process of fitting out an underground facility should require a number of high-level engineers in the tunnel borer. (Level 4 to dig, Level 5 to add equipment). That would also preclude spawning too much bases early in the game. \u003C/p\u003E\u003Cp\u003EI might try to hack together a proof-of-concept with Module Manager and a few existing parts...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-16T21:15:32Z\u0022 title=\u002202/16/2015 09:15  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 16, 2015\u003C/time\u003E by Cairan\u003C/strong\u003E\n\u003Cbr\u003EAdd the idea for 5-star engineers requirement\n\u003C/span\u003E\n"},{"CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-03-03T14:02:43Z","Content":"\n\u003Cp\u003EDear RoverDude,\u003C/p\u003E\u003Cp\u003EI don\u0027t want to poison your release threads. So I\u0027d like to write here my observation reports on your parts. In the hope to help you develop error correction and us having fully working great things to play with.\u003C/p\u003E\u003Cp\u003EMaybe these are just me not knowing base game mechanics or maybe minor bugs:\u003C/p\u003E\u003Cp\u003EExploration pack:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPatrack rover wheel\u003C/strong\u003E. No matter which symmetry I use no matter if I just KAS grab and exchange wheels. It is allways go in the wrong direction. \u003C/p\u003E\u003Cp\u003EMore rover I tried to build and with these nice little wheels (I prefer the attach node on them) I allways end up go forward for a backward key.\u003C/p\u003E\u003Cp\u003EAlso with KAS I have to rotate the part 180 to get the desired alignment. So for instance this wheel\u0027s base facing upwards when green (KAS attach) but as soon as i attached it it turns 180 and the wheel\u0027s base facing down in this style: attaching: /Ã‚Â° attached: \\.\u003C/p\u003E\u003Cp\u003EAnd if I exchange the right wheels with the left one it is still goes the wrong way. Also turning inverted.\u003C/p\u003E\u003Cp\u003EI had no problems like these attaching the almost same stock part.\u003C/p\u003E\u003Cp\u003EIn your FFT: \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe honey bagger\u003C/strong\u003E\u0027s symmetry has something serrious wierdness.\u003C/p\u003E\u003Cp\u003EFor examples: tanks attached symmetrically and changed resources and color. It went any kind of colorfullnes. Ending up orange left side and brown rightside and such.\u003C/p\u003E\u003Cp\u003EI tried balancing a VTOL from it. And the symetrically placed parts have ended up different ammounts of LFO (I using those neat electric engines so no LFO consumption should be)\u003C/p\u003E\u003Cp\u003EI seted the slider to 538 on one of the symmetric part. Checked the other one still 538. Launched the craft and ended up on the start before the first staging. 538 in the left side and 600 in the right side. (I didn\u0027t adjusted that way for sure)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMKS Base modul\u003C/strong\u003E Still having issues with the KAS container and the range it can opened. I even stick Bob Kerman to an unarmed (inexpanded) expando tube accidentally. So you have to push over the base in order to get the open container option in the contextmenu from that part.\u003C/p\u003E\u003Cp\u003EAs for the alcumbiere drive I have to apologies because I accused that mod for the freeze of my game near timewraps.\u003C/p\u003E\u003Cp\u003EI found the cause ultimately. It was a memory overload from Mechjeb. After I removed that one and only mod my game becomes uber stabil. Yesterday played 13h in one go.\u003C/p\u003E\u003Cp\u003EAnd I\u0027d really like to know why my asteroid miners haven\u0027t get enought Power (Electricity maybe) to operate. I mean on the back of my ship there is a OP Iondrive made by me and included a 50 EC/sec generator always on. \u003C/p\u003E\u003Cp\u003ESo there is no part on those \u0022ships\u0022 which should use any more electricity than that. But just for testing. I even sticked 8 gigantor solarpanel to them.\u003C/p\u003E\u003Cp\u003EThe problem occured only with the inline laser and with that grabber crusher thing. It writes me to not have enought POWER and won\u0027t start.\u003C/p\u003E\u003Cp\u003ESo what power means in this case? do they have to have puchcards? or much more than 50 EC/sec ?\u003C/p\u003E\u003Cp\u003EAnyway in these part\u0027s description window I didn\u0027t see any info on power usage. So please help me clear that thing.\u003C/p\u003E\u003Cp\u003EI hope these helps to clear out things for future releases. If anything more info you need just let me know.\u003C/p\u003E\u003Cp\u003ERichard\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-03T14:05:14Z\u0022 title=\u002203/03/2015 02:05  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 3, 2015\u003C/time\u003E by Ricardo79\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-03-03T14:21:46Z","Content":"\n\u003Cp\u003EI have had no issue with the PackRat wheels you are describing - are you using attach or store? Because you should store them in place and they will snap in correctly.\u003C/p\u003E\u003Cp\u003EThe symmetry bit is a FireSpitter issue and is already logged.\u003C/p\u003E\u003Cp\u003EThe base module EVA range is a KAS issue because it is not respecting it\u0027s own parameters.\u003C/p\u003E\u003Cp\u003EInsufficient detail is being provided RE your EC problem with AMT.\u003C/p\u003E\n"},{"CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-03-03T15:42:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003Eattach or store? Because you should store them in place and they will snap in correctly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tried every way on the rover base\u0027s. It snappping but when I want to drive it it has allways go in the other direction it should.\u003C/p\u003E\u003Cp\u003EI tried it assemble on place and in VAB too. \u003C/p\u003E\u003Cp\u003EI even tried to assemble it in VAB without the patrackrover base. So I just attached it to a base created from standard structure. even with the stock rover base. I tried to flipp over the probecore for it.\u003C/p\u003E\u003Cp\u003EBut in anyway this is just going inverted. Maybe another mod incompatibility should be there? Anyway I am giving you the craft file maybe I did something wrong in the whole time. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003E The symmetry bit is a FireSpitter issue and is already logged.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAcknowledged, thank you.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003E The base module EVA range is a KAS issue because it is not respecting it\u0027s own parameters.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh ....... Did you told them about this already? If not I am happy to report it. (If we have to use mods to the game in order to be a somewhat enjoyable one, The mods should not braking the experience.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003E Insufficient detail is being provided RE your EC problem with AMT.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk. I can create a more or less stock craft with the same parameters or Just give you my \u0022mod\u0022 along with a craft file. \u003C/p\u003E\u003Cp\u003EI didn\u0027t see anything suspicious in the logs. So a log copy won\u0027t help much. But I willing to upload one (If I know where to look for it without a crash?)\u003C/p\u003E\u003Cp\u003EThis question was something 2 weeks ago in the AMT thread. So since then I deleted the originals as well as \u0022WIP full of bees AMT\u0022. So try to recreate it. (I hope it will not bugging again I don\u0027t know if that mod has an update since maybe the error gone?!?!? I\u0027ll try it right away and then upload a zip containting everything I promissed including rovers.)\u003C/p\u003E\u003Cp\u003EWhat else can I help you with that? \u003C/p\u003E\u003Cp\u003EOh and thank you, for all the answers.\u003C/p\u003E\n"},{"CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-03-03T16:19:32Z","Content":"\n\u003Cp\u003EA Quick Question: \u003C/p\u003E\u003Cp\u003EI just downloaded AMT it comes with a different sized asteroid.cfg (inside the bundled Regolith)\u003C/p\u003E\u003Cp\u003ESo what is the correct install step by step if I have almost all the other USI stuff (except ART and FFT.\u003C/p\u003E\u003Cp\u003EI usually take a peek to the version files. Or decide to install the latest by date. But could this breaking the game (or the mods) in any way? \u003C/p\u003E\u003Cp\u003EAs I did it the last time also. (When those insufficient power message came out inside the inline lasers menu when triing to start it. (with a ton of EC produced and stored.)\u003C/p\u003E\u003Cp\u003EI have to wait for an answer to proceed. The question is which regolith (Asteroid.cfg) should I use right now?\u003C/p\u003E\n"},{"CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-03-03T18:11:37Z","Content":"\n\u003Cp\u003EOk. That\u0027s wierd. \u003C/p\u003E\u003Cp\u003ELast time on the same instal that didn\u0027t worked. (only change since, that I get rid of Mechjeb).\u003C/p\u003E\u003Cp\u003EI created a new save file. after installed the AMT without overwrite.\u003C/p\u003E\u003Cp\u003EThe first craft I launched had some issues.. as it lost evey part behind the (root part) regolith excavator after returning to space center. kerbin seemed to lost its texture. \u003C/p\u003E\u003Cp\u003ETerminated the craft Via Tracking station, created another one. drive it to the nearest asteroid. And it working right now. Avesome.\u003C/p\u003E\u003Cp\u003E Conclusion: I do have to check again all the mods every time I\u0027ve got an error \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Sorry. This one works fine.\u003C/p\u003E\u003Cp\u003EI try to recreate the rover too.\u003C/p\u003E\u003Cp\u003E----------\u003C/p\u003E\u003Cp\u003EEdited Here\u003C/p\u003E\u003Cp\u003ENot working. Every time I defocus it (by going to the KSC) and try to refly it from tracking station it \u0022destroys\u0022 each and every parts (even the attached asteroid).\u003C/p\u003E\u003Cp\u003EAt least making graphical bugs. \u003C/p\u003E\u003Cp\u003ELogs shows this: \u003C/p\u003E\u003Cp\u003E[Log]: DistObj ERROR: Tried to draw part probeStackLarge within rendering distance of active vessel!\u003C/p\u003E\u003Cp\u003E^^This is for all the missing parts (even Potatoroid) Except the inline mining laser (which would be: REGO_MiningLaser according to the part file)\u003C/p\u003E\u003Cp\u003E[Log]: [PlanetariumCamera]: Focus: Basic AMT\u003C/p\u003E\u003Cp\u003E[Log]: set target body via vessel = Sun (CelestialBody)\u003C/p\u003E\u003Cp\u003E[Warning]: [CurrencyWidgetsApp]: No live widgets to Despawn!\u003C/p\u003E\u003Cp\u003E[Log]: Tac.FuelBalanceController[FFC15BBA][3302.73]: Rebuilding resource lists.\u003C/p\u003E\u003Cp\u003EPart rightclick \u0022shows no asteroid detected\u0022. So all the parts except that excavator has been vaporized.\u003C/p\u003E\u003Cp\u003ESavefile, VAB ship along with my own mod just parts but needed for the craft. Can Be Located \u003Ca href=\u0022http://shost.club/KSP/AMT_Try.zip\u0022 rel=\u0022external nofollow\u0022\u003EHere\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EModlist directory text file \u003Ca href=\u0022http://shost.club/KSP/modlist.txt\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-03T19:24:43Z\u0022 title=\u002203/03/2015 07:24  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 3, 2015\u003C/time\u003E by Ricardo79\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-03-05T11:51:11Z","Content":"\n\u003Cp\u003EAnother Strange thing happend.\u003C/p\u003E\u003Cp\u003EI want to create a solar wing (stock Ion engines on plates two docking ports and a probecore, and a PDU From OKS)\u003C/p\u003E\u003Cp\u003EFor testing only (the final one should not have the PDU)\u003C/p\u003E\u003Cp\u003EWhen I fired it up and wanna start the generator the PDU states missing resource.\u003C/p\u003E\u003Cp\u003EDoes it requires other than Enriched uranium ? (as it packed with that for sure 250 units)\u003C/p\u003E\n"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-03-05T12:19:12Z","Content":"\n\u003Cp\u003EYou should really move these kinds of questions to the release thread for those mods. And include screenshots and such.\u003C/p\u003E\n"},{"CreatedByName":"Ricardo79","CreatedById":128863,"CreatedDateTime":"2015-03-05T15:03:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoverDude\u0022 data-cite=\u0022RoverDude\u0022\u003E\u003Cdiv\u003EYou should really move these kinds of questions to the release thread for those mods. And include screenshots and such.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe MkS thread has been closed. I wanted to make it there. \u003C/p\u003E\u003Cp\u003EThank you for the additional info how to post these. I\u0027ll make that next time. (I am a newb on these kind of communications.)\u003C/p\u003E\u003Cp\u003EEdited here:\u003C/p\u003E\u003Cp\u003EStrange.... I must have exchange the threads. The MKS is still open now. I\u0027l get there and post the pic.\u003C/p\u003E\u003Cp\u003EEdited 2: Yes it was the dev thread of the MKS which is closed.\u003C/p\u003E\u003Cp\u003ESo am I supposed to make error reports in the release threads?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-03-05T15:34:02Z\u0022 title=\u002203/05/2015 03:34  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 5, 2015\u003C/time\u003E by Ricardo79\u003C/strong\u003E\n\u003C/span\u003E\n"}]}