{"TopicId":83053,"ForumId":36,"TopicTitle":"[WIP] Transfer Window Planner","CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2014-08-27T13:42:24Z","PageNum":1,"Articles":[{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2014-08-27T13:42:24Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003ETransfer Window Planner - \u003C/strong\u003E\u003C/span\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EAn in game implementation of Launch Window Planner\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eor Mmmmm Porkchops in-game\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003ENow that I have ironed out some coding bugs and also taught myself a bunch of Maths I thought it was probably time to share what I have been plugging away on for a few weeks.\u003C/p\u003E\u003Cp\u003EI\u0027ve always been a fan of Alexmun\u0027s \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003ELaunch Window Planner WebApp\u003C/a\u003E (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/33023-WEB-APP-Launch-Window-Planner\u0022 rel=\u0022external nofollow\u0022\u003Eforum thread\u003C/a\u003E) to give you a really good visualisation of the \u0022best\u0022 time to launch interplanetary missions. With the Alarm Clock mod though it has always been a bit of a chore to create the alarms from the webapp (especially with my typo heavy fingers).\u003C/p\u003E\u003Cp\u003EAnyway - I know people prefer pretty pics, so heres me fiddling with the latest build I have - yelow markers around the porkchop indicate values for the selected transfer (the DV one is broken in this video)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=7mEpuVmK5bI\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=7mEpuVmK5bI\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlex was kind enough to help out (a lot) by providing the heavy lifting part of the code in C# so I could then get out the info portions of the transfer and wrap it in an interface so it can be in-game. The current plans I have are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EComplete at least the Ballistic transfer model\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERuns entirely on background threads so should have a small impact in game and not cause a UI lockup\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEnsure it works for non-Standard Universes - RSS is the big one here and so far all good\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESome way to put the transfer details on the clipboard for easy access in other plugins/apps\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFiddle with the colors/layout/symbols\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnd my stretch goal is an API connection to KAC - if I ever get off my backside and finish v3 - well TBH if I can stop getting distracted by new ideas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI see this mod being pretty straightforward in doing one purpose only, and theres a bunch of tweaks and tidying I need to do, but I\u0027m really interested in peoples feedback of:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Ethe layout, which parts are where, size of chart, etc\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhat Scenes it would be useful in - I was thinking of simply using the APPLauncher if I can (with toolbar options) - so KSC, Flight, Map - although if its useful in TS then let me know\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAnything else?\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-08-27T14:02:22Z","Content":"\n\u003Cp\u003EI\u0027m certainly already in love with this new coming add-on, and by heritage with your previous ones, I expect another masterpiece \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EUp to now, everything shown seems nice and valid, my feedback would be you\u0027re on the right track so please keep it that way.\u003C/p\u003E\u003Cp\u003EHowever, one feature that certainly would be great to have, is to link the transfer orbit parameters to the current orbit of a vessel, and directly bring the required burn vector as a new maneuver node in KSP. \u003C/p\u003E\u003Cp\u003EThe above feature is actually already provided by another excellent tool, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36476\u0022 rel=\u0022external nofollow\u0022\u003EKSP TOT\u003C/a\u003E by Arrowstar, though that one is an external app running in a Matlab runtime instance and linked to KSP for the required data exchanges.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-08-27T14:22:06Z","Content":"\n\u003Cp\u003EThis looks awesome! I don\u0027t know that you\u0027d need to see the window anywhere but the flight screen and the map screen. Maybe have an option, after selecting a transfer, to make the window compact: just showing the characteristics you\u0027d need to set up a maneuver node.\u003C/p\u003E\u003Cp\u003EIt would be nice to also have API hooks for other mods, for example:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003Eif (TransferPlanner.SelectedTransfer != null)\u003Cbr\u003E{\u003Cbr\u003E   if (TransferPlanner.SelectedTransfer.Prograde \u0026gt; 0)\u003Cbr\u003E   {\u003Cbr\u003E     // blah blah blah\u003Cbr\u003E   }\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"panarchist","CreatedById":63336,"CreatedDateTime":"2014-08-27T15:37:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EThis looks awesome! I don\u0027t know that you\u0027d need to see the window anywhere but the flight screen and the map screen. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERespectfully, I disagree. It\u0027s useful to have it in the Space Center view and the VAB, because the porkchop plot gives you the Delta-V needed, and you can then go into the VAB and design the craft for the mission at hand. A potential useful scenario:\u003C/p\u003E\u003Cp\u003EIt\u0027s Day 43, and I have a ship stuck in Duna orbit with 6 kerbals and only X days of TAC-Life Support remaining. I pull up the tool and check the porkchop plot - 9.5kps results in a transit time where all my kerbals are dead before resupply gets there, but 11kps gets me there a week before everything runs out. Now I can go into the VAB and design a rocket (with Engineer or VOID or another tool which tells me my rocket delta-V) according to the Delta-V needs of the mission.\u003C/p\u003E\u003Cp\u003EOtherwise, I\u0027d need to put a capsule on the launchpad and go into flight mode to get a plot.\u003C/p\u003E\u003Cp\u003ETriggerAu - this is an awesome idea! No more Alt-tabbing between the game and my browser! Looking forward to the eventual release.\u003C/p\u003E\n"},{"CreatedByName":"cvod","CreatedById":110540,"CreatedDateTime":"2014-08-27T15:42:21Z","Content":"\n\u003Cp\u003EWould it be possible for this tool to create the maneuver node when the user clicks a spot on the graph?\u003C/p\u003E\n"},{"CreatedByName":"Stevie_D","CreatedById":103007,"CreatedDateTime":"2014-08-27T16:10:09Z","Content":"\n\u003Cp\u003ELove it! Ive always wanted a quick easy tool to fine tune my transfer windows beyond my own fiddling after kerbal alarm clock. This looks like it fits the bill perfectly.\u003C/p\u003E\n"},{"CreatedByName":"dlrk","CreatedById":60033,"CreatedDateTime":"2014-08-27T16:36:12Z","Content":"\n\u003Cp\u003EIs this hard-coded to stock, or does it work with modded solar systems?\u003C/p\u003E\n"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2014-08-27T17:18:52Z","Content":"\n\u003Cp\u003ELooks beautiful! Would definitely use it.\u003C/p\u003E\n"},{"CreatedByName":"stratochief66","CreatedById":59541,"CreatedDateTime":"2014-08-27T17:40:41Z","Content":"\n\u003Cp\u003EWow, amazing that this was just posted today!\u003C/p\u003E\u003Cp\u003E\u002B\u002B That you are building it such that it works with RSS, that is where I truely can\u0027t plan a transfer if my life depends on it! Might have something to do with the planet inclinations, Earth equator offset, etc.\u003C/p\u003E\u003Cp\u003EIt would be amazing if this could also help plot flyby (and return!) missions for manned space flight in RSS, but I am not sure if the original was able to help with that.\u003C/p\u003E\u003Cp\u003EIt would also be amazing if it can generate a Maneuver Node from the data.\u003C/p\u003E\u003Cp\u003EI will keep a close eye on this thread, as it will really help me up my RSS game!\u003C/p\u003E\n"},{"CreatedByName":"IronGremlin","CreatedById":77166,"CreatedDateTime":"2014-08-27T19:40:04Z","Content":"\n\u003Cp\u003EYes. I\u0027ve been waiting my entire kerbal career for this.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2014-08-27T20:25:02Z","Content":"\n\u003Cp\u003EAwesome! Does it update the planet orbits in real time? Like if you Hyperedit a planet to a different orbit, would it give you the right transfer parameters?\u003C/p\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2014-08-28T04:11:33Z","Content":"\n\u003Cp\u003ETo Answer a few questions:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cstrong\u003ECustom Orbits/Planets/etc\u003C/strong\u003E - All the calcs in the tool are done from the gameobjects when you click plot - so you could hyperedit a planet and it should change as you\u0027d expect. I have tested RSS and can see the very different charts for transfers and durations, but I havent test flown any missions yet. The results do align with other tools out there for RSS and Stock games though so I am fairly confident they are right.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EAPI Visibility of Data\u003C/strong\u003E - Sounds like a cool idea and should be simple - consider it on the list\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EVisibility of App\u003C/strong\u003E - From the few response here I am leaning towards making it available wherever people want it. So that probably means all scenes via AppLauncher and Toolbar (although that does mean that in the current AppLauncher setup you wont see it in TS without Toolbar)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EApp Form Factor\u003C/strong\u003E - Good point re the Details/VAB etc, some form of summary view once you select a transfer sounds a good idea, will see how easy that is to do for a first release\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eand now the more difficult ones:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cstrong\u003EVisit and Return Plot\u003C/strong\u003E - I\u0027m sure thats possible, but I will need to get in my head how to present the options and what you\u0027ll need to configure - eg, departure date - duration of stay and how to aggregate the info\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EUsing Vessel Orbit and creating Man Node\u003C/strong\u003E - This one I\u0027m not sure about, as the math is probably above my level to work out, but I\u0027ll note it down and see if its possible to either do or lean on someone else to help with\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EKeep the comments/questions coming\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-08-28T05:08:07Z","Content":"\n\u003Cp\u003ELooking awesome. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe math for creating the maneuver node shouldn\u0027t be too bad; you can use MJ\u0027s code to plot where (aka when) on the orbit your ejection angle matches the required one, and then just use trig to calculate the components based on the inclination-angle and magnitude of the ejection kick the plotter already gives you.\u003C/p\u003E\n"},{"CreatedByName":"Shad0wCatcher","CreatedById":98819,"CreatedDateTime":"2014-08-28T06:07:04Z","Content":"\n\u003Cp\u003EThat\u0027s no lie; this will be an instant addition to my already distended Gamedata folder.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-08-28T06:59:48Z","Content":"\n\u003Cp\u003EThis is gona be huge thing.\u003C/p\u003E\u003Cp\u003ELike when kerbal engineer redux/mecjeb was released.\u003C/p\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2014-08-28T07:24:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003ELooking awesome. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EThe math for creating the maneuver node shouldn\u0027t be too bad; you can use MJ\u0027s code to plot where (aka when) on the orbit your ejection angle matches the required one, and then just use trig to calculate the components based on the inclination-angle and magnitude of the ejection kick the plotter already gives you.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I have that bit in my head... now that you typed it out for me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. The bit that I\u0027m struggling with is if the orbit is not near circular the output plot could be substantially different to a circular one depending on where the Pe/Ap is in the orbit in relation to the Ejection angle. Eg if the vessel has a highly elliptical orbit and the ejection point is at the Ap of the DV required will be massive compared to a circle. I\u0027m sort of stuck wondering whether it should plot something based on the semimajoraxis as an estimate and warn people of their foibles, although not sure really. \u003C/p\u003E\u003Cp\u003EI think I\u0027m gonna need to go back to my pencil and paper to try and sort it out in my head - and probably just run a bunch of plots to see what it does, but I probably should try and finish the fundamental first hey \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks heaps for the explanation there. Really helpful\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2014-08-28T07:41:59Z","Content":"\n\u003Cp\u003EI thought alexmun\u0027s calculator assumed a near-circular orbit?\u003C/p\u003E\u003Cp\u003EIf you\u0027re opening this up to elliptical orbits, then boy howdy are you in for a world of hurt \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EStill possible, but....\u003C/p\u003E\u003Cp\u003EOh, and you\u0027re most welcome, though sounds like you already basically had it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Krasimir","CreatedById":70217,"CreatedDateTime":"2014-08-28T10:40:25Z","Content":"\n\u003Cp\u003EExcellent! Dont bother with eliptic orbits for now imo it will slow u down. I cant wait to try it, looks like mod that should be vanilla!\u003C/p\u003E\n"},{"CreatedByName":"OtherBarry","CreatedById":100948,"CreatedDateTime":"2014-08-28T10:55:47Z","Content":"\n\u003Cp\u003EI agree with Krasimir on this. I\u0027d say you should stick with (relatively) circular orbits for now, and then put out a release, then start with elliptical stuff. Not many people try to go interplanetary from an orbit more than a 100km or so off circular. As long as it works with varying inclinations, it should be great.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-08-28T17:36:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EI thought alexmun\u0027s calculator assumed a near-circular orbit?\u003Cp\u003EIf you\u0027re opening this up to elliptical orbits, then boy howdy are you in for a world of hurt \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EStill possible, but....\u003C/p\u003E\u003Cp\u003EOh, and you\u0027re most welcome, though sounds like you already basically had it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlex Moon\u0027s calculator assumes an initial orbit with zero eccentricity and zero inclination (relative to the origin planet\u0027s equator? to the ecliptic?) The final orbit around the destination will also have zero eccentricity, but could be inclined. I\u0027d say if you were to output maneuver nodes, you\u0027d use the sma of the current orbit, determine the correct ejection angle to within half an orbit, and add the node assuming that the orbit is circular and un-inclined. Or maybe just have the maneuver node placer disabled if the orbit is too elliptic or too inclined.\u003C/p\u003E\u003Cp\u003ENote also, that with the API hooks, this feature could be created/updated/improved by another modder.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-08-28T18:49:44Z","Content":"\n\u003Cp\u003EDamn you Trigger! Now I actually will have to learn how to use one of those porkchop plots \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerolyov","CreatedById":62002,"CreatedDateTime":"2014-08-28T19:29:40Z","Content":"\n\u003Cp\u003EHey Trigger I love this idea and look forward to this mod being released! Like others have said best to build it in increments. Another thought for waaay in the future is a mod that allows full mission planning so could maybe build something like Ascent Komputron into this mod\u003C/p\u003E\n"},{"CreatedByName":"OtherBarry","CreatedById":100948,"CreatedDateTime":"2014-08-28T22:03:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003Eadd the node assuming that the orbit is circular and \u003Cstrong\u003Eun-inclined\u003C/strong\u003E. Or maybe just have the manoeuvre node placer disabled if the orbit is too elliptic or too inclined.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I agree with the rest of your post, I think inclination should be included, as IIRC the reason the the web based calculator didn\u0027t have inclination was for simplicity\u0027s sake, in that the user would have to input large amounts of data that\u0027s not accessible without MJ/KER. Unless you were referring to relative inclination, in which a mechjeb-esque warning would probably do.\u003C/p\u003E\n"},{"CreatedByName":"TriggerAu","CreatedById":57838,"CreatedDateTime":"2014-08-29T12:23:23Z","Content":"\n\u003Cp\u003EWow, going a whole mission planning thing is definitely more than I could take on I think, but I\u0027ll focus on getting the fundamentals out for now. Just working on toolbar stuff and a final screen layout at the mo\u003C/p\u003E\n"},{"CreatedByName":"Kerolyov","CreatedById":62002,"CreatedDateTime":"2014-08-30T08:48:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TriggerAu\u0022 data-cite=\u0022TriggerAu\u0022\u003E\u003Cdiv\u003EWow, going a whole mission planning thing is definitely more than I could take on I think, but I\u0027ll focus on getting the fundamentals out for now. Just working on toolbar stuff and a final screen layout at the mo\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey yep would be a BIG project, was thinking this mod could be the starting point for a bigger collaborative project in the future, maybe I\u0027m just getting carried away here and that wouldn\u0027t be the first time..... ahem\u003C/p\u003E\u003Cp\u003EWhatever be absolutely fantastic to be able to plan transfer windows properly in game, online tools are great but in game tools are in even better. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EActually I keep meaning to learn Unity \u0026amp; C# and have a bash at modding myself just been kept so busy with other programming stuff I never managed to get round to it......\u003C/p\u003E\n"}]}