{"TopicId":85590,"ForumId":36,"TopicTitle":"Duration orbital orientation and staged release of available science","CreatedByName":"sreinmann","CreatedById":110583,"CreatedDateTime":"2014-09-28T00:42:35Z","PageNum":1,"Articles":[{"CreatedByName":"sreinmann","CreatedById":110583,"CreatedDateTime":"2014-09-28T00:42:35Z","Content":"\n\u003Cp\u003EJust cause I haven\u0027t seen documentation doesn\u0027t mean that it hasn\u0027t been tried before, so I\u0027ll ask...\u003C/p\u003E\u003Cp\u003EI have a couple satellite parts in development based on existing/historical Earth satellites. Rather than flying it into LKO and HKO hitting the [get science] button and gaining instant results, I\u0027d like to be sure that the mission has achieved certain results. Namely: orbital parameters (PE/AP/Eccentricity/Inclination), duration (to simulate the slow - or rather steady - gathering of science through observations. Further, I\u0027d like to be able to simulate how, once an initial experiment is finished, the instrumentation is \u0022tasked\u0022 to look for something different yielding another score of science data (again provided that it achieved results in the first experiment and then met the new duration and possibly new orbit).\u003C/p\u003E\u003Cp\u003ESo, can the orientation and duration be set in the Part.cfg? or do I need a much more complicated system?\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-09-28T02:38:38Z","Content":"\n\u003Cp\u003EYou would need a plugin for that.\u003C/p\u003E\u003Cp\u003EE: Suppose I should note that that it really wouldn\u0027t be that complicated of a plugin, insofar as I can see. Part plugins are really simple and all you\u0027re really going to be doing is making a module that can be right-clicked under certain conditions. Simple. About the only thing that might give someone pause would be duration in a certain orbit, but you could fudge that from MET.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-28T02:41:28Z\u0022 title=\u002209/28/2014 02:41  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 28, 2014\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"IronGremlin","CreatedById":77166,"CreatedDateTime":"2014-09-28T04:52:08Z","Content":"\n\u003Cp\u003EIt\u0027s dated, but check out realistic progression lite - that mod did solve interesting things with experiments\u003C/p\u003E\n"}]}