{"TopicId":91259,"ForumId":36,"TopicTitle":"Decoupler/Sepratron weld only decouples via staging","CreatedByName":"LitaAlto","CreatedById":110917,"CreatedDateTime":"2014-11-25T23:18:17Z","PageNum":1,"Articles":[{"CreatedByName":"LitaAlto","CreatedById":110917,"CreatedDateTime":"2014-11-25T23:18:17Z","Content":"\n\u003Cp\u003EIf this is in the wrong place, please let me know.\u003C/p\u003E\u003Cp\u003EBut a couple weeks ago, I tried welding a decoupler with some internal Sepratrons, to make it easier to deorbit stages. \u003C/p\u003E\u003Cp\u003EPre-welding, both decoupler and Sepratrons were stageable and worked as expected \u003C/p\u003E\u003Cp\u003EPost-welding, only the decoupler works via staging--to make the Sepratrons fire, you have to right-click on the part, or else use an Action Group.\u003C/p\u003E\u003Cp\u003EI know there are mods with decouplers that integrate some form of SRB, similar to my weld. I\u0027ve looked over their .cfg files and I\u0027m not seeing a huge amount of difference--surely there\u0027s something I\u0027m overlooking?\u003C/p\u003E\u003Cp\u003EI\u0027ll post the cfg tonight once I\u0027m home, if anyone wants to see it.\u003C/p\u003E\u003Cp\u003EBut any advice is welcome. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-11-26T00:41:59Z","Content":"\n\u003Cp\u003EHmmm. I can\u0027t remember exactly how the welding mod operates, but post the pre and post weld configs and I\u0027ll see if I can make any suggestions.\u003C/p\u003E\n"},{"CreatedByName":"LitaAlto","CreatedById":110917,"CreatedDateTime":"2014-11-26T17:33:20Z","Content":"\n\u003Cp\u003EThanks! I got busy last night so I\u0027ll update this post tonight once I have those.\u003C/p\u003E\n"},{"CreatedByName":"Dr. Jet","CreatedById":99880,"CreatedDateTime":"2014-11-27T18:25:50Z","Content":"\n\u003Cp\u003ELook at my decoupling blisters for how to config such decoupler/retrorocket hybrid right.\u003C/p\u003E\u003Cp\u003EI believe welding with UbioZur tool leaves some unneeded config pieces that block simultaneous firing. Can\u0027t prove though as I haven\u0027t tried welding since 0.22.\u003C/p\u003E\u003Cp\u003ENot seeing the actual config, I can just quess possible troubles...\u003C/p\u003E\u003Cp\u003E1) More than one \u0022stagingIcon =...\u0022 line. It\u0027s a guaranteed glitch. \u003C/p\u003E\u003Cp\u003E2) Lack of \u0022ActivatesEvenIfDisconnected = true\u0022 in config.\u003C/p\u003E\u003Cp\u003E3) More than one MODULE [ModuleEngines]. I\u0027m not sure how multiples behave in 1 part. On the other hand I\u0027m pretty sure that single should handle all \u0022thrustTransform\u0022s from MODEL subparts right.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-27T18:45:11Z\u0022 title=\u002211/27/2014 06:45  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 27, 2014\u003C/time\u003E by Dr. Jet\u003C/strong\u003E\n\u003C/span\u003E\n"}]}