{"TopicId":92972,"ForumId":36,"TopicTitle":"Help with first mod","CreatedByName":"tHarvey303","CreatedById":81044,"CreatedDateTime":"2014-12-15T22:18:29Z","PageNum":1,"Articles":[{"CreatedByName":"tHarvey303","CreatedById":81044,"CreatedDateTime":"2014-12-15T22:18:29Z","Content":"\n\u003Cp\u003EI\u0027m quite new to modding, but managed to create a simple fuel tank and thought I would have a go at an engine. I managed to model it\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MV4n7VD.png\u0022 alt=\u0022MV4n7VD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand texture it\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3wKVgtK.png\u0022 alt=\u00223wKVgtK.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ein blender properly (I hope). I didn\u0027t try and get emissive textures working but I did try and get a fairing working. In Unity it also looks ok(to me), although the fairing is probably wrong and the parenting in the scene is also probably wrong. \u003Cimg src=\u0022http://i.imgur.com/0S5s8Dv.png\u0022 alt=\u00220S5s8Dv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MTUc45P.png\u0022 alt=\u0022MTUc45P.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, In game it looks like this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/EF5ULf0.png\u0022 alt=\u0022EF5ULf0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf someone would be so kind as to take a quick look to try and figure out what I have done long I would be grateful.\u003C/p\u003E\u003Cp\u003EHere is a \u003Ca href=\u0022https://www./?7zqxwumncije2jw\u0022 rel=\u0022external nofollow\u0022\u003Edownload\u003C/a\u003E link for a zip file which contains the:\u003C/p\u003E\u003Cp\u003E.blend file\u003C/p\u003E\u003Cp\u003EThe unity project\u003C/p\u003E\u003Cp\u003EThe \u0022finished\u0022 file from my GameData folder\u003C/p\u003E\u003Cp\u003EThe texture\u003C/p\u003E\u003Cp\u003ESorry If I forgot any thing vital, If I did I will upload it as soon as possible. Thanks for reading this.\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-12-15T23:04:27Z","Content":"\n\u003Cp\u003EHello\u003C/p\u003E\u003Cp\u003E A couple of things: Clean out some of the models and put a fresh copy into Unity. Make sure the transforms are set correctly, as I noticed the shroud is way off to the side. It makes things loads easier if you get that stuff sorted before you get into Unity.\u003C/p\u003E\u003Cp\u003EAdd an empty object, centred to 0,0,0 and add the mesh and transforms as children of that - call it Root, or something similar. Apply PartTools to it. Make sure the fairing is set in position correctly and set its tag to Icon_Hidden, as shown here (which you may have already done. Create a new material in Unity, give it a name, set it to KSP/Diffuse, add your texture into the slot and drag it onto the various bits of mesh that need it. Double check your thrust and smoke point transforms. Set up your colliders, configure PartTools and write it out, check the Unity console to see if there are any errors, then fire up KSP and check output_log. You\u0027re looking for an entry that says something similar to: \u0022PartLoader: Compiling Part \u0027KerbalFoundries/AlphaRepulsor/part/AlphaRepulsor\u0027\u0022 (that\u0027s just a log entry for one of my parts).\u003C/p\u003E\u003Cp\u003ECheck it out in the VAB and see what happens, and let us know \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tHarvey303","CreatedById":81044,"CreatedDateTime":"2014-12-16T07:58:58Z","Content":"\n\u003Cp\u003EWhen I export the engine from Blender, the engine and the fairing are two separate parts. When I get it into Unity they are joined together.\u003Cimg src=\u0022http://i.imgur.com/8T2gh07.png\u0022 alt=\u00228T2gh07.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow do I split them? Do I need to? Also in the Hierarchy tab, the engine has got a child called default, which contains the texture and mesh renderer whereas the engine on only has an animator. Should I delete one of them? \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fMJS2SX.png\u0022 alt=\u0022fMJS2SX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Lv0HsWY.png\u0022 alt=\u0022Lv0HsWY.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lo-fi","CreatedById":111099,"CreatedDateTime":"2014-12-16T10:04:44Z","Content":"\n\u003Cp\u003EAh. Did you export to fbx/dae/obj from blnder this time, or did you just bung the .blend into Unity? That definitely needs fixing first up, as they need to be different objects. The exports you posted all had them as separate objects, so something has gone wrong somewhere.\u003C/p\u003E\n"},{"CreatedByName":"CmdrThyte","CreatedById":128994,"CreatedDateTime":"2014-12-16T10:05:00Z","Content":"\n\u003Cp\u003EIf the transparency issue is still a problem I came across this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/25088?p=306853\u0026amp;viewfull=1#post306853\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/25088?p=306853\u0026amp;viewfull=1#post306853\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ewhich sounds like the same error. The solution suggested was to ensure the png image file has an alpha channel.\u003C/p\u003E\n"},{"CreatedByName":"tHarvey303","CreatedById":81044,"CreatedDateTime":"2014-12-16T12:14:29Z","Content":"\n\u003Cp\u003EI did export obj again. I did this the first time too but that time I used a blender addon which allows you to only export selected so the engine and fairing were exported separately. It seemed to work but it isn\u0027t the way you\u0027re meant to do it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T12:16:41Z\u0022 title=\u002212/16/2014 12:16  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by tHarvey303\u003C/strong\u003E\n\u003C/span\u003E\n"}]}