{"TopicId":199732,"ForumId":104,"TopicTitle":"New to modding, I would like to know how the game works with Configs and Code","CreatedByName":"Fundati","CreatedById":208109,"CreatedDateTime":"2021-01-21T01:04:44Z","PageNum":1,"Articles":[{"CreatedByName":"Fundati","CreatedById":208109,"CreatedDateTime":"2021-01-21T01:04:44Z","Content":"\n\u003Cp\u003E\nSo I\u0027m looking at making an expansion for Kerbalism \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190461-sir-mortimer/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022190461\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/190461-sir-mortimer/\u0022 rel=\u0022\u0022\u003E@Sir Mortimer\u003C/a\u003E, and I\u0027m new to modding. I\u0027m not new to coding, but I\u0027m a beginner at best and was taught with Python.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve done some work with configs in the game before: I\u0027ve written Scatterer configs for my own use and have tried with minimal success to write some configs for Outer Planets Mod to be supported by Parallax. I understand how these two configs work and they are relatively simple to understand.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I do not understand, however, is how the configs work for other sorts of mods. While the two mods I\u0027ve really messed with have been purely visual, I\u0027d like to write an expansion for Kerbalism and so I\u0027m trying to wrap my head around how life support mods are coded for the game.\n\u003C/p\u003E\n\u003Cp\u003E\nLooking for the files for Kerbalism, I can\u0027t for the life of me find where rates of consumption are, or how on earth I\u0027d even be able to edit them in the game.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/199476-ideas-for-a-health-centered-life-support-mod/\u0026amp;tab=comments#comment-3912241\u0022 rel=\u0022\u0022\u003EThis is what I\u0027d like to do\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSo I have a bunch of questions:\u003Cbr\u003E\n1. how does KSP add stats to Kerbals? Such as Stupidity and their G-force rating. I\u0027d like to know how they do it so that I might get an idea for how the game handles it\n\u003C/p\u003E\n\u003Cp\u003E\n2. I\u0027d like to write a mod that can tweak consumption amounts for Kerbalism. In a general way I understand how to do it (have some code that tweaks the rate of consumption for something such as oxygen, but on the fly AKA while a vessel is active), but I don\u0027t know how to translate that into language KSP would understand\n\u003C/p\u003E\n\u003Cp\u003E\n3. There\u0027s lots of tutorials on making parts, but how does one go about making these script-like mods? Are there any good tutorials for making mods like this?\n\u003C/p\u003E\n\u003Cp\u003E\nAnd help would be greatly appreciated, but I\u0027m afraid I might have bitten off more than I can chew. I hope that by taking it a small step at a time that I can eventually be able to produce a mod that fulfills my expectations.\n\u003C/p\u003E\n"},{"CreatedByName":"hemeac","CreatedById":59783,"CreatedDateTime":"2021-01-22T01:20:40Z","Content":"\n\u003Cp\u003E\nI started my tech tree overhaul mod which is just using \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E scripts by going over existing tech tree mods as they are generally simple and then building up from there.  I found going through the wiki on \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E has been quite helpful: \u003Ca href=\u0022https://github.com/sarbian/ModuleManager/wiki\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/sarbian/ModuleManager/wiki\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhen it comes to Kerbalism, it is definitely one of the more complex scripts that you can find within KSP and it took a while just to work out how to deal with Science experiments etc.  But in general, you will find the aspects that you are looking for within KerbalismConfig/Settings.cfg and KerbalismConfig/Profiles/Default.cfg.  These  will provide a baseline on where you will want to start. \n\u003C/p\u003E\n\u003Cp\u003E\nThe only other major overhaul of Kerbalism outside of Realism Overahul that I am aware of is \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122369-thejesuit/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022122369\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122369-thejesuit/\u0022 rel=\u0022\u0022\u003E@theJesuit\u003C/a\u003E\u0027s Simplex Kerbalism mod, so I think that is a natural route to see how he\u0027s approached it:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022122369\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed6347509191\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/181681-181-simplex-kerbalism-202-formerly-simplex-living/\u0026amp;do=embed\u0022 style=\u0022height:195px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"theJesuit","CreatedById":122369,"CreatedDateTime":"2021-01-22T02:13:43Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208109-fundati/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022208109\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/208109-fundati/\u0022 rel=\u0022\u0022\u003E@Fundati\u003C/a\u003E,\n\u003C/p\u003E\n\u003Cp\u003E\nLike \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/59783-hemeac/\u0026amp;do=hovercard\u0022 data-mentionid=\u002259783\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/59783-hemeac/\u0022 rel=\u0022\u0022\u003E@hemeac\u003C/a\u003E I started with using \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E patches to patch into kerbalism until kerbalism went down the separate config route.  This was helpful as the profile in kerbalism is not very helpful in \u003Cabbr title=\u0022Module Manager (mod)\u0022\u003EMM\u003C/abbr\u003E patching.\n\u003C/p\u003E\n\u003Cp\u003E\nThe kerbalism all the comsumption rates are in the profile, called default.cfg.  This is in the KerbalismConfig download.  The rukes define consumption rates, what kills etc.  Supplies are what goes into pods and the processes are for all the funky things that you might want to do such as \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003Eisru\u003C/abbr\u003E or fuel cells that are kinda independant to what the kerbals themselves do internally.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy to answer any questions.\n\u003C/p\u003E\n\u003Cp\u003E\nPeace.\n\u003C/p\u003E\n"}]}