{"TopicId":201707,"ForumId":104,"TopicTitle":"Ejection seat MM patch","CreatedByName":"MisterBennock","CreatedById":111444,"CreatedDateTime":"2021-04-14T14:28:49Z","PageNum":1,"Articles":[{"CreatedByName":"MisterBennock","CreatedById":111444,"CreatedDateTime":"2021-04-14T14:28:49Z","Content":"\n\u003Cp\u003E\nWhile playing around with the EAS-1 external command seat I realized I didn\u0027t like how \u0022ejection force\u0022 is implemented. \n\u003C/p\u003E\n\u003Cp\u003E\nThe way it works is that it will generally apply the force when leaving the seat no matter the situation. Of course an emergency exit in 9 km height is different from simply disembarking a small plane. IRL you also don\u0027t eject by seat every time you leave your machine.\n\u003C/p\u003E\n\u003Cp\u003E\nNow what I was wondering is if there is any way to make this distinction. I assume checking whether the plane has landed or is still moving etc. is rather complicated, so I thought about simply adding another button and have a \u0022regular\u0022 LEAVE SEAT option where ejection force is always set to 0, and an \u0022emergency exit\u0022 option with ejection force using the actual set value.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I have no idea how to do on about this. Can anybody comment if this is doable at all and if yes, how I could approach it?\n\u003C/p\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2021-04-24T23:15:15Z","Content":"\n\u003Cp\u003E\nAs there is only one ejection force parameter but two would be needed for this I\u0027m thinking you would need a small plugin to perform the switch based on situation (maybe landed/splashed). Good idea by the way!\n\u003C/p\u003E\n"},{"CreatedByName":"MisterBennock","CreatedById":111444,"CreatedDateTime":"2021-04-26T12:23:22Z","Content":"\n\u003Cp\u003E\nEh, I was afraid that was the case. If I have to write a .dll I\u0027m out, I don\u0027t have the skills or time to acquire to the skills needed for that. Maybe someone more talented than me will see this and come up with something.\n\u003C/p\u003E\n"}]}