{"TopicId":208584,"ForumId":104,"TopicTitle":"DYNAMICS: An Application of E.V.E Cloud Layers (plus, how to do Cloud Glow in modern EVE!)","CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2022-06-13T23:59:12Z","PageNum":1,"Articles":[{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2022-06-13T23:59:12Z","Content":"\n\u003Cp\u003E\nThrough my efforts in developing the mod Sol, I developed two different techniques for different visual needs that I believe uniquely distinguished Sol amongst other visual mod packs. Though that mod is now canceled due to still ongoing issues with the community, I do still want to see that these techniques make it into other mods, and rather than having people trying to reverse-engineer them through copies of my mod that, regardless of licensing, I still do not approve of being redistributed, I figure I may as well lay out a proper tutorial on these concepts so that people can just simply do as I did, and create their own mods.\n\u003C/p\u003E\n\u003Cp\u003E\nAs part of this tutorial, you will want to have a photo editing software such as Photoshop or GIMP that can export to the .dds file format. I personally recommend GIMP because its free and relatively hassle free. I also recommend becoming familiar with NASA\u0027s Visible Earth website, found \u003Ca href=\u0022https://visibleearth.nasa.gov/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E, as the website is a treasure trove of not only inspiration, but extremely high quality visuals from which your work can be derived. All of the imagery of Sol was derived from the available imagery on the website, and through this tutorial you\u0027ll see how I translated the raw satellite imagery into workable textures for the game, and how the Dynamic system works.\u003Cbr\u003E\u003Cbr\u003E\nI will also acknowledge that this is a beefy post; I am a very verbose and thorough person, and through this reading I would hope it should give some idea as to how I think through things. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cu\u003E\u003Cb\u003EDYNAMICS\u003C/b\u003E\u003C/u\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cstrong\u003EIntro:\u003C/strong\u003E\u003C/u\u003E Dynamics is my term for a method of inducing \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E\u0027s innate layer functions to mimic the way in which Earthbound cloud systems form and dissipate over time. While \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E is not quite sophisticated enough to provide a true simulation, it does have the tools necessary to provide an uncanny approximation IF one puts in the effort to realize it.\u003Cbr\u003E\u003Cbr\u003E\nThe How: How Dynamics works is fundamentally dependent on the nature of the \u003Cb\u003Edetail texture\u003C/b\u003E\u003Cspan\u003E. In \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E, two primary textures are responsible for the look of a cloud layer. These are listed as Main Tex, and Detail Tex.\u003Cbr\u003E\u003Cbr\u003E\nMain Tex to put it in simple terms provides the macro shape of a cloud, meaning that even if your texture is just flat Microsoft Paint drawings, it will take to the shape of what was drawn. Detail Tex is an additional texture that is overlaid on top of the Main Tex, and as its name implies, is meant to provide additional detail to the texture, and depending on the modder, most examples have used Detail Tex as a means of pushing the fidelity of the overall clouds.\u003Cbr\u003E\u003Cbr\u003E\nHowever, the key thing about Detail Tex is that it is sensitive to transparency, meaning that if your detail texture is transparent in any part of it, that transparent section will also translate to its application to the main texture, rendering that part of main tex transparent as well.\u003Cbr\u003E\u003Cbr\u003E\nThis is the fundamental key to how dynamics works, and I discovered that this worked some years ago during development for the mod Ad Astra, and my early attempts with it are still viewable through that mod by looking to the planet Lindor and its Dark Spot, which forms and dissipates regularly over time.\u003Cbr\u003E\u003Cbr\u003E\nOriginally, however, this technique for me was only meant to serve as a means of providing just specific macro level cloud systems, like the Dark Spot, or the eventual Typhoon that featured in Sol. Until I had an epiphany, I was still very much married to the idea of global Cube Maps being the key to higher quality visuals, but Cube Maps have their short comings. For one, the global coverage means that quality is hard to keep consistent across the entire texture (without painstakingly hand-painting it), and this only gets worse depending on the quality of your source and the method with which the cube map itself was generated, and for two, its very static; the clouds will always look the same no matter what, with only the underlying terrain changing. To put it short, cube maps are a pain to work with and unless you are very fortunate, or have the patience to paint it by hand, they still ultimately have shortcomings that leave one wanting.\u003Cbr\u003E\u003Cbr\u003E\nBut Dynamics provides another option, and in fact, provides an option that is much better suited to the sort of game Kerbal Space Program is, where memory is of vital importance. Using Dynamics to create global cloud coverage can not only provide much higher quality and far better consistency, effectively allowing one to have texture qualities as high as one wants without any quality loss from downscaling, it also allows you to do so without an egregious impact to the memory footprint of the mod compared to what would be necessary to replicate the same visual fidelity using other methods. And as a bonus, you get the Dynamics effect itself, allowing your global coverage to never look the same twice.\u003Cbr\u003E\u003Cbr\u003E\nSo, with all that explanation aside (though there\u0027s still quite a bit more), lets get into the nitty gritty. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022border-bottom:1.1pt double #000000;border-left:none;border-right:none;border-top:none;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ETo start, we need to identify and locate a source cloud map that we are going to derive what we will be calling \u003C/span\u003E\u003Cb\u003Ecloud patterns\u003C/b\u003E\u003Cspan\u003E, or \u003C/span\u003E\u003Cb\u003Ecpats\u003C/b\u003E\u003Cspan\u003E. For this, I utilized (and prefer) the Blue Marble imagery available at Visible Earth. I took the highest resolution that was available, and in GIMP, I combined both the E and W files into one, which should provide you with something looks like this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NPXwgtu.png\u0022 data-ratio=\u002254.02\u0022 width=\u00221007\u0022 src=\u0022https://i.imgur.com/NPXwgtu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan\u003EWhile the large file size, 43k in this case, can be rough to work with depending on your computer\u0027s specs, do keep in mind that you only need to work with it long enough to extract a cpat.\u003Cbr\u003E\u003Cbr\u003E\nTo do this, the process is quite simple. For this purpose, we are going to assume that we want to have our cpats be at 16k, which is the maximum resolution that KSP can support. To mark out a strict 16k selection, we are going to select our selection tool, and set it to Fixed with a resolution of 16384 x 8192; your settings should resemble the below:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022XhL3uDY.png\u0022 data-ratio=\u0022209.76\u0022 width=\u0022205\u0022 src=\u0022https://i.imgur.com/XhL3uDY.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOnce you have this, you can click and drag anywhere on your image, and a selection box should appear that you can then drag around. We want the image to be rectangular, as this will prevent our final cpat from being distorted.\u003Cbr\u003E\u003Cbr\u003E\nFrom there, all you have to do is select some part of your source map that you think looks good or interesting to have as a potential pattern. For this, I selected this section:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222ELvabB.png\u0022 data-ratio=\u002249.13\u0022 width=\u00221038\u0022 src=\u0022https://i.imgur.com/2ELvabB.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan\u003ENext, copy the selection, and create a new file in the same resolution (16384x8192), and paste in your image. Add the pasted image as a new layer, and either merge it with the extraneous background or layer, or simply delete that layer.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nWhat this process does is allow for the higher resolution image to be translated to a lower resolution image, without any real loss in quality from more traditional down-scaling methods. We do lose the additional data from the rest of the map, but this on purpose, as we do not want all of that extraneous data anyway, and because we can always just make more cpats. (for Sol, I settled on three primary cloud patterns, with a fourth intended for noctilucent cloud formations)\u003Cbr\u003E\u003Cbr\u003E\nNext, we will need to extract the clouds themselves from the black background. First, ensure that the image has been set to “RGB”, by clicking on Image \u0026gt; Mode \u0026gt; RGB. Then, click on Colors \u0026gt; Color to Alpha.\u003Cbr\u003E\u003Cbr\u003E\nThe Color to Alpha tool will automatically render your selected color transparent. By default it will have selected White, but naturally we want to change this to black. As a first pass, we can click okay once this is completed, and now your texture should look like this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022UeqNiYO.png\u0022 data-ratio=\u002251.78\u0022 width=\u00221093\u0022 src=\u0022https://i.imgur.com/UeqNiYO.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHowever, we are not quite finished with this step yet. Due to the nature of satellite imagery, a lot of artifacts may be present that you do not want, and this is especially true if you are extracting clouds from images that also include terrain. To sus these artifacts out, make a new layer and fill it with some color; I typically use a dull blue as it gives me some sense of what the clouds will eventually look like.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nOnce you do this, zoom in and inspect your texture, and essentially you are looking for anything you don\u0027t quite like. While my example texture was already cleaned up, I was able to find this section in the upper right:\u003C/span\u003E\u003Cbr\u003E\u003Cimg alt=\u00225DPB9QL.png\u0022 data-ratio=\u002291.94\u0022 width=\u0022782\u0022 src=\u0022https://i.imgur.com/5DPB9QL.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWithout the blue background, details like this may have been easy to overlook until you\u0027ve already gone through the process of getting the cpat into the game. To correct this particular issue, its simply a matter of erasing the offending details.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nA helpful tip if you are extracting clouds from images that feature terrain or other artifacts (such as sunlight reflecting off an ocean; a common occurrence in satellite imagery), is to merge your cpat with your color layer, and then repeat the Color to Alpha process, this time picking the blue color. You may have to click around on the offending spot, and play with the Opacity and Transparency thresholds (which adjust how strict the software is in erasing the chosen color), but eventually you will find a sweet spot that largely, if not completely, erases the artifacts.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAny additional artifacts you find beyond that, simply need to be erased.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nNow, yet again, we are not finished. Zooming back out, you\u0027ll notice that your cloud texture likely extends off the bounds the image. This naturally, will not do for our purposes, unless you\u0027re for some reason wanting to do Minecraft clouds.\u003Cbr\u003E\u003Cbr\u003E\nTo correct unfortunately requires sacrifice. We will need to erase and blend the clouds in such a way that they stay within the bounds of the image, but also still look like clouds.\u003Cbr\u003E\u003Cbr\u003E\nFor this purpose, I recommend locating a quality brush pack for GIMP (utilize sites such as deviantart) that specifically provide brush shapes that mimic clouds or smoke. While I cannot say what tools I have (as I acquired them long ago and their names in my system lend no clues to their origin, other than I know they came from deviantart), the important aspect is that you want cloud or smoke shapes to work with, as they will naturally lend themselves to forming the shapes you want.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nOnce you have one, experiment with the settings and see what results you can get. Ideally for Dynamics, we want the clouds to comprise around 50-60% of the total image, with a good mix of both smaller and larger cloud formations, as this ratio is required to allow for Dynamics to function as expected.\u003Cbr\u003E\u003Cbr\u003E\nI recommend prioritizing the lowest quality or least appealing areas of your image first, before tackling the edges or removing large macro elements from the pattern. With enough experimentation, you should end up with something akin to this image:\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022KTHQ2G4.png\u0022 data-ratio=\u002250.38\u0022 width=\u00221048\u0022 src=\u0022https://i.imgur.com/KTHQ2G4.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAs you can see above, you may also find it advantageous to flip or mirror the image. There is no hard rule to whether or not that is desirable; your artistic eye simply needs to guide you, and remember that there is no cost in experimentation here. If it ends up looking bad, start over and try again. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ENow, to prepare the image for use in KSP, we need to actually turn it into two different textures. One will be our main tex, and the other our detail tex. The eventual randomized interaction between the two textures, which we will set up once we are in-game, is what enables Dynamics to do what it do.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nNow, the transparent image as we have it is already set up, and this will be our detail texture. First, insure you have save this as an .xcf so that you can always come back to it, and ensure that your background color layer is set to invisible, so you are left with just the layer with the clouds. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThen export the image as a .dds. Ensure your settings match this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hGqJkFg.png\u0022 data-ratio=\u0022132.68\u0022 width=\u0022407\u0022 src=\u0022https://i.imgur.com/hGqJkFg.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFor this, we name this as cpat1_d\u003Cbr\u003E\u003Cbr\u003E\nOnce that has completed exporting, we can move on to to the main texture. To generate this, I do not recommend just doubling up on the detail texture. The reason for this is because the interaction between the transparent sections of both textures tends to not look that great in my experience, so instead what we want to do is create a texture that captures the macro shapes of the pattern, but “fills in” some much of the transparencies, allowing for the detail texture to define those alone.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nThe process for this is simple. Duplicate the layer multiple times, and as you do so you\u0027ll notice the pattern become progressively bolder as the stacked layers fill in transparencies. I recommend doing this around 4-6 times. Once you have them, merge the copied layers together into one, and you should result in an image like this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SH1aNAp.png\u0022 data-ratio=\u002251.00\u0022 width=\u00221055\u0022 src=\u0022https://i.imgur.com/SH1aNAp.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe difference here may appear to be subtle, but that is ideal. You do not want it to be too bold, but the pattern should be considerably fuller than its detail counterpart. Export this as a second .dds, this time simply as cpat1 \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWith these two textures in hand, you have all you need to make Dynamics work. Add them to your mod directory, and load up the game.\u003Cbr\u003E\u003Cbr\u003E\nIn the \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E Gui, accessed by Alt-0, or within the tracking station by clicking on the \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E Gui button, create a new layer and name it cpat1. \u003C/span\u003E\u003Cbr\u003E\u003Cspan\u003E==========================================================================================================================================================\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFrom here, the settings you choose are more or less up to you, your tastes, and what you want to do. I can, however give you some general tips going down the line of the options you have available to you.\u003Cbr\u003E\u003Cbr\u003E\nAltitude – Generally speaking, you don\u0027t want clouds to be too high up in the atmosphere, especially at lower scale Solar Systems, as this will look very off from what it should be compared to real life. While achieving the realistic is not completely possible without moving up to Real Scale, you can approximate it, and for this, I recommend a cloud height around 7-10km, and I recommend that for all of your cloud patterns that you make the altitude identical, or only with slight variances. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EKill Body Rotation – This generally is only recommended for things meant to stay stuck to the polar regions. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESpeed/Detail Speed – Speed governs how fast Main Tex moves across the world, while Detail speed, as you can imagine, governs how fast the Detail Tex moves within its application to the Main Tex. For these, I recommend keeping them relatively low, no more than 20 or 30, but ideally closer to the 2-10 region. You can use negative numbers, and this will help to vary up the directions the two textures move in, which is highly useful if you want to use the same cpat twice, saving both on memory and allowing for a more fuller globe.\u003Cbr\u003E\u003Cbr\u003E\nOffset – This setting appears to move the texture away from a particular center point, however it is quite limited and typically only works well if you specifically need something to hang, with no movement, in a specific location on the planet. This is useful for providing things like lava flows, algae blooms, smoke clouds, meteors, etc.\u003Cbr\u003E\u003Cbr\u003E\nRotation – These settings naturally govern how the layer itself rotates as it moves. You can use these to set up singular cyclonic storms, however do note that due to shortcomings in the Offset setting (namely that it doesn\u0027t allow you to offset where the center point of a layer is), you may not be able to get your cyclone to behave properly except on one location on the planet. Hopefully in future versions of \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E these settings can be expanded on to allow for greater control.\u003Cbr\u003E\u003Cbr\u003E\nArc – I\u0027ve never seen any reason to use this. It controls how much of your texture displays over one half of the planet, but the effect does not seem to be entirely useful.\u003Cbr\u003E\u003Cbr\u003E\nColor – This is more or less self-explanitory, though I will note that you can exceed the 255 numbers, as well as go negative if you wish. This is useful for balancing \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E\u0027s interactions with scatterer, enabling you to get clouds that do not look too starkly white, but while also still getting the vibrant terminators that settings in scatterer can provide you.\u003Cbr\u003E\u003Cbr\u003E\nDetail Scale – This is a critical setting for Dynamics, and it must be set to 1, otherwise dynamics will not work as intended. Using scales higher than one will shrink and repeat the detail texture, which is not what we want; we want Main Tex and Detail Tex to be 1:1.\u003Cbr\u003E\u003Cbr\u003E\nDetail Distance – This setting affects how the layer appears at various zoom distances. A setting of -2E-07 is recommended here. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EDistFade – If this setting has an effect, I have not been able to identify it.\u003Cbr\u003E\u003Cbr\u003E\nDistFadeVert – I recommend using the same as Detail Distance, though like DistFade I am not certain what effect this setting has. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EUV Noise Settings – If you have a useful UV texture, I would recommend following the advice of others who have dealt with these. I have not, so I will not speak to them authoritatively. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E==========================================================================================================================================================\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFinally, you also want to ensure you have enabled Layer 2D. Most of the settings in here should be left alone, other than MinLight and ShadowFactor. Minlight when set to a positive number will cause your cloud layer to appear on the night side at various brightnesses. This is mostly used for Auroras and other lighted effects, but as I will cover in the City Lights section, this also has use for enabling an effect that I find is stupidly called “cloud glow”. Shadow factor is up to personal tastes, but it is good to note that higher values will induce unnatural darkness on the ground, so be wary; it may look good in orbit but you may second guess the value if your rocket launch in the sun is being cast into darkness by a tiny speck of cloud texture.\u003Cbr\u003E\u003Cbr\u003E\nOnce all of these settings are ready, you\u0027re done! Apply the layer and save it to your config. Once you change scenes, or press the Map Eve Clouds button in the Scatterer GUI, you can enter time warp and see how your new cloud pattern periodically forms and dissipates at random over time. By adding additional cpats, repeating them, and varying their settings, you can achieve global cloud coverage that is always dynamic, and seldom boring.\u003Cbr\u003E\u003Cbr\u003E\nPerformance wise, it is fully dependent on how many repeated cpat layers you have going at once, and naturally the resolution you created the textures at. For Sol, I settled on a repetition of four, with each of the three main cpats being repeated four times with varied speed and detail speed settings to achieve a global coverage that I was satisfied with. With smaller resolution textures, you could potentially push this number to greater heights, though I will note that it is possible to have too much layered over top of one another at once, so be wary.\u003Cbr\u003E\u003Cbr\u003E\n==========================================================================================================================================================\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAs an added bonus, I am also going to, much less thoroughly, explain how to achieve the apparently lost “art” of cloud glow, an effect that was apparently quite popular in older visual mods prior to a change in \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E that changed how the Minlight setting worked.\u003Cbr\u003E\u003Cbr\u003E\nThe solution, incredibly, to bringing the effect back was astonishingly simple and brain dead.\u003Cbr\u003E\u003Cbr\u003E\nAre you ready?\u003Cbr\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cem\u003EUse \u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cu\u003E\u003Cem\u003E\u003Cb\u003Etwo\u003C/b\u003E\u003C/em\u003E\u003C/u\u003E\u003C/span\u003E\u003Cspan\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cem\u003E citylight configs.\u003C/em\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nIts dumb, it shouldn\u0027t work, but it does.\u003Cbr\u003E\u003Cbr\u003E\nIn order to achieve the effect, like we see here:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226LFbVzl.png\u0022 data-ratio=\u002290.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6LFbVzl.png\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cspan\u003EWhat you want to do is take your CityLights texture, and apply a substantial Gaussian Blur filter to it. It shouldn\u0027t be so high that it becomes indiscernible where the lights were, but it shouldn\u0027t be so low that the lights are only slightly blurry.\u003Cbr\u003E\u003Cbr\u003E\nOnce you have this, you will also need to create new detail textures for what we will call CityLights_G\u003Cbr\u003E\u003Cbr\u003E\nAs a result of how the CityLights feature works in \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E, you will need set your day texture to a blank, nothing texture, as small as you can get it. This is necessary to prevent the glow from appearing on the day side of the planet. To maintain consistency, I recommend taking your night texture, and applying the same gaussian blur filter to it; you want most of the details to vanish in the blur for this one. I call these dayglow and nightglow respectively.\u003Cbr\u003E\u003Cbr\u003E\nNow, due to \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E being unable to support the creation of two simultaneous CityLights for the same body in its GUI, this will instead have to be done through the configs directly.\u003Cbr\u003E\u003Cbr\u003E\nSimply take your CityLights config file, copy and paste it, and rename it to CityLights_G or whatever other name you would like to give. In the settings, change the texture paths to your new textures. Once you\u0027re done, save the config, and it just simply works. While you will not be able to toy with the _G layer itself in-game, it is relatively trivial to make any adjustments to its config.\u003Cbr\u003E\u003Cbr\u003E\nTo achieve the final piece of the cloud glow puzzle, you simply need to enable Minlight on your cloud layers. For this, I recommend a setting between 0.2 and 0.4, as this will allow the clouds to still show up on the night side, but will prevent them from being starkly visible even on the Moon, which is a shortcoming of the old method to this effect. The _G layer will shine through the now visible clouds (provided the texture is transparent) and, with some possible adjustments to the _G texture, you can achieve a look that mimics the real life nature of lights being scattered and dispersed across a cloud at night. \u003C/span\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206207-ballisticfox0/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022206207\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206207-ballisticfox0/\u0022 rel=\u0022\u0022\u003E@ballisticfox0\u003C/a\u003E \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-06-14T00:09:37Z\u0022 title=\u002206/14/2022 12:09  AM\u0022 data-short=\u00222 yr\u0022\u003EJune 14, 2022\u003C/time\u003E by G\u0026#039;th\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ballisticfox0","CreatedById":206207,"CreatedDateTime":"2022-06-14T02:20:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224144579\u0022 data-ipsquote-contentid=\u0022208584\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221655164752\u0022 data-ipsquote-userid=\u002298595\u0022 data-ipsquote-username=\u0022G\u0027th\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, G\u0026amp;#x27;th said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThrough my efforts in developing the mod Sol, I developed two different techniques for different visual needs that I believe uniquely distinguished Sol amongst other visual mod packs. Though that mod is now canceled due to still ongoing issues with the community, I do still want to see that these techniques make it into other mods, and rather than having people trying to reverse-engineer them through copies of my mod that, regardless of licensing, I still do not approve of being redistributed, I figure I may as well lay out a proper tutorial on these concepts so that people can just simply do as I did, and create their own mods.\n\u003C/p\u003E\n\u003Cp\u003E\nAs part of this tutorial, you will want to have a photo editing software such as Photoshop or GIMP that can export to the .dds file format. I personally recommend GIMP because its free and relatively hassle free. I also recommend becoming familiar with NASA\u0027s Visible Earth website, found \u003Ca href=\u0022https://visibleearth.nasa.gov/\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E, as the website is a treasure trove of not only inspiration, but extremely high quality visuals from which your work can be derived. All of the imagery of Sol was derived from the available imagery on the website, and through this tutorial you\u0027ll see how I translated the raw satellite imagery into workable textures for the game, and how the Dynamic system works.\u003Cbr\u003E\u003Cbr\u003E\nI will also acknowledge that this is a beefy post; I am a very verbose and thorough person, and through this reading I would hope it should give some idea as to how I think through things. \u003Cbr\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cu\u003E\u003Cb\u003EDYNAMICS\u003C/b\u003E\u003C/u\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cstrong\u003EIntro:\u003C/strong\u003E\u003C/u\u003E Dynamics is my term for a method of inducing \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E\u0027s innate layer functions to mimic the way in which Earthbound cloud systems form and dissipate over time. While \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E is not quite sophisticated enough to provide a true simulation, it does have the tools necessary to provide an uncanny approximation IF one puts in the effort to realize it.\u003Cbr\u003E\u003Cbr\u003E\nThe How: How Dynamics works is fundamentally dependent on the nature of the \u003Cb\u003Edetail texture\u003C/b\u003E\u003Cspan\u003E. In \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E, two primary textures are responsible for the look of a cloud layer. These are listed as Main Tex, and Detail Tex.\u003Cbr\u003E\u003Cbr\u003E\nMain Tex to put it in simple terms provides the macro shape of a cloud, meaning that even if your texture is just flat Microsoft Paint drawings, it will take to the shape of what was drawn. Detail Tex is an additional texture that is overlaid on top of the Main Tex, and as its name implies, is meant to provide additional detail to the texture, and depending on the modder, most examples have used Detail Tex as a means of pushing the fidelity of the overall clouds.\u003Cbr\u003E\u003Cbr\u003E\nHowever, the key thing about Detail Tex is that it is sensitive to transparency, meaning that if your detail texture is transparent in any part of it, that transparent section will also translate to its application to the main texture, rendering that part of main tex transparent as well.\u003Cbr\u003E\u003Cbr\u003E\nThis is the fundamental key to how dynamics works, and I discovered that this worked some years ago during development for the mod Ad Astra, and my early attempts with it are still viewable through that mod by looking to the planet Lindor and its Dark Spot, which forms and dissipates regularly over time.\u003Cbr\u003E\u003Cbr\u003E\nOriginally, however, this technique for me was only meant to serve as a means of providing just specific macro level cloud systems, like the Dark Spot, or the eventual Typhoon that featured in Sol. Until I had an epiphany, I was still very much married to the idea of global Cube Maps being the key to higher quality visuals, but Cube Maps have their short comings. For one, the global coverage means that quality is hard to keep consistent across the entire texture (without painstakingly hand-painting it), and this only gets worse depending on the quality of your source and the method with which the cube map itself was generated, and for two, its very static; the clouds will always look the same no matter what, with only the underlying terrain changing. To put it short, cube maps are a pain to work with and unless you are very fortunate, or have the patience to paint it by hand, they still ultimately have shortcomings that leave one wanting.\u003Cbr\u003E\u003Cbr\u003E\nBut Dynamics provides another option, and in fact, provides an option that is much better suited to the sort of game Kerbal Space Program is, where memory is of vital importance. Using Dynamics to create global cloud coverage can not only provide much higher quality and far better consistency, effectively allowing one to have texture qualities as high as one wants without any quality loss from downscaling, it also allows you to do so without an egregious impact to the memory footprint of the mod compared to what would be necessary to replicate the same visual fidelity using other methods. And as a bonus, you get the Dynamics effect itself, allowing your global coverage to never look the same twice.\u003Cbr\u003E\u003Cbr\u003E\nSo, with all that explanation aside (though there\u0027s still quite a bit more), lets get into the nitty gritty. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022border-bottom:1.1pt double #000000;border-left:none;border-right:none;border-top:none;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ETo start, we need to identify and locate a source cloud map that we are going to derive what we will be calling \u003C/span\u003E\u003Cb\u003Ecloud patterns\u003C/b\u003E\u003Cspan\u003E, or \u003C/span\u003E\u003Cb\u003Ecpats\u003C/b\u003E\u003Cspan\u003E. For this, I utilized (and prefer) the Blue Marble imagery available at Visible Earth. I took the highest resolution that was available, and in GIMP, I combined both the E and W files into one, which should provide you with something looks like this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/NPXwgtu.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022NPXwgtu.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002254.02\u0022 width=\u00221007\u0022 src=\u0022https://i.imgur.com/NPXwgtu.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan\u003EWhile the large file size, 43k in this case, can be rough to work with depending on your computer\u0027s specs, do keep in mind that you only need to work with it long enough to extract a cpat.\u003Cbr\u003E\u003Cbr\u003E\nTo do this, the process is quite simple. For this purpose, we are going to assume that we want to have our cpats be at 16k, which is the maximum resolution that KSP can support. To mark out a strict 16k selection, we are going to select our selection tool, and set it to Fixed with a resolution of 16384 x 8192; your settings should resemble the below:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/XhL3uDY.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022XhL3uDY.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u0022209.76\u0022 width=\u0022205\u0022 src=\u0022https://i.imgur.com/XhL3uDY.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EOnce you have this, you can click and drag anywhere on your image, and a selection box should appear that you can then drag around. We want the image to be rectangular, as this will prevent our final cpat from being distorted.\u003Cbr\u003E\u003Cbr\u003E\nFrom there, all you have to do is select some part of your source map that you think looks good or interesting to have as a potential pattern. For this, I selected this section:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/2ELvabB.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00222ELvabB.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002249.13\u0022 width=\u00221038\u0022 src=\u0022https://i.imgur.com/2ELvabB.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cspan\u003ENext, copy the selection, and create a new file in the same resolution (16384x8192), and paste in your image. Add the pasted image as a new layer, and either merge it with the extraneous background or layer, or simply delete that layer.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nWhat this process does is allow for the higher resolution image to be translated to a lower resolution image, without any real loss in quality from more traditional down-scaling methods. We do lose the additional data from the rest of the map, but this on purpose, as we do not want all of that extraneous data anyway, and because we can always just make more cpats. (for Sol, I settled on three primary cloud patterns, with a fourth intended for noctilucent cloud formations)\u003Cbr\u003E\u003Cbr\u003E\nNext, we will need to extract the clouds themselves from the black background. First, ensure that the image has been set to “RGB”, by clicking on Image \u0026gt; Mode \u0026gt; RGB. Then, click on Colors \u0026gt; Color to Alpha.\u003Cbr\u003E\u003Cbr\u003E\nThe Color to Alpha tool will automatically render your selected color transparent. By default it will have selected White, but naturally we want to change this to black. As a first pass, we can click okay once this is completed, and now your texture should look like this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/UeqNiYO.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022UeqNiYO.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002251.78\u0022 width=\u00221093\u0022 src=\u0022https://i.imgur.com/UeqNiYO.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EHowever, we are not quite finished with this step yet. Due to the nature of satellite imagery, a lot of artifacts may be present that you do not want, and this is especially true if you are extracting clouds from images that also include terrain. To sus these artifacts out, make a new layer and fill it with some color; I typically use a dull blue as it gives me some sense of what the clouds will eventually look like.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nOnce you do this, zoom in and inspect your texture, and essentially you are looking for anything you don\u0027t quite like. While my example texture was already cleaned up, I was able to find this section in the upper right:\u003C/span\u003E\u003Cbr\u003E\u003Ca href=\u0022https://i.imgur.com/5DPB9QL.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00225DPB9QL.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002291.94\u0022 width=\u0022782\u0022 src=\u0022https://i.imgur.com/5DPB9QL.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWithout the blue background, details like this may have been easy to overlook until you\u0027ve already gone through the process of getting the cpat into the game. To correct this particular issue, its simply a matter of erasing the offending details.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nA helpful tip if you are extracting clouds from images that feature terrain or other artifacts (such as sunlight reflecting off an ocean; a common occurrence in satellite imagery), is to merge your cpat with your color layer, and then repeat the Color to Alpha process, this time picking the blue color. You may have to click around on the offending spot, and play with the Opacity and Transparency thresholds (which adjust how strict the software is in erasing the chosen color), but eventually you will find a sweet spot that largely, if not completely, erases the artifacts.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAny additional artifacts you find beyond that, simply need to be erased.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nNow, yet again, we are not finished. Zooming back out, you\u0027ll notice that your cloud texture likely extends off the bounds the image. This naturally, will not do for our purposes, unless you\u0027re for some reason wanting to do Minecraft clouds.\u003Cbr\u003E\u003Cbr\u003E\nTo correct unfortunately requires sacrifice. We will need to erase and blend the clouds in such a way that they stay within the bounds of the image, but also still look like clouds.\u003Cbr\u003E\u003Cbr\u003E\nFor this purpose, I recommend locating a quality brush pack for GIMP (utilize sites such as deviantart) that specifically provide brush shapes that mimic clouds or smoke. While I cannot say what tools I have (as I acquired them long ago and their names in my system lend no clues to their origin, other than I know they came from deviantart), the important aspect is that you want cloud or smoke shapes to work with, as they will naturally lend themselves to forming the shapes you want.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nOnce you have one, experiment with the settings and see what results you can get. Ideally for Dynamics, we want the clouds to comprise around 50-60% of the total image, with a good mix of both smaller and larger cloud formations, as this ratio is required to allow for Dynamics to function as expected.\u003Cbr\u003E\u003Cbr\u003E\nI recommend prioritizing the lowest quality or least appealing areas of your image first, before tackling the edges or removing large macro elements from the pattern. With enough experimentation, you should end up with something akin to this image:\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Ca href=\u0022https://i.imgur.com/KTHQ2G4.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022KTHQ2G4.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002250.38\u0022 width=\u00221048\u0022 src=\u0022https://i.imgur.com/KTHQ2G4.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAs you can see above, you may also find it advantageous to flip or mirror the image. There is no hard rule to whether or not that is desirable; your artistic eye simply needs to guide you, and remember that there is no cost in experimentation here. If it ends up looking bad, start over and try again. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ENow, to prepare the image for use in KSP, we need to actually turn it into two different textures. One will be our main tex, and the other our detail tex. The eventual randomized interaction between the two textures, which we will set up once we are in-game, is what enables Dynamics to do what it do.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nNow, the transparent image as we have it is already set up, and this will be our detail texture. First, insure you have save this as an .xcf so that you can always come back to it, and ensure that your background color layer is set to invisible, so you are left with just the layer with the clouds. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThen export the image as a .dds. Ensure your settings match this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/hGqJkFg.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022hGqJkFg.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u0022132.68\u0022 width=\u0022407\u0022 src=\u0022https://i.imgur.com/hGqJkFg.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFor this, we name this as cpat1_d\u003Cbr\u003E\u003Cbr\u003E\nOnce that has completed exporting, we can move on to to the main texture. To generate this, I do not recommend just doubling up on the detail texture. The reason for this is because the interaction between the transparent sections of both textures tends to not look that great in my experience, so instead what we want to do is create a texture that captures the macro shapes of the pattern, but “fills in” some much of the transparencies, allowing for the detail texture to define those alone.\u003Cbr\u003E\n==========================================================================================================================================================\u003Cbr\u003E\nThe process for this is simple. Duplicate the layer multiple times, and as you do so you\u0027ll notice the pattern become progressively bolder as the stacked layers fill in transparencies. I recommend doing this around 4-6 times. Once you have them, merge the copied layers together into one, and you should result in an image like this:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/SH1aNAp.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022SH1aNAp.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002251.00\u0022 width=\u00221055\u0022 src=\u0022https://i.imgur.com/SH1aNAp.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EThe difference here may appear to be subtle, but that is ideal. You do not want it to be too bold, but the pattern should be considerably fuller than its detail counterpart. Export this as a second .dds, this time simply as cpat1 \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWith these two textures in hand, you have all you need to make Dynamics work. Add them to your mod directory, and load up the game.\u003Cbr\u003E\u003Cbr\u003E\nIn the \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E Gui, accessed by Alt-0, or within the tracking station by clicking on the \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E Gui button, create a new layer and name it cpat1. \u003C/span\u003E\u003Cbr\u003E\u003Cspan\u003E==========================================================================================================================================================\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFrom here, the settings you choose are more or less up to you, your tastes, and what you want to do. I can, however give you some general tips going down the line of the options you have available to you.\u003Cbr\u003E\u003Cbr\u003E\nAltitude – Generally speaking, you don\u0027t want clouds to be too high up in the atmosphere, especially at lower scale Solar Systems, as this will look very off from what it should be compared to real life. While achieving the realistic is not completely possible without moving up to Real Scale, you can approximate it, and for this, I recommend a cloud height around 7-10km, and I recommend that for all of your cloud patterns that you make the altitude identical, or only with slight variances. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EKill Body Rotation – This generally is only recommended for things meant to stay stuck to the polar regions. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ESpeed/Detail Speed – Speed governs how fast Main Tex moves across the world, while Detail speed, as you can imagine, governs how fast the Detail Tex moves within its application to the Main Tex. For these, I recommend keeping them relatively low, no more than 20 or 30, but ideally closer to the 2-10 region. You can use negative numbers, and this will help to vary up the directions the two textures move in, which is highly useful if you want to use the same cpat twice, saving both on memory and allowing for a more fuller globe.\u003Cbr\u003E\u003Cbr\u003E\nOffset – This setting appears to move the texture away from a particular center point, however it is quite limited and typically only works well if you specifically need something to hang, with no movement, in a specific location on the planet. This is useful for providing things like lava flows, algae blooms, smoke clouds, meteors, etc.\u003Cbr\u003E\u003Cbr\u003E\nRotation – These settings naturally govern how the layer itself rotates as it moves. You can use these to set up singular cyclonic storms, however do note that due to shortcomings in the Offset setting (namely that it doesn\u0027t allow you to offset where the center point of a layer is), you may not be able to get your cyclone to behave properly except on one location on the planet. Hopefully in future versions of \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E these settings can be expanded on to allow for greater control.\u003Cbr\u003E\u003Cbr\u003E\nArc – I\u0027ve never seen any reason to use this. It controls how much of your texture displays over one half of the planet, but the effect does not seem to be entirely useful.\u003Cbr\u003E\u003Cbr\u003E\nColor – This is more or less self-explanitory, though I will note that you can exceed the 255 numbers, as well as go negative if you wish. This is useful for balancing \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E\u0027s interactions with scatterer, enabling you to get clouds that do not look too starkly white, but while also still getting the vibrant terminators that settings in scatterer can provide you.\u003Cbr\u003E\u003Cbr\u003E\nDetail Scale – This is a critical setting for Dynamics, and it must be set to 1, otherwise dynamics will not work as intended. Using scales higher than one will shrink and repeat the detail texture, which is not what we want; we want Main Tex and Detail Tex to be 1:1.\u003Cbr\u003E\u003Cbr\u003E\nDetail Distance – This setting affects how the layer appears at various zoom distances. A setting of -2E-07 is recommended here. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EDistFade – If this setting has an effect, I have not been able to identify it.\u003Cbr\u003E\u003Cbr\u003E\nDistFadeVert – I recommend using the same as Detail Distance, though like DistFade I am not certain what effect this setting has. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EUV Noise Settings – If you have a useful UV texture, I would recommend following the advice of others who have dealt with these. I have not, so I will not speak to them authoritatively. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E==========================================================================================================================================================\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EFinally, you also want to ensure you have enabled Layer 2D. Most of the settings in here should be left alone, other than MinLight and ShadowFactor. Minlight when set to a positive number will cause your cloud layer to appear on the night side at various brightnesses. This is mostly used for Auroras and other lighted effects, but as I will cover in the City Lights section, this also has use for enabling an effect that I find is stupidly called “cloud glow”. Shadow factor is up to personal tastes, but it is good to note that higher values will induce unnatural darkness on the ground, so be wary; it may look good in orbit but you may second guess the value if your rocket launch in the sun is being cast into darkness by a tiny speck of cloud texture.\u003Cbr\u003E\u003Cbr\u003E\nOnce all of these settings are ready, you\u0027re done! Apply the layer and save it to your config. Once you change scenes, or press the Map Eve Clouds button in the Scatterer GUI, you can enter time warp and see how your new cloud pattern periodically forms and dissipates at random over time. By adding additional cpats, repeating them, and varying their settings, you can achieve global cloud coverage that is always dynamic, and seldom boring.\u003Cbr\u003E\u003Cbr\u003E\nPerformance wise, it is fully dependent on how many repeated cpat layers you have going at once, and naturally the resolution you created the textures at. For Sol, I settled on a repetition of four, with each of the three main cpats being repeated four times with varied speed and detail speed settings to achieve a global coverage that I was satisfied with. With smaller resolution textures, you could potentially push this number to greater heights, though I will note that it is possible to have too much layered over top of one another at once, so be wary.\u003Cbr\u003E\u003Cbr\u003E\n==========================================================================================================================================================\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAs an added bonus, I am also going to, much less thoroughly, explain how to achieve the apparently lost “art” of cloud glow, an effect that was apparently quite popular in older visual mods prior to a change in \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E that changed how the Minlight setting worked.\u003Cbr\u003E\u003Cbr\u003E\nThe solution, incredibly, to bringing the effect back was astonishingly simple and brain dead.\u003Cbr\u003E\u003Cbr\u003E\nAre you ready?\u003Cbr\u003E\u003Cbr\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cem\u003EUse \u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cu\u003E\u003Cem\u003E\u003Cb\u003Etwo\u003C/b\u003E\u003C/em\u003E\u003C/u\u003E\u003C/span\u003E\u003Cspan\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cem\u003E citylight configs.\u003C/em\u003E\u003C/span\u003E\u003Cbr\u003E\u003Cbr\u003E\nIts dumb, it shouldn\u0027t work, but it does.\u003Cbr\u003E\u003Cbr\u003E\nIn order to achieve the effect, like we see here:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://i.imgur.com/6LFbVzl.png\u0022 title=\u0022Enlarge image\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00226LFbVzl.png\u0022 class=\u0022ipsImage_thumbnailed\u0022 data-ratio=\u002290.00\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/6LFbVzl.png\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cspan\u003EWhat you want to do is take your CityLights texture, and apply a substantial Gaussian Blur filter to it. It shouldn\u0027t be so high that it becomes indiscernible where the lights were, but it shouldn\u0027t be so low that the lights are only slightly blurry.\u003Cbr\u003E\u003Cbr\u003E\nOnce you have this, you will also need to create new detail textures for what we will call CityLights_G\u003Cbr\u003E\u003Cbr\u003E\nAs a result of how the CityLights feature works in \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E, you will need set your day texture to a blank, nothing texture, as small as you can get it. This is necessary to prevent the glow from appearing on the day side of the planet. To maintain consistency, I recommend taking your night texture, and applying the same gaussian blur filter to it; you want most of the details to vanish in the blur for this one. I call these dayglow and nightglow respectively.\u003Cbr\u003E\u003Cbr\u003E\nNow, due to \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003E\u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E\u003C/abbr\u003E being unable to support the creation of two simultaneous CityLights for the same body in its GUI, this will instead have to be done through the configs directly.\u003Cbr\u003E\u003Cbr\u003E\nSimply take your CityLights config file, copy and paste it, and rename it to CityLights_G or whatever other name you would like to give. In the settings, change the texture paths to your new textures. Once you\u0027re done, save the config, and it just simply works. While you will not be able to toy with the _G layer itself in-game, it is relatively trivial to make any adjustments to its config.\u003Cbr\u003E\u003Cbr\u003E\nTo achieve the final piece of the cloud glow puzzle, you simply need to enable Minlight on your cloud layers. For this, I recommend a setting between 0.2 and 0.4, as this will allow the clouds to still show up on the night side, but will prevent them from being starkly visible even on the Moon, which is a shortcoming of the old method to this effect. The _G layer will shine through the now visible clouds (provided the texture is transparent) and, with some possible adjustments to the _G texture, you can achieve a look that mimics the real life nature of lights being scattered and dispersed across a cloud at night. \u003C/span\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206207-ballisticfox0/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022206207\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/206207-ballisticfox0/\u0022 rel=\u0022\u0022\u003E@ballisticfox0\u003C/a\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMan wasn’t expecting this! Thanks for all the info, I’ll definitely try this out! \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}