{"TopicId":224147,"ForumId":144,"TopicTitle":"Gourmand mission will not complete if surface samples are returned before you get contract. [Even after trying to complete it again]","CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2024-03-17T01:51:26Z","PageNum":1,"Articles":[{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2024-03-17T01:51:26Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EReported Version:\u003C/strong\u003E v0.2.1 (latest) | \u003Cstrong\u003EMods: \u003C/strong\u003EK2-D2, Micro Engineer, Maeuver Node Controller, Node Manager, orbital survey. | \u003Cstrong\u003ECan replicate without mods?\u003C/strong\u003E No \u003Cbr\u003E\n\u003Cstrong\u003EOS:\u003C/strong\u003E Windows 10 | \u003Cstrong\u003ECPU:\u003C/strong\u003E AMD Rysen 9 5950X | \u003Cstrong\u003EGPU:\u003C/strong\u003E 3070ti | \u003Cstrong\u003ERAM\u003Cspan\u003E: \u003C/span\u003E\u003C/strong\u003E64GB\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWent to Moho early as I had an launch window, this arrived before I reached Duna. Did land at the croissant and orge rock and did highland and lowland biomes. \u003Cbr\u003E\nAlso landed an probe at the moheart as I know it would come up later. \u003Cbr\u003E\nHad also explored Gilly and landed probes at Eve. \u003Cbr\u003E\nReturned to Kerbin. \u003Cbr\u003E\nThen reached Duna and the monument. \u003Cbr\u003E\nCash in from orbit of Eve, the Gilly crater and the moheart but not Gourmand even if surface samples was returned.\u003Cbr\u003E\n\u003Cbr\u003E\nI did land and got surface samples again from the croissant doing radiation science and returned this again but it did not help.\u003Cbr\u003E\n\u003Cbr\u003E\nI think the Gourmand mission should be before moheart as its an easier one. For moheart you are landing on an very uneven surface in the bottom of an hole and terrain is bugged so larger landing legs and wheels make you bounce around. \n\u003C/p\u003E\n\u003Cp\u003E\n-----\u003Cbr\u003E\nNot an bug you can easy replicate without mods without replaying the story but is also very unlikely to be mod related. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIncluded Attachments:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222024-03-18T21:43:51Z\u0022 title=\u002203/18/2024 09:43  PM\u0022 data-short=\u0022Mar 18\u0022\u003EMarch 18\u003C/time\u003E by Spicat\u003C/strong\u003E\n\u003C/span\u003E\n"}]}