{"TopicId":100343,"ForumId":55,"TopicTitle":"Redo the command pod development.","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-02-21T18:09:12Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-02-21T18:09:12Z","Content":"Start with a sphere-pod, the Type-1 Piloting Sphere. No aerodynamics, only a reflecting heatshield, fragile and a bit lighter than a Mk1 pod. Based on Vostok/Voskhod. I mean, we do have Valentina Kerman now, after all. No EVA hatch, even with the Astronaut Complex upgrade, you can only EVA on the ground.\n\nThen we get the Mk1 Command Capsule, a 1-Kerbal crewpod with a proper heatshield, monopropellant storage, a top mounting point. No EVA hatch.\n\nThen the Mk2 Command Capsule, a 2-Kerbal crewpod with a heatshield, monoprop storage, RCS thrusters, and a working EVA hatch. (You still need the Astronaut Complex upgrade)\n\nAt the same time we also get the Mk1 Lander Can, because we really need that to be able to land on the Mun! How is the astronaut actually going to be able to land on the Mun without a downwards facing view? This capsule hasn\u0027t a heatshield at all, is very light, stores plenty of monopropellant for its size, and has a low impact tolerance. We also get the small docking port jr, which should not be able to transfer crew. By this time we\u0027re on FL-T800s and LV-T45 technology in the propulsion part of the tree.\n\nAround the same time we get the Mainsail, we now get the Mk1-2 Command Module, a 3-Kerbal Crewpod with a heatshield, RCS thrusters and fuel, and plenty of space for the Kerbals to live in on, say, a 3-day trip to the Mun or a 40-day trip to Minmus. Then we get the Mk2 Lander Can.\n\nThen we get the Mk3 Command Module, a 3.75m 4-Kerbal pod that has plenty of space, and works as a science lab maybe?"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2015-02-21T23:17:31Z","Content":"I think would be nice to have a 1-kerbal capsule with an EVA hatch that isn\u0027t a lander can at some point, just so you\u0027re not forced to use 2-kerbal pods exclusively after a point. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Voidryder","CreatedById":57308,"CreatedDateTime":"2015-02-21T23:29:32Z","Content":"I already play that progression using various mods so I wholeheartedly endorse your idea...because everybody should play KSP just like me. Just kidding. \n\nBut I do like the progression."}]}