{"TopicId":100688,"ForumId":55,"TopicTitle":"About building crafts","CreatedByName":"rdem","CreatedById":125277,"CreatedDateTime":"2015-02-25T10:33:50Z","PageNum":1,"Articles":[{"CreatedByName":"rdem","CreatedById":125277,"CreatedDateTime":"2015-02-25T10:33:50Z","Content":"\n\u003Cp\u003EIn ksp after designing a craft you can launch it directly and it costs you as the sum of the each part\u0027s price.\u003C/p\u003E\u003Cp\u003EBuilding the craft is free. When it comes to recovering it you get back the craft as funds. So you can design new crafts for every specific mission. But in reality, seperating parts and rebuilding them for every different mission is inefficient. So they make multi-purpouse spacecrafts and re-use them. (such as space shuttle). \u003C/p\u003E\u003Cp\u003EI think you shouldn\u0027t be able to design and launch it directly. After designing it you must produce it before launching. And then you have one of that craft. If you recover that craft after using, it should come you as the craft. (not funds) Rebuilding a new craft form that should cost extra money. If you damage the craft, you should be able to repair it.\u003C/p\u003E\n"},{"CreatedByName":"Lhathron the Elf","CreatedById":118706,"CreatedDateTime":"2015-02-25T10:52:27Z","Content":"\n\u003Cp\u003EI think this is a good idea, but it doesn\u0027t really fit the style of KSP. It might not be really worthwhile to add all of the stuff you\u0027re talking about, simply because most people accept the current system and there are more worthwhile things for the devs to be doing.\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2015-02-25T15:41:57Z","Content":"\n\u003Cp\u003EThe main problem is that we usually need to revert to VAB quite often (everytime) to correct or improve over a design flaw or a staging error.\u003C/p\u003E\u003Cp\u003ESo I count that amongst necessary break from reality, not that KSP is that realist either.\u003C/p\u003E\u003Cp\u003EHowever you do not need to specifically wait during the construction to make it feel like it took time.\u003C/p\u003E\u003Cp\u003EThrough OTHER time-based game-mechanic such as hypothetical periodic budget or time, you could aways retroactively pretend the rocket took time to be built as long as you didn\u0027t launched 1 rocket per hour.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-02-25T16:03:50Z","Content":"\n\u003Cp\u003E\u0022Revert\u0022 for basic design failures (or forgetting to put parts on, or the staging screwed up, etc) is not functionally much different from \u0022simulation.\u0022 KCT has simulation at launch, which costs a small amount of funds per try, and works well to distinguish testing a design at the space center (on paper in the old days, computer later) from actually launching it. With KCT I never revert at all, without it, I will do so if I screw up staging or have the wrong crew aboard, or if the SRBs don\u0027t properly separate (even though I have radial decouplers AND 2 sepratrons per SRB).\u003C/p\u003E\n"}]}