{"TopicId":101337,"ForumId":55,"TopicTitle":"Set an engine to constant thrust","CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2015-03-06T00:26:07Z","PageNum":1,"Articles":[{"CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2015-03-06T00:26:07Z","Content":"I hope no one has suggested something like this. \n\nI think it would be a good idea to have an option to set the thrust for an engine to be unaffected by the level of throttle being applied.\n\nAt the moment I am designing a shuttle. My first stage works well, and the second stage is ok until a certain point, when the COM deviates too far from the thrust vector and the shuttle starts to do somersaults. One way of preventing this would be to constantly be adjusting the thrust limiter on one engine, to ensure that I had control over the direction of my thrust vector, but a much more user friendly way would be to have one engine set to constant 100% thrust whilst swithced on, and the others having adjustable thrust.\n\nThis is effectively what I do with my first stage. I have a constant thrust of the SRBs and I make adjustments to the thrust of my liquid fuel engines to maintain a steady trajectory as the COM changes. Once ignited, the engine without throttle control would probably have to be shut down using action groups."},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-03-07T16:15:43Z","Content":"I\u0027d like something similar: multiple engine groups each with separate thrust control, so that we can do Delta-IV Heavy -style ascent (throttle back central core while outer cores remain at full throttle). I could be mistaken but i think something like that has recently been proposed."},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-03-07T17:44:50Z","Content":"So..... a thrust limiter? ![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif)\n\nI think I know what you mean, and the way that I would implement it would be having a \u0022Minimum Thrust\u0022 slider (in kilonewtons), that when the engine is on (And throttle is not zero), it can never go below that thrust. Also, replacing the thrust limiter with a kilonewton readout, instead of a percentage, for transparency reasons, and renaming it to \u0022Maximum Thrust\u0022. If you were to put the Min and Max sliders in the same spot, the thrust would not change.\n\nSuch a system would allow for other things as well: VTOLs that can\u0027t go below a certain descent rate, for example."},{"CreatedByName":"KrazyKrl","CreatedById":65849,"CreatedDateTime":"2015-03-07T19:29:15Z","Content":"\u003E \n\u003E So..... a thrust limiter? ![:huh:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif)\n\u003E I think I know what you mean, and the way that I would implement it would be having a \u0022Minimum Thrust\u0022 slider (in kilonewtons), that when the engine is on (And throttle is not zero), it can never go below that thrust. Also, replacing the thrust limiter with a kilonewton readout, instead of a percentage, for transparency reasons, and renaming it to \u0022Maximum Thrust\u0022. If you were to put the Min and Max sliders in the same spot, the thrust would not change.\n\u003E \n\u003E Such a system would allow for other things as well: VTOLs that can\u0027t go below a certain descent rate, for example.\n\nI would love to see the thrust limiter be scaled via KN thrust. And for the OP, I believe he means an \u0022ignore main throttle\u0022 boolean for the engines also.\n\ni.e. you have turboVTOL Mk3...\n\nVertical engines are set with \u0022ignore throttle position\u0022 on toggle, on action group 3\n\nVertical engines are set with \u0022shutdown engine\u0022 on toggle, on action group 4\n\nHorizontal engines are set with \u0022ignore throttle position\u0022 on toggle, on action group 5\n\nVertical and Horizontal engines are set with \u0022ignore throttle position\u0022 DISABLE, on action group 9\n\nVertical engines are set to 30KN - 100KN thrust limit (30% - 100%)\n\nHorizontal engines are set to 0KN - 500KN thrust limit (0% - 100%)\n\nWhat this would let you do; is let you use the main throttle position to control each engines one at a time (Since multiple throttles aren\u0027t implemented). Along with a floor on the Vertical lift engine thrust while they are enabled.\n\n**Edited \u003Ctime datetime=\u00222015-03-07T19:32:13Z\u0022 title=\u002203/07/2015 07:32  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 7, 2015\u003C/time\u003E by KrazyKrl**"},{"CreatedByName":"DundraL","CreatedById":118705,"CreatedDateTime":"2015-03-08T02:08:35Z","Content":"How about an action group toggle to \u0022lock thrust level\u0022 on engines in that action group?"},{"CreatedByName":"Daze","CreatedById":57997,"CreatedDateTime":"2015-03-08T02:17:38Z","Content":"Correlated to this i would love to make the player able to create their thrust curve for SRB"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2015-03-09T00:15:11Z","Content":"[http://forum.kerbalspaceprogram.com/threads/67270-Throttle-Controlled-Avionics-1-4-1-0-90-(5-January-15)](https://forum.kerbalspaceprogram.com/threads/67270-Throttle-Controlled-Avionics-1-4-1-0-90-%285-January-15%29)"}]}