{"TopicId":101576,"ForumId":55,"TopicTitle":"Kerbal Service Record Log","CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-03-09T00:00:25Z","PageNum":1,"Articles":[{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-03-09T00:00:25Z","Content":"I think it would be cool to be able to (better) track the things each of my Kerbals have done. Right now when you mouse over a Kerbal in the astronaut complex you can see a record of all the experience gains they have had, but I would like an option to open up a more detailed window/tab showing a log of all they have done. I can envision a summary section that keeps track of some running totals and also a log of every completed mission.\n\nHere are some things that might be tracked in the summary of the log:\n\nEnlist date\n\nTotal flight time\n\nTotal distance traveled\n\nTotal number of flights (SPH)\n\nTotal number of launches (VAB)\n\nMost visited celestial body\n\nA completed mission may look like this (with MET shown):\n\nLaunch from KSC pad\n\nSuborbital trajectory at Kerbin\n\nOrbit around Kerbin\n\nEcounter with Mun\n\nOrbit around Mun\n\nEscape from Mun\n\nOrbit around Kerbin\n\nLanded at Kerbin\n\nIdeally you could view a list of all completed missions and expand or collapse them to see the details. For a mission to count as completed you must recover the Kerbal on Kerbin. The game could keep a running log of the mission and discard it if you revert or quickload - the data would only be added permanently with a successful recovery on Kerbin. If all of this data was saved in this fashion then it would also be possible to display it in a timeline format to show the mission history of your space program (another oft-suggested feature I like).\n\nIt should also be possible to correlate this mission info with science data records. Since this log would be recorded at the time of vehicle recovery, a tag could be applied to all science data and these mission logs so that you could cross-reference it in the science archives. I.e. when you view the science data you could then see what mission acquired it.\n\nThe specifics don\u0027t need to work exactly as I\u0027ve suggested, I would be happy with any way to view the history of the missions I\u0027ve run in the past and see some of the cumulative stats for my Kerbals beyond what we already see for their experience. I may know that Jeb has landed on the Mun, but I have no way of seeing that he\u0027s actually accomplished that feat on 10 different missions."},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-03-09T09:10:54Z","Content":"Have a look at [Final Frontier](https://forum.kerbalspaceprogram.com/threads/67246-0-90-Final-Frontier-kerbal-individual-merits-0-6-5-697) sometime - it does quite a lot of what you\u0027re looking for. I agree that it would be good to have something similar in stock though."},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-03-09T23:54:36Z","Content":"I\u0027d also like to be able to see what planets a given kerbalnaut has landed on *during the current mission*, i.e., not \u0022logged\u0022 back at KSC yet. For instance, suppose Doodtron Kerman is currently stationed at Mun Orbital Command, and has definitely landed on Mun... but I can\u0027t remember if, prior to that, he was also at Minmus Orbital Command and landed on Minmus. It\u0027d be nice if I could find out *before* returning him to KSC."},{"CreatedByName":"Tainer","CreatedById":123018,"CreatedDateTime":"2015-07-12T21:40:27Z","Content":"Hello everyone.\n\nI also believe that, this mod should exists. Since I didn\u0027t find any solution I started my own development. It is my first experience on KSP mod development. However, I already have an alpha version of the mod. If you are interested to try you may find the it on the [github](https://github.com/xandrd/Kistory). It does not do much, but I hope I will create eventually something useful."}]}