{"TopicId":102215,"ForumId":55,"TopicTitle":"Parts upgrades","CreatedByName":"Crusher48","CreatedById":135642,"CreatedDateTime":"2015-03-18T18:49:51Z","PageNum":1,"Articles":[{"CreatedByName":"Crusher48","CreatedById":135642,"CreatedDateTime":"2015-03-18T18:49:51Z","Content":"\n\u003Cp\u003EFinished the tech tree and have excessive amounts of SCIENCE! lying around? Need every ounce of possible thrust for the next mission? If so, upgraded parts could be just what you need.\u003C/p\u003E\u003Cp\u003EThe idea: after a tech node is unlocked, parts in that node fall into individual tiers of upgrades:\u003C/p\u003E\u003Cp\u003EPrototype: If a part is unlocked but the funds fee is not paid for (said fee representing testing fees and such), or if the node is not unlocked (aka its an experimental part from a parts test contract), the part is weaker than it would be because not all the bugs are worked out. Some key value of the part is reduced by 10-25%.\u003C/p\u003E\u003Cp\u003EStandard: Once you unlock the node and pay the funds fee to develop the part, you get the standard out-of-the-box part with no bonuses.\u003C/p\u003E\u003Cp\u003ETier 1: Boosts a key value of the part by 5%, costs science equal to the node cost for that part\u0027s node.\u003C/p\u003E\u003Cp\u003ETier 2: Boosts a key value of the part by 10%, costs science equal to double the node cost for that part\u0027s node.\u003C/p\u003E\u003Cp\u003ETier 3: Boosts a key value of the part by 15%, costs science equal to quadruple the node cost for that part\u0027s node.\u003C/p\u003E\u003Cp\u003EKey Values: The key values involved in upgrades depend on what the part is: fuel efficiency or thrust for an engine, fuel capacity or mass for a fuel tank or battery, efficiency for solar panels, or impact tolerance on structural parts. Obviously, some parts would have no key value to upgrade and thus would not be upgradeable.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-03-18T18:52:16Z","Content":"\n\u003Cp\u003EI wonder how many times this has been \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/44952-Already-Suggested-List\u0022 rel=\u0022external nofollow\u0022\u003Ealready suggested\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Jaffa Cookie","CreatedById":139554,"CreatedDateTime":"2015-03-21T18:56:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EI wonder how many times this has been \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/44952-Already-Suggested-List\u0022 rel=\u0022external nofollow\u0022\u003Ealready suggested\u003C/a\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehummm. Too many\u003C/p\u003E\n"}]}