{"TopicId":102415,"ForumId":55,"TopicTitle":"What should the 1.0 trailer be like?","CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-21T19:49:18Z","PageNum":1,"Articles":[{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-21T19:49:18Z","Content":"I have been thinking about the game trailer for 1.0. I think that it should focus on the whole game, rather than just the new features being added to KSP, like other update trailers have. My idea is basically a new version of the \u0022Build Fly Dream\u0022 trailer; a montage of different gameplay clips. I think that there should be things in the trailer that most people would recognize: A shuttle-like spaceplane, large solar panels on a station, a descent stage left at the Mun. \n\nHere is my idea:\n\n-Sunrise over a silhouetted planet\n\n-cut to a shot of a flag and descent stage on the Mun, with Kerbin in the sky\n\n-A rover driving on Duna\n\n-A far-away shot of a plane flying at Laythe, with Jool in the sky\n\n-A space station over Eeloo, looking back at Kerbol\n\n-A lone Kerbal on Ike, looking up at Duna\n\nThat would just e the opening sequence, just my ideas. What do you think the trailer should be like?"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-03-21T19:53:30Z","Content":"Explosions!"},{"CreatedByName":"CG_Kerbin","CreatedById":117777,"CreatedDateTime":"2015-03-21T21:10:04Z","Content":"\u003E \n\u003E Explosions!\n\n100% no question asked you click on the video and bam it\u0027s over"},{"CreatedByName":"Halban","CreatedById":89536,"CreatedDateTime":"2015-03-21T23:55:04Z","Content":"I\u0027d love to do something like this, unfortunately it does mean I\u0027d have to wait until 1.0 is released ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-03-21T23:59:34Z","Content":"Nassault, come here goddamit"},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2015-03-22T00:01:11Z","Content":"\u003E \n\u003E Nassault, come here goddamit\n\nHe\u0027s busy doing his KSP-animated film with Scott Manley."},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-03-22T08:35:40Z","Content":"Montage depicting the gradual buildup of a space program, from simple rockets to satellites to Mun landings to space stations to huge interplanetary motherships, all set to \u0022Fanfare for the Common Man,\u0022 because that piece of music is just screaming \u0022BEHOLD THE AMAZING THINGS WE CAN ACCOMPLISH IF WE WORK TOGETHER\u0022"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2015-03-22T09:18:34Z","Content":"I think it should be made up of 99.9% in-game video. If in-game visuals are not pretty enough, then improve them until they are.\n\nSell the product, not the marketing video."},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-03-22T09:23:26Z","Content":"\u003E \n\u003E I think it should be made up of 99.9% in-game video. If in-game visuals are not pretty enough, then improve them until they are.\n\u003E Sell the product, not the marketing video.\n\n/\\ This.\n\n||"},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2015-03-22T09:24:27Z","Content":"\u003E \n\u003E Explosions!\n\nKerbal Space Program 1.0 Trailer\n\nDirected by Michael Bay"},{"CreatedByName":"Rainbowtrout","CreatedById":60253,"CreatedDateTime":"2015-03-22T09:35:55Z","Content":"Mostly what everyone else has said, but with some comedy, similar to the 0.20 trailer."},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2015-03-22T10:33:32Z","Content":"I actually think that explosions would be a bad thing to include. I think the trailer should focus on all of the things you can accomplish."},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2015-03-22T10:51:54Z","Content":"\u003E \n\u003E I actually think that explosions would be a bad thing to include. I think the trailer should focus on all of the things you can accomplish.\n\nyup, this\n\nOtherwise people would play and buy the game *only for* explosions and wacky stuff, and not for the science and exploration."},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2015-03-22T11:44:26Z","Content":"I\u0027d like to see a fairly even balance between funny Kerbal hijinks, and actually designing and flying spaceships. I like the Kerbal hijinks! But far too many of the past update videos would leave a new potential customer uncertain what the game is really about.\n\nKind of like how many years ago there was a series of commercials meant to attract customers to their local flight school, and learn to fly an airplane. The commercials featured slow sweeping skyviews, lots of puffy clouds and sunrises, not an airplane in sight, while the voiceover droned on about realizing your dreams and soaring with the wind. I thought they were selling some kind of new age hippy meditation crap! Never guessed for a second the commercials were meant to get people into school for a pilot\u0027s license.\n\nSimilarly, the big release trailer needs to make it clear that KSP is mostly about building and flying spaceships. All the other stuff is cool too, Kerbals can be funny... but that\u0027s the core gameplay."},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-03-22T11:49:02Z","Content":"\u003E \n\u003E I\u0027d like to see a fairly even balance between funny Kerbal hijinks, and actually designing and flying spaceships. I like the Kerbal hijinks! But far too many of the past update videos would leave a new potential customer uncertain what the game is really about.\n\u003E Kind of like how many years ago there was a series of commercials meant to attract customers to their local flight school, and learn to fly an airplane. The commercials featured slow sweeping skyviews, lots of puffy clouds and sunrises, not an airplane in sight, while the voiceover droned on about realizing your dreams and soaring with the wind. I thought they were selling some kind of new age hippy meditation crap! Never guessed for a second the commercials were meant to get people into school for a pilot\u0027s license.\n\u003E \n\u003E Similarly, the big release trailer needs to make it clear that KSP is mostly about building and flying spaceships. All the other stuff is cool too, Kerbals can be funny... but that\u0027s the core gameplay.\n\nI wholeheartedly agree. I have heard that those who attend the big gaming conventions, the ones where gaming companies reveal their new games, get very angry if they get some fancy cinematic, rather than a look at the actual gameplay. \n\nHowever, space is one of those things I feel you cannot overlook without pointing out the beauty. Perhaps the trailer could have parts where a player is seen building a rocket. Then a cinematic part could carry out that rocket\u0027s mission. That way, the point tat KSP is all about rocket building and flying should be pretty clear."},{"CreatedByName":"Majorjim!","CreatedById":61954,"CreatedDateTime":"2015-03-22T12:59:20Z","Content":"\u003E \n\u003E I think it should be made up of 99.9% in-game video. If in-game visuals are not pretty enough, then improve them until they are.\n\u003E Sell the product, not the marketing video.\n\nAgreed, 100%"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-03-22T14:02:44Z","Content":"\u003E \n\u003E Explosions!\n\nHow about the creativity and sense of wonder the game can provide?\n\n- - - Updated - - -\n\n\u003E \n\u003E I think it should be made up of 99.9% in-game video. If in-game visuals are not pretty enough, then improve them until they are.\n\u003E Sell the product, not the marketing video.\n\nAbsolutely this."},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-03-22T14:10:22Z","Content":"\u003E \n\u003E ...The commercials featured slow sweeping skyviews, lots of puffy clouds and sunrises, not an airplane in sight.\n\nThe way you wrote this immediately reminded me of the story of how the Infinity car brand was introduced to the world. The first commercials were the exact same thing, only at ground level. They showed the *experience* of moving along scenic roads, without a car. Someone observed at the time: *\u0022I don\u0027t know what this ad does for Infinity, but, the sales of rocks and trees went up overnight!\u0022*"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-03-22T14:47:58Z","Content":"\u003E \n\u003E How about the creativity and sense of wonder the game can provide?\n\n\u003E \n\u003E I think it should be made up of 99.9% in-game video. If in-game visuals are not pretty enough, then improve them until they are.\n\u003E Sell the product, not the marketing video.\n\nYaaaaaaaas\n\n**Edited \u003Ctime datetime=\u00222015-03-22T14:51:18Z\u0022 title=\u002203/22/2015 02:51  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 22, 2015\u003C/time\u003E by Cpt. Kipard**"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2015-03-22T17:12:44Z","Content":"It should show brief clips of things relevant to KSP 1.0\u0027s new features and the history of KSP\n\nIn this order, here\u0027s my idea-\n\nScene 1-Ingame footage, with some camera trickery not in the real game (I\u0027m sure Squad could mess with cameras for a cinematic)\n\n-Launching of a rocket in every KSP version. Each version should have a few seconds.\n\n-The last \u0022old version\u0022 will show the rocket blasting into the distance.\n\n-Fade out to next scene.\n\nScene 2-Filmed using mostly in-game footage, possibly using some camera trickery not in the real game.\n\n-A small lifting body/short wing spaceplane is re-entering, showing re-entry effects and a thermometer animation to show heating. (Think Dream Chaser)\n\n-The plane lands on the KSC runway\n\n-Cut forward to a rocket launch with a fairing.\n\n-Close-up on rocket\u0027s engines, showing the thrust going up with a \u0022gauge\u0022 animation.\n\n-The first stage cuts off and the upper stage ignites. I believe we will be getting some visual effects with engines, so this would showcase those.\n\n-The fairing splits open (close-up view) to reveal the spaceplane from the start of the scene.\n\n-Scene cuts to black\n\nScene 3 - Uses original animation for IVA scenes with ingame footage outside.\n\n-We see Valentina piloting the rocket. (IVA-animation)\n\n-The second stage cuts off and the spaceplane separates and begins to use RCS.\n\n-We see a space station in the distance and Valentina\u0027s lifting body docks.\n\n-Inside the station, Valentina is welcomed. (IVA-animation)\n\n-The Kerbals celebrate Valentina\u0027s arrival and the new technology of her rocket. As the camera pans away from the Kerbals, we see a banner that says KSP 1.0 - \u0022Ready for Liftoff\u0022 (That\u0027s my name for this version) IVA-animation\n\n-The scene fades to black except for the logo banner, which stays on the screen."},{"CreatedByName":"Francois424","CreatedById":98138,"CreatedDateTime":"2015-03-22T17:27:23Z","Content":"@GigaG: your first scene makes me think of that scene at movie theaters when we see the Wright bro\u0027s plane, then biplane, then P51 mustang, then F18, Shuttle, and finally an interstellar ship. And it\u0027s a good Idea, except this time with KSP versions, brilliant.\n\nGood Ideas all around =)"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-03-22T20:35:35Z","Content":"I think they should cooperate with Nassault some more. He directs his stuff well, and with some actual CGIs from the art team it could be even better."},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-03-22T21:46:01Z","Content":"Pods blowing up from re-entry heat and ships tumbling out of control from the aerodynamics."},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-03-22T21:51:11Z","Content":"\u003E \n\u003E I think they should cooperate with Nassault some more. He directs his stuff well, and with some actual CGIs from the art team it could be even better.\n\nBoom, right on the money! Gotta have it look good, right? ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-03-22T21:57:18Z","Content":"Build Fly Dream.\n\nOr a montage of launch failures while playing \u0022In the Hall of the Mountain King\u0022."}]}