{"TopicId":103735,"ForumId":55,"TopicTitle":"A Different Approach To Mk2/3 Docking","CreatedByName":"Bomoo","CreatedById":78616,"CreatedDateTime":"2015-04-09T03:53:23Z","PageNum":1,"Articles":[{"CreatedByName":"Bomoo","CreatedById":78616,"CreatedDateTime":"2015-04-09T03:53:23Z","Content":"\n\u003Cp\u003EThe suggestion is that the Mk2 Clamp-o-tron be converted from a full fuselage \u0022slice\u0022 into a module that can fit inside the Mk2 payload bays. The idea is that it would help in the flexibility of spaceplane designs if you could simply yank things out of the payload bay depending on what you\u0027re doing. Just like the Space Shuttle, in fact. \u003C/p\u003E\u003Cp\u003EAdditionally, it would create uses for the payload bay other than carrying... what exactly are they meant to carry? Small satellites? I\u0027ve always used them more as a utility slice, and filled them with all kinds of things like batteries, SAS modules, RTGs, KAS containers, etc., and I think an Mk2 clampo \u002B SAS with radial batteries (and an RTG or two) would be a perfect fit for a small cargo bay.\u003C/p\u003E\u003Cp\u003EYou might even be able to re-use this proposed Mk2 fuselage-less clampo for Mk3 without it looking dumb, as it currently does when trying to create a Mk3 docking solution with the Mk2 or 1.25m fuselage slice clamp-o-trons. I\u0027d suggest doing the same thing for the 1.25m extendable clampo, but as there\u0027s no 1.25m payload bay, so it kinda needs to stay the way it is. However, I think for Mk2 it\u0027s a legit suggestion, and would have the further benefit of freeing you from needing to design things like Mk2 SAS and battery slices, reducing part bloat. Think about it? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks for reading.\u003C/p\u003E\u003Cp\u003EEdit: might even be able to fit another 1.25m slice in there.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steamusercontent.com/ugc/532890227336839994/BAC6B33C1AC635C02148F6AB26F65DCE5A205968/\u0022 alt=\u0022BAC6B33C1AC635C02148F6AB26F65DCE5A205968\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-04-09T04:11:32Z\u0022 title=\u002204/09/2015 04:11  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 9, 2015\u003C/time\u003E by Bomoo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-04-09T12:21:59Z","Content":"\n\u003Cp\u003ESo I suppose this suggestion is meant for Mk3 docking? It seems like you have the solution for Mk2 right there!\u003C/p\u003E\u003Cp\u003EAs it stands, I read in the recent devblog about some \u0022new parts from Porkjet\u0022 that I can only imagine are spaceplane parts. I think that spaceplanes are getting a big revamp in 1.0, so I think it would be wise to wait and see what they come up with for us. In the meantime, though, I don\u0027t really use many spaceplanes anyway... But of course you could probably use Mk3 cargo bays and fit in an Inline Clamp-o-Tron in there, maybe even the Mk2 Inline, and have that be your internal docking array. Dumb-looking, maybe, but it\u0027ll do the job until we do get Mk3 Inlines.\u003C/p\u003E\n"},{"CreatedByName":"Bomoo","CreatedById":78616,"CreatedDateTime":"2015-04-09T14:31:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maximus97\u0022 data-cite=\u0022Maximus97\u0022\u003E\u003Cdiv\u003ESo I suppose this suggestion is meant for Mk3 docking? It seems like you have the solution for Mk2 right there!\u003Cp\u003EAs it stands, I read in the recent devblog about some \u0022new parts from Porkjet\u0022 that I can only imagine are spaceplane parts. I think that spaceplanes are getting a big revamp in 1.0, so I think it would be wise to wait and see what they come up with for us. In the meantime, though, I don\u0027t really use many spaceplanes anyway... But of course you could probably use Mk3 cargo bays and fit in an Inline Clamp-o-Tron in there, maybe even the Mk2 Inline, and have that be your internal docking array. Dumb-looking, maybe, but it\u0027ll do the job until we do get Mk3 Inlines.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, no, that\u0027s not a solution so much as a mockup to show that the Mk2 clampo fits comfortably into the Mk2 payload bay, and with room to spare for SAS and batteries. What I\u0027m asking for is for at least the option to remove the Mk2 fuselage casing of the clampo inside so it can be used inside the payload bay without them clipping, and so that it can be used with Mk3. Personally, I don\u0027t use Mk3 at all, but given that it lacks a docking module, this could serve in both roles if the Mk2 fuselage casing were either removed or made toggle-able, and with the side benefit of reducing part bloat.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2015-04-09T15:47:07Z","Content":"\n\u003Cp\u003ESo, basically use the Mk1 inline clamp-o-tron in a 1/2 sized mk2 cargo bay.\u003C/p\u003E\n"},{"CreatedByName":"Bomoo","CreatedById":78616,"CreatedDateTime":"2015-04-10T18:46:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022awsumindyman\u0022 data-cite=\u0022awsumindyman\u0022\u003E\u003Cdiv\u003ESo, basically use the Mk1 inline clamp-o-tron in a 1/2 sized mk2 cargo bay.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo? Did you not read the post?\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2015-04-10T19:15:28Z","Content":"\n\u003Cp\u003EI think the idea is closer to an extendable clamp-o-tron module that can extend out of a cargo bay. \u003C/p\u003E\u003Cp\u003Enot sure how to make that look nice though.\u003C/p\u003E\n"},{"CreatedByName":"Bomoo","CreatedById":78616,"CreatedDateTime":"2015-04-10T19:45:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003EI think the idea is closer to an extendable clamp-o-tron module that can extend out of a cargo bay. \u003Cp\u003Enot sure how to make that look nice though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe suggestion is for the same extendable clampotron with 150 monoprop capacity as the Mk2 clampo slice, but without the Mk2 fuselage casing and colliders.\u003C/p\u003E\n"}]}