{"TopicId":103736,"ForumId":55,"TopicTitle":"Career Mode Suggestion","CreatedByName":"Conbadicus","CreatedById":133171,"CreatedDateTime":"2015-04-09T04:15:35Z","PageNum":1,"Articles":[{"CreatedByName":"Conbadicus","CreatedById":133171,"CreatedDateTime":"2015-04-09T04:15:35Z","Content":"I have a hard time playing through career mode because the curve is quite odd. I feel like all the little missions you do for money are a bit off putting. Example - open parachute at x high at y speed. It seems kind of pointless and you end up just doing these things for the cash but completing them in really weird ways. \n\nPersonally I\u0027d like to see a more directed campaign (of course with choices) that help unlock things in a more logical way but also helps you learn about ship building and what not."},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-04-09T12:17:55Z","Content":"Honestly, I feel like the stock game does that already. I mean, at the beginning, you have access to only an antenna, a pod, an SRB, a parachute, liquidFuel tanks and an engine. It can\u0027t get a whole lot simpler than that, and those parts enable the new user to see the most basic of basic rocket designs. All other rockets are just bigger and more complicated versions of that first rocket that rolls out of the VAB.\n\nBut I do want to hear more about your idea- What do you mean by \u0022directed campaign?\u0022 Inquiring minds want to know! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-04-09T15:14:36Z","Content":"I\u0027ve found the part testing contracts useful for collecting science. Sometimes it\u0027s fun to build a rocket that gets to 2.9km really fast just to activate a part and then be recovered. Some of the part testing contracts are dumb, but I think in general they don\u0027t get enough respect. But I think what you\u0027re saying is that the part tests are an awkward thing to spend your time doing when you\u0027re trying to run a Space Agency. Not that Space Agency\u0027s don\u0027t spend time part testing (they probably spend way more time than we imagine) but that doesn\u0027t make it a fun thing to do in a Space Agency game."},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-04-10T00:40:32Z","Content":"I usually try to use the contracts as a way to get paid for things I was going to do anyway.\n\nWhen part-testing contracts are the only ones available, I try to collect a bunch of them that have the same target location (e.g. all \u0022landed at Kerbin\u0022 or all \u0022in orbit around Kerbin\u0022 or whatever) and build one big ugly probe with all the relevant parts so I can fulfill all of them in one go and then recover what\u0027s left."}]}