{"TopicId":106245,"ForumId":55,"TopicTitle":"Career Mode - why not sats first ?","CreatedByName":"konbert","CreatedById":142350,"CreatedDateTime":"2015-04-30T08:43:53Z","PageNum":1,"Articles":[{"CreatedByName":"konbert","CreatedById":142350,"CreatedDateTime":"2015-04-30T08:43:53Z","Content":"\n\u003Cp\u003EI like the 1.0 update very much, but I still don\u0027t like the career mode.\u003C/p\u003E\u003Cp\u003EWhy isn\u0027t it satellites first?\u003C/p\u003E\u003Cp\u003EI have a contract to bring four tourists to the mun, and all I have is a command pod (might stack them, but five of them?).\u003C/p\u003E\u003Cp\u003EAnd I still haven\u0027t had a sat in orbit.\u003C/p\u003E\u003Cp\u003ENothing against a steep learning curve but I really wish it would be more logical and step by step.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2015-04-30T11:44:06Z","Content":"\n\u003Cp\u003EIf you\u0027d like to be able to work with unmanned machnies first please visit us in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/99521\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E and voice your dissatisfaction with the current tech-tree. Individually we are like twigs; feeble and easily dismissed, but together we create a mighty bundle of sticks tied together. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cdr_Zeta","CreatedById":59015,"CreatedDateTime":"2015-04-30T12:53:46Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI sort of agree that this makes more sense; trouble is that satellites are after precision engineering.\u003C/p\u003E\u003Cp\u003EI moved some sats up to precengr etc in the parts; this also may allow contracts to appear sooner.\u003C/p\u003E\u003Cp\u003EZeta\u003C/p\u003E\n"},{"CreatedByName":"basic.syntax","CreatedById":109920,"CreatedDateTime":"2015-04-30T13:52:42Z","Content":"\n\u003Cp\u003ESquad clearly wants to put the focus on Kerbals first: they give the game its character, and make it a game \u003Cem\u003E(as in: an entertainment.)\u003C/em\u003E \u003C/p\u003E\u003Cp\u003ESeeing their goofy expressions gives the broader audience additional \u003Cem\u003Ereasons\u003C/em\u003E to play, much more than a dry simulation would.\u003C/p\u003E\u003Cp\u003EKSP would not have gained nearly the following it has, without these interactive mascots.\u003C/p\u003E\u003Cp\u003EIt\u0027s very unlikely that Squad would change the career game to \u0022unmanned first.\u0022\u003C/p\u003E\n"}]}