{"TopicId":106422,"ForumId":55,"TopicTitle":"Balance pass of max temp of parts","CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2015-04-30T23:15:27Z","PageNum":1,"Articles":[{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2015-04-30T23:15:27Z","Content":"\n\u003Cp\u003EStock parts have amazingly high heat tolerances!\u003C/p\u003E\u003Cp\u003EHeatshields and plane parts I can understand as they would have special coatings to survive reentry. But even delicate things like science experiments have max temp ratings of 2000\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESteel melts at 1500\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAluminium alloy it 650\u003C/p\u003E\u003Cp\u003EMy suggestion is to lower temperatures across the board, then adjust atmospheric heating to balance. The result would increase the educational value of the game and simply make more sense.\u003C/p\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2015-04-30T23:35:27Z","Content":"\n\u003Cp\u003EFailure shouldn\u0027t even be when the sheath starts melting; structural failure can occur far before then. \u003C/p\u003E\u003Cp\u003EI think pretty much everything should have a heat shield component, significantly less than heat-shields themselves, of course; and then be very delicate once that component burns off. That outer coating is only going to last so long.\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2015-04-30T23:37:03Z","Content":"\n\u003Cp\u003EI think all temps are in Kelvin so add 272 to those numbers.\u003C/p\u003E\n"},{"CreatedByName":"Paul Kingtiger","CreatedById":57455,"CreatedDateTime":"2015-05-01T01:32:05Z","Content":"\n\u003Cp\u003EUsing the thermometer on the launch pad you get a reading of 287 so I think you\u0027re right.\u003C/p\u003E\u003Cp\u003E2000 Kelvin is still above the melting point of steel though, 1000 would be more like it.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2015-05-01T05:45:30Z","Content":"\n\u003Cp\u003EYeah it was confirmed to be kelvins. I noticed that a lot of parts have the exact same rating - I smell placeholder values!\u003C/p\u003E\u003Cp\u003EGood thing we\u0027re still \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ealpha\u003C/span\u003E \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ebeta\u003C/span\u003E er, that Electronic Arts made it such that a product isn\u0027t complete until the 50th patch five years AFTER official release...\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-05-01T08:47:39Z","Content":"\n\u003Cp\u003ESpaceplane parts should at least be made of titanium, which has a melting point of 1668c, and which would make those parts very expensive.\u003C/p\u003E\n"},{"CreatedByName":"Chris_2","CreatedById":63827,"CreatedDateTime":"2015-05-01T10:17:28Z","Content":"\n\u003Cp\u003EThe biggest problem of the new system is the way too high thermal conduction. Heat should be much more localized to the place where the heat is generated. In what reality does the cockpit of a spaceplane heat to 1500Ã‚Â°C from burning a rocket engine? Sure, the engine might get hot (well, actually, just the nozzle and combustion chamber of the rocket will heat or else there will be serious problems...), but now -my entire spaceplane- becomes glowing hot. So, decreasing the heat resistance of parts (that shouldn\u0027t have heat resistance) is not really possible, as these parts would then be destroyed as the spacecraft becomes \u0027uniformely hot\u0027 during an LV-N burn or reÃƒÂ«ntry. The solution is obvious: increase the thermal capacity of parts; decrease the thermal conduction between parts; then heat will become much more localized and only then the heat resistance of some can be decreased.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-01T10:23:09Z\u0022 title=\u002205/01/2015 10:23  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 1, 2015\u003C/time\u003E by Chris_2\u003C/strong\u003E\n\u003C/span\u003E\n"}]}