{"TopicId":106710,"ForumId":55,"TopicTitle":"Checklist item: Clamps in earlier stage than engines","CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2015-05-01T23:23:16Z","PageNum":1,"Articles":[{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2015-05-01T23:23:16Z","Content":"If your launch clamps are in a stage before you\u0027ve turned on your engines, you\u0027re gonna have a bad time. The report should warn about that."},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-05-01T23:37:28Z","Content":"I really like this idea, and I think it should also warn if the launch clamps detach after engine burn."},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2015-05-01T23:41:01Z","Content":"\u003E \n\u003E I really like this idea, and I think it should also warn if the launch clamps detach after engine burn.\n\nI think real rockets actually burn the engines for a second or two prior to releasing the clamps, in order to make sure they\u0027re working."},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-05-01T23:46:09Z","Content":"You know what can really bork a launch? Clamps in a LATER stage than your first stage, which is now pushing itself through the rest of your rocket.\n\nMy assessment would be that clamps anywhere outside stage 1 should get a \u0022you\u0027re aware of that, right?\u0022 kind of warning."},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2015-05-01T23:53:17Z","Content":"The clamps should be set to the bottom stage by default. Only in very certain circumstances would I want it differently."},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-05-02T00:14:49Z","Content":"\u003E \n\u003E The clamps should be set to the bottom stage by default. Only in very certain circumstances would I want it differently.\n\nI disagree.\n\nLike zarakon suggests, I like to start my first stage engines first, spool them up to nominal thrust and then release the launch clamps. You don\u0027t want to be releasing the clamps on the rocket, letting it fall for x metres and then start the engines ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-05-02T00:22:38Z","Content":"If there was a way it could tell if the clamps were more then one stage after main engine start, that would be handy. Of course an item that stops you from placing clamps before MES would mess up any FASA launch towers."},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-05-02T02:24:50Z","Content":"\u003E \n\u003E I like to start my first stage engines first, spool them up to nominal thrust and then release the launch clamps.\n\nI don\u0027t actually do that, but can definitely see the appeal. I\u0027m not sure there\u0027s any rhyme or reason to how the launch clamps appear in the staging order right now, though, and putting them in the first stage sounds like a useful default."},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-05-02T03:21:33Z","Content":"It would be acceptable to give the warning if the clamps are either in a stage after the first engines or in the same stage as the first engines. You just don\u0027t want the clamps to unlock when there is no thrust.\n\n\u003E \n\u003E I really like this idea, and I think it should also warn if the launch clamps detach after engine burn.\n\nDepends on the rocket, but they are actually spooling/heating up because they don\u0027t provide instantaneous thrust like KSP.\n\n**Edited \u003Ctime datetime=\u00222015-05-02T03:26:29Z\u0022 title=\u002205/02/2015 03:26  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 2, 2015\u003C/time\u003E by Alshain**"},{"CreatedByName":"federicoaa","CreatedById":94879,"CreatedDateTime":"2015-05-02T03:39:48Z","Content":"Actually, it\u0027s more important that all clamps are in the same stage.\n\nTypical designs have clamps in either last or one stage after last."}]}