{"TopicId":107007,"ForumId":55,"TopicTitle":"Civilians/Tourists gather at launches based on reputation","CreatedByName":"Deathstick","CreatedById":108771,"CreatedDateTime":"2015-05-02T22:45:45Z","PageNum":1,"Articles":[{"CreatedByName":"Deathstick","CreatedById":108771,"CreatedDateTime":"2015-05-02T22:45:45Z","Content":"This is more of an immersion/visual type of suggestion, but ever since I played KSP, I always thought it would be nice to see civilian kerbals gather around the launch pad before you\u0027re about to launch.\n\nBasically a mixture of the different kerbal models, some maybe in plain clothing/tourist clothing and of course a few of the engineer and scientist kerbal models we already have, gathering in a circle around the launch pad and maybe the sides of the runway. Not really sure if they\u0027d have any \u0022AI,\u0022 but I\u0027d imagine they\u0027d have a few loops of animation alternating between clapping/cheering, watching, writing on a notepad (journalist type kerbal with fedora ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) ), taking out a camera and snapping a few pictures, etc.\n\nI think it would be cool if it were somehow tied into your current level of reputation, so when you first start out maybe there\u0027s just one or two kerbals that came out to watch the show. When you have a lot of reputation, it\u0027s more of a massive crowd. If you have negative reputation, maybe a few of the kerbals come out to jeer or it\u0027s kerbals waving picket signs.\n\n--------------------------\n\nTo expand on the idea even further, perhaps certain types of upgrades to the Kerbal Space Center become unlocked once you hit a certain level of reputation, which you can then buy with credits.\n\n Things like upgradeable benches that the audience sits in to watch (Tier 0 no bench/just a dirt path with a railing, Tier 1 rusty metal benches with the railing (so some kerbals can still have standing animations/lean up against the railing in front), Tier 2 more sets of seats with a nice blue finish, etc.) \n\nAnd of course it would be awesome if you could unlock an actual countdown timer board that you can trigger off/set the clock. Basically a 3D model of the timer in the background by the stands that uses an animated texture to count down from. Maybe by default the screen is blank, but the player can click on it to start the counter. The actual stage of the rocket would be triggered by the player as it is currently of course. Mostly just a nice little piece of immersion for a successful (or terrible!) Space Program ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n--------------------------\n\nAnd if you really wanted to integrate it even further, you could give the player the option to either turn on or off the possibility of Kerbals showing up for a launch. (For those players that would like to have more private launches, or so it makes sense that a bunch of tourists don\u0027t show up on a secret government contract/testing a prototype/etc.)\n\nI\u0027d imagine it would make sense to have the menus (that let you purchase these types of upgrades and turn on/off launchpads and runways to the public) tied into the administration building as another tab in the GUI. Maybe some of the strategies feed into the amount and type of tourists as well, such as outsourcing science causing more scientists to show up, running an advertising campaign causes more tourists and photographers to show up even with a low reputation (some type of simple formula like reputation x percentage of strategy, etc.)\n\nNot the most game-changing feature, but I figured it would be fun, make reputation a bit more visual in terms of feedback, and add to the immersion ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Vexxus9999","CreatedById":138637,"CreatedDateTime":"2015-05-03T03:45:37Z","Content":"Yes.\n\nAll of the Yes."},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-05-03T04:13:26Z","Content":"A comprehensive and well-written post - you have my support as well."},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-05-03T05:41:35Z","Content":"The main problem is that it would take a lot of RAM and considering KSPs history of memory leaks, it would probably have one as well. Six that and you have all my yes"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-03T09:44:42Z","Content":"cool idea. \u002B1"},{"CreatedByName":"DevoidLight","CreatedById":60164,"CreatedDateTime":"2015-05-03T10:23:48Z","Content":"Only if my launches can \u0027accidentally\u0027 fail and cause collateral damage =D"},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-03T10:57:28Z","Content":"\u003E \n\u003E Only if my launches can \u0027accidentally\u0027 fail and cause collateral damage =D\n\nthat shouldn\u0027t even be a question, we are still talking about ksp, aren\u0027t we? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\n**Edited \u003Ctime datetime=\u00222015-05-03T12:03:07Z\u0022 title=\u002205/03/2015 12:03  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by TothAval**"},{"CreatedByName":"ToddEth","CreatedById":141196,"CreatedDateTime":"2015-05-17T22:46:28Z","Content":"Brilliant and articulate post. Well done sir."},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2015-05-17T22:50:07Z","Content":"That\u0027s a good idea, but if I recall correctly the grand stands at the real KSC are a mile or more away from the launch pad. Could definitely see a strategy effect though where if you have enough rep you can charge admission and get more funds."}]}