{"TopicId":107178,"ForumId":55,"TopicTitle":"Fuel Draw on rockets and planes","CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2015-05-03T13:59:24Z","PageNum":1,"Articles":[{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2015-05-03T13:59:24Z","Content":"I am noticing issues with fuel draw in 1.0.2\n\nIn order to get anything into orbit I have to manually control fuel draw to take from the bottom tanks first. It would be nice if there was some way to specify fuel draw order when building.\n\nAnother issue is that with a rocket plane I built for in atmo flights, the aero engines took from all the tanks available but the rocket engine could only take from the tanks inline with it (this is without pipes) and the upshot was the rocket was unable to complete the burn because it ran out of liquid fuel before it ran out of oxidiser as the liquid fuel had been pilfered by the aero engines. So now I have to micro that as well and it strikes me that this is an edge case of trying to make planes more flyable. \n\nMaybe if aero engines can get fuel from other tanks to assist balance the rocket engines might be better off doing the same. But really what we need is a system which allows us to decide which engines draw what fuel from which sources in what order. I guess that is asking a lot but I thought it was a good way to bring up these observations and start a discussion. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"martinborgen","CreatedById":142875,"CreatedDateTime":"2015-05-03T14:06:10Z","Content":"@ fuel draw, it was in the changelog I believe, jet engines now drain liquid fuel evenly from all tanks, or something like that it said."},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-05-03T14:20:02Z","Content":"Being able to choose which tanks jet engines take fuel from would be good.\n\nThe current system really can cause issues if you try to use both rockets and jets on the same stage."},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-05-03T14:23:26Z","Content":"I really don\u0027t understand why Squad did this. First, add wet wings. Second, balance your plane around wet wings and internal tanks.\n\nIf I want the fuel to flow in a specific manner, let me use a small bladder and fuel lines. Don\u0027t force an unnecessary mechanic into the game.\n\n![internal_fuel_tanks.jpg](http://www.f-15e.info/joomla/images/stories/illustrations/technology/fuel_system/internal_fuel_tanks.jpg)"}]}