{"TopicId":107212,"ForumId":55,"TopicTitle":"Would increased atmosphere heights improve the aero model?","CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2015-05-03T16:58:33Z","PageNum":1,"Articles":[{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2015-05-03T16:58:33Z","Content":"\n\u003Cp\u003EOkay. A lot of different opinions and preferences have been expressed recently over the 1.0.0, 1.0.1, 1.0.2 aero issues).\u003C/p\u003E\u003Cp\u003EI have read on a few occasions that one of the limitations is due to the size of the planets being quite small, so and as the atmospheres are in scale (more or less) they too are very thin (in height not soupiness).\u003C/p\u003E\u003Cp\u003EGiven that making the planets themselves bigger would probably not be am option would making the atmospheres reach higher altitudes offer the opportunity to achieve a similar effect? \u003C/p\u003E\u003Cp\u003EIf they were higher by say 50% kerbin\u0027s would be about 105 km high. Orbital speeds would change and there would be half as much again to fall through giving more time for heat to take effect. Also if the density at sea level stayed as is then the change in density with altitude would be more gradual.\u003C/p\u003E\u003Cp\u003EWhat do you think? Is my thinking viable? Would it work? What have I not thought about?\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-03T20:03:55Z","Content":"\n\u003Cp\u003EThe atmosphere is already quite a bit thicker than in .90. The total height didn\u0027t change, but the falloff in pressure and density is lower, so at 40km there\u0027s over twice as much pressure as in .90.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-03T20:44:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NathanKell\u0022 data-cite=\u0022NathanKell\u0022\u003E\u003Cdiv\u003EThe atmosphere is already quite a bit thicker than in .90. The total height didn\u0027t change, but the falloff in pressure and density is lower, so at 40km there\u0027s over twice as much pressure as in .90.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood lord! Any more and kerbals will be \u003Cem\u003Eswimming \u003C/em\u003Ethrough their atmosphere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2015-05-07T03:26:41Z","Content":"\n\u003Cp\u003EI felt it was already too thick at the top. It should actually dissipate rather than just suddenly drop off.\u003C/p\u003E\n"}]}