{"TopicId":107274,"ForumId":55,"TopicTitle":"Disabling SAS when going EVA","CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-05-03T20:39:48Z","PageNum":1,"Articles":[{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-05-03T20:39:48Z","Content":"If you have a single pod craft, when you go on EVA from it the SAS gets switched off. I find this rather annoying as the craft will often start spinning as you leave it, and you can\u0027t stop it spinning until you manage to get back in (or cheat and timewarp briefly). I know this is because of the game mechanic of requiring a pilot to actually fly a craft, but it seems like a bit of an oversight. It\u0027s like saying you can only have the parking brake on while the driver is still in the car! \n\nI accept that the craft needs a pilot in order to fly it, but the way it is now any Kerbal can control heading/pitch/roll they just can\u0027t switch on the SAS. Perhaps it would be better to say that only a pilot can actually control heading/pitch/roll and the SAS remains in whatever state the pilot left it in. \n\nOR (so other kerbals can still actually fly things if you don\u0027t mind flying without SAS), the SAS can only be toggled by a pilot (as it is now), BUT if the pilot leaves it switched on when going EVA it remains on. Then (to stop this being an exploit to allow non-pilots to have SAS) if you then try to turn the craft without a pilot present the SAS automatically switches off, but if you don\u0027t touch the controls it remains on and hold the craft steady.\n\nI guess the workaround is to always have a probe core on board, but then...why do I even need pilots?"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-05-03T20:42:56Z","Content":"I think more accurately, SAS *is* the pilot. It\u0027s the pilot who sits there and \u0027assists\u0027 the player by making course corrections as instructed ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nBut yeah, probe cores are your friend. Very useful if you manage to fling your kerbal away from the ship by accident too xD"}]}