{"TopicId":107635,"ForumId":55,"TopicTitle":"Interplanetary liquid fuel tanks","CreatedByName":"cptdavep","CreatedById":129771,"CreatedDateTime":"2015-05-05T12:13:21Z","PageNum":1,"Articles":[{"CreatedByName":"cptdavep","CreatedById":129771,"CreatedDateTime":"2015-05-05T12:13:21Z","Content":"With the LV-N now using liquid fuel only do we now need some more liquid fuel tanks? It looks odd making an interplanetary ship using aircraft parts, and it\u0027s a waste of space/mass using normal tanks without the oxygen. \n\nWhat would be really cool would be if we had a few tanks similar to the orange hydrogen tanks from Near Future Propulsion, the spherical ones in particular are awesome looking for interplanetary craft. While we\u0027re at it it would be good to have a 2.5m version of the LV-N too so we can have engines inline rather than attached to the side.\n\nLV-N really is the only engine worth using to go to Moho/Jool/Eeloo, so it would be good to have some more variety in the ships we can build for these trips. It\u0027ll be an even bigger deal when squad get round to that second gas giant..."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-05-05T20:03:25Z","Content":"These are necessary, and the sooner the better. The LV-Ns are best used on big ships making long burns, and that means either big fuel tanks, or piles of small ones adding to part count."},{"CreatedByName":"kiros","CreatedById":133006,"CreatedDateTime":"2015-05-11T14:01:04Z","Content":"it really is so super simple to add them your self, i just copied the rockomax 64 and changed its config file from\n\n                 RESOURCE    {        name = LiquidFuel        amount = 2880        maxAmount = 2880    }    RESOURCE    {        name = Oxidizer        amount = 3520        maxAmount = 3520    }\n\nto \n\n               RESOURCE    {        name = LiquidFuel        amount = 5760        maxAmount = 5760    }\n\nand you could do this with all the stock fuel tanks"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2015-05-11T14:13:29Z","Content":"\u003E \n\u003E With the LV-N now using liquid fuel only do we now need some more liquid fuel tanks?\n\nUse spaceplane fuel tanks. Or take regular fuel tank and remove oxidizer.\n\n\u003E \n\u003E It looks odd making an interplanetary ship using aircraft parts, and it\u0027s a waste of space/mass using normal tanks without the oxygen.\n\nIt\u0027s \u0022waste of space\u0022 only because you think it is so. You still get an outstanding amount of thrust out of the fuel tank volume comparing to regular engines.\n\n\u003E \n\u003E What would be really cool would be if we had a few tanks similar to the orange hydrogen tanks from Near Future Propulsion, the spherical ones in particular are awesome looking for interplanetary craft. While we\u0027re at it it would be good to have a 2.5m version of the LV-N too so we can have engines inline rather than attached to the side.\n\nIMHO - they aren\u0027t necessary - in fact LV-Ns have more options than any other type of engine. \n\nAnd nuclear engines aren\u0027t the only option for interplanetary missions, you can make them just fine with regular engines.\n\n\u003E \n\u003E LV-N really is the only engine worth using to go to Moho/Jool/Eeloo\n\nNo, it\u0027s not. It\u0027s the easiest and most lazy engine to use for these kind of missions, but certainly not the \u0022only engine worth using\u0022.\n\n\u003E \n\u003E so it would be good to have some more variety in the ships we can build for these trips\n\nYou already have that variety with existing fuel tanks."},{"CreatedByName":"MacroNova","CreatedById":126611,"CreatedDateTime":"2015-05-11T14:40:08Z","Content":"There\u0027s really no reason not to include a couple of additional liquid-fuel only tanks for the LV-N. Players notice right away how silly it is to have to drain the oxidizer from a tank and have no way to refill it with liquid fuel, which means you need to use twice the tanks unless you want to change your design. \n\n\u003E \n\u003E It\u0027s \u0022waste of space\u0022 only because you think it is so. You still get an outstanding amount of thrust out of the fuel tank volume comparing to regular engines.\n\nlol, no it\u0027s objectively a waste of space, since you are launching half-full tanks. Just because you think the amount of thrust/dV/efficiency is \u0022outstanding,\u0022 it doesn\u0027t change the facts.\n\n\u003E \n\u003E No, it\u0027s not. It\u0027s the easiest and **most lazy** engine to use for these kind of missions, but certainly not the \u0022only engine worth using\u0022.\n\nYeah, stay classy."},{"CreatedByName":"POllik","CreatedById":92403,"CreatedDateTime":"2015-05-29T18:41:07Z","Content":"\u003E \n\u003E it really is so super simple to add them your self, i just copied the rockomax 64 and changed its config file from\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E                  RESOURCE    {        name = LiquidFuel        amount = 2880        maxAmount = 2880    }    RESOURCE    {        name = Oxidizer        amount = 3520        maxAmount = 3520    }\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E to \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \n\u003E                RESOURCE    {        name = LiquidFuel        amount = 5760        maxAmount = 5760    }\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E and you could do this with all the stock fuel tanks\n\nWhich config file are we talking about here? And how would it work if, say, you didn\u0027t want to convert Rockomax 64 to liquid fuel (which would make a mess of many of my ships, but wanted to create a new Rockomax LV64 instead?"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-29T19:09:49Z","Content":"Yes, please. The game really needs a 2.5m LF tank with non-awful mass ratio now that we have LF-only LV-Ns."},{"CreatedByName":"Feradose","CreatedById":111211,"CreatedDateTime":"2015-05-30T10:03:41Z","Content":"\u003E \n\u003E Which config file are we talking about here? And how would it work if, say, you didn\u0027t want to convert Rockomax 64 to liquid fuel (which would make a mess of many of my ships, but wanted to create a new Rockomax LV64 instead?\n\nMake a new folder for it, change name to Rockomax LV64 and voila, your LFO rockomax stays and you have your own Liquid fuel tank with the same model and textures"},{"CreatedByName":"Bogeyman","CreatedById":136919,"CreatedDateTime":"2015-06-26T20:19:37Z","Content":"Sorry to warm up this threat but to me the question is still up to date.\n\nAre there any plans now as to come up with some additional interplanetary tanks for the nuclear motor?"},{"CreatedByName":"Vkihyone","CreatedById":148778,"CreatedDateTime":"2015-07-27T17:40:57Z","Content":"I\u0027m in agreement here with most everyone here, we do need some more liquid fuel only tanks besides just the space plane tanks, if I knew how to make my own mods I would build them myself but I\u0027m not that clever."},{"CreatedByName":"CaptainTurbomuffin","CreatedById":113456,"CreatedDateTime":"2015-07-27T18:10:37Z","Content":"I can only say what I said at the other thread about nukes:\n\nIncreasing the thrust of1m nukes could also be a solution. Once their TWR was lowered by increasing their mass and lowering their thrust. The \u0027worst\u0027 was that they started to consume only LF, making NERVA-powered rockets carry more than half-empty fuel tanks (but also making them realistic). Instead of lowering their thrust, I think something should be done like removing gimbal, power generation, and limiting its usage. For example, you can run them for \u003Cbalanced value=\u0022\u0022 here=\u0022\u0022\u003E minutes only, before their reactor core is depleted. After that, you have to recover them. 2m version: a lot less effective than 1m versions, just like with any other engines, but having extras like gimbal and power gen, and longer life?\u003C/balanced\u003E\n\nHaving a right-click option for each fuel tank, to carry either LFO, LF, or nothing(structural) would also be nice."},{"CreatedByName":"logan2611","CreatedById":148925,"CreatedDateTime":"2015-07-28T22:07:15Z","Content":"Here is a solution: Remove the oxidizer in the VAB. Won\u0027t get as much as fuel as you would, but it would make it lighter and thus you wouldn\u0027t have to haul around useless cargo."},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-07-28T23:17:41Z","Content":"No. We don\u0027t need any more tanks. What we need is a tweakable to make them LF only."},{"CreatedByName":"Hagen von Tronje","CreatedById":148278,"CreatedDateTime":"2015-07-29T03:46:42Z","Content":"\u003E \n\u003E No. We don\u0027t need any more tanks. What we need is a tweakable to make them LF only.\n\nI like this idea best. Would make a lot more sense not just with NERVAs but with spaceplanes where you might want to tweak liquid/oxy ratios to suit missions without leaving a bunch of empty fuselage space, as well as control where mass is removed from during flight more effectively."},{"CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2015-07-29T04:30:50Z","Content":"I would love to get more fuel tanks and adapters that that are strictly for liquid fuel, you wouldn\u0027t have to set oxidizer tanks to 0, and maybe they could be lighter then even setting oxi\u0027s to 0"},{"CreatedByName":"Kaos","CreatedById":110849,"CreatedDateTime":"2015-08-05T20:16:32Z","Content":"I would like a inflatable tank, that can only hold fuel in expanded mode, in which it has the best mass/fuel ratio but is extremely fragile then (at most 0.5g, do not even think about atmosphere with this tank). This would be an interplanetary tank. Currently we mostly have planetary stuff that happens to be suitable for space."},{"CreatedByName":"Dante80","CreatedById":91509,"CreatedDateTime":"2015-08-05T20:21:33Z","Content":"Modular Fuel Tanks allows any supported tank to be filled with exactly how much or how little fuel you want, of whatever type you want (though different tanks may allow or disallow certain fuels; jet fuel tanks won\u0027t take oxidizer for instance).\n\n[http://forum.kerbalspaceprogram.com/threads/64117-1-0-4-Modular-Fuel-Tanks-v5-6-0](https://forum.kerbalspaceprogram.com/threads/64117-1-0-4-Modular-Fuel-Tanks-v5-6-0)\n\nNo need for new parts or stock tweakables."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-08-05T21:22:46Z","Content":"\u003E \n\u003E No need for new parts or stock tweakables.\n\n...unless you don\u0027t use mods, like many (likely most) players."},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-08-06T00:01:42Z","Content":"yup yup some things have to be stock regarding the \u0022player base\u0022 (ages, pgm, casu, younger ones, funny gamers, etc.) ... \n\n... imho too ..."},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-08-14T12:39:08Z","Content":"With the advent of stock procedural parts (Fairings), there appears to me to be no logical reason why stock tanks would not be completely procedural and tweakable - size, profiles, content, textures, and likely even more... sure, you could allow a paced unlocking of the various procedural methods/limits based on science nodes, ok whatever...\n\nIf implemented, players would benefit from reductions in part count, more flexibility in the design process, etc. Arguments in favour of retaining the current lego block stock part methods (AKA the ridiculous high number of specialised tank configurations) make me shudder just like when I recall lessons concerning the luddites."},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-08-14T13:19:57Z","Content":"\u003E \n\u003E With the advent of stock procedural parts (Fairings), there appears to me to be no logical reason why stock tanks would not be completely procedural and tweakable - size, profiles, content, textures, and likely even more... sure, you could allow a paced unlocking of the various procedural methods/limits based on science nodes, ok whatever...\n\u003E If implemented, players would benefit from reductions in part count, more flexibility in the design process, etc. Arguments in favour of retaining the current lego block stock part methods (AKA the ridiculous high number of specialised tank configurations) make me shudder just like when I recall lessons concerning the luddites.\n\nAs much as I would love to have more fuel tweakables I hate the idea of parts being procedural. And I know that it would allow for less parts per vessel, but it wouldn\u0027t be the same game anymore.\n\nCall me crazy, but I actually really enjoy the LEGO rockets and toy solar system for ants."},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-08-15T06:49:18Z","Content":"some part could benefit from procedural, not all.\n\nFuel tank could =\u003E shape, max and min lenght (within current limit for exemple); max and min diameter(within current limit for exemple); texture applied related matter, optional procedural integrated module integration like battery and a few other things."},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2015-08-18T13:39:24Z","Content":"\u003E \n\u003E Call me crazy, but I actually really enjoy the LEGO rockets and toy solar system for ants.\n\n\u0022Procedural\u0022 doesn\u0027t necessarily mean that it has to be scalable by the millimeter. It can as well be three distinct diameters and (say) six different heights. And yes, tweakable content would be highly desirable."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-08-18T13:48:36Z","Content":"I\u0027m all for the tweakables, and they can be discrete values for lengths, this doesn\u0027t mean that fuel tanks cease to be \u0022lego.\u0022 Heck, just tweaking the contents, same tanks."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-08-18T13:55:48Z","Content":"\u003E \n\u003E Heck, just tweaking the contents, same tanks.\n\nThis would be my solution of choice. We have enough variety in tank sizes and shapes, just let us adjust what they hold."}]}