{"TopicId":107827,"ForumId":55,"TopicTitle":"Suggestions and long term wishes from a noob","CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-06T05:45:28Z","PageNum":1,"Articles":[{"CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-06T05:45:28Z","Content":"\n\u003Cp\u003EI have just started playing KSP and absolutely suck at everything for the moment. Nevertheless I have some things I would like to have in the game which are not:\u003C/p\u003E\u003Cp\u003E1: It is hard to tell astronauts apart. I tried sending two of them in a capsule each on the same ship into orbit, and I had a hard time keeping track of which was which and doing what even with just the two of them up there. I would like to be able to tell which capsule is occupied just by looking at them. I would also like to be able to tell whether an astronaut is a scientist, an engineer or a pilot just by looking at them. Perhaps different colored uniforms depending on job or some way of customizing them even? Failing that, is there some way of renaming them to something other than Bill and Bob Kerbal? If there isn\u0060t then that would be a good idea as well.\u003C/p\u003E\u003Cp\u003E2: A log of the research you\u0060ve done. Not the tech tree stuff but biomes. Since you get different equipment at different times it can be too much to keep track of whether you\u0060ve landed with your barometer in a desert or whether or not you brought your goo canister to a particular crater on Mun. And the more gear you get and places you can get to the more impossible it gets. Perhaps a biome breakdown tab in the science facility that registers each biome you\u0060ve done any research in, which experiments you\u0060ve done etc. But please please, oh pretty please with sugar on top give me some way of keeping track of all this! If my head explodes it will be your fault!\u003C/p\u003E\u003Cp\u003E3: I know the game is hard enough as it is (Trust me, I\u0060m the one who really knows...) but I would like to see life support added to the game, at least as an option for a hard game. One of my astronauts was marooned in orbit without fuel and he\u0060s still there years later, right as rain. It\u0060s not that I want him to die, even though this will obviously be his fate whenever I get around to \u0022rescuing\u0022 him in my inept fashion. But it doesn\u0060t feel very realistic in an otherwise quite realistic simulation to not have life support in it at all.\u003C/p\u003E\u003Cp\u003E4: Weather would be nice. Again it\u0060s not that I want to explode, but weather would just make the whole thing more interesting, and the planets with atmosphere feel more real.\u003C/p\u003E\u003Cp\u003EI can\u0060t think of anything else at the moment. At least nothing that isn\u0060t my fault. I\u0060m not complaining though to be perfectly clear about that. KSP is a wonderful game as it is and the most fun I\u0060ve had in ages. I also realize that it\u0060s a work in progress and that you\u0060re presumably very busy with more important things so soon after launch. But if you could at least look into doing something about the first point I raised in a reasonable time frame I\u0060d appreciate it very much. That sounds like it could be pretty simple. \u003C/p\u003E\u003Cp\u003EPS Oh and if any of the stuff I mentioned can be fixed with mods or it\u0060s actually in the game and I haven\u0060t found it then I apologize. I will just blame it on being a complete noob and pretend like nothing happened.\u003C/p\u003E\n"},{"CreatedByName":"Bogeyman","CreatedById":136919,"CreatedDateTime":"2015-05-06T07:28:18Z","Content":"\n\u003Cp\u003ETotally agreeing with 3 and 4. \u003C/p\u003E\u003Cp\u003E3: Maybe as extra difficulty level: If selected, it would release extra equipment for life support.\u003C/p\u003E\u003Cp\u003E4: Would be realistic as hell but also would need good computing power.\u003C/p\u003E\n"},{"CreatedByName":"adinfinitum","CreatedById":49226,"CreatedDateTime":"2015-05-06T08:03:55Z","Content":"\n\u003Cp\u003ENumber two you can view in the research center archives, but I do wish there was a way to view all the science you haven\u0027t done yet.\u003C/p\u003E\n"},{"CreatedByName":"Octa","CreatedById":140058,"CreatedDateTime":"2015-05-06T08:10:06Z","Content":"\n\u003Cp\u003EAgree with 1, some stripes on the suit and a badge on the IVA-Icon would bee good enough\u003C/p\u003E\u003Cp\u003EOn number 2: Go to the Science-Building and when you see the tech tree, there should be 2 buttons at the top left, iirc. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E3: One of my first posts here was a wall of text regarding some mods that should be stock and some that shouldn\u0027t. Life support is a game mechanic that should stay 100% optional and apart from the core game.\u003C/p\u003E\u003Cp\u003E4: Yesterday. i took a look at some of the beautifictaion mods. Especially the clouds were too static for me, they were just an overlay moving over kerbin. More dynamic cloud would be so great for eve, duna and kerbin!\u003C/p\u003E\n"},{"CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-06T09:57:28Z","Content":"\n\u003Cp\u003EI\u0060m not saying you need to have full global weather dynamics necessarily. Just some clouds forming in the oceans, move those around a bit and then some rain would be more than enough for me. Even if it\u0060s just cosmetic and for the cloud cover I\u0060d be for it, if it can be done without slowing things down too much.\u003C/p\u003E\u003Cp\u003EAs for life support I don\u0060t really see why something like that shouldn\u0060t be an optional game mechanic. I mean I\u0060m as bad as it gets with flight simulators. Hell I\u0060m even terrible at racing games. Anything mechanical that moves and I will crash it into something. But even I miss life support in KSP because I understand that it\u0060s one of the major obstacles to space travel full stop. It just feels weird not to have anything at all. Again, it doesn\u0060t have to be full out with urine bags out the hatch and eating minaturized soup cubes every five minutes. But just something.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2015-05-06T15:30:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fishslap\u0022 data-cite=\u0022Fishslap\u0022\u003E\u003Cdiv\u003EI have just started playing KSP and absolutely suck at everything for the moment. Nevertheless I have some things I would like to have in the game which are not:\u003Cp\u003E1: It is hard to tell astronauts apart. I tried sending two of them in a capsule each on the same ship into orbit, and I had a hard time keeping track of which was which and doing what even with just the two of them up there. I would like to be able to tell which capsule is occupied just by looking at them. I would also like to be able to tell whether an astronaut is a scientist, an engineer or a pilot just by looking at them. Perhaps different colored uniforms depending on job or some way of customizing them even? Failing that, is there some way of renaming them to something other than Bill and Bob Kerbal? If there isn\u0060t then that would be a good idea as well.\u003C/p\u003E\u003Cp\u003E2: A log of the research you\u0060ve done. Not the tech tree stuff but biomes. Since you get different equipment at different times it can be too much to keep track of whether you\u0060ve landed with your barometer in a desert or whether or not you brought your goo canister to a particular crater on Mun. And the more gear you get and places you can get to the more impossible it gets. Perhaps a biome breakdown tab in the science facility that registers each biome you\u0060ve done any research in, which experiments you\u0060ve done etc. But please please, oh pretty please with sugar on top give me some way of keeping track of all this! If my head explodes it will be your fault!\u003C/p\u003E\u003Cp\u003E3: I know the game is hard enough as it is (Trust me, I\u0060m the one who really knows...) but I would like to see life support added to the game, at least as an option for a hard game. One of my astronauts was marooned in orbit without fuel and he\u0060s still there years later, right as rain. It\u0060s not that I want him to die, even though this will obviously be his fate whenever I get around to \u0022rescuing\u0022 him in my inept fashion. But it doesn\u0060t feel very realistic in an otherwise quite realistic simulation to not have life support in it at all.\u003C/p\u003E\u003Cp\u003E4: Weather would be nice. Again it\u0060s not that I want to explode, but weather would just make the whole thing more interesting, and the planets with atmosphere feel more real.\u003C/p\u003E\u003Cp\u003EI can\u0060t think of anything else at the moment. At least nothing that isn\u0060t my fault. I\u0060m not complaining though to be perfectly clear about that. KSP is a wonderful game as it is and the most fun I\u0060ve had in ages. I also realize that it\u0060s a work in progress and that you\u0060re presumably very busy with more important things so soon after launch. But if you could at least look into doing something about the first point I raised in a reasonable time frame I\u0060d appreciate it very much. That sounds like it could be pretty simple. \u003C/p\u003E\u003Cp\u003EPS Oh and if any of the stuff I mentioned can be fixed with mods or it\u0060s actually in the game and I haven\u0060t found it then I apologize. I will just blame it on being a complete noob and pretend like nothing happened.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne way to solve #2 is to have the contracts generated to do science look up in your science archive and find an experiment you havent done yet, and then tell you to do it. This prevents you from having to look through the archives for it... plus it ties the game together nicely.\u003C/p\u003E\n"},{"CreatedByName":"MacroNova","CreatedById":126611,"CreatedDateTime":"2015-05-06T16:06:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EOne way to solve #2 is to have the contracts generated to do science look up in your science archive and find an experiment you havent done yet, and then tell you to do it. This prevents you from having to look through the archives for it... plus it ties the game together nicely.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis would be a fantastic addition.\u003C/p\u003E\n"},{"CreatedByName":"rcp27","CreatedById":129752,"CreatedDateTime":"2015-05-06T20:20:23Z","Content":"\n\u003Cp\u003E1 definitely agree something to help tell apart who has what profession would be welcome. At the moment, on the map view, there is a crew roster icon on the right, which will tell you this information, but it\u0027s not obvious, and you can\u0027t have it visible when you are choosing who to take on an EVA or something.\u003C/p\u003E\u003Cp\u003E2 in the R\u0026amp;D building, top left when on the tech tree view is the \u0022Science Archive\u0022 tab. Click on a planet/moon, it gives science you have collected, including the option to sort by biome\u003C/p\u003E\u003Cp\u003E3 take a look at any one of the numerous threads in the Suggestions forum relating to life support. It\u0027s a long discussed and strongly debated topic. If you want to have a go, there are mods that add life support.\u003C/p\u003E\u003Cp\u003E4 Definitely something lots of people want. I suspect we will see improvements in this direction in future updates. In the mean time there are mods that help in this area if you don\u0027t want to wait and see.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-05-06T20:20:51Z\u0022 title=\u002205/06/2015 08:20  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by rcp27\u003C/strong\u003E\n\u003Cbr\u003Ecorrect a mistake\n\u003C/span\u003E\n"},{"CreatedByName":"Caelib","CreatedById":59329,"CreatedDateTime":"2015-05-06T20:33:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rcp27\u0022 data-cite=\u0022rcp27\u0022\u003E\u003Cdiv\u003E1 definitely agree something to help tell apart who has what profession would be welcome. At the moment, on the map view, there is a crew roster icon on the right, which will tell you this information, but it\u0027s not obvious, and you can\u0027t have it visible when you are choosing who to take on an EVA or something.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, we definitely need some way to determine the role for a Kerbal in other views. I have memorized the roles for Jeb, Bill, Bob and Val ... but none of the others. Perhaps it could be added to the camera view below the crew member\u0027s name?\u003C/p\u003E\n"},{"CreatedByName":"wasml","CreatedById":120438,"CreatedDateTime":"2015-05-09T03:07:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E1: It is hard to tell astronauts apart.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/107471\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/107471\u003C/a\u003E will allow you to set rules - like Pilots one type of suit, engineers another...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E2: A log of the research you\u0060ve done. Not the tech tree stuff but biomes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere use to be a mod \u0022Science Library\u0022 \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78305\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/78305\u003C/a\u003E but it\u0027s not been updated. Some mods like Science Alert \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/76793\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/76793\u003C/a\u003E will tell you when near by science is available.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E3: I would like to see life support added to the game\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESnacks!, MKS/OKS, TAC Life support, USI life support and more.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E4: Weather would be nice\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEVE - Fantastic Eye candy - especially with some of the add ons like Astronomers Visual packs\u003C/p\u003E\u003Cp\u003ESilverFox is making a weather mod that will have clouds and wind using weather modeling - can\u0027t remember the name at the moment\u003C/p\u003E\n"},{"CreatedByName":"Fishslap","CreatedById":143204,"CreatedDateTime":"2015-05-11T11:42:38Z","Content":"\n\u003Cp\u003EAwesome, thank you very much! It\u0060s a little hard to find everything right away. I\u0060m not used to this level of modding I guess. I don\u0060t want to cheat though so will stear clear of alerts for nearby science. I just want a slightly less hidden and chaotic way of keeping track of what I\u0060ve done where. Even with the list in the science facility it\u0060s chronological for some puzzling reason, which means you have to wade through it every time you want to look for one entry.\u003C/p\u003E\n"},{"CreatedByName":"amorymeltzer","CreatedById":111542,"CreatedDateTime":"2015-05-14T22:25:56Z","Content":"\n\u003Cp\u003EIn regards to #2, if you can handle perl I made a little script (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/115551-1-0-x-PERL-ANYOS-parseScience-v0-96-Generate-XLSX-CSV-of-All-Science-in-KSP-5-12-15\u0022 rel=\u0022external nofollow\u0022\u003Esee here\u003C/a\u003E or my sig) that can generate Excel and CSV files of all the science you\u0027ve done (or not done). The in-game system is inconvenient I find, especially when wondering where to land.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2015-05-15T14:26:33Z","Content":"\n\u003Cp\u003E1. Yes\u003C/p\u003E\u003Cp\u003E2. Yes\u003C/p\u003E\u003Cp\u003E3. YES!\u003C/p\u003E\u003Cp\u003E4. Yes\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fishslap\u0022 data-cite=\u0022Fishslap\u0022\u003E\u003Cdiv\u003EAwesome, thank you very much! It\u0060s a little hard to find everything right away. I\u0060m not used to this level of modding I guess.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn KSP there\u0027s a mod for pretty much everything. Doesn\u0027t change the fact that I\u0027d like to see these suggestions in the game itself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"moronwrocket","CreatedById":134908,"CreatedDateTime":"2015-05-15T15:58:43Z","Content":"\n\u003Cp\u003EFor #2, there is also [x] Science!: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/119562-1-0-2-x-Science!-KSP-Science-report-and-checklist?p=1907551\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/119562-1-0-2-x-Science!-KSP-Science-report-and-checklist?p=1907551\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2015-05-15T19:55:30Z","Content":"\n\u003Cp\u003EAbout weather: I\u0027m neutral about it, except I think it would make Jool/GP missions epic, because you could literally get to a point where the wind rips your craft apart!\u003C/p\u003E\n"},{"CreatedByName":"MrZayas1","CreatedById":95654,"CreatedDateTime":"2015-05-16T00:20:04Z","Content":"\n\u003Cp\u003EFor the kerbal identification, I think they should wear different collored suits. like orange for pilot, blue for engineer, and white for scientists or something like that. Would be very neat to see all of the spacesuits on EVA as well with the different colors!\u003C/p\u003E\n"}]}