{"TopicId":108597,"ForumId":55,"TopicTitle":"Why the H.... space is somehow hotter than surface?!?","CreatedByName":"MondayZi","CreatedById":143051,"CreatedDateTime":"2015-05-10T15:22:32Z","PageNum":1,"Articles":[{"CreatedByName":"MondayZi","CreatedById":143051,"CreatedDateTime":"2015-05-10T15:22:32Z","Content":"\n\u003Cp\u003EI found out that somehow even if you already got out of the atmosphere with your ship, the temperature is still rising! It\u0027s not right! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E What the H....?!? I don\u0027t know about you, but in my opinion this phenomenon seems rather strange, doesn\u0027t it? Does that mean that you can overheat in space, where the temperature should be close to 0 Kelvin and the spacecrafts naturally lose heat?! \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:right;\u0022\u003E\u003Cp\u003EPlease, feel free to say what do you think! \u003C/p\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EMondayZi \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-10T15:25:20Z","Content":"\n\u003Cp\u003EHi MondayZi, you never sat in the sun on a bright day?\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-05-10T15:28:01Z","Content":"\n\u003Ca href=\u0022http://science.nasa.gov/science-news/science-at-nasa/2001/ast21mar_1/\u0022 rel=\u0022external nofollow\u0022\u003EStaying Cool on the ISS.\u003C/a\u003E The more you know. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\n"},{"CreatedByName":"Chris_2","CreatedById":63827,"CreatedDateTime":"2015-05-10T15:34:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MondayZi\u0022 data-cite=\u0022MondayZi\u0022\u003E\u003Cdiv\u003EI found out that somehow even if you already got out of the atmosphere with your ship, the temperature is still rising! It\u0027s not right! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E What the H....?!? I don\u0027t know about you, but in my opinion this phenomenon seems rather strange, doesn\u0027t it? Does that mean that you can overheat in space, where the temperature should be close to 0 Kelvin and the spacecrafts naturally lose heat?! \u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:right;\u0022\u003E\u003Cp\u003EPlease, feel free to say what do you think! \u003C/p\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EMondayZi \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EClose to earth, the temperature in space, averaged, is actually the same as on Earth. Pretty logic, because the average solar flux is also the same. But, the differences between cold and hot are also much larger. And because there is no air (so convection and conduction to the surroundings don\u0027t work) getting -hot- is a very big problem. Only means of getting rid of heat is by radiation... So that\u0027s a very large problem for electronics and such in vacuum, as you basically have to \u0027heat strap\u0027 everything to big radiators prevent overheating.\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-05-10T17:45:47Z","Content":"\n\u003Cp\u003EYou can certainly overheat in space. As Chris_2 said, convection or conduction don\u0027t work for cooling to vacuum. Losing heat by radiation will work eventually but as Sal-vager said, that kind of depends on not being in sunlight. Or you could use a sublimator which evaporates water or other coolant (ammonia?) to cool the spacecraft.\u003C/p\u003E\u003Cp\u003EEVA suits are designed to keep astronauts cool as much as keeping them warm. The Apollo spacecraft used a Passive Thermal Control roll (aka barbecue mode) to ensure that temperatures were even across the spacecraft systems:\u003C/p\u003E\u003Cp\u003EFrom the Apollo 15 \u003Ca href=\u0022http://history.nasa.gov/ap15fj/04troubleshoot_ptc.htm\u0022 rel=\u0022external nofollow\u0022\u003EFlight Journal\u003C/a\u003E:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EStrong, unfiltered sunlight, with its large infrared component, heats one side of the spacecraft. Meanwhile, the great heatsink of deep space chills the other side as energy is radiated away at infrared wavelengths. The story is told in the excellent book, Apollo: The Race to the Moon, by Murray and Cox, of the difficulties the spacecraft designers were having with the heatshield material around the Command Module, trying to make it withstand extreme cold as well as heat. Joe Shea, a brilliant and intuitive engineer who was the NASA chief overseeing the CSM\u0027s difficult birth, asked how long it took for the heatshield to cool to the point where it began to crack and flake. The answer of thirteen hours prompted him to suggest that they simply keep changing the spacecraft\u0027s attitude by rotating it slowly in the sunlight. The maneuver which resulted was PTC or Passive Thermal Control, dubbed by many the \u0027barbecue\u0027 mode. The integrity of the heatshield is not the only reason for PTC. The RCS quads, SPS propellant tanks and the structure, propellant and battery systems of the LM also needed to be evenly heated or cooled.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIncidentally, Apollo 13 needed to make more than the expected number of mid-course correction burns to stay within the re-entry corridor on the way home. If I recall correctly, the problem was eventually traced to the thrust caused by the LM sublimators. A trickle of steam over sufficient distance was enough to knock a spacecraft off course.\u003C/p\u003E\u003Cp\u003ETL: DR - Lots of stuff that I\u0027m *really* glad I don\u0027t need to worry about in KSP. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2015-05-11T19:44:39Z","Content":"\n\u003Cp\u003ESpace doesn\u0027t carry heat, but it allows heat-generating radiation to pass through it. The Sun throws tons of this stuff at us, and the Earth\u0027s atmosphere deflects a lot of it away. The surface of the Moon is very hot during the day, so hot in fact that we could see it glow red if it weren\u0027t for the bright sunlight.\u003C/p\u003E\u003Cp\u003ESpace has zero conduction, but it does not resist radiation. You can check the conduction, convection, and radiation of your parts if you open the debug menu (shift\u002BF11), go to the physics section, thermal subsection, and check the box labeled \u0022Display Thermal Data in Action Menus\u0022. After you turn that on, just right click the part and you\u0027ll see these values. Your Rad Flux value will tell you how fast you are gaining or losing heat due to radiation. If you\u0027re gaining, it just means the sun is shining on that part and it\u0027s not hot enough yet to balance out. If you really don\u0027t want that part heating up, turn it away from the sun.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-05-11T20:41:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thereaverofdarkness\u0022 data-cite=\u0022thereaverofdarkness\u0022\u003E\u003Cdiv\u003E...The surface of the Moon is very hot during the day, so hot in fact that we could see it glow red if it weren\u0027t for the bright sunlight...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, the surface of the Moon never gets hot enough to glow red. You\u0027d need temperatures above 500Ã‚Â°C for that, and the Moon gets to be around 125Ã‚Â°C.\u003C/p\u003E\n"}]}