{"TopicId":108571,"ForumId":55,"TopicTitle":"Career mode constructing of pre-made modules","CreatedByName":"CaptainTurbomuffin","CreatedById":113456,"CreatedDateTime":"2015-05-10T12:20:11Z","PageNum":1,"Articles":[{"CreatedByName":"CaptainTurbomuffin","CreatedById":113456,"CreatedDateTime":"2015-05-10T12:20:11Z","Content":"I think career mode could be more fun with these changes.\n\n**1.:Constructions\u0026Satellite missions of pre-made objects**\n\nAdding probe missions, space station, and planetary base construction was excellent, as they are part of an ideal space program, and it also makes the game diverse, but they aren\u0027t like the majestic ones people do in sandbox mode. That\u0027s because in career mode, everyone tries to cut back on these missions, and they just build minimal stations, bases, and probes that only meet the minimal requiements. At least, in harder modes, I think\n\n- **Pre-made satellites should be delivered to the specified destinations.** (maybe fuel packed in them as a last stage, to assist)\n- **Space stations and planetary bases should be constructed of pre-made modules.**\n\nSo you could be\n\nhired\n\nto do things. The cost\n\nof pre-made stuff would not be included in the vehicle\u0027s cost. Constructions wouldn\u0027t be owned by the player, who was just hired to\n\ndeliver\n\nthem. The payment should be depending on the mass, number,\n\nsize\n\n, and destination of these constructions. Non-editable pre made stuff could be temporarily saved as a subassembly. Build\n\nawesome\n\nthings for profit.\n\n**2.: Servicing these**\n\n- **Getting paid for replacing crew, supplying rescoures** (and the future life support systems)**, and delivering new experiments** (maybe in containers like the ore container, but with science stuffs in them) **to these bases, wich are not owned by you.** And of course **recovering the old crew, and the processed experiment results.**\n\nT\n\nhis would also create more use for smaller spaceplanes/shuttles, increase the need of an effective delivery vehicle.\n![:cool:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif)\n\nI would like to see these in the career mode of the core game."}]}