{"TopicId":108690,"ForumId":55,"TopicTitle":"Library!!","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-05-10T23:25:51Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-05-10T23:25:51Z","Content":"This game sorely needs an in game library with all of the updated and hopefully thorough info on everything you have bought (or could buy. Maybe you can get the library info from contracts for new tech) in game to study in game with up to date and correct information.\n\nHaving no info in game on a wiki run by random people is not a good thing for a game based on any amount of math. (Especially in this type of game.) The game has no explanation for itself whatsoever. (Less than most crappy MMOrpgs.) And there is a lot of confusion on lots of things and we should not be using trial and error to figure out. We need a good bed of complete information available in game. And, as I hinted at before, whether that is all available in a sandbox or acquired in game via career/science games is another thing. But it really needs to be in game so people don\u0027t have to scavenge for info. You would still have lots of room for people to ask for help on the forum about what it all means and getting help understanding it. But not having absolute certain information on all aspects of all items to potentially study should be considered absolutely unacceptable.\n\nThis is an arcade like game to some extent but an arcade like game based on science. So it should act as such and have what it needed for all players. It\u0027s not like there is a university to go to before playing the game. Though there could be. But that would effectively be the same thing.\n\nAs an idea they could automate it also to some extent to make it see the and use the games data to produce certain numbers. Then you can see modifications also in game to be certain. then link those libraries to the VAB and rocket building(Extended info) if you wanted to very easily. You could have a button to turn it on and off for the extra info. Or look it up in flight if you have a link to gather the info. A sufficient link to get back to and receive info from the base. I wonder if the ship would have to worry about hard drive space during flight?! Unless you had on one the ship or part of certain cockpits. Could be nice to IVA and look up any part you have on your ship in case you have an Apollo 13 type incident.. Maybe it could help upgrade the crew by making them study during missions.... Extra exp bonuses for crew?\n\n**Edited \u003Ctime datetime=\u00222015-05-10T23:48:30Z\u0022 title=\u002205/10/2015 11:48  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 10, 2015\u003C/time\u003E by Arugela**"}]}