{"TopicId":108818,"ForumId":55,"TopicTitle":"Caves","CreatedByName":"Shadows2b","CreatedById":137562,"CreatedDateTime":"2015-05-11T20:51:22Z","PageNum":1,"Articles":[{"CreatedByName":"Shadows2b","CreatedById":137562,"CreatedDateTime":"2015-05-11T20:51:22Z","Content":"Hey why moving the thread to suggestions and close it? I did not come tu sugest it since it has been a long time request, but just to discuss about it.\n\nPlus it was getting interesting.\n\nLast post was about: \n\n#1) The real solar system is pretty barren\n\n#2) The sheer scale of what is being modeled here is insane. You can\u0027t expect to just put down randomly, and find a specially made adventure maze/puzzle/feature waiting for you.\n\nThe vast majority of everything will be procedurally generated, with specificly designed features really only evident from orbit (like the little cauldera islands on laythe, the valleys on duna, the very large mun craters, etc)\n\nI suppose they could make the terrain scatter more varied, and vary by location/biome.... but if you can\u0027t be pleased by procedurally generated terrain, then you\u0027re asking too much I think.\n\nReal solar system barren? you must be kidding me,\n\nrecently, Nasa did discover kilometers long caves on mars formed by ancient lavaflows and rivers.\n\nThey even plan to build the futures bases on mars in thoses caves since it would bring natural protection against comics rays.\n\nAnd it\u0027s just mars, mercury is about boiling day face and freezing night face.\n\nVenus is just hell cause to greenhouse effect and acid rains down.\n\nAnd the moons of saturn ans jupiter hold more secrets than we could handle.\n\nAnd I\u0027mnot even talking abouts real asteroids who could keep the secret of life on earth.\n\nJust thoses fact only detailled a infime portion of the infinity of things we could do up there.\n\nSo no, space isn\u0027t boring.\n\nFor the second point I can just be sad about it"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-05-11T20:52:40Z","Content":"\u003E \n\u003E Caves and similar geological features have been suggested so many times that they are now on the [list of things not to suggest](https://forum.kerbalspaceprogram.com/showthread.php?t=36863). This is not because they are bad ideas, but to allow the discussion to move on to other ideas.\n\u003E If you\u0027re convinced that this type of procedurally generated terrain would be easy to implement, then I suggest trying to mod it in yourself. Perhaps a working model would convince to the developers to include or prioritize this feature. There are a few resources on the web by people who have attempted procedurally generated caves in 3D and there is plenty of information about how to mod KSP in the [Plugin Development Help and Support](https://forum.kerbalspaceprogram.com/forums/30-Plugin-Development-Help-and-Support) forum.\n\nExactly as the mod said...."},{"CreatedByName":"Shadows2b","CreatedById":137562,"CreatedDateTime":"2015-05-11T20:55:48Z","Content":"Well science isn\u0027t a static thing.\n\nCaves could have been a minecraft fantasy yesterday but could be legit today.\n\nMore than the idea of implementing it, i\u0027m here to discuss their legitimity as today.\n\nAnd by the time i wrote this, he didn\u0027t post it, so i did not understood it. Sorry.\n\nBut if nobody cares about extraterrestrial geological formations, i\u0027ll withdraw ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\n**Edited \u003Ctime datetime=\u00222015-05-11T20:59:43Z\u0022 title=\u002205/11/2015 08:59  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 11, 2015\u003C/time\u003E by Shadows2b**"},{"CreatedByName":"Gerandar","CreatedById":136705,"CreatedDateTime":"2015-05-11T21:04:16Z","Content":"in a game about spaceflight and landing on planets im not gonna go looking for caves."},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-05-11T21:04:26Z","Content":"I guess the point is that it\u0027s been discussed to death plenty of times before... I\u0027m under the impression that everything that could be said about it has already been said. Not saying it\u0027s a bad idea (personally I\u0027d love to see more interesting features and terrain on planets) but just that\u0027s it\u0027s been suggested by everyone and their cousin already. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"KatzOhki","CreatedById":73492,"CreatedDateTime":"2015-05-11T21:06:14Z","Content":"Here\u0027s the two things to take away from this:\n\n#1 There is a specific section of the forum for posting and discussing additions to the game.\n\n#2 This specific topic has come up before, so no need to rehash it all over again."},{"CreatedByName":"Shadows2b","CreatedById":137562,"CreatedDateTime":"2015-05-11T21:08:17Z","Content":"\u003E \n\u003E in a game about spaceflight and landing on planets im not gonna go looking for caves.\n\nSince i recall, it\u0027 s called kerbal space program, not kerbal rocket rampage(accounts for you too jeb).\n\nAnd a space program is about exploring space and make discoveries.\n\nNot just put some chunk of metal on it.\n\nThis is not just about caves. it\u0027s about everything that wait for us up there in reality. \n\nand it could be nice to have a peek on this game today, since I believe that i\u0027ll be dead when the man gonna put a feet further than the moon.\n\n**Edited \u003Ctime datetime=\u00222015-05-11T21:11:27Z\u0022 title=\u002205/11/2015 09:11  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 11, 2015\u003C/time\u003E by Shadows2b**"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2015-05-11T22:13:00Z","Content":"Alright, it has been a while since we\u0027ve had a discussion about terrain features and this thread looks more like a discussion than the last. It would be interesting to see if anyone can find working examples of procedurally-generated 3D terrain features like caves, since all features that massive in KSP are procedurally generated.\n\nIf you have questions about moderation actions in the future, take it to PMs."},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2015-05-11T22:16:21Z","Content":"\u003E \n\u003E Since i recall, it\u0027 s called kerbal space program, not kerbal rocket rampage(accounts for you too jeb).\n\u003E And a space program is about exploring space and make discoveries.\n\u003E \n\u003E Not just put some chunk of metal on it.\n\u003E \n\u003E This is not just about caves. it\u0027s about everything that wait for us up there in reality. \n\u003E \n\u003E and it could be nice to have a peek on this game today, since I believe that i\u0027ll be dead when the man gonna put a feet further than the moon.\n\nHow old are you? If you\u0027ve got 20 years on you- then you\u0027ll see it. I doubt anyone older than 10 will see a manned VENUS landing... Or Mercury- but I\u0027m certain you\u0027ll see the Martian landing. Too much push for us not to. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Shadows2b","CreatedById":137562,"CreatedDateTime":"2015-05-11T23:00:44Z","Content":"\u003E \n\u003E How old are you? If you\u0027ve got 20 years on you- then you\u0027ll see it. I doubt anyone older than 10 will see a manned VENUS landing... Or Mercury- but I\u0027m certain you\u0027ll see the Martian landing. Too much push for us not to. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nWell you are really optimist. I may be young, there are so many things that could happend retarding us.\n\nIf this world was a beatiful place of peace and hapiness I would have know ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nBut there a so many conflicts erupting everywhere, and a lot of humans on this earth seems to prefer ruining humanity than making it go further.\n\nAs en exemple the contract for the maintenance of the ISS is coming near to en end, and the main contributors, USA and Russia are quite not the bests friends forever. it may even be abandoned (even if it seems unlikely to happen).\n\nAll this things combined with the conflicts everywhere in third world make Space conquer rather futile.\n\nOf course it could go well,but I can\u0027t ignore thoses facts:sticktongue:"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-05-11T23:27:39Z","Content":"\u003E \n\u003E Alright, it has been a while since we\u0027ve had a discussion about terrain features and this thread looks more like a discussion than the last. It would be interesting to see if anyone can find working examples of procedurally-generated 3D terrain features like caves, since all features that massive in KSP are procedurally generated.\n\u003E If you have questions about moderation actions in the future, take it to PMs.\n\nI\u0027m assuming you mean 3D, non-voxel caves. Although that does bring up the question of whether PQS could be ditched at some point in the future (maybe 6 or 7 years down the line with a KSP reboot) in favor of [voxel-based spherical 3D planets](https://www.seedofandromeda.com/). Such a system would support more interesting mining mechanics, crater crashes, much more detailed terrain, and caves. \n\nI would assume that if they made another Kerbal Space Program, then they would decide to build it around a full scale 1:1 planetary system. If we start from there, the stock game can be better balanced around it than the current stock game can. Not to mention the leaps in technology that are no doubt coming in the next few years."},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-12T14:11:59Z","Content":"\u003E \n\u003E It would be interesting to see if anyone can find working examples of procedurally-generated 3D terrain features like caves, since all features that massive in KSP are procedurally generated.\n\nAha, I\u0027ve got one already. Look at Rust, from Facepunch Studios. In their new version of Rust they\u0027ve got some procedural caves that you can explore in. They\u0027re extremely buggy but since they were added not a whole lot has been tinkered with on them, so I\u0027m interested to see where they go.\n\nOf course, these caves aren\u0027t procedural themselves, what with branching tunnels like Minecraft or whatever, but I believe there are several presets that are spawned in the world with seeds."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-05-12T14:40:43Z","Content":"In real life, some guys have suggested using intact lava tubes as habitats on the Moon. Collapsed lava tubes as rilles, would show the player where to look. \n\n![Rima_Ariadaeus-1.jpg](https://upload.wikimedia.org/wikipedia/commons/4/48/Rima_Ariadaeus-1.jpg)\n\nAnother awesome pic:\n\n![6a00d8341bf67c53ef01543650946a970c-800wi.jpg](http://static.ddmcdn.com/gif/blogs/6a00d8341bf67c53ef01543650946a970c-800wi.jpg)\n\nWhat if Squad added a number of rilles, and some open lava tubes associated with some of the rilles. These would be like anomalies, not terribly common.\n\nHave a new game mechanism for building a facility in-situ. Add a new (very heavy, VERY expensive (think upper-level facility-upgrade level expensive) part called a \u0022construction depot,\u0022 and have a contract after you discover a lava tube that requires landing a few of these in a specific area near to the tube, plus a number of other, required things (drills, etc). Once this is satisfied, you can build a permanent facility using the lava tube...\n\nHere\u0027s the trick, the player doesn\u0027t build it, it is a facility like KSC, already designed to fit in that space (and the devs can make it flat near the entrance, etc).\n\nThe facility would house kerbals, and might include a hanger and a limited VAB (low height limit, moderate part limit) that requires delivering parts (something like a KAS/KIS inventory, but in 2.5 or larger cargo pods).\n\n**Edited \u003Ctime datetime=\u00222015-05-12T16:09:22Z\u0022 title=\u002205/12/2015 04:09  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by tater**"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2015-05-12T15:29:33Z","Content":"I do think procedurally generated items of interest would be awesome. But the OP makes a good point in the last thread- even at the anomalies, there isn\u0027t much to do- you\u0027re like a tourist with a camera.\n\n(Though, we can also jump around on them, and we don\u0027t have cameras. (IMHO, a camera which you could use while on a planet to document landforms, ground scatters, and other things of interest, a la [Extrasolar](https://extrasolar.com/) would be awesome.\n\nRather than just more static objects, to truly bring KSP\u0027s planets to life, we need some ground exploration game mechanics. The camera idea I wrote about above is one, what I posed [here](https://forum.kerbalspaceprogram.com/threads/120014-Procedurally-generate-surface-objects-of-scientific-interest?p=1915768\u0026viewfull=1#post1915768) is another. Without it, the procedurally generated places will still mostly be eye candy.\n\nIf done well, the ability to actually investigate the planets could be a reward in an of itself. You put all the effort into building, then flying, and then get to actually get to make some discoveries. \n\nWe\u0027ve already got rovers. It would be great to have more things to do with them.\n\n**Edited \u003Ctime datetime=\u00222015-05-12T18:28:22Z\u0022 title=\u002205/12/2015 06:28  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by Tw1**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-05-12T16:21:33Z","Content":"The trick with any \u0022science\u0022 in KSP, is to rethink it in terms of doing things that are:\n\n1. Actually useful for gameplay.\n\n2. Fun/interesting to do.\n\nFor number 1, this means showing stuff that you would otherwise have limited in game. An idea I threw out there was to have the map view fidelity and zoom level appropriate to some photographic surveys the player has done. Early cameras might give a zoom level on a survey down to looking down from 10km, while a photographic \u0022crasher\u0022 probe like Ranger might allow you to zoom all the way to ground level---but only in the area your crasher imaged. Ideally the procedural cratering on the Mun would be applied to ALL airless bodies, and with the minimal crater size possible set slightly smaller (and a different version for worlds with atmospheres). \n\nI think that caves like the actual image I posed above would be pretty cool, just because it would be cool to explore. That said, it still needs to be *useful*, hence my suggestion about having Squad make some pre-designed bases with a mechanism to construct them akin to upgrading facilities assuming some minimal requirements are met at the location."},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2015-05-12T18:25:05Z","Content":"\u003E \n\u003E The trick with any \u0022science\u0022 in KSP, is to rethink it in terms of doing things that are:\n\u003E 2. Fun/interesting to do.\n\nI can\u0027t think of any existing \u0022science\u0022 in KSP that would fulfill that condition.\n\n\u003E \n\u003E I think that caves like the actual image I posed above would be pretty cool, just because it would be cool to explore.\n\nI very much agree. It\u0027d be a very interesting challenge for navigating in zero G. Some caves could also create unique environment to explore with rovers, something that we currently do not have in the game.\n\n\u003E \n\u003E That said, it still needs to be *useful*, hence my suggestion about having Squad make some pre-designed bases with a mechanism to construct them akin to upgrading facilities assuming some minimal requirements are met at the location.\n\nWould be very fun. But IMHO adding some scientific experiment that can be conducted only in caves would be interesting on it\u0027s own (eg. underground astrobiology sampler, or something like cave measurement package?)\n\n**Edited \u003Ctime datetime=\u00222015-05-12T18:34:32Z\u0022 title=\u002205/12/2015 06:34  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 12, 2015\u003C/time\u003E by Sky\\_walker**"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-05-12T18:45:04Z","Content":"A mod adds a seismometer and you then are supposed to impact a probe with some parameters to get a reading. That would be pretty cool. Fun is hard, though."}]}