{"TopicId":109559,"ForumId":55,"TopicTitle":"Boats!","CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-05-16T20:12:07Z","PageNum":1,"Articles":[{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2015-05-16T20:12:07Z","Content":"So after seeing a thread on the General Discussion about 1.0.2 boats, I was thinking: what if we got stock boat parts.\n\nI know that mods add boat parts, but I think SQUAD could get creative. Unlike regular \u0022banana\u0022 shaped boats, NASA\u0027s planned TiME (Titan Mares Explorer) vehicle is almost a circle with navigation and comms mounted on top. I would like to see some parts like this that would allow probe exploration of Laythe\u0027s and Eve\u0027s seas (maybe even underwater).\n\nWhat are your thoughts?"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2015-05-16T20:22:06Z","Content":"My thought is: ***Kerbal Space Program.***\n\nApart from SpaceX\u0027s Falcon 9 landing barge, and underwater silos and launch vehicles for sea missiles, water has next to nothing to do with rocketry. I just don\u0027t believe SQUAD will/should devote the time to making stock boat parts, because only three bodies in the Kerbol system have liquid water thus far, and they\u0027re slow and not very useful. Parts float already, so one might as well build boats out of already-stock parts like it\u0027s been done if one really wants a boat."},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-16T20:40:09Z","Content":"Indeed, there isn\u0027t much boating in a space game... though...\n\n![nIRRBX9.jpg](http://i.imgur.com/nIRRBX9.jpg)"},{"CreatedByName":"DerpyFish","CreatedById":144205,"CreatedDateTime":"2015-05-16T21:37:08Z","Content":"\u003E \n\u003E So after seeing a thread on the General Discussion about 1.0.2 boats, I was thinking: what if we got stock boat parts.\n\u003E I know that mods add boat parts, but I think SQUAD could get creative. Unlike regular \u0022banana\u0022 shaped boats, NASA\u0027s planned TiME (Titan Mares Explorer) vehicle is almost a circle with navigation and comms mounted on top. I would like to see some parts like this that would allow probe exploration of Laythe\u0027s and Eve\u0027s seas (maybe even underwater).\n\u003E \n\u003E What are your thoughts?\n\nIt is indeed a interesting idea. It would be awesome if they could add some boat parts so we could explore the seas of kerbin and other planets."},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-05-16T21:54:36Z","Content":"Boat parts? Good idea, but I\u0027d rather that Squad extends the current system of structural parts and improve the water system. Currently, it is very, *very* difficult to ditch a plane on the water, or even land a booster without tons of parachutes, let alone boating.\n\nBut very good idea anyway. They added planes, why not add at least *feasible* hydrodynamics as well? It would expand so much potential in places like Layrhe and Eve."},{"CreatedByName":"JokingHinge","CreatedById":109457,"CreatedDateTime":"2015-05-16T22:13:02Z","Content":"Boats are realistic enough and are easy enough to make go 100\u002B m/s(with parts that have a tolerance of 7 m/s).\n\nCurrently it is very easy to land a plane at 70 m/s if you follow this guide [www.youtube.com/watch?v=SvwGjoN87po](www.youtube.com/watch?v=SvwGjoN87po)"}]}