{"TopicId":110199,"ForumId":55,"TopicTitle":"Suggestion: Add center of pressure display to VAB.","CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2015-05-21T05:36:51Z","PageNum":1,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2015-05-21T05:36:51Z","Content":"\n\u003Cp\u003ECenter of pressure is not at all the same as center of lift.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://exploration.grc.nasa.gov/education/rocket/rktcp.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://exploration.grc.nasa.gov/education/rocket/rktcp.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf you put no parts with the property of lift on a rocket, the VAB will show the center of lift sitting on the floor, which ain\u0027t right at all for center of pressure.\u003C/p\u003E\u003Cp\u003EOne possible way to find the point to display the COP would be to invisibly \u0027behind the scenes\u0027 raycast using parallel rays from one side of the VAB to the other, with the ray array centered on the COM. Projected against a virtual plane (and ignoring parts like launch clamps and others the aero model ignores) the outline shape would be generated by all rays NOT blocked by the rocket.\u003C/p\u003E\u003Cp\u003EThen on that outline do the math for finding the centroid of an irregular shape. Quite a bit of work for KSP to do to display a small sphere on the screen but it would be a big help for building rockets that are stable without having to do fin spamming to force them to keep the nose pointed the right way.\u003C/p\u003E\u003Cp\u003EFor rockets that are not symmetric in the X and Y axes, the COP would be a different heights. Might want to have a way to test for and display that.\u003C/p\u003E\n"},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2015-05-21T06:25:14Z","Content":"\n\u003Cp\u003EI\u0027ll express my greatest agreement before mods move this to the suggestions forum. I have been longing for this feature since 0.24 or so.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2015-05-21T07:52:26Z","Content":"\n\u003Cp\u003EYes, please. \u003C/p\u003E\u003Cp\u003EAlong with all the other information we need in flight but don\u0027t have, like DeltaV remaining, radar altitude etc. \u003C/p\u003E\u003Cp\u003EBasically, make Engineer look better and make it stock \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-05-21T07:57:39Z","Content":"\n\u003Cp\u003EBut isn\u0027t it impossible to do it in VAB because it\u0027s dynamic during flight?\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2015-05-21T08:02:35Z","Content":"\n\u003Cp\u003E^ I like this idea too, but I suspect that it might not be feasible due to that or some similar reason.\u003C/p\u003E\n"},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2015-05-21T08:16:23Z","Content":"\n\u003Cp\u003EModel rocketeers have built stable craft with the silhouette method for decades. It represents a \u0022worst case\u0022 situation - where your CoP will (approximately) be if the rocket is perpendicular to the airstream. The distance between that and the CoM represents how hard the rocket will try to right itself when pointing away from the prograde direction.\u003C/p\u003E\u003Cp\u003EIf you threw in another point obtained with the Barrowman equations, you\u0027d get the range between where the CoP (approximately) will be at any time. The distance between the Barrowman CoP and CoM represents how hard the rocket will resist turning away from prograde direction.\u003C/p\u003E\u003Cp\u003EOf course both methods were developed to predict rocket flight behavior inside Earth atmosphere and using our local physics rules. They might not apply very well to KSP physics in the end. It would take some experimentation to actually determine how well they would fit.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-05-21T20:20:41Z","Content":"\n\u003Cp\u003ESuggestion moved to the suggestions section.\u003C/p\u003E\n"}]}