{"TopicId":110328,"ForumId":55,"TopicTitle":"Improving Kerbal Classes, Experience, and Recruitment","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-22T02:23:06Z","PageNum":1,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-22T02:23:06Z","Content":"There are a number of fairly serious problems with the way we currently hire, train, and use Kerbals. This post will list these problems and suggest a solution to them all.\n\nProblems With Current Systems (not a complete list, but the major points):\n\n1. Class System\n\nThe current class system boils down to only engineers being worth retaining on the payroll. Pilots become utterly redundant once you get your 1st probe core with SAS. Scientists become redundant once you finish the tech tree, and aren\u0027t very useful even before then due to the sheer difficulty in leveling up all Kerbals significantly (see below). Engineers, OTOH, always have practical, indespensible functions that improve with experience.\n\n2. Experience and Training\n\nKerbals unrealsitically learn not through book study or practical application, but only through achievements requring going to new places. And then the KXP only takes effect upon their return to KSC, which is illogical because they can\u0027t be trained at KSC.\n\n3. Recruitment\n\nThe player has no control over the applicant pool. Despite only needing engineers, he keeps getting spammed with useless pilots and scientists. Further, he has to pay an ever-increasing amount to hire these candidates despite them having zero skills and the player being unable to invest any training on them on the ground.\n\nPROPOSED SOLUTIONS:\n\n1. Scrap the current class system and replace it with something more flexible and useful as follows:\n\n- Kerbal applicants are essentially tourists with neither class nor skills. They have a random but low-weighted bravery score and a random by high-weighted stupidity score.\n- The player can choose hiring strategies (and pay cash/rep/science to do so) that will improve either the bravery or stupidity of applicants.\n- The player can dismiss applicants he doens\u0027t like without penalty, same as declining contracts without accepting them.\n- Hiring Kerbals costs a small fee that doesn\u0027t increase. This initial cost covers basic flight training so that every single Kerbal can use SAS. Otherwise, all the pilot skills are removed from the game for lack of practical value and general bugginess.\n- Kerbals do not have named classes---all are just \u0022astronauts\u0022 or \u0022kerbalnauts\u0022. Instead of classes, each time a Kerbal earns sufficient KXP, the player can choose any skill from the lists for engineers and scientists in any order desired. IOW, the 1st skill a Kerbal might learn could be fixing flat tires, while another could learn how to reset experiments, process data in a lab, or buff general science value.\n- Some skills can by tied to the tech tree. For instance, you can\u0027t fix wheels until you\u0027ve unlocked rover wheels, can\u0027t learn to process data until you unlock the mobile lab, can\u0027t learn to improve ore drilling until you\u0027ve got the drills, etc.\n\n2. Make significant changes to how KXP works.\n\n- Allow players to train Kerbals on the ground at KSC. The player would pick a skill for the Kerbal to study and at the end of some period of time based on stupidity (during which the Kerbal would be unavailable for missions), the Kerbal emerges with the desired skill and enough new KXP to have earned it. This costs money based on the time it takes, based on the amount of KXP required as modified by the Kerbal\u0027s stupidity.\n- Remove the limitation that KXP only takes effect upon return to KSC. Most of spaceflight is sitting on your butt for days/months/years waiting for the next burn, during which time the Kerbals can be hitting the books (or being force-fed information *Clockwork Orange*-style ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)). IOW, KXP takes effect at the moment it\u0027s earned, allowing Kerbals to level up during missions when they\u0027re presumably actually doing their learning.\n- Allow multiple awards of KXP for doing the same thing (say landing on Mun) over again. People achieve mastery by repeatedly doing the same things so why not Kerbals? The amount of KXP for the same achievement should decrease over time, but not too steeply.\n\nBENEFITS:\n\n- Allows players to customize their Kerbals, which increases their attachment to them and adds more scope for roleplaying\n- Allows players to plan crew development to meet the requirements of future missions, increasing the depth of the design and planning aspects of the game.\n- Integrates roster development into the whole financial and strategy system.\n- Eliminates the problem of 2/3 of all Kerbals being useless by mid-game.\n- Eliminates the major annoyances of the current system such as no control over recruitment, the insanely high price for recruiting untrained Kerbals, and the unwieldy, overly restrictive KXP system.\n- Actually gets some use out of the stupidity attribute.\n\nAnyway, just some suggestions."},{"CreatedByName":"sumghai","CreatedById":66272,"CreatedDateTime":"2015-05-22T02:31:47Z","Content":"I quite like the idea of abandoning specialisations in favour of training each Kerbal in specific skills. \n\nI also quite like the ability to train Kerbals at the KSC and partly basing the results on stupidity as well - perhaps space center upgrades could also be tied into this system (e.g. higher tier astronaut center builds would reduce the time/cost per Kerbal, allow more Kerbals to be trained concurrently)"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-22T03:46:18Z","Content":"\u003E \n\u003E I also quite like the ability to train Kerbals at the KSC and partly basing the results on stupidity as well - perhaps space center upgrades could also be tied into this system (e.g. higher tier astronaut center builds would reduce the time/cost per Kerbal, allow more Kerbals to be trained concurrently)\n\nGood idea ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2015-05-23T00:54:16Z","Content":"All very nice ideas, but it will need more skills than just those of current engineers. Something really good that can\u0027t be (at least not all of them) achieved through tech, like Pilots being replaceable by probes. It would require pilot and scientist skills that wouldn\u0027t make a Kerbal obsolete when you reach a certain tech level, but make him remain special and useful.\n\nThere are options for science skills, such as training a high end specialist (or several) which would unlock a special tech branch that can\u0027t be otherwise researched, and it could contain special parts that are unavailable otherwise. Such as more efficient/better engines, solar panels, batteries, etc. (if it were up to me, it would have sci fi parts such as star gates, but people oppose that notion greatly, so meh)\n\nBut I really don\u0027t know how to make pilot skills more useful than probes, I have no clue."},{"CreatedByName":"v8Dave","CreatedById":134518,"CreatedDateTime":"2015-05-23T10:43:23Z","Content":"\u003E \n\u003E But I really don\u0027t know how to make pilot skills more useful than probes, I have no clue.\n\nHow about a pilot could fly at any location, where as a probe has to be programmed so can\u0027t be used until the location or biome has been visited and surveyed by a pilot."},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2015-05-23T13:46:58Z","Content":"I agree the whole xp system needs an overhaul and I think the OP addressed the issue well. \n\nAn idea for pilots. .\n\nIn RL probes suffer from signal time delay due to distance. This isn\u0027t practical in game, but could be simulated (sort of) by reducing the effectiveness and / or torque of probe control and SAS relative to distance from KSC. So at Jool say a probe would be very hard to steer. A Pilot on board would suffer no penalty. \n\nAnother possibility with this is to assign a pilot to a probe and use the distance from the pilot to the probe to determine the effect amount. So a pilot in orbit around Duna can launch a probe to the surface and control it from orbit to get a much reduced penalty."},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-23T15:00:50Z","Content":"#1) Unlocking science is a large part of career, scientists are very useful. Right now I have a problem, I have 16 kerbals, but only 2 are scientists (most are engineers, followed by pilots).\n\nIf I want labs to be generating science points (which becomes income when the tech tree is finished) - I need to put scientists in them.\n\nIf I want a simple lander with 1 goo and 1 mat bay (remember, after all tech is unlocked, science = funds, plus it can be a simple goal to get science from each biome of a place), that visits multiple biomes, or transmits (possibly 2x), and then takes data for return, I need a scientist, or a much bigger lander for extra goo and mat bays (and I still need a scientist in orbit to reset the experiments).\n\n#2) I like to have pilots too, for those times when I run out of electrical power.\n\nI\u0027ve had a lot of issues with my SSTO\u0027s reentering with limited fuel remaining, and the power being drained during rentry on the reaction wheels.\n\nSolar panels are all retracted... and power is an issue (sure, late game, RTGs, or save a tiny amount of fuel for fuel cells... but still it happens).\n\nA kerbal in the cockpit, and I don\u0027t lose control. A pilot in the cockpit, and I don\u0027t lose SAS.\n\nI pilot means no probe core needed, means no constant power loss at night (or if lacking solar panels/RTG).\n\nEngineers I find to be pretty useless, if nothing goes wrong, then the most they can do that is useful is repack chutes on a lander for a body with an atmosphere.\n\nFor my Mun and Minmus operations, I didn\u0027t have any use for them until unlocking ISRU, at which point they sit in the miner - about as useful as a scientist sitting in a research lab.\n\nAnd they don\u0027t take that long to train - a trip to the Mun, a trip to Minmus, and poke their head outside kerbin\u0027s SOI = lvl 3 kerbal"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-23T15:33:45Z","Content":"\u003E \n\u003E All very nice ideas, but it will need more skills than just those of current engineers. Something really good that can\u0027t be (at least not all of them) achieved through tech, like Pilots being replaceable by probes. It would require pilot and scientist skills that wouldn\u0027t make a Kerbal obsolete when you reach a certain tech level, but make him remain special and useful.\n\nI don\u0027t really think it requires inventing a lot of new skills because Kerbals can only reach 5th level. If you can only pick 1 skill per level, then no Kerbal can gain more than 5 skills (on top of the baseline ability to use SAS that all Kerbals will have), unless the ground-based, pay-per-training system is set up to not mess with KXP at all and just gives you bonus skills regardless of KXP level. There are already considerably more than 5 separate skills. For example:\n\n- buff experiment science 5% (can be selected multiple times)\n- buff contract science rewards 5% (can be selected multiple times)\n- ability to reset 1-shot experiments\n- ability to process data in mobile lab (can be selected multiple times to increase processing speed)\n- ability to repack chutes\n- ability to fix lander legs\n- ability to fix rover wheels\n- buff ISRU speed 5%\n- buff drill production speed 5%\n\nSo that\u0027s 9 skill just off the top of my head--I\u0027m sure more are out there (plus the baseline SAS ability all Kerbals have at level 0). With the cap of 5 levels, no Kerbal will ever have more than 5 of these without ground-based training. Thus, each Kerbal will still be a specialist, but a specialist of a particular type custom-groomed and developed by the player to fit his particular needs.\n\n[\n\n\u003E \n\u003E But I really don\u0027t know how to make pilot skills more useful than probes, I have no clue.\n\n\u003E \n\u003E How about a pilot could fly at any location, where as a probe has to be programmed so can\u0027t be used until the location or biome has been visited and surveyed by a pilot.\n\n\u003E \n\u003E In RL probes suffer from signal time delay due to distance. This isn\u0027t practical in game, but could be simulated (sort of) by reducing the effectiveness and / or torque of probe control and SAS relative to distance from KSC. So at Jool say a probe would be very hard to steer. A Pilot on board would suffer no penalty. \n\u003E Another possibility with this is to assign a pilot to a probe and use the distance from the pilot to the probe to determine the effect amount. So a pilot in orbit around Duna can launch a probe to the surface and control it from orbit to get a much reduced penalty.\n\nI myself have no good suggestions for creating useful \u0022pilot\u0022 skills (remembering that in this system, there would be no \u0022pilots\u0022, \u0022engineers\u0022, or any other classes so \u0022pilot\u0022 here is just a heading for a list of skills any Kerbal could have). Everything I can think of breaks some other aspect of the game just to create an artificial need for a special Kerbal who can make that aspect function as intended, so in the end do more harm than good. Like how right now under the existing class system, only pilot-class Kerbals know how to push the T button on the instrument panel, that\u0027s a god-given ability they have and no other Kerbal can ever be taught that. Seriously? That\u0027s the main reason I think the class system should be abolished in the 1st place ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif).\n\nPandaman, while I appreciate your suggestion, I don\u0027t think imposing RemoteTech effects on stock is a good idea. The only real net result of RT in career mode is to greatly increase the cost and complexity, and limit the usefulness, of probes, often to the point where it\u0027s cheaper, faster, and way less hassle just to do crewed missions. Given that probes are a popular way for cash-strapped players to get some science, this would not be a popular move, especially as contracts no give little to no science."},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-05-24T17:37:25Z","Content":"I think that we should keep the whole Pilot/Engineer/Scientist thing because it adds more role-play, but I agree that we should be able to choose what skills they get, and they could improve over time.\n\nSo if you picked \u0022Wheel Repair\u0022 for you Engineer to learn, he could only fix 1 or 2 wheels before he has to return to KSC. So, no infinite tires. But if you upgraded his ability, he could fix 4 wheels, and the number could increase until a max of, say 20. This also adds more purpose of resupply missions, like \u0022Drop off some spare tires to Duna Base Alpha\u0022\n\nAnd Scientists could be upgraded to increase their science boost, and they could also have an ability to analyze Ore readings better. \n\nPilots could have an option to learn Auto-landing, or you could have them plot a maneuver for you, like a underpowered Mechjeb. So, basically Mechjeb, but you have to execute the maneuvers yourself."},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-05-25T12:41:22Z","Content":"A suggestion how to improve engineers: Welding using this: [http://i.imgur.com/Ui30jSB.png](http://i.imgur.com/Ui30jSB.png)\n\n![Astronaut_PD_credit-NASA.jpg](http://www.howitworksdaily.com/wp-content/uploads/2013/09/Astronaut_PD_credit-NASA.jpg)\n\nThe higher the skill the better welding/replacing skills they would have.\n\nLevel 1: Small pieces can be detached only.\n\nLevel 2: Small pieces can be detached and joined to other parts, no snap symmetry.\n\nLevel 3: Medium and low-mass pieces (trusses, empty tanks, etc.) can be moved and joined with other parts.\n\nLevel 4: Snap symmetry is available.\n\nLevel 5: Medium sized engines (Terrier, Swivel, Jet engines, etc.) can be moved.\n\nDoesn\u0027t necessary have to look like this, but you get the idea."},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2015-05-26T01:12:11Z","Content":"\u003E \n\u003E A suggestion how to improve engineers: Welding using this: [http://i.imgur.com/Ui30jSB.png](http://i.imgur.com/Ui30jSB.png)\n\u003E [http://www.howitworksdaily.com/wp-content/uploads/2013/09/Astronaut_PD_credit-NASA.jpg](http://www.howitworksdaily.com/wp-content/uploads/2013/09/Astronaut_PD_credit-NASA.jpg)\n\u003E \n\u003E The higher the skill the better welding/replacing skills they would have.\n\u003E \n\u003E Level 1: Small pieces can be detached only.\n\u003E \n\u003E Level 2: Small pieces can be detached and joined to other parts, no snap symmetry.\n\u003E \n\u003E Level 3: Medium and low-mass pieces (trusses, empty tanks, etc.) can be moved and joined with other parts.\n\u003E \n\u003E Level 4: Snap symmetry is available.\n\u003E \n\u003E Level 5: Medium sized engines (Terrier, Swivel, Jet engines, etc.) can be moved.\n\u003E \n\u003E Doesn\u0027t necessary have to look like this, but you get the idea.\n\nThis is not a half bad idea, would open up more orbital construction options. Would also need an upgrade for the jetpack fuel amount though.\n\nEngineers are already useful though, so let\u0027s focus on pilots, we have to be missing something.\n\nHow about pilot skills (Or just a skill if classes are abolished) of conservative flight, where highest level pilot would decrease fuel usage by 10% or so?"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-05-26T10:38:36Z","Content":"\u003E \n\u003E How about pilot skills (Or just a skill if classes are abolished) of conservative flight, where highest level pilot would decrease fuel usage by 10% or so?\n\nI feel like my karma will go down a lot because of what I\u0027m about to say, but: Skills like \u0022increase engine ISP by x%, make it use less fuel, etc.\u0022 were already in SQUAD\u0027s plans and people really hated it. And I\u0027m one of those people. We don\u0027t need no RPG elements in this space sim. Kerbals aren\u0027t some special boost speed amulets.\n\nHowever, pilots could be improved in other way. The better the pilot the higher Yaw/Pitch/Roll input gets. So basically if there\u0027s a trained pilot on board the spacecraft (if it\u0027s in atmo) would make sharper turns.\n\nAlso if the number of Gs would finally mean something they could black-out and red-out less than a standard scientist or engineer.\n\n**Edited \u003Ctime datetime=\u00222015-05-26T10:41:02Z\u0022 title=\u002205/26/2015 10:41  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 26, 2015\u003C/time\u003E by Veeltch**"},{"CreatedByName":"Robotengineer","CreatedById":104525,"CreatedDateTime":"2015-05-26T14:35:06Z","Content":"\u003E \n\u003E I feel like my karma will go down a lot because of what I\u0027m about to say, but: Skills like \u0022increase engine ISP by x%, make it use less fuel, etc.\u0022 were already in SQUAD\u0027s plans and people really hated it. And I\u0027m one of those people. We don\u0027t need no RPG elements in this space sim. Kerbals aren\u0027t some special boost speed amulets.\n\u003E However, pilots could be improved in other way. The better the pilot the higher Yaw/Pitch/Roll input gets. So basically if there\u0027s a trained pilot on board the spacecraft (if it\u0027s in atmo) would make sharper turns.\n\u003E \n\u003E Also if the number of Gs would finally mean something they could black-out and red-out less than a standard scientist or engineer.\n\nBetter control input isn\u0027t that different from percentage buffs IMO. G-force tolerance on the other hand could be interesting, as a pilot logs more atmospheric flight time, they could gain higher Gs without blacking out, they could also be trained in a simulator on the ground for funds. \n\nA skill to execute maneuver nodes would also be good, with the accuracy of the node burn increasing with the skill of the pilot. Ideas for skill levels would be \u002B/-10% for first level, then gradually going up to \u002B/-0.1% accuracy. Accuracy would be in percentages of the total node DV, i.e, if the node is a 100m/s burn, first skill level would end up doing a 90m/s-110m/s burn, with the final burn amount being randomly weighted to the outside margins. Hope that made sense."},{"CreatedByName":"TothAval","CreatedById":142030,"CreatedDateTime":"2015-05-26T17:01:27Z","Content":"\u002B1 good idea. i would love to see my customized kerbals exploring the great vastness space"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-26T22:29:46Z","Content":"\u003E \n\u003E I feel like my karma will go down a lot because of what I\u0027m about to say, but: Skills like \u0022increase engine ISP by x%, make it use less fuel, etc.\u0022 were already in SQUAD\u0027s plans and people really hated it. And I\u0027m one of those people. We don\u0027t need no RPG elements in this space sim. Kerbals aren\u0027t some special boost speed amulets.\n\nTotally agree. Which is, in fact, the root of all evil in having a class system in the 1st place. Instead of warroior, wizard, thief, we have pilot, scientist, engineer, so you have to make a \u0022balanced party of adventurers\u0022 to just to have the whole skill set. And no cross-training allowed.\n\n\u003E \n\u003E However, pilots could be improved in other way. The better the pilot the higher Yaw/Pitch/Roll input gets. So basically if there\u0027s a trained pilot on board the spacecraft (if it\u0027s in atmo) would make sharper turns.\n\u003E Also if the number of Gs would finally mean something they could black-out and red-out less than a standard scientist or engineer.\n\nHow is this any different from the abhorrent \u0022better dV\u0022 thing? Now you\u0027ve got an amulet of dexterity ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif).\n\nSeriously, there is no justification for having any pilot skills, especially ones that improve with level, and very especially if the pilots ever get better than probes. So the best thing is just to let every Kerbal fly, have them all equivalent to probes, and let the other skills be assigned as the player decides best depending on what he wants to do in space. That way, as in real life, he could train his crews for specific missions."},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2015-05-27T02:07:16Z","Content":"\u003E \n\u003E Totally agree. Which is, in fact, the root of all evil in having a class system in the 1st place. Instead of warroior, wizard, thief, we have pilot, scientist, engineer, so you have to make a \u0022balanced party of adventurers\u0022 to just to have the whole skill set. And no cross-training allowed.\n\nYou can have a skill like this without having classes though. I\u0027d personally like to see something like this."},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2015-05-27T06:29:50Z","Content":"While there isn\u0027t cross-training there should be bonus skills or effects based on combinations of skill sets. \n\nSo an engineer teamed with a pilot could maybe auto stage during a burn. \n\nAt higher levels engineers might convert burn dV amounts to seconds and take into account the effect of staging on that burn time. \n\nAt higher level still the combo could burn node without player input. \n\nSimilarly Scientists and Pilots and Scientists and Engineers could have interaction skills."},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-05-27T09:11:32Z","Content":"\u003E \n\u003E How is this any different from the abhorrent \u0022better dV\u0022 thing? Now you\u0027ve got an amulet of dexterity ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif).\n\u003E \n\u003E Seriously, there is no justification for having any pilot skills, especially ones that improve with level, and very especially if the pilots ever get better than probes. So the best thing is just to let every Kerbal fly, have them all equivalent to probes, and let the other skills be assigned as the player decides best depending on what he wants to do in space. That way, as in real life, he could train his crews for specific missions.\n\nOk, I guess I didn\u0027t really think this through. That was just a quick idea I came up with on the spot."},{"CreatedByName":"Yemo","CreatedById":114412,"CreatedDateTime":"2015-06-11T16:28:21Z","Content":"Does anyone know a mod which allows kerbals to start with 5 stars in career?\n\nI just do not see any reason why going to Duna should improve the skills of an astronaut regarding repairs...\n\nOr any mod dealing with the XP/trait system?\n\n**Edited \u003Ctime datetime=\u00222015-06-11T16:43:20Z\u0022 title=\u002206/11/2015 04:43  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 11, 2015\u003C/time\u003E by Yemo**"},{"CreatedByName":"SmallFatFetus","CreatedById":137860,"CreatedDateTime":"2015-07-06T14:27:42Z","Content":"\u003E \n\u003E A suggestion how to improve engineers: Welding using this: [http://i.imgur.com/Ui30jSB.png](http://i.imgur.com/Ui30jSB.png)\n\u003E [http://www.howitworksdaily.com/wp-content/uploads/2013/09/Astronaut_PD_credit-NASA.jpg](http://www.howitworksdaily.com/wp-content/uploads/2013/09/Astronaut_PD_credit-NASA.jpg)\n\u003E \n\u003E The higher the skill the better welding/replacing skills they would have.\n\u003E \n\u003E Level 1: Small pieces can be detached only.\n\u003E \n\u003E Level 2: Small pieces can be detached and joined to other parts, no snap symmetry.\n\u003E \n\u003E Level 3: Medium and low-mass pieces (trusses, empty tanks, etc.) can be moved and joined with other parts.\n\u003E \n\u003E Level 4: Snap symmetry is available.\n\u003E \n\u003E Level 5: Medium sized engines (Terrier, Swivel, Jet engines, etc.) can be moved.\n\u003E \n\u003E Doesn\u0027t necessary have to look like this, but you get the idea.\n\nWhile I like this idea, I would keep it smaller. If the game had a stockified KAS/KIS, engineers would be vital. They could connect hoses, move things, attach small parts, whatever. And I like you idea of low level engineers detaching a part only. That makes for an interesting challenge."},{"CreatedByName":"Grumman","CreatedById":76014,"CreatedDateTime":"2015-07-06T14:58:34Z","Content":"Another idea: when a Kerbal hits level 3, pick one of the other two classes. In addition to the usual effects from their core class, they gain Level 0 in that second class you picked unless you \u0022roll\u0022 under half their Stupidity, in which case they gain Level 0 in the other class\\*. Then when they hit Level 5 they go up to Level 1 in their second class.\n\n\\* Jebediah is a Pilot with 0.5 Stupidity. When he hits Level 3, you choose for him to become a Pilot/Scientist. Because of his Stupidity, he has a 75% chance of becoming a Pilot 3/Scientist 0 and a 25% chance of becoming a Pilot 3/Engineer 0."},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-07-06T17:17:38Z","Content":"I support an overhaul to the XP/stats/skills area to give some meaning to kerbal courage and stupidity at long last. Currently it\u0060s \u0022The stats, they do nothing!\u0022\n\nI like the idea that engineers can use/move/weld parts in a similar way to KAS, it would give them some use that they currently do not have.\n\nI\u0060m OK with there being pilots who can use more advanced ship flight systems, similarly scientists could use more advanced experiments/telescopes.\n\nI have no problem with \u0060building a well rounded party\u0060 like in D\u0026D, the more skill overlap you have the less point there is in having skills anyway.\n\nNot too keen on dual-skills after some thought. Especially if the second skill is semi random."},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-07-06T19:54:07Z","Content":"At the moment, Kerbal experience is gained by performing a flyby, or landing on another body. When Kerbals gain XP, they gain skills based on their class. However, Pilots become obsolete after you unlock a good probe core, and Science, and therefore Scientests, become useless after you max the tech tree. Here are some proposed changes that would fix these issues:\n\nAll rewards and losses would be controllable in the settings.\n\n**Kerbal Classes:**\n\nPilots have SAS abilities, which no probe core has. They can also execute maneuver nodes, with precision increasing with XP level. (A 1 star pilot might mess it up completely, while a 5 star pilot would fly like Jeb)\n\nIf a pilot that had been on many missions (first landing on the Mun), you gain a bonus in reputation for that launch.\n\nScientests that took a surface sample would get a bonus in science depending on their level. The same would apply on experiments activated while on EVA. \n\nEnginers are able to repack parachutes, and each one can fix 4 rover wheels before needing to renter a pod. In the future, engineers have KIS abilities, if they are ever implemented.\n\n**Kerbals at the KSC**\n\nKerbals can be hired for a small fee in funds, and cost 10 funds per day, per Kerbal, to prevent unnecessary time warping.\n\nKerbals can gain XP at the Training Center, which can be added as a new building. This costs a high amount of funds per XP level.\n\n**Kerbal XP:**\n\nKerbals will gain XP based on certain parameters, which can be viewed at the Astronaut Complex.\n\nScientists gain XP every time they activate or reset experiments on EVA. They also gain it every time they take a surface sample or do an EVA report.\n\nPilots will gain XP every time they fly a launch, or perform a powered landing.\n\nEngineers will gain XP every time they go on EVA, or fix something, once fixing it is unlocked.\n\n**Small changes to Kerbals**:\n\nKerbals now take Monopropellent from capsules or any Monopropellent tanks on the vessel. No more infinite EVA fuel!\n\nYou can select a target on the surface and the Kerbal will walk to it.\n\nKerbals now require Supplies to be controllable. Basically, just implement USI Life Support. This is optional in the settings.\n\n**Science:**\n\nScience is now used to discover asteroids, costing 50 science for a class A, 75 science for a class B, 100 science for a class C, 150 science for a class D, and 250 science for a class E.\n\nEvery time you recover science, it adds to your reputation. \n\nScience can also be exchanged for reputation\n\nScience can be gained by taking samples of ground scatter.\n\n**Reputation**:\n\nWhenever you launch a new rocket, you gain a small amount of rep.\n\nIf a prestigious Kerbal is on board (the first Kerbal on the Mun), you get a large rep bonus.\n\nYou also gain rep if the vessel is recovered without it exploding.\n\nYou lose 5 reputation per day, to simulate the public \u0022losing interest\u0022 in the space program.\n\nThe more Kerbals you have in space, the less rep you lose each day.\n\nIf a Kerbal dies or goes MIA, you take a huge hit in rep, depending on the size of the disaster.\n\n**Funds**\n\nThe space center costs 50 funds to maintain each facility per day, which increases as buildings are upgraded.\n\nYou can recover ValuableOre, which is mineable, for funds. \n\nLarge go amounts of Ore can be converted into ValuableOre through the ISRU converter.\n\nValuableOre can be mined with the current drills, and can be stored in the Ore tanks. No new parts necessary.\n\nLet me know what you think!"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2015-07-06T20:20:00Z","Content":"Threads merged."},{"CreatedByName":"Windspren","CreatedById":134441,"CreatedDateTime":"2015-07-06T20:35:14Z","Content":"Wait, why were the threads merged? The ideas are different. The other OPs thread was to get rid of classes entirely, while mine was to add to them."}]}