{"TopicId":111725,"ForumId":55,"TopicTitle":"Looking realistic in KSP","CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2015-06-02T11:44:32Z","PageNum":1,"Articles":[{"CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2015-06-02T11:44:32Z","Content":"Hey guys!\n\nKsp still has many corners to polish to make it look realistic. As such, i have listed a few.\n\n**Space Engines FX**\n\nAn issue of the engines in KSP is with its FX. It is the *same regardless on ground, or in space*.\n\n![28diNsh.png](http://i.imgur.com/28diNsh.png)\n\nHowever, in real life, there is **no air pressure in space from stopping the exhaust in staying so neat, so the exhaust tends to spray all over the place.**\n\n![87ZtidM.png](http://i.imgur.com/87ZtidM.png)\n\nThe KSP Space Engine FX should be similar to the ones in real life. As there is no air pressure in space, the exhaust will form a bowl-shape.\n\n**Radioisotope Thermal Generators**\n\n![PB-NUK.png](http://wiki.kerbalspaceprogram.com/images/c/cd/PB-NUK.png)\n\nThe Radioisotope Thermal Generators in real life contain *plutonium*, which decays over long periods of time and generate heat, which is turned to electricity. However, they will **eventually run out.**\n\nIn KSP, the problem with RTGs is that they provide an **infinite amount of electricity**, which renders any solar panels useless. Slap on a pair of RTGs and you have *infinite electricity*.\n\nFor balancing purposes, RTGs should have reduced power over time, and eventually run out over a few years. This should make people want solar panels as the better solution for long term energy needs.\n\n**Fairings**\n\nThe fairing parts in KSP are quite weak structures. They tend to make the **craft wobble about the fairing**. Futhermore, what worsens the problem is the inability to place struts ON the fairing part. This means that the rocket wobbling problem cannot be fixed.\n\nAdditionally, (i have heard many posts about this, but with to reiterate this) fairings are like confetti. Stage once and you have 20\u002B pieces of fairings flying about. **A suggestion is the option to toggle between confetti, 2 part, 3 part and 4 part fairings. This is to allow maximum speed of fairing sep, yet prevent confetti showers from happening every time.**\n\n![WYLFmJw.png](http://i.imgur.com/WYLFmJw.png)\n\nA suggestion for fairings is the ability to **add curves into fairings**. This will make the craft more sleek and open up new possibilities.\n\n![9LTU6xi.png](http://i.imgur.com/9LTU6xi.png)\n\n**Nuclear \u0022NERV\u0022 Engines**\n\nMany ksp players have touted at the \u0022realism\u0022 of nuclear engines in ksp. The change from lf\u002Box to lf is big, but realistic. However, they do not burn any fuel at all.\n\nNuclear engines produce heat using a nuclear core, causing the exhaust to expand and escape quickly, increasing ISP. However, the process of burning does not happen. Hence, **nuclear engines should not have any FX at all, just the engine glowing bright blue.**\n\n![7597484382_58c799692d_z.jpg](http://up-ship.com/blog/wp-content/uploads/2014/05/7597484382_58c799692d_z.jpg)\n\nHere at the nerva engine test, the exhaust, hygrogen gas, is lit to prevent any explosions.\n\n**Edited \u003Ctime datetime=\u00222015-06-02T12:27:36Z\u0022 title=\u002206/02/2015 12:27  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 2, 2015\u003C/time\u003E by Rdivine**"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2015-06-02T12:57:13Z","Content":"Dunno about NERVAs. I would actually like to have some FX to see if the engine is running or not.\n\nI agree with the rest, though."},{"CreatedByName":"Andiron","CreatedById":141782,"CreatedDateTime":"2015-06-02T16:21:28Z","Content":"I agree for engines FX\n\nIn atmosphere, they should have a lot denser smoke and flames\n\nIn space it should be a compact egg-shaped exhaust"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2015-06-03T01:08:58Z","Content":"Most RTGs IRL last 10 years or more. 10 years is longer than most trips in Kerbol system, I think making it an infinite power source is not a big problem but a reasonable simplification."},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2015-06-03T01:23:36Z","Content":"I definitelly agree about engine effects, that is something that still hinders KSP\u0027s realism for me.\n\nThough I don\u0027t quite agree about RTGs, yes, they should decay, but I think it should happen over decades. \n\nNot as slowly as real life ones, but enough that old probes you go back to visit still have some power despite their age. One of the useful things about that technology is the length of time it can operate for. Maybe a half life of 15-20 years?\n\nThey are already more costly in terms of weight when compared to the alternatives, despite their convenience. A small nerf could be justified perhaps, but not a short lifespan.\n\nI disagree about Lv-N thrust though, it may not be 100% realistic, but it is useful that it\u0027s obvious when an engine is running. Plus, it does look better with some visible exhaust\n\n."},{"CreatedByName":"Tankman101","CreatedById":144359,"CreatedDateTime":"2015-06-03T02:30:45Z","Content":"Space engine FX are probably more trouble than its worth.\n\nRTGs are heavy, expensive, and produce absolutely pitiful amounts of EC. Keep them as infinite power sources for tiny chem-probes.\n\nClamshell fairings have been debated to death, and curved fairings are already possible, as is seen in the screenshot.\n\nLV-N shouldn\u0027t have its activation obfuscated for the sake of realism, there needs to be a way to very clearly see that it is on. It\u0027s the same problem I have with ion engines."},{"CreatedByName":"Kibble","CreatedById":131042,"CreatedDateTime":"2015-06-03T02:39:17Z","Content":"Realism Overhaul fixes many of the more physically-impossible things in KSP. But no mod even adds a simple adjustment for rocket engine plume shape based on air pressure!"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2015-06-03T15:13:37Z","Content":"\u003E \n\u003E Realism Overhaul fixes many of the more physically-impossible things in KSP. But no mod even adds a simple adjustment for rocket engine plume shape based on air pressure!\n\nThere was (still is?) a mod called RealPlume which did (still does?) just that."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-03T21:13:31Z","Content":"And it\u0027s part of RO, at that. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/01OP6)"},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-06-04T09:18:58Z","Content":"\u003E \n\u003E Realism Overhaul fixes many of the more physically-impossible things in KSP. But no mod even adds a simple adjustment for rocket engine plume shape based on air pressure!\n\nSmokescreen (that allows exactly that) was released early 2014 and expansion was added more than a year ago. Not all mods use it all its features but the current hotrocket config does, and the good people of Realism Overhaul are writing configs for all their engines ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Hobbes Novakoff","CreatedById":129018,"CreatedDateTime":"2015-06-04T16:42:36Z","Content":"\u003E \n\u003E Space engine FX are probably more trouble than its worth.\n\u003E RTGs are heavy, expensive, and produce absolutely pitiful amounts of EC. Keep them as infinite power sources for tiny chem-probes.\n\u003E \n\u003E Clamshell fairings have been debated to death, and curved fairings are already possible, as is seen in the screenshot.\n\u003E \n\u003E LV-N shouldn\u0027t have its activation obfuscated for the sake of realism, there needs to be a way to very clearly see that it is on. It\u0027s the same problem I have with ion engines.\n\nI agree wholeheartedly. RTGs are intended for low-EC trickle operations-In other words, probe cores. They\u0027re also quite useful when building military stuff (Although that shouldn\u0027t be a prime concern of the devs) because they can be hidden inside armor, unlike solar panels. They\u0027re also absolutely essential for exploration past Dres, with the new power curves for solar panels.\n\n- - - Updated - - -\n\n\u003E \n\u003E For balancing purposes, RTGs should have reduced power over time, and eventually run out over a few years. This should make people want solar panels as the better solution for long term energy needs.\n\nHowever, you have forgotten to take into account that with the new update solar panels are effectively useless past Dres. Therefore, RTGs are necessary, and if you want a long-term installation in the Jool system (like a Laythe base) with RTG decay you\u0027d have to keep it continuously supplied with either new RTGs or with fuel for fuel cells.\n\nAlso, \u0022good looking\u0022 takes precedence for me over \u0022realistic looking.\u0022 I don\u0027t want these effects because it makes my ship look like it\u0027s being propelled by overgrown RCS thrusters."},{"CreatedByName":"Theysen","CreatedById":144656,"CreatedDateTime":"2015-06-04T16:43:12Z","Content":"Besides solar panels also lose their effectiveness over the years e.g. by radiation (just to name one factor among the others) in space environment. It\u0027s an decreasing exponential function. Due to this fact RTGs are the go to in the real world so I don\u0027t see a problem by making them infinite power sources."},{"CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2015-06-05T04:51:05Z","Content":"\u003E \n\u003E Besides solar panels also lose their effectiveness over the years e.g. by radiation (just to name one factor among the others) in space environment. It\u0027s an decreasing exponential function. Due to this fact RTGs are the go to in the real world so I don\u0027t see a problem by making them infinite power sources.\n\nPerhaps this is where fuel cells come in? I do agree with the people that RTGs do sound too nerfed if it ran out over a couple of years, but having an infinite source of energy renders any other sources of electricity useless. Fuel cells sound great when you don\u0027t have a better alternative. Furthermore, nerfing RTGs gives us a better reason for putting probes into \u0022hibernation\u0022."},{"CreatedByName":"Hobbes Novakoff","CreatedById":129018,"CreatedDateTime":"2015-06-05T19:18:34Z","Content":"\u003E \n\u003E Perhaps this is where fuel cells come in? I do agree with the people that RTGs do sound too nerfed if it ran out over a couple of years, but having an infinite source of energy renders any other sources of electricity useless. Fuel cells sound great when you don\u0027t have a better alternative. Furthermore, nerfing RTGs gives us a better reason for putting probes into \u0022hibernation\u0022.\n\nA problem with fuel cells is that it\u0027s waaaaaay too easy to leave them on during a long time warp and come out to find that every last drop of fuel is gone. And it\u0027s equally as easy to leave them off and find that your battery is completely drained. Not to mention, the fact that RTGs are an infinite source of EC is balanced by the fact that a) They give 0.75 EC per second, so you\u0027d need about 10 of them for 1 ion engine, ![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) They weigh a ton, c) they\u0027re crazy bulky, and d) they cost thousands of funds apiece. They\u0027re balanced as they are. They\u0027re also the only viable choice for long-term missions."},{"CreatedByName":"Noah_Blade","CreatedById":145789,"CreatedDateTime":"2015-06-07T14:56:26Z","Content":"\u003E \n\u003E And it\u0027s part of RO, at that. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\u003E [http://imgur.com/a/01OP6](http://imgur.com/a/01OP6)\n\nI think it should be stock the effects from RealPlume,the Nerva should have some sort of exuaust even if it is just coolant or something...\n\n and Rtgs should have a config for mods like RSS or RO... and far out missions like jool\u0027s moons or eeloo solar energy is scarce\n\n**Edited \u003Ctime datetime=\u00222015-06-07T14:59:00Z\u0022 title=\u002206/07/2015 02:59  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by Noah\\_Blade**"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-06-08T15:46:12Z","Content":"From the Voyager 2 wiki:\n\n\u0022The spacecraft was built with 3 Multihundred-Watt radioisotope thermoelectric generators (MHW RTG). Each RTG includes 24 pressed plutonium oxide spheres and provides enough heat to generate approximately 157 watts of power at launch. Collectively, the RTGs supply the spacecraft with 470 watts at launch and will allow operations to continue until at least 2020.\u0022"},{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-06-08T15:52:30Z","Content":"10/10 would support again.\n\nHere, have this:\n\n![CwP3hvA.png](http://i.imgur.com/CwP3hvA.png)"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-08T15:57:37Z","Content":"\u003E \n\u003E Smokescreen (that allows exactly that) was released early 2014 and expansion was added more than a year ago. Not all mods use it all its features but the current hotrocket config does, and the good people of Realism Overhaul are writing configs for all their engines ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI was going to shamelessly plug HotRockets here but I guess you took care of that. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"}]}