{"TopicId":113072,"ForumId":55,"TopicTitle":"Fuel-powered wheel?","CreatedByName":"Crusher48","CreatedById":135642,"CreatedDateTime":"2015-06-16T00:18:11Z","PageNum":1,"Articles":[{"CreatedByName":"Crusher48","CreatedById":135642,"CreatedDateTime":"2015-06-16T00:18:11Z","Content":"Right now, all the rover wheels are packed into the end of the tech tree, meaning no rovers early on. However, we obviously still have gas-powered cars (like the Crawler and those various vehicles that drive around the construction buildings), so would it be possible to make a wheel that consumes a small amount of fuel to run early on? It would help with rovering early on, and later on it could still be useable in the same way that a fuel cell can be used instead of an RTG."},{"CreatedByName":"Murph","CreatedById":90837,"CreatedDateTime":"2015-06-16T01:12:46Z","Content":"For operation in zero atmosphere conditions, it would have to run LF\u002BO, which would be a vastly more complex and advanced piece of technology than either an electric motor or a normal internal combustion piston engine operating on atmospheric oxygen.\n\nSo, I say \u0022NO\u0022 to this. Additionally, I don\u0027t think you can reasonably assume that the various vehicles you see running around the space center are actually running on IC engines. They could very easily be electric vehicles. The unseen crawler most likely would use IC engines, due to the power needed to move large rockets, but more likely diesel-electric (so still electric motors driving the wheels/tracks, or possibly diesel-hydraulic) than diesel-mechanical (mechanical transmission does not scale up nearly as well as hydraulic or electrical transmission)."},{"CreatedByName":"Grumman","CreatedById":76014,"CreatedDateTime":"2015-06-16T01:31:14Z","Content":"I think what you\u0027d want is a Generator part that converts liquid fuel \u002B atmospheric air into electricity the same way the fuel cell converts liquid fuel and oxidiser into electricity. That way, you\u0027d be able to use it for other things, like powering a mining facility on Laythe."},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-06-16T01:46:27Z","Content":"Murph\u0027s right, an IC engine would only be any good on Kerbin or Laythe. Also those vehicles in the SPH/VAB look decidedly like electric vehicles to me. \n\nBut OP\u0027s point is still that there are things driving around, so why can\u0027t we have wheels sooner on. There\u0027s been a lot of discussion [in this thread](https://forum.kerbalspaceprogram.com/forums/59-Suggestions-and-Development-Discussion) about a better tech tree that would allow a player to start in a number of different ways. One of the different ways I\u0027d like to start with is aircraft, but I\u0027d also like to have the option to build a simple rover right at the start and go for a little drive around KSC.\n\n- - - Updated - - -\n\n\u003E \n\u003E I think what you\u0027d want is a Generator part that converts liquid fuel \u002B atmospheric air into electricity the same way the fuel cell converts liquid fuel and oxidiser into electricity. That way, you\u0027d be able to use it for other things, like powering a mining facility on Laythe.\n\nThere is a mod with some really nicely made parts that has exactly that - [Universal-Storage](https://forum.kerbalspaceprogram.com/threads/75129-Universal-Storage-1-1-0-4-%28For-KSP-1-0-x%29-26th-May-2015)."},{"CreatedByName":"Tankman101","CreatedById":144359,"CreatedDateTime":"2015-06-16T03:34:41Z","Content":"If you want a LFO crawler you should use fuel cells to power the wheels."},{"CreatedByName":"Orbital Vagabond","CreatedById":145561,"CreatedDateTime":"2015-06-16T13:48:52Z","Content":"Or we could just move electric wheels to way earlier in the tech tree..."},{"CreatedByName":"JacaByte","CreatedById":60077,"CreatedDateTime":"2015-06-16T14:28:30Z","Content":"1. Put LFO on your rover\n\n2. Put fuel cells on your rover\n\n3. ????\n\n4. Profit."},{"CreatedByName":"KrazyKrl","CreatedById":65849,"CreatedDateTime":"2015-06-16T18:28:43Z","Content":"I agree that we need a decent early rover wheel. Possibly the smallest one as early as the tiny landing legs.\n\nThis way, we have tiny parts to make tiny rovers. With a small fuel cell powering them, they could have very good range; even without solar energy from a tiny solar panel. And since the rovers will be so tiny, they can\u0027t carry large science experiments like the materials bay."}]}