{"TopicId":113801,"ForumId":55,"TopicTitle":"Atmo Drag Further Reduced...and SRBs Rebalanced to Compensate?? Really??","CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2015-06-23T03:26:37Z","PageNum":1,"Articles":[{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2015-06-23T03:26:37Z","Content":"Various items in the dev notes to 1.0.3 noted that drag was further reduced in various ways. Also the observation that SRBs were tweaked to compensate.\n\nSo I figured this meant that solids had gotten (minorly?) nerfed. As I use solids extensively (probably over-extensively, to be honest) especially in early career but also later on, I was a bit apprehensive about just how bad a nerf the Kickback (in particular) had gotten.\n\nIt\u0027s been... BUFFED??\n\nRan off and tested a Kickback-heavy lifter with a station design that it has in the past been JUST BARELY capable of putting in orbit if I flew the launch trajectory \\*just right\\*. (As in: 400 tons on the pad, but with maybe a couple hundred units of LF/O left in the tanks after orbit-circ into a 75x75km orbit.)\n\nI was annoyed with myself for screwing up my test, as I really botched up the ascent and figured it would not make orbit at all and I\u0027d learn nothing. But...flew it at a slightly LOWER liquid-engine throttle on ascent than I\u0027m accustomed to, and wound up in a ~70x85km orbit with tanks still carrying something like 800-900 units of LF/O! OMG! If I tweak the design just a bit, and actually fly the ascent COMPETENTLY, I might even be able to send it on to Mun or Minmus without the hassle of a refueling run first! Woot!\n\nSo... what gives? Do you suppose Squad just goofed, and buffed where they meant to nerf? Or is there something else going on here that I haven\u0027t noticed yet?"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2015-06-23T03:30:47Z","Content":"Yeah, I noticed that too, I slapped 4x kickbacks on the sides of a Rockomax tank and watched the thing unexpectedly go hypersonic.\n\nso, SRBs are now a viable option. before, I barely ever used them because asparagus/onion/bamboo fuel routing proved to be better."},{"CreatedByName":"Ext3h","CreatedById":142265,"CreatedDateTime":"2015-06-23T03:34:25Z","Content":"Looks like you\u0027ve hit terminal velocity much earlier than you were used too, thanks to reduced drag, and thereby running into the Mach barrier which would make you waste LF/O during early stages without any dV gain.\n\nJust try to avoid convection FX at all cost during ascend, and you will notice how your fuel efficiency increases big time."},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2015-06-23T03:40:06Z","Content":"Asparagus gave a better mass fraction and lower mass on the pad, but SRBs made a cheaper lifter (and for small/medium lifts, generally a lower part count). I tend to build small payloads, so SRBs have always been my good friends. Now it\u0027s just that much easier for me to do what I was doing already. I wonder how long until Squad realizes what they did and re-nerfs them in 1.0.4?"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2015-06-23T03:45:11Z","Content":"I wonder if you put a small payload on a kickback with the thrust limiter to 50%, will it reach suborbit?"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2015-06-23T04:34:40Z","Content":"All you need to go suborbital is a TWR above 1... Any rocket engine can do that with a light-ish craft ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)."},{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-06-23T05:03:53Z","Content":"\u003E \n\u003E I wonder if you put a small payload on a kickback with the thrust limiter to 50%, will it reach suborbit?\n\nScratch that, I just put two modules of a space station into orbit with a \u0022Falcon Heavy\u0022 style triple SRB arrangement, with the outboard pair on high-ish thrust and the center one on 50%. Cheap and effective kick to sub-orbital trajectory, with a poodle or 909 for orbital insertion.\n\nI then sent a resupply ship after the first two station modules docked to each other, using a lone Kickback. This one was blazing fast and the supply ship didn\u0027t even need solar panels. \n\nIt\u0027s quite surprisingly good possibly due to the tall pencil-thin shape of the stack, much like the NASA Ares I."},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-06-23T05:44:37Z","Content":"What\u0027ya know! suddenly a rocket in KSP works not unlike a real life rocket. Who woulda thought! ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2015-06-23T05:47:17Z","Content":"Considering how underwhelming SRBs were in 1.0.2, I\u0027m not complaining if they\u0027re useful again. With parachutes on my boosters, liquid fuel was not only more efficient, but *cheaper*, which used to be what I used the SRBs for. Nice to be able to use them for cheap satellite contracts again."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-23T05:56:52Z","Content":"My read was that SRBs were buffed due to the drag changes *vs 1.0.* not the changes 1.0.2 to 1.0.3. Despite the more-than-doubling of drag in 1.0.1/1.0.2, the SRBs had their 1.0 stats still in 1.0.2. Now that drag is at a medium between the two, I guess it made sense to put the SRB values back up some (but still rather lower than in .90, let\u0027s remember)."},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2015-06-23T05:57:56Z","Content":"Does anyone know what the exact changes are?\n\nI\u0027m glad if they were buffed though. Back in .90 they were my go-to engines. In 1.02, I barely used them at all because there was just so few instances where they came in handy."},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-06-23T06:07:40Z","Content":"\u003E \n\u003E Does anyone know what the exact changes are?\n\nYeah, I perform diffs between versions so I can see what changes are made for my modding. Here\u0027s the changes made to the BACC for an example:\n\n1.02:\n\n    \t\tatmosphereCurve\t\t{\t\t\tkey = 0 180\t\t\tkey = 1 165\t\t\tkey = 6 0.001\t\t}\n\n1.03:\n\n    \t\tatmosphereCurve\t\t{\t\t\tkey = 0 210\t\t\tkey = 1 175\t\t\tkey = 6 0.001\t\t}\n\nSo both vacuum (key = 0 values) and sea level (key = 1) ISP has received a significant boost.\n\nAdditionally:\n\n1.02:\n\n    \tRESOURCE\t{\t\tname = SolidFuel\t\tamount = 600\t\tmaxAmount = 600\t}\n\n1.03:\n\n    \tRESOURCE\t{\t\tname = SolidFuel\t\tamount = 820\t\tmaxAmount = 820\t}\n\nSo they carry 35\u002B% more fuel as well.\n\nOnly other change is a reduction in their cost in funds from 1050 to 850, and the addition of a parameter to govern their skin temperature, so with the drag changes in 1.03 they\u0027re significantly more powerful and cheaper to boot.\n\n**Edited \u003Ctime datetime=\u00222015-06-23T06:30:01Z\u0022 title=\u002206/23/2015 06:30  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by FlowerChild**"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-23T06:21:58Z","Content":"\u003E \n\u003E So... what gives? Do you suppose Squad just goofed, and buffed where they meant to nerf? Or is there something else going on here that I haven\u0027t noticed yet?\n\nI think the biggest thing you are seeing is that there is less drag, so the engines will seem more powerful.\n\nI just did a back-to-back test of the most basic career starter craft. Mk1 cockpit, Mk16 parachute, and flea booster.\n\nASL thrust\n\n1.02: 179.2\n\n1.03: 162.9\n\nVac thrust\n\n1.02: 192\n\n1.03: 192\n\nSo they cut the thrust a little at sea level but kept it the same in vacuum.\n\nISP\n\n1.02: 140-150\n\n1.03: 140-165\n\nThey gave it a little better ISP in vacuum.\n\nFuel:\n\n1.02: 100\n\n1.03: 140\n\nWow, 40% more fuel. And with better ISP, too. It burned for substantially longer when I tested them.\n\nTest flights, straight up from the launch pad with SAS set at the default \u0022hold rotation\u0022 setting\n\n1.02: 4500 meters apogee.\n\n1.03: 9657 meters apogee.\n\nHuge difference. Lower drag and more fuel.\n\nSo what if I cut the fuel back a little? I went back to 1.03 and I only gave it 98 fuel (I couldn\u0027t tweak it to 100 exactly). How far up did it go? 6100 meters.\n\nSo with the same fuel, it went about 20% farther up. With the new, 40% increased fuel, it went 100% farther up."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-06-23T06:28:03Z","Content":"Having played 1.0, it certainly appeared that the Flea was balanced to provide a 5-10km apoapsis in career (i.e. to pass the 5000m altitude record, the first altitude record). In 1.0.2, that was only barely possible if at all, as you just demonstrated (4500m). However, the SRBs weren\u0027t buffed in 1.0.2 to make up for the drag change, so..."},{"CreatedByName":"Jarin","CreatedById":71395,"CreatedDateTime":"2015-06-23T06:44:18Z","Content":"\u003E \n\u003E My read was that SRBs were buffed due to the drag changes *vs 1.0.* not the changes 1.0.2 to 1.0.3. Despite the more-than-doubling of drag in 1.0.1/1.0.2, the SRBs had their 1.0 stats still in 1.0.2. Now that drag is at a medium between the two, I guess it made sense to put the SRB values back up some (but still rather lower than in .90, let\u0027s remember).\n\nThat makes a lot more sense. Again, glad that my old building style will work again."},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-06-23T07:01:11Z","Content":"These changes are a good thing. In 1.0.2, SRBs were basically only useful as off-the-pad TWR kickers for the first 10-20 seconds of flight, because liquid stages were just better at everything (including cheaper).\n\nWith this buff, they should have an actual niche where they excel again ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-06-23T07:07:42Z","Content":"\u003E With this buff, they should have an actual niche where they excel again ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI\u0027m not sure if \u0022always for everything\u0022 qualifies as a niche ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n**Edited \u003Ctime datetime=\u00222015-06-23T07:10:28Z\u0022 title=\u002206/23/2015 07:10  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by FlowerChild**"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-06-23T07:23:40Z","Content":"Come on now FC, you don\u0027t really believe that. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) A third less vacuum Isp, high part weight, no adjustable throttle, no way to add extra fuel, no gimbals, only one single part size... that\u0027s in no way going to replace liquid stages everywhere."},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-06-23T07:30:13Z","Content":"\u003E \n\u003E Come on now FC, you don\u0027t really believe that. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) A third less vacuum Isp, high part weight, no adjustable throttle, no way to add extra fuel, no gimbals, only one single part size... that\u0027s in no way going to replace liquid stages everywhere.\n\nNah man, was an entirely tongue in cheek response, partly due to a number of tests I had just run where low tech BTSM boosters were seeing a 300% increase in altitude reached due to the drag reduction without any changes to their stats, and then noticing that stock boosters had received a stat bump on top of that.\n\nJust trying to keep my mood light in spite of that ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI do have strong suspicions that Squad may have gone too far with the drag reductions in 1.03 and made getting mass to orbit trivial in the process, but I doubt the booster changes alone will have much of an impact on that.\n\n**Edited \u003Ctime datetime=\u00222015-06-23T07:47:32Z\u0022 title=\u002206/23/2015 07:47  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by FlowerChild**"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-06-23T07:57:21Z","Content":"Would be interesting to compare 1.0 atmospheric drag with the new values in 1.0.3. Do we have less drag now than back then? Or more? About the same?\n\nPersonally I found the atmosphere behavior in 1.0.2 a bit irritating, specifically the way a rocket would veer off to a random side even while fin-stabilized. Launch the same vessel three times with the same small pitchover tap at 50 m/s, and get gravity turns towards 103Ã‚Â°, 71Ã‚Â° and 97Ã‚Â° respectively. It never does this under FAR with the exact same rocket, and it didn\u0027t do it under 1.0 either if memory serves. Hope at least that behavior went the way of the dodo in 1.0.3, because it was really quite annoying."},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-06-23T08:00:38Z","Content":"\u003E \n\u003E Would be interesting to compare 1.0 atmospheric drag with the new values in 1.0.3. Do we have less drag now than back then? Or more? About the same?\n\nNo idea. 1.0 was active for such a short period that I didn\u0027t even get to tweaking any values before 1.02 was already out ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n\u003E \n\u003E Personally I found the atmosphere behavior in 1.0.2 a bit irritating, specifically the way a rocket would veer off to a random side even while fin-stabilized.\n\nMuch to my dismay I discovered earlier that fin stabilizing rockets seems to now be back to being a hindrance to rocket performance rather than a benefit, so I\u0027m not sure that\u0027s better ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nI\u0027m wondering if the drag may have been reduced so much where that might even be the case for adapters or even nosecones as well, but I think I\u0027m done with the testing for today and will look into that tomorrow. Would be a real shame if it were the case as those parts finally having meaning was one of the things that made me happiest about the 1.x versions.\n\n**Edited \u003Ctime datetime=\u00222015-06-23T08:02:45Z\u0022 title=\u002206/23/2015 08:02  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by FlowerChild**"},{"CreatedByName":"mikegarrison","CreatedById":137807,"CreatedDateTime":"2015-06-23T08:20:43Z","Content":"\u003E \n\u003E Would be interesting to compare 1.0 atmospheric drag with the new values in 1.0.3. Do we have less drag now than back then? Or more? About the same?\n\u003E Personally I found the atmosphere behavior in 1.0.2 a bit irritating, specifically the way a rocket would veer off to a random side even while fin-stabilized. Launch the same vessel three times with the same small pitchover tap at 50 m/s, and get gravity turns towards 103Ã‚Â°, 71Ã‚Â° and 97Ã‚Â° respectively. It never does this under FAR with the exact same rocket, and it didn\u0027t do it under 1.0 either if memory serves. Hope at least that behavior went the way of the dodo in 1.0.3, because it was really quite annoying.\n\nI just did a very simple test. I put a 2.5m controller on top of one of the \u00221/2 orange\u0022 2.5m fuel tanks and stuck a mainsail at the bottom. SAS on, engines 100% throttle, burn until no more fuel. It got red hot but didn\u0027t explode, and when I left the atmosphere (coasting) I had an apoapsis of 516680 meters. It started tumbling in the upper atmosphere, after I ran out of fuel.\n\nThen I did the exact same thing except I had the 2.5m nose cone on top. It got red hotter, but still didn\u0027t explode. Apoapsis of 854790 meters. There was just a little bit of tumbling, but it never flipped sideways like the first one did. So under this somewhat extreme test, the nose cone did improve the performance of the rocket.\n\nHow much of the improvement was due to drag when it was still burning fuel and how much was due to the lack of tumbling? I wasn\u0027t sure. So I tried again.\n\nSame two rockets, except I added a 2.5m monoprop tank just above the fuel tank, and stuck a boatload of 4-way rcs nozzles on there. WhenI launched, I not only had SAS turned on but I also had rcs.\n\nEither the slower speeds and/or changed c.g. (due to the weight of the monoprop tank) or the rcs itself solved the tumbling issue. Neither ship tumbled. When they got clear of the atmosphere, the ship with no nosecone had an apo of 201269. The ship with a nose cone? 283509.\n\nSo far it looks like the drag saved with the nose cone more than offsets the weight. Going at slower (saner) speeds might reduce this benefit, but making a gravity turn rather than just burning straight up would probably increase the benefit. It looks like the nosecones are still worth putting on the ship.\n\n**Edited \u003Ctime datetime=\u00222015-06-23T08:36:45Z\u0022 title=\u002206/23/2015 08:36  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by mikegarrison**"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-06-23T08:24:35Z","Content":"\u003E \n\u003E Much to my dismay I discovered earlier that fin stabilizing rockets seems to now be back to being a hindrance to rocket performance rather than a benefit, so I\u0027m not sure that\u0027s better ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\u003E I\u0027m wondering if the drag may have been reduced so much where that might even be the case for adapters or even nosecones as well, but I think I\u0027m done with the testing for today and will look into that tomorrow. Would be a real shame if it were the case as those parts finally having meaning was one of the things that made me happiest about the 1.x versions.\n\nWell, since BTSM is already a total conversion mod anyway, maybe you can ship your own physics.cfg with a slightly bumped drag value? If that\u0027s something you can set in that file. Just randomly had the idea..."},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-06-23T08:26:46Z","Content":"\u003E \n\u003E the nose cone did improve the performance of the rocket.\n\nBonus ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nThat really was just wild speculation on my part due to the fin thing that I probably should have just kept to myself before running further tests.\n\n\u003E \n\u003E Well, since BTSM is already a total conversion mod anyway, maybe you can ship your own physics.cfg with a slightly bumped drag value? If that\u0027s something you can set in that file. Just randomly had the idea...\n\nYup, that\u0027s certainly something I\u0027m considering, but I know that those are the kind of decisions it\u0027s always best to sleep on, especially if you\u0027re already in a frustrated state of mind ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nIt\u0027s the kind of balance change where from that point forward you basically have to take responsibility for balancing absolutely everything else in the game from top to bottom, which is obviously a lot of additional work to take on.\n\nI guess that\u0027s a big part of why I consider aero getting entirely rebalanced every few weeks like this rather radical, as I know all to well what a heavy impact it has on the balance of pretty much everything else in the game.\n\n**Edited \u003Ctime datetime=\u00222015-06-23T08:33:25Z\u0022 title=\u002206/23/2015 08:33  AM\u0022 data-short=\u00229 yr\u0022\u003EJune 23, 2015\u003C/time\u003E by FlowerChild**"},{"CreatedByName":"Theysen","CreatedById":144656,"CreatedDateTime":"2015-06-23T08:38:19Z","Content":"Well, the reduced drag is kind of a struggle right now for me.. I am on early career now again and fulfilling these tourism contracts where they want to go suborbital. I put 4 Mk-1 Pods and radial chutes on it but before landing the craft only reaches about 320m/s and the chutes get destroyed when I am already below 2000m. It doesnt slow down like I thought, do we have to think smaller before unlocking drogue and airbrakes? I kind of like the direction but this thing should aerobrake on its own to be honest and not fall like a stone in lower atmosphere.."}]}