{"TopicId":114407,"ForumId":55,"TopicTitle":"Update the Building Damage","CreatedByName":"Avetho","CreatedById":144683,"CreatedDateTime":"2015-06-28T00:43:08Z","PageNum":1,"Articles":[{"CreatedByName":"Avetho","CreatedById":144683,"CreatedDateTime":"2015-06-28T00:43:08Z","Content":"Right now the damage system seems to be a bit off what I think it should be. In my blog I wrote this: \n\n\u003E \n\u003E As far as my knowledge of the game engine goes, this suggestion won\u0027t damage the performance of KSP too much, if at all.\n\u003E Currently there is a damage engine that I think is rather intuitive, but alas, unrealistic and slightly buggy. It is based on weight, but should be more so on velocity. A building should have damage associated with every part of it just like a craft does. An engine\u0027s exhaust will slowly eat away at any part in it\u0027s path, while weight of a part doesn\u0027t hurt a craft too much, only the stress applied to the joints causing movement and breakage, then explosions. The damage engine of a building should be more like a craft, they are both structures, after all. When a really large vehicle lands super slowly on the VAB, the VAB explodes at an instant and collapses into a model of a destroyed VAB. I love the destruction effect, don\u0027t get me wrong, but how it gets destroyed is the problem I have. When a small object travelling at a speed enough to equal the force of the giant vehicle crashes into the VAB, the VAB sits there, shrugs it off, and doesn\u0027t get destroyed. Same force, different outcome. In one of the latest videos from one of my favorite YouTubers, Ronin Pawn, he attempts to land the Mk17 Helicarrier on the VAB. At the speed shown in the final clip of the video, he touched the VAB at a mere 1.5 m/s, with the 1.6 kiloton craft. Once the math is done (1/2mv^2^), we get a result of 2048 joules of force. If we invert the variables, and put a 1.5 ton probe at 1600 m/s, we get a force of 1920000 joules, or 1.92 megajoules. That is significantly more than 2.048 kilojoules, almost 1000 times more force. But the less force wins. This is how I know the building destruction is mass based, not force based. And the launchpad should retain damage for each launch too. And every KSC building you launch from.\n\nFrom the observations I made, the current building destruction is based on mass (quite clear with large ships on buildings), because a small projectile with more energy behind it didn\u0027t affect anything. I hope to get a Dev here to correct my findings if the damage engine is indeed based on energy, and I am simply wrong again."},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-06-28T14:19:25Z","Content":"Totes migotos"}]}