{"TopicId":115294,"ForumId":55,"TopicTitle":"More difficulty options.","CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-07-07T14:32:36Z","PageNum":1,"Articles":[{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2015-07-07T14:32:36Z","Content":"At the moment most of the diffiulty options mostly change how grindy the game is, without really making it much more difficult.\n\nThe only thing that really changes the game is the \u0022allow reverts\u0022 option, but not allowing them would require KSP to be a lot more stable.\n\ni think some new options would help, some of them could be disabled even on hard by default.\n\nMany players would not find them fun them, but it would at least solve some common complaints.\n\n1: Upkeep/periodic budget.\n\nAn slider that allows you to either gain/lose money over time, would be 0 on all default settings. (maybe very, very low upkeep on hard?)\n\n2. Contract deadlines\n\nSlider for choosing how much time you get to complete contracts.\n\nHarder setting = less time\n\n3. Reputation decay. \n\nReputation slowly decays, enabled at a low setting on hard by default.\n\n4. Forced contracts\n\nIf chosen you have to complete or fail every contract you get before you get new ones (disabled by default) (would require fixing the impossible ones.)\n\nTo work right it would probably also require the ability for players to have less than 0 funds.\n\n5. Contract availability. Setting for how fast rejected contracts regenerate.\n\nHarder difficulty = slower.\n\nThese settings would mostly be useful for players who like to run several missions at the same time, those who like to focus on just one mission could disable/not enable them.\n\nIf you have ideas for other settings please post.\n\nNote that options that are basically just \u0022add X mod into stock\u0022 are common suggestions.\n\n(often life support or sometimes construction time)\n\n**Edited \u003Ctime datetime=\u00222015-07-09T19:22:34Z\u0022 title=\u002207/09/2015 07:22  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 9, 2015\u003C/time\u003E by Joonatan1998**"},{"CreatedByName":"simon56modder","CreatedById":119640,"CreatedDateTime":"2015-07-07T18:07:19Z","Content":"Really good idea. Customizing is always a good idea anyway.\n\n[edit]\n\nyou can change the title of a thread by editing it and clicking [Go Advanced]"},{"CreatedByName":"CaptainTurbomuffin","CreatedById":113456,"CreatedDateTime":"2015-07-08T15:22:21Z","Content":"Forced contracts sound good. Anyway, the hardest difficulity is hard enough for me, I don\u0027t need more difficulity. But that\u0027s me."},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-07-09T06:44:44Z","Content":"Some of these actually increase difficulty instead of the current levels which merely increase grind."}]}