{"TopicId":115775,"ForumId":55,"TopicTitle":"In order to Time Warp, you must be \u0022in control of the ship\u0022.","CreatedByName":"RooSalad","CreatedById":147953,"CreatedDateTime":"2015-07-13T10:09:54Z","PageNum":1,"Articles":[{"CreatedByName":"RooSalad","CreatedById":147953,"CreatedDateTime":"2015-07-13T10:09:54Z","Content":"To prevent the abuse of the \u0027time warp to stop spinning out of control\u0027 - you should make it so that you must \u0022be in control of your ship\u0022 before Time Warp is available to use.\n\nTo understand if a player is in control of the ship, check to see if the ship is spinning at more than Rate X. Rate X could be determined by KSP devs, or by the player themselves in the Settings/Options.\n\n- If the ship IS spinning at beyond Rate X (mph/kph/rpm, etc)- disable the use of Time Warp completely, until the ship is back under control.\n\n- If the ship IS NOT spinning at beyond Rate X, let them continue using Time Warp as usual.\n\nThis will add a new level of immersion, while squashing the abuse of a bug/exploit."},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-07-13T10:36:08Z","Content":"Normally Im all for squashing exploits people use in their own singleplayer game(i.e. clipping fuel tanks into fuel tanks), but as this is an exploit I myself use, I must disagree.\n\nIt came in handy last night actually to help me complete a mission despite some godforsaken phantom torque I was experiencing for an unknown reason reason. It was a simple orbital recovery craft, no clipping at all, and it was determined to spin left, forever. Quick on/off on the time warp and I could line myself up for simple small maneuvers.\n\n**Edited \u003Ctime datetime=\u00222015-07-13T10:40:41Z\u0022 title=\u002207/13/2015 10:40  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 13, 2015\u003C/time\u003E by r4pt0r**"},{"CreatedByName":"RooSalad","CreatedById":147953,"CreatedDateTime":"2015-07-13T10:39:08Z","Content":"\u003E \n\u003E Normally Im all for squashing exploits people use in their own singleplayer game(i.e. clipping fuel tanks into fuel tanks), but as this is an exploit I myself use, I must disagree.\n\u003E It came in handy last night actually to help me complete a mission despite some godforsaken phantom torque I was experiencing an unknown reason reason. It was a simple orbital recovery craft, no clipping at all, and it was determined to spin left, forever. Quick on/off on the time warp and I could line myself up for simple small maneuvers.\n\nIf using an exploit to mend to a bug isn\u0027t ridiculous, I don\u0027t know what is.\n\nYou\u0027re all for squashing exploits, unless they\u0027re ones you use?\n\n..."},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2015-07-13T11:30:56Z","Content":"\u003E \n\u003E You\u0027re all for squashing exploits, unless they\u0027re ones you use?\n\u003E ...\n\nPrecisely."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-07-13T11:42:24Z","Content":"I also don\u0027t like this, though I\u0027m not one to squash an exploit that the player can squash on his or her own by simply not doing it, or by installing a mod.\n\nThis includes both clipping and timewarp rotation. The first by not doing it, and the second by installing the Timewarp Rotation Fix mod. As a bonus, that mod allows you to timewarp whenever you want so doesn\u0027t annoy the %@\u0026$ out of the player who is just trying to play the game."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-07-13T12:05:17Z","Content":"This is one that falls under \u0022self-control\u0022. I don\u0027t experience this exploit, because I always stop rotation before timewarping. But who knows, something like it might be brought to stock seeing as we have a difficulty mode that disables quicksaves and reverts, things that can also be avoided by simply not doing them."},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-07-13T13:20:03Z","Content":"I will continue to use this exploit untill SAS is programed to orient my craft in a reasonable manner."},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2015-07-13T13:54:57Z","Content":"Far better solution: Just make rotation persist. \n\nWe don\u0027t need more things that could go wrong, and lock you out of timewarp."},{"CreatedByName":"Nothalogh","CreatedById":139345,"CreatedDateTime":"2015-07-13T21:35:07Z","Content":"\u003E \n\u003E I will continue to use this exploit untill SAS is programed to orient my craft in a reasonable manner.\n\nThis. Stock SAS is ridiculous when switching to another orientation vector"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-07-14T09:00:35Z","Content":"With the current non-saturating reaction wheels, I see this more as a convenience than an exploit to be honest. \n\nIf I\u0027m flying something big and ponderous enough that time warping to stop spin is useful, then I invariably have it kitted out with solar arrays. In which case I have effectively unlimited electrical power and so unlimited control authority via the reaction wheels. At which point it makes no difference (from a game balancing perspective) whether I choose to spend time manually fiddling around with my ship orientation or stopping it by magic using time-warp.\n\nI don\u0027t find it breaks my immersion. Or at least, it only breaks it to the extent that time-warping does."},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2015-07-14T10:01:53Z","Content":"Myself I play with the persistentrotation and RWsaturatable mods and often I don\u0060t want my craft to stop spinning when I warp (persistentrotation removes this anyway). If I end up pointing the wrong way for my solar panels to be getting enough light then I just warp a bit until the craft is pointing a different way and I can regain control.\n\nI don\u0060t want warp to be restricted to when I am in control as I often need to warp to regain control, sometimes that is in a few days so I would be sat there for days waiting to be able to warp which makes no sense to me..."},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2015-07-14T11:02:33Z","Content":"\u003E \n\u003E To prevent the abuse of the \u0027time warp to stop spinning out of control\u0027 - you should make it so that you must \u0022be in control of your ship\u0022 before Time Warp is available to use.\n\u003E To understand if a player is in control of the ship, check to see if the ship is spinning at more than Rate X. Rate X could be determined by KSP devs, or by the player themselves in the Settings/Options.\n\u003E \n\u003E - If the ship IS spinning at beyond Rate X (mph/kph/rpm, etc)- disable the use of Time Warp completely, until the ship is back under control.\n\u003E \n\u003E - If the ship IS NOT spinning at beyond Rate X, let them continue using Time Warp as usual.\n\u003E \n\u003E This will add a new level of immersion, while squashing the abuse of a bug/exploit.\n\n2 posts, a bit early to be suggesting things which most players use. Just cause you don\u0027t like it doesn\u0027t mean that everyone dislikes it. Squad should focus on bugs rather than making the game more realistic. I don\u0027t know about you but I prefer to dock 50mT modules fast. And as someone said earlier, if you have the ability to generate power then what\u0027s the difference. Maybe Squad should fix SAS so we wouldnt need to use timewarp.\n\nthere are more serious, and important, things to address than this."},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2015-07-14T20:34:39Z","Content":"I can see a good reason why we do \\*not\\* want to implement this: EVAs.\n\nKerbals on EVA can sometimes spin out of control, especially when you bounce, trip or fall on a low gravity moon such as Mun or Minmus. Land \\*just\\* wrong, and you have no way of even moving your Kerbal around or activating RCS, where a slight whiff off RCS would \\*stop\\* your Kerbal from rotating everywhere.\n\nRight now, you have the option of waiting it out and seeing your Kerbal get launched all over the place or bounce off a hill (and into an untimely and possibly evitable death), or punch Time Warp and stop rotation, provided you have enough altitude."},{"CreatedByName":"Requia","CreatedById":112924,"CreatedDateTime":"2015-07-14T23:32:54Z","Content":"this doesn\u0027t really work, the main reason to use that trick if you have a poor mass/torque ratio, in which case you can\u0027t move that fast. So any speed other than zero is too high.\n\nA better option might be to remove the need, the stock SAS controls suck, leveled pilots (and equivalent probes) should be able to turn to the manuever node without overshooting, I know this is possible, remote tech does it perfectly."},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-07-17T08:47:03Z","Content":"I sometimes like to watch de-orbiting debris. But to have to wait until it hits the dense part of the atmosphere ... No thank you."}]}