{"TopicId":115962,"ForumId":55,"TopicTitle":"Reward systems","CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-07-15T06:28:55Z","PageNum":1,"Articles":[{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-07-15T06:28:55Z","Content":"\n\u003Cp\u003EI was messing around with KIS/KAS and the new \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/127413-WIP-Kerbal-Planetary-Base-Systems-UPDATE%2811-7-2015%29\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Planetary Base System\u003C/a\u003E mod by Nils277 (which is really cool), and the idea of rewards came to mind.\u003C/p\u003E\u003Cp\u003EIn the stock game, the sole reward is unlocking tech as well all know.\u003C/p\u003E\u003Cp\u003EUsing the engineer (not level 3) to repair a wheel by using a landing leg as a jack, then adding a new wheel, it occurred to me that the leveling system is sort of bizarre. Aside from the fact that perhaps new applicants (plus the initial 4) should maybe have random skill above 0, maybe ranking is a kind of reward.\u003C/p\u003E\u003Cp\u003ERight now, ranking is very formulaic, flyby, orbit, land, plant flag. Meh.\u003C/p\u003E\u003Cp\u003EWhat about specific tasks (done off-kerbin) can add XP? What about missions/contracts that do the same. Rendezvous and dock 2 craft? Pilots get XP. Do science away from kerbin as a scientist? Get XP. Fix stuff for an engineer? Get XP.\u003C/p\u003E\u003Cp\u003EI want to send a decent engineer to Duna, for example, and I know how to rank him via a grind in the Kerbin SoI, but it would be cooler if it was part of a more well thought out reward system.\u003C/p\u003E\u003Cp\u003EFor piloting, the initial milestones could dish out contract-specific XP, but later guys will miss that. Some contracts might help---rescues, for example (give the pilot XP on the first rescue based upon how close they get to the stranded kerbal with a closure rate below 5 or something). Engineers can get repair contracts (stick a new solar panel on Kerbosat). Scientists can reset an experiment, do science, whatever.\u003C/p\u003E\u003Cp\u003EIt\u0027s better than what we have now.\u003C/p\u003E\u003Cp\u003EOther rewards are more complex to figure out, particularly later game. Perhaps the ability to construct a VAB/launchpad elsewhere as a high-level reward. Not just bought with science points, but science, funds, and infrastructure. Buy an expensive (millions), heavy (20 tons?) container in the tree, then the VAB. Land 10 of them at a base that supports XX kerbals, and has power, a science lab, and ISRU. Then you can build the pad/VAB in-situ.\u003C/p\u003E\u003Cp\u003EAny other ideas?\u003C/p\u003E\n"},{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2015-07-16T15:46:54Z","Content":"\n\u003Cp\u003EWhile I am very much behind the whole XP for kerbals thing and have been for some time.\u003C/p\u003E\u003Cp\u003EAs far as the being able to make another VAB somewhere else? \u003C/p\u003E\u003Cp\u003EYou are going to have to face the wrath of the mods on your own for that one. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-07-20T08:22:20Z","Content":"\n\u003Cp\u003EI hope KSP remains one of those traditional games where the reward for playing the game is the fun that you have while playing the game, not a cookie that you get after having played the game.\u003C/p\u003E\n"}]}