{"TopicId":117997,"ForumId":55,"TopicTitle":"Overhaul Tier 1 and 2 buildings.","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-08-09T00:16:13Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-08-09T00:16:13Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wOdhRjD.jpg\u0022 alt=\u0022wOdhRjD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wwNDK3d.jpg\u0022 alt=\u0022wwNDK3d.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EPersonally, I really don\u0027t like the Tier 1 and 2 space centers. Too much brown and blues. Doesn\u0027t really fit with the space center aesthetic that it should be going for. So the main styles I have here are as follows:\u003C/p\u003E\u003Cp\u003E-Converted Industrial Farm (VAB is a grain elevator, maybe not the best idea. Coal mine facility might be better) The low-cost, cheap, but well put together style I was aiming for reflects the RT-5 and RT-10 SRBs. They don\u0027t look like junk, and neither should the VAB.\u003C/p\u003E\u003Cp\u003E-Alternate Tier 0 (not pictured): Coal (or maybe Ore??) Mine facility repurposed as a space center. They would have all the machinery already there for construction, and some decently big buildings.\u003C/p\u003E\u003Cp\u003E-Rocket Testing Grounds (Like Penemunde perhaps. Brown bricks are okay here, but grey concrete might look even better.) Looks entirely neato with the prototype-like liquid fueled rockets of Jeb\u0027s Junkyard.\u003C/p\u003E\u003Cp\u003E-1950s Rocketpunk Spaceport (From the 1954 Disneyland Tomorrowland documentary Man In Space) Fits the part for the retro-looking Rockomax parts. I really liked the design when I saw it in Man-In-Space, and I figure it could be used as a VAB. In the top image above, you can see the Mission Control Center. It\u0027s a blockhouse, which is also seen in the Man-In-Space documentary. It was also designed to look good with the derelict island airport.\u003C/p\u003E\u003Cp\u003E-Cape Canaveral space center with real-looking VAB. Looks great with Kerbodyne Saturn/SLS-like parts. No changes would be needed here, we already have the wonderfully brilliant design by Bac9.\u003C/p\u003E\u003Cp\u003EThere are a whole host of problems with the space centers we got. Texture holes, sub-par quality, Kerbals clipping through ground objects, floating paint lines, conflicting art style with stock parts, etc. It\u0027s not horrible, and its a heck of a lot better than the pictures we were shown of the Barn. But it really does feel like it was hastily made, a bit rushed, and not done with as much love and care as Bac9\u0027s Tier 3 Space Center from 0.21/22.\u003C/p\u003E\u003Cp\u003EI realize it may seem to be a bit too late to redo an entire art asset like this, but it is possible, and I think it could be done a lot better.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-08-09T00:52:42Z\u0022 title=\u002208/09/2015 12:52  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 9, 2015\u003C/time\u003E by GregroxMun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-08-09T00:32:55Z","Content":"\n\u003Cp\u003ECertainly nice drawings, I can\u0027t read your handwriting though. I too try to upgrade buildings in a new career first thing, not because I want the new abilities, but because I can\u0027t stand looking at the ugly Tier 1 and 2.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-08-09T00:34:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003ECertainly nice drawings, I can\u0027t read your handwriting though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENeither can I. Mostly just a literal description of what it is, so it\u0027s not really needed. It has mostly been described in better detail in the description in the OP.\u003C/p\u003E\n"},{"CreatedByName":"CaptainTurbomuffin","CreatedById":113456,"CreatedDateTime":"2015-08-09T08:31:52Z","Content":"\n\u003Cp\u003EI love that you match the builddings\u0027 style with the similar-tier rocket parts\u003C/p\u003E\n"},{"CreatedByName":"Borisbee","CreatedById":91794,"CreatedDateTime":"2015-08-09T09:46:44Z","Content":"\n\u003Cp\u003EThe top tier buildings were done by B9 who does incredible work and it\u0027s why they look so amazing. The other tiers are rather ugly in comparison.\u003C/p\u003E\n"},{"CreatedByName":"JethroReading","CreatedById":105273,"CreatedDateTime":"2015-08-09T11:53:54Z","Content":"\n\u003Cp\u003EI\u0027m pretty sure the devs have said that the tier 1 and 2 designs are by no means final- they are gonna bring back the barn, once they\u0027ve improved it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EJust an aside, did anyone else really dislike the Bac9 criticism of the designs when they came out? Like, he left the team, you can\u0027t then just go \u0022Oh, your work\u0027s no where near as good as mine!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-08-09T13:06:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JethroReading\u0022 data-cite=\u0022JethroReading\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure the devs have said that the tier 1 and 2 designs are by no means final- they are gonna bring back the barn, once they\u0027ve improved it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EJust an aside, did anyone else really dislike the Bac9 criticism of the designs when they came out? Like, he left the team, you can\u0027t then just go \u0022Oh, your work\u0027s no where near as good as mine!\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think they let him go.\u003C/p\u003E\n"}]}