{"TopicId":121368,"ForumId":55,"TopicTitle":"New Maneuver Node Editing Tool","CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-21T18:58:26Z","PageNum":2,"Articles":[{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-22T22:07:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThat is the most glaring issue with the current widget, IMO. I could even accept placement on the orbit without the OP suggestion if the mousewheel issues are addressed as a \u0022perfect\u0022 system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree, that would be the second biggest issue. The biggest issue is at a distance, it is very difficult to grab the right node on the gizmo. It is incredibly irritating to try and grab the prograde and end up grabbing radial. Fine controls aren\u0027t perfect but fine controls are irrelevant if you can\u0027t get the right control in the first place.\u003C/p\u003E\n"},{"CreatedByName":"Wiseman","CreatedById":116239,"CreatedDateTime":"2015-09-23T01:15:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EI disagree, that would be the second biggest issue. The biggest issue is at a distance, it is very difficult to grab the right node on the gizmo. It is incredibly irritating to try and grab the prograde and end up grabbing radial. Fine controls aren\u0027t perfect but fine controls are irrelevant if you can\u0027t get the right control in the first place.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgree one hundred percent, that\u0027s my biggest issue as well. I\u0027m constantly having to switch focus targets and move around just to fine-tune my maneuver, and doing goofy things like trying to angle my camera just right so that I can see if I have an encounter on the far side of the Sun, when my camera is on a ship in orbit around Kerbin. Love this suggestion, very well thought out.\u003C/p\u003E\n"},{"CreatedByName":"Bev7787","CreatedById":136501,"CreatedDateTime":"2015-09-24T11:28:29Z","Content":"\n\u003Cp\u003EI would like the ability that PreciseNode and MechJeb have, with maneuver nodes having the ability to be adjusted with a button, rather than by click and drag.\u003C/p\u003E\n"},{"CreatedByName":"LitaAlto","CreatedById":110917,"CreatedDateTime":"2015-09-26T06:02:15Z","Content":"\n\u003Cp\u003EI like Alshain\u0027s suggestion, a lot. Even when using MechJeb I find myself manually adjusting nodes all the time, and having a control off to the side would be a wonderful improvement.\u003C/p\u003E\n"},{"CreatedByName":"JAFO","CreatedById":132901,"CreatedDateTime":"2015-09-27T12:24:20Z","Content":"\n\u003Cp\u003EGreat idea.. and long overdue. I\u0027d love to see this implemented.\u003C/p\u003E\u003Cp\u003EI totally agree with, and would love to see Gaarst\u0027s suggestion implemented, too.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaarst\u0022 data-cite=\u0022Gaarst\u0022\u003E\u003Cdiv\u003EThinking about it, the problem is not so much the nodes placement but the burn itself.\u003Cp\u003EThe burn times indicated by KSP assume you have constant mass and do not stage... and that\u0027s when it indicates any time at all. Also it calculated this burn time according to your last burn, which is completely stupid. Including the variation of acceleration and mass, and staging in a way that you can predict when/where to burn is not hard, KER shows that it is perfectly possible.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-09-29T20:00:07Z","Content":"\n\u003Cp\u003EYes please, node editing is painful and these suggestions sound good. \u003C/p\u003E\u003Cp\u003EI\u0027m constantly adjusting the wrong thing, or accidentally mouse-wheeling while hovering, or trying to click next orbit and instead deleting it - or worst of all, switching ship because there\u0027s one currently under the parking orbit I\u0027m putting the node on x(\u003C/p\u003E\n"},{"CreatedByName":"pellinor","CreatedById":85299,"CreatedDateTime":"2015-10-03T17:11:01Z","Content":"\n\u003Cp\u003EI\u0027d like to raise the question what coordinate system the maneuver node gizmo should use (see this \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/135762-Fix-the-normal-and-anti-normal-nodes-in-the-maneuver-planner?p=2226697\u0026amp;viewfull=1#post2226697\u0022 rel=\u0022external nofollow\u0022\u003Epost in another thread\u003C/a\u003E). \u003C/p\u003E\u003Cp\u003EShort version, I\u0027d suggest to use the coordinate system of the target orbit (instead of the current one before the node). For example pulling the normal\u002B handle would incrementally add dV in the new normal\u002B direction (which changes in the process), effectively changing the inclination of the target orbit without affecting anything else. Likewise, prograde would raise the velocity after the maneuver without changing the direction.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-03T17:16:54Z\u0022 title=\u002210/03/2015 05:16  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 3, 2015\u003C/time\u003E by pellinor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-10-03T17:25:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pellinor\u0022 data-cite=\u0022pellinor\u0022\u003E\u003Cdiv\u003EI\u0027d like to raise the question what coordinate system the maneuver node gizmo should use (see this \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/135762-Fix-the-normal-and-anti-normal-nodes-in-the-maneuver-planner?p=2226697\u0026amp;viewfull=1#post2226697\u0022 rel=\u0022external nofollow\u0022\u003Epost in another thread\u003C/a\u003E). \u003Cp\u003EShort version, I\u0027d suggest to use the coordinate system of the target orbit (instead of the current one before the node). For example pulling the normal\u002B handle would incrementally add dV in the new normal\u002B direction (which changes in the process), effectively changing the inclination of the target orbit without affecting anything else. Likewise, prograde would raise the velocity after the maneuver without changing the direction.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, sorry. That would be confusing, probably would be inaccurate and impossible, and also directly conflicts with this idea. The controls shouldn\u0027t change in position or behavior on any given node without a burn. If you want a maneuver after the current one, create a second node after.\u003C/p\u003E\n"},{"CreatedByName":"Luis","CreatedById":55075,"CreatedDateTime":"2015-10-05T19:53:33Z","Content":"\n\u003Cp\u003EThis is an incredibly good idea and, if implemented in stock, might just be enough to allow all but the most hardcore players to manage without Precise Node.\u003C/p\u003E\u003Cp\u003EAt this point I think the best way to get it made stock would be for someone to create it as a mod, to demonstrate its usefulness and popularity. Then Squad might bring the modder into the fold, to make it stock. I have my fingers firmly crossed that this happens.\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2015-10-05T23:30:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EYes please, node editing is painful and these suggestions sound good. \u003Cp\u003EI\u0027m constantly adjusting the wrong thing, or accidentally mouse-wheeling while hovering, or trying to click next orbit and instead deleting it - or worst of all, switching ship because there\u0027s one currently under the parking orbit I\u0027m putting the node on x(\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI find the mouse wheel control of the nodes to be bad UI at the best of times.\u003C/p\u003E\u003Cp\u003EI mean in all other software I use and including in KSP (when not over the node) mouse wheel is the zoom control. So much so that it is the ingrained and you don\u0027t think about zooming you just it just do it, then realise your node is now so far out of wack that you sometimes have to delete it and start again. Especially if you moved the mouse slightly and ended up changing normal instead of prograde.\u003C/p\u003E\u003Cp\u003EStill it would be better to have the node control off the path to start with.\u003C/p\u003E\u003Cp\u003EAdd say a modifier key to change mouse from zoom to adjust and I\u0027m fully sold.\u003C/p\u003E\n"},{"CreatedByName":"DancZer","CreatedById":90711,"CreatedDateTime":"2015-10-09T05:36:59Z","Content":"\n\u003Cp\u003EAlshain for president! Excellent idea!\u003C/p\u003E\n"},{"CreatedByName":"meyerweb","CreatedById":135212,"CreatedDateTime":"2015-10-09T16:43:26Z","Content":"\n\u003Cp\u003EI loved this idea \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/119481-Maneuver-Node-Gizmo-2-0?p=1907574#post1907574\u0022 rel=\u0022external nofollow\u0022\u003Ewhen funk proposed it\u003C/a\u003E, and I love it still. \u002B100 to making it happen (I wish I could help!).\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-10-09T18:54:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meyerweb\u0022 data-cite=\u0022meyerweb\u0022\u003E\u003Cdiv\u003EI loved this idea \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/119481-Maneuver-Node-Gizmo-2-0?p=1907574#post1907574\u0022 rel=\u0022external nofollow\u0022\u003Ewhen funk proposed it\u003C/a\u003E, and I love it still. \u002B100 to making it happen (I wish I could help!).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EInteresting, I had no idea it had been proposed already. Slight differences but close enough. You know they say great minds think alike \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"elitebuster","CreatedById":144925,"CreatedDateTime":"2015-10-10T02:11:53Z","Content":"\n\u003Cp\u003EThis seems like a very, very good idea. Faffing about with nodes and cameras are what made me give up, and simply rely on mechJeb for my burns. If the node UI was implemented like this, I\u0027m sure my patience would\u0027ve lasted longer.\u003C/p\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2015-10-10T02:31:16Z","Content":"\n\u003Cp\u003EYes please\u003C/p\u003E\n"},{"CreatedByName":"meyerweb","CreatedById":135212,"CreatedDateTime":"2015-10-12T13:52:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-cite=\u0022Alshain\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-username=\u0022Alshain\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nAlshain said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv\u003E\nInteresting, I had no idea it had been proposed already. Slight differences but close enough. You know they say great minds think alike \u003Cimg alt=\u0022:P\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022\u003E\u003C/div\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHeh. I think you’ve captured some great ideas here that didn’t come up in the earlier proposal, and your UI has some enhancements that are much better, in my opinion. I hope this gets enough traction that someone takes it on! It would make adjusting course-correction nodes much simpler when trying for close encounters with moons (and planets).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-12T14:33:51Z\u0022 title=\u002212/12/2015 02:33  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 12, 2015\u003C/time\u003E by meyerweb\u003C/strong\u003E\n\u003Cbr\u003ECleaned up forum migration errors (Unicode and hyperlinking were both botched—sigh)\n\u003C/span\u003E\n"},{"CreatedByName":"zolotiyeruki","CreatedById":150224,"CreatedDateTime":"2015-10-12T16:25:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022eddiew\u0022 data-cite=\u0022eddiew\u0022\u003E\u003Cdiv\u003EYes please, node editing is painful and these suggestions sound good. \u003Cp\u003EI\u0027m constantly adjusting the wrong thing, or accidentally mouse-wheeling while hovering, or trying to click next orbit and instead deleting it - or worst of all, switching ship because there\u0027s one currently under the parking orbit I\u0027m putting the node on x(\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis, a thousand times this.\u003C/p\u003E\n"},{"CreatedByName":"Snipe86K","CreatedById":137455,"CreatedDateTime":"2015-10-22T05:43:46Z","Content":"\n\u003Cp\u003EI\u0027ll be honest I love the idea! I would love for this to be my first mod, but I think it is a bit out of my league!\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2015-10-22T18:17:43Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EI just noticed some bad behaviour on the stock gizmo\u0027s part which I believe has been unnoticed so far:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EWhen you hit normal or radial, it rotates so it\u0027s in the same frame of reference as the post-maneuver orbit. \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EHowever\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E, your input is \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Estill\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E in the pre-maneuver frame of reference!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EIt\u0027s quite noticeable, for example, if you plan a 90-degree turn right, and then start adding prograde. Given the gizmo position, you\u0027d expect to go further along the 90 degree trajectory, but instead the angle decreases and it goes further along it\u0027s original trajectory.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EVery wrong behaviour, IMO, and very easily fixable just by having the gizmo fixed in the original orbit\u0027s frame of reference.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s not actually what happens, my memory is screwing me. There is something strange related to that when you try to negate all your velocity, however (like planning a landing), and the prog/retro switch around. That\u0027s probably what I was thinking of when I... brainfarted.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-22T18:22:09Z\u0022 title=\u002210/22/2015 06:22  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 22, 2015\u003C/time\u003E by monstah\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-10-26T09:42:07Z","Content":"\n\u003Cp\u003EAll of you have brought together some amazing ideas here, I wholeheartedly support this. The current node editing is just about fine for kerbins SOI including mun and minmus, but going any farther is a gian pain in the ***. I almost never use the stock system anymore since it\u0027s just to much fiddling and wasting time for my taste. I get that squad doesen\u0027t want a huge wall of numbers, that would just make the game even harder for new players. However I find that after almost 1000h ingame the stock tool is just lacking in so many ways. Personally I like my numbers and decimals, as provided by precise node, but I also quite like and enjoy the usability and ease of access that the ccurrent system provides. It\u0027s just that it becomes almost useless for really far targets.\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2015-10-26T17:46:31Z","Content":"\n\u003Cp\u003EFinally got around to reading this whole thread and eff yes. Killer idea Alshain (et al.) This would be a huge help.\u003C/p\u003E\n"},{"CreatedByName":"Temeter","CreatedById":58056,"CreatedDateTime":"2015-11-15T16:16:06Z","Content":"\n\u003Cp\u003EThis would be so utterly amazing to have \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\u003Cp\u003Esquad pls implement k thx bai\u003C/p\u003E\u003Cp\u003Eedit: As for a bit of input, I\u0027d like to able to klick on the nodes name (\u0027node 1\u0027 in mockup) to instantly focus on it. Less scrolling around on the map screen would be nice.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-15T16:19:03Z\u0022 title=\u002211/15/2015 04:19  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 15, 2015\u003C/time\u003E by Temeter\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Destroyer713","CreatedById":136956,"CreatedDateTime":"2015-11-15T18:37:01Z","Content":"\n\u003Cp\u003EI\u0027d honestly love to see something like this in stock. \u003C/p\u003E\u003Cp\u003EAs it is right now, it\u0027s a pain to adjust the periapsis and orbit of an encounter for anything farther than a Kerbin to Mun transfer. You can either focus on where the node is and not be able to see the encounter orbit, or you can focus on the body you\u0027ll encounter and become unable to properly adjust the maneuver node.\u003C/p\u003E\u003Cp\u003ESo yeah, \u002B1 to this idea from me.\u003C/p\u003E\n"},{"CreatedByName":"bbz","CreatedById":133699,"CreatedDateTime":"2015-11-17T01:53:51Z","Content":"\n\u002B1 Support, maneuver nodes editing really need fixing\n"},{"CreatedByName":"m4ti140","CreatedById":67296,"CreatedDateTime":"2015-11-17T16:55:42Z","Content":"\nIn my opinion the tool should rotate with the map, it would make it more intuitive as you would add delta v by moving the marker in the direction you want to burn into on the map.\n"}]}