{"TopicId":122141,"ForumId":55,"TopicTitle":"Individual Toggles for each resource in the IRSU Converter!","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-02T05:56:45Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2015-10-02T05:56:45Z","Content":"\n\u003Cp\u003EThe IRSU Convert currently has a toggle to deploy and retract if I\u0027m not mistaken. But it does not have a Toggle for each resource activation. This may not seem like it is needed to some but it would be very useful in condensing and controlling mining operation practically. Then I could set resources to stop and start individually without starting or stopping the converters as a whole much more reasonably, potentially, given the number of shortcuts. This would save lots of time and possibly hassle and make the equipment more versatile for the user.\u003C/p\u003E\u003Cp\u003ETo be clear this item could use a toggle for all 4 individual resources available, LF\u002BOX, LF, OX, MP.\u003C/p\u003E\u003Cp\u003EAs is to use them all I need 5 shortcuts. This could condense it to only 4 as I could turn them on and off and leave the converter on in essence. For large spacecraft with lots of converters and other items that need shortcuts(ones in large numbers like solar panels and or feul cells) you need all the shortcuts you can get.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-02T06:11:39Z\u0022 title=\u002210/02/2015 06:11  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 2, 2015\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TronX33","CreatedById":109784,"CreatedDateTime":"2015-10-02T06:36:38Z","Content":"\n\u003Cp\u003EActually, it does. Are you talking about the drill? I mines ore, which the ISRU converts, only the drill has \u0022retract\u0022 and \u0022deploy\u0022\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-10-02T10:30:35Z","Content":"\n\u003Cp\u003EThis is already a thing with the stock ISRU part.\u003C/p\u003E\n"}]}