{"TopicId":123431,"ForumId":55,"TopicTitle":"Make the VAB/SPH \u0022snap-to\u0022 feature ignore nodes that it rejects","CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-10-20T14:11:27Z","PageNum":1,"Articles":[{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-10-20T14:11:27Z","Content":"\n\u003Cp\u003EThe problem is with very short/thin parts, such as stack separators. The snap feature in the editors will favor whichever attachment node is defined LAST in the part CFG, even if the orientation rules disallow connecting to that node. When a part is very thin/short, and the nodes\u0027 snap radii overlap, it can be very difficult to attach the part via the correct attachment node if you\u0027re not strictly building \u0022top-to-bottom\u0022 in the editor, or if you want to invert the part (such as a docking port).\u003C/p\u003E\u003Cp\u003EMy suggestion is that while orientation enforcement is enabled, have the \u0022snap\u0022 ignore nodes that are pointing the wrong way.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-21T15:22:11Z\u0022 title=\u002210/21/2015 03:22  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 21, 2015\u003C/time\u003E by NecroBones\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-10-21T11:48:05Z","Content":"\n\u003Cp\u003EI don\u0027t know if ignoring nodes is the best solution, but something really needs to be done about this frustrating behavior. Holding the mouse perfectly still (hands off even) I often get the part oscillating between the green of a valid attachment and the faded out of an invalid one, it is a crapshoot what will happen when I click.\u003C/p\u003E\n"},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2015-10-21T15:08:29Z","Content":"\n\u003Cp\u003EYes, I hate this. Really annoying that I have to save the configuration when I successfully do it.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2015-12-26T17:34:15Z","Content":"\n\u003Cp\u003E\nSince we\u0027re getting closer to KSP 1.1 being released, I wanted to bring this one up again and just \u003Cem\u003E\u003Cu\u003Ehope\u003C/u\u003E\u003C/em\u003E it\u0027s in the list of improvements being made. It can be quite infuriating trying to attach thin/short parts (particularly when building in the \u0022wrong\u0022 direction, such as adding stack separators at the top of something), when the snap-to fixates on a node that can\u0027t connect, just because the nodes are close together.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI get bug reports for SpaceY and my other mods when I have thin docking ports or very short fuel tanks, but I always have to explain to people that this is a stock problem too. If the first time they notice it happens to be with my mods instead of the stock parts, then it becomes my problem too.\n\u003C/p\u003E\n"}]}