{"TopicId":124647,"ForumId":55,"TopicTitle":"Add a deadband for RCS and SAS","CreatedByName":"Skybar","CreatedById":140840,"CreatedDateTime":"2015-11-07T18:27:58Z","PageNum":1,"Articles":[{"CreatedByName":"Skybar","CreatedById":140840,"CreatedDateTime":"2015-11-07T18:27:58Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EWhat is deadband?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIn the real world, gimbals could detect attitude changes to within hundredths of a degree, so the RCS would be firing constantly to correct the ship\u0027s attitude every time a very small attitude error occurred. This wastes a lot of RCS fuel. So a dead band was introduced into autopilot systems. A deadband is a attitude tolerance region in which no automatic attitude correction happens. This deadband was customizable and was adjusted as needed. So for example instead of the RCS firing every time a 0.01 degree of attitude change occurred, a deadband could be introduced within 1 degree of attitude change, so the RCS only fires if the attitude error exceeds 1 degree. This saves RCS fuel as it fires less often. The dead band can be set to varying deviations as required depending on how accurately you want your spacecraft to point in the direction you want.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHow is it useful in Kerbal Space Program?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAs it is useful in real life to save RCS fuel, it would help save fuel in KSP too, especially in large spacecrafts like space stations. I\u0027ve built 2 large space stations and noticed that they use a large amount of RCS fuel as the RCS keeps firing very frequently to correct the space stations attitude and this causes the space station to swing and more RCS is used to try and stop it from swinging which just keeps the swinging going. It would also reduce the annoying twitching engine nozzles do on a small spacecraft as they change direction every millisecond to counter attitude errors when using the SAS. So my suggestion is to add an option in the command module control panel to toggle and set a deadband to the degree you need.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-07T20:00:45Z\u0022 title=\u002211/07/2015 08:00  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 7, 2015\u003C/time\u003E by Skybar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2015-11-07T19:43:20Z","Content":"\n\u003Cp\u003EWelcome to the forums.\u003C/p\u003E\u003Cp\u003EGood idea, seems like this should be a fairly easy thing to implement too (says a guy who doesn\u0027t know how easy it to actually do)\u003C/p\u003E\n"},{"CreatedByName":"Skybar","CreatedById":140840,"CreatedDateTime":"2015-11-07T19:54:00Z","Content":"\n\u003Cp\u003EGlad to be here.\u003C/p\u003E\u003Cp\u003EI learned what a deadband was by reading on the Apollo Missions \u003Ca href=\u0022https://www.goodreads.com/book/show/2323178.How_Apollo_Flew_to_the_Moon\u0022 rel=\u0022external nofollow\u0022\u003E How Apollo Flew to the Moon \u003C/a\u003E (A really good book by the way) and realized that it\u0027s a really efficient thing to implement. Thought it might be really useful in KSP too given how much fine RCS control it gives, especially helpful for space stations.\u003C/p\u003E\n"},{"CreatedByName":"Kagame","CreatedById":141304,"CreatedDateTime":"2015-11-07T20:24:31Z","Content":"\n\u003Cp\u003EWelcome to the forums! *dunks Skybar in gatorade, runs away*\u003C/p\u003E\u003Cp\u003EGood idea. I\u0027d say a degree of deadband would be normal for everything, possibly toggleable with capslock for precision mode?\u003C/p\u003E\n"},{"CreatedByName":"Skybar","CreatedById":140840,"CreatedDateTime":"2015-11-08T06:37:33Z","Content":"\n\u003Cp\u003EOnce again, glad to be here.\u003C/p\u003E\u003Cp\u003EI agree, a common degree could be set that can be toggled on and off with a hotkey or something and if a slider is introduced in the command module control panel to adjust the deviation as you require.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2015-11-08T09:43:36Z","Content":"\n\u003Cp\u003EThe algorithm that holds heading under SAS was fine-tuned over several releases to address the very thing you describe.\u003C/p\u003E\u003Cp\u003EThe algorithm that holds vectors under autopilot (prograde, normal, etc) was plonked down for 1.0. It appears to use a far less sophisticated method (similar to the old ASAS algorithm that would spam RCS and shake ships to pieces) that over-corrects wildly.\u003C/p\u003E\u003Cp\u003EI would suggest that adding a deadband would treat the a symptom, but not address the underlying cause. The way the PID-like system works needs addressing, fixing how vectors are rotated to (which is not intelligent in the slightest) and how they are held. This will improve RCS consumption as a side-effect.\u003C/p\u003E\n"},{"CreatedByName":"Skybar","CreatedById":140840,"CreatedDateTime":"2015-11-08T10:46:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TMS\u0022 data-cite=\u0022TMS\u0022\u003E\u003Cdiv\u003EThe algorithm that holds heading under SAS was fine-tuned over several releases to address the very thing you describe.\u003Cp\u003EThe algorithm that holds vectors under autopilot (prograde, normal, etc) was plonked down for 1.0. It appears to use a far less sophisticated method (similar to the old ASAS algorithm that would spam RCS and shake ships to pieces) that over-corrects wildly.\u003C/p\u003E\u003Cp\u003EI would suggest that adding a deadband would treat the a symptom, but not address the underlying cause. The way the PID-like system works needs addressing, fixing how vectors are rotated to (which is not intelligent in the slightest) and how they are held. This will improve RCS consumption as a side-effect.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFixing in what manner? I\u0027m sorry, I\u0027m not all too familiar with how the game handles vectors and holding vectors. Could you explain more about addressing the underlying cause?\u003C/p\u003E\n"}]}