{"TopicId":124611,"ForumId":55,"TopicTitle":"Abalative Coating/Paint","CreatedByName":"Sanic","CreatedById":149920,"CreatedDateTime":"2015-11-07T04:18:52Z","PageNum":1,"Articles":[{"CreatedByName":"Sanic","CreatedById":149920,"CreatedDateTime":"2015-11-07T04:18:52Z","Content":"\n\u003Cp\u003ESeeing as 1.0.5 is just around the corner, this \u003Cem\u003Emight\u003C/em\u003E not be the best time to start a discussion like this, but you never know.\u003C/p\u003E\u003Cp\u003EIn the current version of KSP, planes and spaceplanes can only go so fast before overheating, especially with the new thermal heating in 1.0. The solution for this is just to fly higher, but air is thinner there and so your engines get weaker. Hypersonic flight (speeds exeeding 1700 m/s) is nearly impossible without a heatshield in KSP. While this is realistic, I believe there should be an easier way for planes and spaceplanes to go hypersonic for at least small periods of time. In real life, all dedicated hypersonic objects have had some kind of heatshield. The X-15 had an abalative coating that allowed it to safely break mach 5.5 and stay there for a limited period of time. I would very much like to see this in KSP. Spaceplanes coated with abalatives could reenter Kerbin\u0027s atmosphere more safely and avoid overheating too much. \u003C/p\u003E\u003Cp\u003EOf couse, I believe it should be a lot thinner than a regular heatshield, maybe 20 abalator per part. I propose a tool that allows the builder to apply a coat of abalator to most parts. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-11-07T04:36:25Z","Content":"\n\u003Cp\u003EKSP spaceplane parts \u003Cem\u003Edo\u003C/em\u003E have heat shielding. How else do you think they can survive 2500 K or more in temperature? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sanic","CreatedById":149920,"CreatedDateTime":"2015-11-07T04:45:02Z","Content":"\n\u003Cp\u003EThank you for the clarification.\u003C/p\u003E\u003Cp\u003EHowever, Mk. 1 plane parts still blow up at 1200 m/s.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-07T04:47:09Z\u0022 title=\u002211/07/2015 04:47  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 7, 2015\u003C/time\u003E by Sanic\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MAFman","CreatedById":101780,"CreatedDateTime":"2015-11-15T08:50:29Z","Content":"\n\u003Cp\u003EI don\u0027t think Mk1 parts were meant to go that fast. Maybe they are built like the parts for fighters like the F16?\u003C/p\u003E\n"},{"CreatedByName":"rextable","CreatedById":119784,"CreatedDateTime":"2015-11-16T18:16:24Z","Content":"\nHow about a paintbrush-style tool that allows for the procedural addition of ceramic tiling to the surface texture of a part on a per-model-face basis? This way you\u0026#39;d be free to create any manor of gratuitous and bazaar shaped contraptions and literally paint heat-shielding onto the surfaces that need it while leaving the rest of the vehicle unfettered \u003Cbr\u003E\n\u003Cbr\u003E\n:D\n"},{"CreatedByName":"Weedlepickles","CreatedById":144922,"CreatedDateTime":"2015-11-17T16:49:03Z","Content":"\nActually a friend of mine mentioned exactly this yesterday. He couldn\u0026#39;t find any heatshielding for aircraft parts. I basically wanted to test the whole thing and built an average spaceplane that could survive the reentry without heatshields and it worked just fine.\u003Cbr\u003E\n\u003Cbr\u003E\nI would say the problem is that [B]the mechanics are unintuitive[/B]. The plane parts doesn\u0026#39;t look like they are heat shielded which makes people think they are unshielded.\u003Cbr\u003E\n\u003Cbr\u003E\nI like the idea with ablator values on the spaceplane parts. Maybe it would be possible to give spaceplane parts with ablators a dark underside or something as to indicate the heat shield. However not having to care for ablators on spaceplane parts is really nice too...\n"},{"CreatedByName":"Sanic","CreatedById":149920,"CreatedDateTime":"2015-11-18T18:09:57Z","Content":"\n[quote name=\u0027rextable\u0027]How about a paintbrush-style tool that allows for the procedural addition of ceramic tiling to the surface texture of a part on a per-model-face basis? This way you\u0026#39;d be free to create any manor of gratuitous and bazaar shaped contraptions and literally paint heat-shielding onto the surfaces that need it while leaving the rest of the vehicle unfettered \u003Cbr\u003E\n\u003Cbr\u003E\n:D[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nExactly what I was thinking :D\n"}]}