{"TopicId":125652,"ForumId":55,"TopicTitle":"multiplayer/COOP","CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2015-11-16T19:20:16Z","PageNum":1,"Articles":[{"CreatedByName":"Dedjal","CreatedById":57220,"CreatedDateTime":"2015-11-16T19:20:16Z","Content":"\nDo anyone know more about this? I remember that squad was working on it, but can not remember reading anything else about it.\u003Cbr\u003E\n\u003Cbr\u003E\nIs it still coming? Is it being worked on?\u003Cbr\u003E\n\u003Cbr\u003E\nI am basicly just waiting for an official MP mode so that I can build with friends instead of doing it all alone\n"},{"CreatedByName":"ShawnPhillips","CreatedById":111721,"CreatedDateTime":"2015-11-16T19:24:52Z","Content":"\nI have not heard any official words from Squad since they said that they wanted to add multiplayer. I predict Multiplayer will be the next big thing for the game after the Unity5 64bit update coming with 1.1.\u003Cbr\u003E\nMaybe in 1.2 or 1.3 we will finally get Multiplayer in some form.\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-11-16T19:25:46Z","Content":"\nI suppose any plan for that have been delayed by the console(s) version(s)\u003Cbr\u003E\n\u003Cbr\u003E\nSad we don\u0026#39;t have any roadmap\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-11-16T19:33:25Z","Content":"\nMultiplayer is still in development, but will not come before the Unity5 upgrade and UI overhaul.\u003Cbr\u003E\n\u003Cbr\u003E\nThe console versions are outsourced, so they do not impact development on the core Linux/Mac/Windows version.\u003Cbr\u003E\n\u003Cbr\u003E\nAs always, keep an eye on the Tuesday devnotes for more information.\u003Cbr\u003E\n\u003Cbr\u003E\nMoving to Development Discussion.\n"},{"CreatedByName":"dziki0022","CreatedById":153698,"CreatedDateTime":"2015-11-17T10:26:21Z","Content":"\nMulti is the best thing it will be added to this game. I all ready try darkmultiplayer mod with friends and its very good. Only problem is with parts after you retrive fly some parts get clone and stey on planet. Another anoyng thing is share of crew specially at start where you just got 2 pilots so max 2 person can fly at once. I hope devs will give us nice multi with separate launchpads and ability to coop\n"},{"CreatedByName":"OmniscientQ","CreatedById":151274,"CreatedDateTime":"2015-11-19T05:06:27Z","Content":"\n[quote name=\u0027dziki0022\u0027]Another anoyng thing is share of crew specially at start where you just got 2 pilots so max 2 person can fly at once. I hope devs will give us nice multi with separate launchpads and ability to coop[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nUnless they changed something in the \u0022silent\u0022 patch the other day, you don\u0026#39;t need a pilot-class Kerbal to launch anything.\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;d be okay with them adding a second or third launchpad to the KSC, but there\u0026#39;s absolutely no reason for a second space center. I\u0026#39;m not sure how anyone could have played this game and imagined a competitive Player-vs-Player mode of any kind, whether it\u0026#39;s a race to the stars or shooting rockets at each others space center. Kerbal Space Program has always been about the Player vs Gravity. If and when multiplayer is added to the game, it\u0026#39;ll wind up being purely cooperative (outside of mods, of course). I welcome the idea. For one thing, there\u0026#39;s all kinds of missions I\u0026#39;ve dreamed up but been unable to carry out due to engine limitations (mostly regarding atmospheric flight and the on-rails destruction radius). Having a second player to run the other craft would be perfect. And when the mission inevitably goes wrong, then my buddy and I get to watch Jebediah die in a huge fireball together.\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;m on the fence about how much interaction needs to be programmed into the game for the planning stages. The VAB, SPH, and administrative buildings can all be operated independently be each player. I imagine that for most people, the details of a mission will be planned out via Skype or IRC or whatever before KSP is even launched. The only thing that is needed is to transmit the .craft files to each player, and a means of deciding who controls what if you\u0026#39;re launching a single vessel together.\u003Cbr\u003E\n\u003Cbr\u003E\nAs an added bonus, multiplayer would necessarily bring with it a server/client model that would let me put more than one computer to use, even if I\u0026#39;m playing alone. I\u0026#39;d love to be able to hand off to a dedicated server some of the extreme amounts of math that currently make my computer cry if I try to launch a vessel with more than 100 parts in it.\n"}]}