{"TopicId":126389,"ForumId":55,"TopicTitle":"unlocked fuel/lox mix in fuel/lox tanks","CreatedByName":"Kerveball","CreatedById":145179,"CreatedDateTime":"2015-11-24T23:33:20Z","PageNum":1,"Articles":[{"CreatedByName":"Kerveball","CreatedById":145179,"CreatedDateTime":"2015-11-24T23:33:20Z","Content":"\nApologies if this is an old concept - I checked the \u0022current ideas\u0022 post and didn\u0026#39;t see it.\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;ve been doing a bit with nuclear engine transfer stages, and it seems to me that if I have a fuel tank and have removed all of the lox from it for use with a nuclear engine, then I should either be able to reduce the weight/size of the tank because that storage is unused or I should be able to fill it with extra liquid fuel where the lox would normally be stored. Alternatively I would see extra rocket parts being available with pure fuel capacity rather than mixed lifu/lox capacity (apart from the aeroplane parts).\u003Cbr\u003E\n\u003Cbr\u003E\nI propose an interface option where fuel tanks normally have the two fill bars but can have a checkbox option to replace lox with extra fuel or vice versa. This would be of particular utility for space station tanks allocated as top-off for interplanetary craft.\u003Cbr\u003E\n\u003Cbr\u003E\nThoughts?\n"},{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2015-11-25T01:20:43Z","Content":"\nThey have a mod for that \u003Cbr\u003E\n[URL=\u0022http://forum.kerbalspaceprogram.com/threads/64118-1-0-5-Real-Fuels-v10-8-1-Nov-19\u0022]http://forum.kerbalspaceprogram.com/threads/64118-1-0-5-Real-Fuels-v10-8-1-Nov-19[/URL]\n"},{"CreatedByName":"Kerveball","CreatedById":145179,"CreatedDateTime":"2015-11-25T06:27:33Z","Content":"\nNice! That addresses the problem and then some. I guess I was originally looking for a simple mechanic which would fit within the vanilla LiFu/Ox/RCS/Xe fuel options. \u003Cbr\u003E\n\u003Cbr\u003E\nThanks for the timely advice.\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-11-25T13:10:05Z","Content":"\nThere are some mods for that, too:\u003Cbr\u003E\n\u003Cbr\u003E\n[URL=\u0022http://forum.kerbalspaceprogram.com/threads/64117\u0022]Modular Fuel Tanks[/URL]\u003Cbr\u003E\n[URL=\u0022http://forum.kerbalspaceprogram.com/threads/121321\u0022]Stock Fuel Switch[/URL]\u003Cbr\u003E\n\u003Cbr\u003E\nThat said, this is some functionality that stock could really use. All the adapter tank parts are LF\u002BO, which means unused capacity when using them on a jet or nuclear rocket. There is no 2.5m LF tank, which would be incredibly useful for nuclear rockets. Some sort of fuel switching would mean we can have tanks in all the shapes and sizes for any sort of propellant, which would be a very good thing to my mind.\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-25T16:06:28Z","Content":"\nNot just the shapes and sizes but the designs would be less dependent on fuel. There is no Mk1 LFO tank, unless you count the rocket Size 1 tanks and those look awkward paired with the Mk1 series. This kills 2 birds with one stone in allowing all adapters and sizes to be either fuel or LFO and allowing you to make yout craft look the way you want it.\u003Cbr\u003E\n\u003Cbr\u003E\nAlso, DO NOT install Stock Fuel Switch or use any FSFuelSwitch ability. It is incredibly bugged and can ruin missions. InterstellarFuelSwitch is equally bugged.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-25T17:31:42Z\u0022 title=\u002211/25/2015 05:31  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 25, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"}]}