{"TopicId":129354,"ForumId":55,"TopicTitle":"Multiple career endgame ideas","CreatedByName":"delta144","CreatedById":154081,"CreatedDateTime":"2016-01-06T00:40:39Z","PageNum":1,"Articles":[{"CreatedByName":"delta144","CreatedById":154081,"CreatedDateTime":"2016-01-06T00:40:39Z","Content":"\n\u003Cp\u003E\n\u003Cu\u003EDisclaimer\u003C/u\u003E: I am assuming there are mods for some of these ideas (I don\u0027t use mods just because i\u0027m lazy, although I think modding improves games), I think it would be good to see them in game as part of the game in career mode to improve the career environment and story line.\n\u003C/p\u003E\n\u003Cp\u003E\nMy ideas revolve around trying to make career mode more enjoyable rather than a grind and to improve the inclusion of engineers, scientist and pilots to some extent:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nScientist could be used to map vectors to planets that have already been orbited by a scientist.\n\u003Cul\u003E\u003Cli\u003E\nthe higher level the scientist the quicker he/she can plan a trajectory to that planet.\n\u003C/li\u003E\n\u003Cli\u003E\nthe higher level the scientist the more efficient and accurate the trajectory will be.\n\u003C/li\u003E\n\u003Cli\u003E\nif the scientist is only given a small amount of time to plan the trajectory it will come with potential errors even though it looks good on the map.\n\u003C/li\u003E\n\u003Cli\u003E\nBeing KSP there will always be a small chance for error in the scientist calculations so it may end in a fireball. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/li\u003E\n\u003Cli\u003E\nThe base needs to be upgraded for trajectory planning with consecutive upgrades adding more slots for scientist.\n\u003C/li\u003E\n\u003Cli\u003E\nThe Kerbal base will only get so far, an expeditionary base on Minmus will allow for trajectories onto neighbouring planets in the system.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nExpeditionary bases can be built by dropping off certain supplies to a targeted location.\n\u003Cul\u003E\u003Cli\u003E\nBases can be upgraded with things like:\n\u003Cul\u003E\u003Cli\u003E\nradar array for trajectory plots\n\u003C/li\u003E\n\u003Cli\u003E\nlabs from different private enterprises for research into upgrades that can only be unlocked this way. generates a small amount of PR whilst researching even after the items has been unlocked.\n\u003C/li\u003E\n\u003Cli\u003E\nrover pod for rover construction (it will need to be supplied with materials to build rovers)\n\u003C/li\u003E\n\u003Cli\u003E\nrover docking for resupply\n\u003C/li\u003E\n\u003Cli\u003E\na taxi craft to ferry tourist to and from a nearby orbiting space station (needs to have fuel)\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nbases could be preplanned in one location by the devs, or it could be where the player wants depending on how easy it is to code I guess?\n\u003C/li\u003E\n\u003Cli\u003E\nbase location planning could be researched by engineers or scientist on Kerbal from the upgraded mission command?\n\u003C/li\u003E\n\u003Cli\u003E\nif the base is not supplied appropriately then safety may fall and accident may happen in the taxis, rover construction, docking or trajectory calcs.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nAutomation for endgame:\n\u003Cul\u003E\u003Cli\u003E\nI find the constant launching or fuel/tourist ships and modules gets tedious, that is why i think there should be a base module addon on Kerbal that can be upgraded to run supply ships\n\u003Cul\u003E\u003Cli\u003E\nit could be manned with engineers and must have trajectory support from the scientist. the more supply ships the more the scientist will have to spend on providing support to the supply module and this increases trajectory calculations for your other ships.\n\u003C/li\u003E\n\u003Cli\u003E\nif there is not enough support from the science trajectory division then this increases the chances of accidental fireballs and accidents.\n\u003C/li\u003E\n\u003Cli\u003E\nsupply ships would come pre designed and could launch, dock, resupply and re-enter the atmosphere and anomalously.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003Cli\u003E\nPilots with a high enough level can be used to run autonomous supply lines between planets as long as that planet has been explored by an orbit with a pilot or scientist.\n\u003Cul\u003E\u003Cli\u003E\nthe ship can be custom built and also needs scientist trajectory support.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nCompetition (a very far fetched idea):\n\u003Cul\u003E\u003Cli\u003E\nOther space agencies also start at the same time as you so it becomes a race to explore and research.\n\u003C/li\u003E\n\u003Cli\u003E\nother agencies may get ahead of you in research so you may want to try corporate espionage strategy which is very risky and will reduce your PR by a considerable amount\n\u003C/li\u003E\n\u003Cli\u003E\nOther agencies may try corporate espionage on you to get your research so you can implement a secure network strategy to try safeguard your valuable research but it comes at a hefty price.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThese ideas try to keep exploration an unknown with manual input whilst it reduces the repetition of supply. The expeditionary base would also make it possible to put rovers on planets without having to put them atop of a rocket and hope for the best.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLastly, weather balloons for rovers; I think they would be great for having to get X data at X altitude at the north/south pole of the planet with atmosphere.\n\u003C/p\u003E\n"}]}