{"TopicId":130799,"ForumId":55,"TopicTitle":"Event and telemetry logging for statistical analysis","CreatedByName":"yokken","CreatedById":154148,"CreatedDateTime":"2016-01-26T23:54:25Z","PageNum":1,"Articles":[{"CreatedByName":"yokken","CreatedById":154148,"CreatedDateTime":"2016-01-26T23:54:25Z","Content":"\n\u003Cp\u003E\nHi all,\n\u003C/p\u003E\n\u003Cp\u003E\nI did some searching around and couldn\u0027t find anything related to this. I work for a Fortune 500 doing data analytics day-to-day with an incredible tool called \u003Ca href=\u0022https://www.splunk.com\u0022 rel=\u0022external nofollow\u0022\u003ESplunk\u003C/a\u003E, which takes in logs and application data and can parse and manipulate it with statistical engines, and comes with a bunch of pretty charts and graphs to visualize the data. I\u0027m wondering if there is any way to add the ability to log telemetry data within KSP, as well as other craft events, to a file (or set of files). Ideally this would contain things like time (down to the millisecond), the craft ID or name, type of event that is happening, and other context about the event, such as current body, lat/long, surface/orbit/target velocity, temperatures, effective engine Isp, current thrust force, etc. If this data could be recorded, it could be analyzed with a tool like Splunk to provide common flight paths, common velocities for a given altitude on a given body, average burn times, distance traveled by a given craft, time spent on EVA for a given Kerbal, number of parts exploded, and so on and so forth. I would love to track my KSP statistics, and it would be fairly easy to expand to other players if I had a way to get data from them. You could honestly turn this into a full-blown online statistics portal for KSP, but I\u0027d love to do the analysis myself as well. KSP devs: feel free to PM me if you want help getting this going \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI realize the granularity of telemetry would have to be defined, as requesting the velocity of a craft in-game 100 times per second is probably a little too often and will likely negatively impact performance. You could start the polling at 2-5 times per second and increase it, measuring performance each time. One benefit of logging is that it really helps troubleshoot errors in the application later... I\u0027ve seen it many times!\n\u003C/p\u003E\n\u003Cp\u003E\nBy the way, Splunk is free - Enterprise license for 30 or 60 days (can\u0027t remember) then limited to 500MB/day intake and no alerts (and other Enterprise stuff). Check it out!\n\u003C/p\u003E\n\u003Cp\u003E\nI would really love to see this added to the game. Feel free to let me know your thoughts!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-27T00:54:56Z\u0022 title=\u002201/27/2016 12:54  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 27, 2016\u003C/time\u003E by yokken\u003C/strong\u003E\n\u003Cbr\u003Etitle change\n\u003C/span\u003E\n"}]}