{"TopicId":131280,"ForumId":55,"TopicTitle":"Display/Science window!","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-02-02T23:37:38Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-02-02T23:37:38Z","Content":"\n\u003Cp\u003E\nWe need a window like the resource window (That can also be permanently left open) that will show all active displays from science equipment. Fairly simple. We can turn them on and transmit but not see them without clicking on them or opening a bunch of annoying windows with Superkey... The display should also have a button next to it to activate the button to start the experiment. Just a little box next to the display information. Maybe even a toggle to turn on the display. It have a slot for every display capable item and maybe individual science piece. Also potentially to activate the other things on the science items like experiments. Call it the science window!\n\u003C/p\u003E\n\u003Cp\u003E\nThis could also be used to save alot of keybindings for satelites and stuff if people use them. You could also have a similar window for satelites from the map window and or from the radar map from the space center. then you can do stuff with satelites remotely.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-02T23:46:27Z\u0022 title=\u002202/02/2016 11:46  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 2, 2016\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-02-03T03:51:27Z","Content":"\n\u003Cp\u003E\nwhile this sounds simple in theory, i have a feeling the amount of code needed to implement this is not. Add to that the time to adjust ui, any bugs that will come up plus any other issues. \n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-02-03T04:09:35Z","Content":"\n\u003Cp\u003E\nI agree. In the meantime, try...\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/69538-104-sciencealert-189-experiment-availability-feedback-july-13/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-02-03T04:26:15Z","Content":"\n\u003Cp\u003E\nMaking something display something and adding buttons is generally excruciatingly simple in programming. All you do is reference a variable and do the same stuff that is available with objects in all languages.  Buttons are not the hardest things in the world. It\u0027s literally the same coding for the already existing object in game. But in a different location. It\u0027s a very simple thing to add. That is why I suggested it.\n\u003C/p\u003E\n\u003Cp\u003E\nThere is no complicated amount of coding to add that sort of thing. Even if they decided to do it the hard way and do low level programming for the fun of it it\u0027s not that hard. They should know way beyond that to even begin thinking of writing a piece of software let alone sell it. And any language or tool in existance will have easy ways to make these things. It\u0027s probably something they can grab in a few minutes from the tools they use and implement.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-03T04:31:00Z\u0022 title=\u002202/03/2016 04:31  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 3, 2016\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Blaarkies","CreatedById":153700,"CreatedDateTime":"2016-02-03T04:48:59Z","Content":"\n\u003Cp\u003E\nLast time i checked, \u0022ScienceAlert\u0022 killed my M700 Survey Scanners...so no prospecting for mining while you have that(you could always uninstall it for the half hour you need to do the scan and continue your search for gold...i mean ore)\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t want to be \u0022that\u0022 guy, who claims all alternative are better...but this works for me\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/95531-10x-forsciencecontinued-v110-07082015/\u0022\u003EForScience! - by SpaceTiger\u003C/a\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cfont color=\u0022#3c6994\u0022\u003E\u003Cu\u003EI\u003C/u\u003E\u003C/font\u003EImagine auto science...whenever there is science obtainable on your craft, this mod will instantly collect that science for you (even at 100x time warp!). At default, the stock science transmission window will appear for you to decide. But the ingame settings of this mod allows you to change this behaviour...automatically put all science into the command capsule(only if kerbals are aboard), automaticaly reset Mystery Goo, Materials Bay experiment and also put that science into the capsule. So it does only the things that the player can do at that moment, but with less grind.\n\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-02-06T01:26:10Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/133381-arugela/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133381\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133381-arugela/\u0022\u003E@Arugela\u003C/a\u003E Sorry. It is not that simple. What you suggest requires a UI overhaul and god only knows what other back end stuff. If this is as \u0022simple\u0022 as you would try to have us think, there is nothing stopping YOU @arugela from coding it yourself.\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-02-06T03:39:36Z","Content":"\n\u003Cp\u003E\nYou don\u0027t need \u0022backend work\u0022 or a \u0022UI overhall\u0022 to add a display in the UI. That is completely insane and you have no idea what that or anything else in programming means. Don\u0027t bother people if you are just using your imagination. Especially not correcting people like that. You add one and reference a variable that is already exist. Learn some basic programming. People make those all the time in mods. They do make those but I have no interest whatsoever in making a mod. And It IS insanely simple to make.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t be argumentative with people about stuff you don\u0027t know the first thing about. It\u0027s very childish and annoying and counterproductive to a discussion.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd yes, there are potentially things stopping me from doing so. One of which is my lack of desire. I don\u0027t make mods for games! Nor will I.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd when you argue with people you need to first understand what you yourself understand. If you don\u0027t know anything don\u0027t tell people they are incorrect. Especially not this forcefully. Learn or ask about it instead. A lot of people in games like this know how to program. It\u0027s normal. it does not mean they feel like putting the work into a mod. Even if it\u0027s 5 lines of code. Some people don\u0027t like to do stuff like that for stuff they paid for. Or just don\u0027t in general. This game sadly and badly needs fundamental stuff done to it. I\u0027m not in the mood to do the programming for people I spent money for a service or product from(Or even if It was free.). Anything beyond that is not your business and you should not expect an answer too. Nor should you be asking anyone about those sorts of things!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-06T04:11:27Z\u0022 title=\u002202/06/2016 04:11  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 6, 2016\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2016-02-06T05:11:50Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/133381-arugela/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022133381\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/133381-arugela/\u0022\u003E@Arugela\u003C/a\u003E At this time, doing my level best to remain civil, I dare to say you lack formal training in coding. Why or how can I say this? Simple. Adding a display requires user interface work to alter the current user interface to display the data you request. Furthermore if you had formal coding education you would know that the addition or alteration of code can have unexpected issues with other code that may or may not be seen at first or even be easily found. You would also know that such changes would require significant development time that is to be blunt required elsewhere. \n\u003C/p\u003E\n\u003Cp\u003E\nI also say it again, if you DO by some chance have the skill, tools and education to back up your claims that this is \u0022simple\u0022 you are by all allowed to modify the game by making said alteration yourself. I formally withdrawal myself from further debate on this with you and I also formally wish you well. \n\u003C/p\u003E\n"}]}