{"TopicId":132706,"ForumId":55,"TopicTitle":"Space Station Stability","CreatedByName":"externix","CreatedById":159111,"CreatedDateTime":"2016-02-22T11:31:44Z","PageNum":1,"Articles":[{"CreatedByName":"externix","CreatedById":159111,"CreatedDateTime":"2016-02-22T11:31:44Z","Content":"\n\u003Cp\u003E\nHi guys! Annoying thing happens on my try to build space station. It was pretty stable before I switched to Space Center and back. Any recomendations or is it bug?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.youtube.com/watch?v=NU8e8hr_P2E\u0022 rel=\u0022external nofollow\u0022\u003EYouTube Video\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I am using 1600x900 resolution. So, you can see a bug at Tracking Station UI on video.\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2016-02-22T14:43:34Z","Content":"\n\u003Cp\u003E\nHard to say exactly from the video but it\u0027s either a somewhat common physics bug based on attaching too many extendable things like solar panels onto a thin, long, light structure or part clipping. (I\u0027ve seen a couple videos recently of the same thing happening to others and it kept coming back to having lots of solar panels arrayed around girders.)\n\u003C/p\u003E\n\u003Cp\u003E\nMy first station did the same thing whenever I got within physics range of it with another ship, it would just tear itself apart and explode, came down to some batteries that were clipped into a structural girder.\n\u003C/p\u003E\n\u003Cp\u003E\nYour only hope is to possibly do some file editing and change the state of all the panels to undeployed, or maybe to remove it with hyperedit and redesign it, that\u0027s all I can really suggest. Hopefully someone will come along with a better suggestion on how to salvage the craft.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Here\u0027s a link to another thread about the same problem. \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/132176-solar-panels-wobbling-ship-apart/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-22T14:49:24Z\u0022 title=\u002202/22/2016 02:49  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 22, 2016\u003C/time\u003E by Rocket In My Pocket\u003C/strong\u003E\n\u003Cbr\u003EAdded link to similar thread.\n\u003C/span\u003E\n"}]}