{"TopicId":133216,"ForumId":55,"TopicTitle":"Part \u0022casting\u0022","CreatedByName":"Somtaaw","CreatedById":109192,"CreatedDateTime":"2016-02-29T22:28:33Z","PageNum":1,"Articles":[{"CreatedByName":"Somtaaw","CreatedById":109192,"CreatedDateTime":"2016-02-29T22:28:33Z","Content":"\n\u003Cp\u003E\nThe only thing I\u0027d really really like, is for parts that properly \u0027flow\u0027 together, become cast as one continuous part, outside of the assembly buildings. Possibly as something related to saving as a subassembly.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUseful everywhere from creating super-large rockets, space stations, space planes with ultra large wings, and for our militant modders those ultra-dense armors suddenly turning from dozens of parts into 1 part.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOr hell... once you get a design you really really like, wouldn\u0027t it be awesome to be able to \u0027save\u0027 it, and while you wouldn\u0027t be able to adjust it in the future, it now becomes 1 part for the entire craft?\n\u003C/p\u003E\n"},{"CreatedByName":"YellowApple","CreatedById":108106,"CreatedDateTime":"2016-02-29T22:46:27Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/96670-105-ubiozur-welding-ltd-continued-222-2015-11-11/\u0022\u003EThere\u0027s a mod for this\u003C/a\u003E, but it appears there are some significant limitations (namely, when it comes to multiple RCS ports / solar panels / landing legs / crew hatches / etc. in the result).\n\u003C/p\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-02-29T23:37:43Z","Content":"\n\u003Cp\u003E\nThis has been a sought after feature of many users since the dawn of time, for both rocket stability (less joints = less wobble), and for part-count reduction (less parts = less joints = less physics = more FPS).\n\u003C/p\u003E\n\u003Cp\u003E\nUbioZor welding is one option; it does have its limitations however.  The mod that I\u0027m developing is another option along the lines of part-count reduction (though it doesn\u0027t do any run-time welding or joining of parts; the parts are already \u0027pre-welded\u0027 as it were).  See my sig for link.\n\u003C/p\u003E\n\u003Cp\u003E\nI would -love- to have run-time welding of vessels and sub-assemblies without the limitations of UbioZor, however it is the nature (and limitations) of KSP that it expects a group of distinct parts with their own functions; many parts cannot be combined with welding due to limitations in the stock code.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyhow; I\u0027ll second the need / want for a stock (or other low-level/clean implementation) of run-time part welding (not needing to create new \u0027welded\u0027 parts, but merely combining parts on an already existing vessel).  Would go a long way towards cleaning up the performance problems that are most apparent with large or complex craft.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}