{"TopicId":133360,"ForumId":55,"TopicTitle":"Suggestion - Career mode overhaul","CreatedByName":"ArgenTum","CreatedById":136611,"CreatedDateTime":"2016-03-02T19:36:20Z","PageNum":1,"Articles":[{"CreatedByName":"ArgenTum","CreatedById":136611,"CreatedDateTime":"2016-03-02T19:36:20Z","Content":"\n\u003Cp\u003E\nFirst I\u0027d like to point out I did look at posting in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/126900-career-fixes-discussion/\u0026amp;page=1\u0022\u003Ethis thread\u003C/a\u003E, but since my suggestion is a sum of several suggestions, where I feel none would be that interesting without the others, I choose to start a new thread. Feel free to move/merge this if this was wrong. I would also like to point out that I have been thinking of posting this for about a year, so these ideas are not something I threw together hastily.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, I do feel career mode in general is fun, but I miss something in career mode, and that is a Strategy layer. That\u0027s why I have some suggestions to make it feel like you are more in charge of a space program. Some of these things have been suggested before, I know, but again, my point is the sum of all these suggestions, not only one or two of them.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, in order to make you feel like more of a manager of a space program I suggest the following (they are in no particular order, with for example point 1 being dependent on point 2 etc).\n\u003C/p\u003E\n\u003Cp\u003E\n1. Have a weekly economics summary, where it is shown how many launches you\u0027ve made, the cost of rockets/planes launched, the income from recovery, the income from contract advances, the income from contracts completed, the weekly income from NAKA (see below), the weekly salary for all kerbonauts, the weekly pension fund for MIA/KIA kerbonauts etc. This summary would probably have to be tweak-able, so it doesn\u0027t show up every week of your year long journey to Jool, perhaps by progressing as the game progresses from weekly to monthly to yearly summaries. \n\u003C/p\u003E\n\u003Cp\u003E\n2. Have overarching missions from NAKA (National Aeronauts and Kerbonauts Administration) where you are left with a choice of 1 of 2 to begin with - Explore space or -Explore Kerbin. (Later examples would be -Kerbins moons or -Inner planets, and -Space stations or -Outer planets) You would get (like a contract) some roots in advance and then some (diminishing) roots every week until the overarching mission is completed. You would also loose an increasing amount of reputation each week until you\u0027ve completed the mission (so you get an incentive to hurry up, but it should be so small that you can ignore it for a while if you like. Perhaps starting  at -1 the first week and like -5/week after 10 weeks or whatever balance feels right.) You should be able to change mission should you like, but would then get a reputation hit (-100 or whatever) and loose out on the roots advancement. The point would be to make ordinary contracts \u0022side quests\u0022 and these mission \u0022main quests\u0022. Completing a main quest would give you quite a lot of reputation (but almost no more roots, since for example NASAs missions hardly gives any roots when completed, but a massive boost in reputation.)\n\u003C/p\u003E\n\u003Cp\u003E\n3. Only 1 allowed launch per Kerbin day (there already is the \u0022warp to next morning\u0022, why not use it for something useful). Maybe airplanes could be launched 2 times a day, if there is a way to prevent \u0022cheating\u0022, by launching rockets from the runway (for example the runway being destroyed very easily by rocket engines). This way, a maximum of 7 rocket launches in a week (and perhaps up to 14 plane launches), which is manageable for the summary in point 1. Perhaps this limitation should be upgradeable to 2 or 3 launches later in the game. Would also give a better momentum of the game in conjunction with the regular contracts, especially if their deadlines would be shorter. (And it is after all a bit unrealistic with unlimited launches each day, while the construction time mod feels a bit too limiting. I want to launch my rocket when I\u0027ve designed it, not wait for a \u0022random\u0022 period of time. Warp to next morning is fine I think, and quite intuitive in a gamey sort of way.)\n\u003C/p\u003E\n\u003Cp\u003E\n4. An integrated wiki/self-updating encyclopedia, as proposed by me before \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/98052-wiki-integrated-into-ksp-career-mode/#comment-1685496\u0022\u003Ehere\u003C/a\u003E where suddenly the whole point of career mode would be to explore the entire Kerbal universe, filling in all the blanks in the encyclopedia/wiki. This could work well in conjuncture with point 2 in acting like an overarching \u0022main quest\u0022, something to go back to when you don\u0027t know what more you want to do, but at the same time not something you have to do, being free to explore/play as you want.\n\u003C/p\u003E\n\u003Cp\u003E\n5. Exponential cost for the tech tree, where you simply can\u0027t unlock everything without leaving Kerbin SOI (unless, perhaps, you chose to focus on -Exploring Kerbin and -Space stations when asked by NAKA, and thereby unlocking better bonuses for the science lab enabling you to get much, much more science. So there should be a choice) so you really would have to \u0022struggle\u0022 to get to Eeloo to gather the millions of science required to unlock those last big fuel tanks (and then the next mission to Eeloo would become easier. The point being that the tech tree would be balanced so that you are always challenged to find that next science to unlock that next step, but would also be so abundant on worlds farther from Kerbin that it never would be considered grindy; one hard, long mission would be enough to unlock the next tech, you should not have to do 332 kinds of science on Kerbin to be able to unlock it. Unless you chose to, of course.)\n\u003C/p\u003E\n\u003Cp\u003E\n6. Delta-vee readout, coupled to science (based on/functioning like KER). Haven\u0027t checked the atmosphere disposition in lower and upper Kerbin atmosphere with the Atmospheric Fluid Spectro-Variometer? Then the delta-vee (KER) readout can\u0027t show you how the engines are expected to perform at different altitudes. Haven\u0027t landed a probe on Mun and done a gravity scan? Then delta-vee can\u0027t show you expected TWR on Mun. Etc. That would really (in conjunction with point 4 and 2) encourage exploring and simply be fun in my opinion. Talk about mission planning, where you have to send out \u0022scouts\u0022 to learn more of the planet/moon before actually doing your \u0022real\u0022 mission. It also gives unmanned exploration with science-gathering by radio a bigger place in the game by paving the way for the more complex but more rewarding manned missions. Of course, such a system would have to have very clear tooltips telling the player what experiment they need to run to unlock the requested feature in the delta-vee.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat a long post this turned out to be. Sorry. Well, the point of these suggestions would be to change focus in career: the contracts would no longer be the point of career mode, the contracts would be a stepping stone, a helpful tool to explore the system, something which at the moment aren\u0027t encouraged at all. (In sandbox it shouldn\u0027t be encouraged, but in career mode, I really feel it should. As an overarching goal.) In my opinion, when you have done all the experiments in all the biomes, completing the in-game wiki/encyclopaedia in point 4, you would actually win the game (with an option to keep playing of course).\n\u003C/p\u003E\n\u003Cp\u003E\nIt feels like I had a couple of more points to suggest, but I can\u0027t remember them right now. Well, if anyone is interested in these ideas, a developer or a modmaker, I can expand my ideas more if you want. Otherwise, thank you for reading. (I do realize the chance of these ideas making it into stock or a mod is slim to none, but if they do, I would play the hell out of it).\n\u003C/p\u003E\n\u003Ctable\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\n\u003Cdiv\u003E\n\u003Cdiv\u003E\n \n\u003C/div\u003E\n\u003C/div\u003E\n\u003C/td\u003E\n\u003Ctd\u003E\n \n\u003C/td\u003E\n\u003C/tr\u003E\u003C/tbody\u003E\u003C/table\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-03-02T21:27:58Z","Content":"\n\u003Cp\u003E\nAnytime someone wants to make the game more difficult I have to stick with you can simply turn science down to 10%. Difficult for me would be easy for select others.  What I consider easy is impossible for most. Imagine trying to do a joul 5 with tier 4 tech or rescuing a kerbal for 200 funds\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-02T21:29:05Z\u0022 title=\u002203/02/2016 09:29  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 2, 2016\u003C/time\u003E by Nich\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-03-03T01:11:25Z","Content":"\n\u003Cp\u003E\nTime should matter, I like #3. Honestly, any time you leave the VAB it could warp to morning. Any time you launch from SPH, it warps a couple hours.\n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-03-03T02:07:31Z","Content":"\n\u003Cp\u003E\nAs far as rockets destroying the runway, this should only happen with a vertical launch.  Launching horizontally, like a spaceplane, should be allowed.  Simply making the runway be very sensitive to heating should work.\n\u003C/p\u003E\n\u003Cp\u003E\nAtmospheric Fluid Spectro-Variometer isn\u0027t available until relatively late, so I\u0027d substitute only requiring the barometer.  Variometer scan could still be required before crew are allowed to EVA on other worlds.\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise, these look like good suggestions, though I\u0027d also add in a more realistic tech tree progression.  Basic aircraft and unmanned rockets first, then crewed missions later.  A lot of the science parts would have to be moved a bit earlier in the tree as well in order to support the idea of requiring those scans in order to be able to plan out the mission.\n\u003C/p\u003E\n"},{"CreatedByName":"Blaarkies","CreatedById":153700,"CreatedDateTime":"2016-03-03T06:00:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222439126\u0022 data-ipsquote-contentid=\u0022133360\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456970851\u0022 data-ipsquote-userid=\u0022157578\u0022 data-ipsquote-username=\u0022Hodari\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Hodari said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs far as rockets destroying the runway, this should only happen with a vertical launch.  Launching horizontally, like a spaceplane, should be allowed.  Simply making the runway be very sensitive to heating should work.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut how would you test VTOLs? Some VTOLs designed for Duna uses rocket engines to lift-off vertically\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-03-03T07:49:05Z","Content":"\n\u003Cp\u003E\n#5 I don\u0027t like, as the whole tech tree in RL fits inside a small number of years, and much is in fact concurrent. Rockets of many sizes, solar panels, RTGs, and even NTRs... all late 1950s, early 1960s tech.\n\u003C/p\u003E\n"},{"CreatedByName":"ArgenTum","CreatedById":136611,"CreatedDateTime":"2016-03-03T14:32:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222438817\u0022 data-ipsquote-contentid=\u0022133360\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456954078\u0022 data-ipsquote-userid=\u0022145678\u0022 data-ipsquote-username=\u0022Nich\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Nich said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnytime someone wants to make the game more difficult I have to stick with you can simply turn science down to 10%. Difficult for me would be easy for select others.  What I consider easy is impossible for most. Imagine trying to do a joul 5 with tier 4 tech or rescuing a kerbal for 200 funds\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn my opinion, my suggestions wouldn\u0027t make the game more difficult. Actually, an ingame wiki, a delta-v readout while constructing and an economic overview would if anything make things easier. Slightly more complex perhaps, but not more difficult. And I do like playing career on hard, with no reverts or quicksave, but to me, setting science to 10% doesn\u0027t make the more difficult (depending on how you define difficult), only more grindy.\n\u003C/p\u003E\n\u003Cp\u003E\nThats why I like my point #5, because you can chose to make easier missions multiple times, or a harder mission once, and end up at the same place in the tech tree (well, you can actually do that already in the game).\n\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-03-03T15:56:27Z","Content":"\n\u003Cp\u003E\nExponential costs limits players tech when they leave the SOI.  Most players do not leave the SOI until they have 90% or all of the tech unlocked even though you can do a Duna mission with 1.25m parts and a 30 parts limit.  So you are forced to grind in your model as well if you want 2.5m parts for a Duna mission.  10% science only makes it grindy if you want to do Duna like your used to.  If you limit yourself to 2 kerbin missions, 1 Mun mission and 1 Minimus mission.  Then upgrade VAB to level 2 you will have enough tech to send a 1 way probe to every body in the game.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-03-03T16:00:48Z","Content":"\n\u003Cp\u003E\nAny of the science or funds limits (I\u0027ve player on Hard before) are just grind mode, IMO. The tech tree paradigm is absurd, you don\u0027t do science to learn how to make rockets, to make rockets to do science, the entire career paradigm is bass ackwards.\n\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-03-04T20:32:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222439783\u0022 data-ipsquote-contentid=\u0022133360\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457020848\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/3/2016 at 11:00 AM, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAny of the science or funds limits (I\u0027ve player on Hard before) are just grind mode, IMO. The tech tree paradigm is absurd, you don\u0027t do science to learn how to make rockets, to make rockets to do science, the entire career paradigm is bass ackwards.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe problem is that it is really hard to balance the contracts.  Hard can be hard BUT if you take the time to build optimized rockets your payouts on each contract are still well over 200-500%.  Most of my rockets are 2000-5000 funds per ton to orbit but in the cheap and cheerful payload challenge Nefrums showed it is possible to break 600 funds per ton.  In the caveman challenge it has been shown Mun, Minimus and Duna are all accessible without upgrading facilities.  At this point in the game contracts are throwing money at you after you have explored Duna so getting level 2 facilities are much more feasible without grinding.  Yes I would prefer tighter margins on contracts and less funds to upgrade facilities.  That way as long as your doing contracts for profit facility upgrades are not too difficult.  \n\u003C/p\u003E\n\u003Cp\u003E\nOne thing that still bugs me is the fact the sub orbital has the best payout / game time.  If your like me and want to have the kerbal system explored within a game week or 2 this is the quickest way to get funds.  In 7 minutes I can make about 10k funds doing 2 suborbital contracts where as 2 orbitals take 30 minutes and only pays 19k funds.  It only get worse the longer the missions get.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-03-04T20:51:14Z","Content":"\n\u003Cp\u003E\nFund per unit time spent, per launch, whatever is the very definition of grind to me.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d prefer career to be about exploration with semi-realistic \u003Cem\u003Efeeling\u003C/em\u003E constraints. \n\u003C/p\u003E\n"},{"CreatedByName":"ArgenTum","CreatedById":136611,"CreatedDateTime":"2016-03-05T07:37:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222441984\u0022 data-ipsquote-contentid=\u0022133360\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457124674\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027d prefer career to be about exploration with semi-realistic \u003Cem\u003Efeeling\u003C/em\u003E constraints. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is my view of career as well, and I guess thats what my suggestions are (somewhat) aiming at. To have in game features that encourage exploring by unlocking in game content, for example a delta-v readout, or a selfupdating wiki. Right now I don\u0027t even know what career mode is about, and why it is called career at all. (Maybe the easiest solution would be to change the name to \u0022contract mode\u0022 or \u0022reasearch mode\u0022 or \u0022economic mode\u0022 or whatever, because \u0022career mode\u0022 is actually quite misleading.)\n\u003C/p\u003E\n"},{"CreatedByName":"CobraA1","CreatedById":18757,"CreatedDateTime":"2016-03-05T23:35:06Z","Content":"\n\u003Cp\u003E\n90% of science unlocked without leaving Kerbin?  How? I don\u0027t want to play Kerbal Airplane Program. \n\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2016-03-06T01:23:54Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222443819\u0022 data-ipsquote-contentid=\u0022133360\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457220906\u0022 data-ipsquote-userid=\u002218757\u0022 data-ipsquote-username=\u0022CobraA1\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, CobraA1 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n90% of science unlocked without leaving Kerbin?  How? I don\u0027t want to play Kerbal Airplane Program. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think they mean without leaving the Kerbin \u003Cem\u003Esystem\u003C/em\u003E, which includes Mun and Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/136611-argentum/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022136611\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/136611-argentum/\u0022\u003E@ArgenTum\u003C/a\u003E I like your career mode ideas. My favorite is having a weekly budget with both income (like government funding) and expenses (like astronaut and staff salaries). Maybe upgrading a facility should not only have a one-time upgrade cost, but also increased ongoing maintenance and salary costs, since I can imagine the upgraded facilities require more personnel to run. This one change, all your other good suggestions notwithstanding, could make a HUGE difference in how KSP career plays.\n\u003C/p\u003E\n"},{"CreatedByName":"CobraA1","CreatedById":18757,"CreatedDateTime":"2016-03-06T07:00:54Z","Content":"\n\u003Cp\u003E\n#1 I\u0027d be fine with.\n\u003C/p\u003E\n\u003Cp\u003E\n#2 - I like the idea of overarching missions. I don\u0027t like all the penalties you\u0027re proposing, though. I very much prefer to play at my own pace.\n\u003C/p\u003E\n\u003Cp\u003E\n#3 - I don\u0027t really see why this is needed.\n\u003C/p\u003E\n\u003Cp\u003E\n#4 - I like this idea.\n\u003C/p\u003E\n\u003Cp\u003E\n#5 - I just checked the science building, and it seems as if they\u0027re already on an exponential curve of some sort? The later technologies cost a lot more than the earlier ones.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m really struggling for science enough as it is.\n\u003C/p\u003E\n\u003Cp\u003E\n#6 - I like this idea.\n\u003C/p\u003E\n\u003Cp\u003E\nMy biggest issues with the way science is currently set up is the following:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nScience having its own area of the tech tree. The whole purpose of tech trees in games is to offer players a series of branching choices. If one branch of the tree is so strong that taking other branches first is unthinkable, then the entire point of having a tree rather moot. In the case of KSP as it currently stands, you have to go down the area with the science, otherwise you\u0027ll be hurting. It would be much better if the science stuff was integrated into the other areas of the tree, rather than having its own area.\n\u003C/li\u003E\n\u003Cli\u003E\nVery little way to gain science via contracts. 4 science from a contract, when I need hundreds of science for the next item on the tree? That\u0027s a joke.\n\u003C/li\u003E\n\u003Cli\u003E\nNot to mention very few contracts seem to encourage me to do things to get more science. I could probably get a lot more science if I weren\u0027t on a tight budget and needed the contracts to keep up on income.\n\u003C/li\u003E\n\u003Cli\u003E\nI didn\u0027t do much on the Mun, and there\u0027s more I could do there. But, since I\u0027ve gone off to Minmus, the Mun stuff is gone now.\n\u003C/li\u003E\n\u003Cli\u003E\nI would REALLY like a better way of assessing what science still needs to be done.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nUltimately, I think I\u0027d like some way to \u0022direct\u0022 the contracts I\u0027m getting. Some ability to say \u0022I\u0027d like to focus on science for a while,\u0022 or \u0022I\u0027d like to do some Mun missions for a bit.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"ArgenTum","CreatedById":136611,"CreatedDateTime":"2016-03-06T07:47:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222443942\u0022 data-ipsquote-contentid=\u0022133360\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457227434\u0022 data-ipsquote-userid=\u0022100398\u0022 data-ipsquote-username=\u0022Xavven\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, Xavven said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMaybe upgrading a facility should not only have a one-time upgrade cost, but also increased ongoing maintenance and salary costs, since I can imagine the upgraded facilities require more personnel to run. This one change, all your other good suggestions notwithstanding, could make a HUGE difference in how KSP career plays.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed. And it would be a way to balance mid- to late game, where you often have very much money. If the upgraded facilities cost more every week, your budget would be bigger, but you wouldn\u0027t necessarily have more (or at least not near infinit) money to spend.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd for you wondering about my 1 launch/day suggestion, it is mainly a way to balance weekly costs. Otherwise you can do hundreds of launches in the first week, which is not only unrealistic, but would be kinda cheaty if your expenses for the first week is in the area of 2000 roots or whatever.\n\u003C/p\u003E\n"}]}