{"TopicId":135371,"ForumId":55,"TopicTitle":"Aliens and UFOs","CreatedByName":"Rhapo The Engineer","CreatedById":160925,"CreatedDateTime":"2016-03-30T16:58:30Z","PageNum":1,"Articles":[{"CreatedByName":"Rhapo The Engineer","CreatedById":160925,"CreatedDateTime":"2016-03-30T16:58:30Z","Content":"\n\u003Cp\u003E\nwouldn\u0027t  it be cool to see a UFO or a alien on the ground but quickly disappears once and a while. Or maybe a few ruins of aliens a bit more often like a UFO trapped in ice or a alien space station orbiting Eeloo or Duna, something like that. Anyway, i think the aliens should be and abstract colour than a kerbals colour like purple or yellow. Maybe the aliens could be humans or something. I don\u0027t know i just wish there would be a bit more abstract events and objects when landing or flying.\n\u003C/p\u003E\n"},{"CreatedByName":"Zefrik","CreatedById":144405,"CreatedDateTime":"2016-03-30T18:54:21Z","Content":"\n\u003Cp\u003E\nI may be wrong but I think that Squad has said that they where not going to do anything like this. It might even be in the list of things not to suggest. I may be wrong though.\n\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-03-30T23:22:45Z","Content":"\n\u003Cp\u003E\nYeah, there\u0027s no plans for any aliens other than Kerbals and Krakens, but there are crashed UFOs.\n\u003C/p\u003E\n\u003Cp\u003E\nThis topic comes up fairly frequently, so I\u0027ll make this thread the Aliens thread on the Common Suggestions list \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jbterminator","CreatedById":161065,"CreatedDateTime":"2016-03-31T04:09:24Z","Content":"\n\u003Cp\u003E\nWould be nice though to have the anomalies in space be something else other than asteroids, maybe some random part etc.\n\u003C/p\u003E\n"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2016-03-31T06:00:53Z","Content":"\n\u003Cp\u003E\nI shudder to think what would have happened had I posted this thread.... \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nI know one thing, I wouldn\u0027t have because I already knew the answer!\u003Cbr\u003E\u003Cbr\u003E\nWhat about a HOSTILE Alien? (visions of a KSP version of the Gerry Anderson TV series UFO come to mind....)\u003Cbr\u003E\u003Cbr\u003E\nBut... it won;t ever happen unless the Squad devs get horribly drunk...... OK, where do I send the 10,000 dozen cans of New Zealand beer? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-03-31T09:57:25Z","Content":"\n\u003Cp\u003E\nNo direct contact please.\n\u003C/p\u003E\n\u003Cp\u003E\nBUT a cool idea struck my mind. What if there was a super rare contract that would state that there\u0027s an unknown object in space and it\u0027s on a reentry path somewhere on the planet. It also states when and where it would enter the atmosphere. Then you have to build a super fast jet and go encounter it. Once you get there you see a bright spot of light that you can\u0027t catch up to but performing a crew report in the 5km radius from it gives you sick amounts of rep, or something.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d love to see more easter eggs you can randomly encounter and somehow interact with instead of just looking at them.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-03-31T19:04:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222484524\u0022 data-ipsquote-contentid=\u0022135371\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221459404053\u0022 data-ipsquote-userid=\u002281697\u0022 data-ipsquote-username=\u0022kiwi1960\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, kiwi1960 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nBut... it won;t ever happen unless the Squad devs get horribly drunk...... OK, where do I send the 10,000 dozen cans of New Zealand beer? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n Either squad have a very high tolerance level or Kiwi beer is a bit on the weak side.\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2016-03-31T21:15:41Z","Content":"\n\u003Cp\u003E\nSo maybe we wouldn\u0027t interact with them, but I\u0027d be down for say a VERY, VERY random event (like 1 in 10,000) that a odd object with irregular blinking pulses comes into view, does a 90 degree insta-turn and vanishes\n\u003C/p\u003E\n\u003Cp\u003E\nTHAT would be really cool\n\u003C/p\u003E\n\u003Cp\u003E\nWith out sounding like too much of a crackpot, I\u0027ve seen something in the sky I couldn\u0027t explain about a year ago while on vacation in Siesta Key, Florida. Was on the beach at 10pm with my little brother and suddenly a single, bright incandescent red light was suddenly in the sky, and we observed it moving and have irregular blinking pluses, getting dimmer and brighter, and it eventually started moving upwards like an exponential function, and we watched it literately disappear in the sky.\n\u003C/p\u003E\n\u003Cp\u003E\nIf anyone\u0027s interest is peeked, take a look at my report I sent to MUFON: \u003Ca href=\u0022http://www.ufostalker.com/ufostalker/UFO\u002BSighting\u002Bin\u002BSiesta\u002BKey\u002BFlorida\u002BUnited\u002BStates\u002Bon\u002BApril\u002B3rd\u002B2015/64427\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.ufostalker.com/ufostalker/UFO\u002BSighting\u002Bin\u002BSiesta\u002BKey\u002BFlorida\u002BUnited\u002BStates\u002Bon\u002BApril\u002B3rd\u002B2015/64427\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAfter I sent the report online, I looked other reports submitted on ufostalker in the area, and pretty much all of them in the area describe orbs of orange/red in the area. 2 of them described my sighting to the letter, around the same time of night and upon just looking at my report for the first time in many many months, I just saw I have a single comment on my sighting from 5 months ago from someone saying they saw the same exact thing, take a look at it from the link\n\u003C/p\u003E\n\u003Cp\u003E\nYep im that guy right now but I expletive you not, look up at the sky more often, and you\u0027ll see things that behave like no plane or satellite you\u0027ve seen before. We spend so much time looking in front of us and too little time looking up.\n\u003C/p\u003E\n\u003Cp\u003E\n/crackpot, I dont know why i\u0027ve exposed my self like this I\u0027ve kept this to my self most of the time since the event. I blame this thread\n\u003C/p\u003E\n\u003Cp\u003E\nBut yea I\u0027d be down for a random event \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-31T21:17:34Z\u0022 title=\u002203/31/2016 09:17  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 31, 2016\u003C/time\u003E by fireblade274\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2016-03-31T21:21:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222485738\u0022 data-ipsquote-contentid=\u0022135371\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221459451058\u0022 data-ipsquote-userid=\u0022130621\u0022 data-ipsquote-username=\u0022pandaman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, pandaman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n Either squad have a very high tolerance level or Kiwi beer is a bit on the weak side.\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo beersies for you, Panda, I said Horribly drunk, have you ever seen a drunk Kiwi? \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E We, as well as Aussies, are famous for it.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, we have to aim for a worse kind of drunk than that... AND assuming... their tolerance for booze is high to begin with? Why?\u003Cbr\u003E\u003Cbr\u003E\nWell, that is easy... they came up with the idea of funny looking Kerbals... only a drunk person could have done that....\n\u003C/p\u003E\n\u003Cp\u003E\nOR... they saw a real live talking Panda on KSPTV... that is sure to drive anyone to drink! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2016-04-01T04:21:06Z","Content":"\n\u003Cp\u003E\nI concur with Kiwi - it\u0027s pretty hard to drink yourself cool on a 45 degree Celsius day over here (Aus).  On topic, I have read a thread where Nova had an idea for the monoliths and other anomalies to reveal another planet (Duna SSTV signal).  I think this would have made one of the best easter eggs in any game I\u0027d ever played.  Imagine if the planet was occupied by the alien overseers of kerbal civilization...\n\u003C/p\u003E\n"},{"CreatedByName":"capitaniojr","CreatedById":167865,"CreatedDateTime":"2016-08-19T13:58:09Z","Content":"\n\u003Cp\u003E\ni believe this is not a change everyone wants, so it could be get by a mod, if anyone knows how to do.\n\u003C/p\u003E\n"},{"CreatedByName":"EpicSpaceTroll139","CreatedById":162839,"CreatedDateTime":"2016-08-19T23:16:14Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222482744\u0022 data-ipsquote-contentid=\u0022135371\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221459357110\u0022 data-ipsquote-userid=\u0022160925\u0022 data-ipsquote-username=\u0022Rhapo The Engineer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎3‎/‎30‎/‎2016 at 0:58 PM, Rhapo The Engineer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n a UFO trapped in ice\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is already a thing\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/d4HYi\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/d4HYi\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(Sorry imgur insert isn\u0027t working so I gave the link).\n\u003C/p\u003E\n"},{"CreatedByName":"GLGL-Fox","CreatedById":162031,"CreatedDateTime":"2016-08-20T01:03:01Z","Content":"\n\u003Cp\u003E\nIt is partiliy there like the crashed ufo\u0027s but we need the other cool stuff like for example a space station orbiting a planet or a moon or we find alien base on a planet\n\u003C/p\u003E\n"},{"CreatedByName":"wrobel-cwirek","CreatedById":6461,"CreatedDateTime":"2016-09-21T09:34:39Z","Content":"\n\u003Cp\u003E\nIt would be nice to have \u0022RAMA\u0022 style of event in late career (base on \u003Ca href=\u0022https://en.wikipedia.org/wiki/Rendezvous_with_Rama\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Rendezvous_with_Rama\u003C/a\u003E). Maybe some modder would make it \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"phantom000","CreatedById":160599,"CreatedDateTime":"2017-01-02T16:43:04Z","Content":"\n\u003Cp\u003E\nWhat about artifacts? random bits and pieces of alien technology floating around the solar system. If you can find one and recover it you get huge busts to funding and reputation and so would be a boon to career mode.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2017-01-03T11:13:20Z","Content":"\n\u003Cp\u003E\nWhat if the aliens look like humans and have ships that abduct kerbals. You could have an advanced mission type where a kerbal is randomly put on the map on kerbal or another planet. There is a time limit. You have to use some unique item given with the mission to interfere with their beam and stop them from getting the kerbin in their ship. You must also stop the kerbal from falling too far and dying. Point are given for how well you do. Say if the kerbal is sucked up nothing. if he is not sucked up but dies you get minimal reward or even punishment. If you save him you get good payout. If you maybe scan the ship on top of it you get rewards and maybe an unlock of an item or heavy science and or extra other points. the scanner would also be part of the stuff given in the mission. Or the same item with another use.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis would give a mission type where you have to go to x location and maybe do something more interesting/complex.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ships could be massive and fit earth scale in regards to power and resources because they are presumably from earth! \u0026gt;\u0026lt; Maybe one of them is a real scale decked out NASA shuttle or soviet vehicles. It would of course be decked out in advanced \u0022alien\u0022 technology.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIs the UFO in ice how the kerbals go to kerbin or is it from, \u0022aliens?\u0022\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nJust had an odd thought. Maybe kerbals aren\u0027t, \u0022aliens.\u0022 Maybe they are mexicans/humans(as the speak spanish backwords) after a very long colonization trip from a future mexican NASA? Or a mission with nasa(as they obviously have US/russian tech. Or maybe international) for some random reason... Maybe the green is from odd food or croygentic feedings and the backwards talking is from a technical issue and they had to relearn language from backwards language studies.... and the size is from prolonged space travel issues of some bizzare sort. 8) flamingos to turn pink because of diet afterall.. Maybe there was a food source at one point that used high levels of chlorophyll.... Maybe the snack habit was the prepackaged food after waking up and getting cravings for sweets after all the chlorophyll liquid injected diet stuff and now snacks are their most prized possesion?! Or maybe after all was done only a messed up backwards spanish tape on language survived. \u0026gt;\u0026lt; And the whatever crew all had amnesia!\n\u003C/p\u003E\n\u003Cp\u003E\nWould the gravity on kerbin change human form and make them smaller if they sat on the planet long enough(potentially in stasis and presumably in a near upright position?) after deep space travel or could gravity anomolies do it and still end up on kerbin purposefully or not? Or maybe after generations on kerbin they breed shorter because of environment...?! This is also assuming kerbal isn\u0027t a future earth with and simplifying the spaceships thing to simply cryogen stasis on earth... Then the same affect with endless generations of breeding and changes.\n\u003C/p\u003E\n\u003Cp\u003E\nIf nasa did edcuation stuff on a long term voyage would they use tape decks still over other things. would they last longer potentially or have some other benefit over cd\u0027s or raw date.. Maybe a lower tech backup system.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe they were asleep in cylindrical tubes and the zero gravity made their heads conform to the tube shape in deep space. \u0026gt;\u0026lt; The rest of the body shrunk due to dietary/environmental reasons and genetics changes took place. Or were forces by machines for survival.... oO\n\u003C/p\u003E\n\u003Cp\u003E\nI guess if it was international then one of the guys might have been Amish... Or there was info on Amish like stuff as Jebediah has such a name... Amish agricultural specialist in space!! Must have been some extreme conditions to get them on a space ship... \u0026gt;\u0026lt;\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-03T11:42:42Z\u0022 title=\u002201/03/2017 11:42  AM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 3, 2017\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"}]}