{"TopicId":140551,"ForumId":55,"TopicTitle":"New CoM features for VAB/SPH","CreatedByName":"Adelaar","CreatedById":150794,"CreatedDateTime":"2016-05-26T09:11:35Z","PageNum":1,"Articles":[{"CreatedByName":"Adelaar","CreatedById":150794,"CreatedDateTime":"2016-05-26T09:11:35Z","Content":"\n\u003Cp\u003E\nAs someone who spends an aweful lot of time building aircraft, SSTO\u0027s and VTOL\u0027s, I am frequently annoyed by the balancing process of Center of lift, thrust and mass. The first two are to a large extent stationary (as in, by itself it doesn\u0027t move, unless flaps or hinges are being used), but the Center of Mass is inherently unstable as fuel drains from the craft\u0027s tanks, cargo is being added or dropped, tools are being loaded using KIS, et cetera.\n\u003C/p\u003E\n\u003Cp\u003E\nDuring the construction process, this means that I find myself frequently draining fuel tanks manually to see how the CoM moves about, so that when I\u0027m actually flying the thing, it doesn\u0027t sneak behind the CoL and crashes the craft due to stalling. This is especially true when building VTOL\u0027s, where the CoM shouldn\u0027t move at all, or at least as little as possible.\n\u003C/p\u003E\n\u003Cp\u003E\nSo what I would like to see implemented is the CoM button not as a On/Off state, but as a button that cycles through CoM view: off/current state/fully fueled/empty. Alternatively: Off/current state/fully fueled \u0026amp; empty (represented as two spheres with different colours or an F(ull)/E(mpty) mark on it.\n\u003C/p\u003E\n\u003Cp\u003E\nThis would at least shave off valuable time for me, especially when the craft is made up out of 100 parts or more...\n\u003C/p\u003E\n"},{"CreatedByName":"Brofessional","CreatedById":2080,"CreatedDateTime":"2016-05-26T10:50:53Z","Content":"\n\u003Cp\u003E\nThe RCS Build Aid mod adds an extra marker for dry CoM.  I do think it\u0027s a feature that should be added to the stock game though.\n\u003C/p\u003E\n"},{"CreatedByName":"Ser","CreatedById":104207,"CreatedDateTime":"2016-05-26T10:51:21Z","Content":"\n\u003Cp\u003E\nAgreed. Alternatively this could be achieved by a slider that drains fuel from entire vessel in the correct order of tanks. This will help not only in building SSTO\u0027s but also rockets in career mode when you have to place a bunch of small tanks on top of each other and need to empty them one by one to see how the CoM behaves. Not only empty and dry positions are required but also intermediate states to determine the point when a rocket becomes stable and thus can be steered in flight.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-26T10:54:51Z\u0022 title=\u002205/26/2016 10:54  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 26, 2016\u003C/time\u003E by Ser\u003C/strong\u003E\n\u003C/span\u003E\n"}]}