{"TopicId":141690,"ForumId":55,"TopicTitle":"Persistent Control From Here","CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2016-06-12T23:26:39Z","PageNum":1,"Articles":[{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2016-06-12T23:26:39Z","Content":"\n\u003Cp\u003E\nPersistent Control From Here\n\u003C/p\u003E\n\u003Cp\u003E\nHappens when joining multiple vessels into one vessel in the VAB/SPH then separating them in flight.  Then selecting to control from a part such as docking port or command pod switch to a vessel out of physics range and then return.  The control from here point will reset.\n\u003C/p\u003E\n\u003Cp\u003E\nWhy not have the control from here point persistent.\n\u003C/p\u003E\n\u003Cp\u003E\nSo many times have I started a maneuver only to realize the control from here point has reset after switching vessels.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-12T23:29:47Z\u0022 title=\u002206/12/2016 11:29  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 12, 2016\u003C/time\u003E by MoeslyArmlis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2016-06-13T12:49:46Z","Content":"\n\u003Cp\u003E\nI have a problem whereby I dock, transfer fuel or Kerbels and undock, forgetting to set my control-from-here-point appropriately before attempting the next manoeuvre. I forget every single time. I wish that after undocking, the control point is set to the front of the vessel so my engines are pointing the right way for the manoeuvre.\n\u003C/p\u003E\n"},{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2016-07-11T13:06:06Z","Content":"\n\u003Cp\u003E\nThis is also happening if I save and come back or control a different vessel and come back. It\u0027s very frustrating and can lead to loss of vessel in atmosphere or wasted  time thrusting in the wrong direction.\n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-07-11T17:48:52Z","Content":"\n\u003Cp\u003E\nI could make a rather large list of things that should be persistent and are not, but suffice to say, I agree with this.\n\u003C/p\u003E\n"},{"CreatedByName":"Brownhair2","CreatedById":128730,"CreatedDateTime":"2016-07-11T23:39:29Z","Content":"\n\u003Cp\u003E\nYes. Yes yes yes yes yes. Oh my god it\u0027s like the game tries to select the most awkward cockpit/docking port to control from. \u0022Having fun with your rover? I\u0027m gonna switch to your backwards docking port!\u0022\n\u003C/p\u003E\n"}]}