{"TopicId":143424,"ForumId":55,"TopicTitle":"Making current planets more interesting brainstorm","CreatedByName":"nikokespprfan","CreatedById":136115,"CreatedDateTime":"2016-07-09T11:25:21Z","PageNum":2,"Articles":[{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-07-11T20:33:56Z","Content":"\n\u003Cp\u003E\nNot easter eggs, I frankly hate those.\n\u003C/p\u003E\n\u003Cp\u003E\nThe issue is that it\u0027s not as simple as making the worlds more interesting. There needs to be something to DO with the interesting worlds. Exploration itself would be a thing, but that requires randomization and fog of war.\n\u003C/p\u003E\n"},{"CreatedByName":"nikokespprfan","CreatedById":136115,"CreatedDateTime":"2016-07-11T20:47:17Z","Content":"\n\u003Cp\u003E\nOn the exploration part, maybe we could have very small area\u0027s where certain science experiments give different readings compared to the rest of the biome. This would simulate scientific discoveries done by, for instance rovers. There would at least be more to science than biome hopping would give you.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222669596\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468156156\u0022 data-ipsquote-userid=\u0022104935\u0022 data-ipsquote-username=\u0022cantab\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 10-7-2016 at 3:09 PM, cantab said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThen again without the gameplay to take advantage of such detail, is there much point? And I\u0027ve thought about this and realised that KSP is \u003Cem\u003Enot about planetary exploration\u003C/em\u003E. \u003Cstrong\u003EIt\u0027s about spaceflight, about launches and orbits and landing.\u003C/strong\u003E Surface exploration is an afterthought. Space program management feels like an afterthought. Even aeroplanes were an afterthought and only became central because small Kerbin makes orbital spaceplanes fairly easy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222670982\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468240163\u0022 data-ipsquote-userid=\u002239606\u0022 data-ipsquote-username=\u0022Holo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Holo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd while we\u0027re at it, let\u0027s add \u003Cstrong\u003Esquare orbits\u003C/strong\u003E, infinite fuel and a moon made of cheese. After all, physics doesn\u0027t apply.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, there are more things than just elliptical orbits, having binary systems or horseshoe orbits would give players extra orbital mechanics to learn and experiment with, but I think adding new bodies will be necessary for that.\n\u003C/p\u003E\n"},{"CreatedByName":"Brownhair2","CreatedById":128730,"CreatedDateTime":"2016-07-11T20:51:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222671616\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468270037\u0022 data-ipsquote-userid=\u0022136115\u0022 data-ipsquote-username=\u0022nikokespprfan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, nikokespprfan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, there are more things than just elliptical orbits, having binary systems or horseshoe orbits would give players extra orbital mechanics to learn and experiment with, but I think adding new bodies will be necessary for that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat would be nice. Although binary systems would be hard\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-11T20:52:58Z\u0022 title=\u002207/11/2016 08:52  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 11, 2016\u003C/time\u003E by Brownhair2\u003C/strong\u003E\n\u003Cbr\u003EI\u0026#039;m dumb\n\u003C/span\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2016-07-11T21:23:15Z","Content":"\n\u003Cp\u003E\nThe easiest and quickest way to make planets have more impact is to give the player the ability \u003Cstrong\u003E\u003Cem\u003E\u003Cu\u003Eand the need\u003C/u\u003E\u003C/em\u003E\u003C/strong\u003E to build offworld bases.\u003Cbr\u003E\nYou could tie this directly into the tech tree too. KSP is a game based in reality. That doesn\u0027t mean it can\u0027t become a science-fiction, futuristic game. As long as it keeps itself grounded in what could be plausible, I see no reason why we have to stay restricted to current and real technologies.\u003Cbr\u003E\u003Cbr\u003E\nScenario:\u003Cbr\u003E\n1. Near future propulsion systems can\u0027t run on any fuel source found on Kerbin, go check out Minmus and see if there\u0027s anything there.\u003Cbr\u003E\n2. High orbit ScanSat. Picked up anomaly.\u003Cbr\u003E\n3. Low orbit ScanSat. Anomaly confirmed.\u003Cbr\u003E\n4. Rover analysis complete. Unknown element discovered.\u003Cbr\u003E\n5. Offworld science base studies element.\u003Cbr\u003E\n6. Offworld mining begins\n\u003C/p\u003E\n\u003Cp\u003E\n7. Offworld refining begins.\u003Cbr\u003E\n8. 1,000 discovered \u0022ore\u0022 collected and refined. Tech tree now allows for prototype technologies/fuels/materials.\n\u003C/p\u003E\n\u003Cp\u003E\n9. Advance tech tree by doing more science. Unlock new parts that use the discovered element as a currency of sorts (need X amount of ore to \u0022purchase\u0022 a super heat-resistance wing for example).\n\u003C/p\u003E\n\u003Cp\u003E\n10. Rinse and repeat for various planetary bodies.\u003Cbr\u003E\u003Cbr\u003E\nMy dream KSP game is somewhat of a mix between what we have now and Civ V playstyle where you can create different \u0022units\u0022 to do the mundane stuff for you. Just imagine starting a KSP game as it is now and doing all these things yourself, and then unlocking the ability to tell other \u0022Kerbal Krews\u0022 to continue doing the mining or the refining or the science on a particular planetary base so that you (the player) can remain at the forefront of discovery and keep building rockets that use cleaner fuels, hotter fuels, more efficient fuels, stronger structural bodies, heat resistant bodies (bye bye heat sheilds) etc etc. And it doesn\u0027t have to be just technological gains either. You could have funding play a part as well: Company A will give you a science boost if you establish a radio communication relay in orbit/on the surface. Company B will give you 20 prospective astronaughts that you don\u0027t have to hire (and pay for) if you build a base on planet whatever.\u003Cbr\u003E\u003Cbr\u003E\nThe bottom line is that as long as planets remain barren wastelands, the only reason to ever go there is merely just to say that you\u0027ve been there. If we put the keys to better tech on those planets in the form of mine-able resources and monies we wouldn\u0027t normally have access to, we give players a reason to go there.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-11T21:23:47Z\u0022 title=\u002207/11/2016 09:23  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 11, 2016\u003C/time\u003E by Greenfire32\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"septemberWaves","CreatedById":160814,"CreatedDateTime":"2016-07-11T21:27:46Z","Content":"\n\u003Cp\u003E\nWhat I think would really make planets more interesting is not changing things about the planets themselves, but having more in-depth \u0022Explore [location]\u0022 contracts. What I mean is that, instead of just \u0022orbit, land, return science\u0022 to consider a planet explored, it would be nice to have similar no-deadline contracts but with more structure, and more of them for each celestial body. Something along the lines of:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nFly by the celestial body with a probe and transmit images.\n\u003C/li\u003E\n\u003Cli\u003E\nOrbit the celestial body with a probe and transmit [science data specific to orbit].\n\u003C/li\u003E\n\u003Cli\u003E\nLand on the celestial body with a probe in a particular biome (more optional contracts for each biome) or location, and transmit [science data specific to surface]. Possible additional parameter for autonomous rover.\n\u003C/li\u003E\n\u003Cli\u003E\nImpact the celestial body with a probe, must have another probe in orbit with [some new piece of (camera) equipment for this sort of mission].\n\u003C/li\u003E\n\u003Cli\u003E\nFly by/orbit the celestial body with crew and return [crew report, EVA data, orbit science that cannot be transmitted].\n\u003C/li\u003E\n\u003Cli\u003E\nLand on the celestial body with crew in a particular biome (more optional contracts for each biome) or location, plant flag, and return [surface science that cannot be transmitted]. Possible additional parameter for crewed rover.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nThis system would not invalidate the existing \u0022put probe with specific part into specific orbit of this celestial body\u0022 or \u0022construct an orbital station/surface base at this celestial body\u0022 contracts, but those would probably depend upon having previously achieved a relevant exploration contract. There\u0027s no sense in asking a space program to establish a Mun base if they have yet to land a kerbal on the Mun, for example.\n\u003C/p\u003E\n\u003Cp\u003E\nSomething like this would probably need a couple of new parts and perhaps a few minor changes to the contract system, but I feel like it would improve upon the current \u0022orbit, land, return science\u0022 exploration contracts that we currently have. This way, players would have to send probes as well as crewed missions, and there are good reasons in career saves to return to a place even when you\u0027ve already planted a flag there. It would also bring more importance to science probes, with perhaps a few adjustments to transmission values of experiments: some science equipment could be used primarily for probes and autonomous landers (the thermometer and barometer, for example) whilst others (mystery goo, science jr, and anything else which realistically would require physical sample returns) would need a crewed mission to get a good amount of science data from.\n\u003C/p\u003E\n\u003Cp\u003E\ntl;dr\u003Cbr\u003E\nBasically I feel like a slight overhaul of \u0022explore [celestial body]\u0022 contracts could do more to improve interest in the current Kerbol system than changes to the actual planets could, because it would give players more reasons to send new missions.\n\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2016-07-11T21:47:27Z","Content":"\n\u003Cp\u003E\nA couple of ideas I like from this thread and elsewhere:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Axial tilt (topic was necro\u0027d but great idea) for Kerbin and all other bodies.  This could be a \u0022difficulty option\u0022 for veteran players.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Higher terrain detail.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Biome terrain detail, maybe with different scatters or ground graphic effects.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Atmosphere effects (clouds, dust, etc...)\n\u003C/p\u003E\n\u003Cp\u003E\nThese sorts of things help with all game modes, just like having more planets.  I am opposed to ideas that lock the player into a style of play, however (I find surface base building and mining completely uninteresting, for instance).\n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2016-07-11T22:11:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222671511\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468265564\u0022 data-ipsquote-userid=\u002258876\u0022 data-ipsquote-username=\u0022Van Disaster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Van Disaster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWell, let\u0027s hash out some details \u0026amp; see what can be incorporated with what we have, or by extending what is in the game already. \u0022More reasons to sustain bases\u0022 is extremely vague.. \u003Cstrong\u003Ewhat \u003C/strong\u003Ereasons? what does hydrogen mining bring to the game and how would we do it?\n\u003C/p\u003E\n\u003Cp\u003E\nBiome hopping does absolutely nothing for sandbox. There are things which would add to sandbox just as much, like more detailed resource extraction for one, which would also add to career. Biome hopping to more differing biomes is still not going to keep you on a planet very long.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThose are all examples from recent threads.   Anyway there are a ton of ideas in this forum about how science can be made more interesting and the game can be improved.  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/143504-has-anyone-ever-modded-hydrogen-fuel-scoops/\u0022 rel=\u0022\u0022\u003EHere\u003C/a\u003E is one thread about hydrogen. See my comment in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/143054-we-need-terraforming/\u0022 rel=\u0022\u0022\u003Ethis\u003C/a\u003E thread about how terraforming could be made to work and add interest into KSP (most seemed opposed though I think I addressed many of their concerns) including providing a purpose for bases on other planets. \n\u003C/p\u003E\n\u003Cp\u003E\nOther ideas I\u0027ve seen involve various ways of making science more relevant, e.g. conduct experiments to advance tech rather than just gather science because you happened to visit a specific location (which could still be done but instead of just looking at it and taking a generic surface sample, run a series of experiments to reveal some things like mineral analysis, atmosphere content if any and etc. maybe even have levels: you get a basic surface sample it may sometimes hint that if you later bring a more advanced instrument back to that location you might find something more interesting or possibly profitable).\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t see the need to make everything work in both sandbox and career.  My interest is more in career and there are certainly a lot of parts which make little sense to use in sandbox which is in some ways the point of having a sandbox mode so you can try everything out you feel like without monetary or science constraint.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-07-12T02:35:09Z","Content":"\n\u003Cp\u003E\nHigher terrain detail would always improve things. Terrain that is dangerous to spacecraft that is at the scale size of spacecraft. Right now, the Mun is my benchmark, the rest of the airless worlds look terrible in comparison.\n\u003C/p\u003E\n\u003Cp\u003E\nShort of in-situ construction (being able to alter the terrain to bury base elements with regolith, or for more realistic mining of some worlds), there really is not much to do once landed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"nikokespprfan","CreatedById":136115,"CreatedDateTime":"2016-07-12T06:22:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222671626\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468270308\u0022 data-ipsquote-userid=\u0022128730\u0022 data-ipsquote-username=\u0022Brownhair2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Brownhair2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat would be nice. Although binary systems would be hard\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n...too implement: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/115114-113plugin-sigma-binary-v155/\u0022 rel=\u0022\u0022\u003EAlready been done\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n...too get used to: The entire orbits mechanic is hard if you are new to it. As long as binary systems are not the first thing you need to master in KSP, everything will be fine, I think.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI think the science system would benefit a more explorationative feel as well. Now every bit of landed planetary science can be compressed down to biome hopping.  Sometimes you have to seek scientific data, go out there, to find it, and not just visit, load everything in, and go away.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd most of the reasons for bringing probes to a body, getting detailed information (maps for example), or science to the origin of the kerbol system, are already been taken away by what kerbalkind already knows.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-12T06:38:05Z\u0022 title=\u002207/12/2016 06:38  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 12, 2016\u003C/time\u003E by nikokespprfan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ippo","CreatedById":107018,"CreatedDateTime":"2016-07-12T06:30:51Z","Content":"\n\u003Cp\u003E\nWhat I would like to see is an interactive environment, things like:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\ncolliders for the terrain scatter (no more landing inside a rock, you need to scout your LZ first);\n\u003C/li\u003E\n\u003Cli\u003E\nmovable terrain scatter (moving rocks, tearing down trees...);\n\u003C/li\u003E\n\u003Cli\u003E\nweather. Weather is so desperately needed imho;\n\u003C/li\u003E\n\u003Cli\u003E\ncaves.\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2016-07-12T06:39:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222668739\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468100594\u0022 data-ipsquote-userid=\u002258876\u0022 data-ipsquote-username=\u0022Van Disaster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 09/07/2016 at 10:43 PM, Van Disaster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo, for this discussion I think we need to ask some broader questions about real life first.\n\u003C/p\u003E\n\u003Cp\u003E\n* why do we go to other planets?\u003Cbr\u003E\n* what do we do on other planets?\u003Cbr\u003E\n* what do we *want* to do on other planets?\u003Cbr\u003E\n* which of these activities would be a fun, fascinating or fulfilling thing to implement in a game?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cstrong\u003EWhy do we go:\u003C/strong\u003E\u003C/u\u003E\u003Cbr\u003E\u003Cbr\u003E\nWe go to find out more about the history and composition of our universe, particularly our solar system, the worlds in it, and worlds and solar systems in general.\u003Cbr\u003E\nWe go because if we don\u0027t eventually figure out how to live beyond Earth (and Sol), our species will become extinct because when they eventually die, we will have failed to find a way to survive without them.\u003Cbr\u003E\nWe go because we are adventurers, and simply because the other planets and their moons are there to go to.\u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cstrong\u003EWhat do we do there:\u003C/strong\u003E\u003C/u\u003E\u003Cbr\u003E\u003Cbr\u003E\nWe record as much as possible.\u003Cbr\u003E\nWe bring experiments to try to understand how and why other worlds are different from Earth.\u003Cbr\u003E\nWe bring experiments to see if things that are possible on Earth are also possible off Earth (e.g. micro-gravity crops; the moon-rover).\u003Cbr\u003E\nWe search for signs of extra-terrestrial life.\u003Cbr\u003E\nWe explore places that nobody has ever been before, we give names to those places and features of the environment.\u003Cbr\u003E\nWe look for exploitable resources - particularly WATER.\u003Cbr\u003E\nWe look for opportunities for permanent settlement or colonisation.\u003Cbr\u003E\nWe find out the hard way that we are totally unprepared for many of the things we find there.\u003Cbr\u003E\nWe usually have a fixed schedule of work, list of aims and objectives, or an ultimate deadline by which we have leave or be stranded.\u003Cbr\u003E\nWe potentially get stranded, and then have a genuine fight for survival until a rescue can be arranged, or else death.\u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cstrong\u003EWhat do we want to do there:\u003C/strong\u003E\u003C/u\u003E\u003Cbr\u003E\u003Cbr\u003E\nLearn - find out things that are worth knowing and yield some sort of permanent progress - crack the secrets of the cosmos.\u003Cbr\u003E\nExperience things that are unique to that environment.\u003Cbr\u003E\nTake risks - deliberately do things that are dangerous just for the thrill of having done them and survived to tell about it.\u003Cbr\u003E\nLeave our mark/make history/set a record/be famous - in KSP this could be vicariously through some sort of personal renown rating for our Kerbs.\u003Cbr\u003E\nBe surprised and awed by natural beauty or extraordinary physical properties.\u003Cbr\u003E\nWant to stay when you have to leave - ideally so that you will try to come back.\u003Cbr\u003E\nSurvive against fearful odds - fixing a broken lander, trekking to a distant location to reach vital supplies etc.\u003Cbr\u003E\nUltimately, get home (or make a new home where you are).\u003Cbr\u003E\u003Cbr\u003E\u003Cu\u003E\u003Cstrong\u003EWhich would be fun, fascinating or fulfilling to implement?\u003C/strong\u003E\u003C/u\u003E\u003Cbr\u003E\u003Cbr\u003E\nPersonally I think all of them.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-12T06:44:25Z\u0022 title=\u002207/12/2016 06:44  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 12, 2016\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lugge","CreatedById":143343,"CreatedDateTime":"2016-07-12T07:59:35Z","Content":"\n\u003Cp\u003E\nI do agree that the planets need more love. Adding more planets is just stupid. A new planet will give you one evening of playtime, a few more if you add this new planet to your Grand Tour vessel design.\n\u003C/p\u003E\n\u003Cp\u003E\nWe need a reason to go there. And, when we are there, we need a reason to stay there for longer then 5 minutes of reallife time. Weather, more terrain details and better atmosphere, higher texture resolution would all be good. But this alone is no reason to go there. And even if you go there to see the new shiny graphic features: you will spend 5 minutes, do your experiments, plant a flag and go back home, just as now.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, there needs to be a game mechanic overwork instead of a graphic overhaul (which would also be nice).\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe a change in the contract system? A reason to build ground bases? A story more?\n\u003C/p\u003E\n\u003Cp\u003E\nSomething which will force you to discover the planet. At the moment, there\u0027s no reason to send a rover. Tech tree is fully completed by the time you visit Duna and Eve/Gilly. So, just more biomes and experiments wont work.\n\u003C/p\u003E\n\u003Cp\u003E\nA really BIG idead I can think of would be:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nuseful ground bases (for building and launching actual rockets)\n\u003C/li\u003E\n\u003Cli\u003E\nyou need mining base to mine for ore for your rockets\n\u003C/li\u003E\n\u003Cli\u003E\nyou need chemistry and raw materials for fuel and synthetics\n\u003C/li\u003E\n\u003Cli\u003E\nyou need trails/streets/pipelines to connect your different mining operations\n\u003C/li\u003E\n\u003Cli\u003E\nyou are forced to set up a real infrastructure\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nHowever, this would be a BIG, game-changing change. Too big.\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t know what else could force a player to spend more time on existing planets.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-07-12T10:49:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672025\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468290909\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nShort of in-situ construction (being able to alter the terrain to bury base elements with regolith, or for more realistic mining of some worlds), there really is not much to do once landed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis. I\u0027d love to see \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E-like ground anchors (or pylons? the concrete ones that are buried in the ground, not sure what they are called). They are great for building bases.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-07-12T11:04:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672287\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468310375\u0022 data-ipsquote-userid=\u0022143343\u0022 data-ipsquote-username=\u0022lugge\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, lugge said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDon\u0027t know what else could force a player to spend more time on existing planets.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA proper career overhaul perhaps?\n\u003C/p\u003E\n\u003Cp\u003E\nI like some of your ideas and the things you\u0027ve pointed out. I feel like the main problem with this is the way the career mode works. We have a linear tech tree and no reason to build a real infrastructure because of reandomly generated contracts. You go to a place once and then there\u0027s no reason to go there again.\n\u003C/p\u003E\n\u003Cp\u003E\nIf we were able to research things without going through the ridiculous steps we are offered by the tech tree there would be more freedom \u002B setting our own objectives and goals by picking long-term programs would give even more freedom and influence a unique playstyle.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that\u0027s kind of offtopic. I\u0027m not saying weather effects wouldn\u0027t work well, but maintaining surface bases, rovers, outopsts and whatever the heck can be landed and maintained should be a part of the game too.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-07-12T13:39:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672378\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468320566\u0022 data-ipsquote-userid=\u002239636\u0022 data-ipsquote-username=\u0022Veeltch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Veeltch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis. I\u0027d love to see \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E\u003C/abbr\u003E-like ground anchors (or pylons? the concrete ones that are buried in the ground, not sure what they are called). They are great for building bases.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E should be a stock thing, frankly (the base elements of it, not the whole thing) as Kerbals really need more to do, they bothered to animate them, let people do something with the little critters.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, my primary interaction with the terrain is landing, hence my want of smaller scale terrain features so that there is a non-zero chance of an interesting landing. The ability to manipulate the terrain (i.e.: crater it) that would be profoundly cool.\n\u003C/p\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2016-07-12T14:15:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222671666\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468272466\u0022 data-ipsquote-userid=\u0022160814\u0022 data-ipsquote-username=\u0022eloquentJane\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, eloquentJane said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I think would really make planets more interesting is not changing things about the planets themselves, but having more in-depth \u0022Explore [location]\u0022 contracts. What I mean is that, instead of just \u0022orbit, land, return science\u0022 to consider a planet explored, it would be nice to have similar no-deadline contracts but with more structure, and more of them for each celestial body. Something along the lines of:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nFly by the celestial body with a probe and transmit images.\n\u003C/li\u003E\n\u003Cli\u003E\nOrbit the celestial body with a probe and transmit [science data specific to orbit].\n\u003C/li\u003E\n\u003Cli\u003E\nLand on the celestial body with a probe in a particular biome (more optional contracts for each biome) or location, and transmit [science data specific to surface]. Possible additional parameter for autonomous rover.\n\u003C/li\u003E\n\u003Cli\u003E\nImpact the celestial body with a probe, must have another probe in orbit with [some new piece of (camera) equipment for this sort of mission].\n\u003C/li\u003E\n\u003Cli\u003E\nFly by/orbit the celestial body with crew and return [crew report, EVA data, orbit science that cannot be transmitted].\n\u003C/li\u003E\n\u003Cli\u003E\nLand on the celestial body with crew in a particular biome (more optional contracts for each biome) or location, plant flag, and return [surface science that cannot be transmitted]. Possible additional parameter for crewed rover.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nThis system would not invalidate the existing \u0022put probe with specific part into specific orbit of this celestial body\u0022 or \u0022construct an orbital station/surface base at this celestial body\u0022 contracts, but those would probably depend upon having previously achieved a relevant exploration contract. There\u0027s no sense in asking a space program to establish a Mun base if they have yet to land a kerbal on the Mun, for example.\n\u003C/p\u003E\n\u003Cp\u003E\nSomething like this would probably need a couple of new parts and perhaps a few minor changes to the contract system, but I feel like it would improve upon the current \u0022orbit, land, return science\u0022 exploration contracts that we currently have. This way, players would have to send probes as well as crewed missions, and there are good reasons in career saves to return to a place even when you\u0027ve already planted a flag there. It would also bring more importance to science probes, with perhaps a few adjustments to transmission values of experiments: some science equipment could be used primarily for probes and autonomous landers (the thermometer and barometer, for example) whilst others (mystery goo, science jr, and anything else which realistically would require physical sample returns) would need a crewed mission to get a good amount of science data from.\n\u003C/p\u003E\n\u003Cp\u003E\ntl;dr\u003Cbr\u003E\nBasically I feel like a slight overhaul of \u0022explore [celestial body]\u0022 contracts could do more to improve interest in the current Kerbol system than changes to the actual planets could, because it would give players more reasons to send new missions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWe already have that in the \u0022perform x experiment in y\u0022. But that\u0027s just flying or driving (using inadequate wheels) along a barren wasteland with graphics from 15 years ago (yeah, 15 years. Oblivion is from 2006 and we can\u0027t possibly compare 2006 Cyrodill\u0027s eye candy with Dres).\n\u003C/p\u003E\n\u003Cp\u003E\nSo yes, something to do. Ideally, bases that are useful for something. Maybe caves, maybe some stock version of off-world construction. What I\u0027d really like is a good game play reason to use rovers, other than earning credits (which I often have more than needed) and better driving. Wheels are pretty much broken now, but even if they are made to work, driving rovers across long distances means driving across dull graphics for 10\u002B real time minutes hoping you won\u0027t tip over and have to rever to ten minutes ago. So, maybe something other than \u0022parts explode\u0022, so you can actually fix an stranded rover, being able to save while moving over the surface, better grip (maybe wheels designed for each body/gravity) and (since rovers are complicated to deliver due their shape) the ability to put together rovers in site - something like \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E: You deliver the sections in a cargo bay and a team of engineers use cranes and stuff to assemble them once landed.\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbalstar","CreatedById":154159,"CreatedDateTime":"2016-07-12T16:20:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672583\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468332916\u0022 data-ipsquote-userid=\u0022105344\u0022 data-ipsquote-username=\u0022juanml82\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, juanml82 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n-The grand Snip-\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes.^^^ This and some of the other ideas that have been have said in this thread like\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672538\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468330745\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672389\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468321440\u0022 data-ipsquote-userid=\u002239636\u0022 data-ipsquote-username=\u0022Veeltch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Veeltch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNot nested but mobile... also sniped\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSniped\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n^^^^^\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672378\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468320566\u0022 data-ipsquote-userid=\u002239636\u0022 data-ipsquote-username=\u0022Veeltch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Veeltch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSnip\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n^^^^^^^\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672287\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468310375\u0022 data-ipsquote-userid=\u0022143343\u0022 data-ipsquote-username=\u0022lugge\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, lugge said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSnip\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n^^^^^^^^\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672230\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468305598\u0022 data-ipsquote-userid=\u002281727\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, The_Rocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSnip\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes. This all this. ^^^^^^^^^\n\u003C/p\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2016-07-12T17:07:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222670990\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468240401\u0022 data-ipsquote-userid=\u002289014\u0022 data-ipsquote-username=\u0022adsii1970\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 11/07/2016 at 1:33 PM, adsii1970 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNo, that is not at all what I am advocating. There\u0027s  nothing beyond the scope of possibility that says we could not have a brown dwarf in orbit of a gas giant in the Kerbin system. It is in the realm of real physics possibilities AND could fit within KSP, even if you decided to make it a \u0022moon\u0022 of Jool and at a reduced size.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI think brown dwarves really need to be bigger than gas giants for them to even register as brown dwarves, rather than just rogue planets.\n\u003C/p\u003E\n\u003Cp\u003E\nThough that gives me a really cool idea - what about a gas giant orbiting a brown dwarf, at some very far distance from the Sun? It\u0027d be really cool (it\u0027s a gas giant! but also a moon!), fit established physics, and add to the game since it works as a difficult endgame destination for crazy youtubers.\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-07-12T18:53:08Z","Content":"\n\u003Cp\u003E\nThe best way to make them more interesting would be to make all of them larger.\n\u003C/p\u003E\n\u003Cp\u003E\nSince Kerbin has 2 moons, my benchmark would be to scale up the system such that the Mun presents a design challenge to the player in terms of mission mode---Minmus can be kept as a small, low gravity world that requires no special choices. The requirement would be that a staged lander should be a reasonable solution, not utterly pointless. As apparently most players never leave Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E anyway, this would at least make Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESoI\u003C/abbr\u003E interesting.\n\u003C/p\u003E\n"},{"CreatedByName":"Colonel Cbplayer","CreatedById":102399,"CreatedDateTime":"2016-07-12T19:00:30Z","Content":"\n\u003Cp\u003E\nwell Kerbin only has like 3 biomes, mountains, grass, and desert. I feel kerbin does need more scenic views if people want to go exploring. If there where stuff like volcano, waterfalls, more canyons and valleys. Those probably can be form by tweaking world generation. Everything in kerbin just feel so flat and plain, especially from a plane.\n\u003C/p\u003E\n\u003Cp\u003E\nRather then adding any new game mechanics, just terrain generation need to be change so more interesting spots would appear.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-12T19:01:48Z\u0022 title=\u002207/12/2016 07:01  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 12, 2016\u003C/time\u003E by cbplayer2012\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nikokespprfan","CreatedById":136115,"CreatedDateTime":"2016-07-12T19:03:32Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222673020\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468350030\u0022 data-ipsquote-userid=\u0022102399\u0022 data-ipsquote-username=\u0022cbplayer2012\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, cbplayer2012 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nwell Kerbin only has like 3 biomes, mountains, grass, and desert. I feel kerbin does need more scenic views if people want to go exploring. If there where stuff like volcano, waterfalls, more canyons and valleys. Those probably can be form by tweaking world generation. Everything in kerbin just feel so flat and plain, especially from a plane.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere is no world generation, it is a hight map that is the same in every game ever. You would need to change the height map.\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222672841\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468343278\u0022 data-ipsquote-userid=\u002239606\u0022 data-ipsquote-username=\u0022Holo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Holo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think brown dwarves really need to be bigger than gas giants for them to even register as brown dwarves, rather than just rogue planets.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI thought I heard somewhere that gas giants do not become much larger when they become heavier, it is all gas, so the higher mass just compresses everything more, until fusion starts happening.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-12T19:05:51Z\u0022 title=\u002207/12/2016 07:05  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 12, 2016\u003C/time\u003E by nikokespprfan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Holo","CreatedById":39606,"CreatedDateTime":"2016-07-12T19:40:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222673030\u0022 data-ipsquote-contentid=\u0022143424\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221468350212\u0022 data-ipsquote-userid=\u0022136115\u0022 data-ipsquote-username=\u0022nikokespprfan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n36 minutes ago, nikokespprfan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI thought I heard somewhere that gas giants do not become much larger when they become heavier, it is all gas, so the higher mass just compresses everything more, until fusion starts happening.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027m using \u0022bigger\u0022 as a synonym for \u0022more massive\u0022, because in orbital dynamics where everything is approximately a point mass only mass actually matters.\n\u003C/p\u003E\n"},{"CreatedByName":"Algiark","CreatedById":83907,"CreatedDateTime":"2016-07-13T12:10:52Z","Content":"\n\u003Cp\u003E\nHow do other similar space exploration games make their planets interesting?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027m wondering, is there anyone in Squad whose job is explicitly \u0022game design\u0022?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-14T01:48:04Z\u0022 title=\u002207/14/2016 01:48  AM\u0022 data-short=\u00227 yr\u0022\u003EJuly 14, 2016\u003C/time\u003E by Algiark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StahnAileron","CreatedById":139783,"CreatedDateTime":"2016-07-13T13:01:47Z","Content":"\n\u003Cp\u003E\nMake planets more interesting: Make planet-side base building actually stable, viable, and worthwhile.\n\u003C/p\u003E\n\u003Cp\u003E\nDisclosure: I\u0027m still playing on 1.0.5 for a couple reasons, so what I\u0027m gonna say might be moot for 1.1.x.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve always wanted to build remote stations on or around other celestial bodies in KSP (in particular the Mun since I support Moon colonization in real life.) However, at least in stock, it\u0027s kinda pointless. You only have 2 types of functionality for bases: fuel and science. Fuel bases are viable long term, but it sucks because you still need to launch vessel from Kerbin anyway. Science stations eventually become useless by end game when the research tree is maxed out or you have all the parts you really want/need. (Or are completely useless from the get-go in the case of sandbox mode.)\n\u003C/p\u003E\n\u003Cp\u003E\nI would be \u003Cabbr title=\u0022Ferram Aeronautics Research (mod)\u0022\u003EFAR\u003C/abbr\u003E more interested in other bodies if I could BUILD/LAUNCH vessels from bodies OTHER than KERBIN. Yes, there is EPL, but really, think about it: ISRU is now stock. The next logical step is ISIC: In-Situ Infrastructure Construction (Or whatever you wanna call building stuff where you are, using what you have on-hand. Technically, that\u0027s still ISRU, but I need/want to differentiate it for the sake of discussion.)\n\u003C/p\u003E\n\u003Cp\u003E\nI would love a stock method of manufacturing stuff up in a space station or at a planetary base. EPL as a mod is wonderful, but from a gameplay mechanic viewpoint, it\u0027s a little TOO complicated for me. (Both the production tree and setting up construction/launch sites.)\n\u003C/p\u003E\n\u003Cp\u003E\nI say incentivize going to another body by making worthwhile in the long-term first, then you can put in the effort to make the bodies more interesting. I know KSP is a simulation sandbox more than anything, but the lack of gameplay progression, I think, is one of its greatest weaknesses as an actual game. There\u0027s no \u0022endgame\u0022 content/activities, so to speak.\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise: Randomized content on each body when new game is created. I think ore concentration is treated this way, so other things should be as well to some extent to promote exploration. In the current game, once you explore a body (or use a wiki), you know where to go to find whatever you like. I think we\u0027d still need more gameplay mechanics added to make this really worthwhile, but *shrug*.\n\u003C/p\u003E\n"},{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2016-07-14T06:33:03Z","Content":"\n\u003Cp\u003E\nThere are already a load of great ideas in this thread, I just wanted to say that I think the current planets are majorly boring. I don\u0027t know what I was expecting but I\u0027ve been repeatedly disappointed when I get to a planet and there\u0027s nothing there! I guess that\u0027s what most planets are like though \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n"}]}