{"TopicId":146009,"ForumId":55,"TopicTitle":"Power Rebalance","CreatedByName":"StarStreak2109","CreatedById":118557,"CreatedDateTime":"2016-08-16T12:15:03Z","PageNum":1,"Articles":[{"CreatedByName":"StarStreak2109","CreatedById":118557,"CreatedDateTime":"2016-08-16T12:15:03Z","Content":"\n\u003Cp\u003E\nHi there,\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I noticed when building larger stations is that solar panels, especially those found on space stations are hugely overpowered, generating way more power than is being consumed by the ship / space station / whatever. I suggest doing a general rebalance of the whole electrical system.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIIRC real-life space solar panels produce power in the kilowatt range.\n\u003C/li\u003E\n\u003Cli\u003E\nThe ISS needs those huge panels to keep all their systems, labs etc. working.\n\u003C/li\u003E\n\u003Cli\u003E\nKSP crewed and uncrewed parts should be assigned a general baseload electrical consumption according to their function, e.g. an MPL consumes more power than say a small probe core. But still a probe core should still require even for the base load a reasonable amount of solar or other power to keep working. Now for manouvers, for executing science experiments etc., a peak load comes into effect, which could be covered either by sufficient power production or ample supply of batteries.\n\u003C/li\u003E\n\u003Cli\u003E\nIf I have a space station or a space ship with crew on board, power consumption should also be a function of the amount of crew on board. Like when no crew is present, the base load applies, the more crew you have, the more power is being consumed for heating, cooling, pumping supplies around, ventilation etc.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nI know that this system exists in general, for instance mining takes power or running certain experiements, but in the above mentioned base load scenario, space craft are IMHO way too \u0022energy efficient\u0022... \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Racescort666","CreatedById":137852,"CreatedDateTime":"2016-08-16T17:39:41Z","Content":"\n\u003Cp\u003E\nImplementing life support would go a long way toward making solar panels more balanced. That\u0027s probably not necessarily what you were going for with this post but I figured I\u0027d throw my 2 cents in. I know life support is a pretty hotly debated topic, I wasn\u0027t looking to go down that road, but as far as part balancing goes, it certainly makes spaceflight more challenging. \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-08-16T18:12:29Z","Content":"\n\u003Cp\u003E\nI uses TAC life support and power is an issue, it also have pods use power even then unmanned and out of focus. \u003Cbr\u003E\nSent an standard rescue craft to rescue kerbal in orbit outside of Mun, craft was not in focus but out of power as panels was on MK1 pod who pointed away from sun. \u003Cbr\u003E\nI had to wait one orbit to get in into sunlight again then set up an new intercept, \n\u003C/p\u003E\n"},{"CreatedByName":"DDE","CreatedById":146349,"CreatedDateTime":"2016-08-16T18:30:50Z","Content":"\n\u003Cp\u003E\nOnce you get around to TAC LS with recycling systems, and RemoteTech, it stops seeming so excessive. Currently, there is NO background consumption of power at all.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-08-17T00:32:15Z","Content":"\n\u003Cp\u003E\nI agree. If LS is ever to be added to the stock game it should be as simple as possible: EC consumption per kerbal onboard, supplies (food\u002Bwater as one) and a greenhouse (to produce the supplies and be paired with ISRU to close the loop).\n\u003C/p\u003E\n"}]}