{"TopicId":146150,"ForumId":55,"TopicTitle":"Mission Designer","CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-08-19T00:40:59Z","PageNum":1,"Articles":[{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-08-19T00:40:59Z","Content":"\n\u003Cp\u003E\nLet us choose bodies of interest and our own objectives. How I see it:\n\u003C/p\u003E\n\u003Cp\u003E\nYou go into Mission Control and pick the body of your choice. Then a bunch of \u0022biomes\u0022 (low orbit, high orbit, surface, ocean, highlands, lowlands, etc.) show up. Now, you click on them and every possible experiment/objective available (would probably differ based on what kind of strategy AKA program you have picked in the Admin Building) shows up. Each of them has a fixed reward. Once you\u0027ve picked the ones that interest you, you click the green tick button and the mission becomes marked as accepted.\n\u003C/p\u003E\n\u003Cp\u003E\nThis part is an \u003Cu\u003E\u003Cstrong\u003Eextra\u003C/strong\u003E\u003C/u\u003E, so don\u0027t treat it as set in stone (or however this idiom is used):\n\u003C/p\u003E\n\u003Cp\u003E\nThis would be best coupled with the strategies (or rather programs) offered by the Admin Building. You would have three types for each body (except for the Sun and Jool since they can\u0027t be landed on): Scientific, Commercial, Public Relations.\n\u003C/p\u003E\n\u003Cp\u003E\nScientific - the objectives for these missions are purely scientific (science experiments are to be used in these) and they grant you only science points (though I really hate them).\n\u003C/p\u003E\n\u003Cp\u003E\nCommercial - tourism, ore hauling, landing there only because someone is paying you for it and all that nonsensical jazz you can make money on. These grant you money only.\n\u003C/p\u003E\n\u003Cp\u003E\nPR - mainly the World\u0027s Firsts (probably the easiest ones). They grant you reputation only.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLet the discussion begin!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-19T00:42:46Z\u0022 title=\u002208/19/2016 12:42  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 19, 2016\u003C/time\u003E by Veeltch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2016-08-19T01:45:22Z","Content":"\n\u003Cp\u003E\nI\u0027ve proposed a similar idea: \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/94076-mun-duna-gillyect-program/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nI\u0027ll support anything that gives the player more control of their program. I don\u0027t like having to shuffle through contracts, declining until I get the ones I want, if I even do.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-08-19T12:41:13Z","Content":"\n\u003Cp\u003E\nAlso is there really anyone who does the grand voyage contracts? Who cares if you can slingshot from here to there in what order? It would be better to have two, or three different missions with similar objectives set (temperature around Jool, temperature around Eve, temperature around Eeloo) instead of one big thing that doesn\u0027t care about transfer windows and picks targets at random.\n\u003C/p\u003E\n"}]}