{"TopicId":146726,"ForumId":55,"TopicTitle":"Next Big Development: Fix the Fairings","CreatedByName":"Joeybafoey","CreatedById":156273,"CreatedDateTime":"2016-08-28T23:46:33Z","PageNum":1,"Articles":[{"CreatedByName":"Joeybafoey","CreatedById":156273,"CreatedDateTime":"2016-08-28T23:46:34Z","Content":"\n\u003Cp\u003E\nI don\u0027t know about anyone else, but I\u0027ve been having real issues with the stock fairings lately.\n\u003C/p\u003E\n\u003Cp\u003E\nFor one thing, they don\u0027t stage with action groups. If I have a pod (or something I want to save in case of emergency) under a fairing, and my action groups look like this Abort\u0026gt; \u003Cabbr title=\u0022Launch Escape System\u0022\u003ELES\u003C/abbr\u003E activate, Decoupler decouples, fairing jettisons. What will happen in case of emergency is this:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nI hit backspace\n\u003C/li\u003E\n\u003Cli\u003E\nEverything but the fairing jettison occurs\n\u003C/li\u003E\n\u003Cli\u003E\nMy crew pod gets smashed against the inside of the fairing and they die.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nWhich brings up my next point (kinda). After that, everything inside my fairing has been obliterated; my rocket is falling back down onto the space center; it lands on the grass; and... Everything but the fairing breaks and explodes. Fairings are needlessly strong. Don\u0027t you think that my launch escape system (homemade, it packs 300 Kn of thrust) should be able to crack that fairing open and carry my crew to safety? We like explosions don\u0027t we? Don\u0027t we want to see the fairing explode and crack into little pieces?\n\u003C/p\u003E\n\u003Cp\u003E\nThis last thing is much less urgent than the first two. It\u0027d be really cool if we had multiple textures for fairings. Stock, solid white, grey, some kind of ability to upload your own (maybe?) be able to add a flag and such. While still maintaining the ability to customize the shapes of your fairings, I\u0027d also like to see Procedural Fairings become stock.\n\u003C/p\u003E\n"},{"CreatedByName":"TheGuyNamedAlan","CreatedById":162058,"CreatedDateTime":"2016-08-29T06:15:58Z","Content":"\n\u003Cp\u003E\n @\u003Cspan\u003EJoeybafoey idk about ur problem. it doesn\u0027t really occur to me\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"EpicSpaceTroll139","CreatedById":162839,"CreatedDateTime":"2016-08-31T13:32:11Z","Content":"\n\u003Cp\u003E\nThat is a really peculiar problem. Perhaps try redoing the action group?\n\u003C/p\u003E\n\u003Cp\u003E\nOr reinstalling KSP?\n\u003C/p\u003E\n\u003Cp\u003E\nI have never seen that happen before\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-31T13:33:22Z\u0022 title=\u002208/31/2016 01:33  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 31, 2016\u003C/time\u003E by EpicSpaceTroll139\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Corona688","CreatedById":2511,"CreatedDateTime":"2016-08-31T15:29:59Z","Content":"\n\u003Cp\u003E\nFiring an engine inside the fairing should definitely auto-deploy it.  It\u0027d pressurize and explode.  Which is kind of how I\u0027d expect it to work when deployed intentionally, too-- blown open by a little \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E gas generator.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-31T15:31:50Z\u0022 title=\u002208/31/2016 03:31  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 31, 2016\u003C/time\u003E by Corona688\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Shadowmage","CreatedById":138730,"CreatedDateTime":"2016-08-31T15:55:50Z","Content":"\n\u003Cp\u003E\nI too have experience the \u0027fairing won\u0027t deploy through action groups\u0027 problem, and it was also with an LAS setup. \n\u003C/p\u003E\n\u003Cp\u003E\nBasically if the fairings were set to deploy in the same action group as the decoupling and activation of motors... all the actions would work fine except the fairings would not deploy.  So the decoupling happens, the motors activate... but the craft is stuck inside the fairing as it refused to deploy.\n\u003C/p\u003E\n\u003Cp\u003E\nSetting the fairings to a separate action group that is activated before the abort action group \u0027solved\u0027 the problem... however now the abort action group is much less useful (as you now need to remember to deploy fairings before pressing the abort button).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nPerhaps someone would like to put in a stock bug report on the problem?  I\u0027ll be glad to add in the details that I have encountered / the information that I\u0027ve found on the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nI believe the precise problem is likely \u0027Fairings will not deploy if command source is decoupled in same action group\u0027, or similar.  May be a generic problem that effects parts that are decoupled in the same action group as they are activated.  More testing would be needed.\n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-08-31T16:34:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222736959\u0022 data-ipsquote-contentid=\u0022146726\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221472658950\u0022 data-ipsquote-userid=\u0022138730\u0022 data-ipsquote-username=\u0022Shadowmage\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n47 minutes ago, Shadowmage said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI believe the precise problem is likely \u0027Fairings will not deploy if command source is decoupled in same action group\u0027, or similar.  May be a generic problem that effects parts that are decoupled in the same action group as they are activated.  More testing would be needed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust theorizing, that sounds like an order of operations issue.  If the command module is decoupled first then it runs it\u0027s checks to see if there is a command module before allowing the action groups... something of that nature.\n\u003C/p\u003E\n\u003Cp\u003E\nIf this is indeed the issue, the ideal fix would be to have radial decoupling occur a split second before stack decoupling when in the same action group.  (Unless there is a consequence I\u0027m not thinking of)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-31T16:43:37Z\u0022 title=\u002208/31/2016 04:43  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 31, 2016\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"}]}