{"TopicId":148581,"ForumId":55,"TopicTitle":"Please, do a round of balancing of parts....","CreatedByName":"Chris_2","CreatedById":63827,"CreatedDateTime":"2016-09-24T21:28:44Z","PageNum":1,"Articles":[{"CreatedByName":"Chris_2","CreatedById":63827,"CreatedDateTime":"2016-09-24T21:28:44Z","Content":"\n\u003Cp\u003E\nThis is a great suggestion. Please do a round of part-balancing. Mainly of the weights of structural parts.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example: The weight of a \u0022Rockomax Hubmax\u0022 (1.5Tonne) is WAY heavy compared to just a cross 3 \u0022structural fuselages\u0022 (0.1 Tonne each) and then provide the same function. Thus, I -never- use the Hubmax, but always use structural fuselages. Make the structural fuselage heavyer or the hub lighter.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI-Beams are way heavy too, compared to small octagonal struts... Thus I use -many- octagonal struts (only increasing part count) and I never ever have used an I-beam for anything... Oh yeah, and the octagonals have fuel crossfead too.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI can go on and on and on, but the mass of most parts make no sense...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-24T21:32:24Z\u0022 title=\u002209/24/2016 09:32  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 24, 2016\u003C/time\u003E by Chris_2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rath","CreatedById":138223,"CreatedDateTime":"2016-09-25T08:09:37Z","Content":"\n\u003Cp\u003E\nEven if it was better, I still would never use the hudmax, cause its so \u003Cem\u003Eugly\u003C/em\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"Chris_2","CreatedById":63827,"CreatedDateTime":"2016-09-25T13:46:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222773519\u0022 data-ipsquote-contentid=\u0022148581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474810961\u0022 data-ipsquote-userid=\u0022101028\u0022 data-ipsquote-username=\u0022WildLynx\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, WildLynx said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can use similar hub from Nertia\u0027s Stockalike Station Parts. It weights 1.25t and looks much better.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s not the point. I only play stock because I want to be able to share my crafts easily with other people. And the stock game should be balanced, and right now there are many parts that I never use because they are unbalanced. They should have done this balancing a long time ago because it will break existing crafts (at least change the performance of crafts)... So better get it over with as soon as possible.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, it\u0027s not a lot of work. I could come up with better part stats in a day or 2.... I really don\u0027t understand why they haven\u0027t done this. And things like this still make the game feel unfinished and \u0027beta\u0027. Should have been done before 1.0.....\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-09-25T13:49:12Z\u0022 title=\u002209/25/2016 01:49  PM\u0022 data-short=\u00227 yr\u0022\u003ESeptember 25, 2016\u003C/time\u003E by Chris_2\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2016-09-25T17:59:35Z","Content":"\n\u003Cp\u003E\nMost are fine but a few that really stand out are the crew pods...\n\u003C/p\u003E\n\u003Cp\u003E\nI think the devs should standardize the weights per kerbal on those pods.  Something like the MK1/MK2 cockpits are ~1t per kerbal, so the other parts should be similar to this.  The MK1-MK2 pod should be ~3t cause 3 kerbals, ect.  The lander cans (have low impact tolerances) should weigh a bit less then that, perhaps .6-.8t per kerbal, but the 2 seater can is so heavy it makes no sense (you would NEVER bring one of those unless you are building entirely for looks and dont care about efficiency, 2.6t for 2 kerbals and terrible impact tolerance).  Most of the pods are ok as they are, but the mk2 lander can and the 3 seater pod needs to be made lighter as it makes no sense to use those outside of the rare \u0022appearance\u0022 department (not that they even look very good cause outdated models).\n\u003C/p\u003E\n\u003Cp\u003E\nGirders and ibeams are fine (you are exchanging mass for impact tolerance), have you ever tried building armor out of those cubic struts, they utterly suck at protecting anything whereas it takes some pretty high firepower to bring down a ship made of ibeams and girders as armor plating...  Ofc combat isnt what most people like to do in KSP, but even something like landing, ibeams and girders make excellent landing legs for very heavy landers, the cubic struts, not so much.  Unlike the cockpits, these things actually have a good reason to be heavy.\n\u003C/p\u003E\n\u003Cp\u003E\nOtherwise, yeah, the hubmax is WAY too heavy for what it does as neither is it a strong part (low impact tolerance so forget landing on em), nor does it have any qualities that justify the weight.  Same can be said about the micronode which is in the same boat (at least that one makes a good impactor though for weaker weapons).\n\u003C/p\u003E\n\u003Cp\u003E\nHopefully with the game becoming more and more polished (after the rocket revamp we should have way less \u0022ugly\u0022 parts remaining), the devs will eventually take a good look at balancing parts over.  Until then, its mods or just playing the game as is and hoping for a fix later...\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-09-25T18:36:07Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222773835\u0022 data-ipsquote-contentid=\u0022148581\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221474826375\u0022 data-ipsquote-userid=\u002295108\u0022 data-ipsquote-username=\u0022panzer1b\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, panzer1b said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nI think the devs should standardize the weights per kerbal on those pods.  Something like the MK1/MK2 cockpits are ~1t per kerbal, so the other parts should be similar to this.  The MK1-MK2 pod should be ~3t cause 3 kerbals, ect.  The lander cans (have low impact tolerances) should weigh a bit less then that, perhaps .6-.8t per kerbal, but the 2 seater can is so heavy it makes no sense (you would NEVER bring one of those unless you are building entirely for looks and dont care about efficiency, 2.6t for 2 kerbals and terrible impact tolerance).  Most of the pods are ok as they are, but the mk2 lander can and the 3 seater pod needs to be made lighter as it makes no sense to use those outside of the rare \u0022appearance\u0022 department (not that they even look very good cause outdated models).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI dunno about standardizing on crew capacity alone; lift, heat and impact tolerance as well as storage for resources should play some part.\n\u003C/p\u003E\n\u003Cp\u003E\nThe 2-kerbal lander can and the 3-kerbal pod were buffed (in a manner of speaking) for 1.2: These pods can act as control endpoints for unmanned craft while the other pods cannot.\n\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2016-09-25T20:44:49Z","Content":"\n\u003Cp\u003E\nI expect balancing to happen with the rocket revamp.  Doing it now would be wasted effort (unless it\u0027s part of a 1.2 feature)\n\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2016-09-26T02:13:40Z","Content":"\n\u003Cp\u003E\nWell it should be noted that some parts are made in conjunction with career mode. So they may be heavier, but at the trade off of part count which unless you have level 3 \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E does impact your game. The opposite is true as well, if weight if your concern then you can increase part count if needed.\n\u003C/p\u003E\n"}]}