{"TopicId":149384,"ForumId":55,"TopicTitle":"Want \u0026quot;Mirrored Radial\u0026quot; symmetry mode","CreatedByName":"John Cochran","CreatedById":169262,"CreatedDateTime":"2016-10-06T15:07:10Z","PageNum":1,"Articles":[{"CreatedByName":"John Cochran","CreatedById":169262,"CreatedDateTime":"2016-10-06T15:07:10Z","Content":"\n\u003Cp\u003E\nI frequently build a simple rocket that uses two radially attached boosters and on those boosters, I attach some stabilization fins. I don\u0027t put the fins on the central booster since by the time the outer boosters are detached, the atmosphere is so thin that the fins no longer provide directional control and they\u0027re simply dead weight that ought to be jettisoned along with the boosters. The rocket is like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/hemO5VC.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/hemO5VC.png\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, placing the fins and the struts to brace those boosters is somewhat annoying and a \u0022mirrored radial\u0022 symmetry mode would make both easier and faster. Looking at the base of the rocket under construction, I have to place the reinforcing struts and fins twice to get what I desire.  Using 2 way radial symmetry, I place a strut and fin to get this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/Mr4xgI7.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Mr4xgI7.png\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I then manually attach another strut and fin to get the final rocket resulting in this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/AbaJZtt.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/AbaJZtt.png\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI imagine that a \u0022mirrored radial\u0022 symmetry mode would be defined as a normal radial symmetry to handle the 2,3,4,6,8 way symmetry and then mirror each attached item using bilateral symmetry on the attached parent object. Would be quite useful for adding struts to those radially attached objects as well as fins and other objects that you want to have symmetrically attached to substructures radially attached to a central parent. \n\u003C/p\u003E\n"},{"CreatedByName":"Jimmidii","CreatedById":9293,"CreatedDateTime":"2016-10-06T15:22:55Z","Content":"\n\u003Cp\u003E\nCould you create the boosters separately in radial mode, save them as a sub-assembly, then attach those sub-assemblies in mirror mode?\n\u003C/p\u003E\n"},{"CreatedByName":"John Cochran","CreatedById":169262,"CreatedDateTime":"2016-10-06T15:44:08Z","Content":"\n\u003Cp\u003E\nThat would kinda work, however there\u0027s still the struts. The issue isn\u0027t one of \u0022I can\u0027t do this\u0022 since obviously, I can. But rather, \u0022this symmetry mode makes building things easier\u0022. And since the symmetry modes at their very foundation is to make building things more convenient, I mention this as a possible addition. Also I kinda lied about how those fins and struts are constructed, I actually attach both fins to get what I want and then attach both struts. But\u0027s it\u0027s still a matter of attaching two things when I ought to be able to just make one attachment and be done with it. \n\u003C/p\u003E\n"},{"CreatedByName":"OrbitalBuzzsaw","CreatedById":158329,"CreatedDateTime":"2016-10-06T15:49:32Z","Content":"\n\u003Cp\u003E\nNice idea...\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-10-06T16:34:34Z","Content":"\n\u003Cp\u003E\nIf you build a single booster like the one shown in the dorsal or ventral location using mirror symmetry you can then remove and place that booster where you like with radial symmetry. Not as elegant as the \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E\u0027s suggestion but a passable workaround.\n\u003C/p\u003E\n"},{"CreatedByName":"StahnAileron","CreatedById":139783,"CreatedDateTime":"2016-10-06T16:41:32Z","Content":"\n\u003Cp\u003E\nI for one always wanted a Mirrored Radial, Double Mirror (Left/Right and Top/Bottom), and maybe Double Radial modes... Though really, a toggle for part-centric versus vessel-centric symmetry and whether to propagate part-centric symmetry would be just about as useful.\n\u003C/p\u003E\n"}]}