{"TopicId":149609,"ForumId":55,"TopicTitle":"Blueprints/Library/Design/R\u0026D area.","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-10-10T17:47:22Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2016-10-10T17:47:22Z","Content":"\n\u003Cp\u003E\nWhat about an area with all the stuff in the wiki(or the wiki linked) and the ability to make a model(non flying) of the craft to make blueprints. It would contain all info needed to make anything in the game(\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E) and when finished you take the blueprints to said building and make it with the blueprints. These blueprints would add markers and thing for location of said parts once they are added to the craft so you can get exact angles and positioning to do exact aircraft/rocket designs. The design area could have more exact and broader info to help design and see what you are doing. It could use things like the windtunnel or heat simulation ideas and other info added eventually to help both learn about and make aircraft work before flying. Then when flying it is actually a test and not an R\u0026amp;D function.\n\u003C/p\u003E\n\u003Cp\u003E\nThe creation and loading of blueprints could setup a framework version of the vessel to place in the given area to add to or even auto-load with said design. If building piece by piece you could add the part into the given predesign spot and build like normal starting from whichever part you placed first. Again, this would allow the placing of wings and other items in exact spot with exact snap-able positions and angles, etc. It would provide simple helping tools to make it exactly as you did in the R\u0026amp;D area.\n\u003C/p\u003E\n\u003Cp\u003E\nThis area would, as stated, also have more advanced measuring tools and things to see your craft and get structural info and knowledge in all areas of the existing game on how the craft work to see how it functions before flying so you can design it how you wish. this wold include angles and placement etc. Maybe more advanced wireframes for measurement etc(Adjustable, modifiable, loadable) that may or may not be too laggy in the normal buildings. Or in a dedicated room that has info to look up to help learn to make the craft before assembling it to try and fly it. There could be a storage of blueprints you could then load in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E to play with these craft. Maybe even things to help do a new variation of merging craft where you assemble them attached to the node. Or it could help also craft multipart or other more complex craft more easily.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-10T17:48:58Z\u0022 title=\u002210/10/2016 05:48  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 10, 2016\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"}]}