{"TopicId":150527,"ForumId":55,"TopicTitle":"Contracts and missions for the KSC Staff","CreatedByName":"XB-70A","CreatedById":144985,"CreatedDateTime":"2016-10-21T18:21:36Z","PageNum":1,"Articles":[{"CreatedByName":"XB-70A","CreatedById":144985,"CreatedDateTime":"2016-10-21T18:21:36Z","Content":"\n\u003Cp\u003E\nHi all,\n\u003C/p\u003E\n\u003Cp\u003E\nYesterday was terribly slow for me so I started to imagine and draw a biz-jet like aircraft for waiting and I was asking my-self, could it be interesting to accomplish some flights for the Kerbal Space Center staff? Without changing too much the mission control, could we make a special flight for von Kerman who needs to go to the Mun for research purpose (giving us more science points or unlocking new parts), or fly (the so hated) Mortimer to a site on Kerbin for business reasons? All of this could be accomplished as the tourists travel mission.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-10-21T20:46:50Z","Content":"\n\u003Cp\u003E\nWell, it\u0027s not that bad of an idea, but the problem is there\u0027s nowhere else to fly to other than \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E when we talk about jet planes. Also you don\u0027t send VIPs into space. Not until they pay you to do so. Anyway, it\u0027s better to have a well trained astronaut that is creative and physically suited for the job than old but smart people that know how to build rockets, not fly them.\n\u003C/p\u003E\n\u003Cp\u003E\nMore actually meaningful atmospheric missions wouldn\u0027t be bad to have though.\n\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2016-10-21T20:58:38Z","Content":"\n\u003Cp\u003E\nA nice idea, \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/39636-veeltch/\u0026amp;do=hovercard\u0022 data-mentionid=\u002239636\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/39636-veeltch/\u0022 rel=\u0022\u0022\u003E@Veeltch\u003C/a\u003E says pretty much my thoughts so I won\u0027t repeat.\n\u003C/p\u003E\n\u003Cp\u003E\nTo expand on it though what happens when the \u0027inevitable\u0027 happens? The \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E would need to recruit new staff to those senior posts, with a different name, look and personality, or assume they have a clone ready, waiting and gully trained, which would just seem a bit weird.\n\u003C/p\u003E\n"}]}