{"TopicId":151143,"ForumId":55,"TopicTitle":"Make relays available earlier in career","CreatedByName":"TwoThe","CreatedById":167385,"CreatedDateTime":"2016-10-30T12:07:27Z","PageNum":1,"Articles":[{"CreatedByName":"TwoThe","CreatedById":167385,"CreatedDateTime":"2016-10-30T12:07:27Z","Content":"\n\u003Cp\u003E\nI like the changes to the career mode research, it really spices up the early game and feels fitting. However the new antennas seem randomly placed, especially the relays.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first antenna is already sufficient to cover all of the Kerbin local planets at L2 of the tracking station, so there is no need to ever build a relay except for situations where planetary bodies block communication. Since relays are not available at that point the player is \u0022taught\u0022 to play the game without relays, and essentially you never need them if you don\u0027t want to. But if you do want to play the game this way, you sadly soon realize that relays are (more of less) pointless, because with the strategies you were forced to use on Minmus/Mun you can work your way through the other planets. I think it would be better to allow the player to develop alternate strategies earlier in the game, for example having relays setup prior to planetary missions, if someone likes to play the game that way.\n\u003C/p\u003E\n\u003Cp\u003E\nI suggest to add a RA-1 relay antenna with 500Mm range to the \u0022Flight Control\u0022 research node. This solves two issues: for once you now have a way to do a early, Kerbin local relay net if you want to. Also that research node gets a bit more attention, as currently it is rather useless for career.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-10-30T23:47:29Z","Content":"\n\u003Cp\u003E\nAh, yes. How I love being \u0022taught\u0022 and held by the hand every time I start a career game. Isn\u0027t that great? Thanks to that I don\u0027t even need to look at the tutorials (who does? Heh!). It\u0027s really nice having a proper tutorial mode. I don\u0027t need to worry about wheels or landing legs, or even ladders! Jeez, aren\u0027t they confusing? Thankfully the devs planned the tree layout really well so even people who have never seen a ladder can enjoy it.\n\u003C/p\u003E\n"},{"CreatedByName":"TwoThe","CreatedById":167385,"CreatedDateTime":"2016-10-31T16:19:09Z","Content":"\n\u003Cp\u003E\nThat is a game design term. It means that players are guided towards a certain goal, and in this case to solve flying around without having a relay net. The consequence is that players afterwards realize that the relay net is basically useless, because it is so easy to circumvent. Now the next time the player is playing he/she will not say \u0022Hey let\u0027s try it with a relay net this time\u0022 because it has been memorized as useless (at the time it was available). It should however be memorized as an alternate way to play the game, which can be done i.E. by making it available earlier, causing the player to think \u0022How would the game have been if I had gone this path instead of that path?\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-10-31T18:05:18Z","Content":"\n\u003Cp\u003E\nTwoThe is right here. It\u0027s a sort of training that people internalize without thinking about---the same is true of reward systems in games. People will unconsciously play the science=tech mini-game, for example, as well. \n\u003C/p\u003E\n\u003Cp\u003E\nThe relays should have been the low gain antennas, IMO. So that you\u0027d create a relay by adding a relay LGA to a craft with a HGA already installed, which makes more sense, because a relay is generally 2 antennas, not one.\n\u003C/p\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2016-10-31T19:29:23Z","Content":"\n\u003Cp\u003E\nI condone the absence of relays to teach having to deal with loss of signal.\u003Cbr\u003E\nIt taught me a great deal about the system all the while never giving me an interactive tutorial.\n\u003C/p\u003E\n\u003Cp\u003E\nThe relays, when finally unlocked, are then a convenience to be used in the future as a sort of quality of life part.\n\u003C/p\u003E\n"},{"CreatedByName":"TwoThe","CreatedById":167385,"CreatedDateTime":"2016-11-03T14:16:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222832163\u0022 data-ipsquote-contentid=\u0022151143\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477942163\u0022 data-ipsquote-userid=\u002221500\u0022 data-ipsquote-username=\u0022T-Bouw\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 31.10.2016 at 8:29 PM, T-Bouw said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI condone the absence of relays to teach having to deal with loss of signal.\u003Cbr\u003E\nIt taught me a great deal about the system all the while never giving me an interactive tutorial.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat lack of tutorial is another issue. I still don\u0027t really know when which numbers apply on the relay net, simply because the very first antenna already has 100% Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E coverage so there is nothing to worry about. And then suddenly all my plans to have a Kerbol relay failed, because 150Gm on L3 obviously doesn\u0027t mean the communication\u0027s range for relays. Lots of things to polish here. ^^\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-03T14:16:28Z\u0022 title=\u002211/03/2016 02:16  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 3, 2016\u003C/time\u003E by TwoThe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2016-11-03T19:23:04Z","Content":"\n\u003Cp\u003E\nYou hit a good point there.\u003Cbr\u003E\nRelays are in practice only necessary from Mün onwards.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, I still don\u0027t understand how the signals from the other end on Kerbin opposite the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E can reach it.\u003Cbr\u003E\nSome other (space)centers on Kerbin?\u003Cbr\u003E\nWill have to visit one of those positions the signal comes down at some day...\n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-11-03T22:18:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222836450\u0022 data-ipsquote-contentid=\u0022151143\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478182566\u0022 data-ipsquote-userid=\u0022167385\u0022 data-ipsquote-username=\u0022TwoThe\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, TwoThe said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n I still don\u0027t really know when which numbers apply on the relay net,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe problem is that the range depends on BOTH that antenna and whatever other antenna/tracking station it is trying to communicate with.  So ALL of the numbers apply at some point.\n\u003C/p\u003E\n"}]}