{"TopicId":151210,"ForumId":55,"TopicTitle":"Fairing Attachment Nodes","CreatedByName":"McQuacker","CreatedById":167833,"CreatedDateTime":"2016-10-31T10:06:20Z","PageNum":1,"Articles":[{"CreatedByName":"McQuacker","CreatedById":167833,"CreatedDateTime":"2016-10-31T10:06:20Z","Content":"\n\u003Cp\u003E\nSo the new 1.2 fairings have these five floating attachment nodes, automatically creating a support truss between the fairing base and whatever you\u0027re attaching it too. It certainly looks nice and works okay, BUT... When you\u0027ve created your satellite and placed a fairing, all non-occupied attachment nodes remain, floating around. Now when I want to add a new part to my satellite, it\u0027s very difficult to attach something to the actual satellite instead of to one of these attachment nodes. Sometimes they\u0027re nearly indistinguishable and I only notice I did it wrong when I\u0027m 60km off the ground and try to open the fairing - and half my satellite blows off.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe it would be possible to have all remaining floating nodes of the fairing disappear when you attach something to one of them?\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-10-31T12:06:10Z","Content":"\n\u003Cp\u003E\nBut what if you want to use more than one of them?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I think there is a toggle in the tweakables menu to hide the other nodes, though I don\u0027t recall if you need advanced tweakables turned on to use it. \n\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2016-10-31T12:29:09Z","Content":"\n\u003Cp\u003E\nI frequently make use of more than one of the payload nodes.  In fact, that\u0027s why there is more than one node... so you can \u003Cem\u003Euse \u003C/em\u003Emore than one.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter you finish attaching things to the payload nodes, just right-click the fairing base and turn off the payload nodes.  The previously attached items will still be attached, but all the unused nodes disappear.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-31T12:30:09Z\u0022 title=\u002210/31/2016 12:30  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 31, 2016\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2016-11-01T20:28:59Z","Content":"\n\u003Cp\u003E\nThe first time I noticed the attachment nodes was when I decoupled a satellite with a resource scanner on top and the satellite got stuck between the rocket body and the scanner. No scanning for me on that mission! So it sounds like I\u0027ve had the same problem as \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167833-mcquacker/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167833\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167833-mcquacker/\u0022 rel=\u0022\u0022\u003E@McQuacker\u003C/a\u003E\u003C/span\u003E and ever since then I\u0027ve turned the truss and nodes off.\n\u003C/p\u003E\n\u003Cp\u003E\nHaving automatic nodes inside fairings sounds like a good idea, I\u0027m just not sure how to use them yet.\n\u003C/p\u003E\n"},{"CreatedByName":"McQuacker","CreatedById":167833,"CreatedDateTime":"2016-11-02T08:06:14Z","Content":"\n\u003Cp\u003E\nI never noticed you could manually turn the extra nodes off! Thanks a lot guys - and my humble apologies to Squad for trying to blame them for the results of my own ignorance ;p.\n\u003C/p\u003E\n"}]}