{"TopicId":151311,"ForumId":55,"TopicTitle":"Contract and Tracking Station Suggestions/Balancing","CreatedByName":"Belgurath","CreatedById":54217,"CreatedDateTime":"2016-11-02T03:23:43Z","PageNum":1,"Articles":[{"CreatedByName":"Belgurath","CreatedById":54217,"CreatedDateTime":"2016-11-02T03:23:43Z","Content":"\n\u003Cp\u003E\nI have a whole big thing I wrote but lost to a cookie bug, so I\u0027ll summarize:\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003ESuggestion #1:\u003C/strong\u003E Please rework the contract weighting algorithm to be a matrix of contract types on one axis, and contract locations on the other with the weighting in the cells (not simply contract types as I believe it is now).  It would make the game a lot more \u003Cem\u003Eenjoyably\u003C/em\u003E playable if I could keep cancelling \u0022build a station orbiting the Sun\u0022 contracts and have fewer of them show up, but still get the same number of \u0022build a station orbiting the Mun\u0022 contracts (I also like shuttling passengers back and forth to Kerbin orbit and the Mun, even though they pay less than, say, Duna passenger missions, and I don\u0027t like that where I send my passengers at best totally random, and at worst determined semi-randomly by my reputation requiring that I sacrifice reputation to get contract locations I want).\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003ESuggestion #1.5:\u003C/strong\u003E An alternative to #1, or perhaps in addition to it, would be giving players the ability to write their own contracts, but then have a random chance (depending on reputation and/or number of successfully completed missions there already) that a company will offer to fund the job.\u003Cbr\u003E\u003Cbr\u003E\nEither way both ideas \u003Cstrong\u003E#1 \u003C/strong\u003Eand \u003Cstrong\u003E#1.5\u003C/strong\u003E are so players aren\u0027t railroaded into doing missions they don\u0027t necessarily want (in particular because of \u003Cem\u003Ewhere\u003C/em\u003E they are) or else forced to lose reputation by cancelling contracts left-and-right until the random generator happens upon the rare one they actually want.  I love contracts, and I do like \u003Cem\u003Esome\u003C/em\u003E randomness, but I still want a little more input into the contract selection/generation process than I\u0027m currently allowed, and I think changing the weighting type-list into a weighted type-location-matrix would be a huge improvement to me and other players.\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003ESuggestion #2:\u003C/strong\u003E Please \u003Cspan\u003Eadd more filters to the Tracking Station, specifically celestial body filters (I assume this would be relatively easy to implement since most of the code presumably already exists for filtering and adding new filters, the new celestial body ones though would just use a \u0022getSOI()\u0022 method instead of a \u0022getVesselType()\u0022 method to make their selections).  I love the filters that are already there, I think their functionality and what they do is absolutely perfect, I just want the additional ability to filter out missions I have idling on/around, say for example, the Mun so they\u0027re not cluttering up my Vessel list when I\u0027m in the middle of doing a bunch of maneuvering for a colonization flotilla during Jool-orbit insertion.\u003Cbr\u003E\u003Cbr\u003E\nThank you Squad and Devs for all your awesome work to make Kerbal, quite possibly my favorite game, a reality and your continued dedication, effort, and community engagement.  I think these suggestions would hopefully be easy to implement, and that they would definitely have a large and positive impact on the player experience.  Keep up the phenomenal work and I\u0027ll keep my fingers crossed that these suggestions are both easy enough to make and good enough for players that I might see them in a future version.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2016-11-02T04:01:45Z","Content":"\n\u003Cp\u003E\nSuggestion #1 has come up before, and IIRC that is already the case, Contracts are already weighted by type and location.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2016-11-02T08:26:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222834299\u0022 data-ipsquote-contentid=\u0022151311\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478059305\u0022 data-ipsquote-userid=\u002297860\u0022 data-ipsquote-username=\u0022Capt. Hunt\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Capt. Hunt said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSuggestion #1 has come up before, and IIRC that is already the case, Contracts are already weighted by type and location.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAre they? I haven\u0027t noticed.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway it would be nice to have some sort of control over what kind of contracts are generated. Either by giving us actual filters (like in Strategia mod) or an actual contracts creator.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are some contracts that really make me angry. And they don\u0027t go away as I thought they would. When I decline test contracts there are other ones that pop in their places. And I don\u0027t want to do any of them.\n\u003C/p\u003E\n"},{"CreatedByName":"Belgurath","CreatedById":54217,"CreatedDateTime":"2016-11-02T20:49:44Z","Content":"\n\u003Cp\u003E\n@Capt. Hunt I too think that it\u0027s partly already the case.  I know it weights by mission type already - I\u0027m 99% sure of that - but the location aspect (what I want) I don\u0027t recall hearing anything about before, let alone having been actually implemented.\n\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2016-11-03T16:25:02Z","Content":"\n\u003Cp\u003E\nIt takes a few rejections before contract types are excluded, but I\u0027m sure it pays attention to the location, because visiting a given location will spawn contracts for it.\n\u003C/p\u003E\n"}]}