{"TopicId":155362,"ForumId":55,"TopicTitle":"What if ... Vulkan support?","CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2017-01-21T17:09:14Z","PageNum":1,"Articles":[{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2017-01-21T17:09:14Z","Content":"\n\u003Cp\u003E\nSo I just discovered the existence of Vulkan, marketed as a replacement for OpenGL. The features sound incredibly exciting!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Vulkan_(API)\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Vulkan_(API)\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnity 5.6 will have official support for it. Would that mean KSP automatically supports it? Any 3D guru\u0027s around here?\n\u003C/p\u003E\n"},{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2017-01-21T20:27:47Z","Content":"\n\u003Cp\u003E\nThat would be nice. So would fermi support for vulkan. \u0026gt;\u0026lt; Us people with slightly smaller computers could use it alot! It would be cool if vulkan eventually allowed cross use of CPU and GPU to utilize the full system. Let alone mutli GPU use or something nice. I\u0027m not sure how much it should make possible though. It would be cool if one day mutli computer processing was made a reality also.\n\u003C/p\u003E\n\u003Cp\u003E\nWith how popular hand held devices became i don\u0027t know how being able to wirelessly or directly they didn\u0027t jump straight on co-processing so you could use computers in your home to aid in game playing or multiplayer games. Hand hend stuff would have been a thousand times more popular if they could work with you home computers. It\u0027s not like Mainframes or other similar systems and the coding for it aren\u0027t ancient or anything. All of the first computers were programmed like this if I\u0022m not mistaken. They should really get back to sound programming and let people utilize everything they have.\n\u003C/p\u003E\n\u003Cp\u003E\nIf those things were common already they could have made KSP playable on PC and handheld and cross proccessed over Main home computers with multiplayer by now potentially. The coding for lag would have been dealt with already en mass I\u0027d imagine. So much for forthought. I guess 70 years wasn\u0027t enough for greed and home pc development.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-21T20:34:19Z\u0022 title=\u002201/21/2017 08:34  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 21, 2017\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2017-01-22T19:47:35Z","Content":"\n\u003Cp\u003E\nThe most one can hope for is forcing Vulkan like we can DX11 and OpenGL, but the main incentive for doing those is memory reduction (no longer necessary for most systems with x64 executable) rather than taking advantage of any particular functionality, and it generally comes with glitches (mostly benign graphical ones, but potentially anything up to save corruption). However as I recall people have reported noticeable performance increases, so you never know; whether it\u0027s worth doing depends on how your system reacts.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-22T19:50:36Z\u0022 title=\u002201/22/2017 07:50  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 22, 2017\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"}]}