{"TopicId":156639,"ForumId":55,"TopicTitle":"Semi-futuristic technology","CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2017-02-18T15:52:38Z","PageNum":1,"Articles":[{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2017-02-18T15:52:38Z","Content":"\n\u003Cp\u003E\nSemi-futuristic technology would mostly include things that are hypothesized to work, or have already been proven to work but aren\u0027t yet being used enough to become a normal part of spaceflight. This \u003Cstrong\u003Ewouldn\u0027t \u003C/strong\u003Einclude things like hyperdrives, etc. It \u003Cstrong\u003Ewould \u003C/strong\u003Ehowever include things such as the EM drive, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nThe futuristic technology would be included on 2 nodes at the very end of the tech true. There would be an \u0027Advanced Propulsion\u0027 and an \u0027Advanced Science\u0027 node. Bother would cost twice as much as the current farthest research nodes in the game.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAdvanced Propulsion\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe advanced propulsion node (or AP for short) would include an EM Drive, Solar sail, and a Water-based Engine. As a sidenote, water would be abundantly available from mining on planets and moons.\n\u003C/p\u003E\n\u003Cp\u003E\nEM Drive: This would work similarly to an ion engine like the ones currently ingame. However, it would take up far more energy, take up no other resources besides ElectricCharge, and would have very low thrust, though still more than ion engines. It\u0027s cost and effect would be intended for late game missions, such as very long term bases, or even just a new challenge for end-game players.\n\u003C/p\u003E\n\u003Cp\u003E\nSolar Sail: The solar sail would travel \u003Cem\u003Eextremely \u003C/em\u003Eslow, take up a huge amount of space, but would require no propellants as long as it is exposed to sunlight and not being blocked by anything. An added bonus of them is that they would double as efficient solar panels.\n\u003C/p\u003E\n\u003Cp\u003E\nWater-based engine: This would use water as a fuel, however, it would be much less effective, though slightly cheaper than regular LiquidFuel. The upside, though is that this would be very abundant in space, so while being a bad option for short-term missions, it would be great for long term missions where you have a limited amount of liquidfuel to use. The ice drill to mine for water is available in the advanced science node.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAdvanced Science\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe advanced science node (or AS for short) would include a Supercapacitor, An ice drill, Cosmic Ray Sensor, and an infrared telescope.\n\u003C/p\u003E\n\u003Cp\u003E\nSupercapacitor: The supercapacitor would be a relatively small but extremely effective electricity storage made with graphene. It could be used to store lots of electriccharge in a smaller area, and be especially useful when paired with the EM Drive. The price however would be quite repetitive.\n\u003C/p\u003E\n\u003Cp\u003E\nIce Drill: The ice drill would specifically mine for water on planets or moons. Asteroids would have a varying amount, but generally would be quite rich in water. Different planets would have different amounts. Kerbin would have a lot, but with little purpose to mine it there, and Mun would have relatively little. Minmus would be extremely rich in water, Eve would have hardly any, Moho would only have traces at the poles, and Gilly would have a little bit, but not anything too noteworthy. Duna would have very little, Dres would be quite abundant in water, Jool would have none (obviously), and Eeloo would be extremely rich in ice, richer than any other body in the game. Back to Jool\u0027s moons, Laythe would have about as much as Kerbin for you to mine, although there still would not be much purpose due to the atmosphere. Vall would have a lot too, Tylo would be pretty scarce in ice, and finally, Bop and Pol would have relatively low amounts.\n\u003C/p\u003E\n\u003Cp\u003E\nCosmic Ray Sensor: This would simply be another science instrument. It would only be usable when far above a planet or moon or near Kerbol, but be most effective when you are either far above Kerbol, or far above a planet or moon. Regardless though, the science messages that they give would imply that they ignore the body they are around and just look. They would either be considered \u0022High above a planet\u0022 or \u0022High above the Sun\u0022, meaning that the science value would not really change from planet to planet. Therefore, it would be a very effective instrument, but only useable a few times before becoming obsolete.\n\u003C/p\u003E\n\u003Cp\u003E\nInfrared Telescope: This would have similar required conditions as the Cosmic Ray Sensor, and also look only into deep space. The big difference however, is that this would only be usable from around the Sun and no where else. If placed near the sun, the science logs would hint that the telescope generates an infrared image of the sun, or if far away from the sun, uses infrared light to map the universe. Both would deliver lots of science, but have a limited number of uses. These telescope would be large and very heavy, but each one you put into space would be able to collect it\u0027s own science, although the science value from these would slowly decrease after every telescope that you use. I.e the first telescope you put in would collect 500 science, the next one would collect 90% of that, and the one after that would collect 90% of the second telescope, and so on.\n\u003C/p\u003E\n"},{"CreatedByName":"Wjolcz","CreatedById":39636,"CreatedDateTime":"2017-02-18T16:58:24Z","Content":"\n\u003Cp\u003E\nEM Drive? I need to see it generate thrust in space first. Solar sails were discussed many times and were considered too slow and boring to play with. The ice drill and this water rocket thing is already kind of a thing in the form of \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nMore real life experiments? Yes, please. To the ones you mentioned I would add:\u003Cbr\u003E\n-Magnetometer\u003Cbr\u003E\n-Cameras and telescopes (visible, UV, infrared, microwave, microscopes, stereo, etc) \u0026lt;-this is how biomes should be detected IMO\u003Cbr\u003E\n-Robotic soil scoop\u003Cbr\u003E\n-Meteorological station\u003Cbr\u003E\n-Particle and dust detectors\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2017-02-18T19:27:47Z","Content":"\n\u003Cp\u003E\nWe have a huge amount of fantasy stuff already (cough \u0026lt;spaceplanes\u0026gt;).\n\u003C/p\u003E\n"},{"CreatedByName":"Scoutman1121","CreatedById":175081,"CreatedDateTime":"2017-02-18T23:54:48Z","Content":"\n\u003Cp\u003E\nSeems like this kind of stuff would be at the end of the tech tree.\n\u003C/p\u003E\n"},{"CreatedByName":"natsirt721","CreatedById":117557,"CreatedDateTime":"2017-02-19T07:43:52Z","Content":"\n\u003Cp\u003E\nEM drive is a reactionless drive, and as someone wiser than I once said, \u0022friends don\u0027t let friends use reactionless drives\u0022.  What is the point of exploring a single solar system if you can grind your way down the tech tree to buy one of these, then zip about the planets on your infinite impulse engine? \n\u003C/p\u003E\n\u003Cp\u003E\nI do like the idea of the water engine, as NTR\u0027s can definitely use propellants other than diatomic hydrogen.  Typically a higher molar mass means more thrust and less exhaust velocity, so water, carbon di- or monoxide, and diatomic oxygen would all be nice alternatives. Although blowing oxygen at 3000 degrees across any sort of material is not conducive to it maintaining structural integrity. But I digress. If you want more resources, there\u0027s a mod for that.\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2017-02-26T08:53:21Z","Content":"\n\u003Cp\u003E\nThe EM-drive is being researched irl from what i know, but it can only generate veeeery little thrust, and nobody knows if it actually generates thrust, soo yeah.\n\u003C/p\u003E\n"},{"CreatedByName":"Ryu Gemini","CreatedById":60653,"CreatedDateTime":"2017-03-06T21:19:03Z","Content":"\n\u003Cp\u003E\nRather than the solar sail, I would actually suggest the \u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EMagnetic Sail.\u003C/span\u003E  \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Magnetic_sail\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Magnetic_sail\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nUnlike the solar sail, it allows for some degree of control, but also requires a reasonable amount of power to use. \n\u003C/p\u003E\n\u003Cp\u003E\nTo keep things simple, you could have it just operate based on solar wind, and thus not do much of anything when inside the magnetic field of a planet (which we can say \u0022blocks\u0022 most of those particles).  This would require giving planets a single new value for \u0022magnetic field radius\u0022 if they don\u0027t already have one.  Naturally, it would also not work when the sun is blocked by a planet or other large body. \n\u003C/p\u003E\n\u003Cp\u003E\nWhile technically not completely realistic that it wouldn\u0027t work close to a magnetic planet, this would serve as a good balancing mechanic game-wise to prevent them from being an easy \u0022infinite \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E engine,\u0022 since you would then need something else to maneuver when near planets (so for gameplay, the sails would be among the most efficient engine for interplanetary travel, since they only require electricity and the sun, but you\u0027d need actual engines to change velocity when near planets with fields). \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNext, lets look at a power source: \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EFusion Power\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is actually something closer to realization than you might expect.  The next generation test reactor for the massive takomak design will be done by 2050ish or so, and is almost certain to break the limit of producing more power than it consumes to run. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/ITER\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/ITER\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, the Takomak design is quite large.  Too large, really, for spacecraft that fit the scale of KSP.  There are, however, other reactor designs being explored that are generally much smaller, including Lockheed\u0027s research and the Polywell design.  Some of these could even end up producing power before ITER finishes getting set up, if they pan out. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Lockheed_Martin_Compact_Fusion_Reactor\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Lockheed_Martin_Compact_Fusion_Reactor\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://en.wikipedia.org/wiki/Polywell\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Polywell\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMore importantly, these experimental designs would indeed be small enough to fit on spacecraft.  Possibly also real spacecraft.  But definitely the over-engineered mammoths we build in KSP. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGameplay-wise, these reactors would need to produce heat.  A fair amount of it.  Also, \u0022turning on\u0022 a fusion reactor should require a fairly large amount of power over a few seconds, before it starts producing energy.  So, any spacecraft that uses them needs to start them at launch and keep them running, or needs to maintain a fair bit of power storage so that it can start up the reactor itself. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThis leads me to one of my favorite things sci-fi settings actually got right by accident:  \u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EWings on spacecraft actually make sense.\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe reason people typically say wings make no sense is because there is no air.  However, this is actually the very reason they DO make sense.  As a means of heat dissipation.  \u003Cstrong\u003EHeat Radiation Wings\u003C/strong\u003E are a very reasonable thing to have in a vacuum where you need to get rid of excess heat produced by pretty much ANY futuristic or sci-fi power source, including fusion reactors.  You can\u0027t just dissipate it into air via some vents or something because, yeah, no air. \n\u003C/p\u003E\n\u003Cp\u003E\nIt even makes sense for these radiator wings to retain wing-like functions too, on any vessel that is expected to ever enter an atmosphere.  You already have a wing, may as well make some effort to have it function like one if need be.  Even in sci-fi settings where energy sources and propulsion of various types (even without worrying about FTL stuff like warp or hyperspace) result in ridiculously potential high \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E values, wings could be useful when in atmosphere if something went wrong.  Instead of falling to the ground, you would glide/fall with style, and could potentially survive the crash or have more time to get your power/propulsion back online. \n\u003C/p\u003E\n\u003Cp\u003E\nWings provide a large surface area to radiate heat from.  They also satisfy our desire for symmetry, and can perform other functions (such as acting like actual wings, and being a mounting surface for atmospheric control mechanisms like ailerons).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnother fun one is \u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EPlasma Ailerons.\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.pbs.org/wgbh/nova/next/space/plasma-air-control/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.pbs.org/wgbh/nova/next/space/plasma-air-control/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThey may actually be a better option for even EXISTING aircraft than mechanical ones.  They are less likely to have problems with some situations (including some KSP doesn\u0027t have like icing). They also look really cool.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe existence of fusion reactors could also lead to some interesting electrical engines. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:20px;\u0022\u003E\u003Cstrong\u003EElectric Jet Engine:\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFuel is used for jet engines because it has a much higher energy density than any form of batteries, and is more efficient than using fuel on a generator and then just using that to power an electric jet (although, technically the Turbofan engine is actually remarkably close to that, with the jet mostly just providing the necessary power to spin fans rather than producing thrust directly). \n\u003C/p\u003E\n\u003Cp\u003E\nSo with fusion reactors, electrical jets are a logical next step.  The benefit of the electrical jet is similar to electrical propellers or other electrical air-based engines:  You do not need oxygen to run them.  This would make them great for planets without oxygen, but which at least have a reasonably safe atmosphere (in KSP, they\u0027d be useful for any atmosphere other than Laythe and Kerbin, really). \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}