{"TopicId":158698,"ForumId":55,"TopicTitle":"New Maneuver Manipulation Handle","CreatedByName":"jonny","CreatedById":174981,"CreatedDateTime":"2017-04-04T16:42:34Z","PageNum":1,"Articles":[{"CreatedByName":"jonny","CreatedById":174981,"CreatedDateTime":"2017-04-04T16:42:34Z","Content":"\n\u003Cp\u003E\nAs the maneuver node system is a core element of KSP I think there can be some improvements:\n\u003C/p\u003E\n\u003Cp\u003E\nCurrently the system gives very minor information about a planned maneuver there is the direction indicator on the navball which is only useful to align the vessel, but not really for planning, the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E required which again is only useful for execution of the maneuver. The only information for planning a maneuver is the resulting orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nA very useful feature would be a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout for each standard direction (prograde, normal, ...) e.g. hovering with the mouse over the \u0022radial in\u0022 handle will show the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E in \u0022radial in\u0022 direction, like hovering with the mouse over \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E maker shows the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E height.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd there should be an visualization of the vectors in each of the standard directions. I think of arrows which scale in size depending on the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E in the particular direction. e.g. a maneuver with 30m/s \u0022retrograde\u0022 and 60m/s \u0022normal\u0022 creates a \u0022retrograde\u0022 arrow and a \u0022normal\u0022 arrow which is double the size of the retrograde one:\u003Cimg alt=\u0022L8mXAuM.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022http://i.imgur.com/L8mXAuM.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI think this will even help beginners to understand what the maneuver system does. And it will show if you are wasting \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E because you accidentally dragged the wrong handle.\n\u003C/p\u003E\n\u003Cp\u003E\nOf course a 5 m/s normal vector would be barely visible if the prograde vector is 1000 m/s. But this is ok because the 5 m/s normal vector would have a very small  impact on the resulting orbit and \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E requirement.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}