{"TopicId":158800,"ForumId":55,"TopicTitle":"Expansion Ratio","CreatedByName":"Skylon","CreatedById":175317,"CreatedDateTime":"2017-04-06T11:25:06Z","PageNum":1,"Articles":[{"CreatedByName":"Skylon","CreatedById":175317,"CreatedDateTime":"2017-04-06T11:25:06Z","Content":"\n\u003Cp\u003E\nLooking at the vacuum terrier and poodle engines, they seem to have a very low expansion ratio, and the lower isp engines have a larger expansion Ratio. Excuse me if I am wrong, but isn\u0027t that the opposite of how it works? The rhino seems to have it a bit better. Though on the thread: \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/147640-engines-revamp-thrust-and-performance-changes-discussion/\u0026amp;\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThe models seem to make more sense. I just want to see \u0027proper\u0027 expansion ratios, or different engine models that prove they are the proper sizes.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-06T12:13:15Z\u0022 title=\u002204/06/2017 12:13  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 6, 2017\u003C/time\u003E by Skylon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2017-04-06T11:48:08Z","Content":"\n\u003Cp\u003E\nBasically, yes you want a big bell when in vacuum and a smaller one in atmosphere. KSP pretty much has it the wrong way round. Engines were designed this way with little regard for real-life performance (KSP engines are pretty much magic anyway).\n\u003C/p\u003E\n\u003Cp\u003E\nI fully support the idea of having more realistic engine models, regarding expansion ratios, but mind that changing the size of engines for an update will most likely break many crafts. For this reason there are limits to how big nozzles can be made to fit in the current model. The Poodle uses a twin-nozzle design which allows to solve this problem, and removing powerheads from the models altogether could help gaining some space.\n\u003C/p\u003E\n\u003Cp\u003E\nEither way, I don\u0027t think a rocket engines revamp is still planned. Squad made it pretty clear they were putting it on hold for an indefinite time. If we\u0027re lucky we\u0027ll get it for 1.4 but not any earlier.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-06T11:51:39Z\u0022 title=\u002204/06/2017 11:51  AM\u0022 data-short=\u00227 yr\u0022\u003EApril 6, 2017\u003C/time\u003E by Gaarst\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Skylon","CreatedById":175317,"CreatedDateTime":"2017-04-06T12:14:18Z","Content":"\n\u003Cp\u003E\nOkay, thanks for confirming. And yes, I can imagine why they wouldn\u0027t want to implement this too soon\n\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2017-04-06T12:25:30Z","Content":"\n\u003Cp\u003E\nYeah.  One of a few artistic projects that should have been done before the 1.0 moniker.\n\u003C/p\u003E\n"},{"CreatedByName":"Razorforce7","CreatedById":94677,"CreatedDateTime":"2017-04-06T12:35:31Z","Content":"\n\u003Cp\u003E\n@Gaarst I\u0027m not even going to assume they will go for the Revamp, If they were to do that it would be like saying, \u0022Hey folks. We made you your game, but you now all have to start over because we need to remake it\u0022\u003Cbr\u003E\nStill I think we can get away with it by adding it later. V1.4.... maybe. Perhaps in a futuristic KsP 2.0. If they were to do it now people would complain. Usually by doing such things later you can get away by argumenting that the game will get a large overhaul to meet some modern gaming standards and then you can put a 2.0 sticker on it.\u003Cbr\u003E\u003Cbr\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/175317-skylon/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022175317\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/175317-skylon/\u0022 rel=\u0022\u0022\u003E@Skylon\u003C/a\u003E I to hope this will happen one day though. And thus I hereby support the idea. But I\u0027m quite sure your going to be stuck with the current Revamp mod.\n\u003C/p\u003E\n"}]}