{"TopicId":160357,"ForumId":55,"TopicTitle":"What would you like to see added to KSP?","CreatedByName":"DarkOwl57","CreatedById":161624,"CreatedDateTime":"2017-05-08T14:19:14Z","PageNum":2,"Articles":[{"CreatedByName":"lexicutioner","CreatedById":174279,"CreatedDateTime":"2017-05-22T21:50:34Z","Content":"\n\u003Cp\u003E\nwhat about wind so like its more realistic. like say if youve got a strong breeze blowing agaisnt you its easier to gain altitude and all\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2017-05-22T23:09:40Z","Content":"\n\u003Cp\u003E\nYes broken record here....\n\u003C/p\u003E\n\u003Cp\u003E\nBut time should keep slipping into the future. As a start but other time mechanics would be good as well, even if they have been basically completely ruled out.  I\u0027d rather see paradoxical separate time lines for missions so we can plan by play and still have the tycoon challenge be challenging.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TheDeathBrawler","CreatedById":178003,"CreatedDateTime":"2017-05-23T00:03:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223049081\u0022 data-ipsquote-contentid=\u0022160357\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221494253154\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/8/2017 at 7:19 AM, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo the title speaks for itself. Want new parts? Want more facilities? Want..... Something that I can\u0027t think of because it\u0027s a Monday? Put it here!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d like to see more rover parts. As well as maybe a better way to test rovers. (Maybe a track?) \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat I do want to see is not in Kerbal Space Program PC, but for the Xbox Kerbal Space Program. This is more of a question. Is there a development of mods for Xbox? And if not, will there be?\n\u003C/p\u003E\n"},{"CreatedByName":"DeltaDizzy","CreatedById":150755,"CreatedDateTime":"2017-05-23T04:05:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223049120\u0022 data-ipsquote-contentid=\u0022160357\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221494255087\u0022 data-ipsquote-userid=\u0022161624\u0022 data-ipsquote-username=\u0022DarkOwl57\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/8/2017 at 9:51 AM, DarkOwl57 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOr like you fly the mission once, the AI tracks what you do, and then it says \u0022Okay, so this is what I have to do from now on\u0022 And just replicates your moves? \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAs someone one said, \u0022There\u0027s a mod for that\u0022. But this is probably to add into stock isn\u0027t it.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223049113\u0022 data-ipsquote-contentid=\u0022160357\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221494254435\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/8/2017 at 9:40 AM, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n3. Some kerbal autonomy in 2 forms:---the ability for kerbals to do stuff themselves on EVA. Walk (or float on a tether in space), doing stuff vaguely appropriate to their specialty (collect samples, examine the craft, and the pilots\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSee above\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2017-05-23T04:12:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223064832\u0022 data-ipsquote-contentid=\u0022160357\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495512357\u0022 data-ipsquote-userid=\u0022150755\u0022 data-ipsquote-username=\u0022DeltaDizzy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, DeltaDizzy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs someone one said, \u0022There\u0027s a mod for that\u0022. But this is probably to add into stock isn\u0027t it.\n\u003C/p\u003E\n\u003Cp\u003E\nSee above\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s a mod where kerbals EVA as NPCs out of focus?\n\u003C/p\u003E\n"},{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2017-05-23T13:36:10Z","Content":"\n\u003Cp\u003E\nAm I the only one who wants more aircraft parts? More specifically \u0027large\u0027 or what I like to call \u0027Rokomax\u0027 size parts. The old Mk3s used to be this, but they werent very circular, or adabtable. I mean, theres just a huge gap in aircraft parts between the Mk2 and Mk3, and there arent any aircraft parts for that size yet sooooooo...\n\u003C/p\u003E\n"},{"CreatedByName":"Nothalogh","CreatedById":139345,"CreatedDateTime":"2017-05-23T20:35:37Z","Content":"\n\u003Cp\u003E\nUltra high power \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for vehicles weighing a thousand tons are sorely needed\n\u003C/p\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2017-05-25T14:50:26Z","Content":"\n\u003Cp\u003E\nMultiplayer, that is still promised as a thing on Q\u0026amp;A\n\u003C/p\u003E\n"},{"CreatedByName":"MultiFrapser","CreatedById":51045,"CreatedDateTime":"2017-05-31T14:44:59Z","Content":"\n\u003Cp\u003E\nI\u0027d like to see wind physics on ships and aircraft\u0027s. I actually technically experienced a wind/storm physic in KSP yesterday when I landed at the North Pole, I know there is this bug where you keep stalling and drifting if flying too close to the central point of the North Pole, but it felt like a very strong blizzard hit me since I had a very hard time landing the aircraft in a straight line with my huge heavy transport aircraft.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother thing I\u0027d love to see is clouds and dust storms in planets like Duna. Yes I know there is the scatterer mod but still.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd finally but not least, seasons. In summer it\u0027d be hot in the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E side of the planet and in winter it would be cold or colder.\n\u003C/p\u003E\n"},{"CreatedByName":"The Flying Kerbal","CreatedById":171547,"CreatedDateTime":"2017-05-31T15:03:48Z","Content":"\n\u003Cp\u003E\nI\u0027m really very happy with what I\u0027ve got in KSP 1.2 (didn\u0027t upgrade to 1.3 - don\u0027t want to risk damaging my current career game), so if it was never improved again I wouldn\u0027t complain.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever in a different thread someone said how they would like what can be seen of the other planets and moons in the Kerbol system being restricted to grainy and out of focus \u0022telescopic images\u0022 until they had been explored using probes, etc.  If this was to ever happen, which does sound like an awful lot of fun, then I would also like to see cameras being added to science so our probes could send back images of what they see.\n\u003C/p\u003E\n\u003Cp\u003E\nFor some reason I always imagine these \u0022photos\u0022 coming back to Mission Control in form of them being printed line by line from the top of the monitor to the bottom, a bit like how I suspect they would have been received back in the 60\u0027s when the USSR and NASA were doing this sort of thing.\n\u003C/p\u003E\n\u003Cp\u003E\nAs I\u0027ve said just a few moments ago though, I think we already have a really fantastic game and can\u0027t put into words just how much enjoyment I\u0027m getting out of it, especially now as I\u0027ve finally figured out how to get more rockets into orbit, instead of blowing up mid-flight and showering down like confetti all over the good planet Kerbin.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-31T15:22:10Z\u0022 title=\u002205/31/2017 03:22  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 31, 2017\u003C/time\u003E by The Flying Kerbal\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ReconXPanzer","CreatedById":58089,"CreatedDateTime":"2017-05-31T21:41:25Z","Content":"\n\u003Cp\u003E\nWell for me theres a whole mess of things - here\u0027s my complete list. Pretty much suggestions for parts, I\u0027d love to see structural parts get some love, things like procedural triangular panels. Plus having more cockpit functionality (the MFDs on the larger cockpits) as well as things like interiors where you can walk around. I would welcome a new solar system and atmospheric effects (providing there was a proper editor/options for it).\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/161274-my-complete-master-wishlist/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DeltaDizzy","CreatedById":150755,"CreatedDateTime":"2017-06-01T06:59:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223064838\u0022 data-ipsquote-contentid=\u0022160357\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495512725\u0022 data-ipsquote-userid=\u0022119411\u0022 data-ipsquote-username=\u0022tater\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/22/2017 at 11:12 PM, tater said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere\u0027s a mod where kerbals EVA as NPCs out of focus?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEVA Follower\n\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2017-06-01T13:00:06Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150755-deltadizzy/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022150755\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/150755-deltadizzy/\u0022 rel=\u0022\u0022\u003E@DeltaDizzy\u003C/a\u003E, that\u0027s cool looking, but not what I asked for. By themselves... that means no player involvement at all.\n\u003C/p\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2017-06-01T15:46:52Z","Content":"\n\u003Cp\u003E\nWhat would I like to see added to KSP? In a word - immersion. Which is a bit of a nebulous concept so let me give some examples of things I\u0027d like to add to improve immersion. Usual caveat applies to any of these suggestions that can be implemented through existing mods - I don\u0027t care and would like to see them in the stock game anyway.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Sound design. Long due for an overhaul. If I\u0027m launching a rocket I want it to sound like a rocket rather than a toddler blowing an extended raspberry. If I\u0027m in space then no sounds please unless I\u0027m flying in IVA mode. Then let\u0027s have some decent background noises - coolant pumps, fans, \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters firing etc. Bonus points if those thrusters sound louder from inside a Mk1 lander can than a Mk1-2 capsule.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Launch effects. RealPlumes or something similar please. Stock SRBs aren\u0027t too bad but the current stock graphics for liquid fuelled engines are massively underwhelming. The Mainsail allegedly has enough power to rival small nations - it sure doesn\u0027t look like it.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Contracts. Let me put faces to names here. What does the CEO of Rockomax actually look like? It would be nice to have  Civ style talking heads for the various companies. Also - lets have some background info on these companies, even if that\u0027s only cosmetic. Better yet make that info easily moddable (including an option to delete them) for those that get bent out of shape by the mere mention of \u0027story\u0027 in-game.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Accepting that KSP is unlikely to ever have an official background story, at least give us the tools to create our own. Give us Final Frontier style service logs for our kerbonauts. Have the Companies actually react to what we do in-game. If I muck up a string of contracts for Rockomax, let\u0027s have that talking head CEO I mentioned above, get more and more grumpy. If I fail a contract for one of the smaller companies, maybe they go bust. \n\u003C/p\u003E\n\u003Cp\u003E\n5. If I\u0027m running Kerbin\u0027s first space program (which I clearly am because I\u0027m racking up a string of world firsts) then what were all these companies doing before I came along? Why not have companies spawn (for want of a better word) and grow, depending on how I run my space program. Give them some history and update that history depending on what I do.\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe Probodobodyne start off as two telecoms engineers working for another company. Inspired by your first Duna probe, they decide they want to found their own satellite company. Probodobodyne then spawns as a contract provider and starts offering satellite related contracts. Bonus points if those contracts happen in any sort of logical progression. Maybe the Comsat market has been largely cornered by another company, so Probodobodyne decide to contract you to set up their spiffy Munar mapping cluster. Then they progress to offering you targeted landing missions to drop their ore detecting landers at strategic spots. Assuming you choose to do that for them, they team up with another company to build mining facilities - and start offering appropriate contracts for those.\n\u003C/p\u003E\n\u003Cp\u003E\nTL: DR - make me believe there\u0027s more to Kerbin than a field, a handful of buildings and a string of random requests from Gene.\n\u003C/p\u003E\n"},{"CreatedByName":"322997am","CreatedById":146422,"CreatedDateTime":"2017-06-02T00:13:41Z","Content":"\n\u003Cp\u003E\nI want to see physics added that could make for some really cool KSp mission reports/ image stories. Like giving Kerbals actual inertia, as they have the mass of a midget, but the drag of a boat. So you can\u0027t walk around on moving ships, and the wings of planes. Like I just made an \u0022airbase\u0022 which is a runway flying in the air. It is a cool design, and planes can dock(bless you \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E) and kerbals can transfer, but they can\u0027t walk around on the plane and maintenance the planes with \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/KÄS STUFF\n\u003C/p\u003E\n"},{"CreatedByName":"Reusables","CreatedById":179182,"CreatedDateTime":"2017-06-02T10:45:16Z","Content":"\n\u003Cp\u003E\nI\u0027d like to have these features:\n\u003C/p\u003E\n\u003Cp\u003E\nOptional \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E/\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E readouts with customizable settings.\n\u003C/p\u003E\n\u003Cp\u003E\nProcedural Terrain Decorations. (in small scale) - seamless; grass, rocks, etc)\n\u003C/p\u003E\n\u003Cp\u003E\nPer-planet/biome effects. (Dirt particles on impact, walking/sprinting/(wheel)rolling/dragging, etc.)\n\u003C/p\u003E\n\u003Cp\u003E\nMuch more readable \u0026amp; interactive actions for \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, tiny objects to feel the scale.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-02T10:45:34Z\u0022 title=\u002206/02/2017 10:45  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 2, 2017\u003C/time\u003E by Reusables\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"felcas","CreatedById":178312,"CreatedDateTime":"2017-06-03T23:49:25Z","Content":"\n\u003Cp\u003E\nPROCEDURAL GENERATE WORLD - Outerra or similar.\n\u003C/p\u003E\n\u003Cp\u003E\nI created a topic out of this.\n\u003C/p\u003E\n\u003Cp\u003E\nCheck out this to understand.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.outerra.com/index.php?topic=3062.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://forum.outerra.com/index.php?topic=3062.0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.outerra.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.outerra.com/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nA recording system that would allow me to review the entire mission from different aspects without the need to worry about piloting. Also a bunch of tools to help create nice videos.\n\u003C/p\u003E\n"},{"CreatedByName":"sardaukar11","CreatedById":78648,"CreatedDateTime":"2017-06-06T20:25:07Z","Content":"\n\u003Cp\u003E\nI would like to see climate effects in the worlds with atmosphere, like the mod that adds sandstorms to duna, add things like that, rain in kerbin and similar things \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Thinking Potato Gamer","CreatedById":176199,"CreatedDateTime":"2017-06-07T18:07:06Z","Content":"\n\u003Cp\u003E\nHonestly there are only 2 things I wanted to see added: New parts, mostly plane and 2.5m parts, and new planets, hopefully Duna like planets with terrain diversity like Kerbin. \n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2017-06-11T13:30:27Z","Content":"\n\u003Cp\u003E\nWhat I\u0027d really like to see is 1.875m parts. That way the boosters would look right on shuttles, we could have correct layer- caking on Saturn replicas, 2 kerbal \u0022gemini\u0022 capsules (good for early career without resorting to probe cores), 2 kerbal landers, etc.\n\u003C/p\u003E\n\u003Cp\u003E\n I know \u0022there are mods for this\u0022, but I believe it should be stock.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2017-06-11T14:38:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223087867\u0022 data-ipsquote-contentid=\u0022160357\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221497187827\u0022 data-ipsquote-userid=\u0022111526\u0022 data-ipsquote-username=\u0022GoSlash27\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, GoSlash27 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I\u0027d really like to see is 1.875m parts. That way the boosters would look right on shuttles, we could have correct layer- caking on Saturn replicas, 2 kerbal \u0022gemini\u0022 capsules (good for early career without resorting to probe cores), 2 kerbal landers, etc.\n\u003C/p\u003E\n\u003Cp\u003E\n I know \u0022there are mods for this\u0022, but I believe it should be stock.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111526-goslash27/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111526\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111526-goslash27/\u0022 rel=\u0022\u0022\u003E@GoSlash27\u003C/a\u003E i never would have thought you were a man that would find aesthetics important for its crafts.\n\u003C/p\u003E\n\u003Cp\u003E\nmost of your designs excel in efficiency and minimalism.\n\u003C/p\u003E\n\u003Cp\u003E\ni hope i didn\u0027t offend you in any way cause your designs usally rock!:)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-11T14:39:12Z\u0022 title=\u002206/11/2017 02:39  PM\u0022 data-short=\u00227 yr\u0022\u003EJune 11, 2017\u003C/time\u003E by xendelaar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"adsii1970","CreatedById":89014,"CreatedDateTime":"2017-06-11T14:58:03Z","Content":"\n\u003Cp\u003E\nI would like to see a \u0022search bar\u0022 added so you can search your kerbalnaut roster for that ONE Kerman...\n\u003C/p\u003E\n"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-06-11T15:29:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223076329\u0022 data-ipsquote-contentid=\u0022160357\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496332012\u0022 data-ipsquote-userid=\u002261025\u0022 data-ipsquote-username=\u0022KSK\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn ‎6‎/‎1‎/‎2017 at 11:46 AM, KSK said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n3. Contracts. Let me put faces to names here. What does the CEO of Rockomax actually look like? It would be nice to have  Civ style talking heads for the various companies. Also - lets have some background info on these companies, even if that\u0027s only cosmetic. Better yet make that info easily moddable (including an option to delete them) for those that get bent out of shape by the mere mention of \u0027story\u0027 in-game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nif you click the logo for the company offering you the contract, it will tell you a few things about them, some have things like \u0022get this done yesterday\u0022 or a basic description\n\u003C/p\u003E\n\u003Cp\u003E\nit MIGHT be Contract Configurator, but I haven\u0027t checked\n\u003C/p\u003E\n"},{"CreatedByName":"Stevie_D","CreatedById":103007,"CreatedDateTime":"2017-06-11T16:02:22Z","Content":"\n\u003Cp\u003E\nI would love it if Squad did as Paradox does, and just add a few of the more essential mods as base game functions. Kerbal Alarm Clock is so essential when you first learn the game to understand interplanet transfers, i can never understand why it hasn\u0027t been made stock years ago.\n\u003C/p\u003E\n"},{"CreatedByName":"Cabbink","CreatedById":176924,"CreatedDateTime":"2017-06-11T21:07:40Z","Content":"\n\u003Cp\u003E\nWeather. Hands down. That with the \u003Cabbr title=\u0022Environmental Visual Enhancement (mod)\u0022\u003EEVE\u003C/abbr\u003E Mod would be awesome. Imagine having to fly in rainy weather, or flying your rocket and being struck by lightning. I also Kind of want Gas Giant 2. That would be cool.\n\u003C/p\u003E\n"}]}