{"TopicId":176994,"ForumId":55,"TopicTitle":"Improved descriptions for several stock parts","CreatedByName":"ariscol","CreatedById":170688,"CreatedDateTime":"2018-07-24T06:44:05Z","PageNum":1,"Articles":[{"CreatedByName":"ariscol","CreatedById":170688,"CreatedDateTime":"2018-07-24T06:44:05Z","Content":"\n\u003Col\u003E\u003Cli\u003E\nI LOVE this game\n\u003C/li\u003E\n\u003Cli\u003E\nI LOVE that there is a vibrant, active community that provides help, mods, ideas, etc.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nNotwithstanding, I feel like the game could be more welcoming to new players, especially the sort of people that don\u0027t want to turn to google to figure out how to use that cool new part they just unlocked. I feel like there are some parts that could use a little retooling in their part description in order to give the player a better idea of what the part was intended for and how to use it. Also, I get that the funny flavor text in the descriptions is a fun quirk of the game that plays into the overall feel of the game (and I like it!), but it often gets in the way of communicating what the part does. Below are some specific examples of what I mean:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n\u003Cstrong\u003ES1 \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E-KD25k \u0022Kickback\u0022 Solid Fuel Booster\u003C/strong\u003E - The description here talks about it being designed to be recovered. This is misleading. As a beginner, I was really confused about how that was supposed to work...\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cb\u003EKerbodyne KE-1 \u0022Mastodon\u0022 Liquid Fuel Engine\u003C/b\u003E - The description touts this engine as a \u0022behemoth\u0022, and the pinnacle of power...huh? it\u0027s neither the biggest, strongest, most efficient, heaviest....what? My guess is that this engine shines when clustered with the new \u0022Engine Plates\u0022? Dunno. The description leaves everything up to imagination, and trial and error. Without \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readouts, that is probably beyond the average player?\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EThe Not-Rockomax Micronode\u003C/strong\u003E - The description (and even the name itself) makes reference to the Rockomax Multi-Point Connector, and I get that it\u0027s (sorta?) funny, but I feel like there\u0027d be value in clarifying that it is simply a smaller (and squarier) version of a structural piece with connection nodes on all 6 sides instead of 2. And while we\u0027re on this topic, I\u0027ve built a lot of crap and never used one of these, because cubic octagonal struts work just as well (often better), for a small fraction of the mass. So, what\u0027s this part good for??\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESP-R06 through SP-R25\u003C/strong\u003E - Given the way the thumbnail image looks, it\u0027d be nice if the description clearly indicated that these are \u003Cem\u003Eequilateral\u003C/em\u003E triangles of varying sizes.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESP-T06 through SP-T25\u003C/strong\u003E - Given the way the thumbnail image looks, it\u0027d be nice if the description clearly indicated that these are \u003Cem\u003Eright\u003C/em\u003E triangles of varying sizes.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESmall Hardpoint \u0026amp; Structural Pylon\u003C/strong\u003E - 1) Why are these parts not categorized under \u0022Couplers\u0022? 2) Why are these two parts named completely differently, despite being different only in size?\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ESPS-06 through SP-S25 vs. M-1x1 \u0026amp; M-2x2\u003C/strong\u003E - I guess it\u0027s cool that we got \u0022better\u0022 parts in the expansion, but why are the new square plates half the weight of the old ones? Nothing in the description offers any guess as to why one might choose the M-1x1 or M-2x2\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EInflatable Airlock\u003C/strong\u003E - What is this for? My thought is that compared to structural tubes with regular docking ports, I guess they make light and aerodynamic connectors for surface bases or orbital stations? I don\u0027t get it. As far as I can tell, it only docks with other Inflatable Airlocks, and it doesn\u0027t do any sort of flexing to aid with surface docking...I feel like the description here should offer an idea for a use case...?\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EAerodynamic Nose Cone vs. Advanced Nose Cone - Type A\u003C/strong\u003E - Nothing in the description makes it clear if the Advanced Nose Cone - Type A is supposed to be a clear upgrade for the Aerodynamic Nose Cone, i.e. is the aerodynamic improvement worth more than twice the mass? Even figuring that out for Kerbin alone would be a painstaking chore.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EProtective Rocket Nose Cone Mk7 \u003C/strong\u003E- This thing is heavy, and it\u0027s unclear whether using it is advantageous or not. I honestly don\u0027t know the answer to that. I often use it for aesthetics, but I\u0027ve never been sure if that resulted in a net loss of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for a launch from Kerbin. Am I the only one that wonders these things?\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EEngine Nacelle vs. Engine Pre-cooler\u003C/strong\u003E - Again, it\u0027s really unclear which of these is better, or if there are factors that make the answer \u0022neither\u0022. Furthermore, and even more frustratingly, it\u0027s completely unclear whether these are supposed to be \u0022better\u0022 than simply using the other air intakes. The description is silent on the details...\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EAir Intakes, in general\u003C/strong\u003E - What the heck is effective base speed? Is higher better? Why? Intake Area? Amount? Mass? It\u0027s completely unclear how to appropriately design air intake based on the information provided in the \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERovemax Model S2\u003C/strong\u003E - The description on the S2 here seems off, considering that you unlock it way before the M1.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EWheels, in general\u003C/strong\u003E - In the advanced tweakables, Friction Control and Traction Control...Can we get tooltips for tweakables, or something? It\u0027s not clear how these ones work unless you do a bunch of experimentation (or googling).\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ERadiator Panels vs. Thermal Control Systems\u003C/strong\u003E - It\u0027s obvious that TCSs turn to keep the sun off of them, but what is less clear is whether being in direct sunlight makes a Radiator Panel less effective or completely ineffective. A little help with the virtues or drawbacks of these two types of parts would really help in deciding which one to use.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EHG-5 High Gain Antenna \u003C/strong\u003E- Based on the description, one gathers that this is a very special antenna because it is both direct AND relay. This is the only stock antenna that says anything along these lines. However, the \u0022Antenna Type\u0022 is listed as simply \u0022Relay\u0022. It would be nice to clear up that discrepancy.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003ECrew Cabins, in general\u003C/strong\u003E - the Mk1 and MK2 (casing problem?) crew cabins are both .5t per kerbal. The Mk3 is better at .4t per kerbal. And then we have the PPD-10 Hitchhiker Storage Container (which is the most commonly desired shape, by far, for me) at a lousy .625t per kerbal. I can\u0027t fathom why this would be. There\u0027s no benefit that I\u0027m aware of that would explain or offset the extra mass of the PPD-10...what gives?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThere are probably several more opportunities for improvement. I gleaned this list during a single run through the parts list as I jotted down the ones that jumped out at me. I realize that these are really nitpicky things, but I imagine that they\u0027re also really simple to address...? Of course, if things are the way they are by design, fine, I could live with that, but it\u0027d be easier with a little explanation \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-07-24T15:53:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421165\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532414645\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ES1 \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E-KD25k \u0022Kickback\u0022 Solid Fuel Booster\u003C/strong\u003E - The description here talks about it being designed to be recovered. This is misleading. As a beginner, I was really confused about how that was supposed to work...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah... I think this is symptomatic of a general issue with the parts descriptions.  From a design perspective:  if you\u0027ve got a big free-form text box where you can say whatever you want about a part, you\u0027ve got a couple of options.  You can write \u0022in character\u0022 (i.e. as if you\u0027re a kerbal writing about a \u0022real\u0022 product on Kerbin)... or you can write from the \u003Cem\u003E\u003Cu\u003Eplayer\u0027s\u003C/u\u003E\u003C/em\u003E perspective, i.e. a simple matter-of-fact description of how the part works, any gotchas, etc.\n\u003C/p\u003E\n\u003Cp\u003E\nThe former is \u0022cuter\u0022 and adds more \u0022color\u0022 to the game.  The latter is of more practical use to the player.  But really, they\u0027re apples and oranges-- they serve very different purposes.\n\u003C/p\u003E\n\u003Cp\u003E\nI think where KSP kinda runs into awkwardness is that it sort of tries to have its cake and eat it, too:  they\u0027ve written everything in the role-playing \u0022color\u0022 mode... but they \u003Cem\u003E\u003Cu\u003Ealso\u003C/u\u003E\u003C/em\u003E try to provide some sort of practical indication, \u003Cstrong\u003E\u003Cspan style=\u0022background-color:#ffff00;\u0022\u003Eand the player can\u0027t easily tell which is which\u003C/span\u003E\u003C/strong\u003E, in a lot of cases.  That\u0027s what bit you, here-- there was a bit of \u0022fluff\u0022 writing that has no bearing whatsoever on the game or on how the part actually works, \u003Cem\u003E\u003Cu\u003Ebut you couldn\u0027t tell that\u003C/u\u003E\u003C/em\u003E from context and therefore it was really confusing.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I wish they\u0027d made it clearer.  Perhaps not ditch the fluff entirely (I think it\u0027s part of KSP\u0027s charm)... but at least design the \u0022part panel\u0022 interface to clearly designate \u003Cem\u003E\u003Cu\u003Etwo\u003C/u\u003E\u003C/em\u003E panels.  One would hold the \u0022fluffy\u0022 writing; the other (which might be empty) would be the clear, practical, this-is-how-it-works info.  This would make it obvious to the player \u0022any info located in \u003Cem\u003E\u003Cu\u003Ethis\u003C/u\u003E\u003C/em\u003E panel is important to you, anything over \u003Cem\u003E\u003Cu\u003Ethere\u003C/u\u003E\u003C/em\u003E is just for funsies.\u0022\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421165\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532414645\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cb\u003EKerbodyne KE-1 \u0022Mastodon\u0022 Liquid Fuel Engine\u003C/b\u003E - The description touts this engine as a \u0022behemoth\u0022, and the pinnacle of power...huh? it\u0027s neither the biggest, strongest, most efficient, heaviest....what?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, this one kinda gripes me, too.  Other than being mesh-switchable so that it\u0027s possible to cluster them, it\u0027s basically just a Mainsail with stats scaled to about 80%, and a \u003Cem\u003E\u003Cu\u003Eludicrously\u003C/u\u003E\u003C/em\u003E jacked-up-price.  Okay, and it \u003Cem\u003E\u003Cu\u003Elooks\u003C/u\u003E\u003C/em\u003E cooler, no argument there.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGiven that the Mainsail, 1. exists, and 2. has been a go-to staple of KSP players for half a decade or more... it\u0027s a fact of life.  So adding a part that doesn\u0027t really give significantly different playability options, and (in gameplay terms) is arguably inferior to an existing part... the balance really feels out of whack on this one.\n\u003C/p\u003E\n\u003Cp\u003E\nI suppose one could argue that the Mainsail is overpowered?  I dunno, seems fine to me.  But whether it is or it isn\u0027t \u0022overpowered\u0022... it\u0027s \u003Cem\u003E\u003Cu\u003Ethere\u003C/u\u003E\u003C/em\u003E, and so it largely renders the Mastodon moot.  I think that either they need to adjust the Mastodon to make it more attractive (greatly boost the power, or else greatly reduce the price)... or, if they\u0027re trying to get at an overall parts rebalance, they\u0027d need to nerf the Mainsail.  (Not that I\u0027m advocating for the latter.  I like it how it is.  I think they should raise the Mastodon\u0027s thrust by about 25%, and cut its price so it\u0027s only, say, 50% more expensive than a Mainsail.)\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421165\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532414645\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u0022Engine Plates\u0022? Dunno. The description leaves everything up to imagination, and trial and error. Without \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readouts, that is probably beyond the average player?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEngine plates are great, and serve a valuable function in the game-- have wanted something like this since forever.  Here\u0027s where the lack of practical nuts-and-bolts description can confuse a new player.  They\u0027re super useful, but they\u0027re also rather specialized and there are some important things to understand about how they work.  Can be hard to figure out from scratch.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m kinda confused by the \u0022\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u0022 reference, though.  What does \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E have anything to do with engine plates?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421165\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532414645\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EInflatable Airlock\u003C/strong\u003E - What is this for? My thought is that compared to structural tubes with regular docking ports, I guess they make light and aerodynamic connectors for surface bases or orbital stations? I don\u0027t get it. As far as I can tell, it only docks with other Inflatable Airlocks, and it doesn\u0027t do any sort of flexing to aid with surface docking...I feel like the description here should offer an idea for a use case...?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, this one\u0027s not only a victim of KSP\u0027s \u0022heavy on color, light on explanation\u0022 chatty descriptions of parts, but also \u003Cem\u003EMaking History\u003C/em\u003E\u0027s frankly somewhat conflicted design, IMO.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIs it there to give people historical replicas of IRL spacecraft?\n\u003C/li\u003E\n\u003Cli\u003E\nOr is it there to provide new playability options for KSP players?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nThose are divergent goals.  I like \u003Cem\u003EMaking History\u003C/em\u003E (bought it, enjoy it, have no regrets)... but I do think that it somewhat suffers by trying to do both of these things at once, which causes some ensuing awkwardness.\n\u003C/p\u003E\n\u003Cp\u003E\nThe inflatable airlock is a case in point.  It\u0027s not \u003Cem\u003E\u003Cu\u003Euseless\u003C/u\u003E\u003C/em\u003E... but its usefulness is small enough that I do kinda have to question whether the effort that went into it might have been better spent elsewhere.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that\u0027s about \u003Cem\u003E\u003Cu\u003Epracticality\u003C/u\u003E\u003C/em\u003E.  From the standpoint of being a \u003Cem\u003E\u003Cu\u003Ehistorical replica\u003C/u\u003E\u003C/em\u003E, there\u0027s a clear motivation there:  they\u0027re trying to \u003Ca href=\u0022http://mek.kosmo.cz/newware/nw032p05.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ereplicate the inflatable airlock\u003C/a\u003E from the Soviet Voskhod spacecraft.  And I gotta say, looking at pictures, they got the look-and-feel pretty well.  Unfortunately, here\u0027s where they kinda get bitten by the discrepancy between \u0022try to be historical\u0022 versus \u0022try to be useful in-game\u0022.  There\u0027s no actual \u003Cem\u003E\u003Cu\u003Eneed\u003C/u\u003E\u003C/em\u003E for an \u0022inflatable airlock\u0022 in the context of the IRL original, since every KSP pod has its own built-in airlock (and, indeed, putting \u003Cem\u003E\u003Cu\u003Ethis\u003C/u\u003E\u003C/em\u003E thing on top of a pod hatch will \u003Cem\u003E\u003Cu\u003Eblock the hatch\u003C/u\u003E\u003C/em\u003E and make it unusable).  And their desire to describe it as an \u0022airlock\u0022 (because that\u0027s what the IRL original was) can very easily confuse players.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve seen a lot of players posting in confusion about this part.\n\u003C/p\u003E\n\u003Cp\u003E\nTo be clear:  It does have its uses.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s just a standard 0.625m docking port, when inflated:  it can dock to other inflatables, and also to the stock Clamp-O-Tron \u003Cspan style=\u0022background-color:#ffff00;\u0022\u003EJunior\u003C/span\u003E.  This is one frequent source of player confusion:  it\u0027s \u003Cem\u003E\u003Cu\u003Eactually\u003C/u\u003E\u003C/em\u003E a 0.625m docking port, but it \u003Cem\u003E\u003Cu\u003Elooks\u003C/u\u003E\u003C/em\u003E like a 1.25m part, so players try to dock a regular Clamp-O-Tron and don\u0027t realize why it\u0027s not working.  If Squad had been designing the part purely from a standpoint of practicality, they could have made the appearance a lot less ambiguous... except that they were constrained by wanting to try to match the visual style of the Soviet contraption, which muddies the waters.\n\u003C/p\u003E\n\u003Cp\u003E\nAside from being a small docking port, when inflated it also \u003Cem\u003E\u003Cu\u003Eis a pod\u003C/u\u003E\u003C/em\u003E, with a capacity of one kerbal, \u003Cem\u003E\u003Cu\u003Eand a hatch\u003C/u\u003E\u003C/em\u003E.  So it can provide the ability for a kerbal to get in and out at that location.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421165\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532414645\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EProtective Rocket Nose Cone Mk7 \u003C/strong\u003E- This thing is heavy, and it\u0027s unclear whether using it is advantageous or not.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt helps.  Nosecones matter, by reducing drag-- they\u0027re way better than having a flat surface facing the airflow.  How \u003Cem\u003E\u003Cu\u003Emuch\u003C/u\u003E\u003C/em\u003E they help, though, depends on rocket design, notably the overall size, and launchpad \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E.  Streamlining matters more for high-\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E ships.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421165\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532414645\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ERadiator Panels vs. Thermal Control Systems\u003C/strong\u003E - It\u0027s obvious that TCSs turn to keep the sun off of them, but what is less clear is whether being in direct sunlight makes a Radiator Panel less effective or completely ineffective. A little help with the virtues or drawbacks of these two types of parts would really help in deciding which one to use.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThey work pretty much like real-world radiators (with some simplifications for gameplay).  They radiate.  If they happen to be in sunlight, then they will absorb heat just like any other object would.  So it\u0027s better for them to be edge-on to the sun if possible, since that reduces the area exposed to sun.\n\u003C/p\u003E\n\u003Cp\u003E\nIn other words:  the amount of heat they \u003Cem\u003E\u003Cu\u003Edump\u003C/u\u003E\u003C/em\u003E is basically the same regardless of sunshine.  They amount of heat they \u003Cem\u003E\u003Cu\u003Eabsorb\u003C/u\u003E\u003C/em\u003E is a function of, 1. are they in sun or shadow? 2. how bright is the sunshine?  3. how much surface area is exposed to the sun?  If you\u0027re really close to the sun and don\u0027t have the auto-rotating panels, then radiators can actually hurt you by exposing more area to sunlight, unless you take the trouble to manually turn your craft to keep them edge-on.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421165\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532414645\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHG-5 High Gain Antenna \u003C/strong\u003E- Based on the description, one gathers that this is a very special antenna because it is both direct AND relay. This is the only stock antenna that says anything along these lines. However, the \u0022Antenna Type\u0022 is listed as simply \u0022Relay\u0022. It would be nice to clear up that discrepancy.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere are two types of antennas in KSP:  \u0022direct\u0022 and \u0022relay\u0022.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe so-called \u0022direct\u0022 antennas can only transmit their own stuff.  They can\u0027t relay a signal from other craft.\n\u003C/li\u003E\n\u003Cli\u003E\nThe \u0022relay\u0022 antennas can do everything the \u0022direct\u0022 antennas can... \u003Cem\u003E\u003Cu\u003Eand\u003C/u\u003E\u003C/em\u003E they can also relay a signal from other craft.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nTherefore, there\u0027s no such thing as an antenna having \u0022both ways\u0022.  \u003Cem\u003E\u003Cu\u003EEvery\u003C/u\u003E\u003C/em\u003E relay antenna can also do direct transmission.  There\u0027s no such thing in the game as a \u0022relay-only\u0022 antenna that can\u0027t do direct.\n\u003C/p\u003E\n\u003Cp\u003E\nTherefore, when the \u0022Antenna Type\u0022 says \u0022direct\u0022, it\u0027s absolutely correct.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is another case of \u0022fluffy descriptions\u0022 confusing the player.  There\u0027s nothing at all even slightly special about the HG-5; it\u0027s just a tier-2 relay antenna, pure and simple.\n\u003C/p\u003E\n\u003Cp\u003E\nI long ago developed the knee-jerk habit of completely ignoring the \u0022description\u0022 field of all the parts, because most of them contain no practical information, and often they say things for \u0022color\u0022 purposes that mislead the player by implying gameplay significance that doesn\u0027t exist.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, dedicated UI fields like \u0022Antenna Type\u0022 are absolutely trustworthy (and what I always focus on), since they\u0027re populated \u003Cem\u003E\u003Cu\u003Eprogrammatically from the part\u0027s functionality\u003C/u\u003E\u003C/em\u003E, and therefore always say what the thing actually \u003Cem\u003E\u003Cu\u003Edoes\u003C/u\u003E\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421165\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532414645\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ECrew Cabins, in general\u003C/strong\u003E - the Mk1 and MK2 (casing problem?) crew cabins are both .5t per kerbal. The Mk3 is better at .4t per kerbal. And then we have the PPD-10 Hitchhiker Storage Container (which is the most commonly desired shape, by far, for me) at a lousy .625t per kerbal. I can\u0027t fathom why this would be. There\u0027s no benefit that I\u0027m aware of that would explain or offset the extra mass of the PPD-10...what gives?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBackwards compatibility, and balance issues over time as new parts are gradually added over the course of multiple KSP versions, are what gives.\n\u003C/p\u003E\n\u003Cp\u003E\nThe PPD-10 came first, early in the history of KSP, and became a mainstay of KSP players with its current stats.\n\u003C/p\u003E\n\u003Cp\u003E\nOriginally, KSP didn\u0027t exactly have a plethora of \u003Cem\u003E\u003Cu\u003Eairplane\u003C/u\u003E\u003C/em\u003E parts.  Certainly, they didn\u0027t have a lot as of KSP 0.23.5, which is when I started playing the game.  Over the course of many KSP updates after that... KSP kept adding airplane parts and airplane parts and \u003Cem\u003E\u003Cu\u003Emore\u003C/u\u003E\u003C/em\u003E airplane parts, with virtually nothing for us poor rocket folks.  And to add insult to injury... the new airplane parts often had \u003Cem\u003E\u003Cu\u003Ebetter stats\u003C/u\u003E\u003C/em\u003E than the corresponding rocket parts.  Speaking as a formerly disgruntled rocket jockey (now a lot happier), \u0022argh, they\u0027re coddling the spaceplane people!\u0022  \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Mk2 cabin is purely an airplane part.  The Mk1 cabin is \u003Cem\u003E\u003Cu\u003Eusable\u003C/u\u003E\u003C/em\u003E on a rocket... but the visual styling of the part and its IVA clearly is intended to be airplane-like.  When they added these new parts, they made them lighter per-kerbal than the venerable Hitchhiker pod... \u003Cem\u003E\u003Cu\u003Ebut they didn\u0027t alter the Hitchhiker\u0027s stats to match\u003C/u\u003E\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nI dunno whether that was an oversight, or whether it was deliberately done so as not to alter the behavior of players\u0027 existing spacecraft.  In any case... I confess this has long bugged me, myself.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ariscol","CreatedById":170688,"CreatedDateTime":"2018-07-24T17:21:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421388\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532447593\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEngine plates are great, and serve a valuable function in the game-- have wanted something like this since forever.  Here\u0027s where the lack of practical nuts-and-bolts description can confuse a new player.  They\u0027re super useful, but they\u0027re also rather specialized and there are some important things to understand about how they work.  Can be hard to figure out from scratch.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m kinda confused by the \u0022\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u0022 reference, though.  What does \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E have anything to do with engine plates?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou were kinda confused when I mentioned engine plates. I love engine plates, the idea is great, and their use is fairly intuitive. When I mentioned them, it was just in context of the mastodon engine, and I was just expressing that using the mastodon with engine plates is the only reason I could imagine why someone might ever use that engine at all. Basically the same thing you pointed out in your comments about that engine. The \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E reference is just pointing out that it might be hard to know how whether it\u0027s actually better to cluster 5 Mastodons or just go with the mammoth, or 4 Mainsails or whatever. You have a description that says this engine is awesome, but it\u0027s not easy without \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readouts to tell whether that is the case. You can easily look the 1:1 and realize that it\u0027s not great, but what if I cluster 5 of them on an engine plate...is that useful? It\u0027d be hard to say without knowing the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E. The description definitely doesn\u0027t guide you through any of this, and that\u0027s my real complaint.\n\u003C/p\u003E\n\u003Cp\u003E\nI loved your comments, BTW, some of them were very instructive, and everything was very constructive. I really like the idea of having two spots for text (flavor text goes here, and player instructions go there). This is not a novel idea, in fact, I have played a few games that do this.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-24T17:28:10Z\u0022 title=\u002207/24/2018 05:28  PM\u0022 data-short=\u00225 yr\u0022\u003EJuly 24, 2018\u003C/time\u003E by ariscol\u003C/strong\u003E\n\u003Cbr\u003EI forgot to address the dV comment\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-07-24T18:13:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421437\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532452918\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E reference is just pointing out that it might be hard to know how whether it\u0027s actually better to cluster 5 Mastodons or just go with the mammoth, or 4 Mainsails or whatever. You have a description that says this engine is awesome, but it\u0027s not easy without \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readouts to tell whether that is the case. You can easily look the 1:1 and realize that it\u0027s not great, but what if I cluster 5 of them on an engine plate...is that useful? It\u0027d be hard to say without knowing the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n...And sure, that\u0027s a great point (player wanting to know \u0022how many of which things should I use\u0022)... except that \u003Cstrong\u003Ethat has nothing to do with \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, and a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout wouldn\u0027t help that problem.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n[EDIT] Remainder of discussion moved to spoiler section, as it\u0027s somewhat tangential to the thread\u0027s topic at this point.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nIf you\u0027re considering engine alternative A versus engine alternative B, wondering \u0022which will give more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u0022 basically just boils down to \u0022which one has higher Isp\u0022.  That\u0027s basically it.  If engine A has better Isp than engine B, then engine A has more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E than engine B does.\n\u003C/p\u003E\n\u003Cp\u003E\n(Yes, that\u0027s oversimplifying-- slightly.  For example, engine \u003Cem\u003E\u003Cu\u003Emass\u003C/u\u003E\u003C/em\u003E matters, because engines are dead weight and being more massive will negatively impact \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.  But engines are usually only a pretty small percentage of total ship mass, and the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of various engines doesn\u0027t vary \u003Cem\u003E\u003Cu\u003Ethat\u003C/u\u003E\u003C/em\u003E much for the most part, so Isp tends to dominate.)\n\u003C/p\u003E\n\u003Cp\u003E\nAnd a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E tool would \u003Cem\u003E\u003Cu\u003Ecertainly\u003C/u\u003E\u003C/em\u003E not help you make the decision \u0022do I need 4 Mastodons, or 5?\u0022  Because \u003Cem\u003E\u003Cu\u003Ethey all have the same Isp as each other\u003C/u\u003E\u003C/em\u003E.  Any \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E tool will \u003Cem\u003E\u003Cu\u003Ealways\u003C/u\u003E\u003C/em\u003E tell you that you get slightly more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E with 4 engines than 5, because they\u0027re \u003Cem\u003E\u003Cu\u003Elighter\u003C/u\u003E\u003C/em\u003E and less dead weight equals more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd in any case, the crucial decision point there is \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, at least when lifting off the launchpad.  I\u0027ve got a rocket of a certain mass, so I\u0027ll need a certain amount of oomph to hit the desired \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E.  And that\u0027s simply a function of adding up the thrusts.  Engine A is 3000 kN, engine B is 1000 kN, so having three of B is about equivalent to one of A.  Yes, there\u0027s some math there, but, 1. it\u0027s much simpler than \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E calculations, and 2. it has nothing to do with \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIn short:  I could have a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout, and it could tell me \u0022put just one Mastodon on, instead of 5!  moar \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E!\u0022 ... even if that lone Mastodon wouldn\u0027t have enough oomph to even lift off the launchpad.  In other words, the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout in that context would be, 1. useless, and 2. potentially very misleading and lead to wrong engineering decisions.  Because \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E is not what matters, there.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to argue about \u0022KSP should have a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout\u0022, that\u0027s certainly a valid concern.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  But it\u0027s also \u003C/span\u003Ean entirely separate topic-- it\u0027s not a slam dunk, people have been arguing about that one for years and there are people on both sides of the issue.  \u003Cspan style=\u0022font-size:10px;\u0022\u003E(I happen to be firmly on the \u0022prefer \u003Cem\u003E\u003Cu\u003Enot\u003C/u\u003E\u003C/em\u003E to have one\u0022 side, myself, but I realize other people have different preferences.)\u003C/span\u003E  I don\u0027t see it as being germane to this topic here, as a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout wouldn\u0027t really help for this particular decision point.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd in any case... \u0022how much of which kind of engine\u0022 is one of the eternal KSP questions and applies to basically every rocket ever launched regardless of which parts it\u0027s made out of, even if no engine plates are involved at all.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2018-07-24T19:32:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0022 rel=\u0022\u0022\u003E@Snark\u003C/a\u003E I think you\u0027re both missing and making the point. Increasing \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E with 5 boosters instead of 4 is pointless if you no longer have enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to reach mission destination due to added dry mass, but \u003Cem\u003E\u003Cu\u003Eif it doesn\u0027t\u003C/u\u003E\u003C/em\u003E it\u0027s clearly benefit. Designing peak performance depends on knowing how your \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E/\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E balance looks, and the \u003Cs\u003Eonly\u003C/s\u003E most user-friendly way to know that from the editor is with a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-24T20:14:22Z\u0022 title=\u002207/24/2018 08:14  PM\u0022 data-short=\u00225 yr\u0022\u003EJuly 24, 2018\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-07-24T21:07:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421499\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532460741\u0022 data-ipsquote-userid=\u002281727\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, The_Rocketeer said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0022 rel=\u0022\u0022\u003E@Snark\u003C/a\u003E I think you\u0027re both missing and making the point. Increasing \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E with 5 boosters instead of 4 is pointless if you no longer have enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to reach mission destination due to added dry mass, but \u003Cem\u003E\u003Cu\u003Eif it doesn\u0027t\u003C/u\u003E\u003C/em\u003E it\u0027s clearly benefit. Designing peak performance depends on knowing how your \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E/\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E balance looks, and the \u003Cs\u003Eonly\u003C/s\u003E most user-friendly way to know that from the editor is with a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, I get the idea, I simply happen to disagree with it.  \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n[EDIT] Remainder of discussion moved to spoiler, as this is only tangentially related to the topic of the thread.  Perhaps a topic better suited elsewhere.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nMission success/failure is a complex beast in KSP.  Things can go \u0022wrong\u0022 (as in \u0022mission does not accomplish objective\u0022) in a variety of ways.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Do I put 4 Mastodons on it, or 5?\u0022 is a \u003Cu\u003E\u003Cem\u003Epotential\u003C/em\u003E\u003C/u\u003E failure scenario.  (Depending on mission design and how big the safety margin is, it may or may not \u0022matter\u0022, i.e. the decision might not be the difference between success and failure.)  Let\u0027s assume that it \u003Cem\u003E\u003Cu\u003Edoes\u003C/u\u003E\u003C/em\u003E matter, and your mission is toast if you choose wrong.  The question is, \u003Cem\u003E\u003Cu\u003Ehow\u003C/u\u003E\u003C/em\u003E does it matter?  Put another way... if you choose wrong and the mission fails thereby, what is likely to be the \u003Cem\u003E\u003Cu\u003Eway\u003C/u\u003E\u003C/em\u003E that it fails?\n\u003C/p\u003E\n\u003Cp\u003E\nYes, \u0022it fails because of insufficient \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E because the one extra engine added just enough weight to reduce the \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E a smidgeon below the minimum viability point\u0022 is certainly \u003Cem\u003E\u003Cu\u003Epossible\u003C/u\u003E\u003C/em\u003E.  However, my experience has been that it\u0027s more of an edge case, and that it\u0027s much more likely to be a failure scenario of \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E.  It\u0027s a whole lot easier, in my experience, to flunk a mission because it doesn\u0027t have quite enough engine power at liftoff, than to flunk because it has a little too much dead weight on it.  It\u0027s the later stages that make most of the difference to net \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E, anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nIn short:  if a player is relying on a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout to answer this question, then they\u0027ll likely fail because they\u0027re not looking at the most important things for that particular decision.  Knowing about \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E is important, sure, but \u0022how many engines do I put on my launchpad booster stage\u0022 is only loosely coupled to calculated \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.  Other factors predominate.\n\u003C/p\u003E\n\u003Cp\u003E\nIf we were having this discussion about an \u003Cem\u003E\u003Cu\u003Eupper\u003C/u\u003E\u003C/em\u003E stage (e.g. the one used to eject from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E to Duna, or whatever), then yes, it\u0027s more about \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E than \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E and I would agree with you.  But that\u0027s not folks generally use Mastodons for.  We\u0027re talking about launchpad liftoff, here.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ariscol","CreatedById":170688,"CreatedDateTime":"2018-07-24T21:29:35Z","Content":"\n\u003Cp\u003E\nYa\u0027ll are hijacking the thread...The point of the thread, the real suggestion here is:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421437\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532452918\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI really like the idea of having two spots for text (flavor text goes here, and player instructions go there). This is not a novel idea, in fact, I have played a few games that do this.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSome parts have flavor text that is highly misleading or just plain wrong because it\u0027s \u0022in character\u0022, and some parts are sorely missing some good help text about how and when to use them. The idea above is one way to fix it. Simply tweaking the existing item description is another even simpler approach.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-07-24T22:49:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421529\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532467775\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYa\u0027ll are hijacking the thread...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTouché, sir.  \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E  Quite right, thank you for the nudge.  I\u0027ve used spoilers to tidy up the last couple of my posts so they\u0027re not so cluttery.  Thanks for being patient.  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421529\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532467775\u0022 data-ipsquote-userid=\u0022170688\u0022 data-ipsquote-username=\u0022ariscol\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, ariscol said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSome parts have flavor text that is highly misleading or just plain wrong because it\u0027s \u0022in character\u0022, and some parts are sorely missing some good help text about how and when to use them. The idea above is one way to fix it. Simply tweaking the existing item description is another even simpler approach.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYet another approach would be to allow a part definition to have an optional field which is a \u003Cstrong\u003EKSPedia link\u003C/strong\u003E.  I love that there\u0027s a KSPedia feature built into the game, but I think it\u0027s under-used and has the potential to be way cooler than it is.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, by default, a part wouldn\u0027t have such a link.  If it \u003Cem\u003E\u003Cu\u003Edoes\u003C/u\u003E\u003C/em\u003E have one, it would show up in compact form somewhere on the part panel, just a small visibly-clickable bit of text with a KSPedia icon next to it (e.g. rendered to look like a hyperlink).  The text of the link would be whatever the title of the KSPedia page is.\n\u003C/p\u003E\n\u003Cp\u003E\nThat would make it super flexible.  Some parts-- perhaps even most-- wouldn\u0027t use the feature at all.  Some parts might have a specialized KSPedia page just for the one part (I could picture the big science lab having one, for example).  Other parts could have multiple parts sharing the same KSPedia page, e.g. \u0022Engine Plates\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nSince the content would be outside of the part pane in the editor, it conserves screen real estate-- just a small spot to put the link with its title.  And since it\u0027s in KSPedia, the content could be as simple or as rich as desired-- anything from a simple paragraph or two of explanation up to a full-page spread with illustrations, tables, diagrams, whatever.\n\u003C/p\u003E\n\u003Cp\u003E\nIf that were a standard feature applied in consistent fashion, it would make things easy for the user:  treat all text in the description pane as fluff.  If there\u0027s no KSPedia link displayed, it\u0027s useful negative information-- tells the user \u0022this part is self-evidently obvious and works exactly like you\u0027d expect, no special knowledge needed.\u0022  If there \u003Cem\u003E\u003Cu\u003Eis\u003C/u\u003E\u003C/em\u003E a link, then the user knows that any special knowledge will be found right there.\n\u003C/p\u003E\n\u003Cp\u003E\nWe\u0027ve got this fantastic tool sitting right there-- why not use it?  \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2018-07-24T23:56:31Z","Content":"\n\u003Cp\u003E\nFor what it\u0027s worth, mods have been created to improve the descriptions:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed1366699563\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/157513-descriptive-descriptions/\u0026amp;tab=comments\u0026amp;do=embed\u0026amp;comment=2980470\u0026amp;embedComment=2980470\u0026amp;embedDo=findComment#comment-2980470\u0022 style=\u0022height:312px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed6273428702\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/167325-wip-narrative-technology-tree/\u0026amp;do=embed\u0022 style=\u0022height:227px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nTheir authors would probably welcome your suggestions.\n\u003C/p\u003E\n"},{"CreatedByName":"ariscol","CreatedById":170688,"CreatedDateTime":"2018-07-25T06:01:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421598\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532476591\u0022 data-ipsquote-userid=\u0022156657\u0022 data-ipsquote-username=\u0022HebaruSan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, HebaruSan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor what it\u0027s worth, mods have been created to improve the descriptions\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOh, man this is just a perfect microcosm for this game.\n\u003C/p\u003E\n\u003Cp\u003E\nSo many people who love this game and have awesome ideas and put significant time and effort into fixing/adding/improving. I mean, the community should be proud, and it shows that the developers really struck gold with their game idea.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the other hand, to the community, it feels like the devs are so hopelessly buried in bugs, new features, problems, and suggestions, that, if not for the community\u0027s help, nothing would \u003Cem\u003Eever\u003C/em\u003E get done...\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I appreciate the tip on the mods, and the plug to give them a hand. If nothing else, it\u0027s nice that we have the \u003Cem\u003Eoption\u003C/em\u003E of solving our own problems.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-25T06:05:32Z\u0022 title=\u002207/25/2018 06:05  AM\u0022 data-short=\u00225 yr\u0022\u003EJuly 25, 2018\u003C/time\u003E by ariscol\u003C/strong\u003E\n\u003Cbr\u003Egrammar pedant\n\u003C/span\u003E\n"},{"CreatedByName":"OHara","CreatedById":162784,"CreatedDateTime":"2018-11-23T08:55:17Z","Content":"\n\u003Cp\u003E\nMany of the part descriptions are misleading, and I don\u0027t see how the \u0022in character\u0022 style of writing is any excuse for that.  The flavor text is no less (and no more) amusing if it is based on the actual features of in-game parts.  \n\u003C/p\u003E\n\u003Cp\u003E\nI made a pass through the base game parts (no DLC) and replaced the text I found misleading or confusing (in 90 part-descriptions) in a config-file  \u003Ca href=\u0022http://k-ohara.oco.net/KSP/partDescriptions.cfg\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E, and also on the bug tracker at \u003Ca href=\u0022https://bugs.kerbalspaceprogram.com/issues/20443\u0022 rel=\u0022external nofollow\u0022\u003E20443\u003C/a\u003E. \n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode prettyprint lang-javascript prettyprinted\u0022\u003E\n\u003Cspan\u003ELocalization\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E{\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\ten\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E-\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003Eus \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E{\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//\t\t#autoLOC_500124 = FAT-455 Aeroplane Tail Fin\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//\t\t#autoLOC_500125 = Large conventional wing with built-in control surface.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\t\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E#\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EautoLOC_500125 \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003ELarge\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E fin \u003C/span\u003E\u003Cspan class=\u0022kwd\u0022\u003Ewith\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E built\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E-\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003Ein control surface\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EWarranty\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022kwd\u0022\u003Evoid\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022kwd\u0022\u003Eif\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E used at near\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E-\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003Eorbital speed\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\n\u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//\t\t#autoLOC_500127 = Advanced Canard\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//\t\t#autoLOC_500128 = Our engineers thought this design looked \u0022high tech\u0022 and therefore must be clear improvement on earlier models.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\t\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E#\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EautoLOC_500128 \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EOur\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E engineers thought \u003C/span\u003E\u003Cspan class=\u0022kwd\u0022\u003Ethis\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E design looked \u003C/span\u003E\u003Cspan class=\u0022str\u0022\u003E\u0022high tech\u0022\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E and therefore must be clear improvement over the standard canard\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EWhen\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E asked what exactly is improved\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E,\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E they looked at the ground and mumbled\n\n\u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//\t\t#autoLOC_500133 = Swept Wings\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//\t\t#autoLOC_500134 = A prototype swept back wing, part of our \u0022Let\u0027s Fly\u0022, line. Made of light weight composite materials. Guaranteed to generate lift, not guaranteed to ensure crew safety.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\t\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E#\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EautoLOC_500134 \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EWhite\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EOwl\u003C/span\u003E\u003Cspan class=\u0022str\u0022\u003E\u0027\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003Es swept wings might provide only half the lift \u003C/span\u003E\u003Cspan class=\u0022kwd\u0022\u003Eof\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E the boring C7 wings \u003C/span\u003E\u003Cspan class=\u0022kwd\u0022\u003Eof\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E the same mass\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E,\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E but they look much cooler\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\n\u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//\t\t#autoLOC_500769 = Structural Pylon\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\u003C/span\u003E\u003Cspan class=\u0022com\u0022\u003E//\t\t#autoLOC_500770 = A structural Pylon for engine Support. Designed to fit against fuselages, and hull bodies. Comes Equipped with emergency bolts to separate jet engines in the event of fire or catastrophic failure. (Not covered by warranty)\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\t\t\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E#\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EautoLOC_500770 \u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E=\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EAttaches\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E parts radially\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EUpon\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E staging\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E,\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E separates from its parent \u003C/span\u003E\u003Cspan class=\u0022kwd\u0022\u003Ewith\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E moderate force\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E  \u003C/span\u003E\u003Cspan\u003EAfter\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E serveral cease\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E-\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003Eand\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E-\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003Edesist letters from O\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EM\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003EB\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EDemolition\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan\u003EEnterprises\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E,\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E \u003C/span\u003E\u003Cspan class=\u0022kwd\u0022\u003Ethis\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E is no longer marketed as a \u003C/span\u003E\u003Cspan class=\u0022str\u0022\u003E\u0027decoupler\u0027\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E,\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E but we don\u003C/span\u003E\u003Cspan class=\u0022str\u0022\u003E\u0027\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003Et mind how you use them\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E.\u003C/span\u003E\u003Cspan class=\u0022pln\u0022\u003E\n\u003C/span\u003E\u003Cspan class=\u0022pun\u0022\u003E}}\u003C/span\u003E\u003C/pre\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Xurkitree","CreatedById":187694,"CreatedDateTime":"2018-11-23T13:11:45Z","Content":"\n\u003Cp\u003E\nI totally agree on the Engine Nacelle, Precooler and Air Intake points. What are their uses? How does Air intake area or speed relate to the amount of mass of air pulled in by the intake? It would far more efficient to build aircraft or spaceplanes if I knew how all of this worked, but I don’t, so I slap a shock cone intake on all spaceplanes, which works, but is serious overkill and rather heavy. \n\u003C/p\u003E\n\u003Cp\u003E\nI would also like a better explanation of Intake Air mass and how does that factor into the flameout Situation.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso personally, i don’t find much use for TCS - I slap on radiators on the parts I need to cool and the tcs looks ugly and just out of the main body of the craft all the time. Also, they’re generally overkill or too weak.\n\u003C/p\u003E\n"},{"CreatedByName":"Gapone","CreatedById":193365,"CreatedDateTime":"2018-12-09T06:47:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421388\u0022 data-ipsquote-contentid=\u0022176994\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532447593\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/24/2018 at 6:53 PM, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nit\u003Cspan\u003E﻿\u003C/span\u003E\u0027s \u003Cem\u003E\u003Cu\u003Eactually\u003C/u\u003E\u003C/em\u003E a 0.625m docking port, but it \u003Cem\u003E\u003Cu\u003Elooks\u003C/u\u003E\u003C/em\u003E like a 1.25m part\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Ctable border=\u00221\u0022 cellpadding=\u00221\u0022 cellspacing=\u00221\u0022 style=\u0022width:500px;\u0022\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\n\u003Cp\u003E\nPART\u003Cbr\u003E\n{\u003Cbr\u003E\n    name = InflatableAirlock\u003Cbr\u003E\n    module = Part\u003Cbr\u003E\n    author = RoverDude\u003Cbr\u003E\n    MODEL\u003Cbr\u003E\n    {\u003Cbr\u003E\n        model = SquadExpansion/MakingHistory/Parts/Coupling/Assets/InflatableAirlock\u003Cbr\u003E\n    }\u003Cbr\u003E\n    rescaleFactor = 1\u003Cbr\u003E\n    node_stack_bottom = 0.0, 0.0, 0.0, 0.0, -1.0, 0.0, 1\u003Cbr\u003E\n    node_attach = 0.0, 0.08, 0.0, 0.0, -1.0, 0.0, 1\u003Cbr\u003E\n    TechRequired = advMetalworks\u003Cbr\u003E\n    entryCost = 8400\u003Cbr\u003E\n    cost = 400\u003Cbr\u003E\n    category = Coupling\u003Cbr\u003E\n    subcategory = 0\u003Cbr\u003E\n    manufacturer = #autoLOC_501627  //#autoLOC_501627 = Jebediah Kerman\u0027s Junkyard and Spacecraft Parts Co\u003Cbr\u003E\n    title = #autoLOC_8310003   //#autoLOC_8310003 = Inflatable Airlock\u003Cbr\u003E\n    description = #autoLOC_8310004   //#autoLOC_8310004 = Description Creation Pending\u003Cbr\u003E\n    attachRules = 1,1,0,0,0\u003Cbr\u003E\n    mass = 0.1\u003Cbr\u003E\n    dragModelType = default\u003Cbr\u003E\n    maximum_drag = 0.25\u003Cbr\u003E\n    minimum_drag = 0.25\u003Cbr\u003E\n    angularDrag = 0.5\u003Cbr\u003E\n    crashTolerance = 10\u003Cbr\u003E\n    maxTemp = 2600 // = 3400\u003Cbr\u003E\n    thermalMassModifier = 6.0 // like a nose cone\u003Cbr\u003E\n    emissiveConstant = 0.8\u003Cbr\u003E\n    bulkheadProfiles = size0\u003Cbr\u003E\n    CrewCapacity = 0\u003Cbr\u003E\n    tags = #autoLOC_8310005   //#autoLOC_8310005 = berth capture connect couple dock fasten join moor shield socket\n\u003C/p\u003E\n\u003Cp\u003E\n    stagingIcon = DECOUPLER_VERT\n\u003C/p\u003E\n\u003Cp\u003E\n    MODULE\u003Cbr\u003E\n    {\u003Cbr\u003E\n        name = ModuleDockingNode\u003Cbr\u003E\n        deployAnimationController = 1\u003Cbr\u003E\n        nodeType = size1\u003Cbr\u003E\n        staged = False\u003Cbr\u003E\n        stagingEnabled = False\u003Cbr\u003E\n    }\u003Cbr\u003E\n    INTERNAL\u003Cbr\u003E\n    {\u003Cbr\u003E\n        name = Airlock_IVA\u003Cbr\u003E\n    }    \u003Cbr\u003E\n    MODULE\u003Cbr\u003E\n    {\u003Cbr\u003E\n        name = ModuleAnimateGeneric\u003Cbr\u003E\n        CrewCapacity = 1\u003Cbr\u003E\n        animationName = AirlockDeploy\u003Cbr\u003E\n        actionGUIName = #autoLOC_6005002    //#autoLOC_6005002 = Toggle Airlock\u003Cbr\u003E\n        startEventGUIName = #autoLOC_6005003    //#autoLOC_6005003 = Open Airlock\u003Cbr\u003E\n        endEventGUIName = #autoLOC_6005004    //#autoLOC_6005004 = Close Airlock\u003Cbr\u003E\n        allowAnimationWhileShielded = False\u003Cbr\u003E\n    }\u003Cbr\u003E\n    MODULE\u003Cbr\u003E\n    {\u003Cbr\u003E\n        name = ModuleScienceContainer\u003Cbr\u003E\n        reviewActionName = Review Stored Data\u003Cbr\u003E\n        storeActionName = Store Experiments\u003Cbr\u003E\n        evaOnlyStorage = True\u003Cbr\u003E\n        storageRange = 1.5\u003Cbr\u003E\n    }\u003Cbr\u003E\n}\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/td\u003E\n\u003C/tr\u003E\u003C/tbody\u003E\u003C/table\u003E\u003Cp\u003E\nPaste this into GameData/SquadExpansion/Parts/Coupling/InflatableAirlock.cfg ant it will dock with regular clampotrons\n\u003C/p\u003E\n"}]}