{"TopicId":179626,"ForumId":55,"TopicTitle":"Auto-Strut Default","CreatedByName":"KerbService","CreatedById":193070,"CreatedDateTime":"2018-11-08T03:59:34Z","PageNum":1,"Articles":[{"CreatedByName":"KerbService","CreatedById":193070,"CreatedDateTime":"2018-11-08T03:59:35Z","Content":"\n\u003Cp\u003E\nIt would be helpful if I could choose an auto-strut default (Root-Heaviest-None-etc) so that I do not need to set each part while building my ships.\n\u003C/p\u003E\n"},{"CreatedByName":"Aeroboi","CreatedById":186653,"CreatedDateTime":"2018-11-08T17:52:42Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/193070-kerbservice/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022193070\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/193070-kerbservice/\u0022 rel=\u0022\u0022\u003E@KerbService\u003C/a\u003E The point with autostrut is that the different options have a purpose. You couldn\u0027t autostrut to a \u0022default\u0022 part because what part would that be then?\u003Cbr\u003E\u003Cbr\u003E\nHeaviest part or root part is notoriously used to create rigidity on parts attached to other stacks as these will often autostrut to a center stack using heaviest or root as that is where root or heaviest parts are often located. And while that is often the obvious locations for root and heaviest part it does depend per vessel. If any vessel had it\u0027s \u0022Heaviest part\u0022 at a spot near the bottom it would be rigid with the parts at the top connected to it, but if that heaviest part would be near the middle or near the top then that rocket wouldn\u0027t be as rigid anymore, probably even wobbly.\n\u003C/p\u003E\n\u003Cp\u003E\nSince there are to many variables in vessel creation I cannot foresee a algorithm that can be written or even conjured lol.\u003Cbr\u003E\nAnother things is that ships that dock or undock from one another will have it\u0027s heaviest or root part change causing physics to krakenize the game.\u003Cbr\u003E\nA default autostrut function allowing random locations of heaviest or root part will seriously annoy you with kraken type things when doing docking.\u003Cbr\u003E\u003Cbr\u003E\nThe only solution is auto-strut grandparent part by default.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, that usually doesn\u0027t really make the vessel rigid especially if it has stacks hanging on it\u0027s side. So it wouldn\u0027t deliver anyway.\u003Cbr\u003E\nIt you want auto-auto strut you can use the Kerbal Joint Reinforcement mod.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-11-08T17:53:23Z\u0022 title=\u002211/08/2018 05:53  PM\u0022 data-short=\u00225 yr\u0022\u003ENovember 8, 2018\u003C/time\u003E by Aeroboi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KerbService","CreatedById":193070,"CreatedDateTime":"2018-11-08T20:10:24Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/186653-aeroboi/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022186653\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/186653-aeroboi/\u0022 rel=\u0022\u0022\u003E@Aeroboi\u003C/a\u003E Thanks for your reply. I think I understand your comment. And yet when I build heavy boosters with hundreds of parts for payloads of 1500 tons or more I find that a global auto-strut to Heaviest works well in building stable reliable ships. Even smaller boosters using ring staging benefit from this. Of course, it is easy to text edit the save file with a global replace. Still, no algorithm would be required to implement this option in-game, only a setting to allow a selection to change the current \u0027Disabled\u0027 default to another. That would be faster than my having to use an editor, which is what I do now. Or worse, changing each by hand. And I try not to use any mods, only \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E. I guess for me it is a numbers game. It would just be a little easier for my building to start with all Heaviest and then change what required another mode either while building or later in flight. Thanks again.\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-11-09T00:13:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223483315\u0022 data-ipsquote-contentid=\u0022179626\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221541649575\u0022 data-ipsquote-userid=\u0022193070\u0022 data-ipsquote-username=\u0022KerbService\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, KerbService said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt would be helpful if I could choose an auto-strut default\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAuto strut is known for causing Kraken attacks in complicated builds.  It usually best if you limit your auto strutting to parts that really need it.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Chel","CreatedById":176173,"CreatedDateTime":"2018-11-09T00:15:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223483777\u0022 data-ipsquote-contentid=\u0022179626\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221541722400\u0022 data-ipsquote-userid=\u002264714\u0022 data-ipsquote-username=\u0022Gargamel\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, Gargamel said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAuto strut is known for causing Kraken attacks in complicated builds.  It usually best if you limit your auto strutting to parts that really need it.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYe. It\u0027s better to risk only attaching some parts on your craft rather than auto-strutting and the whole thing glitching out and exploding, especially if it was preventable\n\u003C/p\u003E\n"},{"CreatedByName":"MR L A","CreatedById":150940,"CreatedDateTime":"2018-11-09T09:09:37Z","Content":"\n\u003Cp\u003E\nI\u0027d much sooner have the advanced tweakable Rigid Attachment turned on by default... \n\u003C/p\u003E\n"},{"CreatedByName":"KerbService","CreatedById":193070,"CreatedDateTime":"2018-11-09T12:23:42Z","Content":"\n\u003Cp\u003E\nGood group of replies, Thanks folks! I wanted to post a picture of a booster that is 369 parts, 3431 total tons wet, with a payload of a little over 500 tons. This booster will place a 500 ton payload in an 85k Kerbin orbit reliably every time. And every part is set to auto-strut to \u0027Heaviest\u0027. \u003Cbr\u003E\nBut I have not been able to understand how to insert a png from my local disk into this post !!??!!?? Can I do that? Can I post a video of the booster going to orbit?\u003Cbr\u003E\nAnyway, I use auto-strut to \u0027Heaviest\u0027 almost every part every time on my boosters. Since 1.3. Maybe that works better now. Does for me. So that is why I wanted to use a different default other that \u0027Off\u0027.\u003Cbr\u003E\nThanks again, I am a NEWBIE to forums.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2018-11-09T15:10:12Z","Content":"\n\u003Cp\u003E\nPut the image up on imgur.com and link from there.\n\u003C/p\u003E\n\u003Cp\u003E\nChiming in with the others here, auto-autostrut wouldn\u0027t work. Careless use of autostrut has destroyed a good many of my maddest creations. You likely won\u0027t see it with a conventional staged booster, but try docking that little guy of yours to a space station of similar mass and complexity, and I\u0027ll bet you a dime for a dollar that it will summon the Kraken.\n\u003C/p\u003E\n"},{"CreatedByName":"KerbService","CreatedById":193070,"CreatedDateTime":"2018-11-11T02:29:11Z","Content":"\n\u003Cp\u003E\nMaybe I am beating the sh...t out of a dead horse, but ---  When I started using auto-strut stuff exploded for me also. But only before I found out that the the problem was a combination of auto-strut and clipping parts. Now I can avoid the problem by watching what I clip. So if the developers read this, just a choice of default for the auto-strut thing would be nice. Thanks...  \n\u003C/p\u003E\n"}]}