{"TopicId":180527,"ForumId":55,"TopicTitle":"Disable staging on EVERYTHING that can be staged","CreatedByName":"Zosma Procyon","CreatedById":151656,"CreatedDateTime":"2018-12-11T21:58:11Z","PageNum":1,"Articles":[{"CreatedByName":"Zosma Procyon","CreatedById":151656,"CreatedDateTime":"2018-12-11T21:58:11Z","Content":"\n\u003Cp\u003E\nFor the first time since the parts were introduced I have designed a vehicle using one of the service modules, in this case the largest one which is just large enough to conceal two of the large drills at either end. With the shroud in place the drills seem to \u0022magically\u0022 protrude through the underside of the craft. Hey if the game allows it, a little magic is fine. But there is a problem with these components: The explosive doors are staged and therefore at some point have to be jettisoned, which makes attaching parts to them a bit tricky. In fact I just attached said parts (radiators and structural wings in this case) to other parts adjacent to the service module. And the doors are jettisoned in the first stage and the holes covered up by large panel radiators. But I shouldn\u0027t have to be tricky. If fairings can have their staging disabled via advanced tweakables, why can the service modules? And engines should be unstagable too!\n\u003C/p\u003E\n\u003Cp\u003E\nIn fact every single part that can be staged should have the option to be not staged with advanced tweakabled engaged! That is the Kerbal way!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-11T21:59:09Z\u0022 title=\u002212/11/2018 09:59  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 11, 2018\u003C/time\u003E by Zosma Procyon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2018-12-11T22:53:43Z","Content":"\n\u003Cp\u003E\nI strongly supported this from day 1 of my time playing the game, but from what ive heard around the years its not quite as easy as it sounds, since apparently adding any sort of right click features to any part is rather complex code wise (probably the reason we still dont have this).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut yeah, id love to disable staging on engines, since i have enough VTOLs and craft that have aux engines that id never ever use stage to turn on but rather action group it (or just do it manually via right click in case of emergency use backup engines after the main ones have been shot apart).\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2018-12-12T00:13:33Z","Content":"\n\u003Cp\u003E\nDoesn\u0027t need a right-click in-flight, just in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. Though adding it in either place actually isn\u0027t too hard. It\u0027s one of the few things I was able to learn my own self \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003ENow as far as actually enabling and disabling staging, I don\u0027t know. I checked docking ports and they don\u0027t have a module that enables toggling staging so I assume it\u0027s packed in with ModuleDockingPort or something like that, so it\u0027d be code, which means writing code and ick. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"lunardog15","CreatedById":192528,"CreatedDateTime":"2018-12-12T16:41:40Z","Content":"\n\u003Cp\u003E\nyes please\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Zosma Procyon","CreatedById":151656,"CreatedDateTime":"2018-12-12T18:25:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223503365\u0022 data-ipsquote-contentid=\u0022180527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221544568823\u0022 data-ipsquote-userid=\u002295108\u0022 data-ipsquote-username=\u0022panzer1b\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, panzer1b said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI strongly supported this from day 1 of my time playing the game, but from what ive heard around the years its not quite as easy as it sounds, since apparently adding any sort of right click features to any part is rather complex code wise (probably the reason we still dont have this).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBut yeah, id love to disable staging on engines, since i have enough VTOLs and craft that have aux engines that id never ever use stage to turn on but rather action group it (or just do it manually via right click in case of emergency use backup engines after the main ones have been shot apart).\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t see why it would. I don\u0027t know how the game is coded, but the lines of code that enable staging shouldn\u0027t be too dissimilar between every class of part, if not identical. That\u0027\u0027s how I, as an engineer that can\u0027t seem to learn coding, would do it. So it should only be a matter of copying the code sections that allow certain parts that can be de-staged into every other staged part. And even if it isn\u0027t as simple is my ignorant notions say it should be, this is still a better use of the programmers time than changing the color schemes of older parts. No offense to Squad intended.\n\u003C/p\u003E\n"},{"CreatedByName":"IncongruousGoat","CreatedById":157062,"CreatedDateTime":"2018-12-12T18:34:25Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223503783\u0022 data-ipsquote-contentid=\u0022180527\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221544639155\u0022 data-ipsquote-userid=\u0022151656\u0022 data-ipsquote-username=\u0022Zosma Procyon\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Zosma Procyon said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t know how the game is coded, but the lines of code that enable staging shouldn\u0027t be too dissimilar between every class of part, if not identical.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSoftware \u0027should\u0027 be built in a reasonable way, but it often isn\u0027t, and things that seem like they\u0027d be simple often turn out to be messy and complex under the hood. Don\u0027t ever assume something is easy to add unless A: the devs have explicitly said so, or B: you\u0027ve looked at the source code yourself.\n\u003C/p\u003E\n"},{"CreatedByName":"lunardog15","CreatedById":192528,"CreatedDateTime":"2018-12-13T00:53:39Z","Content":"\n\u003Cp\u003E\ntime to go and dig in a (posible) mess of code \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E welp that\u0027s what I\u0027m going to do for my weekend\n\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2018-12-18T16:47:36Z","Content":"\n\u003Cp\u003E\nI get around decoupling issues right now by putting the actual staging icon at the very top (or very end) of the staging list so that it effectively never stages off, but I agree that this should be implemented.\n\u003C/p\u003E\n"}]}