{"TopicId":180655,"ForumId":55,"TopicTitle":"What this game needs...","CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2018-12-17T18:50:14Z","PageNum":1,"Articles":[{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2018-12-17T18:50:14Z","Content":"\n\u003Cp\u003E\nI started playing a vanilla game again. Just to get a feel for it as a noob would.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first thing I thought was lacking was a \u0022circularise at \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E/\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E/Here \u0022 button/gizmo. Could be something researchable around the time of your first Mun Landing. Your trajectory is known. A course plotted to circularise on that trajectory should be doable. Could be accessible after your pilot gets his second star. Make it only accessible in space so that it won\u0027t try to plot a course in an atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nThe new burn-time info is getting there.. but I would like my pilot to be useful. How about once he reached a certain xp he can actually perform the burn?\n\u003C/p\u003E\n\u003Cp\u003E\nOk.. so I have been to the Mun. The contracts guys asks if I\u0027d like to build a base on Ike but I haven\u0027t even done a flyby of Mimnus yet. So that could use some work.\n\u003C/p\u003E\n\u003Cp\u003E\nI have rescued a few kerbals in orbit and it occurs to me that I could use an inclination readout on anything in orbit and a way to accurately set my inclination.\u003Cbr\u003E\nIs there any way to tell the inclination of Mimnus in game?\n\u003C/p\u003E\n\u003Cp\u003E\nNow here is the biggie... I have built stations around the Mun, Mimnus and of course Kerbin. Now it\u0027s time to start looking at Duna and the other planets.\n\u003C/p\u003E\n\u003Cp\u003E\nYou listening Devs?\n\u003C/p\u003E\n\u003Cp\u003E\nAs far a the vanilla game goes, how does it let me know when to try for Duna?\n\u003C/p\u003E\n\u003Cp\u003E\nAm I really supposed to just launch a vessel into interplanetary space and then plot it\u0027s course to Duna? Is that how we do it on Earth? (Kidding)\n\u003C/p\u003E\n\u003Cp\u003E\nThe game has NOTHING by way of information on how to get to all those other worlds you have made.\u003Cbr\u003E\nAdvancing a node one orbit at a time doesn\u0027t help.\n\u003C/p\u003E\n\u003Cp\u003E\nWithout getting information externally or using a mod... how? Trial an error? Best Guess?\u003Cbr\u003E\nPerhaps I\u0027m supposed to keep a ship in orbit and every so often try to plot a course to Duna?\u003Cbr\u003E\nI suspect that this is why most people stop playing after Mimnus. There is nothing in-game to help with transfer windows.\u003Cbr\u003E\nWhy not make the encyclopedia useful and have the next transfer widow for each world in the information on that world?\n\u003C/p\u003E\n\u003Cp\u003E\nI have got well over 6000 hours in game. I know how to play with what\u0027s available.\u003Cbr\u003E\nI\u0027m pretty smart. I could figure out roughly where Mars will be at a given time. However. It is much easier to ask a few of the Millions of astronomers who already have the information. This information should be available In-Game. The game simply isn\u0027t playable by most people without it.\n\u003C/p\u003E\n\u003Cp\u003E\nOk.. done ranting.. my urine is starting to cool again. Thanks for your time.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ZooNamedGames","CreatedById":103726,"CreatedDateTime":"2018-12-19T13:51:31Z","Content":"\n\u003Cp\u003E\nI’ve always held the belief that players stop exploring past Minmus because the engineering challenge is too high. Most players make maneuver nodes in steps anyway and wouldn’t make direct launches to planets.\n\u003C/p\u003E\n\u003Cp\u003E\nNot to mention transfer windows are great when you’re in sandbox, but in career mode when you have a time limit, that doesn’t always work.\n\u003C/p\u003E\n"},{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2018-12-20T20:55:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223507388\u0022 data-ipsquote-contentid=\u0022180655\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221545227491\u0022 data-ipsquote-userid=\u0022103726\u0022 data-ipsquote-username=\u0022ZooNamedGames\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/19/2018 at 1:51 PM, ZooNamedGames said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI’ve always held the belief that players stop exploring past Minmus because the engineering challenge is too high. Most players make maneuver nodes in steps anyway and wouldn’t make direct launches to planets.\n\u003C/p\u003E\n\u003Cp\u003E\nNot to mention transfer windows are great when you’re in sandbox, but in career mode when you have a time limit, that doesn’t always work.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nEngineering Challenge too high? Have you ever gone to Duna?\u003Cbr\u003E\nBasically all it is is a rocket designed for Mimnus with a lander designed for The Mun. It can even be launched form an equatorial orbit and achieve intercept without a later correction. You think that is challenging?\n\u003C/p\u003E\n\u003Cp\u003E\nI only play in career and I have to work out my own transfer windows. There is LOADS of time. Usually about three or four times more than I need.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}