{"TopicId":180750,"ForumId":55,"TopicTitle":"Little blue pills for little green men: Ideas for performance enhancements?","CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-21T14:05:48Z","PageNum":1,"Articles":[{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-21T14:05:48Z","Content":"\n\u003Cp\u003E\nHey all, I started trying to figure out what a good way would be to bake all those fidgety, n-symmetry radial parts into the craft files to improve performance on large crafts and possibly reduce wobble and phantom forces. At a minimum, I think four FLT-100 engines in a stack should have similar structural properties to one FLT-400 and it should be possible to traverse the part tree and merge adjacent, identical tanks in the craft file in a baking process. The difficult part is how would you merge four child nodes of the same parent so that they retain the same game functionality of the separate four parts but are processed as a unit for the physics model? And I feel like radial barometers should do this but wings should not, or at least they should be processed in a way that you can still lose one wing of a pair and paired control surfaces still need to provide pitch, yaw and roll control.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve noticed that my computer, which is a modern laptop with a dedicated graphics card and a quad core CPU with turbo up to 3.4 ghz (or so it says) starts chugging if I get more than about 50 parts on-screen. In general for me, a yellow timer (gametime is slowed) is just a fact of life even at 1x acceleration, and for larger rockets with above 200 parts my game starts edging towards the slideshow zone. I try to avoid more than 250 parts on screen simply because I start worrying that my computer is starting to overheat and literally burn out chunks of hardware trying to process everything.\n\u003C/p\u003E\n\u003Cp\u003E\nNot bad for a game that is starting to show its age, but I\u0027d rather not be burning my hardware on the altar of the Kraken in order to explore Duna. So I\u0027m going to just throw an open-ended question out there: What sort of performance enhancements would you want to see in KSP so you can build bigger, better, faster rockets that don\u0027t get bogged down quite so much?\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2018-12-21T14:38:34Z","Content":"\n\u003Cp\u003E\nThat would take away the point of upgrading to better fuel tanks?\n\u003C/p\u003E\n\u003Cp\u003E\n4 100\u0027s and a 400 may hold the same fuel but the 400 is much stronger and sturdier as far as wobble, and also lowers part count. If there was no difference at all, why have anything but the 100 in the game?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, there is a welding mod that does what you want I think.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-21T14:38:59Z\u0022 title=\u002212/21/2018 02:38  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 21, 2018\u003C/time\u003E by Rocket In My Pocket\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mjarf","CreatedById":16666,"CreatedDateTime":"2018-12-26T13:10:23Z","Content":"\n\u003Cp\u003E\nKSP is a very CPU intensive game because of how it runs. In most games most objects are \u0022physics less\u0022, you can\u0027t really interact with tables and walls other than walking into them and on them. In KSP pretty much every part on the rocket has simulated physics and can be interacted with, and the Unity game engine is probably not the most efficient and this adds up to a huge CPU load with big rockets. That being said, the game runs quite well even on my little AMD Ryzen 3 1200, but I do notice that it\u0027s a tad under powered for the game even when OC\u0027ed to 3.9 GHz.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s probably difficult to optimize the physics in the game because of how complex it is and as far as I understand the Unity engine isn\u0027t necessarily optimal for the game, but re-writing it from scratch in a different engine would be a huge task. This game is still among my favorites though, despite it\u0027s flaws. \n\u003C/p\u003E\n"}]}