{"TopicId":182587,"ForumId":55,"TopicTitle":"Include part node sizes in the displayed statistics","CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2019-03-03T02:55:28Z","PageNum":1,"Articles":[{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2019-03-03T02:55:28Z","Content":"\n\u003Cp\u003E\n...by which I mean in the stat block with mass and stress/temperature tolerances. And I dare say it should be the first entry in the block, the very first line you read. I\u0027ve been playing for a long time so I\u0027m already familiar with the sizes of tanks (in particular) that have been in the game since forever like the Kerbodyne and FL-T-series tanks, but I only now got into 1.875m parts in my career game...and I\u0027m terribly confused which if any tanks or engines come in that size except the two tanks which I already had when I unlocked the Terrier.\n\u003C/p\u003E\n\u003Cp\u003E\nI \u003Cem\u003Edo\u003C/em\u003E know there is that 1m size scale in the pictures, but since it\u0027s oriented with the part length, it\u0027s actually not that helpful for me and they basically all look the same since the thumbnails are scaled to be the same size on-screen. I also know about the part filters and sorting, plus you can always pull one into the scene and see immediately whether it fits. So I can work around the limitations this causes in the editors. Some of the parts (e.g. decouplers) have names which describe their size, and some have it in the description text, but they\u0027re the exception rather than the rule, and most importantly it\u0027s not consistent among all parts.\n\u003C/p\u003E\n\u003Cp\u003E\nBut where the info on node sizes is \u003Cem\u003Ereally\u003C/em\u003E needed is in the tech tree screen. You can\u0027t filter the parts shown in each node by size, and once you pick a node, you\u0027re committed. Whether or not the parts in that node are compatible with the parts you already have in your inventory. It would be enormously helpful to mouse-over the Mk 2 Command Pod in the Advanced Flight Control node and see \u0022Attachment: 0.625, 1.875\u0022 or \u0022Attachment: Size 0, Size 1.5\u0022 in the part listing.\n\u003C/p\u003E\n\u003Cp\u003E\nHow did we survive so long without having this data?\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2019-03-03T16:11:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223550646\u0022 data-ipsquote-contentid=\u0022182587\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221551581728\u0022 data-ipsquote-userid=\u002298495\u0022 data-ipsquote-username=\u0022pincushionman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 hours ago, pincushionman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHow did we survive so long without having this data?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t know, but I have lost count the number of times I have started a build, only to quickly realize, I grabbed the wrong dang probe core, cause they look identical and I have no idea how big this one is.....\n\u003C/p\u003E\n"}]}