{"TopicId":186328,"ForumId":55,"TopicTitle":"tendons, inputs, free pivot, mech leg","CreatedByName":"aruoch","CreatedById":197503,"CreatedDateTime":"2019-07-13T13:41:40Z","PageNum":1,"Articles":[{"CreatedByName":"aruoch","CreatedById":197503,"CreatedDateTime":"2019-07-13T13:41:40Z","Content":"\n\u003Cp\u003E\n1) tendons\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\none of the things that\u0027s a staple in a leg is a muscle to move a joint. because of the way attaching things works in ksp, the only way to make a \u0022muscle\u0022 to articulate a hinge is with a strut connector, perhaps adding a more solid way to attach a \u0022muscle\u0022 hydraulic would be a good idea.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n2) input binds for KAL\n\u003C/p\u003E\n\u003Cp\u003E\none of the issues with KAL seems to be a bunch of pressing play on them, maybe i\u0027m just using them wrong but i\u0027d like to be able to keybind a KAL controller that\u0027s set to walk forward to W, and left and right to A D. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n3) feet pivotrons\n\u003C/p\u003E\n\u003Cp\u003E\ninfernal robotics had unpowered free pivotrons, which would be useful for creating free-rotating feet. i\u0027d suggest maybe having a system that activates a traction lock on the foot when it hits the floor. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n4) mech hip servo\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\none of the issues i had with using the hinges was that the larges one is too wide to be used on anything but the largest construction, and the smaller hinges seem to bow under stress of carrying a fully constructed mech, making rolling a better option than walking.  so i\u0027d like a more expensive version of servos and hinges specifically designed for use on mechs rather than on mechanical arms etc, with high weight tolerance for a small size. this would allow people to make mechs that don\u0027t bounce like the legs are suspension modules. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-07-13T13:59:01Z\u0022 title=\u002207/13/2019 01:59  PM\u0022 data-short=\u00225 yr\u0022\u003EJuly 13, 2019\u003C/time\u003E by aruoch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2019-07-14T17:39:56Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197503-aruoch/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022197503\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/197503-aruoch/\u0022 rel=\u0022\u0022\u003E@aruoch\u003C/a\u003E You can already do #2, sort of. Once you’ve made your ‘walk forward’ track on a KAL, you can bind it to W on an axis group. It won’t work like a rover wheel (ie, you have to hold W to keep moving forward), but instead you’ll be able to press W and as long as the KAL track is set to loop mode, your mech will keep walking until you press the button again.\n\u003C/p\u003E\n"}]}