{"TopicId":197412,"ForumId":55,"TopicTitle":"A better \u0022closest approach\u0022 finder","CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-10T20:38:32Z","PageNum":1,"Articles":[{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-10-10T20:38:32Z","Content":"\n\u003Cp\u003E\nrecently i have gone to bop, then from bop to pol, and now i am trying to go to eeloo, and each of those tasks would not be hard, if there was a decent way for predicting orbits.\n\u003C/p\u003E\n\u003Cp\u003E\nFor you see, I know that eeloo will be in the orbital node around year 13, day 1. And I know that my ship is not too far from that. But I cannot visualize it in any way. I\u0027m shooting blind. Sometimes I find a close approach. it says something like 5 million km. then i fiddle a bit with the manuever. and i gradually reduce that until... it disappears. and get replaced by another close approach that\u0027s bound to happen in 25 years, at tens of millions of km. I keep getting \u0022close approach\u0022 markers at the farthest points from the nodes, where I cannot possibly get an approach. And I\u0027m growing quite angry at it. this has nothing to do with skill, it\u0027s a limitation in the game\u0027s ability to give informations.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I conceived an easy solution: the ability to set up where you want your close approach. So I would be able to point on eeloo at the orbital node and say \u0022I want to have an approach here\u0022, and then the game will always show me the closest approach there, it will show me how close I am to hitting eeloo on the node. It would show where my ship would be when eeloo is in the chosen position. perhaps a nice time interval, \u0022give me the closest approach in a time window between 3 years 300 days and 4 years 100 days from now\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nthat can\u0027t be too hard to implement.\n\u003C/p\u003E\n"},{"CreatedByName":"IanCanberra","CreatedById":176895,"CreatedDateTime":"2020-10-12T07:09:04Z","Content":"\n\u003Cp\u003E\nWhen you use Mech Jeb there is the editor. If you open that up you can change values. Even very minor decimal point values. Then Update it.\n\u003C/p\u003E\n\u003Cp\u003E\nI suggest you try it first on a mun or minmus orbit and see how it works\n\u003C/p\u003E\n"},{"CreatedByName":"natsirt721","CreatedById":117557,"CreatedDateTime":"2020-10-14T17:43:44Z","Content":"\n\u003Cp\u003E\nThe problem is that the the closest approach indicator looks for a local minimum distance, rather than the absolute minimum distance along the entire orbit of the vehicle you\u0027re planning for (or something like that, either way it doesn\u0027t do a good job). For simple orbital geometry this is sufficient, but you appear to have found one of the cases where it is not (planning a direct transfer from kerbin to Moho is another one). Fortunately, there is a workaround, not altogether unlike the solution you have described.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen placing maneuver nodes, the closest approach algorithm starts searching from the time of the final node in the plan. If you know approximately when your intercept will be, you can place an empty node at that time, and the closest approach indicator will snap to the time of the node, or the next minimum distance after it (usually the former, in my experience). From here, you can do a two-step dance; tweaking the burn vector slightly and adjusting the time of the dummy node until you achieve an \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E change.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-10-14T18:47:39Z","Content":"\n\u003Cp\u003E\nIf it\u0027s so hard to program a predictor (they\u0027ve tried before. Believe it or not it used to be worse) then I\u0027d be happy with the interface showing me a ghost of where my target soul will be when my ship is at the location of its orbit where my cursor is.\n\u003C/p\u003E\n\u003Cp\u003E\nLike how now it shows it during \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E encounters, only directly under my control.\n\u003C/p\u003E\n"},{"CreatedByName":"Corona688","CreatedById":2511,"CreatedDateTime":"2020-10-15T20:33:30Z","Content":"\n\u003Cp\u003E\nYou need to double-click on the planet to select it as a target.  Then it will show closest-approach as tick marks, just like a spacecraft encounter, whenever it doesn\u0027t end up close enough for \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E change.  You can right click on the tick marks for detailed information.\n\u003C/p\u003E\n\u003Cp\u003E\nEncounters in the very far future may not be that precise.  That\u0027s OK, neither are your engines.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-10-15T20:36:41Z\u0022 title=\u002210/15/2020 08:36  PM\u0022 data-short=\u00223 yr\u0022\u003EOctober 15, 2020\u003C/time\u003E by Corona688\u003C/strong\u003E\n\u003C/span\u003E\n"}]}