{"TopicId":200921,"ForumId":55,"TopicTitle":"Make RSS Stock with the ability to change the scale at the start of a new save","CreatedByName":"kspnerd122","CreatedById":199169,"CreatedDateTime":"2021-03-11T14:53:07Z","PageNum":1,"Articles":[{"CreatedByName":"kspnerd122","CreatedById":199169,"CreatedDateTime":"2021-03-11T14:53:07Z","Content":"\n\u003Cp\u003E\nThe premise is simple, Make \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E into a stock feature(or even a DLC, it dont matter) but have it scaleable(stock scale/real scale) this way, realscale can be a sort of super hard mode, while stock scale would be good if you wanted to just  go to space, but in our system, obviously, dont add every planet/moon into it, but maybe add everything out to pluto, and then remove most of the moons of gas giants(each one would have 10(other than neptune, which will have 5)round moons would get priority over tiny ones)\n\u003C/p\u003E\n\u003Cp\u003E\nNow, why do I feel like this would be a good adition to KSP, one, because people can choose if they want  it, and is it should be realscale or stock scale, therefore, it is not forced on ANYONE, and you can always play the stock system if you choose.\n\u003C/p\u003E\n\u003Cp\u003E\nTwo, because \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E has its own challenges, like on mars, you cant just parachute to a landing, unlike on duna(will require a chute rework to let them open at very low pressures), and solar arrays get useless past jupiter.\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-03-11T15:49:02Z","Content":"\n\u003Cp\u003E\nNo. No. And once again, no. This is KERBAL Space Program. No realistic anythings are required in the stock game or as DLCs. I’ve said it before, and I’m saying it again even though I’ve been playing \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E/\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1 for the last four months now.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E is already a mod, is widely used and well supported by related stuff like \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-1 and also by both visual mods and mods which add more bodies (moons, Trojans, long period planetoids etc.). There’s also KSRSS to combine the real planets with Kerbal scale. Squad should be adding features that benefit as many players as possible, not catering to the relatively small group who want to play Human Space Program.\n\u003C/p\u003E\n\u003Cp\u003E\nJust like every other time someone tries to suggest this, it isn’t going to happen. Use the mods like everyone else.\n\u003C/p\u003E\n"},{"CreatedByName":"The Aziz","CreatedById":150811,"CreatedDateTime":"2021-03-11T21:31:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223938883\u0022 data-ipsquote-contentid=\u0022200921\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221615474387\u0022 data-ipsquote-userid=\u0022199169\u0022 data-ipsquote-username=\u0022kspnerd122\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, kspnerd122 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nlike on mars, you cant just parachute to a landing, unlike on duna\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI recently nearly crashed because my chutes couldn\u0027t slow down the descent enough on Duna.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223938883\u0022 data-ipsquote-contentid=\u0022200921\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221615474387\u0022 data-ipsquote-userid=\u0022199169\u0022 data-ipsquote-username=\u0022kspnerd122\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, kspnerd122 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nand solar arrays get useless past jupiter.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood luck using xenon propulsion at full throttle past Dres on a ship with solar panels only.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo that\u0027s a no.\n\u003C/p\u003E\n"},{"CreatedByName":"DunaManiac","CreatedById":176003,"CreatedDateTime":"2021-03-16T12:25:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223938883\u0022 data-ipsquote-contentid=\u0022200921\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221615474387\u0022 data-ipsquote-userid=\u0022199169\u0022 data-ipsquote-username=\u0022kspnerd122\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/11/2021 at 9:53 AM, kspnerd122 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\non mars, you cant just parachute to a landing, unlike on duna\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s actually not true. Although the problem is worse on mars, parachutes can\u0027t really be used on Dyna. They can be used to slow down but they almost always can\u0027t land you safely, not unless you have a very big parachute and a very small payload.\n\u003C/p\u003E\n\u003Cp\u003E\nThis has been suggested so many times I have lost count. It is not happening.\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2021-03-16T13:30:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223938883\u0022 data-ipsquote-contentid=\u0022200921\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221615474387\u0022 data-ipsquote-userid=\u0022199169\u0022 data-ipsquote-username=\u0022kspnerd122\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 3/11/2021 at 3:53 PM, kspnerd122 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe premise is simple, Make \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003E\u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E\u003C/abbr\u003E into a stock feature\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe answer is simple: no.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m usually one to say that as long as a certain add-on feature is made configurable/optional, I\u0027m ok with it being added.\n\u003C/p\u003E\n\u003Cp\u003E\nBut despite saying that people would get to choose, you then specify that the only actual choice would be between using a real-scale or a stock-scale REAL system. So basically people will still be forced to play in a non-kerbol system, just the scale would differ. Again... no.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second reason is because of the sheer amount of changes required to effectively implement and play \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E. Practically *everything* about the game gets changed to make it happen. With all the implications for code complexity, performance, and reliability. As a self-inflicted mod set, people have to actively choose for themselves if they feel like bearing that potential impact to their game. Making it stock, no one gets a choice, even the large group who will not ever play that mode. So, no. (* Hats off nonetheless for what the mod authors have achieved with it so far)\n\u003C/p\u003E\n\u003Cp\u003E\nThird reason is the difference in overall ideology/direction between what the stock game wants to be, and what \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E wants to be. It\u0027s hard enough -evidenced by the current state of the game- to consistently implement ONE vision about how a game should be/look/behave. Now try that while keeping to TWO almost diametrically opposed visions, on almost every single aspect. No, thank you very much, no.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E is exactly where it needs to be: as a mod. I can freely choose to play it whenever I want, without any impact to when I DON\u0027T want to play it. Keep it that way.\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-03-18T10:53:50Z","Content":"\n\u003Cp\u003E\nIf \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E was stock, how would you explain the green cartoony Kerbals that feature? You\u0027d need human versions. And then there\u0027s parts.   The ‘simplistic’ design of the current engines wouldn\u0027t be fitting. Ditto fuel, power, structural pieces etc. That\u0027s a whole new game if you change everything.\n\u003C/p\u003E\n\u003Cp\u003E\nBut even if all those were somehow changed / included, the first time your true-to -life rocket wobbled comically during launch, or your rover flipped comically over as you tried to make a turn, or your human spun off comically due to a ladder collider glitch, the illusion of reality would be ruined very quickly.\n\u003C/p\u003E\n"}]}