{"TopicId":201282,"ForumId":55,"TopicTitle":"EVA Science Suggestion","CreatedByName":"B.Riches2500","CreatedById":210329,"CreatedDateTime":"2021-03-27T17:27:00Z","PageNum":1,"Articles":[{"CreatedByName":"B.Riches2500","CreatedById":210329,"CreatedDateTime":"2021-03-27T17:27:00Z","Content":"\n\u003Cp\u003E\nI’ve just had a thought, and I wondered if it would be possible and if anyone else liked it. (Possibly for KSP, but more likely KSP2)\n\u003C/p\u003E\n\u003Cp\u003E\nMy idea is based on the fact that KSP and Kerbals in general are quite silly, fun and quirky, and this would add a bit more of that onto the current EVA science pack. As far as I have experienced, the only animation is a Kerbal hitting a golf ball. My idea however, is that the animation could vary depending on the location at which the EVA science is being conducted. For example, in the polar regions of a planet (if they are ice caps) a Kerbal could make a snow ball and throw it, rather than hitting a golf ball.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, to add to this when a Kerbal plants a flag when in the polar ice caps of a planet, it could make a snow man (snow Kerbal) and have that as the marker.\n\u003C/p\u003E\n\u003Cp\u003E\nAgain, this would all vary depending on the biome, type of planet, and possibly some other factors.\n\u003C/p\u003E\n\u003Cp\u003E\nLet me know what you all think \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"B.Riches2500","CreatedById":210329,"CreatedDateTime":"2021-03-27T18:37:22Z","Content":"\n\u003Cp\u003E\nExtra: My brother added that if you did the science on ice then it could be a hockey puck and stick rather than a golf ball and club. \n\u003C/p\u003E\n"},{"CreatedByName":"jost","CreatedById":196999,"CreatedDateTime":"2021-03-27T22:18:13Z","Content":"\n\u003Cp\u003E\nCool idea. I\u0027m out of likes for today\n\u003C/p\u003E\n"},{"CreatedByName":"EnderKid2","CreatedById":145622,"CreatedDateTime":"2021-03-27T23:07:26Z","Content":"\n\u003Cp\u003E\nAs far as I know there are three different experiments/animations\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-03-28T14:24:06Z","Content":"\n\u003Cp\u003E\nI like this. Build a sand castle in desert too? Trouble is on other planets where all the biomes are basically the same with 2 or 3 exceptions.\n\u003C/p\u003E\n"}]}