{"TopicId":202604,"ForumId":55,"TopicTitle":"Ideas to make pilots more useful?","CreatedByName":"Jack Mcslay","CreatedById":208257,"CreatedDateTime":"2021-05-23T01:39:14Z","PageNum":1,"Articles":[{"CreatedByName":"Jack Mcslay","CreatedById":208257,"CreatedDateTime":"2021-05-23T01:39:14Z","Content":"\n\u003Cp\u003E\nI feel with  how much scientists and engineers have improved over the updates I feel pilots have been getting underwhelming, often times made unnecessary with a probe around. Anyone have ideas to make them more useful?\n\u003C/p\u003E\n\u003Cp\u003E\nOne I had earlier is to allow pilots to control nearby objects: you put a pilot in a ship with a relay-capable antenna, and anything that is near enough to have a comms signal to that ship but not to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E can be controlled by the pilot like it was connected to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, with pilot level determining the minimal signal strength required for control. This would also incentivize motherships\n\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2021-05-23T01:45:20Z","Content":"\n\u003Cp\u003E\nThey used to be more useful when the “\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E on for everything from the start” bug didn’t exist. \n\u003C/p\u003E\n\u003Cp\u003E\nIve seen someone do fuel consumption with pilots so a pilot uses less fuel than a non-pilot which I liked.\n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2021-05-23T01:57:17Z","Content":"\n\u003Cp\u003E\nThis exact use case is already implemented in the game. It just doesn\u0027t get much attention.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s called a \u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/Probe_Control_Point\u0022 rel=\u0022external nofollow\u0022\u003EProbe Control Point\u003C/a\u003E. That link takes you to the Kerbal Wiki on the concept.\n\u003C/p\u003E\n\u003Cp\u003E\nIt allows pilots in suitable command capsules to control certain probes fitted with \u0022remote pilot assist available\u0022 probe cores without needing a link to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E as long as they have a relay antenna capable of reaching the remote probe.\n\u003C/p\u003E\n"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2021-05-25T03:21:48Z","Content":"\n\u003Cp\u003E\nOne thing I think would be great is if pilots of a certain level could execute maneuver nodes automatically. Perhaps they could do it semi-manually at level 4, so that you push a button and the whole burn gets executed, and at level 5 they could do it fully automatically, so that a maneuver node you set in advance gets done even if you time-warp past it.\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2021-05-25T15:15:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223977237\u0022 data-ipsquote-contentid=\u0022202604\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221621733954\u0022 data-ipsquote-userid=\u0022208257\u0022 data-ipsquote-username=\u0022Jack Mcslay\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 5/23/2021 at 4:39 AM, Jack Mcslay said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnyone have ideas to make them more useful?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThese lazy jerks can be janitors, diggers, lab technicians, senior managers, waiters, and have other duties.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I calculate a crew for something like a Martian expedition, there is always a Pilot, who is an unqualified jack-of-all-trades for others when they are on Mars.\u003Cbr\u003E\nAlso he is the expedition boss (at least he thinks so).\n\u003C/p\u003E\n\u003Cp\u003E\nAlso they are expendable ballast, because you need geologists and doctors on Mars, not a flyar.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-05-25T15:15:33Z\u0022 title=\u002205/25/2021 03:15  PM\u0022 data-short=\u00223 yr\u0022\u003EMay 25, 2021\u003C/time\u003E by kerbiloid\u003C/strong\u003E\n\u003C/span\u003E\n"}]}