{"TopicId":39163,"ForumId":55,"TopicTitle":"Engine fairings / engine mount plate","CreatedByName":"maro","CreatedById":31847,"CreatedDateTime":"2013-07-26T18:37:44Z","PageNum":1,"Articles":[{"CreatedByName":"maro","CreatedById":31847,"CreatedDateTime":"2013-07-26T18:37:44Z","Content":"\n\u003Cp\u003EIf you now place an engine below a tank and then a decoupler below the engine - you get automatic a fairing around the engine. This works well as long as the diameter of the tank above and the diameter of the decoupler below are the same and the engine is centerline. More complex engine placements like multi engine stages or a small diameter engine below a big tank are not supported.\u003C/p\u003E\u003Cp\u003EIf you look at the picture\u003C/p\u003E\u003Cp\u003E1) below the capsule and the x-200-8 is a poddle - looks/works perfect\u003C/p\u003E\u003Cp\u003E2) below that is a 909 and i use the space below the tank for adding RCS and bats - 909 engine has fairing but wrong diameter\u003C/p\u003E\u003Cp\u003E3) below is a 3 engine layout - would work well - but the engine mounting has more diameter then the nozle. Would fit well if the engines mountig is not so wide and there are no engines fairings at all\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img341.imageshack.us/img341/7453/m2mx.jpg\u0022 alt=\u0022m2mx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow my suggestions\u003C/p\u003E\u003Cp\u003E1) To enable the use of the area around the engine mount like shown above (2) every engine should be connected to the tank only with a thin mounting - just a small frame and tubes. This would allow to use this area for additional things like RCS tanks as shown.\u003C/p\u003E\u003Cp\u003E2) To enable a automatic engine(s) fairing between stages with every configuration there should be new parts - lets call it \u0022engine mount plate\u0022. It has to be placed between the tank and the engine(s)\u002Badd. parts below and its diameter is the \u0022target\u0022 for the automatic engine fairing - and not the diameter of the engine as now - as alos the target for the structural stability. Because right now the engine itself is a structural part in the stack and that is not realistic. Bcause if one now builds such a stack one has to add a lot of struts to enable stability.\u003C/p\u003E\u003Cp\u003EThis way the decoupler below and the \u0022engine mount plate\u0022 will work together, building a automated strut/fairing around everything between them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-26T18:41:55Z\u0022 title=\u002207/26/2013 06:41  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 26, 2013\u003C/time\u003E by maro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2013-07-26T18:46:26Z","Content":"\n\u003Cp\u003EAdding procedural fairings that adapt to what\u0027s under and above is planned, someone suggested this a while ago, and IIRC, Nova replied that it was somewhere down the development line.\u003C/p\u003E\n"}]}