{"TopicId":39579,"ForumId":55,"TopicTitle":"full patch notes","CreatedByName":"Thunderbird","CreatedById":10459,"CreatedDateTime":"2013-07-28T03:39:30Z","PageNum":1,"Articles":[{"CreatedByName":"Thunderbird","CreatedById":10459,"CreatedDateTime":"2013-07-28T03:39:30Z","Content":"\n\u003Cp\u003EIf i completely missed them somewhere, slap me and ignore the rest of the post please.\u003C/p\u003E\u003Cp\u003EIt would be nice if we had a complete list of changes done every patch, preferably in some \u0022in-your-face\u0022 location - like inside the patcher or on the game title screen.\u003C/p\u003E\u003Cp\u003EThe last patch, from what i was able to figure out, changed something with attachment nodes - im not visiting the forum much so it took me quite a while to find out whats going on and im just guessing anyway, and the first thing i do when i start patching a game is going through the patch notes, and i only found a brief list of changes which was not much of a help with the current problems i have with the game.\u003C/p\u003E\u003Cp\u003EIm sure modders would appreciate a complete list of changes as well, so they can get our favorite mods that we cant build anything with working :-)\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-07-28T03:50:18Z","Content":"\n\u003Cp\u003EThe changelog only works if the devs remember to put all the changes in it, heh. One undocumented feature I know of is the RCS translation compensation that happens in precision control mode.\u003C/p\u003E\u003Cp\u003EI assume you read the readme.txt?\u003C/p\u003E\n"},{"CreatedByName":"Cepheus","CreatedById":10683,"CreatedDateTime":"2013-07-28T03:51:16Z","Content":"\n\u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/1iywqj/official_kerbal_space_program_21_released/\u0022 rel=\u0022external nofollow\u0022\u003EHere you are.\u003C/a\u003E\n"},{"CreatedByName":"Majiir","CreatedById":7550,"CreatedDateTime":"2013-07-28T04:29:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Supernovy\u0022 data-cite=\u0022Supernovy\u0022\u003E\u003Cdiv\u003EThe changelog only works if the devs remember to put all the changes in it, heh.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe devs use source control, so unless they\u0027re using it \u003Cem\u003Every\u003C/em\u003E poorly, they already have an authoritative list of changes between versions. Source control logs are usually a bit cluttered and don\u0027t make a lot of sense to people not familiar with the codebase, but it doesn\u0027t take much to comb through and produce a changelog for public consumption. Make writing changelogs the responsibility of whoever submits a feature branch for merging and all that remains is the fixes and minor changes on the integration branch.\u003C/p\u003E\n"},{"CreatedByName":"Thunderbird","CreatedById":10459,"CreatedDateTime":"2013-07-28T04:35:51Z","Content":"\n\u003Cp\u003Eyeah.... i meant a complete list... not a brief overview of changes... that list in readme and what Cepheus linked is what i consider a brief overview\u003C/p\u003E\u003Cp\u003Eguess what Majiir said would be best, i dont know how those work :-)\u003C/p\u003E\n"}]}