{"TopicId":39616,"ForumId":55,"TopicTitle":"Docking Alignment on Navball","CreatedByName":"KwirkyJ","CreatedById":62790,"CreatedDateTime":"2013-07-28T08:31:01Z","PageNum":1,"Articles":[{"CreatedByName":"KwirkyJ","CreatedById":62790,"CreatedDateTime":"2013-07-28T08:31:01Z","Content":"\n\u003Cp\u003EI would be unsurprised if this has been suggested before, but my cursory glance did not reveal it...\u003C/p\u003E\u003Cp\u003EA feature that seems lacking is the inability to determine axial alignment of docking ports when attempting to rendezvous. While the ports and velocities can be well aligned by virtue of the indicators on the navball, orientation remains unknown. I would like to see this remedied in some fashion, be it a \u0027gunsight,\u0027 inverse-normal, etc. At present, users have to make do with the functionality found in the Lazor Docking Camera mod (subset), or comparable.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-07-28T08:34:56Z","Content":"\n\u003Cp\u003EI usually look out the window to check orientation.\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-07-28T10:01:26Z","Content":"\n\u003Cp\u003EI\u0027ve found(in the three times I\u0027ve docked things) that the big mamma jamma docking ports are really easy to dock with, even if your RCS is unbalanced and you have no idea what you\u0027re doing(like me \u0026gt;_\u0026gt; ).\u003C/p\u003E\u003Cp\u003EThe teeny, tiny docking thingeddies, however, kill my brain trying to dock. I\u0027d love it if they had a wonky periscope type thing for early docking ports with more advanced docking ports(in career mode, i mean) have like fancy docking computers or cameras.\u003C/p\u003E\u003Cp\u003EBut yeah, being able to target a docking port and have a marker show up on the navball would be nice, too \u0026gt;_\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-28T10:05:19Z","Content":"\n\u003Cp\u003EWhat if I told you.. \u003C/p\u003E\u003Cp\u003Eyou already can. Click in docking ports to target them.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2013-07-28T14:43:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tw1\u0022 data-cite=\u0022Tw1\u0022\u003E\u003Cdiv\u003EWhat if I told you.. \u003Cp\u003Eyou already can. Click in docking ports to target them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think that\u0027s quite what he\u0027s asking for. That will show the direction to the correct docking port, but not whether you\u0027re perpendicular to the port so that the docking adaptors will engage. Right now the only way to check that is to use the free-view or chase camera, or be absolutely militant about preplanning docking port alignments.\u003C/p\u003E\u003Cp\u003EThis may go away if we get more (and more useful) IVA/first-person views, but for now it\u0027s a bit of a hassle.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-28T17:08:46Z\u0022 title=\u002207/28/2013 05:08  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 28, 2013\u003C/time\u003E by Anton P. Nym\u003C/strong\u003E\n\u003Cbr\u003Efixing busted grammar, clarifying\n\u003C/span\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-28T15:04:39Z","Content":"\n\u003Cp\u003EI still don\u0027t really get what the suggestion is. If you right-click on your docking port to \u0022control from here\u0022, and you select the other ship\u0027s docking port as your target, then you can use the Navball to perfectly line up both ships\u0027 docking ports. The only thing you can\u0027t match with this method is rotation, which does not affect docking itself.\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-28T15:55:23Z","Content":"\n\u003Cp\u003EWhy not just switch to the other craft and turn the docking port the right way?\u003C/p\u003E\n"},{"CreatedByName":"Yourself","CreatedById":4465,"CreatedDateTime":"2013-07-28T16:04:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003EWhy not just switch to the other craft and turn the docking port the right way?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re not in an equatorial orbit, there is no \u0022right way\u0022. It may also be a huge pain to re-orient the target. Overall having an orientation indicator on the Navball is way simpler and way easier to deal with. The way I envision it is that there would be another indicator on the Navball that, if you were to point towards it, your docking port would be oriented properly for the target. This has the added bonus that if the orientation indicator and existing bearing indicator are lined up, then you\u0027re perfectly lined up to dock.\u003C/p\u003E\n"},{"CreatedByName":"innovine","CreatedById":76487,"CreatedDateTime":"2013-07-28T19:12:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yourself\u0022 data-cite=\u0022Yourself\u0022\u003E\u003Cdiv\u003EIf you\u0027re not in an equatorial orbit, there is no \u0022right way\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould you elaborate on this a bit? Why is a non-equatorial orbit any different, doesn\u0027t it just tilt everything to the inclination?\u003C/p\u003E\u003Cp\u003EI\u0027ve been trying to avoid external views and use mostly IVA for approach and docking, and I think I\u0027ll get it eventually (I\u0027m sticking to equatorial orbits at the moment tho). But I think that as long as the target port is pointing to the orbit normal, and you approach from there, oriented towards the orbit anti-normal, it\u0027s a matter of translating so you line up the pink target on your nose and then close the distance. I suspect you could calculate the rotation of the docking port by where you are in the orbit. Docking like this is perfectly achievable just looking at the current navball, and I guess with a bit of practice it\u0027s possible to do the approach this way too..). Doing all this in a non-equatorial orbit seems to my limited understanding to be the very same, just at an inclination (making the navball harder to read, but I don\u0027t see how any ambiguity would come into it, making it impossible). AFAIK there is always a \u0027right way\u0027, which is pointing to the orbit normal.\u003C/p\u003E\n"},{"CreatedByName":"innovine","CreatedById":76487,"CreatedDateTime":"2013-07-28T19:37:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yourself\u0022 data-cite=\u0022Yourself\u0022\u003E\u003Cdiv\u003Ethat there would be another indicator on the Navball that, if you were to point towards it, your docking port would be oriented properly for the target\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe navball is already pretty crowded. Another indicator \u003Cem\u003Eon\u003C/em\u003E it is not necessary, just a little marker on the \u003Cem\u003Eedge\u003C/em\u003E, which moves around along the outside edge. When it\u0027s at the 12 o clock position you know your port at the target port are aligned. If it\u0027s at 5, you\u0027ll need to roll over 30 degrees.\u003C/p\u003E\n"},{"CreatedByName":"Yourself","CreatedById":4465,"CreatedDateTime":"2013-07-28T21:15:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022innovine\u0022 data-cite=\u0022innovine\u0022\u003E\u003Cdiv\u003ECould you elaborate on this a bit? Why is a non-equatorial orbit any different, doesn\u0027t it just tilt everything to the inclination?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, it doesn\u0027t just tile anything. Typically when docking you point everything in the north-south direction, because that\u0027s orbit normal and anti-normal (so it doesn\u0027t change throughout your orbit, whereas the radial/anti-radial and prograde/retrograde directions rotate as you move through your orbit). The problem is, there\u0027s no clear indication on the navball of the normal direction except in equatorial orbits (and to a slightly more limited extent in polar orbits as well). In an equatorial orbit, pointing north along the horizon on the navball is orbit normal. If you\u0027re in an inclined orbit, there is no one reference spot on the navball for orbit normal, you kind of have to guess by watching very closely for when the prograde and retrograde markers switch sides (this can be tricky because they\u0027re mostly hidden by the edges of the navball). \u003C/p\u003E\u003Cp\u003EFor example, you can\u0027t simply aim 30 degrees east of north if you\u0027re in an orbit that\u0027s inclined 30 degrees from equatorial. There\u0027s exactly two spots in your orbit where orbit Ã‚Â±normal will be 30 degrees from north and that\u0027s at the ascending and descending nodes and at one node you\u0027ll be pointing east of north and the other will have you pointing west of north. In between those points your normal direction will swing through north or south. I mentioned polar orbits earlier and that\u0027s because they\u0027re a somewhat degenerate case here. Their reference direction flips from east to west and vice versa each time you cross a pole, so orientation is workable there, but it gets wonky at the poles.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027ve been trying to avoid external views and use mostly IVA for approach and docking, and I think I\u0027ll get it eventually (I\u0027m sticking to equatorial orbits at the moment tho). But I think that as long as the target port is pointing to the orbit normal, and you approach from there, oriented towards the orbit anti-normal, it\u0027s a matter of translating so you line up the pink target on your nose and then close the distance. I suspect you could calculate the rotation of the docking port by where you are in the orbit. Docking like this is perfectly achievable just looking at the current navball, and I guess with a bit of practice it\u0027s possible to do the approach this way too..). Doing all this in a non-equatorial orbit seems to my limited understanding to be the very same, just at an inclination (making the navball harder to read, but I don\u0027t see how any ambiguity would come into it, making it impossible). AFAIK there is always a \u0027right way\u0027, which is pointing to the orbit normal.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem I have with this is it makes things more difficult than it needs to be. For example, when I\u0027m building a space station I usually launch up that 6-sided hub first. If I have to line my docking ports up with orbit normal (which as I pointed out above is not always trivial to find), then there\u0027s 3 different orientations I have to put the station in to attach the various pieces. Having to reorient all my docking spacecraft because the interface is lacking a basic feature isn\u0027t really that fun.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022innovine\u0022 data-cite=\u0022innovine\u0022\u003E\u003Cdiv\u003EThe navball is already pretty crowded. Another indicator \u003Cem\u003Eon\u003C/em\u003E it is not necessary, just a little marker on the \u003Cem\u003Eedge\u003C/em\u003E, which moves around along the outside edge. When it\u0027s at the 12 o clock position you know your port at the target port are aligned. If it\u0027s at 5, you\u0027ll need to roll over 30 degrees.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree with it being too crowded since there\u0027s only 2 things on it when you\u0027re docking and the goal in this case would be getting them all lined up (which kind of reduces it to one \u0022thing\u0022 on the navball when your alignment is good). And, the typical docking procedure would be to first line up the direction you\u0027re pointing with the orientation marker, so most of the time it\u0027s not something you really have to pay attention to. But putting that aside I\u0027m reminded of previous suggestions to have the navball horizon align itself with the target docking port. I feel that\u0027s a bit confusing (and I would argue that it might even be an easy thing to miss), but it does avoid the \u00223 things\u0022 complaint.\u003C/p\u003E\u003Cp\u003EThe problem with using a marker on the edge is that it\u0027s only capable of displaying one rotational degree of freedom and, in order to dock, you need at minimum two rotational degrees of freedom to line up with the docking port axis; 3 would be nice so we could get the roll stuff lined up as well, but strictly speaking it\u0027s not necessary to do that to dock successfully (and it\u0027s also not what we\u0027re talking about). A marker at the edge would be fine for doing the roll orientation, but you don\u0027t \u003Cstrong\u003Eneed\u003C/strong\u003E that to dock. You do \u003Cstrong\u003Eneed\u003C/strong\u003E to line up with the docking axis, which is where the whole orbit normal thing comes from: it\u0027s a convenient axis that\u0027s invariant throughout the orbit, so rather than actually aligning the spacecraft with one another, we actually align them with some other axis.\u003C/p\u003E\u003Cp\u003EThat said, aligning things with orbit normal also requires that you be able to control the target vessel and, while that\u0027s usually the case, I think it\u0027s an unnecessary limitation. Maybe I want to go rescue a dead probe or something\u003C/p\u003E\n"},{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-07-28T21:59:57Z","Content":"\n\u003Cp\u003EMaybe I\u0027m doing things very differently than you guys when docking. What I do is this:\u003C/p\u003E\u003Cp\u003EGet a rendezvous. Target ship. Point towards it and burn to approach, then come to a standstill. Switch to the target, then turn so that the docking port is facing the approaching ship. Switch back to your original ship, line up your docking port with the target docking port, do a burn so you approach. Readjust carefully to correct for drift, and dock. You don\u0027t have to be concerned about lining the ports up relative to your orbit at all.\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2013-07-28T22:12:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kimberly\u0022 data-cite=\u0022Kimberly\u0022\u003E\u003Cdiv\u003ESwitch to the target, then turn so that the docking port is facing the approaching ship.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile it works, this part doesn\u0027t always work well when docking to a large, oddly shaped vessel. (Aside from the habit of some vessels to explode when switching vessels. Maybe that\u0027s been fixed, though.) I like the idea of having an alignment marker on the navball.\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-07-29T00:55:38Z","Content":"\n\u003Cp\u003EAgreed something similar to mechjeb\u0027s smart A.S.S. with \u002BPar, -Par indicators just like retrograde and prograde would be nice.\u003C/p\u003E\n"},{"CreatedByName":"Pixel of Life","CreatedById":45646,"CreatedDateTime":"2013-07-29T01:45:06Z","Content":"\n\u003Cp\u003ELazor Docking Cam helps a lot. A similar thing in the stock game would be nice though.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-07-29T06:35:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022innovine\u0022 data-cite=\u0022innovine\u0022\u003E\u003Cdiv\u003EThe navball is already pretty crowded. Another indicator \u003Cem\u003Eon\u003C/em\u003E it is not necessary, just a little marker on the \u003Cem\u003Eedge\u003C/em\u003E, which moves around along the outside edge. When it\u0027s at the 12 o clock position you know your port at the target port are aligned. If it\u0027s at 5, you\u0027ll need to roll over 30 degrees.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think roll is the thing the OP is talking about, it\u0027s about skew. And I think the problem can be solved without really crowding up the nav ball with any more iconography. We can just extend the functionality of the existing navball icons slightly, by making the centre dot of the target reticle represent a position arbitrarily far behind the target docking point along the docking point normal, like so:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/20pyDP0.png\u0022 alt=\u002220pyDP0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith this iconography, if you align the \u0022ring\u0022 icons (target and velocity vector) and also align the \u0022dot\u0022 icons (target rear normal and craft nose) then you will hit the target with the docking ports properly aligned. If you align all four icons then you will hit the docking port perfectly perpendicular.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T06:42:08Z\u0022 title=\u002207/29/2013 06:42  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LoneRider","CreatedById":76103,"CreatedDateTime":"2013-07-29T07:12:00Z","Content":"\n\u003Cp\u003EWell, this might be useful, but personally i dont think i need it (have done over a dozent docks without any help like that). You can see when you are not in line with the direction of the docking port and use RCS to burn sideways to correct it by looking out of the window. If it was just a small dot like in your example, it would be ok, but not any bigger please.\u003C/p\u003E\u003Cp\u003Ehmm... might be a help, yes... hmm...\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-07-29T07:25:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LoneRider\u0022 data-cite=\u0022LoneRider\u0022\u003E\u003Cdiv\u003EWell, this might be useful, but personally i dont think i need it (have done over a dozent docks without any help like that). You can see when you are not in line with the direction of the docking port and use RCS to burn sideways to correct it by looking out of the window. If it was just a small dot like in your example, it would be ok, but not any bigger please.\u003Cp\u003Ehmm... might be a help, yes... hmm...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t need it for small craft, since it\u0027s easy to make any necessary corrections to attitude at the last minute.\u003C/p\u003E\u003Cp\u003EWith big craft that take a long time to change attitude, or when attempting to connect multiple docking ports, things are a lot harder and being able to get properly lined up ahead of time is pretty important. The bigger you get, the more necessary it becomes. \u003C/p\u003E\u003Cp\u003EIt also becomes harder to simply *see* the docking ports properly once ships get really big. The ship on the right in the picture below has a really complex 8 point docking with two of the ports hidden away inside the structure of the ship to make the central spine look nicer. This was VERY HARD to dock without an alignment indicator.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/U7zAfd5.jpg\u0022 alt=\u0022U7zAfd5.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-07-29T08:03:29Z","Content":"\n\u003Cp\u003EI think, realistically, these kind of refinements will come in the form of a docking cam.\u003C/p\u003E\u003Cp\u003EThe dot on the navball idea isn\u0027t bad... but it may, ironically, make it more difficult for new players to use (too many things to master and understand). Might be good as a settings option.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-29T08:11:38Z","Content":"\n\u003Cp\u003EThough I\u0027ve never really used docking mode, maybe this could be something that comes with that?\u003C/p\u003E\u003Cp\u003ECome to think of it, not sure how that extra display you get in docking mode works. To the tutorial section!\u003C/p\u003E\n"},{"CreatedByName":"Anthlon","CreatedById":58074,"CreatedDateTime":"2013-07-29T17:03:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EI don\u0027t think roll is the thing the OP is talking about, it\u0027s about skew..\u003Cp\u003EWith this iconography, if you align the \u0022ring\u0022 icons (target and velocity vector) and also align the \u0022dot\u0022 icons (target rear normal and craft nose) then you will hit the target with the docking ports properly aligned. If you align all four icons then you will hit the docking port perfectly perpendicular.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis might solve the idea, which I do agree, maybe \u003Cstrong\u003E\u003Cspan style=\u0022color:#B22222;\u0022\u003Eonly\u003C/span\u003E\u003C/strong\u003E if \u0022\u003Cstrong\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003Edocking port\u003C/span\u003E\u003C/strong\u003E\u0022 is targeted, and than you will try to maneuver to have ring around dot and maintain suitable approach speed, and its done. \u003C/p\u003E\u003Cp\u003EYes! - you can look out from window/use external camera, but when we do have IVA pods, we can dock from IVA, why not, nothing leaved, just added option-to. This will not add anythin extra (new dot) to navball to make it even crowded.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EMaybe for another discusion, navball could be with switchable symbols (the other ones..) including this at that point.\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"filami","CreatedById":60217,"CreatedDateTime":"2013-07-29T17:25:52Z","Content":"\n\u003Cp\u003EPlus one for the indicator on the navball. Not so sure about the moving dot however, really nice idea but I am afraid that it will be hard to properly align the dot to the centre of the ring. Our eyes could misjudge centrality and that would be enough to miss the docking port. I would suggest the Purple ring to have a small dot in the centre while Par\u002B indicator would be a bigger purple dot. I think that would help better.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-07-29T17:49:49Z","Content":"\n\u003Cp\u003ECertainly, it\u0027s more just the idea that matters. The actual navball icons right now are quite large and cartoonish, fits the style of the game very well but they do take up somewhat more space than they need to and their thickness is what makes things look a bit cluttered. I also play DCS (flight sim) and the amount of information and iconography packed into an equally small space is much much higher. So it\u0027s not the overall amount of information that is the problem, it\u0027s just that the icons need to be cleaned up slightly, made a bit sharper, so you can more easily use them when they are overlayed.\u003C/p\u003E\u003Cp\u003EBy the way, if by \u0022miss centrality\u0022 you mean it would be difficult to judge where the centre of the purple circle is... that\u0027s no different from now. Right now you have to align your nose (a dot) in the velocity vector (a ring) as part of the process. That\u0027s partly why I suggested aligning the rings (velocity vector to target ring)... easy to tell when those are over each other, and similarly with the two dots.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-29T17:52:35Z\u0022 title=\u002207/29/2013 05:52  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 29, 2013\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"filami","CreatedById":60217,"CreatedDateTime":"2013-07-29T18:33:18Z","Content":"\n\u003Cp\u003EActually, you got a good point there. Lets hope devs will read this and try it out, that would be great =)\u003C/p\u003E\n"},{"CreatedByName":"KwirkyJ","CreatedById":62790,"CreatedDateTime":"2013-07-30T03:32:03Z","Content":"\n\u003Cp\u003EI feel bad, reposting the image (below), but it captures the idea I meant to convey very well. This is exactly the concept, and I apologize for any confusion. Yes, one can point your heading directly towards the other docking node, but that is no guarantee of the two being parallel (coaxial, etc, etc), and this is an issue that comes into play very much when maneuvering bulky craft -- even in general, a trivial craft needs to be fairly well aligned to dock easily. While the quoted implementation might not be ideal, it\u0027s a step in the right direction, I think. The level of attention this thread has received is... unexpectedly great.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EI don\u0027t think roll is the thing the OP is talking about, it\u0027s about skew. And I think the problem can be solved without really crowding up the nav ball with any more iconography. We can just extend the functionality of the existing navball icons slightly, by making the centre dot of the target reticle represent a position arbitrarily far behind the target docking point along the docking point normal, like so:\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/20pyDP0.png\u0022 alt=\u002220pyDP0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith this iconography, if you align the \u0022ring\u0022 icons (target and velocity vector) and also align the \u0022dot\u0022 icons (target rear normal and craft nose) then you will hit the target with the docking ports properly aligned. If you align all four icons then you will hit the docking port perfectly perpendicular.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"}]}