{"TopicId":40711,"ForumId":55,"TopicTitle":"Poor kerbals need help :(","CreatedByName":"Bluestorm","CreatedById":74254,"CreatedDateTime":"2013-08-02T20:52:39Z","PageNum":1,"Articles":[{"CreatedByName":"Bluestorm","CreatedById":74254,"CreatedDateTime":"2013-08-02T20:52:39Z","Content":"\n\u003Cp\u003EI\u0027m suggesting Kerbal damage system, medical system and more face animations (like tears). Why ? Because everybody killing poor kerbals and leaving them on far planets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E For example: Now, if you will leave the kerbal on mun you will probably say: \u0022Phew, who cares about that little green idiot ? There is so much of them!!\u0022 But with my idea you will never left that kerbal. If he will be wounded, he will start crying and he will need medical help. It will be really useful in carrer mode, because decision to left kerbal on mun will decrease your reputation and volunteers to join your Space Program. You will also be sad, because that little kerbal must die on faar planet. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I am suggesting 1 minute of silent for that Kerbals who died \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dlmarti","CreatedById":70037,"CreatedDateTime":"2013-08-02T21:07:26Z","Content":"\n\u003Cp\u003EWith the addition of addon reaction wheels, there is no need for kerbals on a mission.\u003C/p\u003E\n"},{"CreatedByName":"Bluestorm","CreatedById":74254,"CreatedDateTime":"2013-08-02T21:24:25Z","Content":"\n\u003Cp\u003E@up But KERBAL Space Program don\u0027t have any sense without Kerbals :I\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-02T22:30:48Z","Content":"\n\u003Cp\u003EKerbals are totally still needed on missions. Driving a rover around is fun, but it\u0027s more fun when you see a kerbonaut\u0027s silly grin as he plows over rough terrain. Or even just bouncing around on the surface of a low-gravity body, like Mun or something. It\u0027s just more fun with a kerbonaut.\u003C/p\u003E\u003Cp\u003EAlso, I think kerbonauts are going to matter at least somewhat in career mode. I don\u0027t know any specifics(like pretty much all of us here) but I think we might have a PR mechanic of some sort. Maybe with a handful of successful kerbals, we can get more funding. Or maybe it\u0027ll be more simplistic, like...if you kill a lot of kerbonauts, that just means you have to pay for more over and over, taking funding away from other things(like research and development).\u003C/p\u003E\u003Cp\u003EEven without PR or the funding problem, you probably won\u0027t be able to complete some missions if you leave kerbonauts behind or if they get killed during the mission. Or maybe your payout will be reduced per casualty or something like that.\u003C/p\u003E\u003Cp\u003EI don\u0027t know, they\u0027ve probably got something awesome percolating up in their minds, we\u0027ll just have to wait another month or two to see what it is.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-02T22:35:00Z\u0022 title=\u002208/02/2013 10:35  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 2, 2013\u003C/time\u003E by Beeman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaisman","CreatedById":3187,"CreatedDateTime":"2013-08-03T22:48:10Z","Content":"\n\u003Cp\u003EI need kerbonauts (who will drive crazy rovers, plant flags, swim, fly along great river e t.c.) but i always try to bring \u0027em home. And if mission itself - one way, I\u0027m always build rescue mission. So my \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Epoor\u003C/span\u003E brave green men \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ealmost\u003C/span\u003E always return home.\u003C/p\u003E\u003Cp\u003EI think rescue - challenge itself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"quietsamurai98","CreatedById":69270,"CreatedDateTime":"2013-08-03T23:00:29Z","Content":"\n\u003Cp\u003EMaybe there could be a list of all the stranded Kerbonauts and their craft, location, and the number of days stranded on the right side of the Tracking Center screen\u003C/p\u003E\n"},{"CreatedByName":"MrKicker","CreatedById":77424,"CreatedDateTime":"2013-08-04T00:43:27Z","Content":"\n\u003Cp\u003EI like this idea, and mayby have a part simular to habitation modual for medical use on stations and large craft.\u003C/p\u003E\n"},{"CreatedByName":"Highrock","CreatedById":72655,"CreatedDateTime":"2013-08-16T01:12:18Z","Content":"\n\u003Cp\u003EAs a part of the physical aspects of kerbals there should be a random encounter ,or it could be joined with the stupidity factor, that during launch or upon achieving orbit the kerbal on board vomits. The animation adds a comedic value that the emotion faces already show. It could be something like a greenish splat on the visor of their helmet and gets cleared after a short while. This animation could also be used with space planes when they go spinning wildly. I\u0027d never thought about this idea until my girlfriend asked me if they did vomit while she laughed at the faces they were making during the launch.\u003C/p\u003E\n"},{"CreatedByName":"plainawesome","CreatedById":76282,"CreatedDateTime":"2013-10-13T13:50:02Z","Content":"\n\u003Cp\u003ETo be honest, I would think that crying would fall under the mental health category\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-10-13T17:14:32Z","Content":"\n\u003Cp\u003Ebeen spending all my time since before 0.21 was released trying to get some kerbals back from Duna...\u003C/p\u003E\u003Cp\u003EThe rescue mission has so far left several more of them stranded there though...\u003C/p\u003E\u003Cp\u003EMaybe in 0.22 I\u0027ll send a colonisation mission instead, lol.\u003C/p\u003E\n"},{"CreatedByName":"slin3","CreatedById":59876,"CreatedDateTime":"2013-10-13T21:10:34Z","Content":"\n\u003Cp\u003Ean official life support system should definitely be in the final game, as well as penalties for harming Kerbals in career mode. I also like the idea of a new stat for Kerbals: sanity. Send a single Kerbal in a tiny capsule to the Mun and leave him there for a while? His sanity will decrease and any scientific experiments he does will yield less scientific progress due to errors and inefficiency. At some point of low sanity your Kerbal might be uncontrollable for short times and do crazy things. If he has 0 sanity he will be completely uncontrollable and you have to catch him with other Kerbals and send him into therapy (costs money and Kerbal is unavailable). Of course the Sanity stat is nothing I would consider a priority or must have. Just an idea I had that might be a cool addition after V1.0.\u003C/p\u003E\n"}]}