{"TopicId":40927,"ForumId":55,"TopicTitle":"Spacecraft Stress Testing Simulator and use of Science Parts","CreatedByName":"Renoch","CreatedById":69257,"CreatedDateTime":"2013-08-04T04:20:08Z","PageNum":1,"Articles":[{"CreatedByName":"Renoch","CreatedById":69257,"CreatedDateTime":"2013-08-04T04:20:08Z","Content":"\n\u003Cp\u003EHad an idea today while I was pondering the destruction of my Minmus lander a while back. The Parachute caused such rapid deceleration that most of the parts ripped right off the Pod, which I\u0027m sure has happened to most of us at one point or another. However, it got me thinking. What if we had a new building, for setting up parameters for testing things like re-entry, landings, etc.?\u003C/p\u003E\u003Cp\u003EThen it got me thinking a bit more ambitiously, especially as I was discussing the idea with a friend. We thought up an idea that could potentially be for Career mode in regards to this simulation building. Perhaps the data from the scientific parts, such as gravity and air pressure, could be needed in career mode to allow simulating the conditions of that celestial body? So in order to see if your parachutes would adequately slow down your Duna-bound payload, or see if you could get that Mun lander back into orbit, you\u0027d have to send a probe with those science parts to get the information you need...most likely by crashing the probe into the planet, or trying to land it on the surface. \u003C/p\u003E\u003Cp\u003EWon\u0027t be surprised if it\u0027s outside of the confines of the engine, or too much for a minor features, but thought I\u0027d poke it out there and see what people think.\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-04T22:27:04Z","Content":"\n\u003Cp\u003EThere\u0027ve been suggestions for various testing areas being added to KSC. A payload building, for example, where you can build rovers with a little obstacle course behind it. A VR launch building where you load up rockets you\u0027ve designed to see if they work properly without wasting money launching them. Or like, a wind tunnel where you can place your rockets or aircraft to see if they\u0027re aerodynamic and what-not.\u003C/p\u003E\u003Cp\u003EI like most of these suggestions, but maybe they should be limited in usefulness based on your tech tree somehow. Maybe you have to research testing grounds as you start to get more advanced parts(like rover parts and the like) to make sure everything\u0027s going to work out properly.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2013-08-04T22:35:55Z","Content":"\n\u003Cp\u003EI think it would be cool to use scientific instrument data, where you have to go ot the body in question, and send a probe to get the correct gravitational readings, as well as atmospheric data. Then you could send your craft into a room that looks like a very old 3D vector graphics game with variable terrain, and gravity and atmosphere set to what the probe\u0027s data sent back. The craft\u0027s height could be adjusted, and you could set the amount of fuel the ship should have in it.\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-04T22:59:49Z","Content":"\n\u003Cp\u003EGathering scientific data then using it in a test room/computer is actually a really good idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou can start with rough estimates which get more precise after sending a probe or two to gather scientific data...and when you send a lander or rover, you can get /really/ precise data for your test lab. Maybe there\u0027ll be certain experiments which can only be run by kerbonats that you have to do to be able to establish a base on the planet or something. \u003C/p\u003E\u003Cp\u003EI don\u0027t even know, but it\u0027s a really good idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}