{"TopicId":41121,"ForumId":55,"TopicTitle":"You know what this is about - DAMN SOLAR PANELS","CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-05T09:52:58Z","PageNum":1,"Articles":[{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-05T09:52:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EFeel free to bring this up in suggestions. That\u0027s why they are there\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo then....\u003C/p\u003E\u003Cp\u003ETo raise this issue, I have made this thread. To those who are like \u0022whaaa?\u0022 this is about the removal of the \u0022snap to\u0022 gigantor solar panel point. I have raised this in the general chat but now its a suggestion/rage/protest/sit down for cookies\u003C/p\u003E\u003Cp\u003EWhat do \u003Cstrong\u003EYOU\u003C/strong\u003E think?\u003C/p\u003E\n"},{"CreatedByName":"FEichinger","CreatedById":58255,"CreatedDateTime":"2013-08-05T10:00:36Z","Content":"\n\u003Cp\u003EAlright, I\u0027ve watched this for long enough. I\u0027m gonna ask you only this once to \u003Cem\u003Ecalm down\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EYes, you\u0027re disappointed that this was removed, I get it, but that doesn\u0027t justify \u003Cem\u003Econstant\u003C/em\u003E rage and complaints. Show some patience and either wait for Squad to take care of it - or change it yourself (or get someone to help you change it) - this would be a simple part mod, nothing else. Posting what amounts to \u0022Waaaaaah change dis nao!\u0022 isn\u0027t getting you anywhere and it\u0027s just disrespectful to everyone involved.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFEichinger\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EP.S.: For the record, this is in reference to both the title\u0027s phrasing and the specific mention of \u0022rage/protest\u0022 in the post body - and all of this on top of the contents of the previous thread.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-05T10:03:43Z\u0022 title=\u002208/05/2013 10:03  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 5, 2013\u003C/time\u003E by FEichinger\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"shand","CreatedById":57781,"CreatedDateTime":"2013-08-05T10:10:32Z","Content":"\n\u003Cp\u003EWell put FEichinger.\u003C/p\u003E\u003Cp\u003E@Rhyunix: \u0022mod\u0022 in the old part - i cant imagine anything has changed to stop it working.\u003C/p\u003E\u003Cp\u003EAlso: my two cents, I can see no difference in the behaviour of the part (i played 19 then 21 to check), this might be because I use snap-to-fit in the VAB rather then \u0022manual\u0022 mode, or it might be i\u0027m not doing crazy enough things with my solar panels.\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-07T09:32:45Z","Content":"\n\u003Cp\u003EI\u0027m gonna push the boat out on my luck here -\u003C/p\u003E\u003Cp\u003EIts not a serious rant. I apologize for activating the sensible mature side of yourself (which frankly I have no idea what is formed up of) by putting in rage/protest. Its supposed to be a humorous suggestion, summarizing (I hope i can spell) that I am confused about why It was taken away. I\u0027d also like to draw your attention that I \u003Cem\u003Enever demanded for this to be changed \u003C/em\u003EIt was only brought up as an issue\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ei\u0027m not doing crazy enough things with my solar panels\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-07T10:43:33Z","Content":"\n\u003Cp\u003EActually, I thought the node link on the Gigantors has been missing since... well, since forever. At least two or three major versions now. About the only singular time I have ever thought of the node link could be useful was when I put them on the ends of struts - and even then the balance isn\u0027t affected due to symmetry, and aesthetically I can set them down on the center of the strut very easily due to how well its size fits. There are just too few parts that could be used to accept those things. I\u0027m still at a loss as to why the Communotron antenna still has it - it literally makes no sense.\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-07T10:57:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027m still at a loss as to why the Communotron antenna still has it\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen I\u0027m making rovers etc, I usually raise the communotron a little with a tiny strut thing. Apart from that I cant think of any other purpose. However for the solar panels, you could attach it to the rockomax adapter hub, stick it on an attachment point, not have the issue of it being off center and aggravating your inner OCD and so on\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-07T13:44:37Z","Content":"\n\u003Cp\u003EIt makes things a lot neater, that\u0027s for sure.\u003C/p\u003E\n"}]}