{"TopicId":41147,"ForumId":55,"TopicTitle":"Career ideas","CreatedByName":"Kopykat99","CreatedById":60166,"CreatedDateTime":"2013-08-05T14:04:48Z","PageNum":1,"Articles":[{"CreatedByName":"Kopykat99","CreatedById":60166,"CreatedDateTime":"2013-08-05T14:04:48Z","Content":"\n\u003Cp\u003EIm thinking about a some kind of high-tier launch facility in orbit (really high on the tech tree). This facility would be more usefull for building big craft that you would have to assemble in the orbit otherwise. also there should be a small spacestation in keosynch. orbit around kerbin wich you will have to dock stuff in missions and do crew rotations (changing the crew), expanding the station, and de-orbiting if it would be too old to serve its pourpose, and resuply missions. Also some SCIENCE would be pretty nice.\u003C/p\u003E\u003Cp\u003E this post is SUGGESTIONS FOR CAREER (i know its not implemented YET but it will be)\u003C/p\u003E\u003Cp\u003E Sorry for typos im not english, great launches, tons of kabooms, and good luck in future development -kopykat \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif\u0022 alt=\u0022:rolleyes:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Key of door","CreatedById":4130,"CreatedDateTime":"2013-08-06T03:52:57Z","Content":"\n\u003Cp\u003EI believe this has been suggested before, plenty of times, please search before posting.\u003C/p\u003E\u003Cp\u003EAlso wouldn\u0027t you have to get the parts into orbit before you start assembling?\u003C/p\u003E\n"},{"CreatedByName":"Kopykat99","CreatedById":60166,"CreatedDateTime":"2013-08-25T10:04:19Z","Content":"\n\u003Cp\u003Ewell it is hard to serach with a phone (it takes so long to serach something) because my pc cant run the 1st doom \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nalin_Airheart","CreatedById":59462,"CreatedDateTime":"2013-08-25T10:31:10Z","Content":"\n\u003Cp\u003EThis is possible in the stock game, albeit those ships are gonna be insanely weak and made with docking ports. Don\u0027t think Squad is gonna put these in the game ever, it\u0027s definitely in a mod already though.\u003C/p\u003E\n"},{"CreatedByName":"Canopus","CreatedById":57774,"CreatedDateTime":"2013-08-25T10:51:45Z","Content":"\n\u003Cp\u003EWhy not build your ships with docking ports?\u003C/p\u003E\n"},{"CreatedByName":"Apature rocket science","CreatedById":77886,"CreatedDateTime":"2013-08-25T22:45:30Z","Content":"\n\u003Cp\u003EI would like the ship building space station to look like the one in star treack the movie, you know how they build the ships in orbit.\u003C/p\u003E\n"}]}