{"TopicId":42279,"ForumId":55,"TopicTitle":"Way to center spacecraft in VAB and more camera controls inside VAB.","CreatedByName":"fizzix4lyfe","CreatedById":78733,"CreatedDateTime":"2013-08-13T04:28:30Z","PageNum":1,"Articles":[{"CreatedByName":"fizzix4lyfe","CreatedById":78733,"CreatedDateTime":"2013-08-13T04:28:30Z","Content":"\n\u003Cp\u003EI just spent about 45 minutes assembling a very large spacecraft. I was unable to see the edges of the spacecraft due to the level of zoom so I moved the space craft away from the center position in the VAB. After various rotations of the camera and translations of the spacecraft I managed to get it wedged in the corner of the VAB without any way to move it out. I tried numerous camera angles along with shift clicking the craft and also tried saving and loading again and also launching the craft. When it spawns on the launch pad it isn\u0027t even placed on the platform because it is so far off to the corner in the VAB. If you want people to make really ambitious rockets you need to add more camera controls inside the VAB as well as an ability to recenter the craft after it\u0027s been translated around.\u003C/p\u003E\u003Cp\u003E-Z\u003C/p\u003E\n"},{"CreatedByName":"LeadMagnet","CreatedById":43256,"CreatedDateTime":"2013-08-13T09:44:37Z","Content":"\n\u003Cp\u003EThe \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Key_Bindings\u0022 rel=\u0022external nofollow\u0022\u003Eofficial list of key bindings\u003C/a\u003E does not have a \u0022center ship\u0022 option for the VAB/SPH.\u003C/p\u003E\u003Cp\u003EThat would be a very useful option.\u003C/p\u003E\n"},{"CreatedByName":"FOARP","CreatedById":78629,"CreatedDateTime":"2013-08-13T09:58:03Z","Content":"\n\u003Cp\u003EYeah, assembly can be frustrating. Better zoom controls are needed. Especially with wide designs you end up having to work (in game terms) with pieces that are right against your face.\u003C/p\u003E\n"},{"CreatedByName":"rdfox","CreatedById":1818,"CreatedDateTime":"2013-08-13T14:56:51Z","Content":"\n\u003Cp\u003EAlso nice would be for the \u0022reset camera view\u0022 button to actually work; somehow, when I started 0.21.1, I managed to get my initial camera spawn point off to the left and up from the default, and I can\u0027t get it to go back automatically, much less reset that initial spawn point.\u003C/p\u003E\n"}]}