{"TopicId":42449,"ForumId":55,"TopicTitle":"Ability to put more space centres in space","CreatedByName":"pangaea","CreatedById":78845,"CreatedDateTime":"2013-08-14T08:39:38Z","PageNum":1,"Articles":[{"CreatedByName":"pangaea","CreatedById":78845,"CreatedDateTime":"2013-08-14T08:39:38Z","Content":"\n\u003Cp\u003EBasically, a few large modules would need to be carried to a location of your choice to setup a space centre. Let\u0027s say you put one on Minmus, here would be the benefits:\u003C/p\u003E\u003Cp\u003E-Ability to take off without the gravity or air resistance of Kerbin\u003C/p\u003E\u003Cp\u003E-Some parts could be made cheaper, in the event limited budgets are introduced due to the natural vacuum and low gravity. Good-quality solar panels for example, would need to be made in an artificial vacuum on Kerbin, which costs more than taking advantage of a natural vacuum on say Minmus\u003C/p\u003E\u003Cp\u003E-perhaps it could be used for repairs and refueling for ships on their way back to Kerbin, or on their way to another destination such as Eve\u003C/p\u003E\u003Cp\u003ESay you put one on Pol:\u003C/p\u003E\u003Cp\u003E-All the benefits of the Minmus base\u003C/p\u003E\u003Cp\u003E-Convenient when exploring other moons of Jool\u003C/p\u003E\u003Cp\u003E-A ship on it\u0027s way to Eeloo can stop for refueling or repair\u003C/p\u003E\u003Cp\u003EIn order to avoid making the game too easy, these will be big, heavy modules which provide no benefits in the way of fuel or boosters (unless you count them being space to attach these things). They may even need to be brought one at a time. They will also need to be in the same general area as each other. Multiple modules should be needed to create a single building.\u003C/p\u003E\u003Cp\u003EExample of modules that could be required: \u003Ca href=\u0022http://pastebay.com/1278800\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://pastebay.com/1278800\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"FEichinger","CreatedById":58255,"CreatedDateTime":"2013-08-14T10:09:48Z","Content":"\n\u003Cp\u003EHello there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat you\u0027re suggesting here is on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003EWhat not to suggest\u003C/a\u003E list, because it has been suggested repeatedly. Please read through the stickies before posting.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOrbital construction and construction on other celestials\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EClosing this.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFEichinger\u003C/strong\u003E\u003C/p\u003E\n"}]}