{"TopicId":43966,"ForumId":55,"TopicTitle":"KSP development \u0022rant\u0022","CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2013-08-26T19:29:25Z","PageNum":1,"Articles":[{"CreatedByName":"EvilotionCR2","CreatedById":27754,"CreatedDateTime":"2013-08-26T19:29:25Z","Content":"\n\u003Cp\u003EThis is getting weird... Remember old good KSPX? It was supposed to get into the vanilla after Claira was hired,but few updates later... We still don\u0027t have all parts from KSPX,instead we have few new parts from her and few just a little bit changed KSPX parts.. Why? She has been doing more when it was not her fulltime job. God damnit,just insert it into the vanilla somehow already and start doing new stuff. KSP is starting to get Minecraft development syndrome. Somebody already said that he doesn\u0027t care what devs implement into the game. The only thing he needs to know about the new update is if it will break his plugins. And this is true,in more than 6 months,from 0.19 to the 0.21,we got what exactly?:\u003C/p\u003E\u003Cp\u003E-Rover wheels\u003C/p\u003E\u003Cp\u003E-The not so much better ASAS\u003C/p\u003E\u003Cp\u003E-New folder structure which breaked 99% of mods\u003C/p\u003E\u003Cp\u003E-Flags\u003C/p\u003E\u003Cp\u003E-Crew managment which does not matter yet\u003C/p\u003E\u003Cp\u003E-Few new parts.\u003C/p\u003E\u003Cp\u003E-New buildings at KSC\u003C/p\u003E\u003Cp\u003E-Improved Mun terrain\u003C/p\u003E\u003Cp\u003E-Kerbal knowledge system\u003C/p\u003E\u003Cp\u003EAnd that is ladies and gentlemen,all in more than 5 months with more than 10 devs.\u003C/p\u003E\u003Cp\u003ELet\u0027s compare it to the 0.16 to 0.18\u003C/p\u003E\u003Cp\u003E-EVA\u003C/p\u003E\u003Cp\u003E-IVA\u003C/p\u003E\u003Cp\u003E-12 (13 if you count the sun) new planetary bodies\u003C/p\u003E\u003Cp\u003E-Overhaul of multiple planets\u003C/p\u003E\u003Cp\u003E-Almost all parts are replaced with better looking ones\u003C/p\u003E\u003Cp\u003E-Docking\u003C/p\u003E\u003Cp\u003E-New sun\u003C/p\u003E\u003Cp\u003E-Electricity and resources\u003C/p\u003E\u003Cp\u003E-Stations both on ground and in space\u003C/p\u003E\u003Cp\u003E-Unmaned probes\u003C/p\u003E\u003Cp\u003E-Much more modding options especially after 0.18\u003C/p\u003E\u003Cp\u003E-More player saves on one computer\u003C/p\u003E\u003Cp\u003E-CoM CoT CoL\u003C/p\u003E\u003Cp\u003E-Tutorials and scenarios in the game\u003C/p\u003E\u003Cp\u003E-Pre build ships\u003C/p\u003E\u003Cp\u003E-Flight planning\u003C/p\u003E\u003Cp\u003E-New Map UI\u003C/p\u003E\u003Cp\u003E-Lagsbane\u003C/p\u003E\u003Cp\u003E-Kraken bug fixed\u003C/p\u003E\u003Cp\u003E-First science implementation which does nothing\u003C/p\u003E\u003Cp\u003E-Music\u003C/p\u003E\u003Cp\u003E-Lights\u003C/p\u003E\u003Cp\u003ESee? When 0.17 was released,I almost broke my arm because I was so excited,when 0.18 was released I was still happy,but not so much. When 0.19,0.20 or 0.21 released,I was always like good.Let\u0027s see if it broke my plugins,because it didn\u0027t bring anything very new.\u003C/p\u003E\u003Cp\u003ESo devs,please,we liked it the way before,when we got much more content but in one big update.\u003C/p\u003E\u003Cp\u003EThank you for reading,hope that devs will do it the old way from 0.22,but that will probably not happen.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"notfruit","CreatedById":68730,"CreatedDateTime":"2013-08-26T19:42:01Z","Content":"\n\u003Cp\u003EHarvesteR posted \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/entry.php/303-A-rant-about-development-asymptotes\u0022 rel=\u0022external nofollow\u0022\u003Ean article on his blog\u003C/a\u003E about exactly the same thing. It\u0027s not intentional. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-26T20:04:28Z","Content":"\n\u003Cp\u003EYeeeeah, they\u0027re doing a lot of under-the-hood things right now. Things that won\u0027t impact us for another couple versions. Well, they\u0027ll slap us in the face a bit with .22 and the whole science, comms and R\u0026amp;D stuff that\u0027s going to be happening.\u003C/p\u003E\u003Cp\u003EJust let them do their thing and take their time to get everything just right before dumping it on us for mass testing. I mean, that\u0027s what we\u0027re here for, testing. It just so happens that the game is quite fun to play.\u003C/p\u003E\u003Cp\u003EHow will you feel when KSP1.0 releases and there are no more guaranteed updates after that? Will you still be angry and feel the need to rant on the forums about their lack of new content after that?\u003C/p\u003E\u003Cp\u003EI would say that if you\u0027re really that bothered by how long it\u0027s taking them to get new content for you to bite into, just play some other games for a couple months and pick KSP back up in the early spring or late winter. Sometime \u0027round February-ish. Hopefully by then, we\u0027ll see lots of new science bits, new comm bits, a nearly complete career mode, handful of new parts and maybe...just maybe an aerodynamics/spaceplane overhaul. That, of course, is being quite optimistic. Some things just take time.\u003C/p\u003E\n"},{"CreatedByName":"Nachtwind","CreatedById":41015,"CreatedDateTime":"2013-08-26T20:14:57Z","Content":"\n\u003Cp\u003EReally? Again such a thread. \u003C/p\u003E\u003Cp\u003EPlease note that KSP is in EARLY DEVELOPMENT STAGE and FAR FROM COMPLETE. \u003C/p\u003E\u003Cp\u003EThat means that sometimes updates dont add visible features. Live with it or just abandon KSP for the next few Versions. That might be rude, but it simple IS that way. Sometimes the game needs under the hood changes for visible stuff to get implemented. \u003C/p\u003E\u003Cp\u003EI would rather call it a minecraft sympthom if we now added 10mil parts to the game without adding any new game mechanics. Its not like 15 new wheels or 2 dozen wings would really add to the game, would they? They would just keep the devs time away from important things. The next big thing will be R\u0026amp;D and i suppose that will keep people busy once .22 is released. Then career mode should get a nice boost and maybe a first installment.. or resources.. or maybe stuff that is more important like a change of the engine to KSP 4.2? We simply dont know as users and should be grateful to be part of the development by giving constructive critics or suggestions..\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2013-08-26T20:28:01Z","Content":"\n\u003Cp\u003EYou need to update the OP:\u003C/p\u003E\u003Cp\u003EBetter planet loading systems\u003C/p\u003E\u003Cp\u003EEngine Updates\u003C/p\u003E\u003Cp\u003EModel Updates\u003C/p\u003E\u003Cp\u003EMore Efficient Code\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-08-26T20:28:11Z","Content":"\n\u003Cp\u003EMartinVD, as you know KSP is under development and the development of any game takes time and resources, the changes and additions that Squad make are often deeper than is possible than with the plugin system, which adds greatly to development \u0022cost\u0022.\u003C/p\u003E\u003Cp\u003EThis subject has been brought up before several times now and the answer has not changed, no further good can come from continuing to revive this, as said above (even by HarvesteR himself) game development takes time and effort so adding more things becomes harder with every update.\u003C/p\u003E\u003Cp\u003ERest assured however that the developers are very aware of the diminishing returns, but this is normal and to be expected with any project, be it a game or an office application.\u003C/p\u003E\u003Cp\u003EThis thread will be closed now to prevent the usual off-topic flaming that this subject often attracts, your concerns have been noted and I hope the next update is more to your liking, I and others are happily looking forwards to it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}