{"TopicId":43963,"ForumId":55,"TopicTitle":"Improving slowness","CreatedByName":"Ittiz","CreatedById":78645,"CreatedDateTime":"2013-08-26T19:03:12Z","PageNum":1,"Articles":[{"CreatedByName":"Ittiz","CreatedById":78645,"CreatedDateTime":"2013-08-26T19:03:12Z","Content":"\n\u003Cp\u003EI noticed it seems on modern computers the cause of low frame rate isn\u0027t usually too much graphics. It\u0027s the physics calculations that the parts require. This would generally end up CPU limiting the game. Now it seems to me many physics operations may be able to be carried out by the GPU instead. This may not be best for all calculations or all computers of course but if it were a setting then people could activate it to see if it helps. If you use the correct kind of compiler you may not even have to reprogram all the calculations, just compile for GPU instead of CPU, then again I have no idea how you guys coded so, it may be a near impossibility at this point \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-08-26T19:21:22Z","Content":"\n\u003Cp\u003Ecpu are more better at calculations than gpu. But I hope they ease up some load on the cpu in future updates. And yeah the gpu does have some load too. Every part you add is like 1 million pixels. Enough pixels will make your gpu get to overloaded.. Same with your cpu\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-26T19:24:55Z","Content":"\n\u003Cp\u003EThis has been talked about lots and lots and lots and lots and lots and lots. The problem is that physics is currently only handled by one CPU core...when the average user has two, three and four cores...or more, even \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever, SQUAD can\u0027t do very much to thread the physics calculations across multiple cores. It\u0027s a limitation with the Unity engine and one that I\u0022m certain the Unity developers are working on.\u003C/p\u003E\u003Cp\u003ESo, until Unity gets updated to allow multi-core physics processing, we\u0027re kind of doomed to excessive lag with large numbers of parts being in your general vicinity all at once.\u003C/p\u003E\n"},{"CreatedByName":"Amazonys","CreatedById":76786,"CreatedDateTime":"2013-08-26T20:48:07Z","Content":"\n\u003Cp\u003EI think that there could be ways around the \u0022lag\u0022 that could be relatively easy to implement. (compared to an entirely new physics engine.) \u003C/p\u003E\u003Cp\u003E1. don\u0027t calculate the physics of stationary objects on the ground. This could be implemented by saying X base is sitting on its lander legs and going 0.0m/s, so turn off physics of all objects in the flight. Additionally you could just turn off physics of everything except fragile, breakable objects (eg:solar panels). This means that you could have much bigger bases limited by your gpu\u0027s ability to render them rather than cpu\u0027s ability to calculate the physics of stationary objects. (Also I read somewhere that the biggest lander legs are already physics neutral or something)\u003C/p\u003E\u003Cp\u003E2. calculate space station physics in chunks, like module A \u002B module B \u002B etc. this would mimic the realism of the station maneuvering but once again lighten up on the load on your CPU.\u003C/p\u003E\u003Cp\u003E3. eventually get around to a potential 64-bit/easily convertable unity-physics-plugin or other such options. But 1 and 2 should be the way to go.\u003C/p\u003E\n"},{"CreatedByName":"Nachtwind","CreatedById":41015,"CreatedDateTime":"2013-08-26T21:24:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Amazonys\u0022 data-cite=\u0022Amazonys\u0022\u003E\u003Cdiv\u003EI think that there could be ways around the \u0022lag\u0022 that could be relatively easy to implement. (compared to an entirely new physics engine.) \u003Cp\u003E1. don\u0027t calculate the physics of stationary objects on the ground. This could be implemented by saying X base is sitting on its lander legs and going 0.0m/s, so turn off physics of all objects in the flight. Additionally you could just turn off physics of everything except fragile, breakable objects (eg:solar panels). This means that you could have much bigger bases limited by your gpu\u0027s ability to render them rather than cpu\u0027s ability to calculate the physics of stationary objects. (Also I read somewhere that the biggest lander legs are already physics neutral or something)\u003C/p\u003E\u003Cp\u003E2. calculate space station physics in chunks, like module A \u002B module B \u002B etc. this would mimic the realism of the station maneuvering but once again lighten up on the load on your CPU.\u003C/p\u003E\u003Cp\u003E3. eventually get around to a potential 64-bit/easily convertable unity-physics-plugin or other such options. But 1 and 2 should be the way to go.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1: that wouldnt be really what KSP is about. You just have inertia in space, no matter how small a part is. therefore you would remove realism for some performance gain (which i doubt will happen).\u003C/p\u003E\u003Cp\u003E2: Same as above... \u003C/p\u003E\u003Cp\u003E3: How would you do that? KSP loads all modules and therefore those modules run under the same limitation as the main game. Granted.. you could write a server/client program (if possible with the modding limitations) that could outsource SOME stuff to an external program.. but i dont think its within the scope of mods to outsource all physics.. and i wouldnt like to see that happen..\u003C/p\u003E\u003Cp\u003ESo here, again as in a few hundred thousand other threads is just one advise: Just keep waiting. its ZERO point twentyone NOT ONE point twentyone..\u003C/p\u003E\n"},{"CreatedByName":"Amazonys","CreatedById":76786,"CreatedDateTime":"2013-08-27T03:39:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nachtwind\u0022 data-cite=\u0022Nachtwind\u0022\u003E\u003Cdiv\u003E1: that wouldnt be really what KSP is about. You just have inertia in space, no matter how small a part is. therefore you would remove realism for some performance gain (which i doubt will happen).\u003Cp\u003E-snip-\u003C/p\u003E\u003Cp\u003E3: How would you do that? KSP loads all modules and therefore those modules run under the same limitation as the main game. Granted.. you could write a server/client program (if possible with the modding limitations) that could outsource SOME stuff to an external program.. but i dont think its within the scope of mods to outsource all physics.. and i wouldnt like to see that happen..\u003C/p\u003E\u003Cp\u003ESo here, again as in a few hundred thousand other threads is just one advise: Just keep waiting. its ZERO point twentyone NOT ONE point twentyone..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know that this is still \u0022alpha\u0022 and I totally agree/support the realism that makes this game great; and I\u0027m just providing a suggestion with regards to stationary objects/bases on planets that are still calculating physics but aren\u0027t moving actually moving. Plus this would only take effect one all of the criteria are met ingame. (ie:not moving, on landing legs, etc) This \u003Cem\u003Ecould\u003C/em\u003E be a potential drain on performance that I think it may be worth looking into. (So bases may end up being larger than stations) I have little experience in physics-specific programming, but I do know that swapping to any other physics engine (and none really exist as unity plugins for SQUAD\u0027s purposes) other than what currently exists would be a HUGE task; hence my third point in which I was trying to point out that there are\u003Cem\u003E potentially\u003C/em\u003E other options to increase performance, and that those should take precedence at least in consideration over any massive undertakings if the existing engine can be optimized.\u003C/p\u003E\u003Cp\u003EWho knows what the future holds, I\u0027m having fun with smaller ships and stations now and have no complaints, so I\u0027m sure I\u0027ll enjoy whatever KSP eventually evolves into. Just trying to brainstorm ideas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}