{"TopicId":44002,"ForumId":55,"TopicTitle":"To whom it may concern.","CreatedByName":"fervour","CreatedById":80400,"CreatedDateTime":"2013-08-27T02:06:00Z","PageNum":1,"Articles":[{"CreatedByName":"fervour","CreatedById":80400,"CreatedDateTime":"2013-08-27T02:06:00Z","Content":"\n\u003Cp\u003EI have recently become a fan of KSP and there are a few of my suggestions for the game that I would like to bring to your attention.\u003C/p\u003E\u003Cp\u003EFirst of all, and I\u0027m sure many will agree that it is frustrating when you time warp past a node, perhaps we could have a \u0022set time\u0022 time-warp where one could enter the amount of time to warp by or even just make the warp hit times 1 as soon as it reaches the node or a minute before.\u003C/p\u003E\u003Cp\u003ESecondly is a question regarding the repairs kerbals can do in the future, will they be able to pick up objects that have fallen next to their pod and have not been obliterate to weld them back onto the pod and fly another day.\u003C/p\u003E\u003Cp\u003ELastly, I really like how the 3 main kerbals (Bill, Bob and Jeb) wear the only orange suits, perhaps a random colour scheme for future kerbals but keeping orange strictly for the founding 3.\u003C/p\u003E\u003Cp\u003EThat\u0027s all I\u0027ve really thought of, great game, keep up the massive amount of work I\u0027m sure the whole team is doing. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2013-08-27T08:26:11Z","Content":"\n\u003Cp\u003Eon 3, I\u0027m hoping they tie the colour of the suits to a given kerbals experience in your space program.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-08-27T10:06:39Z","Content":"\n\u003Cp\u003EYou may want to look into the Kerbal Alarm Clock mod, which does help with things like not missing nodes.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-08-27T11:04:37Z","Content":"\n\u003Cp\u003EI\u0060m up for the colour of suit matching experience, Kerbal Alarm Clock is invaluable for not missing nodes and I like the idea of picking up parts on EVA and welding them back on!\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-27T12:09:47Z","Content":"\n\u003Cp\u003EI\u0022d like to see something like Kerbal Alarm Clock implemented into the vanilla experience. Especially if I can toggle it on and off \u0027cause sometimes it doesn\u0027t matter as much if I miss a maneuver node, like if I\u0027m trying to get to Mun or something. But if I\u0027m trying to get to another planet, it\u0027s kind of important I leave at a certain time, right?\u003C/p\u003E\u003Cp\u003EAs for the suit colors, it\u0027s been suggested before that we have the ability to customize our kerbonauts\u0027 suit colors. Of course, a lot of people prefer the white for EVA \u0027cause it\u0027s all realistic and stuff and would just want to see orange suits for launches, white suits for EVA, blue polo shirts or something for IVA in stations and so on. Me, I\u0027m in the full-on customization camp \u0027cause it\u0027s just fun. Doesn\u0027t remove anything from the game experience, the realists or whatever you\u0027d like to call them can keep their real-world clothing colors and the weridos like me can paint their EVA suits bright pink if we wanted to. Would feel good man.\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-08-27T14:58:47Z","Content":"\n\u003Cp\u003EIm all for different suits. It\u0027d also be nice if each Kerbonaut had an experience log, i.e. where they\u0027ve been and how many times they\u0027ve been to space, how many \u0027space-hours\u0027 they\u0027ve logged and stuff. Suits could then be coloured accordingly :-). I\u0027m also entirely in favor of the idea of just being able to customise the IVA suits entirely by yourself. Maybe even the EVA suits like in the Universe Replacer mod, only where it\u0027s controllable which Kerbal gets which suit instead of random.\u003C/p\u003E\u003Cp\u003EAlso, the Kerbal Alarm Clock in vanilla would be nice. When i was less experienced, i tried to make a Mun escape to return to Kerbin. I\u0027d had a weird exit vector though, so i was waiting a while till the Mun was clear, so i could burn retro and not re-enter it\u0027s sphere of influence. I accidentally timewarped too fast, leading them to orbit Kerbin multiple times and get right on an collision course with the Mun with not enough fuel to steer clear of it.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-08-27T15:54:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beeman\u0022 data-cite=\u0022Beeman\u0022\u003E\u003Cdiv\u003EDoesn\u0027t remove anything from the game experience, the realists or whatever you\u0027d like to call them can keep their real-world clothing colors and the weridos like me can paint their EVA suits bright pink if we wanted to. Would feel good man.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hddvd.highdefdigest.com/images/post/3/3152/original.jpeg\u0022 alt=\u0022original.jpeg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFabulous, fabulous, fabulous! ^^\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-08-27T20:55:31Z","Content":"\n\u003Cp\u003EI agree with the Time Warp suggestion. 30 seconds before the node, the Time Warp should drop to 1x. This would be very simple to implement.\u003C/p\u003E\n"}]}