{"TopicId":44082,"ForumId":55,"TopicTitle":"Your suggestions on career mode octcomes.","CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2013-08-27T20:16:18Z","PageNum":1,"Articles":[{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2013-08-27T20:16:18Z","Content":"\n\u003Cp\u003ECareer is developing rapidly and I want to heard your ideas on outcomes that can make Career mode fun for everyone.\u003C/p\u003E\u003Cp\u003EMy idea is when you lose or win the \u0022space race\u0022 against another nation on kerbin. Let say you won the space race and landed on the mun for whatever cause its when you bring the kerbalnauts back home you have a cut scene where the kerbalnauts are celebrated as heroes of your nation after it you will get a choice to whether continue or end the game.\u003C/p\u003E\u003Cp\u003EOutcome: win:D\u003C/p\u003E\u003Cp\u003EContinue option: You will have more missions to deploy more spacecrafts or go to the Mun again. If you have enough budget you can build a nuclear engine or a \u0022space shuttle progam-ish thing\u0022.\u003C/p\u003E\u003Cp\u003EIf you have alot of money you can fund a mission to Duna and made a manned landing very early and the next 20 years or so you have very early Interplanetary society and colonization or if you have a medium kind of budget you can fund a space plane program like NASA in the 80s building space stations and stuff or you have very low budget. Your options are limited to launch Satellites or rarely manned space craft like NASA today\u003C/p\u003E\u003Cp\u003EOutcome: lose;.;\u003C/p\u003E\u003Cp\u003EYou will pretty much ended like the Russians when the Americans landed on the moon, but there is beacon of hope for you can build the first space stations and you can have a \u0022apollo-soyuz mission\u0022 type where your rival nation will join up with you as partners in space travel this is a option you don\u0027t have to do it. The advantage is you have much more funding than the rival nation so you can fund a mun landing later on and a Duna mission much later than the rival nation.\u003C/p\u003E\u003Cp\u003EOutcomes for both nations:\u003C/p\u003E\u003Cp\u003E-Commercial space travel ( Private Companies like ULA or Space X You can control if you want:cool:)\u003C/p\u003E\u003Cp\u003E-Sending prodes to planets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E-Interplanetary Travel\u003C/p\u003E\u003Cp\u003E-Other Nations will be space faring \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E ( may start another Space Race)\u003C/p\u003E\u003Cp\u003E-Interstellar Travel (obvious)\u003C/p\u003E\u003Cp\u003E-TV satillites and other commercial Payloads\u003C/p\u003E\u003Cp\u003E-Contracts by either commercial or Military and branch of Government:rolleyes:\u003C/p\u003E\u003Cp\u003EThis is my Idea and I want to Heard yours too and if you see a flaw or you have a question ask me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-27T20:46:02Z","Content":"\n\u003Cp\u003EI don\u0027t think career mode is going to be a straight linear progression outside of the tech tree. Like, I\u0027ve seen Harvester talkin\u0027 about missions being kind of dynamic. I guess the plan is that the game will pay attention to what you\u0027re going and give you missions based on that. So if you spend a lot of time doing munar landings or science or whatever, you\u0027ll get some more munar missions to help you progress through the tech tree. I guess.\u003C/p\u003E\u003Cp\u003EThen again, missions are probably at least one update away so they may well change what they want it to be like. I don\u0027t think they\u0027ve got a 100% vision for them anyways.\u003C/p\u003E\u003Cp\u003EThat said, the endgame was supposed to be FTL travel. There was supposed to be a couple solar systems not that far away from Kerbol that were predefined and beyond that, solar systems were supposed to be procedurally generated. I think Nova was talking about that on reddit some time ago...so those plans may well have also changed.\u003C/p\u003E\u003Cp\u003EA lot of people would like to see a competing space program, though. It\u0027s kind of a popular suggestion and I\u0022m not entirely against it. I just wonder how they\u0027d squeeze that into the whole dynamic missions thing and what-not. It would have to adapt to keep pushing you further without jumping too far ahead and making you feel like you\u0027re wasting your time...and that might be difficult to program.\u003C/p\u003E\n"},{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2013-08-27T21:15:45Z","Content":"\n\u003Cp\u003EThe mun mission is probably a major mission and the Apollo-Soyuz like mission is major,but there is a choice to it. First you need to discover exoplanets.\u003C/p\u003E\n"}]}