{"TopicId":44172,"ForumId":55,"TopicTitle":"Hack Gravity Selectable Value","CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-08-28T15:07:41Z","PageNum":1,"Articles":[{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-08-28T15:07:41Z","Content":"\n\u003Cp\u003EThe Hack Gravity (available via ALT-F12) permits a player to operate in a near-zero gravity environment.\u003C/p\u003E\u003Cp\u003ESuggestion: Make the strength of gravitational pull as settable via a slider.\u003C/p\u003E\u003Cp\u003EGravity Hack is used for testing of vehicles, landers, rockets, etc. in near-zero gravity. It is not used for playing. If the gravitational pull is adjustable, it can be used for testing and training.\u003C/p\u003E\u003Cp\u003EFor instance, if gravity is set for Mun gravity strength, a player can test various lander combinations. For planets, with gravity that is stronger or weaker than Kerbal, the player can test different vehicle designs and techniques for landing and lift-off (from the planet). If a vehicle design has insufficient power to lift-off from a planet, it is better to discover that on the Launchpad, not on the planet surface (after spending hours to get there).\u003C/p\u003E\u003Cp\u003EThis would also help in training. A player can learn how to land on Mun or a planet without spending time in transit, only to crash.\u003C/p\u003E\u003Cp\u003EFor landing training or testing a vehicle\u0027s landing capabilities, the player would set the gravity to strength of the destination Mun/planet, use the HyperEdit mod to place himself at altitude. add some velocity to simulate coming in to land. Then, land and liftoff.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2013-08-28T15:22:12Z","Content":"\n\u003Cp\u003EI find it easier to use HyperEdit and just plain put the test object at the exact point where it would need to be. So if you\u0027re testing a Mun lander, you can always put it in Mun orbit, or right on the Mun surface.\u003C/p\u003E\n"},{"CreatedByName":"Inchoately","CreatedById":79771,"CreatedDateTime":"2013-08-28T16:02:30Z","Content":"\n\u003Cp\u003Ebesides the test-part you can use informational mods like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/18230-0-21-1-Kerbal-Engineer-Redux-v0-6-1-0\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Engineer Redux\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EWith it you can see the TWR (thrust-to-weight-ratio) of your spacecraft, for every planet/moon in game. As long as the TWR is above 1.0 at your selected planet you will be able to lift off from it. This mod just saves you time looking for the gravitational specs of the planet and calculating the TWR for yourself.\u003C/p\u003E\u003Cp\u003EIf you just can test if your spacecraft will perfectly fly at a specific environment, where is the fun without discovering the new place? I personally wouldn\u0027t bother flying to a new planet already knowing my lander will be perfect for it. You could send out a probe to analyse the environment beforehand, or plan a rescue mission if your kerbals cannot travel back on their own, but thats just my imagination/opinion \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-08-29T00:07:14Z","Content":"\n\u003Cp\u003EI like your idea. How do you know where you\u0027re placing your vehicle when trying to put it on Mun\u0027s surface with HyperEdit? Or Duna\u0027s? Or Eeloo?\u003C/p\u003E\u003Cp\u003EI will jump right on that. Thanks\u003C/p\u003E\n"}]}