{"TopicId":44280,"ForumId":55,"TopicTitle":"More useful Kerbals","CreatedByName":"JRF2k","CreatedById":64440,"CreatedDateTime":"2013-08-29T15:09:37Z","PageNum":1,"Articles":[{"CreatedByName":"JRF2k","CreatedById":64440,"CreatedDateTime":"2013-08-29T15:09:37Z","Content":"\n\u003Cp\u003EWe know Kerbals are masters at fixing broken tires on rovers. Why not make them good at fixing other things like crashed rockets.\u003C/p\u003E\u003Cp\u003EThis could be tied into career mode as you would need to train up a Kerbal with skill in repair and then make it take so many hours/days in order to fix whatever.\u003C/p\u003E\u003Cp\u003EMaybe have it cost something for the repairs or have it as a repair kit you have to add to the rocket itself. Or maybe they could salvage what they can from the crash and attempt to fix the rocket. \u003C/p\u003E\u003Cp\u003EIf they fail, then it could necessitate a rescue mission be planned.\u003C/p\u003E\n"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2013-08-29T15:25:29Z","Content":"\n\u003Cp\u003E\u002B1 Broken solar panels on overturned rovers should be fixable too. And why do re-packaged parachutes not deploy again when you hit the spacebar?\u003C/p\u003E\n"},{"CreatedByName":"chaos_forge","CreatedById":64960,"CreatedDateTime":"2013-08-29T15:42:56Z","Content":"\n\u003Cp\u003EPretty sure this is planned . . .\u003C/p\u003E\n"},{"CreatedByName":"JRF2k","CreatedById":64440,"CreatedDateTime":"2013-08-29T15:44:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chaos_forge\u0022 data-cite=\u0022chaos_forge\u0022\u003E\u003Cdiv\u003EPretty sure this is planned . . .\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEPIC!\u003C/p\u003E\u003Cp\u003EHope so!\u003C/p\u003E\n"},{"CreatedByName":"Nachtwind","CreatedById":41015,"CreatedDateTime":"2013-08-29T16:27:22Z","Content":"\n\u003Cp\u003EAs long as it stays somewhat realistic i am ok with the idea.. but how far can \u0022repairing\u0022 stuff be extended? Think of the MIR when the support vessel did collide to it or Apollo 13..\u003C/p\u003E\n"},{"CreatedByName":"Beeman","CreatedById":28178,"CreatedDateTime":"2013-08-29T21:27:53Z","Content":"\n\u003Cp\u003EThey\u0027re planning, as far as I\u0027m aware, to have tasks for kerbonauts including but not necessarily limited to doing science, repairing things with at least one toolbox part(not sure what all you\u0027ll be able to repair), collect and/or examine samples...I guess rocks and stuff on the ground, strut parts together using a strut gun, float about freely between parts of, say, a space station using hatches and things, remove their helmets regardless of where they might be and someday you\u0027ll be able to train your kerbonauts to be better at doing some tasks.\u003C/p\u003E\u003Cp\u003EThey mentioned the crew training thing a long while ago so their goals might\u0027ve changed on how that should work but I remember there being mention of kerbonauts being trained to do certain menial tasks or maneuvers on their own, though not as good as if you\u0027d done it yourself.\u003C/p\u003E\u003Cp\u003EI\u0027m sure they\u0027ve got more EVA/IVA tasks in mind, but I guess we\u0027ll have to wait and see what\u0027s up. Either way, the more EVA/IVA activities they wind up adding, the happier I\u0027ll be. I\u0022d even like to use my kerbonauts(either manually or autonomously via crew training) to clean solar panels and things and perform general maintenance to increase or maintain performance on various parts(batteries, solar panels, engines, etc...). Would just be fun, I think and if they had crew training for maintenance, those that find such things monotonous wouldn\u0027t necessarily have to worry about it as much. On top of that, wear and tear reducing performance or efficiency of certain parts isn\u0027t necessarily random failures, just reduced efficiency necessitating maintenance. Just something to fill out game time and add another layer to crew skills. I\u0027d love it, at least \u0026gt;.\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"JiWint","CreatedById":78150,"CreatedDateTime":"2013-08-31T15:29:11Z","Content":"\n\u003Cp\u003EI hope they add something like \u0022spare parts depot\u0022.For example,you punch off solar panel.You go to depot,take a new panel,fix it into a place and tada!.Or same with batteries,radioisotopic generators and so.\u003C/p\u003E\n"},{"CreatedByName":"Khalashnikovf","CreatedById":75204,"CreatedDateTime":"2013-09-01T06:52:41Z","Content":"\n\u003Cp\u003E\u002B1 for Spare parts module\u003C/p\u003E\u003Cp\u003E\u002B1 for Repackable parachute\u003C/p\u003E\n"}]}