{"TopicId":44704,"ForumId":55,"TopicTitle":"Allow changing the \u0026quot;root node\u0026quot; of a subassembly (or detached ship parts in general)","CreatedByName":"Zackaresh","CreatedById":79503,"CreatedDateTime":"2013-09-02T14:28:30Z","PageNum":1,"Articles":[{"CreatedByName":"Zackaresh","CreatedById":79503,"CreatedDateTime":"2013-09-02T14:28:30Z","Content":"\n\u003Cp\u003EI\u0027m very happy to hear that subassemblies will become an official part of the game in one of the next releases. I love using the current mod that allows me to do this but I have a small issue with it and thought it might be worth looking at while you are integrating the functionality in the game. \u003C/p\u003E\u003Cp\u003EThe biggest problem with subassemblies (or compositions of parts in general) for me at the moment is the way the game saves the point it was originally attached. \u003C/p\u003E\u003Cp\u003EWhen designing basemodules for example, you have to be very careful where you start your design or you will not be able to attach it ot a lifter or another part the way you planed to.\u003C/p\u003E\u003Cp\u003EI realized that this behaiviour is caused by the way the ships are saved. \u003C/p\u003E\u003Cp\u003EThey are basically a tree of parts and attaching a subpart not on its original root node would require rearranging this subtree.\u003C/p\u003E\u003Cp\u003EIn theory rearranging a tree of objects should be trivial but doing it on the fly would result in very strange behaviour as your mousepointer is always on the root node when moving around the parts.\u003C/p\u003E\u003Cp\u003ESuggested solution:\u003C/p\u003E\u003Cp\u003EAdd a Keyboardshortcut to cycle trough possible attachment points of the parttree or subassembly you have currently attached to the mouse. That way the waiting period caused by rearranging the subtree and getting the new root node is clearly tied to a user interaction.\u003C/p\u003E\u003Cp\u003EThanks for reading this and\u003C/p\u003E\u003Cp\u003EKeep up the awesome work!\u003C/p\u003E\n"},{"CreatedByName":"Fizwalker","CreatedById":78337,"CreatedDateTime":"2013-09-02T15:44:17Z","Content":"\n\u003Cp\u003EWhat\u0027s the mod you are using?\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-09-02T17:48:58Z","Content":"\n\u003Cp\u003EThe SelectRoot mod is your friend. It does what you\u0027re asking for.\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-09-02T18:50:22Z","Content":"\n\u003Cp\u003EIt would be awesome to be able to change the root part. I\u0027ve encountered cases where I couldn\u0027t build my rocket the way I wanted while also having the root part I wanted selected. It is very annoying to manually switch the root at launch every time because I can\u0027t stick the part I want to stick where I want to stick it when working from one side to the other.\u003C/p\u003E\n"},{"CreatedByName":"Zackaresh","CreatedById":79503,"CreatedDateTime":"2013-09-03T09:30:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Apollo13\u0022 data-cite=\u0022Apollo13\u0022\u003E\u003Cdiv\u003EThe SelectRoot mod is your friend. It does what you\u0027re asking for.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHoly crap! Thanks a lot! \u003C/p\u003E\u003Cp\u003EI didn\u0027t know this existed.\u003C/p\u003E\n"}]}