{"TopicId":45667,"ForumId":55,"TopicTitle":"Thruster Failure","CreatedByName":"Hoagster35","CreatedById":82068,"CreatedDateTime":"2013-09-11T21:26:08Z","PageNum":1,"Articles":[{"CreatedByName":"Hoagster35","CreatedById":82068,"CreatedDateTime":"2013-09-11T21:26:08Z","Content":"\n\u003Cp\u003EThis suggestion will be about thruster failures. I think that this addition would add more challenge to Kerbal Space Program. This could usually happen after launch in Kerbin\u0027s atmosphere or by entering another atmosphere (Laythe, Eve, Duna, Etc.) or by re-entering Kerbin\u0027s atmosphere. Of course, this won\u0027t be a common thing. It would be extremely rare, like maybe 2.35% chance or lower, so you wouldn\u0027t have to worry as much as you think you do. I think that this will add a slightly more bit of realism into the game. Some may not like the idea, plummeting into the ground when your one thruster failed, spinning out of control because 1 out of 3 thrusters failed. Listen though, wouldn\u0027t it be funny to tell you friends \u0022Um yah, my rocket crashed into Luna because my thruster failed.\u0022 Besides that, there must be a lot of things in Kerbal Space Program that you may not like it right after it happened, but your glad that its in the game.\u003C/p\u003E\u003Cp\u003EThank you for reading, and I would appreciate your feedback. It\u0027s good to know what people like \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T21:28:27Z\u0022 title=\u002209/11/2013 09:28  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by Hoagster35\u003C/strong\u003E\n\u003Cbr\u003EThruster sounded better than engine :)\n\u003C/span\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2013-09-11T21:30:56Z","Content":"\n\u003Cp\u003Ewill NEVER happen!\u003C/p\u003E\u003Cp\u003EThank you for your service today.\u003C/p\u003E\n"},{"CreatedByName":"softweir","CreatedById":2795,"CreatedDateTime":"2013-09-11T21:35:01Z","Content":"\n\u003Cp\u003EPlease see the Sticky thread at the top of the forum - \u0022What not to suggest\u0022. Random failure is one of them!\u003C/p\u003E\u003Cp\u003ERandom failures won\u0027t be put in the game. The reasoning is that this rarely improves interest value, but but frequently causes undue frustration. All failures will be due to player error.\u003C/p\u003E\u003Cp\u003EPlease don\u0027t be discouraged, there is plenty of room for suggestions, just be careful to check the stickies before making your.\u003C/p\u003E\u003Cp\u003EMany Thanks!\u003C/p\u003E\n"}]}