{"TopicId":45663,"ForumId":55,"TopicTitle":"Comet or Asteroid R\u0026D","CreatedByName":"greghorst","CreatedById":17758,"CreatedDateTime":"2013-09-11T20:34:52Z","PageNum":1,"Articles":[{"CreatedByName":"greghorst","CreatedById":17758,"CreatedDateTime":"2013-09-11T20:34:52Z","Content":"\n\u003Cp\u003EWith the new purchase system for R\u0026amp;D being implemented this got me thinking. Wouldn\u0027t it be cool if you could spend your \u0022Science\u0022 to discover minor bodies like Asteroids or Comets? When you buy it, an object would be put into a random Kerbol orbit like a ship would. That would allow you to try and do a rendezvous mission. Also, since it has a random orbit and acts as a ship or debris, it could \u0022collide\u0022 with a planet giving you a possible Armageddon situation to deal with if you desire. Just a thought.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-11T21:09:06Z","Content":"\n\u003Cp\u003EIt\u0027s certaintly a fascinating concept. That being said, there are already plans for an asteroid belt and I believe that there was some chatter on the forums regarding something like the Kipper belt was well, which would effectively nullify the need for this.\u003C/p\u003E\n"},{"CreatedByName":"Dieselpower","CreatedById":18995,"CreatedDateTime":"2013-09-11T22:03:01Z","Content":"\n\u003Cp\u003ECoincidentally I was thinking the same the other day. \u003C/p\u003E\u003Cp\u003EI believe it is a great concept and it would eliminate the need of implementing - and thereby the rendering and calculations - of a full-fledged asteroid belt.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2013-09-11T22:23:08Z","Content":"\n\u003Cp\u003EIf the asteroid belt is added, it would be nice if we\u0027d have to spot those bodies first before knowing they are there. In Career mode at least.\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-09-11T23:30:31Z","Content":"\n\u003Cp\u003Ethread lock as asteroids are part of the sticky \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003Ewhat not to suggest list\u003C/a\u003E\u003C/p\u003E\n"}]}