{"TopicId":46471,"ForumId":55,"TopicTitle":"Map mode planet marking","CreatedByName":"xzxvrx","CreatedById":57321,"CreatedDateTime":"2013-09-25T00:54:51Z","PageNum":1,"Articles":[{"CreatedByName":"xzxvrx","CreatedById":57321,"CreatedDateTime":"2013-09-25T00:54:51Z","Content":"\n\u003Cp\u003EI have recently been looking for locations to start a Mun base. My method of scouting for a spot, was visibly look for a suitable spot from a really low orbit, and when I find a spot, the next orbit I would send a probe down to land there. I was concerned about landing at the wrong site (Although I was landing on one of the big craters). So, my suggestion is to have a method of simply marking a point on a planet/moon, not specific coordinates or anything, just simply a dot to mark the general area of where you want to land at. What I think the method as to plotting a point, would be to simply right click where you want to mark, and you are given an option to put a point there, and to delete it, just right click the point and you are given an option to delete it (pretty much how you would go about placing/removing a maneuver node). Something else that I thought of, is that you could also be displayed with how far off from your landing site that your current trajectory takes you. Just to sum everything up, I am suggesting a simple method of marking a landing site on a planet without having to use (somewhat confusing to me) long/lat coordinates. I apologize if this has already been suggested (I did a quick search and found none). Thank you for your time.\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-09-25T01:10:11Z","Content":"\n\u003Cp\u003EA good idea. I use mechjeb for helping with precision landings and isa mapsat for targeting.\u003C/p\u003E\u003Cp\u003EAnother thought though. Did you think about attaching small landers to your scout probe?\u003C/p\u003E\u003Cp\u003EWhen you see a good spot you could detach one to send it down.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-25T01:30:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boomerdog2000\u0022 data-cite=\u0022boomerdog2000\u0022\u003E\u003Cdiv\u003EA good idea. I use mechjeb for helping with precision landings and isa mapsat for targeting.\u003Cp\u003EAnother thought though. Did you think about attaching small landers to your scout probe?\u003C/p\u003E\u003Cp\u003EWhen you see a good spot you could detach one to send it down.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe the OP says he does just that. That is a trick I will do. I\u0027ll find a spot with a scout probe lander, mark it with MechJeb landing autopilot, then have it land. Once it\u0027s down, I use it as a tracker probe. The other option I do is use manned landers to go down and plant a flag. This suggestion is fantastic and would save us a lot of trouble. IIRC, I recall Majiir talking about some updates to the Kethane geodesic grid that really had no effect on Kethane, but made it more friendly for other modders who wish to use it to create mapping plugins to replace the no longer supported and RAM intensive ISA mapsat. To any modder contemplating such a mod, consider this feature please. SQUAD, also consider this as well as adding stock terrain mapping.\u003C/p\u003E\n"},{"CreatedByName":"TimMartland","CreatedById":68334,"CreatedDateTime":"2013-09-27T15:50:02Z","Content":"\n\u003Cp\u003EI think being able to mark areas of the map would be cool. You could add little \u0027waypoints\u0027 and name them so you could remember specific spots. It would also be fun to name craters after all the Kerbals you crashed/blew up/span into deep space.\u003C/p\u003E\n"}]}