{"TopicId":46586,"ForumId":55,"TopicTitle":"dear devs: do something to the node editors","CreatedByName":"Eskarina","CreatedById":79945,"CreatedDateTime":"2013-09-26T07:20:21Z","PageNum":1,"Articles":[{"CreatedByName":"Eskarina","CreatedById":79945,"CreatedDateTime":"2013-09-26T07:20:21Z","Content":"\n\u003Cp\u003EIt\u0027s really frustrating that the node editor, DAT very tool that you use to go here and there is so limited and lame. Here are few suggestions for it and why:\u003C/p\u003E\u003Cp\u003E1- The node SHOULD remain open for tweaks as long as I say. It doesn\u0027t matter if im zooming, rotating or anything else in the map view. It\u0027s incredible lame to FIGHT a node that the only thing it really does well is deleting itsef, Minimize itsef, etc.\u003C/p\u003E\u003Cp\u003ESOLUTION TO THIS: The node editor only minimizes when I click the middle mouse button or other designated key. Having a button that does two things at the same time (click to rotating view AND deselect a node) is a BAD Ux choice.\u003C/p\u003E\u003Cp\u003E2- The map view SHOULD display the orbital information ALWAYS when i\u0027m tweaking the nodes. I saw the UNITY expo video that you guys made, and I agree too much information at all times is bad for the user. BUT in the other hand, Having ZERO information at all times is an equally bad design choice for the user as well. I NEED TO KNOW how much my orbit is changing when I\u0027m dragging the sliders around. Let\u0027s say I want to flyby the MÃƒÂ¼n at a very close but secure height, let\u0027s say 5.500m height. So I place a node and then, I tweak for a second, then, hover the perigee point to see how close I am. (8000m) tweak again and hover (300m), and again (9000m), and again, (1500m) etc. This is stupid. And combined with the previous complaint, you guys know that Node tweaking is a ****IN NIGHTMARE.\u003C/p\u003E\u003Cp\u003ESOLUTION: Node information is ENABLED and ALWAYS DISPLAYING as long as I\u0027m tweaking a node. I need to know the encounter times, the node ascending degrees, the escape times, I need to know my height at Apo. Etcetcetc Dam I NEED to know!.\u003C/p\u003E\u003Cp\u003Eps. A fine tune node editor would be nice also, but is not as BLOODY IMPORTANT right now as the other two requests. From my humble point of view at least.\u003C/p\u003E\u003Cp\u003Epd2. If you guys don\u0027t want to implement this solutions \u0027as is\u0027 PLEASE, PLEASE, at least add an option to enable / disable a full orbital information display in the map view. I\u0027M BEGGING HERE.\u003C/p\u003E\u003Cp\u003EThanks. :3\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-26T07:31:27Z\u0022 title=\u002209/26/2013 07:31  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 26, 2013\u003C/time\u003E by Eskarina\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-09-26T07:27:23Z","Content":"\n\u003Cp\u003EI must admit, I would kill for the ability to slip into an advanced node editor. \u003C/p\u003E\u003Cp\u003ESetting up long distance intercepts with a planetary body is incredibly clumsy with the editor the way it is, it would be nice if there were an additional menu you could bring up to fine tune it so you\u0027re not arriving right on the edge of the planets sphere of influence.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-09-26T07:37:13Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/maneuver-node-improvement/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/maneuver-node-improvement/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou will never look back... especially with the on-the-fly conics patch ability.\u003C/p\u003E\n"},{"CreatedByName":"Eskarina","CreatedById":79945,"CreatedDateTime":"2013-09-26T07:37:58Z","Content":"\n\u003Cp\u003EYou\u0027re right, but node fine tuners are fixed today by plugins. So I that particular i\u0027m okay. Ã‚Â¿It would be nice to implement them stock? Hell yes, but I\u0027m talking about node behaivor here, and that is out of plugins reach now. That\u0027s why the argument. :/\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TMS\u0022 data-cite=\u0022TMS\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/maneuver-node-improvement/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/maneuver-node-improvement/\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDude, already have.\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2013-09-26T07:45:31Z","Content":"\n\u003Cp\u003EBy the way... There is already a way to get the info to stay displayed while you tweak.\u003C/p\u003E\u003Cp\u003EClick on the indicator. It\u0027s a little touchy and you need to be careful not to click on the line as you will place a node... But once you get it, it will stay there until you click it again or leave the map view.\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-09-26T07:48:02Z","Content":"\n\u003Cp\u003EYou know, I\u0027d have thought someone would have made a mod that catered to your second request - showing all orbital information parameters when a node is open. You might have more immediate success asking for a mod developer to look at this. Maybe even drop voneiden a line and suggest it as a feature request in the existing node plugin.\u003C/p\u003E\n"},{"CreatedByName":"Eskarina","CreatedById":79945,"CreatedDateTime":"2013-09-26T08:04:58Z","Content":"\n\u003Cp\u003EI\u0027ll kindly follow your suggestion.\u003C/p\u003E\n"},{"CreatedByName":"dazman76","CreatedById":82860,"CreatedDateTime":"2013-09-26T08:06:15Z","Content":"\n\u003Cp\u003EIt\u0027s a shame that we have to use mods to correct this - I didn\u0027t actually know about the mod linked above, so I\u0027ll have to try that now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EContinuing the OP (we may as well, in the hope that Squad have time to address it soon), the problems I regularly have are:\u003C/p\u003E\u003Cp\u003E1) Small adjustments are often next to impossible - I would much rather wait for a node adjustment that is always fine and precise, even if that means 10 seconds of dragging/adjustment to get the desired result. It would be fantastic if node drag speed is dependent on the current distance from the closest body - but I really would just settle for slow adjustment. Trying to correct inclination by 5 degrees is so damn frustrating at the moment \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E2) Text info for the new periapsis/apoapsis is constantly overlaying the existing two nodes, when making fine adjustments. I\u0027ve tried swinging the camera around and changing zoom, but I\u0027m usually left deciphering two strings of text that are right on top of each other. Again, the amount of fiddling and frustration here is evident within seconds of each manoeuvre. It would be fine if the info for the new/potential nodes are displayed \u0022further out\u0022 than the current orbit nodes, in terms of distance from the relevant body - even if I\u0027m adjusting downwards, as long as I can clearly see which is current and which is post-manoeuvre, that\u0027d be perfect. I think we\u0027re talking about screen space here (UI objects) rather than world space, so this should be an easy solution.\u003C/p\u003E\u003Cp\u003E3) As already mentioned, having to hover over the new nodes is a pain - although there seems to be a workaround of sorts (clicking the node - haven\u0027t actually tried that), this info should just be visible whenever the node adjustment is active.\u003C/p\u003E\u003Cp\u003EI love the general way the node system works, but it\u0027d be ten times better if these problems were fixed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2013-09-26T09:47:48Z","Content":"\n\u003Cp\u003EPersonally once a node location is set, I dont see why we cannot edit its other parameters at the navball so you dont have to mess around with reopening nodes that minimise while you are zooming out. I agree its a difficult system to use, but it is a lot better than no nodes at all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Eskarina","CreatedById":79945,"CreatedDateTime":"2013-09-26T11:28:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boolybooly\u0022 data-cite=\u0022boolybooly\u0022\u003E\u003Cdiv\u003EI agree its a difficult system to use, but it is a lot better than no nodes at all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince nodes are created and implemented. Saying that is a very poor excuse. Nodes are GREAT and I\u0027m saying that a little bit of polish could turn them into the PERFECT route planner that Kerbal deserves. It\u0027s true that lacks precission for 0.001 adjustments, but as I said plugins solves it rather good. Probably the addition of numeric input is the solution, but I\u0027m not talking about precission, since plugins takes care of that. I\u0027m saying the very nodes behaves against the actual user they should help.\u003C/p\u003E\u003Cp\u003EI think grouping the orbital information parameters in a separated window is a nice solution too. (no more blind tweaking at least)\u003C/p\u003E\n"},{"CreatedByName":"Apollo13","CreatedById":74572,"CreatedDateTime":"2013-09-26T12:24:24Z","Content":"\n\u003Cp\u003EAnd yet, nobody has mentioned the MechJeb Maneuver Node Editor. It provides a very fine granularity for modifying nodes. Even if you\u0027re adverse to using MJ for anything else, this one feature will resolve your issues. Just add Kerbal Alarm Clock to remove the tedium.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-09-27T00:58:41Z","Content":"\n\u003Cp\u003EI concur with this post\u003C/p\u003E\n"}]}