{"TopicId":48232,"ForumId":55,"TopicTitle":"For .22: Component cost?","CreatedByName":"webkilla","CreatedById":71356,"CreatedDateTime":"2013-10-13T15:32:59Z","PageNum":1,"Articles":[{"CreatedByName":"webkilla","CreatedById":71356,"CreatedDateTime":"2013-10-13T15:32:59Z","Content":"\n\u003Cp\u003EIt\u0027s already shown in the game - but will it become an actually used feature at some point during .22 ?\u003C/p\u003E\u003Cp\u003EI mean, one thing is doing science - but you need to fund that science too, say, by launching rockets, or doing space tourism.\u003C/p\u003E\u003Cp\u003EWith the subassembly system being introduced, new sub-assembly bits such as \u0022Rockomax Satelite XYZ\u0022 that you\u0027d get 2000 Kerbux for if you put into orbit could be added as a sub-assembly bit that you can\u0027t alter\u003C/p\u003E\u003Cp\u003EOr similarly unique passanger compartments with space tourists in them, that\u0027ll pay huge amounts of kerbux to be taken to the mÃƒÂ¼n or just in orbit? ...of course, it\u0027ll only pay out if you get them back to Kerbin alive (and conversely, you\u0027ll stand to be fined a lot if they die)\u003C/p\u003E\u003Cp\u003EIn theory it should be easy to integrate with the stuff being added for .22\u003C/p\u003E\u003Cp\u003E - Another building or something for financing\u003C/p\u003E\u003Cp\u003E - It will allow you to select unique \u0027missions\u0027 that pay out a certain amount\u003C/p\u003E\u003Cp\u003E - \u0022get this satelite into orbit around [Planet X] in a roughly circular orbit at roughly [altitude], payout is [amount of kerbux]\u003C/p\u003E\u003Cp\u003E - \u0022get these space tourists into orbit around kerbin and bring them back after 3 hours - alive, for [big amount of kerbux]\u0022\u003C/p\u003E\u003Cp\u003E - each mission will represent itself as a sub-assembly component that you can\u0027t fiddle around with too much. Tourists might have huge electricity requirements, deny you any use of nuclear engines and generators, and you can\u0027t obscure their windows - while satelites might be unwieldy and unbalance your rocket\u003C/p\u003E\n"},{"CreatedByName":"Nobody","CreatedById":64303,"CreatedDateTime":"2013-10-13T18:21:26Z","Content":"\n\u003Cp\u003EConsidering that the streamers who were given advanced copies of .22 had no limit on funds it isn\u0027t likely to be in with it but will probably come soon. The RnD system was a huge first step into creating career mode and is pretty much the entire update.\u003C/p\u003E\u003Cp\u003EThe developers have mentioned that there are diminishing returns the more they get into expanding existing features(Time spent vs noticeable difference) which is why they took a break from the stuff they had been expanding to make a big jump into parts they had not really touched on. Most likely .23 and .24 will also be spend fleshing out career mode since they can get a lot of progress for their work as opposed to fine tuning physics and adding parts.\u003C/p\u003E\n"},{"CreatedByName":"webkilla","CreatedById":71356,"CreatedDateTime":"2013-10-13T18:35:45Z","Content":"\n\u003Cp\u003Efair nuf\u003C/p\u003E\u003Cp\u003Ewould be neat if there was a list of future planned features...\u003C/p\u003E\n"},{"CreatedByName":"GluttonyReaper","CreatedById":59429,"CreatedDateTime":"2013-10-13T18:44:39Z","Content":"\n\u003Cp\u003EWell...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Planned_features\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Planned_features\u003C/a\u003E\u003C/p\u003E\n"}]}