{"TopicId":50110,"ForumId":55,"TopicTitle":"Science Button Missing at Custom Resolution","CreatedByName":"Tyghter","CreatedById":89829,"CreatedDateTime":"2013-10-22T22:22:13Z","PageNum":1,"Articles":[{"CreatedByName":"Tyghter","CreatedById":89829,"CreatedDateTime":"2013-10-22T22:22:13Z","Content":"\n\u003Cp\u003EI understand that I can\u0027t expect developers to cater to the needs of people manually editing their .cfg\u0027s, but I have a custom resolution that I\u0027m rather fond of which is fairly unusable in career mode due to the research button being off screen. I had hoped that maybe I could select research options and hit [Enter] as a simple way around this but even more surprisingly, doing so immediately dumps me back to the opening screen of the game (perhaps I should file a separate bug report about that but I honestly don\u0027t care if it\u0027s fixed since not hitting [Enter] on the research screen is easier). I\u0027ve confirmed this behavior on .22 with no mods installed.\u003C/p\u003E\u003Cp\u003EI\u0027d hoped I might be able to made a mod to fix the research GUI issue but based on what I\u0027ve read on what is and isn\u0027t possible with mods, this isn\u0027t. Someone please correct me if I\u0027m wrong.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hEVZrbD.jpg\u0022 alt=\u0022hEVZrbD.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tyghter","CreatedById":89829,"CreatedDateTime":"2013-10-22T23:18:03Z","Content":"\n\u003Cp\u003EFound a temporary workaround. This problem is mainly due to my dependence on weird resolutions that fit within the viewable area of my TV which is so crappy that uneven parts of it are cut off by plastic on the sides. A lot of modern TVs have built-in resizing that can fix the issue but, again, my TV is too crappy to have that feature. As an adequate workaround for anyone else with this problem, I recommend trying resolution 1228x690 which fits properly and leaves just the smallest sliver of the research button to click.\u003C/p\u003E\n"}]}