{"TopicId":50241,"ForumId":55,"TopicTitle":"Idea for the Science tree","CreatedByName":"PirateAE","CreatedById":57902,"CreatedDateTime":"2013-10-23T17:14:19Z","PageNum":1,"Articles":[{"CreatedByName":"PirateAE","CreatedById":57902,"CreatedDateTime":"2013-10-23T17:14:19Z","Content":"\n\u003Cp\u003EHello, Heres my idea that kinda come off from The civilization 4 tech tree but think it would work out ok for KSP. A Cost reduction if you have multiple researches pointng at it researched. For Example Tech A leads to tech B and C. B leads to Tech F and E; C just leads to F\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E       -\u0026gt;E\u003Cbr\u003E   -\u0026gt;B |\u003Cbr\u003EA |    =\u0026gt;F\u003Cbr\u003E   -\u0026gt;C |\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBase costs are\u003C/p\u003E\u003Cp\u003EA Costs 10\u003C/p\u003E\u003Cp\u003EB \u0026amp; C cost 20\u003C/p\u003E\u003Cp\u003EF \u0026amp; E cost 30\u003C/p\u003E\u003Cp\u003EA, B, C and E all have just one tech leading to them so theres no change to cost, but if you have Both B and C researched F would get a hair cheaper, say on the order of 5-10%. enough that it matters but not enough that its cheaper to research both before. \u003C/p\u003E\u003Cp\u003EThe reasoning for the idea is if you researched both before hand you would have more knowhow relating to that branch to formulate the next tech faster/cheaper\u003C/p\u003E\n"},{"CreatedByName":"PirateAE","CreatedById":57902,"CreatedDateTime":"2013-10-24T08:39:02Z","Content":"\n\u003Cp\u003ELooking for some feedback on this idea \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Anything i need to explain better etc.\u003C/p\u003E\n"},{"CreatedByName":"MC.STEEL","CreatedById":89456,"CreatedDateTime":"2013-10-24T11:16:08Z","Content":"\n\u003Cp\u003EIts a good idea but i dont think they will add such a thing very soon.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-10-24T11:42:51Z","Content":"\n\u003Cp\u003EI don\u0027t think there should be science \u003Cem\u003Epoints\u003C/em\u003E at all. The science tree should be just a tree of research that has to be done and in key positions you should be awarded with technology pieces which will allow you to fly higher and faster so you\u0027re able to perform further research. Each further node in the research tree and each piece of technology should have set of prerequisity researches which must be delivered to unlock the node or the piece. Delivery of the data instead of transmission, or performing research using manned mission may be requirements for some of researches.\u003C/p\u003E\u003Cp\u003ENot only this would make you to travel the whole system before you feel you\u0027re done with the game, it would also make those crazy tech level 0 missions over all planets pointless as making that mission would not gather all prerequisities to get significant progress in the science tree and you could do the same using less effort with better technology later.\u003C/p\u003E\n"},{"CreatedByName":"Roderik","CreatedById":85776,"CreatedDateTime":"2013-10-24T13:11:11Z","Content":"\n\u003Cp\u003EIf the a, b, etc are standing under the pic\u0027s i find it a great idea\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-10-24T14:18:41Z","Content":"\n\u003Cp\u003EIt makes logical sense that researching both required nodes makes the higher one easier, but is it a gameplay improvement?\u003C/p\u003E\u003Cp\u003EThe effect is that it encourages the player to grab more lower level techs before specializing while penalizing rushing the tree for specific high level tech. Would this make the game more fun? I\u0027m not sure one way or the other without trying it.\u003C/p\u003E\n"}]}