{"TopicId":50600,"ForumId":55,"TopicTitle":"Lab modules","CreatedByName":"SteveU","CreatedById":90061,"CreatedDateTime":"2013-10-26T00:38:21Z","PageNum":1,"Articles":[{"CreatedByName":"SteveU","CreatedById":90061,"CreatedDateTime":"2013-10-26T00:38:21Z","Content":"\n\u003Cp\u003EFirst off, I\u0027ve been playing and loving KSP for ~2 years now and absolutely adore the new career mode. With that said, I\u0027ve got a few suggestions for the science system:\u003C/p\u003E\u003Cp\u003EAs a few people have pointed out, science on space stations/surface bases is quite limited at the moment due to the fact they are generally in one location/biome. One frequently suggested solution is to have time based experiments, but this introduces timewarp exploitation issues (personally, I still like the idea as I don\u0027t tend to abuse timewarp, but hey). My suggestion to make science stations more viable is the introduction of \u0027lab\u0027 modules that can improve the percentage of science gathered when transmitting data. The logic here is that there is very little science that can be done in a cramped capsule (hence the massively diminished science returns) while you could do quite a bit more in an orbiting laboratory like the ISS (giving you greater science returns).\u003C/p\u003E\u003Cp\u003EFor example, a surface expedition on Duna collects some surface samples. They now have the choice of either examining them while in their capsule and transmitting their findings back (20% science return), returning them to their orbiting/landed Duna science station and studying/transmitting from there (maybe 50-70%\u002B science return) or returning them to a proper lab on Kerbin for 100% science return. Though this example deals with surface samples, it could easily be applied to anything that suffers a loss when transmitting vs returning to Kerbin.\u003C/p\u003E\u003Cp\u003EThis mirrors a lot of current space program thinking as most Moon/Mars missions are envisaged with a \u003Ca href=\u0022http://www.nasa.gov/exploration/technology/deep_space_habitat/2011-testing.html\u0022 rel=\u0022external nofollow\u0022\u003Elab component\u003C/a\u003E to do useful science while on the surface. Compare this to the Apollo program, where astronauts were pretty much limited to EVA reports and describing the samples they picked up (as our Kerbals are now) with the only real science happening on Earth.\u003C/p\u003E\u003Cp\u003EIn terms of implementation, it would need a way of transferring samples between modules (this is pretty high on my want list for the next update anyway) so surface samples could be put into the lab, which entails some thinking about how to handle that (How to transfer? Do samples have mass? Can each module hold a limited number of samples? etc.). Though the Hitchhiker could be re-purposed as a lab, it would likely require some more modules and I personally like the idea some large, advanced lab modules that need a lot of power to operate. There are also questions about how to balance they system, for example, what percentage of science could you effectively \u0027recover\u0027 using a single lab module? How does this scale? ie. how many lab modules do you need to reach the cap? Is there a cap at all and if so, where does it lie? 60%? 90%? (Presumably, these orbiting labs would never be quite as capable as a full lab on Kerbin).\u003C/p\u003E\u003Cp\u003EI think the advantages are fairly clear - it encourages building of infrastructure (not just fuel tanks with docking ports) throughout the Kerbin system, it isn\u0027t exploitable by timewarping and only extends the existing science system rather than radically overhauling it. Looking ahead, there are avenues for further use of this mechanic - if Kerbals with science skills are introduced, they could affect the efficiency of the labs etc.\u003C/p\u003E\u003Cp\u003EIn terms of disadvantages, I suppose a (research) station in Kerbin orbit would be less valuable than one in say, Duna orbit as any craft returning to Kerbin with samples to research might as well just land on Kerbin for 100% science return.\u003C/p\u003E\u003Cp\u003EAnyway, just some thoughts. Happy to have some feedback.\u003C/p\u003E\n"}]}