{"TopicId":50678,"ForumId":55,"TopicTitle":"Still my favourite game. Can we talk about the UI?","CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-10-26T17:19:22Z","PageNum":1,"Articles":[{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-10-26T17:19:22Z","Content":"\n\u003Cp\u003EGreat game etc etc. See my sig for evidence as to how much I play this game.\u003C/p\u003E\u003Cp\u003EWith that out of the way...\u003C/p\u003E\u003Cp\u003EAny program in development generally has a fairly skeletal UI. This is because without being entirely sure what features are going to come in you can\u0027t know exactly what you\u0027ll want in the interface, and you don\u0027t want to rework it continuously.\u003C/p\u003E\u003Cp\u003EAre there any plans for a fairly significant UI overhaul? I think we\u0027re at a stage where an improved UI is a reasonable thing to spend some time on. Here\u0027s my list of UI niggles:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E There\u0027s not much information for new players. When starting the game and presented with the space center it\u0027s not clear what you should do. A friend of mine has only been playing for a couple of weeks and does not constantly read the forums like some of us. He did not know what the new building was. He figured that having so many parts missing was something to do with career mode, but not where to go to get new ones. He did not know you could right click to take a crew report or EVA report. He did not know that he had to spend science, or where to do so.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The fuctionality of Editor Extensions should be vanilla. Nothing more to say on that.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The save/return/terminate/tracking station mechanics could use a bit of a rethink. For example, if you fly a ship into orbit you can escape and revert, but if you quicksave and load back to that same position, you can no longer revert. Several times times I have exited out of the game, copied my craft files, started up a new game, and pasted across my craft files because of this. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Waiting for interplanetary transfer windows while in low Kerbin orbit is impossible due to the limitation on warp. There is a workaround, but it is laborious: Go back to the space center (transition wait). Go to the VAB (transition wait). Create a new ship with just a command pod. Launch it (transition wait). Warp to maximum. Go to map view. Switch ships. Create a manoeuvre node to see if you have an intercept. If not switch back to the launchpad ship and warp some more. Repeat many times. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The time it takes to load up the space center environment and to then transition to the building you actually want also makes this a bit more frustrating than it needs to be. In the VAB and want to go to the tracking station? You have to go through the space center view. While 0.22 has slightly improved transition times, zero transition time is always going to be better!\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The list of craft list can get very long and tedious to scroll through without subfolders or categorization. I routinely alt-tab out to windows and delete via explorer, where I can see more craft in a nice big window, and I can multi-select to delete or move files.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The parts can be difficult to distinguish in the VAB. For example, which of these is the large, and which is the small? \u003Cbr\u003E\u003Cimg src=\u0022http://i.imgur.com/utV72Tf.png?1\u0022 alt=\u0022utV72Tf.png?1\u0022\u003E\u003Cbr\u003EThere are several examples like this. Organization by size might be good. Fuel tanks in particular take up a lot of part space. Rather than have a dozen different icons, why not just pick up a fuel tank and then hit hotkeys, buttons, etc to change radius up and down or increase/decrease capacity?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E More on hotkeys. Some things can be put in action groups while others cannot, and it\u0027s not clear why there\u0027s a difference. For example, enable and disable flow on fuel tanks cannot. EVA cannot. Transmit data cannot. But they\u0027re all right click actions just like other things that can be put in action groups, like \u0022toggle engine\u0022. Why not just allow every action to be hotkeyable? This includes action groupable things, but also other in game actions. For example, EVA does not have a mappable input. For craft with multiple crew you could just prompt the player for which crewmember to send on EVA. For craft with just one crewmember, just have them get out when the key is pressed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Map view needs several things fixed. It seems to have a lot of trouble with the mouse and mouse cursor. For instance, selecting a vessel in orbit sometimes cannot be done unless you shift camera angles, and sometimes it cannot be done at all. Manoeuvre nodes sometimes cannot be placed, particularly when on approach to another celestial body. Manoeuvre nodes also have a habit of closing for no reason, or collapsing back down when you drag a handle. Manoeuvre nodes are also imprecise to use. Being able to bind the various manoeuvre node handles to hotkeys is definitely something that\u0027s needed.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The map camera does not work well with interplanetary stuff. Any conic draw mode other than zero does not allow you to zoom in on an intercept. Being able to freely pan the map around might fix this, but there\u0027s still an issue when your manoeuvre node is a long way from your target, seeing both on the screen can be challenging, and manoeuvre nodes tend to glitch out when you try to adjust them when zoomed out a long way (another reason for hotkeys).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Certain information that should be available can only be obtained via tedious repetition or switching out to the web browser. For example, knowing which biome you are in requires actually getting out and doing an EVA report. There\u0027s no reason not to simply display this all the time. Showing phase angles to targets would be nice too. Fuel levels in map view. Actually, why not show the whole UI in map view, and why start each launch with the navball minimized?\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Some view state is not remembered. For example, if you set the camera zoom level on the ship and then go to map view, the zoom level is reset when you return. If I recall correctly switching between craft also forgets all camera and map view state for each craft, as well as any manoeuvre nodes that had been set up. EVA may also reset manoevure nodes, I can\u0027t recall.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E A HUD in IVA view would be nice (this can wait)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E The navball icons could be a little crisper. Also the navball (or some other mechanism) should give more information on docking alignment. Finally, navball indicators should always be visible. Just pin them to the edge of the circle when they are on the back side.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENow, someone is inevitably going to come in and tell me about certain mods that do, at least in part, assist with at least some of the things I have listed here. So let me respond in advance.\u003C/p\u003E\u003Cp\u003E1) \u0022Can\u0027t someone else do it?\u0022 is not a reasonable position to hold. With the exception of the IVA HUD, I\u0027ve tried to limit my list to core game elements that are used often by virtually all players.\u003C/p\u003E\u003Cp\u003E2) Mods may stop working at any time as authors move on to other things while Squad keeps updating KSP.\u003C/p\u003E\u003Cp\u003E3) Modded installations are not supported (with respect to bug reports etc) due to the inherent instability of having stuff added that wasn\u0027t developed by the team themselves.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-26T17:40:43Z\u0022 title=\u002210/26/2013 05:40  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 26, 2013\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mefi282","CreatedById":63817,"CreatedDateTime":"2013-10-26T17:50:34Z","Content":"\n\u003Cp\u003EA ool for launch windows would be really nice! And it if it would be possible to pan the map freely id really like that but i think all the other issues regarding the map view are OK since the sort feature does his job. \u003C/p\u003E\u003Cp\u003EAnd unlike other games KSP is not a simple game to play, you have to learn a lot anyways so i guess the first point isn\u0027t nessecary.\u003C/p\u003E\n"},{"CreatedByName":"Nemoricus","CreatedById":4141,"CreatedDateTime":"2013-10-26T19:53:57Z","Content":"\n\u003Cp\u003ELots of good thoughts and suggestions here, so I\u0027m going to comment on the most important ones.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EThere\u0027s not much information for new players.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is perhaps one of KSP\u0027s biggest detriments at the moment. In addition to KSP being hard in and of itself, the opacity of the interface adds another layer of difficulty. The lack of descriptions on building functions, the lack of in-game information on how to unlock parts, and the nonintuitive way of doing science can be real turn-offs for new players. This lack of information should be addressed in future updates, since while the game is a work in progress, the easier it is for new players to start playing, the easier it will be to sell the game. Since KSP\u0027s development depends on continued sales, this is quite important.\u003C/p\u003E\u003Cp\u003ENow, I\u0027m not saying that the game should be made easier. Not at all. However, looking at the forums/videos should not be how most players learn how to use the game\u0027s core features, which seems to be the case at the moment.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWaiting for interplanetary transfer windows while in low Kerbin orbit is impossible due to the limitation on warp. There is a workaround, but it is laborious: Go back to the space center (transition wait). Go to the VAB (transition wait). Create a new ship with just a command pod. Launch it (transition wait). Warp to maximum. Go to map view. Switch ships. Create a manoeuvre node to see if you have an intercept. If not switch back to the launchpad ship and warp some more. Repeat many times.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETime warp in general could use tweaking. The size of the time step is critical for two areas: planetary close approaches, especially ones with atmospheres, and SoI changes. The current system of time warp limiting doesn\u0027t really work for either of these. As a recent Danny2462 video demonstrates, you can warp through Kerbin with a sufficiently high time step, despite the fact that the time warp limit lowers as you descend. Since the step size is so big, the vessel moves through each of those zones in a single step, effectively bypassing them.\u003C/p\u003E\u003Cp\u003EA better system would take into account both altitude and vertical velocity, and preventing you from using high time warps when altitude is low and vertical velocity is low. I\u0027m not sure how best to work this, though, but a circular orbit that stays above the atmosphere should allow you to use high time warps without issue.\u003C/p\u003E\u003Cp\u003EAs for SoI transitions, perhaps the solution isn\u0027t in the time warp system at all. The patched conic system already calculates where and when SoI transitions occur, so perhaps the game can use this to detect whether a transition will occur during the current time step, and go to calculate the ship\u0027s position using the orbit in the new SoI. With the default patched conic draw limit, it already calculates both, so why not take advantage of that to eliminate the sensitivity to time step size?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThe map camera does not work well with interplanetary stuff. Any conic draw mode other than zero does not allow you to zoom in on an intercept. Being able to freely pan the map around might fix this, but there\u0027s still an issue when your manoeuvre node is a long way from your target, seeing both on the screen can be challenging, and manoeuvre nodes tend to glitch out when you try to adjust them when zoomed out a long way (another reason for hotkeys).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat I\u0027d like to see is something like Orbiter\u0027s TransX MFD, which uses a patched conic system. While Orbiter itself is n-body, TransX is still reasonably accurate, and would be perfect in KSP. Sure, the interface could use some work, but it would be an improvement over the current maneuver node system for interplanetary maneuvers. Fine control of burn size and on-screen display of all parameters is a big plus. Also, no need to worry about camera angle when trying to use all three axes on a maneuver node.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ECertain information that should be available can only be obtained via tedious repetition or switching out to the web browser. For example, knowing which biome you are in requires actually getting out and doing an EVA report. There\u0027s no reason not to simply display this all the time. Showing phase angles to targets would be nice too. Fuel levels in map view. Actually, why not show the whole UI in map view, and why start each launch with the navball minimized?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes please, to all of that.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mefi282\u0022 data-cite=\u0022Mefi282\u0022\u003E\u003Cdiv\u003EAnd unlike other games KSP is not a simple game to play, you have to learn a lot anyways so i guess the first point isn\u0027t nessecary.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I said at the start of my post, KSP\u0027s development depends on sales to new players, so being accessible is important. It shouldn\u0027t be easy to do everything in the game, no, but it should be easy to pick up and start playing, which isn\u0027t really the case at the moment. There\u0027s a lot of hidden and unexplained info in the game at the moment, most critically in the area of science and R\u0026amp;D.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-10-27T07:59:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nemoricus\u0022 data-cite=\u0022Nemoricus\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs for SoI transitions, perhaps the solution isn\u0027t in the time warp system at all. The patched conic system already calculates where and when SoI transitions occur, so perhaps the game can use this to detect whether a transition will occur during the current time step\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that does seem like an obvious solution, and one that should be very easy to implement. If a transition occurs within the next time step, decrease the warp. Repeat down to a minimum warp of, say, 100x. \u003C/p\u003E\u003Cp\u003EIt should also do this when coming in close to celestial bodies. The game currently will reduce warp automatically, but only, again, if at some point you are at an altitude that requires it. At high warp you can speed right past your periapsis and never actually be detected at a low enough altitude to cause time to reduce, so the same mechanism would work here. If, in the next time step, you will have passed periapsis, reduce the warp. Again, repeat the check down to a minimum of 100x warp.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2013-10-27T11:05:36Z","Content":"\n\u003Cp\u003EAgree with much of what you have said here. One thing I\u0027d like to comment on:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E[*] Certain information that should be available can only be obtained via tedious repetition or switching out to the web browser. ... Showing phase angles to targets would be nice too. ...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis I partially agree with. I strongly feel this should be linked to progress in career mode. Once you\u0027ve researched the planets say using a telescope you then get to know phase angles. Obviously this would be for future, but I think it would fit in nicely.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-10-27T16:18:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Merinsan\u0022 data-cite=\u0022Merinsan\u0022\u003E\u003Cdiv\u003EI strongly feel this should be linked to progress in career mode. Once you\u0027ve researched the planets say using a telescope you then get to know phase angles. Obviously this would be for future, but I think it would fit in nicely.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that sounds like a really good idea. You could really go quite a long way with the observatory by breaking its upgrades into ever improving steps. First you could just see the current phase angles. Then you get something that will tell you what phase angle you should launch at for a given target. Eventually you get messages about upcoming available launch windows.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-10-27T16:24:23Z","Content":"\n\u003Cp\u003EA lot of UI changes, especially to improve usability for new payers, make things easier for all players, language localizations (most likely spanish) and even enhancements for the colourblind are all planned for the late stages of KSP\u0027s development, but we\u0027re a while from there yet.\u003C/p\u003E\u003Cp\u003ERomfarer will be testing new UI elements with every release, so expect some wonderful stuff from him \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-10-28T00:47:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EA lot of UI changes, especially to improve usability for new payers, make things easier for all players, language localizations (most likely spanish) and even enhancements for the colourblind are all planned for the late stages of KSP\u0027s development, but we\u0027re a while from there yet.\u003Cp\u003ERomfarer will be testing new UI elements with every release, so expect some wonderful stuff from him \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI expected as much, and I agree that a full overhaul isn\u0027t really warranted until more of the features are fleshed out and it is known what kind of UI is ultimately going to be needed. \u003C/p\u003E\u003Cp\u003EThat being said, there are some things in the list that aren\u0027t dependent on the final UI design and are to some extent on a blurry line between a \u0022would be nice if\u0022 and \u0022bug\u0022. Things that seem like they could use some attention now would be...\u003C/p\u003E\u003Cp\u003EGeneral manoeuvre node bugginess. A quick introduction of bindable hotkeys for each drag handle, and to move forward and backward in an orbit (default map to numeric keypad, maybe?) would go a long way to fixing this with no change to the actual UI (ie, very little effort)\u003C/p\u003E\u003Cp\u003E- Right-click part actions that cannot be put into action groups\u003C/p\u003E\u003Cp\u003E- Loss of manoeuvre nodes when loading a save, switching vessels or performing an EVA\u003C/p\u003E\u003Cp\u003E- Ability to zoom in on an interception in map view regardless of the conic draw mode (just add the SOI entry point to the focusable objects list)\u003C/p\u003E\u003Cp\u003EI\u0027m a big fan of Romfarer, when his lazor mod came out it really showed the extent of what could be done even just via what\u0027s available to modders, so I expect good things!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-28T00:50:55Z\u0022 title=\u002210/28/2013 12:50  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 28, 2013\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"}]}