{"TopicId":51067,"ForumId":55,"TopicTitle":"Don\u0027t like Career Mode","CreatedByName":"Boiler1","CreatedById":64267,"CreatedDateTime":"2013-10-29T15:06:09Z","PageNum":1,"Articles":[{"CreatedByName":"Boiler1","CreatedById":64267,"CreatedDateTime":"2013-10-29T15:06:09Z","Content":"\n\u003Cp\u003EPersonally, I do not like career mode as it is right now. There I said it. I feel better now. Don\u0027t take offense from this. I love the game.\u003C/p\u003E\u003Cp\u003EI do like how science points are collected from sensors using electricity. This finally gives electrical power an important use. I do think you need more sensors though.\u003C/p\u003E\u003Cp\u003EI don\u0027t like the biome scheme. This is a game about space. You should be rewarded more for achieving orbit and orbiting the planet than taking small jumps to the 3 or 4 biomes that are within sight of the Launchpad. Speaking of the launchpad, it irritates me that a lot of science points can be collected sitting on the launch pad. \u003C/p\u003E\u003Cp\u003EI would also like to see the docking port and docking port jr. moved to a lower level of technology. I think docking, and other complex maneuvers should reward science points.\u003C/p\u003E\u003Cp\u003EIn sandbox mode there are several milestones that people naturally try to achieve. Getting to orbit, orbiting the Mun, landing on the Mun, orbiting Duna, landing on Duna, ect.... In career mode these milestones should be rewarded more than where you land when you return to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-29T15:11:46Z","Content":"\n\u003Cp\u003ECareer mode is still in its infancy. The biomes on the Mun and most likely the planned biomes on other planets and moons provide much more science than the biomes on Kerbin.\u003C/p\u003E\u003Cp\u003EI can\u0027t tell from your post. Are you against biomes in general, or just the idea of biomes on Kerbin giving science? Because I believe the science rewards for near and high above Kerbin are also much higher than from landing.\u003C/p\u003E\n"},{"CreatedByName":"Rex3921","CreatedById":69610,"CreatedDateTime":"2013-10-29T15:14:39Z","Content":"\n\u003Cp\u003EI do agree. It is a bit too easy. I went half way down the tree by just doing stuff at the sea, launch pad and nearby biomes. You do get points for recovering a vessel that\u0027s went to orbit or landing at the moon.\u003C/p\u003E\u003Cp\u003EBut with the docking ports lower, like the Launch stabilizers and strut cables, it makes a terrible rocket an maybe game mode awesome!\u003C/p\u003E\u003Cp\u003EBut yeah I do agree and if anyone says I disagree then ignore them; It\u0027s your OPINION. If you don\u0027t know what opinion means then look it up. A view or judgement formed about something, not necessarily based on fact or knowledge. -Google\u003C/p\u003E\n"},{"CreatedByName":"Daid","CreatedById":32171,"CreatedDateTime":"2013-10-29T15:19:17Z","Content":"\n\u003Cp\u003EI think your biggest issue is that you went for the biomes on Kerbal. I unlocked the docking ports, and I only collected a tiny bit of science on Kerbal, just enough for decouplers, after that, I shot for the mun, collected science on the first shot only by passing over the mun, next launch I landed on the mun. Which unlocked more science experiments for me, so I landed on the Mun again, for science. And, if you can shoot for the Mun, you can shoot for Mimus. So, I have had a landing on Mimus next. Pretty much felt like a proper space program, exploring more and more of space.\u003C/p\u003E\u003Cp\u003ENow that I have docking, I can assemble enough fuel in space for a flight to Duna, which will be my next target, and oh boy, Jeb is excited for that mission. (Yes, you could do that without docking, but I\u0027m not that good with large rockets launches for KSP)\u003C/p\u003E\u003Cp\u003EAnd, a big part of space is landing on other planets. Biomes would add a reason to land multiple times on the same planet, and having targeted landing. But I think you can pretty much max out the tree without landing anywhere. There is quite a bit of science to collect by just going high and low orbit on all planets and moons.\u003C/p\u003E\u003Cp\u003EYes, the biomes on Kerbal are a bit silly IMHO. And the initial start feels a bit tough, initial science collecting for the first unlock felt a bit unreal/unrealistic. And I felt like cheating by collecting it on the kerbal surface around KSP.\u003C/p\u003E\n"},{"CreatedByName":"Rabid_Monkey","CreatedById":93704,"CreatedDateTime":"2013-11-21T11:42:43Z","Content":"\n\u003Cp\u003EWhile I agree that there are a lot of tweaks that can \u0026amp; should be made to career mode (isn\u0027t it only the 1st version), I\u0027ve been enjoying it. I like the idea of having to unlock advancements by way of discoveries you make with simpler items. The tech tree is a little wonky in the way the research is done IMHO, but I thought I saw an editor for it while poking around the SpacePort. I thought I might try rearranging things to better suit my idea of how the tech should come about.\u003C/p\u003E\u003Cp\u003ECheck out\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLcGBw4cgSQQT6cUZFJeNqF4L9vrfWf88l\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E series. I really like his self-imposed limits on only unlocking 1 advancement per mission.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daid\u0022 data-cite=\u0022Daid\u0022\u003E\u003Cdiv\u003EAnd, a big part of space is landing on other planets. Biomes would add a reason to land multiple times on the same planet, and having targeted landing. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI could not agree more. I\u0027d even like to see more on Kerbin as it would give a reason to research more aircraft stuff.\u003C/p\u003E\n"},{"CreatedByName":"Monkeh","CreatedById":72122,"CreatedDateTime":"2013-11-21T11:53:49Z","Content":"\n\u003Cp\u003ECareer mode is going to change a hell of a lot over the coming months. First off add in financial constraints, training kerbonauts, hiring scientists to research all the parts, missions from governments and companies and other stuff that may or may not make it into the final game.\u003C/p\u003E\u003Cp\u003EWhat we have here is just the start of career mode, it\u0027s going to get a whole load more challenging and interesting as more stuff gets added, be patient and you shall be rewarded with genius, I have little doubt.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-11-21T14:27:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Monkeh\u0022 data-cite=\u0022Monkeh\u0022\u003E\u003Cdiv\u003ECareer mode is going to change a hell of a lot over the coming months. First off add in financial constraints, training kerbonauts, hiring scientists to research all the parts, missions from governments and companies and other stuff that may or may not make it into the final game.\u003Cp\u003EWhat we have here is just the start of career mode, it\u0027s going to get a whole load more challenging and interesting as more stuff gets added, be patient and you shall be rewarded with genius, I have little doubt.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally? And who tell you that?\u003C/p\u003E\u003Cp\u003EThe only that we know, it is that in the future an \u0022economic and mining-resource system\u0022 can be implemented. But we dont know how it would be.\u003C/p\u003E\u003Cp\u003ERight now, the only that I know, is that career mode with the weird tech tree \u0022when you unlock new tank sizes and shapes :P\u0022 and the toy science system, looks silly and boring.\u003C/p\u003E\u003Cp\u003ESo said that we dont like some things \u0022even when is not finish\u0022 is just a way to help the developers to make choices about the stuffs that they are not sure how to do it.\u003C/p\u003E\u003Cp\u003EI guess that is better than said \u0022all is perfect\u0022 and then realize the things that you dont like remains the same, so you left the game.\u003C/p\u003E\u003Cp\u003ERight know, the only that keeps me playing the game are some mods. But when new versions come out and some mods stop working, then I lose all my things that I build and set up; so is a turning point.\u003C/p\u003E\n"},{"CreatedByName":"scootersoup","CreatedById":92366,"CreatedDateTime":"2013-11-23T08:31:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003Enew versions come out and some mods stop working\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eback up your install...\u003C/p\u003E\n"},{"CreatedByName":"Luis","CreatedById":55075,"CreatedDateTime":"2013-11-23T10:15:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EReally? And who tell you that?\u003Cp\u003EThe only that we know, it is that in the future an \u0022economic and mining-resource system\u0022 can be implemented. But we dont know how it would be.\u003C/p\u003E\u003Cp\u003ERight now, the only that I know, is that career mode with the weird tech tree \u0022when you unlock new tank sizes and shapes :P\u0022 and the toy science system, looks silly and boring.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHarvestr revealed that contracts for missions and financial/reputation constraints were coming in 0.23 in the Reddit AMA.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.reddit.com/r/IAmA/comments/1qjoe2/we_are_the_makers_of_kerbal_space_program_ask_us/cddjz6s\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reddit.com/r/IAmA/comments/1qjoe2/we_are_the_makers_of_kerbal_space_program_ask_us/cddjz6s\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"m1xte","CreatedById":53528,"CreatedDateTime":"2013-11-23T13:24:03Z","Content":"\n\u003Cp\u003ECurrently all the parts are \u0022high tech\u0022 optimized and balanced for sandbox.\u003C/p\u003E\u003Cp\u003ELike LV 909 30 45 engines and SRBs are all too good engines to start with.\u003C/p\u003E\u003Cp\u003EWe need bunch of crappy parts to start career 1t probe core, 150isp motor, heavier fuel tanks with less fuel...\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-11-23T14:12:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EReally? And who tell you that?\u003Cp\u003EThe only that we know, it is that in the future an \u0022economic and mining-resource system\u0022 can be implemented. But we dont know how it would be.\u003C/p\u003E\u003Cp\u003ERight now, the only that I know, is that career mode with the weird tech tree \u0022when you unlock new tank sizes and shapes :P\u0022 and the toy science system, looks silly and boring.\u003C/p\u003E\u003Cp\u003ESo said that we dont like some things \u0022even when is not finish\u0022 is just a way to help the developers to make choices about the stuffs that they are not sure how to do it.\u003C/p\u003E\u003Cp\u003EI guess that is better than said \u0022all is perfect\u0022 and then realize the things that you dont like remains the same, so you left the game.\u003C/p\u003E\u003Cp\u003ERight know, the only that keeps me playing the game are some mods. But when new versions come out and some mods stop working, then I lose all my things that I build and set up; so is a turning point.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you don\u0027t like career mode you don\u0027t have to play it. Its going to get better overall like having to buy the parts. Which will make everybody try to make a cheap rocket.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-11-23T14:30:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022scootersoup\u0022 data-cite=\u0022scootersoup\u0022\u003E\u003Cdiv\u003Eback up your install...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI always use different folders for mod versions of the game, but what happen if I want the new changes in conjunction with the ships and mods that I already have?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luis\u0022 data-cite=\u0022Luis\u0022\u003E\u003Cdiv\u003EHarvestr revealed that contracts for missions and financial/reputation constraints were coming in 0.23 in the Reddit AMA.\u003Cp\u003E\u003Ca href=\u0022http://www.reddit.com/r/IAmA/comments/1qjoe2/we_are_the_makers_of_kerbal_space_program_ask_us/cddjz6s\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reddit.com/r/IAmA/comments/1qjoe2/we_are_the_makers_of_kerbal_space_program_ask_us/cddjz6s\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, that will shut me up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ELets wait and see.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m1xte\u0022 data-cite=\u0022m1xte\u0022\u003E\u003Cdiv\u003ECurrently all the parts are \u0022high tech\u0022 optimized and balanced for sandbox.\u003Cp\u003ELike LV 909 30 45 engines and SRBs are all too good engines to start with.\u003C/p\u003E\u003Cp\u003EWe need bunch of crappy parts to start career 1t probe core, 150isp motor, heavier fuel tanks with less fuel...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy people like the idea of unlock different tank sizes or wings, etc.\u003C/p\u003E\u003Cp\u003EScience advance does nothing to do with different tank sizes and shapes.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Brody_Peffley\u0022 data-cite=\u0022Brody_Peffley\u0022\u003E\u003Cdiv\u003EIf you don\u0027t like career mode you don\u0027t have to play it. Its going to get better overall like having to buy the parts. Which will make everybody try to make a cheap rocket.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat can be the answer to any complaint.. The problem come if my opinion represent more than 30% of other players concerns.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-11-23T14:51:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhy people like the idea of unlock different tank sizes or wings, etc.\u003Cp\u003EScience advance does nothing to do with different tank sizes and shapes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eactually, it does.\u003C/p\u003E\u003Cp\u003EMaterials science has a lot to do with how big you can make things, how much they end up weighing, etc.\u003C/p\u003E\u003Cp\u003EIf you can\u0027t make a tank wall except out of half inch thick cast iron, you\u0027re not going to get up very high. Make it out of 0.01 inch thick carbon fiber and get the same structural strength and you\u0027re getting somewhere.\u003C/p\u003E\n"},{"CreatedByName":"m1xte","CreatedById":53528,"CreatedDateTime":"2013-11-23T15:38:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EWhy people like the idea of unlock different tank sizes or wings, etc.\u003Cp\u003EScience advance does nothing to do with different tank sizes and shapes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy Russians started to play with V2 rockets?\u003C/p\u003E\u003Cp\u003EWhy they didn\u0027t built buran straight away?\u003C/p\u003E\n"},{"CreatedByName":"Turvok","CreatedById":60891,"CreatedDateTime":"2013-11-23T15:53:55Z","Content":"\n\u003Cp\u003EI like daid comment to be honest. It\u0027s alot more like what I did. I just jumped into career without knowing anything about science. I just got enough points to unlock the things that I needed and started exploring. I went mun first then minmus. (2 missions with same ship) I then started sending probes to Duna and Eve. As I didn\u0027t have the tech to have Docking yet. And so forth Don\u0027t think I had nuclear engines yet either. With some self restraint and not being just a min-max player I\u0027m finding career mode brought me back to the game after a 6 month absence. That and how sas works now is so much nicer for landing small craft on other celestial bodies.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-23T15:55:57Z\u0022 title=\u002211/23/2013 03:55  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 23, 2013\u003C/time\u003E by Turvok\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-11-23T16:17:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Eactually, it does.\u003Cp\u003EMaterials science has a lot to do with how big you can make things, how much they end up weighing, etc.\u003C/p\u003E\u003Cp\u003EIf you can\u0027t make a tank wall except out of half inch thick cast iron, you\u0027re not going to get up very high. Make it out of 0.01 inch thick carbon fiber and get the same structural strength and you\u0027re getting somewhere.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne thing is make a tank 200 times the normal size, another is just 2 times or 3 times. It has not sense.\u003C/p\u003E\u003Cp\u003EYou would not find any example in the real world.\u003C/p\u003E\u003Cp\u003EAnd what about the shape of different parts?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m1xte\u0022 data-cite=\u0022m1xte\u0022\u003E\u003Cdiv\u003EWhy Russians started to play with V2 rockets?\u003Cp\u003EWhy they didn\u0027t built buran straight away?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecouse the economic restraint of course.\u003C/p\u003E\u003Cp\u003EAnd always is better to start to test things in small scale. But it does nothing to do with the science or knowledge needed.\u003C/p\u003E\u003Cp\u003EI just hope that when the economic system is implemented, then in that point the size of parts it would not matter in the science tree, just the cost.\u003C/p\u003E\u003Cp\u003EScience needs to be about different kind of engines (different isp), better materials, etc.\u003C/p\u003E\u003Cp\u003EI can understand from the gameplay point of view some things like decouplers or fuel ducts.\u003C/p\u003E\u003Cp\u003EBut different shapes or sizes.. I dont.\u003C/p\u003E\u003Cp\u003EAnd it does not matter if you have only 1 small tank at begining, you stack a lot of those and you build a big rocket anyway.. so what is the point??\u003C/p\u003E\n"},{"CreatedByName":"m1xte","CreatedById":53528,"CreatedDateTime":"2013-11-23T16:27:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EBecouse the economic restraint of course.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELulz\u003C/p\u003E\u003Cp\u003ECommunists were pretty free of economic restraints.\u003C/p\u003E\u003Cp\u003EThey just needed to unlock some technologies first.\u003C/p\u003E\n"},{"CreatedByName":"razark","CreatedById":32993,"CreatedDateTime":"2013-11-23T17:04:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EBecouse the economic restraint of course. ... But it does nothing to do with the science or knowledge needed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you really just say that the only difference between the Wright Flyer and an X-15 is that the X-15 is more expensive?\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-11-23T17:22:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EThe problem come if my opinion represent more than 30% of other players concerns.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour opinion does not represent anyone but yourself. Everyone with a gripe always believes that they speak for some silent, uncountable majority. Remember that this forum does not represent the complete player base - there are many people who are registered but never post, and still more who never register (or even visit) here at all.\u003C/p\u003E\u003Cp\u003EWe are not a republic - we do not somehow represent a cross-section of the overall player base. We are just the sort that feels a need to get more involved than most casual players.\u003C/p\u003E\u003Cp\u003EIn short, you can\u0027t claim to speak for 30% of players, because the \u003Cem\u003Etotal \u003C/em\u003Emembership of the forum doesn\u0027t even constitute \u002230% of the players\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Teodzero","CreatedById":76759,"CreatedDateTime":"2013-11-23T17:43:34Z","Content":"\n\u003Cp\u003EMy problem with career mode is also tech-tree related. The order of unlocking parts there is almost entirely opposite of my usual ship progression. While I can understand the logic behind it (including tank sizes, yes), it feels uncomfortable as hell. I also feel forced into playing it, because science is disabled in sandbox for some weird reason.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-11-23T18:04:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luis\u0022 data-cite=\u0022Luis\u0022\u003E\u003Cdiv\u003EHarvestr revealed that contracts for missions and financial/reputation constraints were coming in 0.23 in the Reddit AMA.\u003Cp\u003E\u003Ca href=\u0022http://www.reddit.com/r/IAmA/comments/1qjoe2/we_are_the_makers_of_kerbal_space_program_ask_us/cddjz6s\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.reddit.com/r/IAmA/comments/1qjoe2/we_are_the_makers_of_kerbal_space_program_ask_us/cddjz6s\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMinor clarification just so that people don\u0027t go ballistic when this doesn\u0027t happen: Harvester said \u0022soon\u0022 rather than \u0022in 0.23\u0022 and given that the devs have said that money won\u0027t be in 0.23, I\u0027m working under the believe that soon meant 0.24, maybe 0.25. Given the fact that they mentioned that 0.23 may go into experimentals soon in yesterday\u0027s livestream, 0.24 may be sooner than some would expect.\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-11-23T18:49:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m1xte\u0022 data-cite=\u0022m1xte\u0022\u003E\u003Cdiv\u003ELulz\u003Cp\u003ECommunists were pretty free of economic restraints.\u003C/p\u003E\u003Cp\u003EThey just needed to unlock some technologies first.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELOL.. WTF?? 14 words and I dint find sense in any of those.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022razark\u0022 data-cite=\u0022razark\u0022\u003E\u003Cdiv\u003EDid you really just say that the only difference between the Wright Flyer and an X-15 is that the X-15 is more expensive?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eehh? who said that? just read my comment or the part that you are quoting, stop imagine things.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EYour opinion does not represent anyone but yourself. Everyone with a gripe always believes that they speak for some silent, uncountable majority. Remember that this forum does not represent the complete player base - there are many people who are registered but never post, and still more who never register (or even visit) here at all.\u003Cp\u003EWe are not a republic - we do not somehow represent a cross-section of the overall player base. We are just the sort that feels a need to get more involved than most casual players.\u003C/p\u003E\u003Cp\u003EIn short, you can\u0027t claim to speak for 30% of players, because the \u003Cem\u003Etotal \u003C/em\u003Emembership of the forum doesn\u0027t even constitute \u002230% of the players\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople love to imagine things, Where I claim that I am the 30% from the people who think like me?\u003C/p\u003E\u003Cp\u003EI just said that in case that my opinion represent more than 30% then it will matter to them. just that.\u003C/p\u003E\u003Cp\u003EI was not the one who did this topic. I was not the first who used the word Toy, boring, spam, arcade, etc to describe the actual career mode. This was not the only topic about this.\u003C/p\u003E\u003Cp\u003EAnd is just a discussion and opinions. Look Teodzero, he seems agree too.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EMinor clarification just so that people don\u0027t go ballistic when this doesn\u0027t happen: Harvester said \u0022soon\u0022 rather than \u0022in 0.23\u0022 and given that the devs have said that money won\u0027t be in 0.23, I\u0027m working under the believe that soon meant 0.24, maybe 0.25. Given the fact that they mentioned that 0.23 may go into experimentals soon in yesterday\u0027s livestream, 0.24 may be sooner than some would expect.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for clarification. I do not care very much if they do it in the 0.24 or 0.26 meanwhile is well planned and thought out, with relevance with the reality and the name of the game, \u0022an space program\u0022.\u003C/p\u003E\n"},{"CreatedByName":"m1xte","CreatedById":53528,"CreatedDateTime":"2013-11-23T21:25:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003ELOL.. WTF?? 14 words and I dint find sense in any of those.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo many words but nothing to say.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-11-24T02:28:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EPeople love to imagine things, Where I claim that I am the 30% from the people who think like me?\u003Cp\u003EI just said that in case that my opinion represent more than 30% then it will matter to them. just that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E...and I pointed out why your opinion (or anyone else\u0027s) represents no one else. What was unclear about that?\u003C/p\u003E\u003Cp\u003EYou can\u0027t say \u0022in case my opinion represents more than 30%\u0022 if you realize that you speak for yourself alone. Each of us represents only ourselves, and this forum is the farthest thing from a representative sample that no legitimate statistical data could be gained.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2013-11-24T03:30:35Z","Content":"\n\u003Cp\u003EAbout the only thing I don\u0027t like about Career mode is how long it takes to get decent plane parts. You\u0027re telling me that Kerbals researched rocket engines and solid rocket boosters before they thought about jets, wings, or landing gear? I know they\u0027re space-crazy, but it\u0027d take some of the sting out of my earlier missions where there\u0027s a lot of one-way trips because I can\u0027t think of a safe way to bring them home again.\u003C/p\u003E\n"}]}