{"TopicId":51652,"ForumId":55,"TopicTitle":"More Use for Rovers and Analyzing Science","CreatedByName":"Deejay2000","CreatedById":73422,"CreatedDateTime":"2013-11-03T03:55:21Z","PageNum":1,"Articles":[{"CreatedByName":"Deejay2000","CreatedById":73422,"CreatedDateTime":"2013-11-03T03:55:21Z","Content":"\n\u003Cp\u003EHey everybody! I couldn\u0027t find a thread on this, so I thought I\u0027d create it myself.\u003C/p\u003E\u003Cp\u003ERovers still seem rather useless. There\u0027s not a whole lot of things for them to do, so I thought maybe they could do science much like the real ones (specifically the ones on Mars). It\u0027d be nice if they could have a robotic arm or something that could take surface samples. Maybe they could be worth more science(?).\u003C/p\u003E\u003Cp\u003EAnother idea is a command module (or something similar) capable of analyzing science, so it\u0027d be worth more science than just transmitting the data straight to mission control. For example, you could have an orbital space station that with a lander that could descend to a planet/moon, collect science, and return back and have it analyzed, then have that information transmitted for more science than if you just directly transmitted it without it being analyzed. Or, of course, you could have a landed lab and have rovers collect science, dock to the lab (or possibly have a kerbal transport the samples[?]), and have it analyzed, and, again, transmit that data.\u003C/p\u003E\u003Cp\u003EThoughts? Opinions?\u003C/p\u003E\n"},{"CreatedByName":"SilverWarior","CreatedById":80669,"CreatedDateTime":"2013-11-03T17:39:20Z","Content":"\n\u003Cp\u003EI like your idea verry much.\u003C/p\u003E\u003Cp\u003EEspecially the ability to analyze results on location and therefore getting more science points for that.\u003C/p\u003E\n"},{"CreatedByName":"Algiark","CreatedById":83907,"CreatedDateTime":"2013-11-03T18:07:22Z","Content":"\n\u003Cp\u003EBasically everything you mentioned could be done on a rover without wheels... And rovers aren\u0027t rovers without wheels.\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2013-11-03T22:02:13Z","Content":"\n\u003Cp\u003EI would resolve this by making scientific data from different areas different. For example info from the poles should be different from info from the equator\u003C/p\u003E\n"},{"CreatedByName":"Kruleworld","CreatedById":69697,"CreatedDateTime":"2013-11-04T04:46:18Z","Content":"\n\u003Cp\u003EI like that idea, especially a robot arm for collecting samples.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Algiark\u0022 data-cite=\u0022Algiark\u0022\u003E\u003Cdiv\u003E.. And rovers aren\u0027t rovers without wheels.\u003C/div\u003E\u003C/blockquote\u003E isn\u0027t rover short for Remotely Operated Vehicle? any un-manned vehicle in ksp would fit that description.\n"},{"CreatedByName":"Luis","CreatedById":55075,"CreatedDateTime":"2013-11-04T08:57:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kruleworld\u0022 data-cite=\u0022Kruleworld\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E isn\u0027t rover short for Remotely Operated Vehicle? any un-manned vehicle in ksp would fit that description.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s ROV, which is normally applied to robotic mini subs that are used to explore undersea trenches and inspect oil rigs.\u003C/p\u003E\u003Cp\u003ERovers are called rovers because they rove.\u003C/p\u003E\u003Cp\u003ERove, verb: to wander about constantly; roam\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-04T10:04:37Z","Content":"\n\u003Cp\u003EThe way to make rovers meaningful is to make a form of science points that have to be gathered across a distance.\u003C/p\u003E\u003Cp\u003EIn other words, you turn the device on, move a distance, then turn it off, and to get full points you have to have moved X number of kilometers while it was on. More points if the thing you\u0027re measuring actually changed during the rove. (i.e. measuring air pressure or graviolis while driving up a hill (climbing a hill) is worth more because the value of g was changing as your altitude changed.) Measuring temperature while driving from light into shadow is worth more because the temperature changed while moving.\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2013-11-04T11:30:52Z","Content":"\n\u003Cp\u003EWhen biomes get added on Duna and in other places rovers will be more useful. Although it will still be a long drive to get anywhere.\u003C/p\u003E\n"},{"CreatedByName":"KSP orbiter","CreatedById":3241,"CreatedDateTime":"2013-11-04T20:25:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pulstar\u0022 data-cite=\u0022Pulstar\u0022\u003E\u003Cdiv\u003EAlthough it will still be a long drive to get anywhere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, and now that you mention it that\u0027s a bit of a concern. We all know how big space is and how long it takes to get anywhere, even with time acceleration. But we can put our ship on the proper trajectory and just accelerate time until it gets there, so it isn\u0027t too painful. A few mid-course correction burns are the worst it gets.\u003C/p\u003E\u003Cp\u003EThe problem is that we can\u0027t do that with rovers - they have to be under control at all times they\u0027re moving. And that slows things down a \u003Cem\u003Elot\u003C/em\u003E. I\u0027ve never managed to get a rover much over 20 m/s, and even at that reckless pace it can still take a long time to get where you\u0027re going. I\u0027m starting to wonder if this is going to require some sort of auto-drive system (another good thing to hang off the science tree...) - just something that tries to go from point A to point B, and calls for attention if it runs into something it can\u0027t handle. At least that way your rovers could rove while you\u0027re doing something else.\u003C/p\u003E\n"},{"CreatedByName":"UberFuber","CreatedById":90736,"CreatedDateTime":"2013-11-04T21:07:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EThe way to make rovers meaningful is to make a form of science points that have to be gathered across a distance.\u003Cp\u003EIn other words, you turn the device on, move a distance, then turn it off, and to get full points you have to have moved X number of kilometers while it was on. More points if the thing you\u0027re measuring actually changed during the rove. (i.e. measuring air pressure or graviolis while driving up a hill (climbing a hill) is worth more because the value of g was changing as your altitude changed.) Measuring temperature while driving from light into shadow is worth more because the temperature changed while moving.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnother possibility is to have the \u0022object of interest\u0022 be small enough that the only way you can sample it remotely is with a rover. First to spot it, then to position the instrument so its very, very close to it.\u003C/p\u003E\n"},{"CreatedByName":"UberFuber","CreatedById":90736,"CreatedDateTime":"2013-11-04T21:16:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KSP orbiter\u0022 data-cite=\u0022KSP orbiter\u0022\u003E\u003Cdiv\u003EYeah, and now that you mention it that\u0027s a bit of a concern. We all know how big space is and how long it takes to get anywhere, even with time acceleration. But we can put our ship on the proper trajectory and just accelerate time until it gets there, so it isn\u0027t too painful. A few mid-course correction burns are the worst it gets.\u003Cp\u003EThe problem is that we can\u0027t do that with rovers - they have to be under control at all times they\u0027re moving. And that slows things down a \u003Cem\u003Elot\u003C/em\u003E. I\u0027ve never managed to get a rover much over 20 m/s, and even at that reckless pace it can still take a long time to get where you\u0027re going. I\u0027m starting to wonder if this is going to require some sort of auto-drive system (another good thing to hang off the science tree...) - just something that tries to go from point A to point B, and calls for attention if it runs into something it can\u0027t handle. At least that way your rovers could rove while you\u0027re doing something else.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not that far from real-life.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/File:PIA16934-RoverDistances-20130515.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/File:PIA16934-RoverDistances-20130515.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote the \u0022record\u0022 distance of a rover on Mars is... 35.76 km by Opportunity, which is an outlier compared to its brother, Spirit (7.7 km). Assume a reasonable limit of 10 km, at 10 m/s, its 100 second per km, and 1000 s (20 minutes) for 10 km.\u003C/p\u003E\u003Cp\u003ESo that, I suggest the following idea for rover exploration (in addition for new uses for satellite).\u003C/p\u003E\u003Cp\u003EIn addition to the current science system, there\u0027re also location specific science that can be discovered in your exploration.\u003C/p\u003E\u003Cp\u003EFirst, you need to map the planet using a variety of instruments (where satellites come in).\u003C/p\u003E\u003Cp\u003EThen, the Kerbals will \u0022analyze\u0022 the map and generate several points of interest, near which (within, say 1 km of the point of interest) will be a few objects of interests where you must be within X meters to analyze/experiment. Which means that unless you\u0027re really, REALLY good an landing on a dime, you\u0027ll need to send a rover for finer controls.\u003C/p\u003E\u003Cp\u003ENext, you send a rover to the point of interest, where you have to drive around in the vicinity to experiment/visit the object of interests.\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2013-11-04T22:32:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UberFuber\u0022 data-cite=\u0022UberFuber\u0022\u003E\u003Cdiv\u003EAnother possibility is to have the \u0022object of interest\u0022 be small enough that the only way you can sample it remotely is with a rover. First to spot it, then to position the instrument so its very, very close to it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis would actually be cool to have not just for unmanned rovers but also for manned exploration. Could also be used with missions, like say get a camera/spectrometer and make a picture from X meters of a feature somewhere on Duna. The game could spawn some unique rocks in an area of a few square kilometers then and tell you roughly where it is. You land, do the picture, send it back, get science for finishing the mission.\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-11-04T23:36:48Z","Content":"\n\u003Cp\u003EYou can make rover s worthwhile if you land right on the edge of a biome and cross over, tho it\u0027s a lot easier to make a short hop in your lander. One thing that might be good for rover is if surface science experiments were immediately depleted in a 100m radius whenever you take a read, so at the moment, you can land do a goo experiment, transmit, do another for just a few less points, transmit. If it immediately went to zero for the second experiment in 100m of a previous experiment, then you\u0027d have to go off in a rover and collect a sample. \u003C/p\u003E\u003Cp\u003EAnother idea that could make rovers better than hopping in a lander, you could have it so your landing engines contaminate the soil immediately where you land, so taking a sample right at the bottom of the ladder is worth a bit less then if you go a decent distance away. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UberFuber\u0022 data-cite=\u0022UberFuber\u0022\u003E\u003Cdiv\u003ESo that, I suggest the following idea for rover exploration (in addition for new uses for satellite).\u003Cp\u003EIn addition to the current science system, there\u0027re also location specific science that can be discovered in your exploration.\u003C/p\u003E\u003Cp\u003EFirst, you need to map the planet using a variety of instruments (where satellites come in).\u003C/p\u003E\u003Cp\u003EThen, the Kerbals will \u0022analyze\u0022 the map and generate several points of interest, near which (within, say 1 km of the point of interest) will be a few objects of interests where you must be within X meters to analyze/experiment. Which means that unless you\u0027re really, REALLY good an landing on a dime, you\u0027ll need to send a rover for finer controls.\u003C/p\u003E\u003Cp\u003ENext, you send a rover to the point of interest, where you have to drive around in the vicinity to experiment/visit the object of interests.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really like this idea, the best mission I did with remote rovers in sandbox was I sent out ISA mapsat satelites to map the mun, and located all the anomalies on the map, I was using the old version with just the small map, so the coordinates were not so accurate, so I had to land in the right area, than search about in the rover until I found the anomaly, sometimes I\u0027d spot an arch as I was coming down, and I\u0027d try and land close but mostly there was a lot of driving about looking for the anomalies. Eventually I had to quit that game cos ISA mapsat was too crashy on my system. If there was a stock mapping system for finding special location and getting science then that would be really cool.\u003C/p\u003E\n"},{"CreatedByName":"Deejay2000","CreatedById":73422,"CreatedDateTime":"2013-11-05T23:20:31Z","Content":"\n\u003Cp\u003EWonderful, it appears they will be putting this in-game (the lab part, at least).\u003C/p\u003E\n"}]}