{"TopicId":51880,"ForumId":55,"TopicTitle":"Inside The Space Station","CreatedByName":"Preacher","CreatedById":70298,"CreatedDateTime":"2013-11-04T20:17:52Z","PageNum":1,"Articles":[{"CreatedByName":"Preacher","CreatedById":70298,"CreatedDateTime":"2013-11-04T20:17:52Z","Content":"\n\u003Cp\u003EGood Morning,Evening Etc. Fellow kerbal Space Explorers\u003C/p\u003E\u003Cp\u003EToday i was enjoying my accomplishment of finally making a working space station when i came to realize that when i finished and it was there, i had nothing else to do, it just felt boring looking at it and i felt that if they \u003C/p\u003E\u003Cp\u003Eadded a interactive inside like floating around going to different sections of you station or just looking around on the inside instead of out it would be a bit more satisfying. this idea has been boggling with my head and i am a bit curious \u003C/p\u003E\u003Cp\u003Eif it has boggled yours. please give me some feedback if this is a good idea and if KSP should implement it cause i think it would add a bit more interactivity in KSP. Altough KSP is very busy with its Heavy Development i would like to \u003C/p\u003E\u003Cp\u003Esay that it is doing an amazing job and its going to be an amazing game if it keeps going on the path that its on. thank you for reading my lil idea and i hope you have a fun day \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-11-04T20:33:25Z","Content":"\n\u003Cp\u003EWhile I agree, this is on the what not to suggest list as \u0022More IVA views\u0022 since it has been suggested innumerable times.\u003C/p\u003E\u003Cp\u003EThis is also on the planned features list on the wiki as Enhanced IVAs.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-11-04T21:24:32Z","Content":"\n\u003Cp\u003EAs mentioned, this is indeed on the [thread=36863]What Not to Suggest list[/thread]. \u003C/p\u003E\u003Cp\u003EThread locked \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}