{"TopicId":52217,"ForumId":55,"TopicTitle":"swap EVA in orbit with new report","CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-07T08:55:42Z","PageNum":1,"Articles":[{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-11-07T08:55:42Z","Content":"\n\u003Cp\u003EThe way it is now it makes sense for EVAs on the surface:\u003C/p\u003E\u003Cp\u003EA crew report from Mun\u0027s surface describes \u0022we have landed, ship in good condition\u0022, while the EVA really deals with the situation in a given location, the outside world (biome).\u003C/p\u003E\u003Cp\u003EBut regarding EVAs in orbit around a planet - which are specified by the biome the kerbonaut is over - there really is not much difference if he leaves his craft above the desert or the ocean, he is outside of his craft in orbit. Of course he can describe what the terrain looks like, but this can be done far better from the inside of the craft, using telescopes and cameras.\u003C/p\u003E\u003Cp\u003ESuggestion:\u003C/p\u003E\u003Cp\u003EEVAs yield different results in different biomes on the surface, like they do now and results of EVAs in space (and air) are limited to the general area/height (like crew reports are now).\u003C/p\u003E\u003Cp\u003EKeep crew reports as they are now.\u003C/p\u003E\u003Cp\u003EIntroduce a new orbital survey part - available very early - yielding results only while in space near a planet or moon. Basically transfering the different results from EVA experiments in lower orbit to a new survey experiment.\u003C/p\u003E\u003Cp\u003EBenefits:\u003C/p\u003E\u003Cp\u003EMakes EVAs in orbit more logical while retaining the possible experiments.\u003C/p\u003E\u003Cp\u003EProbes might be enabled to use the new part, giving the unmanned-first-faction a bit more to play with.\u003C/p\u003E\u003Cp\u003EAddendum:\u003C/p\u003E\u003Cp\u003EGive the survey part and the four science gizmos like thermometer, gravioli etc. more but still limited storage space (3-5 results?) for repeated experiments. Nothings stops players from just taping more than one of them to the ship, so by this it might also increase performance by offering a way to lower the part count.\u003C/p\u003E\n"}]}