{"TopicId":53207,"ForumId":55,"TopicTitle":"What\u0027s the Point of this sub forum?","CreatedByName":"TADBTD","CreatedById":73888,"CreatedDateTime":"2013-11-15T15:50:46Z","PageNum":1,"Articles":[{"CreatedByName":"TADBTD","CreatedById":73888,"CreatedDateTime":"2013-11-15T15:50:46Z","Content":"\n\u003Cp\u003EOne question. Have one of you ever seen the developers actually take something from here? Last time was probably in like......16? Every good idea that every player wants is in the do not suggest list. It\u0027s to restricted. 0.22 was a good step but at the wrong time. If you want to get new players in SQUAD, do it when the game is at least .31.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-15T16:00:57Z","Content":"\n\u003Cp\u003EHow the hell was .22 at the wrong time? That makes no sense\u003C/p\u003E\u003Cp\u003EAnd just because they are not implenting all your suggestions right away doesn\u0027t mean they aren\u0027t using them. Remember that this is still in development, so the devs still have theyr own plans for the game. Suggestions might add to that if they love them, or they might put them on the list for things to get once the core game is done\u003C/p\u003E\n"},{"CreatedByName":"Faark","CreatedById":69775,"CreatedDateTime":"2013-11-15T16:05:08Z","Content":"\n\u003Cp\u003EDevelopers aren\u0027t usually joining Suggestion/Discussion forums, since that would take away a lot of time they develop stuff, instead. Also the AmA indicated that the Forum Moderators are responsible for processing and forwarding content of this sub forum. Last but not least... ksp does not have that much devs and they currently have an ongoing focus (career mode, lancher, performance, ...), what doesn\u0027t leave a lot of freedom for huge player suggestions. Also keep in mind that, for example the performance focus is kind of based on player feedback.\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-11-15T16:30:55Z","Content":"\n\u003Cp\u003EI don\u0027t entirely get the point of this particular thread.\u003C/p\u003E\u003Cp\u003EThe Devs have their own roadmap and goals. They are going to focus on those goals and are under no obligation to drop what they\u0027re doing to implement user suggestions (often conflicting, awful suggestions...)\u003C/p\u003E\u003Cp\u003EHonestly I\u0027d prefer if they focused on polishing the game before adding anything new. This subforum is where users can hash things out, not a place to make demands.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"DaveofDefeat","CreatedById":58539,"CreatedDateTime":"2013-11-15T16:37:08Z","Content":"\n\u003Cp\u003EThe suggestion box for nearly every business is purely PR and is used to make you feel like you have a voice, and also if they didn\u0027t have a suggestion section than people would spam other threads with suggestions. If they actually hired a guy to stare at the suggestion thread, write down all the good ideas and then present them to squad, I would be very surprised.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-11-15T17:30:29Z","Content":"\n\u003Cp\u003E@Smidge: sounds like just a kid whining about his pet \u0022suggestion\u0022 (re. demand) not having been instantly picked up and implemented, but rather that nasty career mode that he didn\u0027t ask for (and therefore nobody was interested in by definition).\u003C/p\u003E\u003Cp\u003E@Dave: most company\u0027s suggestion boxes are monitored and ideas picked and integrated if they make sense. Sadly most \u0022ideas\u0022 dropped in them make no sense, are just rants and complaints about non-issues (like \u0022KSP suz balls, it no runz on mi 286\u0022).\u003C/p\u003E\n"},{"CreatedByName":"NeilC","CreatedById":57575,"CreatedDateTime":"2013-11-15T18:01:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TADBTD\u0022 data-cite=\u0022TADBTD\u0022\u003E\u003Cdiv\u003EEvery good idea that every player wants is in the do not suggest list.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point. How do you think those good ideas got there?\u003C/p\u003E\u003Cp\u003EAt one point or another they were suggested in this forum and got a lot of support. If another good, well supported idea is brought up here, it will also be put on the list.\u003C/p\u003E\u003Cp\u003EI\u0027m sure Devs don\u0027t read every thread, and they sure don\u0027t participate in a lot of the pointless griping and sniping that happens in here. But when a good, detailed and thorough thread comes up and gets linked in the WNTS list, I\u0027d be surprised if they didn\u0027t read it. Or at least the non-gripe posts in it - after all, that would really cut down on their reading time.\u003C/p\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2013-11-15T18:21:48Z","Content":"\n\u003Cp\u003EOP: The Do not Suggest list consists of two types of things:\u003C/p\u003E\u003Cp\u003E1) Stuff that was deemed good and will eventually be implemented....or\u003C/p\u003E\u003Cp\u003E2) Stuff that was deemed not in line with their goals and discarded.\u003C/p\u003E\u003Cp\u003EIn either case, they\u0027ve been posted/discussed to the point that there is no reason to allow them to be posted about further.\u003C/p\u003E\n"},{"CreatedByName":"Rowsdower","CreatedById":91811,"CreatedDateTime":"2013-11-15T18:31:14Z","Content":"\n\u003Cp\u003EIn my experience, suggestions have not been solely used for PR purposes and I can tell you that\u0027s definitely the case at Squad. The team is small enough to take note of the major \u003Cem\u003EKSP\u003C/em\u003E community concerns. Bear in mind that the devs are also usually working off of a specific schedule with certain features in mind, so the things you\u0027ve been waiting ever so patiently for my not be implemented just yet due to time or technical limitations. \u003C/p\u003E\u003Cp\u003ERegardless of how often a dev may pop in, part of my job is to make sure that the team knows what the community longs for and advocate your wishes as much as possible. Whether or not it ends up in the final product is one thing - that much I can\u0027t guarantee - but as long as I\u0027m around and as long as other members of the team are able to browse the forum, you do have a voice.\u003C/p\u003E\n"},{"CreatedByName":"dazhat","CreatedById":59413,"CreatedDateTime":"2013-11-15T19:15:16Z","Content":"\n\u003Cp\u003EI don\u0027t care if my ideas are implemented or not. I just love to share my dreams.................\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-15T23:29:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dazhat\u0022 data-cite=\u0022dazhat\u0022\u003E\u003Cdiv\u003EI don\u0027t care if my ideas are implemented or not. I just love to share my dreams.................\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAmen. For me personally, it\u0027s more that I love picking apart ideas. If you do it constructivly, they can only grow. Kinda like snipping away branches of a rose, which allows the rose to grow bigger\u003C/p\u003E\n"},{"CreatedByName":"Dun Kirk","CreatedById":11365,"CreatedDateTime":"2013-11-16T20:42:41Z","Content":"\n\u003Cp\u003EI think feed back is useful. As others say the devs can\u0027t get into arguments over stuff, every-time someone says \u0022I want Gas Giant 2 now!!!\u0022. \u003C/p\u003E\u003Cp\u003EI have to say given what they say \u0022will\u0022 come in .23 I\u0027m surprised there is not more chatter.\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2013-11-17T01:20:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveofDefeat\u0022 data-cite=\u0022DaveofDefeat\u0022\u003E\u003Cdiv\u003EThe suggestion box for nearly every business is purely PR and is used to make you feel like you have a voice, and also if they didn\u0027t have a suggestion section than people would spam other threads with suggestions. If they actually hired a guy to stare at the suggestion thread, write down all the good ideas and then present them to squad, I would be very surprised.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIronically it\u0027s the place for ppl to get mad at the devs =P\u003C/p\u003E\n"}]}