{"TopicId":53936,"ForumId":55,"TopicTitle":"IronMan mode/difficulty","CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-21T22:10:00Z","PageNum":1,"Articles":[{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-21T22:10:00Z","Content":"\n\u003Cp\u003EI first encountered this in XCOM: Enemy Unknown, and I loved the mode. It\u0027s for the folk who like their games even more challenging and unforgiving.\u003C/p\u003E\u003Cp\u003EBasically it takes away your control of game saving, you can no longer save manually, you have only one save file which is saved automatically at intervals, ESPECIALLY when something bad happens. This way you can\u0027t undo your mistakes, you have to live with them (Like in real life, duh). So no saving before a difficult orbital maneuver or a landing, no reverting a failed launch because you forgot to release the clamps on time, no nothing. You screw up, you pay the price.\u003C/p\u003E\u003Cp\u003ENow if implemented in career mode, this limitation wouldn\u0027t mean much if you could actually not have a game-over, and to have that a game also must have victory conditions, which career mode doesn\u0027t have yet, but it could some day, such as full technological advancement, exploring every celestial body, or completing a number of preset missions each more difficult than the previous. Game over conditions could be to loose too many Kerbals (stranding them for prolonged periods also counts), not completing missions on time, or simply not getting anywhere with your program (earning less than 10 science points over the span of 5 years for instance).\u003C/p\u003E\u003Cp\u003EAll of this could be optional, you could select your own loosing and winning conditions, or have none at all (at which point you might as well play sandbox, but hey, whatever rocks your boat)\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-11-21T22:22:23Z","Content":"\n\u003Cp\u003EI don\u0027t know if this is really needed since a lot of this you can manage yourself. For the moment you can turn on permadeath and turn off revert in your career mode save file, and then unbind your quicksave hotkey. We\u0027ll probably see checkboxes for those items at some point because they\u0027re actually options in the files. Having stock life support and reentry damage effects will help increase the difficulty somewhat (although LS is just another resource to manage, it\u0027s not actually difficult).\u003C/p\u003E\u003Cp\u003EAs far as \u0022victory\u0022 conditions in career mode I suspect that will never actually be a thing because KSP is a sandbox sort of game. Losing conditions, on the other hand, would be pretty cool. You get fired from your position as head of the Kerbal Space Program because too many Kerbals died, you don\u0027t have enough money to do a launch, that sort of thing.\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-21T22:30:16Z","Content":"\n\u003Cp\u003EThe file editing is true, and so is unbinding the quick-save button for \u0022selfcontrol\u0022, but you still have revert to launch button upon smashing the craft, and without the manual quicksave, the autosave doesn\u0027t save often enough for Ironman mode to work. Making it save after an important event (Entering an atmosphere, leaving it, something explodes, etc) would make it just fine.\u003C/p\u003E\u003Cp\u003EWell, you can\u0027t actually appreciate a game being able to have game-over without it having a final goal at the same time, but I guess it could work without one as well. Prevents you from fully clowning around in career mode.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-11-21T22:38:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unfawkable\u0022 data-cite=\u0022Unfawkable\u0022\u003E\u003Cdiv\u003Ebut you still have revert to launch button upon smashing the craft\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIncorrect, you can disable that in the save file.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unfawkable\u0022 data-cite=\u0022Unfawkable\u0022\u003E\u003Cdiv\u003EWell, you can\u0027t actually appreciate a game being able to have game-over without it having a final goal at the same time, but I guess it could work without one as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlenty of people can appreciate a game without a winning condition, especially if it has failure conditions. Why do you think people play stuff like Dwarf Fortress or Minecraft on hardcore mode. As for a \u0022final\u0022 goal, make your own; that\u0027s the whole point of a sandbox game. Having a failure condition is much more interesting, especially when you get down to the line and keep managing to send up ship after ship, where every launch could be your last. Now \u003Cem\u003Ethat\u0027s\u003C/em\u003E exciting gameplay.\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-21T22:42:38Z","Content":"\n\u003Cp\u003EYou\u0027ve made valid points sir, I yield \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EStill, I\u0027d like to have options whether to have winning conditions, so you can literally make your own, but I guess the difference is minor.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-21T22:47:12Z","Content":"\n\u003Cp\u003EIf it can be toggled by editing the save file, then it should be possible for the developers to make it an option in the Preferences, which I think is what Unfawkable might be asking for. It would, at the very least, mean fewer hoops for the player to jump through.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-21T22:57:00Z","Content":"\n\u003Cp\u003EThe problem, in general, with perma-death in any computer game is that before it\u0027s fair to implement it, you must be in a situation where you can be 100% certain that any and all bad effects that occur are bad effects that are meant to occur. Because bugs exist, you can almost never be in this situation. If your space station blows up because you piloted poorly and ran into it, fair game. But if your space station blows up because of the Space Kraken bug and then you are not allowed to undo this because its perma-death, Then the game is, effectively, cheating against you.\u003C/p\u003E\u003Cp\u003EAnd anyone who thinks it\u0027s possible for the situation to exist in which the last bug has been found and removed is someone who clearly doesn\u0027t know a thing about software. Every programmer who has ever said \u0022I know with certainty that my software has no bugs\u0022 is a liar. The truthful honest version of that statement is \u0022I am unable to find whatever bugs might still remain in my software.\u0022\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-11-21T22:58:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EIf it can be toggled by editing the save file, then it should be possible for the developers to make it an option in the Preferences, which I think is what Unfawkable might be asking for. It would, at the very least, mean fewer hoops for the player to jump through.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I mentioned that in my first post. I think Unfawkable\u0027s idea is pretty cool, but I also think that the devs are already thinking along the lines of having a customizable difficulty at some point; disabling quicksave/load will probably be one of the things to add. I don\u0027t know about the autosaving frequency thing, that might also be a setting in a config file somewhere, but he asks for it at certain key events. I don\u0027t know if that would mess up a landing due to lag or something... I haven\u0027t noticed lag on autosave.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-21T23:20:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unfawkable\u0022 data-cite=\u0022Unfawkable\u0022\u003E\u003Cdiv\u003EWell, you can\u0027t actually appreciate a game being able to have game-over without it having a final goal at the same time, but I guess it could work without one as well. Prevents you from fully clowning around in career mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMMO\u0027s don\u0027t have victory, but you sure as hell can fail at them\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-22T00:26:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EThe problem, in general, with perma-death in any computer game is that before it\u0027s fair to implement it, you must be in a situation where you can be 100% certain that any and all bad effects that occur are bad effects that are meant to occur. Because bugs exist, you can almost never be in this situation. If your space station blows up because you piloted poorly and ran into it, fair game. But if your space station blows up because of the Space Kraken bug and then you are not allowed to undo this because its perma-death, Then the game is, effectively, cheating against you.\u003Cp\u003EAnd anyone who thinks it\u0027s possible for the situation to exist in which the last bug has been found and removed is someone who clearly doesn\u0027t know a thing about software. Every programmer who has ever said \u0022I know with certainty that my software has no bugs\u0022 is a liar. The truthful honest version of that statement is \u0022I am unable to find whatever bugs might still remain in my software.\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, I know it might be too early for an implementation of such a thing before gamebreaking bugs are squished. A few cheating bugs happened to me in XCOM as well that made me rage. I just haven\u0027t encountered the feature anywhere else, and wanted to suggest it in case the devs didn\u0027t plan it, but naturally it should be implemented when 1.00 arrives.\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-22T00:27:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EYes, I mentioned that in my first post. I think Unfawkable\u0027s idea is pretty cool, but I also think that the devs are already thinking along the lines of having a customizable difficulty at some point; disabling quicksave/load will probably be one of the things to add. I don\u0027t know about the autosaving frequency thing, that might also be a setting in a config file somewhere, but he asks for it at certain key events. I don\u0027t know if that would mess up a landing due to lag or something... I haven\u0027t noticed lag on autosave.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, me neither, but I have a mid-high end computer, lower comps might have difficulty with this unfortunately.\u003C/p\u003E\n"},{"CreatedByName":"Ghost13","CreatedById":78837,"CreatedDateTime":"2013-11-22T02:04:38Z","Content":"\n\u003Cp\u003EThere is a too many bugs in the game to have permadeath mode right now, (kraken, docking port failure, spinning bug, hell bug and many other) also if we have permadeath than we need flight assesment system of some sort that will warn you if you a heading to catastrofical failure in your craft design. Like lack of solar panels, engine without any fuel, or stage connected without decouples e.t.c\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-22T02:57:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ghost13\u0022 data-cite=\u0022Ghost13\u0022\u003E\u003Cdiv\u003EThere is a too many bugs in the game to have permadeath mode right now, (kraken, docking port failure, spinning bug, hell bug and many other) also if we have permadeath than we need flight assesment system of some sort that will warn you if you a heading to catastrofical failure in your craft design. Like lack of solar panels, engine without any fuel, or stage connected without decouples e.t.c\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell the entire point of perma death would be to NOT have any warnings, to know that your play can have consequences, and to thus play and design more carefully.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-24T06:19:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Unfawkable\u0022 data-cite=\u0022Unfawkable\u0022\u003E\u003Cdiv\u003EWell the entire point of perma death would be to NOT have any warnings, to know that your play can have consequences, and to thus play and design more carefully.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo how does the player design cause KSP bugs again?\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-24T18:17:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003ESo how does the player design cause KSP bugs again?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, as stated, it\u0027s not for the early phases. But presumably 1.00 will have as rare and few bugs as possible so it overally won\u0027t have a great effect on this.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2013-11-24T19:14:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EPlenty of people can appreciate a game without a winning condition, especially if it has failure conditions. Why do you think people play stuff like Dwarf Fortress or Minecraft on hardcore mode. As for a \u0022final\u0022 goal, make your own; that\u0027s the whole point of a sandbox game. Having a failure condition is much more interesting, especially when you get down to the line and keep managing to send up ship after ship, where every launch could be your last. Now \u003Cem\u003Ethat\u0027s\u003C/em\u003E exciting gameplay.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is funny that the games I like can not be won. You can only lose. Yet they keep me entertained for weeks on end, as doing things that are hard are more fun than achieving some predefined arbitrary thing.\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-11-24T19:42:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camacha\u0022 data-cite=\u0022Camacha\u0022\u003E\u003Cdiv\u003EIt is funny that the games I like can not be won. You can only lose. Yet they keep me entertained for weeks on end, as doing things that are hard are more fun than achieving some predefined arbitrary thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEither that, or you are a masochist \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}