{"TopicId":54301,"ForumId":55,"TopicTitle":"More to do! Scanners - long range low res conical, short range high res omni","CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-11-25T12:18:36Z","PageNum":1,"Articles":[{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-11-25T12:18:36Z","Content":"\n\u003Cp\u003ERight now, after players figure out the basics of getting to orbit, the game consists of just a handful of activities:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Erendezvous with moons or vessels in orbit\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Erendezvous with other planets (including gravity assists)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eatmospheric landings\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Enon-atmospheric landings\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis is obviously fun in itself, I\u0027ve spent countless hours playing this game. But I\u0027ve been trying to think of other activities that players could be challenged with. At the moment science is really just the four activities listed above in combination with some button pressing to \u0022do science\u0022, so I don\u0027t think that really counts as a new activity. I\u0027m talking about things that actually engage the player with some new challenge.\u003C/p\u003E\u003Cp\u003ESo along those lines, I was thinking about \u0022anomalies\u0022 (currently only easter eggs, but I can imagine more coming by way of career mode exploration) and how we might make it a bit more fun for players to explore and find such things.\u003C/p\u003E\u003Cp\u003EI hit upon the idea of using scanners. Now, there are already mods that have some basic scanning, but they\u0027re mostly passive: get into orbit and wait. A way to give the players more of an active role and give them something new to do might be to have two kinds of scanners:\u003C/p\u003E\u003Cp\u003E1) Orbital scanners, which have a range of, say, 150km, looking straight down at the surface. These would be \u0022low resolution\u0022 scanners, giving you an indication of just the general area in which an anomaly can be found within (just for example) a 20x20 km area, perhaps reducing conically as you move to lower orbits to narrow the target area down.\u003C/p\u003E\u003Cp\u003E2) Short range (rover or suborbital hopper / flyer) omnidirectional scanners. Say, 5 km range, with a \u0022blip\u0022 in the direction of the anomaly.\u003C/p\u003E\u003Cp\u003ESomething like this would accomplish a few things:\u003C/p\u003E\u003Cp\u003E1) It would make rovers or manoeuvre-capable lander/explorers more useful in that they would now have a real role to play in the game.\u003C/p\u003E\u003Cp\u003E2) It provides players with a reward for being able to land a rover or other surface exploration vehicle.\u003C/p\u003E\u003Cp\u003E3) It gives the player a means to find anomalies in which they take an active role rather than a passive role (or relying on pure chance).\u003C/p\u003E\u003Cp\u003E4) It seems to fit nicely within the core gameplay idea of \u0022exploration\u0022, but gives a little more of a specific direction (pun intended) to that mechanic.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-25T12:22:16Z\u0022 title=\u002211/25/2013 12:22  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 25, 2013\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"}]}