{"TopicId":54882,"ForumId":55,"TopicTitle":"of the usefulness of time-dependent gameplay","CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2013-12-01T10:56:29Z","PageNum":1,"Articles":[{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2013-12-01T10:56:29Z","Content":"\n\u003Cp\u003EOf the usefulness of time-dependent gameplay.\u003C/p\u003E\u003Cp\u003EWe\u0027ve heard it suggested regularly now...\u003C/p\u003E\u003Cp\u003E- Experiments taking time to complete\u003C/p\u003E\u003Cp\u003E- Experiments output depending of time\u003C/p\u003E\u003Cp\u003E- Rocket fabrication taking time\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EEDIT : I\u0027m not defending \u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003Ethose specific suggestion\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E, I\u0027m proposing to discuss the use of Time-based gameplay mechanism in a general way.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnd I want to discuss it because ...\u003C/strong\u003EEvery single time I\u0027ve heard the same \u0022meaningless because of timewarp\u0022 arguments.\u003C/p\u003E\u003Cp\u003EI used to agree with it but not anymore, quite the opposite now, thinking it make any time-based gameplay meaningless is IMO forgetting how it shaped KSP at its most basic level.\u003C/p\u003E\u003Cp\u003ETime is the reason experimented players wanting to do a rendez-vous chose carefully their orbits.\u003C/p\u003E\u003Cp\u003ETime is a critical parameter in the size of your rocket, enough to change between a efficient low-thrust nuclear engine or a cheap high-thrust chemical engine.\u003C/p\u003E\u003Cp\u003ETime is a critical factor when you try to \u0022do science\u0022 while descending through layers of atmosphere or passing close by a planet/moon.\u003C/p\u003E\u003Cp\u003EAt the very origin of KSP the Devs could have used realistic planets scale, but just going into orbit would take an hour.\u003C/p\u003E\u003Cp\u003EI can hear some saying \u0022No *****, thing happens after one another, big revolution there !\u0022\u003C/p\u003E\u003Cp\u003EBut the earlier example can take a whole new meaning if we rethink about how we prioritize our space program to not waste a single second of our own time, even spent in timewarp. Anyway, I think we all agree that KSP just lack the tools (like the Kerbal Alarm Clock mods) to ease the planning.\u003C/p\u003E\u003Cp\u003ETime-based gameplay may also be the most efficient solution to shape the gameplay in specific way. (myself I consider it one of the key for justifying satellites)\u003C/p\u003E\u003Cp\u003Eexample : \u003C/p\u003E\u003Cp\u003EIf a experiment require 10 days of constant energy consumption to complete.\u003C/p\u003E\u003Cp\u003E- It reestablish the importance of large battery for night-period, and larger solar panels.\u003C/p\u003E\u003Cp\u003E- Influence how you choose your landing zone.\u003C/p\u003E\u003Cp\u003E- It require some energy management, something quite underdeveloped as of now.\u003C/p\u003E\u003Cp\u003ELastly, career mods doesn\u0027t have a budget-management system yet, a system for which time-planning could also become very important.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EYour thoughts ?\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T11:37:58Z\u0022 title=\u002212/16/2013 11:37  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by Kegereneku\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2013-12-01T14:16:14Z","Content":"\n\u003Cp\u003Ei think the game is already a massive time sink. i dont think any additional waiting is neccisary.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2013-12-01T14:38:32Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59042-Painting-the-map!\u0022 rel=\u0022external nofollow\u0022\u003EI completely agree\u003C/a\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-12-01T14:43:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EEvery single time I\u0027ve heard the same \u0022meaningless because of timewarp\u0022 arguments.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Estill in your long post you dint solve that problem.. \u0022timewarp\u0022.\u003C/p\u003E\u003Cp\u003EWhat happens with new players who doesnÃ‚Â´t learn yet how to plan a mission with low fuel consumption?\u003C/p\u003E\u003Cp\u003EEven right now I find tedious plan a mission to avoid spent a lot of fuel. Some times I just want launch and concern about the problems later.\u003C/p\u003E\u003Cp\u003Eif in the future squad adds life support, then the duration of your missions would be an important factor.\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2013-12-01T15:47:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Ei think the game is already a massive time sink. i dont think any additional waiting is neccisary.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECompared to other game it\u0027s not much of a time sink, but on the other hand I\u0027m used to let Mechjeb launch ship automatically while I get a drink.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003Estill in your long post you dint solve that problem.. \u0022timewarp\u0022.\u003Cp\u003EWhat happens with new players who doesnÃ‚Â´t learn yet how to plan a mission with low fuel consumption?\u003C/p\u003E\u003Cp\u003EEven right now I find tedious plan a mission to avoid spent a lot of fuel. Some times I just want launch and concern about the problems later.\u003C/p\u003E\u003Cp\u003Eif in the future squad adds life support, then the duration of your missions would be an important factor.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think you understood my \u0022long post\u0022, I didn\u0027t had to \u0022solve\u0022 anything because Timewarp \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Edon\u0027t nullify\u003C/span\u003E (all) time-based gameplay mechanism, it\u0027s even what could make some of them fun. Also this is a discussion not a suggestion.\u003C/p\u003E\u003Cp\u003ELet\u0027s retake the examples above : \u003C/p\u003E\u003Cp\u003E* A probes descending through an atmosphere and requiring you to spend at least 10 seconds in a \u0022atmospheric zone\u0022 to get science done will require you to design it in consequence. Antenna are already playing on that by varying the speed of transmission, but everything is not set is stone.\u003C/p\u003E\u003Cp\u003EAnother one, way longer :\u003C/p\u003E\u003Cp\u003E* A scanning probes needing to use 10 energy per second during (say) \u002210 days\u0022 to accomplish the job. Something that can\u0027t be done just on battery and ask for more solar panel. The result is \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ethat regardless if you timewarped it or not\u003C/span\u003E, you had to (1) put the satellite in orbit, not just a suborbital/escape trajectory (2) design it with those parameters in mind.\u003C/p\u003E\u003Cp\u003EYou are \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eexpected\u003C/span\u003E to use timewarp, because wasting your time wasn\u0027t the objective, it was to make sure you designed a satellite.\u003C/p\u003E\u003Cp\u003EThe only \u0022problem\u0022 that come with it is that you \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Emay\u003C/span\u003E need to give clue to the player so he can learn it without trying and failing over again, but that\u0027s something developer learned how to do since the dawn of video game\u0027s history.\u003C/p\u003E\u003Cp\u003EAs for the \u0022tediousness\u0022 of a economic mission \u003Cspan style=\u0022color:#FF0000;\u0022\u003E(economic as in fuel-efficient)\u003C/span\u003E, I think you exaggerate, it take as much time to plot an Hohmann transfer with mid-course plane-change, than a barely-brachistochrone direct transfer. Only things lacking are the ingame-tools to show the best launch windows and plan maneuver without direct control, but the game is still in development.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T19:47:51Z\u0022 title=\u002212/01/2013 07:47  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Kegereneku\u003C/strong\u003E\n\u003Cbr\u003Eprecision\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-01T16:32:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kegereneku\u0022 data-cite=\u0022Kegereneku\u0022\u003E\u003Cdiv\u003ECompared to other game it\u0027s not much of a time sink, but on the other hand I\u0027m used to let Mechjeb launch ship automatically while I get a drink.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen having discussions about stock features in the game it is best to remain in a stock frame of mind. It is highly unlikely that we\u0027ll see MechJeb in the stock game; the devs have already made it pretty clear they\u0027re not into autopilots.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kegereneku\u0022 data-cite=\u0022Kegereneku\u0022\u003E\u003Cdiv\u003EAs for the \u0022tediousness\u0022 of a economic mission, I think you exaggerate, it take as much time to plot an Hohmann transfer with mid-course plane-change, than a barely-brachistochrone direct transfer. Only things lacking are the ingame-tools to show the best launch windows and plan maneuver without direct control, but the game is still in development.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt least plotting and executing a maneuver is active gameplay; waiting around for something to happen is about the worst gameplay mechanic I can think of. Also, I\u0027d much rather use an external porkchop plot and choose the launch window that meets my parameters rather than have the game tell me when the best launch windows are available. In fact, I think it would be best if the game didn\u0027t tell me what to do.\u003C/p\u003E\u003Cp\u003EI think Nuke said it best above: We don\u0027t need to do any more waiting in this game and if I can timewarp through an objective then it just ends up being a tedious chore. If I can\u0027t timewarp and I actually do have to wait, then it\u0027s just crappy gameplay.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2013-12-01T18:09:50Z","Content":"\n\u003Cp\u003EAgain, at least part of the solution to the \u0022meaningless because of time-warp\u0022 is the addition of a resource that is exhausted, even when a craft is in a stable orbit. Some form of a \u0022support\u0022 resource would be ideal for this, either an explicit resource (e.g. oxygen or food) or an abstraction (e.g. life support). This provides a limit on how long a craft can stay aloft, and provides a more concrete difference between probes (don\u0027t require life support, but require more electricity) and manned missions (require life support).\u003C/p\u003E\n"},{"CreatedByName":"AngelLestat","CreatedById":58968,"CreatedDateTime":"2013-12-01T18:16:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kegereneku\u0022 data-cite=\u0022Kegereneku\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI don\u0027t think you understood my \u0022long post\u0022, I didn\u0027t had to \u0022solve\u0022 anything because Timewarp \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Edon\u0027t nullify\u003C/span\u003E (all) time-based gameplay mechanism, it\u0027s even what could make some of them fun. Also this is a discussion not a suggestion.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOk, i will try to be more specific this time. Lets discuss.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E- Experiments taking time to complete\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIf we talk about 10 seconds I dont see the problem, but what different it makes if is 10 seconds or just instant?\u003C/p\u003E\u003Cp\u003EIf is 1 day or 1 year in one place or orbit, then you will press start experiment follow of timewarp key and stop the timewarp in the right moment. This will become in a common mechanic for everything that you do.. Press start, timewarp, stop.\u003C/p\u003E\u003Cp\u003EIf you have the same commands over and over to do one task then you can simplify that task avoiding the common procedure in each action. I know that wait a specific time brings some realism to the gameplay, but when you have to do it in a mechanical way over and over it becomes tedious, so that is a sign that can be avoided.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003ERocket fabrication taking time\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Esame here.\u003C/p\u003E\u003Cp\u003EEconomics? \u003C/p\u003E\u003Cp\u003EAny economic mechanics that uses time it will break any balance with timewarp.\u003C/p\u003E\u003Cp\u003EMissions:\u003C/p\u003E\u003Cp\u003EIf you need to wait time to complete some procedures then you will realize that the best way to deal with that is parallel procedures and missions.\u003C/p\u003E\u003Cp\u003ESo your brain needs to focus in different missions-procedures at the same time. Of course this adds realism but also becomes very annoying. I personally like focus at one mission at the time. We are not NASA, a group of hundreds of people which each one focus in their own tasks.\u003C/p\u003E\u003Cp\u003EIf these it would be a multiplayer coperative game without timewarp mechanic, then all of this would make more sense.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T18:21:26Z\u0022 title=\u002212/01/2013 06:21  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by AngelLestat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-12-01T18:17:00Z","Content":"\n\u003Cp\u003EThis discussion somewhat reminds of me of the construction system in the game Warframe. In order to build a new set of armor you have to wait 3 real days for it to be finished. This isn\u0027t nearly as much as a problem since you can do missions normally and still gather resources and things.\u003C/p\u003E\u003Cp\u003EThis is the key difference in ksp and other games that can pull off a waiting mechanic. If you\u0027re going to have a time based mechanic you have to give the player something to do during the meantime, or else they are just waiting for waiting\u0027s sake. In ksp the times required to do most of the things people want (rocket construction, timed experiments etc.) would realistically be measured in days. And all of these things would be required to play the game.\u003C/p\u003E\u003Cp\u003ETo build and fly your rocket (the core of the game) you would have to wait. \u003C/p\u003E\u003Cp\u003ETo perform an experiment (to get better rockets) you would have to wait.\u003C/p\u003E\u003Cp\u003EIn that other game I don\u0027t need that other set of armor. My current armor works fine and can get me through most situations, but I \u003Cem\u003Ewant\u003C/em\u003E that other suit of armor. The armor is not necessary for me to advance, but since I want it I am willing to wait for it.\u003C/p\u003E\u003Cp\u003ETLDR: If you\u0027re going to have a waiting mechanic it has to be for something non-essential but useful and you have to give the player something useful and fun to do in the meantime.\u003C/p\u003E\n"},{"CreatedByName":"a.g.","CreatedById":59470,"CreatedDateTime":"2013-12-01T18:25:54Z","Content":"\n\u003Cp\u003EAs I mentioned in an adjacent thread, there actually is one place in the current game where time warp already isn\u0027t an option: flying planes and driving rovers (4x warp isn\u0027t really significant). Currently this activity doesn\u0027t have any real in-game purpose to it, so generating a small amount of science over time when in motion may provide additional reward.\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2013-12-01T19:13:49Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EMy computer use to CRASH because of THIS SPECIFIC FORUM, and I lost all my tabs, it\u0027s a luck this forum have a \u0022restore\u0022 fonction but I\u0027m wondering now why the hell I would need one if the forum worked right.\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EWhen having discussions about stock features in the game it is best to remain in a stock frame of mind. It is highly unlikely that we\u0027ll see MechJeb in the stock game; the devs have already made it pretty clear they\u0027re not into autopilots.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd I agree with that, but KSP is nowhere as time hungry than game like Minecraft. Plus, overfocusing on the time aspect alone make you miss my points.\u003C/p\u003E\u003Cp\u003EReformulated again : \u003Cem\u003ETime-based Game Mechanic \u002B Timewarp = NEW way to have FUN (that you hadn\u0027t realized before).\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s the \u0022worst gameplay you can think of\u0022 because you misinterpreted what I said. Nobody suggested ([discussion] remember) that the game should \u003Cstrong\u003EFORCE YOU WITH A KNIFE UNDER YOUR THROAT\u003C/strong\u003E to know when there\u0027s a windows. I just pointed out that the game could as well have built-in tools to help planning maneuvers node, since player usually look for those tools \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Elater\u003C/span\u003E as they get more experimented.\u003C/p\u003E\u003Cp\u003EAside, \u0022\u0022 \u003Cem\u003Eit would be best if the game didn\u0027t tell me what to do.\u003C/em\u003E \u0022\u0022 is still exaggerated for what you really mean.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003EOk, i will try to be more specific this time. Lets discuss.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirstly, DO NOT OVER FOCUS over the 3 threads I quoted. This is \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Enot a suggestion\u003C/span\u003E and I\u0027m NOT discussing those SPECIFIC suggestion, I\u0027m talking about \u003Cstrong\u003ETIME as a gameplay mechanism\u003C/strong\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E- Experiments taking time to complete\u003C/span\u003E\u003Cp\u003EIf we talk about 10 seconds I dont see the problem, but what different it makes if is 10 seconds or just instant?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s enough for a probes descending in an atmosphere to miss an atmospheric layer. On the ground it\u0027s enough to switch to a Kerbal in EVA and \u0022do\u0022 an hypothetical action.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AngelLestat\u0022 data-cite=\u0022AngelLestat\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIf is 1 day or 1 year in one place or orbit, then you will press start experiment follow of timewarp key and stop the timewarp in the right moment. This will become in a common mechanic for everything that you do.. Press start, timewarp, stop.\u003C/p\u003E\u003Cp\u003EIf you have the same commands over and over to do one task then you can simplify that task avoiding the common procedure in each action. I know that wait a specific time brings some realism to the gameplay, but when you have to do it in a mechanical way over and over it becomes tedious, so that is a sign that can be avoided.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are not fully grasping the concept, yes it would become a \u0022common mechanic\u0022 but the application can be anything.\u003C/p\u003E\u003Cp\u003EThis is not a \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Epointless addition\u003C/span\u003E, this is a mechanism that require you to \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eactually orbit\u003C/span\u003E the body you are studying to do the experiment. \u003Cstrong\u003EGiving a purpose to satellites\u003C/strong\u003E, not just probes passing by.\u003C/p\u003E\u003Cp\u003EThe ground based equivalent incite you to either have an power-source independent from the sun, or land somewhere it will stay powered long enough to complete the experiment.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003ERocket fabrication taking time\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENothing to say about that, I\u0027m not the one suggesting this with a gameplay in mind, just taking note that things like \u0022not being able to launch in time for the launch windows\u0022 can greatly influence the gameplay.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EEdit : When I said \u0022Economic\u0022 earlier I meant fuel-efficient.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf you need to wait time to complete some procedures then you will realize that the best way to deal with that is parallel procedures and missions.\u003Cp\u003ESo your brain needs to focus in different missions-procedures at the same time. Of course this adds realism but also becomes very annoying. I personally like focus at one mission at the time. We are not NASA, a group of hundreds of people which each one focus in their own tasks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the only thing missing for this sort of multitasking is an User-Interface telling you when anything of importance happened, like [Experiment Complete on this flight] or [You planned a maneuver here] or [Flight X entered Y SoI].\u003C/p\u003E\u003Cp\u003EYou wouldn\u0027t be forced (or materially able) to \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eactively manage\u003C/span\u003E like 10 missions in a short time frame. And Considering most satellite are built for one mission only, you may just come to say \u0022good work, don\u0027t need you anymore.\u0022\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003EEdit for precisions : \u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E For the sake of discussion, I\u0027m supposing here that experiment can potentially continue without player-focus. But it\u0027s doesn\u0027t negate anything else.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003Eps: I\u0027ll modify the first message as it seem people are misunderstanding part of it\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T19:49:11Z\u0022 title=\u002212/01/2013 07:49  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Kegereneku\u003C/strong\u003E\n\u003C/span\u003E\n"}]}