{"TopicId":55117,"ForumId":55,"TopicTitle":"I know lagrange points are in the \u0027What not to suggest \u0027 but this is without N-body","CreatedByName":"halosos","CreatedById":17271,"CreatedDateTime":"2013-12-03T22:41:20Z","PageNum":1,"Articles":[{"CreatedByName":"halosos","CreatedById":17271,"CreatedDateTime":"2013-12-03T22:41:20Z","Content":"\n\u003Cp\u003EThe idea is that at the edge of each SOI is 2 smaller SOIs that when a craft is in, its treated as though its in orbit of the parent SOI.\u003C/p\u003E\u003Cp\u003ELSOI (Lagrange Sphere of Influence) will act as part of both the SOI of the moon and planet, making the speed to retain an orbit faster or slower.\u003C/p\u003E\u003Cp\u003EIf my understanding of the KSP engine is correct, then this would not be too hard to implement. you would simply have 2 SOIs with there centre of gravity way off, and that centre of gravity would be lower or higher depending on what LSOI its in. \u003C/p\u003E\u003Cp\u003EFor technical reasons it would jut be L1 and L2, but that would be enough for a whole range of new mission types. When in each LSOI you would have to make your velocity the same of that of the SOI your in, in order to remain there.\u003C/p\u003E\u003Cp\u003EThis post is probably going to get deleted because its about Lagrange points, but I would like to see the opinion of someone who properly knows how KSP works. Like I said, my understanding of it, it should work, but I may be wrong.\u003C/p\u003E\n"},{"CreatedByName":"fatfluffycat","CreatedById":73913,"CreatedDateTime":"2013-12-03T22:45:21Z","Content":"\n\u003Cp\u003Ewhy do people care about this so much? The devs said no\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-12-04T00:26:07Z","Content":"\n\u003Cp\u003EIt won\u0027t get deleted, just locked.\u003C/p\u003E\u003Cp\u003EL1, L2, and L3 aren\u0027t stable lagrange points, so you\u0027re talking something that few KSP players could really take advantage of.\u003C/p\u003E\u003Cp\u003EL4 and L5 are stable, but can be faked easily enough. For that matter, L3 can be faked as well, though unless you\u0027re talking the Sun-Kerbin L3, it would be far enough from the real position to be definitely noticeable.\u003C/p\u003E\u003Cp\u003EIn my opinion, most of the reasons people want lagrange points in game comes from the real-world benefits of lagrange points, which is to say that orbits in lagrange points are far more stable than other orbits. Well, in KSP, that\u0027s not a problem, because unless your orbit intersects an atmosphere or celestial body or changes SoI, it\u0027s even more stable than an orbit in a lagrange point would be.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-12-04T10:49:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn my opinion, most of the reasons people want lagrange points in game comes from the real-world benefits of lagrange points, which is to say that orbits in lagrange points are far more stable than other orbits. Well, in KSP, that\u0027s not a problem, because unless your orbit intersects an atmosphere or celestial body or changes SoI, it\u0027s even more stable than an orbit in a lagrange point would be.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s hardly the only reason. Aside from staying in a stable orbit, it\u0027s also staying in a constant position relative to the other bodies. It\u0027s useful for the same reason geosynchronous orbits are useful. In an Earth-Moon centric system the object at a Lagrange point appears to be stationary instead of constantly in motion around a body.\u003C/p\u003E\n"},{"CreatedByName":"ravener","CreatedById":44766,"CreatedDateTime":"2013-12-04T11:03:20Z","Content":"\n\u003Cp\u003Ewe aleredy have lagrange points, almost infinite in fact.\u003C/p\u003E\u003Cp\u003Eevery point on the same orbit as the mun outside of the muns SOI is stationary relative to the mun. i have almost complete coverage of the mun from the lagrange ponts just outside of the SOI (remote tech 2).\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-04T11:11:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EThat\u0027s hardly the only reason. Aside from staying in a stable orbit, it\u0027s also staying in a constant position relative to the other bodies. It\u0027s useful for the same reason geosynchronous orbits are useful. In an Earth-Moon centric system the object at a Lagrange point appears to be stationary instead of constantly in motion around a body.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s also not completely true. Objects in Lagrangian points are kind of like orbiting a body which isn\u0027t there.\u003C/p\u003E\u003Cp\u003EL1, L2, and L3 are unstable and to keep anything in them it must be maintained on rather intricate lissajous-style orbit which prevents it from exiting along one of possible escape routes.\u003C/p\u003E\u003Cp\u003EL4, and L5 are stable in the sense that the gravity potential forms a local extreme there rather than a saddle, but objects which are not exactly in the center appear to be orbiting an invisible body in the center along very elongated orbits.\u003C/p\u003E\u003Cp\u003EL3, L4, and L5 can be simulated in KSP with high precision. The only thing we can say KSP is short of are L1 and L2.\u003C/p\u003E\u003Cp\u003ERegarding the proposal ... if that\u0027d be only limited to L1 and L2, I see it as technically possible. But the practical implementation would give people very distorted perception of how particularly these two lagrangian points work. Given to how close to real orbital mechanics the whole rest of the game is, I believe it\u0027s better without them.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-12-04T11:14:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fatfluffycat\u0022 data-cite=\u0022fatfluffycat\u0022\u003E\u003Cdiv\u003Ewhy do people care about this so much? The devs said no\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Egiven that at least half the \u0022suggestions\u0022 are things on the do-not-suggest list hidden under \u0022this is xxx but not really so it\u0027s ok to suggest\u0022 and don\u0027t get locked, kids just keep spamming the forums with their pet project ideas and hope that eventually the devs will either think \u0022wow, so much demand for it, we\u0027d better build it\u0022 or \u0022let\u0027s do it so the kid shuts up\u0022. Neither of which is hopefully going to happen.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2013-12-04T11:43:17Z","Content":"\n\u003Cp\u003EYou \u003Cem\u003Ecan\u003C/em\u003E do Largrangian points, but there is no difference between Lagrangian points and orbit anywhere else inside of a moon. If you have a stable orbit that is identical to the Mun, but you are outside of it\u0027s SOI, then you stay there.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-12-04T13:14:13Z","Content":"\n\u003Cp\u003ELagrange points are, as some others rightly pointed out, on the What Not to Suggest List. If my memory serves, this kind of thing has been discussed at least six times within the last few months. As has already been said, at the present the developers have expressed no interest in actually including it as a feature, although I believe one or two of them are fond of the idea in some respect. I know it\u0027s an interesting topic and all, and they have their uses, but it\u0027s on the what not to suggest list, so I\u0027m gonna have to lock it. \u003C/p\u003E\u003Cp\u003ESorry, folks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}