{"TopicId":55942,"ForumId":55,"TopicTitle":"Engineer kerbals","CreatedByName":"Wolfperson","CreatedById":96478,"CreatedDateTime":"2013-12-12T21:09:30Z","PageNum":1,"Articles":[{"CreatedByName":"Wolfperson","CreatedById":96478,"CreatedDateTime":"2013-12-12T21:09:30Z","Content":"\n\u003Cp\u003EI came up with this random idea, of hiring Kerbal engineers! What this is about is the engineer\u0027s have different stats, 1-10 in building, and the number of their \u0027building\u0027 skill shows the number of chance for something to go wrong, for example:\u003C/p\u003E\u003Cp\u003EYou hire one with a 7/10 building skill, he has 70% chance to build it right, and 30% chance to build it wrong. If he builds it wrong, it chooses (randomly) to reduce max temp (highest chance, mainly for when they add reentry), Reduce max tolerance (so it explodes if too much G force or if hit too hard), or even worse, reduces the main stats (trust, holding capacity, ect)\u003C/p\u003E\u003Cp\u003EPros: will add extra randomness to the game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, something i would like.\u003C/p\u003E\u003Cp\u003EAdds something else to manage (you can have more then one but it takes the average)\u003C/p\u003E\u003Cp\u003Econs: could be frustrating when you go to land and your leg is build wrong and explodes on landing.\u003C/p\u003E\n"},{"CreatedByName":"fatfluffycat","CreatedById":73913,"CreatedDateTime":"2013-12-12T22:23:53Z","Content":"\n\u003Cp\u003ENo random failures the devs said......\u003C/p\u003E\n"},{"CreatedByName":"horndgmium","CreatedById":92543,"CreatedDateTime":"2013-12-12T22:29:50Z","Content":"\n\u003Cp\u003EYou know... Or we could have engineers that show a little animation of putting our ship together when we add a part. And not have random explosions.\u003C/p\u003E\n"},{"CreatedByName":"Unfawkable","CreatedById":93524,"CreatedDateTime":"2013-12-12T22:32:03Z","Content":"\n\u003Cp\u003EToo much randomness for my taste, I\u0027m sure there could be a more significant non-random way for Kerbal Engineers to exist. Such as reducing the price of parts once currency gets implemented.\u003C/p\u003E\n"}]}