{"TopicId":56292,"ForumId":55,"TopicTitle":"The Part I want more than anything","CreatedByName":"Hoshino","CreatedById":96902,"CreatedDateTime":"2013-12-15T23:00:03Z","PageNum":1,"Articles":[{"CreatedByName":"Hoshino","CreatedById":96902,"CreatedDateTime":"2013-12-15T23:00:03Z","Content":"\n\u003Cp\u003EI put forward the idea of The Accelerator, available in 1.25m, 2.5m, and radial varieties.\u003C/p\u003E\u003Cp\u003EWhen supplied with copious amounts of ElectricCharge, The Accelerator produces a magnetic field.\u003C/p\u003E\u003Cp\u003EWith tweakables, The Accelerator\u0027s strength (and ECharge consumption) as well as an activation delay (activation time after action group is activated) may be set.\u003C/p\u003E\u003Cp\u003EThe potential applications of such a part should be immediately apparent, but for entertainment, here\u0027s a list off the top of my head:\u003C/p\u003E\u003Cp\u003EGarbage Collection/Salvage/Tug Ships - need to recover something that doesn\u0027t have a docking port on it? A small array of accelerators may hold it snugly in place. WARNING: Activating attraction while too far from desired capture target may result in higher rendezvous velocities than intended.\u003C/p\u003E\u003Cp\u003EArtificial gravity on ships - Ever just wanted to keep those pesky EVAs from floating away, or wanted your kerbals to be able to stand firmly upon the deck of your space galleon? A longitudinal array of Accelerators may be for you! WARNING: Structural integrity may be compromised by unpredictable field interactions.\u003C/p\u003E\u003Cp\u003ERailguns - Who hasn\u0027t wanted to build a giant Railgun in LKO to fling your ships into interplanetary space? Or build an array on the surface and see if you can achieve LKO with one.\u003C/p\u003E\u003Cp\u003EGreen Energy - Never felt like you needed to lift an orange tanks\u0027 worth of batteries into LKO? You will now. Ever wish you had something to power with your completely overdone lotus-esque solar array? We\u0027ve got just the thing for you..\u003C/p\u003E\u003Cp\u003EArticulating spacecraft - For the truly insane, it may be possible to build a jointed spacecraft, and articulate it with the activation/deactivation of said accelerators.\u003C/p\u003E\u003Cp\u003ESpace Wrestling - Build a melee ship and attempt to punch your friends\u0027 (or more properly, attract them into your fist), grapple in a low-orbit cartwheel (reversible polarity as a tweakable action group toggle would make this more interesting)\u003C/p\u003E\u003Cp\u003E\u0022Catchers\u0022 - For lack of a better word, reverse-railguns that decelerate objects that fly through them.\u003C/p\u003E\u003Cp\u003EThere you have it. This is the one part I would most like to see added to KSP.\u003C/p\u003E\u003Cp\u003EThoughts? Comments? Add your own possible uses for such a part to the thread below!\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"toric5","CreatedById":58046,"CreatedDateTime":"2013-12-16T01:26:09Z","Content":"\n\u003Cp\u003Eyesss! although i think this would be better in the suggestions forum. i like it because its not a pre made solution, like other railgun ideas out there, but in fact a simple part that could be used to make a whole hose of contraptions. although ti should be small and radially attachable, in order to work with your ideas. that way we can attach it to girders and other stuff instead of having to use copious amours of radial attachment points.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-12-16T01:31:23Z","Content":"\n\u003Cp\u003EMoved to Suggestions and Development Discussion.\u003C/p\u003E\u003Cp\u003ENot entirely a new suggestion, but one that could definitely be discussed again.\u003C/p\u003E\n"},{"CreatedByName":"CodatheSpaceFox","CreatedById":73847,"CreatedDateTime":"2013-12-16T10:51:39Z","Content":"\n\u003Cp\u003EThis one is definitely unique, but in thought of something like a railgun, isn\u0027t a magnetic field as attractable as it is attractive to magnetic objects?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-12-16T12:26:04Z","Content":"\n\u003Cp\u003ENot sure what you mean... magnetic fields have two poles, after all.\u003C/p\u003E\n"},{"CreatedByName":"Hoshino","CreatedById":96902,"CreatedDateTime":"2013-12-17T01:52:35Z","Content":"\n\u003Cp\u003EThe basic \u0022railgun\u0022 architecture would be two parallel rails each lined with the Accelerator part (note that this is not how actual railguns work). The projectile would need to be between the rails, at which time the firing sequence would be initiated as an accelerating cascade of accelerator pair activations(regulated by the tweakable activation delay) that impart hopefully gratuitous speed to our projectile.\u003C/p\u003E\u003Cp\u003EOther more sustained applications could include *very* unorthodox spacecraft arrangements, such as having components/modules that orbited a core that was running a constant accelerator. Basically you could start playing with N-body ship/station designs, as I envision this module following the inverse-square law with regard to its attractive force.\u003C/p\u003E\u003Cp\u003EIf it were implemented with an actual electromagnetism model, that would let it do more interesting things (Somebody would build a simple hard drive in orbit, I\u0027d bet) but it\u0027d probably be too complicated and would reach into too many other systems.\u003C/p\u003E\u003Cp\u003ESo, The Accelerator would more closely be related to artificial gravity, as it\u0027s not a magnetic dipole.\u003C/p\u003E\n"},{"CreatedByName":"404james","CreatedById":20023,"CreatedDateTime":"2013-12-17T05:00:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hoshino\u0022 data-cite=\u0022Hoshino\u0022\u003E\u003Cdiv\u003EThe basic \u0022railgun\u0022 architecture would be two parallel rails each lined with the Accelerator part (note that this is not how actual railguns work). The projectile would need to be between the rails, at which time the firing sequence would be initiated as an accelerating cascade of accelerator pair activations(regulated by the tweakable activation delay) that impart hopefully gratuitous speed to our projectile.\u003Cp\u003EOther more sustained applications could include *very* unorthodox spacecraft arrangements, such as having components/modules that orbited a core that was running a constant accelerator. Basically you could start playing with N-body ship/station designs, as I envision this module following the inverse-square law with regard to its attractive force.\u003C/p\u003E\u003Cp\u003EIf it were implemented with an actual electromagnetism model, that would let it do more interesting things (Somebody would build a simple hard drive in orbit, I\u0027d bet) but it\u0027d probably be too complicated and would reach into too many other systems.\u003C/p\u003E\u003Cp\u003ESo, The Accelerator would more closely be related to artificial gravity, as it\u0027s not a magnetic dipole.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe not magnetism then. perhaps it could just be some sort of gravioli generator. Odds are it would be quite heavy, expensive, and power consuming, not to mention the late placement on the tech tree, but the uses are, as has been mentioned, endless.\u003C/p\u003E\n"}]}