{"TopicId":56482,"ForumId":55,"TopicTitle":"Count-down timer on the launch pad","CreatedByName":"breadcrumb","CreatedById":60913,"CreatedDateTime":"2013-12-17T14:09:40Z","PageNum":1,"Articles":[{"CreatedByName":"breadcrumb","CreatedById":60913,"CreatedDateTime":"2013-12-17T14:09:40Z","Content":"\n\u003Cp\u003EJust a little bit of aesthetics I guess, but the last couple of releases seem to have been focusing on that kind of thing too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Eoh - and a countdown timer on the website before each new version might alleviate some of the \u0022when is it coming!!???\u0022 traffic in the forum too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E - especially in the last few days/hours prior to the release.\u003C/p\u003E\n"},{"CreatedByName":"Jacob01","CreatedById":61842,"CreatedDateTime":"2013-12-17T20:41:26Z","Content":"\n\u003Cp\u003ENot a bad idea, I like it! I\u0027m guessing you would set a time, and as long as your rocket was throttled up, at the end of the time it would automatically take off?\u003C/p\u003E\u003Cp\u003EI think there is a issue with the second suggestion. If Squad are going to tell us a release date, they generally only tell us the day it will be coming out on, not the exact time. Although, maybe they could add the time a couple of hours before the release goes live. \u003C/p\u003E\u003Cp\u003EJacob\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-12-18T01:42:19Z","Content":"\n\u003Cp\u003EOh, trust me, a countdown for a KSP release is a \u003Cem\u003Ereally bad\u003C/em\u003E idea. Even given a vague date, it is often a bad idea. Releases can be and often are postponed by a day or two due to bugfixing needing more time than initially expected.\u003C/p\u003E\n"},{"CreatedByName":"Pursuedtank","CreatedById":50078,"CreatedDateTime":"2013-12-18T01:48:00Z","Content":"\n\u003Cp\u003EBesides even if it did help to alleviate some of the threads about when it was coming, it certainly wouldn\u0027t help with the pressure on the store when people download.\u003C/p\u003E\n"}]}