{"TopicId":57518,"ForumId":55,"TopicTitle":"\u0026quot;Impactor\u0026quot; science experiment","CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-12-23T21:28:03Z","PageNum":1,"Articles":[{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-12-23T21:28:03Z","Content":"\n\u003Cp\u003EI\u0027d like to see a science experiment (or at least science points) for flying a probe into a body like the Deep Impact mission, I think it\u0027d fit well into early career-mode missions when we\u0027ll be looking for experiments that are cheap, uncomplicated, and don\u0027t require great piloting skills or higher-tier parts to pull off.\u003C/p\u003E\n"},{"CreatedByName":"DELTA_12","CreatedById":72934,"CreatedDateTime":"2013-12-23T21:39:04Z","Content":"\n\u003Cp\u003Eit would be interesting but it would be hard to code sice that science part would require big impact tolerance and event if some part has big impat toreance it doesnt always means that it will survaive a hard impact since other parts mosly rip off\u003C/p\u003E\n"},{"CreatedByName":"Atoning Unifex","CreatedById":58766,"CreatedDateTime":"2013-12-23T21:56:04Z","Content":"\n\u003Cp\u003EI like this idea. The first moon landings were hard impacts to provide data about near surface and surface conditions and similar IRL suggestions have been made for other planets. \u003C/p\u003E\u003Cp\u003EPlus I\u0027m very good at crashing into planets! No, really! I do it all the time!\u003C/p\u003E\u003Cp\u003ENot sure about the implementation of such a device but it sounds like fun anyway.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-23T22:02:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DELTA_12\u0022 data-cite=\u0022DELTA_12\u0022\u003E\u003Cdiv\u003Eit would be interesting but it would be hard to code sice that science part would require big impact tolerance and event if some part has big impat toreance it doesnt always means that it will survaive a hard impact since other parts mosly rip off\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe structural panels already are pretty close to this. If you just double the numbers, it should work perfectly.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-23T22:04:28Z","Content":"\n\u003Cp\u003EThis would probably require that two parts are \u0022connected\u0022 in such a way that when part A is destroyed, part B counts it as an experiment, and stores the data for recovery, storage, or transmission.\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-12-23T22:07:13Z","Content":"\n\u003Cp\u003EWould be cool to have a REASON to crash into something...\u003C/p\u003E\u003Cp\u003EThe very nature of the experiment requires the destruction of the part involved, so yes challenging! Actually, the science value of impactors comes from cameras pointed at the impact point and by geologically sensitive instruments that record the seismic activity caused by the impact. That would also be a challenge to simulate in KSP.\u003C/p\u003E\u003Cp\u003EThere could be contracts with the objective to impact a body, though it still seems more \u0022right\u0022 to reward science for it.\u003C/p\u003E\n"},{"CreatedByName":"S4qFBxkFFg","CreatedById":83727,"CreatedDateTime":"2013-12-24T12:58:47Z","Content":"\n\u003Cp\u003EI think this would be good once we get the observatory, and instruments like telescopes/cameras/spectrometers. As stated, the instruments you\u0027d be getting the science from wouldn\u0027t be the part impacting.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2013-12-24T13:09:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022S4qFBxkFFg\u0022 data-cite=\u0022S4qFBxkFFg\u0022\u003E\u003Cdiv\u003EI think this would be good once we get the observatory, and instruments like telescopes/cameras/spectrometers. As stated, the instruments you\u0027d be getting the science from wouldn\u0027t be the part impacting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. Usually, there are seismometers deployed relatively near, so perhaps the science part from an impactor would only work if the part that was the science creator exploded within 2.5km physics range of the piece.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2013-12-24T13:33:55Z","Content":"\n\u003Cp\u003Ei had a similar idea wherein a special \u0022mass\u0022 part could be added to probes. if this mass collided with a planet or moon at more than 3000m/s in vacuum then you would get science points(presumably from kerbin based spectrum telescopes reading the ejected matter) no need for transmission. or we could do it like the real life mission OP suggested \u003Ca href=\u0022https://en.wikipedia.org/wiki/Deep_Impact_(spacecraft)\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Deep_Impact_(spacecraft)\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2013-12-24T13:48:43Z","Content":"\n\u003Cp\u003EI think having to have a seismometer network and observatories is probably a little complicated, I would have imagined the impactor expriment as something to do for less advanced players who aren\u0027t yet able to make a controlled landing on the Mun or Minmus\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-12-24T14:18:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003EI think having to have a seismometer network and observatories is probably a little complicated, I would have imagined the impactor expriment as something to do for less advanced players who aren\u0027t yet able to make a controlled landing on the Mun or Minmus\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. From a gameplay perspective, this is more useful. A popup after the crash, similar to what you get from recovering a vessel on Kerbin, could let you know you got x science points for impacting a body. I\u0027m guessing, to register an impactor, it would need to have focus at the time of crash?\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-24T19:36:57Z","Content":"\n\u003Cp\u003ESomething just occurred to me.\u003C/p\u003E\u003Cp\u003EYou would only be able to transmit the data, because the experiment itself is self-destructive.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-24T20:41:41Z\u0022 title=\u002212/24/2013 08:41  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 24, 2013\u003C/time\u003E by Themohawkninja\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Atoning Unifex","CreatedById":58766,"CreatedDateTime":"2013-12-24T20:37:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003ESomething just occurred to me.\u003Cp\u003EYou could would only be able to transmit the data, because the experiment itself is self-destructive.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is probably a perfect example of why transmission losses are ill conceived!\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-24T20:43:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Atoning Unifex\u0022 data-cite=\u0022Atoning Unifex\u0022\u003E\u003Cdiv\u003EThis is probably a perfect example of why transmission losses are ill conceived!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlthough, on second thought, you could build it with two parts, the impactor and a video camera to record the impact. At least then you could both transmit or recover the data.\u003C/p\u003E\n"},{"CreatedByName":"TimMartland","CreatedById":68334,"CreatedDateTime":"2013-12-24T20:56:05Z","Content":"\n\u003Cp\u003EI did an impact mission in 0.22. I just flew fast at the Mun and spammed the send key as much as I could before I hit the ground!\u003C/p\u003E\n"},{"CreatedByName":"zxczxczbfg","CreatedById":74636,"CreatedDateTime":"2013-12-24T20:58:21Z","Content":"\n\u003Cp\u003EI think it might be a possibility to take a QBE probe body or something similar, add an integrated RTG so it doesn\u0027t die, add an \u0022impact analysis\u0022 science experiment, add a transmission module, and ramp up the impact tolerance to twenty gajillion. The analysis would have to give relatively little science to balance out the other capabilities, but still.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-01T21:36:33Z\u0022 title=\u002201/01/2014 09:36  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 1, 2014\u003C/time\u003E by zxczxczbfg\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"akalla","CreatedById":99533,"CreatedDateTime":"2014-01-02T05:33:46Z","Content":"\n\u003Cp\u003EWhat if the seismology component was an optional extra? The ship orbiting the planet dropping impactors could have instruments for analyzing the plume, etc., and if you had previously landed a seismograph close enough then you could receive extra science points. The difference between just watching an impact from orbit vs. recording the seismic data might be on par with the difference between transmitting data about a sample vs. returning it to kerbin. \u003C/p\u003E\u003Cp\u003E I have no idea about coding any of this... I assume it complicates things to try to have two ships working together on a science experiment like this?\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-01-02T07:02:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JumpsterG\u0022 data-cite=\u0022JumpsterG\u0022\u003E\u003Cdiv\u003EThere could be contracts with the objective to impact a body, though it still seems more \u0022right\u0022 to reward science for it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. While coding a specific part to actually survive impact unscathed to transmit science might be very difficult for obvious reasons, I can definitely see how this might integrate well with the contract system, giving you a science reward for completing the mission.\u003C/p\u003E\u003Cp\u003EI can even see a good in-character justification for it, in light of the comments others have made: The contracting organization has their own measuring instruments to observe the effects of the impact, and they\u0027ll share the data with your space program if you\u0027ll construct the probe for them to their specifications.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-01-02T14:23:54Z","Content":"\n\u003Cp\u003EI think that if you destroy a part, the science log will show up and it will be automatically be sent back for 100% transmission value. In addition to biome, speed ranges should be a factor. Between 10 m/s and 40 m/s. Between 40 m/s and 70 m/s. Between 70 m/s and 150 m/s. Between 150 m/s and 270 m/s. Between 270 m/s and 400 m/s. Between 400 m/s and 800 m/s. Between 800 m/s and 2.5 km/s. Between 2.5 km/s and 5 km/s. Between 5 km/s and 70 km/s. 70 km/s\u002B\u003C/p\u003E\n"},{"CreatedByName":"Atoning Unifex","CreatedById":58766,"CreatedDateTime":"2014-01-02T18:38:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EI can definitely see how this might integrate well with the contract system, giving you a science reward for completing the mission.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes this sounds like a good way around implementing something tricky. As an aside it\u0027s also been suggested that resources could be handled the same way - we identify their existance for another company to then exploit, so we have none of the grinding but get some monetary or other benefit.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2014-01-02T19:26:35Z","Content":"\n\u003Cp\u003EUh guys...\u003C/p\u003E\u003Cp\u003ECouldn\u0027t you just code the game to run a check to see if the ship is capable of transmitting (which is already does on command), and then code the end screen to award a \u0027recovery of data from a ship crashed on X\u0027 the same way it handles determination whether you recover or scrap a vessel? To prevent it happening for landers, it only works on a \u0027catastrophic failure!\u0027 screen.\u003C/p\u003E\u003Cp\u003EI mean, the game is already doing everything it needs for this to work. The different aspects just need to talk to one another.\u003C/p\u003E\u003Cp\u003EAs for seismometers and stuff. Yeah, that\u0027s one thing that they do. Though I think it\u0027s much more common to send the impactor, and then watch the resulting plume/crater with spectrometers and telescopes and such. Since we don\u0027t HAVE those... I think it\u0027s a fair abstraction to assume the kerbals have their big lenses trained on your kaboom.\u003C/p\u003E\n"},{"CreatedByName":"mc8888","CreatedById":23756,"CreatedDateTime":"2014-01-02T19:42:22Z","Content":"\n\u003Cp\u003EYou could do it as a hard lander type thingy. The idea is you fire it at the said planet/moon and it sticks into the surface, then sends back information. You could make the whole experiment a single part, maybe like a hybrid between a solid rocket, a probe core and a science experiment. That way, you could make the whole thing strong without worrying about things falling off on impact.\u003C/p\u003E\n"}]}