{"TopicId":57620,"ForumId":55,"TopicTitle":"Lose Condition For Career Mode","CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-24T19:00:29Z","PageNum":1,"Articles":[{"CreatedByName":"The Jedi Master","CreatedById":57348,"CreatedDateTime":"2013-12-24T19:00:29Z","Content":"\n\u003Cp\u003ESo, with money and such supposedly coming in the next update, I was thinking: what about a lose condition? Like, if you\u0027re enough in debt or if there are too many catastrophic failures or if there are too many kerbal deaths, the program gets shut down and you lose the game. This would only apply to career mode, of course. I think it would be a fun addition that would make the game a little more challenging.\u003C/p\u003E\u003Cp\u003EThanks for your consideration.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-24T19:31:32Z","Content":"\n\u003Cp\u003EI\u0027m assuming the lose condition would have something to do with too little reputation or money. Maybe we won\u0027t even need a lose condition, we\u0027d just end up at a point where we lacked enough reputation to get a mission or enough money to launch, where the only option would be to abandon the game. I don\u0027t think it\u0027s going to be a relatively easy condition to reach, though, even for newbies to the game.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-24T21:10:02Z","Content":"\n\u003Cp\u003EI don\u0027t think career lose condition is a good idea. Yes, it should be challenging, but they should never be able to completely lose in the sense that they have no way to reach the final goal, whatever it is.\u003C/p\u003E\u003Cp\u003EYou can already lose a mission in KSP, in fact it\u0027s rather easy. Even now when everything is free in game, starting a mission over from scratch may be a lot of work. Having to start the whole career mode from scratch would IMO discourage players from further playing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-24T21:12:28Z\u0022 title=\u002212/24/2013 09:12  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 24, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-25T00:21:56Z","Content":"\n\u003Cp\u003ELies and slander. A game you can\u0027t lose isn\u0027t a game; it\u0027s a toy. That\u0027s what you have the sandbox for.\u003C/p\u003E\u003Cp\u003EThat said, I\u0027d really love to see save states, able to save a career in multiple slots.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-25T00:31:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003ELies and slander. A game you can\u0027t lose isn\u0027t a game; it\u0027s a toy. That\u0027s what you have the sandbox for.\u003Cp\u003EThat said, I\u0027d really love to see save states, able to save a career in multiple slots.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWouldn\u0027t that just turn your game into a toy?\u003C/p\u003E\u003Cp\u003EI agree that there should be a lose condition but I have a feeling that if KSP actually ends up having one it will be pretty hard to actually reach.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-25T00:58:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003ELies and slander. A game you can\u0027t lose isn\u0027t a game; it\u0027s a toy. That\u0027s what you have the sandbox for.\u003Cp\u003EThat said, I\u0027d really love to see save states, able to save a career in multiple slots.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou see, I\u0027d prefer a \u0022toy\u0022 with no savegames to a game which makes me lose halfway because I forgot something substantial early on and then I have to go through multiple saves to find where I missed something.\u003C/p\u003E\u003Cp\u003EI still remember playing early adventure games such as Space Quest and the thing I hated on them was that there were quite a few places where you can forget something and if you did, there was no chance to finish the game because the item was essential, irreplaceable, and it was not possible to return for it. In fact, in several cases I either never finished them or played them plainly from a cheat sheet because I was curious about the ending.\u003C/p\u003E\u003Cp\u003ELater developers got smarter and it was always either possible to return for that thing, or it was possible to get a replacement somewhere else. I loved such games because they were challenging but the only reason to get stuck in them was that you didn\u0027t figure out something; there was always chance to figure it out and finish the game.\u003C/p\u003E\n"},{"CreatedByName":"Psycix","CreatedById":76916,"CreatedDateTime":"2013-12-25T01:20:29Z","Content":"\n\u003Cp\u003EI think that the absence of a loss condition (by simply waiting a while until you get funding again) makes the game more fun.\u003C/p\u003E\u003Cp\u003EBy not being able to lose, loss of spacecrafts is affordable. Instead of having to reload saves and redesign a mission until it works, we can keep on playing and try again without having to pretend it was a simulation.\u003C/p\u003E\u003Cp\u003EBy making the game losable, spacecraft loss will be circumvented by saving and loading, which is a lame way to play.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-25T03:30:32Z","Content":"\n\u003Cp\u003EA lose condition is essential to the game.\u003C/p\u003E\u003Cp\u003EBecause if you can\u0027t lose, why to care about money, reputation and science?\u003C/p\u003E\u003Cp\u003EBut KSP is an unique game, it might have an unique way to lose.\u003C/p\u003E\u003Cp\u003EMy idea is about what regex said at the begin, you get stuck on a state where you have to basically start over, only have money for the ships you would build at the begin of the game.\u003C/p\u003E\u003Cp\u003EThe only thing is that you wouldnt lose the techtree, but the advanced parts are more expensive, so you would be starting over anyway.\u003C/p\u003E\u003Cp\u003EIt\u0027s more about penalties than locking you up completelly.\u003C/p\u003E\u003Cp\u003EAnother idea is that if you run on that kind of state you can \u0022sign up a commitment term\u0022 to reset the techtree nodes (or some parts of it) and have your debt zeroe\u0027d, but can only do that once.\u003C/p\u003E\u003Cp\u003EThat would be a nice GAME OVER condition, which should be available to be enabled or not.\u003C/p\u003E\u003Cp\u003EBut remember, lose condition and GAME OVER are completelly different.\u003C/p\u003E\u003Cp\u003EThink about GTA, you lose if you fail to pass the missions but you can still retry, thus not a G.O.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-12-25T04:51:46Z","Content":"\n\u003Cp\u003Ein KSP you set your own goals, if you don\u0027t meet those you \u0022lose\u0022.\u003C/p\u003E\u003Cp\u003EThat\u0027s what I like about it, not being forced to do things in a specific scripted way else I get penalised for it.\u003C/p\u003E\n"},{"CreatedByName":"LostElement","CreatedById":78368,"CreatedDateTime":"2013-12-25T05:29:13Z","Content":"\n\u003Cp\u003EThere should be a Easy, Normal, Hard, and Master difficulty. determining whether how much money you start with, the maximum kerbal deaths before shutdown, etc.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-12-25T06:07:11Z","Content":"\n\u003Cp\u003EI think I saw somewhere where Squad said there was not going to be a difficulty slider bar, but for the life of me, I cannot remember where I saw it, if I even really did see it lol.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-12-25T14:45:34Z","Content":"\n\u003Cp\u003EI strongly disagree with having a lose condition. We have grown up on games that include a lose condition because the games\u0027 designers have been either too lazy or too inept to come up with a better style. Some games work with lose conditions but overall it\u0027s just a cheap way to bypass building actual choice\u0026gt;reaction content. KSP is showing strong signs of moving beyond that. It would not be difficult for KSP to never have a lose condition and still be challenging for everyone. A big part of that challenge is where you set your goals. Other parts to come may include trying to maintain reputation with manufacturers or Kerbal nations which may be much more difficult to win back once you have lost that reputation. Perhaps you can reach a point where your space program is disbanded and you have to work odd jobs to fund backyard spacecraft to get back on your feet again. But just as in the real world and in EVE Online in which no matter how far you go, you can\u0027t lose the game (unless your save file and/or brain gets damaged beyond usability), there\u0027s always a way to crawl back.\u003C/p\u003E\u003Cp\u003ELose conditions have always been one of the things that turn me away from long-play games. I feel like I\u0027m cheating when I restore my save and try again, and it gets repetitious if I have to view the same content over and over because I keep losing the \u0022difficult boss battle\u0022. Real diffculty does not \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Enecessarily\u003C/span\u003E in any way need to have a sudden catastrophic failure point built in. Players will already experience that with some of their more dreamy rocket designs when they get to the launch pad.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-25T19:09:26Z","Content":"\n\u003Cp\u003EEvery game from checkers onwards, and every version of solitare, has a lose scenario. In fact, it\u0027s only fairly recently that the idea of a no-lose game has risen its head. There is nothing wrong with losing. I just don\u0027t see the point of money if you can\u0027t run out of it, of reputation if you can\u0027t lose it, or making it to the mun if there is no penalty for failing. Hell, even your first three kerbals are currently immortal. Unless you launch multiple missions, there isn\u0027t even death in this game!\u003C/p\u003E\n"},{"CreatedByName":"Decent Weasel","CreatedById":74583,"CreatedDateTime":"2013-12-25T19:48:50Z","Content":"\n\u003Cp\u003ETo be fair, if we tried to give KSP a lose condition as realistic as its orbital mechanics, the \u0027lose condition\u0027 would be abrupt, infuriating, and tied to unrelated politics rather than player success or failure. \u0022Okay, you built a vehicle that\u0027s tacitly demonstrated first-strike capability, and now the Kerbals across the pond have normalized trade relations. No need to go to space today. Funding cut!\u0022\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-25T20:04:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EEvery game from checkers onwards, and every version of solitare, has a lose scenario. In fact, it\u0027s only fairly recently that the idea of a no-lose game has risen its head. There is nothing wrong with losing. I just don\u0027t see the point of money if you can\u0027t run out of it, of reputation if you can\u0027t lose it, or making it to the mun if there is no penalty for failing. Hell, even your first three kerbals are currently immortal. Unless you launch multiple missions, there isn\u0027t even death in this game!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you lose a game of checkers, it\u0027s always just up to you whether you want to play again or not, now or later. There\u0027s nobody above who would prevent you playing checkers ever again.\u003C/p\u003E\u003Cp\u003ESingle mission in KSP is IMO a good parallel to a game of checkers. I don\u0027t see any problems with losing such a game, if regardless of whether you win or lose, the decision whether you want to send another mission or not is up to you.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-25T22:40:11Z","Content":"\n\u003Cp\u003EOkay. So is the game \u0027launch your own rocketship\u0027 or \u0027run your own space program?\u0027 If its the former, we don\u0027t need science or vehicle persistence or docking or any host of other things.\u003C/p\u003E\u003Cp\u003ELaunching a rocket isn\u0027t a game of checkers, it\u0027s a hand of poker or a play of football. A subset of the larger game. We can already lose matches by blowing up our ships. Let us lose the GAME.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork_werewolf","CreatedById":90749,"CreatedDateTime":"2013-12-25T23:03:57Z","Content":"\n\u003Cp\u003EI think the big question is how many hours is it fun to lose and have to restart from?\u003C/p\u003E\u003Cp\u003EIn my opinion it is between 10 Mins and 4 hours. This about covers all lengths of mission but NOT a save file. I would not find it fun loosing 50 hours of work. Set us back, limit our spending but let us keep our tech. Make us learn to do things with smaller more efficient ships. Make us not bet all our chips at once unless we are SURE it will work. This adds tension, we need true loss and 4 hours of work lost with only spare change in the bank is loss. A football game is 90 minutes, a poker game maybe 12 hours but I know no real world games that last for days or weeks.\u003C/p\u003E\u003Cp\u003EThis doesn\u0027t even touch on thereaverofdarkness\u0027s point. I do not want to see the already struggling new players \u0022die\u0022 after 6 hours because of what they did 2 hours ago when they knew nothing. That is not fun. \u003C/p\u003E\u003Cp\u003EDon\u0027t get me wrong I like a challenge but loss needs to be equal to gain, 2 hours work can be lost in 2 hours but 200 hours shouldn\u0027t be lost in 2 minutes.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2013-12-25T23:11:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Clockwork_werewolf\u0022 data-cite=\u0022Clockwork_werewolf\u0022\u003E\u003Cdiv\u003EI think the big question is how many hours is it fun to lose and have to restart from?\u003Cp\u003EIn my opinion it is between 10 Mins and 4 hours. This about covers all lengths of mission but NOT a save file. I would not find it fun loosing 50 hours of work. Set us back, limit our spending but let us keep our tech. Make us learn to do things with smaller more efficient ships. Make us not bet all our chips at once unless we are SURE it will work. This adds tension, we need true loss and 4 hours of work lost with only spare change in the bank is loss. A football game is 90 minutes, a poker game maybe 12 hours but I know no real world games that last for days or weeks.\u003C/p\u003E\u003Cp\u003EThis doesn\u0027t even touch on thereaverofdarkness\u0027s point. I do not want to see the already struggling new players \u0022die\u0022 after 6 hours because of what they did 2 hours ago when they knew nothing. That is not fun. \u003C/p\u003E\u003Cp\u003EDon\u0027t get me wrong I like a challenge but loss needs to be equal to gain, 2 hours work can be lost in 2 hours but 200 hours shouldn\u0027t be lost in 2 minutes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI belive that it\u0027s pretty much self balancing.\u003C/p\u003E\u003Cp\u003EYou won\u0027t put your entire budget of 20 gameplay hours into a single ship, instead of you really take the risk of it.\u003C/p\u003E\u003Cp\u003EThat is more about if you want to go big and take risk or keep a low profile and be safe, which is basically what every game is about.\u003C/p\u003E\u003Cp\u003EOn the other way, failure at the begin must not be so easy, remember that people who never played the game will start it from the begin, and it\u0027s too frustrating to lose it 10 times within 20 minutes.\u003C/p\u003E\u003Cp\u003EThe first mission should be budget-less and science-less, so people can fail as many times as needed until get it right, earn their first cash and then start for real.\u003C/p\u003E\n"},{"CreatedByName":"Nobody","CreatedById":64303,"CreatedDateTime":"2013-12-26T00:51:26Z","Content":"\n\u003Cp\u003EFor a game over I would suggest running out of money and having a rep so bad that no one would fund your program would be the game over point. When that is reached you would switch to a new startup space program within the save file starting from the scratch. Some missions given to you after the restart would be to save the crew and salvage equipment from a bankrupted program that was run by a few incompetent screw-ups.\u003C/p\u003E\u003Cp\u003EThis way what you salvage can be used even if you don\u0027t have the tech unlocked so your better off than a fresh start but still punished for your mistakes. The crew you rescue would be grateful and looking for jobs so they could be hired without the need to go through training.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2013-12-26T02:30:26Z","Content":"\n\u003Cp\u003EReal world, no. Videogames, yes. Any strategy game has such lose points. Most of the tycoon games as well. As it currently stands with most of these suggestions I would have to mod the game even to lose and revert a save. What about multi-part missions? What if I want to hop back before I begin my Jool mothership? Can\u0027t do that right now. With funding, without a save state system, the only way to prevent long unwinnables is to make the career mode a boring toy. Or, give saves longer back than right before your last launch, and then there\u0027s no reason to NOT have a losing condition.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-26T03:46:55Z","Content":"\n\u003Cp\u003EI fail to see how KSP will ever be so hard as to actually provide a very difficult challenge except to a player in their first month of play, even with monetary, science, and reputation constraints. I think for 90% of players any lose condition in KSP will be a non-existent concern, even with reduced resources, but I very much think there should be a condition that prevents further advancement.\u003C/p\u003E\u003Cp\u003EIt should also be noted that the devs are very interested in game world persistence so I find it highly unlikely that we\u0027ll see a more complicated save system than what we have. You can also disable it in the persistence file so it may end up as a \u0022difficulty option\u0022 at some point (much like how I suspect permadeath will work.)\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-26T07:49:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI fail to see how KSP will ever be so hard as to actually provide a very difficult challenge except to a player in their first month of play, even with monetary, science, and reputation constraints. I think for 90% of players any lose condition in KSP will be a non-existent concern, even with reduced resources, but I very much think there should be a condition that prevents further advancement.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t have problems imagining that. In current KSP, you can freely overengineer. You can build a ship that can go to Mun and back three times and go to Mun once with it. And there are players which will need all that extra dv to make it happen. With budget constraints you may simply construct a ship which does not have the dv to get there. Or, assuming you\u0027re using MechJeb or other mod which provides tech info and all kinds of dv maps, you can make a ship which can make it there, but only if you\u0027re Scott Manley. Result is no (or negative) return value.\u003C/p\u003E\u003Cp\u003EI am not assuming that tool you use actually flying the ship for you because that\u0027s what I would consider turning the game into a toy. It would turn the game into economy progress sim.\u003C/p\u003E\u003Cp\u003EAfter you lose a flight or ten, it\u0027s all up to whether there\u0027s a \u0022cushion\u0022 of offers which require low or no funds, provide some profit and are always available.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-26T07:52:10Z\u0022 title=\u002212/26/2013 07:52  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 26, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Whatshtisthis","CreatedById":42775,"CreatedDateTime":"2013-12-26T08:18:37Z","Content":"\n\u003Cp\u003EI think that losing should be only for Ultra Hard mode or something, where penalties for losing crew members and failures are much larger.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-12-26T10:15:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Stargate525\u0022 data-cite=\u0022Stargate525\u0022\u003E\u003Cdiv\u003EOr, give saves longer back than right before your last launch, and then there\u0027s no reason to NOT have a losing condition.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s really terrible reasoning. If losing the game means you jump back in time and try your mission over from the launch point, then you effectively lost all of the work you did and reversed all of your mistakes. On the other hand, with no lose condition and only one save slot that gets written over automatically, you are forced to live with your successes and failures alike, but you can always try again. You kill Thompbart Kerman and you can hire somebody else. If you\u0027re meticulous enough, you can hire somebody else with similar attributes. But it won\u0027t be Thompbart. The money spent on that Jool mission that ended in catastrophic failure won\u0027t mysteriously come back to you, but you can earn more money and make a new flight. Rockomax will forever hold a grudge against you for making people believe that they were partially to blame for your orange tanks and mainsails falling apart on the launch pad because you forgot to strut it all up, but you can recover somewhat by making reparations with them, or maybe by flying for Probodobodyne instead.\u003C/p\u003E\n"},{"CreatedByName":"Champ","CreatedById":96425,"CreatedDateTime":"2013-12-26T10:54:38Z","Content":"\n\u003Cp\u003EI really think a lose condition is a bad idea.\u003C/p\u003E\u003Cp\u003EFirst, a game that is too hard is a bad game. KSP is already hard enough for beginners, they already have so much to learn. Imagine this :\u003C/p\u003E\u003Cp\u003EYou are a beginner. You have, with much difficulty, progressed in the science tree and are ready to try to go to the mun (beginners won\u0027t think minmus is easyer : mun is near). You make a dozen of trys, each ends in a catastrophic failure (crash, team lost, bad reputation, no money)... And then after so many tries, you get to the lose condition : Game over. You must start from the begining, you lost all your hard-earned science and reputation... Too disappointing. You won\u0027t give it another try, you will claim the game is too hard, and miss a fantastic gaming experience.\u003C/p\u003E\u003Cp\u003EMy second point is this : you want a lose condition for challenge ? Experimented players will never reach these conditions. They know how to fly a rocket, how to land, how to make a rescue mission, and very rarely fail. This will not had a challenge to them. It will only add difficulty for the beginners. And the game is already hard enough for beginners.\u003C/p\u003E\u003Cp\u003EFinal point : You want a lose condition, when we have no win condition ? I read everywhere on this thread people saying \u0022hey, every game has a lose condition !\u0022. But every game has a win condition too. KSP is different. We don\u0027t want a win condition because this would put an end to the game, why would we want a lose condition ?\u003C/p\u003E\n"}]}