{"TopicId":57735,"ForumId":55,"TopicTitle":"Folder structures and note read-outs.","CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2013-12-26T00:35:22Z","PageNum":1,"Articles":[{"CreatedByName":"Galileo Kerbonaut","CreatedById":65299,"CreatedDateTime":"2013-12-26T00:35:22Z","Content":"\n\u003Cp\u003EAt this point all our ships are in one directory. Once you have built a lot of ships, this list becomes pretty hard to read. It would be great to have folder structures so it is easier to categorize our vessels. \u003C/p\u003E\u003Cp\u003EIt would also be nice if the notes that we can write for our vessels in the VAB, could be read out in this list. I have a lot of different ships: \u003C/p\u003E\u003Cp\u003Ee.g.\u003C/p\u003E\u003Cp\u003EStationCore Mk1\u003C/p\u003E\u003Cp\u003EStationCore Mk2\u003C/p\u003E\u003Cp\u003EStationCore Mk3 \u003C/p\u003E\u003Cp\u003Eetc. \u003C/p\u003E\u003Cp\u003EAll of them serve a different purpose, but after playing for a while I\u0027m not sure what vessel does what. I use the notes in the VAB for this, but to actually read them I have to load my ship in the VAB. It would be a lot more convenient if those notes were displayed in the screen you get when you click on the launchpad and select your vessel instead of loading each separate craft in the VAB to see what it does.\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2013-12-26T07:14:10Z","Content":"\n\u003Cp\u003EThis is a good idea I would love to be able to place my created craft in folders just for organization purposes\u003C/p\u003E\n"},{"CreatedByName":"Clockwork_werewolf","CreatedById":90749,"CreatedDateTime":"2013-12-27T00:28:11Z","Content":"\n\u003Cp\u003EYea being able to add all my first rockets into on folder, my newer rockets into another and my crazy test into another folder would be great. I end up naming my ships Crow MK1, then MK2 so they all just clump up in the alphabetical list. The crazy MK1 however is always near the top of the list despite being made 3 months ago or something.\u003C/p\u003E\n"},{"CreatedByName":"BlackBicycle","CreatedById":29657,"CreatedDateTime":"2013-12-27T01:21:32Z","Content":"\n\u003Cp\u003EPersonally, I\u0027d love to be able to organize my designs by folders. Good thing we already have a separate one for launch vehicles (I mean subassembly \u0022folder\u0022). But yeah, a simple set of OS-based commands to create folders and put designs in those from within the game would be great.\u003C/p\u003E\n"}]}