{"TopicId":58116,"ForumId":55,"TopicTitle":"X-Plane 10 flight model (Blade element theory)","CreatedByName":"SRSR333","CreatedById":82252,"CreatedDateTime":"2013-12-29T08:58:44Z","PageNum":1,"Articles":[{"CreatedByName":"SRSR333","CreatedById":82252,"CreatedDateTime":"2013-12-29T08:58:44Z","Content":"\n\u003Cp\u003EHey guys,\u003C/p\u003E\u003Cp\u003EI have used KSP since v0.20, and find it a great improvement over lame spaceflight sims like Galaxy on Fire 2 (although you can blow stuff up there). However, the in-atmosphere aerodynamics model is not very good (actually quite terrible), and this is coming from someone who has also used some of the greatest (space)flight sims: FSX, Orbiter 2010 and X-Plane versions 8 to 10, inclusive. \u003C/p\u003E\u003Cp\u003EX-Plane in particular, implements this idea called \u0027blade element theory\u0027, where the surface of aircraft are broken down and the forces on each part calculated individually, and then combined to produce extremely realistic flight. Could it be possible to implement the same thing in KSP, seeing that even rockets can be affected by this?\u003C/p\u003E\u003Cp\u003ELink: \u003Ca href=\u0022http://wiki.x-plane.com/Appendix_A:_How_X-Plane_Works#Advantages_of_Blade_Element_Simulation\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.x-plane.com/Appendix_A:_How_X-Plane_Works#Advantages_of_Blade_Element_Simulation\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheGeoninja","CreatedById":92271,"CreatedDateTime":"2013-12-29T14:24:05Z","Content":"\n\u003Cp\u003EI think that currently aerodynamics in KSP are not being focused on I actually feel there are some pros and cons to this. At the moment the lack of high level aerodynamics is a good opportunity for modders and it allows the devs to work on other core aspects of the game. It also has cons such as planes don\u0027t work properly and such.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-12-29T14:29:20Z","Content":"\n\u003Cp\u003EIf this were to be implemented, it should be disableable, because it sounds quite memory intensive.\u003C/p\u003E\n"},{"CreatedByName":"Superfish57","CreatedById":69214,"CreatedDateTime":"2013-12-29T16:25:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Themohawkninja\u0022 data-cite=\u0022Themohawkninja\u0022\u003E\u003Cdiv\u003EIf this were to be implemented, it should be disableable, because it sounds quite memory intensive.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom my personal experience with x-plane, it seems to run great on computers. I don\u0027t think that it would be a memory hog at all. \u003C/p\u003E\u003Cp\u003ESquad is not focusing on aerodynamics right now, but I recommend you look at FAR mod. It fixes the aerodynamics quite a bit.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-12-29T16:36:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Superfish57\u0022 data-cite=\u0022Superfish57\u0022\u003E\u003Cdiv\u003EFrom my personal experience with x-plane, it seems to run great on computers. I don\u0027t think that it would be a memory hog at all. \u003Cp\u003ESquad is not focusing on aerodynamics right now, but I recommend you look at FAR mod. It fixes the aerodynamics quite a bit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESuperfish is right on both counts. I love realistic flight sims, this is why I have never uninstalled FreeFalcon5.5 off of my computer, and a decent flight model isn\u0027t that big of a memory hog, its just numbers that the computer crunches and checks against a set of another numbers. Something a computer does when running a spreadsheet program.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-12-29T17:13:28Z","Content":"\n\u003Cp\u003Ewhich would involve rewriting the entire physics engine to use the one from X-Plane as well, which would involve replacing Unity with the core from X-Plane, which would mean licensing that, which would end up rewriting KSP from scratch.\u003C/p\u003E\u003Cp\u003EAin\u0027t gonna happen, kids.\u003C/p\u003E\n"},{"CreatedByName":"Charzy","CreatedById":440,"CreatedDateTime":"2013-12-29T17:57:07Z","Content":"\n\u003Cp\u003ENobody\u0027s suggesting changing KSP to use X-Plane\u0027s engine. They\u0027re suggesting a feature that X-Plane has. If you\u0027re going to try to discredit suggestions with no real backing, try harder.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-12-29T18:01:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hodo\u0022 data-cite=\u0022Hodo\u0022\u003E\u003Cdiv\u003ESuperfish is right on both counts. I love realistic flight sims, this is why I have never uninstalled FreeFalcon5.5 off of my computer, and a decent flight model isn\u0027t that big of a memory hog, its just numbers that the computer crunches and checks against a set of another numbers. Something a computer does when running a spreadsheet program.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe physics we have now is just the computer crunching numbers to see what happends. You can still make it lag to extremes with enough parts.\u003C/p\u003E\n"},{"CreatedByName":"SRSR333","CreatedById":82252,"CreatedDateTime":"2013-12-30T04:09:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jwenting\u0022 data-cite=\u0022jwenting\u0022\u003E\u003Cdiv\u003Ewhich would involve rewriting the entire physics engine to use the one from X-Plane as well, which would involve replacing Unity with the core from X-Plane, which would mean licensing that, which would end up rewriting KSP from scratch.\u003Cp\u003EAin\u0027t gonna happen, kids.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot necessarily, mate. Blade element theory is a physics concept that can be implemented by ANY physics/flight engine. Unity can do it, Havok can do it, CryEngine 3 can do it. You just need the maths and the code for the maths. Blade element theory was actually developed way back in 1969, and most professional flight sims use it for extreme realism. And this is merely a discussion, which is why I labelled it as such. If Squad does take note of this and attempts to implement it, good. If they don\u0027t, well, it\u0027s still healthy discussion.\u003C/p\u003E\n"},{"CreatedByName":"Scoundrel","CreatedById":15369,"CreatedDateTime":"2013-12-30T09:48:14Z","Content":"\n\u003Cp\u003EThe OP posited an intelligent suggestion and wisely couched it in the form of a discussion so I\u0027ll chime in because I do so love the Suggestions threads...\u003C/p\u003E\u003Cp\u003EI don\u0027t remember if HarvesteR made any posts on the forums about it, but he stated in podcasts earlier this year that the aerodynamic portion of the game is something that they\u0027ll get to down the road as they wanted to focus on content, gameplay and optimization first... of course he also mentioned more recently that nobody there has a physics background which is why the current aerodynamics model is basically kludged together until they educate themselves further or hire someone with the kind of background they would need to make their physics complete.\u003C/p\u003E\u003Cp\u003ENow, there was an old thread on this subject where ferram4 debated various methods of implementing \u0022acceptable\u0022 aerodynamic models. Just use the forum\u0027s search function and it should pop up if it hasn\u0027t been buried in the archives. I also recommend visiting his thread \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/20451-0-23-Ferram-Aerospace-Research-v0-12-3-Aero-Fixes-For-Planes-Rockets-12-17\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E and engaging in a good long chat with him as he is the author of the much loved Ferram Aerospace Research mod. It is likely that when Squad is ready they will at least consult with him when they decide to upgrade the aerodynamics, if not hire him to code it for them outright. He\u0027s a very smart, cool (albeit opinionated heheheh) dude and in my experience quite approachable. A good person to talk to about the likelihood of any of the OP\u0027s suggestions being implemented.\u003C/p\u003E\u003Cp\u003EAs for game engines, Squad is not going to switch game engines. Period. Will never happen. There\u0027s too many man-hours invested in the game and the community would literally tear Squad apart for the massive delay it would incur (asset recreation, all the code would need to be redone for the new engine, the interface would have to be rebuilt, plus delays, delays, delays!). Don\u0027t believe me? Ask a veteran of Frostiken\u0027s old thread back in April or May (sorry newcomers, it\u0027s buried in the \u0022mods only\u0022 portion of the archives) about how delays coupled with some basic PR mismanagement (and admittedly also fueled by the expansion comment fiasco of a few days earlier) nearly caused the community to fracture irreparably and would have had far reaching consequences for Squad\u0027s reputation as a marketing company if they hadn\u0027t gotten their act together within days of that thread starting. I honestly couldn\u0027t see KSP surviving such a delay even if they switched to an optimized 64bit engine, implemented N-Body and gave us BE Theory, because nobody would be willing to wait that long to get virtually the same gameplay experience as before, even if it was a little better and a little shinier and we had actual Lagrange Points.\u003C/p\u003E\u003Cp\u003ENow, KSP 2.0 on the other hand... I could see them doing that for the next version 5 or 6 years from now.\u003C/p\u003E\n"}]}