{"TopicId":58367,"ForumId":55,"TopicTitle":"Control thrust limiter (increase/decrease) with action groups.","CreatedByName":"check","CreatedById":71875,"CreatedDateTime":"2013-12-31T09:05:47Z","PageNum":1,"Articles":[{"CreatedByName":"check","CreatedById":71875,"CreatedDateTime":"2013-12-31T09:05:47Z","Content":"\n\u003Cp\u003ENow that we have the ability to set a thrust limit on individual engines, ir\u0027d be a good idea if we could assign a way to increase or decrease the thrust limiter using the action groups.\u003C/p\u003E\u003Cp\u003EIE, you control throttle settings with shift and ctrl as you normally would, but you could use the 1 and 2 keys to increase/decrease the max thrust on the engines that you assign to those action group keys.\u003C/p\u003E\u003Cp\u003EThat is all.\u003C/p\u003E\n"},{"CreatedByName":"TheBadAstronomer","CreatedById":89508,"CreatedDateTime":"2013-12-31T18:31:51Z","Content":"\n\u003Cp\u003EInteresting idea, as this would make it faster than right-clicking on a part and adjusting it there.\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2014-04-28T13:57:45Z","Content":"\n\u003Cp\u003EIt would also make assymmetric vehicles such as a space shuttle or Buran shuttle to be easier to build.\u003C/p\u003E\n"},{"CreatedByName":"tutrakan4e","CreatedById":100818,"CreatedDateTime":"2014-04-28T14:19:52Z","Content":"\n\u003Cp\u003EIf this is implement, we should be able to change the lights\u0027 colours so we can make a disco rocket \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-28T14:19:53Z","Content":"\n\u003Cp\u003EGood for multiple engine configurations, too, where right clicking is difficult to do quickly enough.\u003C/p\u003E\n"},{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-04-28T21:28:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EGood for multiple engine configurations, too, where right clicking is difficult to do quickly enough.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis more than anything. It is what prompted me to make this suggestion in the past.\u003C/p\u003E\u003Cp\u003EEither a toggle, or throttlable thrust limiter would be great.\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2014-04-28T21:41:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tutrakan4e\u0022 data-cite=\u0022tutrakan4e\u0022\u003E\u003Cdiv\u003EIf this is implement, we should be able to change the lights\u0027 colours so we can make a disco rocket \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, you can already do that in the ARM update, just go to the VAB and right click the lights, then move the slider for the RGB hues.\u003C/p\u003E\n"},{"CreatedByName":"tutrakan4e","CreatedById":100818,"CreatedDateTime":"2014-04-29T12:26:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SDIR\u0022 data-cite=\u0022SDIR\u0022\u003E\u003Cdiv\u003EActually, you can already do that in the ARM update, just go to the VAB and right click the lights, then move the slider for the RGB hues.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI meant doing it in-flight, so when you press 1 the light turns red, 2 and the light turns blue for example.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-04-29T15:09:05Z","Content":"\n\u003Cp\u003EIt\u0027d also be really useful in accident scenarios where you lose one of your engines (how careless!), and you have to try to rebalance thrust, or something similar.\u003C/p\u003E\n"},{"CreatedByName":"Andrew Hansen","CreatedById":82311,"CreatedDateTime":"2014-04-29T23:19:56Z","Content":"\n\u003Cp\u003ESince there is no \u0022Me too\u0022 button in the suggestions page, I will have to post my \u0022Me too\u0022 in a reply to this thread.\u003C/p\u003E\u003Cp\u003EGood idea!\u003C/p\u003E\u003Cp\u003EAnyway, I\u0027m sure that more and more options will be added to Tweakables in future updates, and this should be one of them. Another one should be adding the option to \u0022Control from here\u0022 from different probe cores and capsules in the action group editor.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-04-29T23:37:33Z","Content":"\n\u003Cp\u003Eyet another case for analog action groups.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-05-20T04:22:37Z","Content":"\n\u003Cp\u003E*bump* found this with Google, describes exactly what I would want as well. I\u0027m looking to build a hybrid jet/electric aircraft and right now I can only use one engine since managing two is tough. Although, I found that alt\u002Bright click to bring up both tweakable menus at the same time does help\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-05-20T04:59:39Z","Content":"\n\u003Cp\u003Ei want analog action groups for this kinda thing. bind axis to one or more of those tweak bars.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-20T06:17:58Z","Content":"\n\u003Cp\u003EI\u0027d much rather use something like Throttle Controlled Avionics and offload all that busywork. What are you going to use manual thrust controls for? Manoeuvring? Why not just let some code do vary the thrust for you so you have that control with the normal buttons?\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-05-21T04:07:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022phoenix_ca\u0022 data-cite=\u0022phoenix_ca\u0022\u003E\u003Cdiv\u003EWhat are you going to use manual thrust controls for?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI need it for my hybrid jet/electric prop plane. Jets do the heavy work to get the aircraft up, then they can throttle way back in cruise and let the props take up more of the load. It\u0027s also good to have an easy way to manually control thrust now that FAR enables destruction via aerodynamic pressure. For example, a drop probe I outfit for science gathering around Kerbin can\u0027t survive more than 6,500Pa before its probe core is ripped off. So rather than having to watch my throttle every time I take off, I can just figure out what thrust setting works to keep Q under 6.5kPa and throttle up to 100% without worrying about damage. Then I can tweak the thrust as I fly rather than the throttle.\u003C/p\u003E\u003Cp\u003EEdit: Nevermind, I actually \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/38069-0-23-5-Davon-Throttle-Control-systems-mod\u0022 rel=\u0022external nofollow\u0022\u003Efound this\u003C/a\u003E through the Throttle Controlled Avionics thread. I KNEW I had seen this mod a while ago but when I found TCA I figured that was what it was and stopped looking further. Sweet!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-21T04:13:22Z\u0022 title=\u002205/21/2014 04:13  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 21, 2014\u003C/time\u003E by Gaiiden\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-05-21T04:33:23Z","Content":"\n\u003Cp\u003EI think we need a better action group system before this. It\u0027s a good idea but action groups are to limiting at the moment.\u003C/p\u003E\n"},{"CreatedByName":"Vindelle_Sunveam","CreatedById":70755,"CreatedDateTime":"2014-05-21T09:11:57Z","Content":"\n\u003Cp\u003ECannot we simply have a modifier button to press while holding Ctrl or Shift ? It would work similarly to the trim adjustments (Alt\u002BS/W).\u003C/p\u003E\u003Cp\u003EI understand that it cannot be the Alt modifier because alt\u002BShift would cause major problems for people using different keyboard layouts, but there still can be an analog solution insn\u0027t it ?\u003C/p\u003E\u003Cp\u003EAs modifier\u002BCtrl would look and be used like trim, it wouldn\u0027t be hard to adapt to this new mechanic \u003Cem\u003Eand\u003C/em\u003E would not make the action groups do things they are not supposed to (they are toogle buttons, not \u0022dial\u0022 commands like WASD, ctrl \u0026amp; shift).\u003C/p\u003E\u003Cp\u003EThat is my take, what do you think of it ?\u003C/p\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2014-05-21T13:53:05Z","Content":"\n\u003Cp\u003EYou\u0027re right that action groups are meant as toggles. So instead of limiting thrust, it would be nice to select/deselect individual engines or in groups. I had such a keyboard layout for myself flying 4 engined WW2 bombers in IL2 1946: keys 1 to 4 select/deselect an engine, after that I could control them individually with prop pitch, throttle, mixture and cooling flaps.\u003C/p\u003E\u003Cp\u003EThis is nice for rockets/planes with a limited amount of engines. Highest number of rocket engines I once had was 96 or so.\u003C/p\u003E\n"},{"CreatedByName":"Clark248","CreatedById":135355,"CreatedDateTime":"2015-01-17T22:20:46Z","Content":"\n\u003Cp\u003EI was just gonna post this idea when I saw this one. This would be great because adjusting the thrust limiter manually on multiple engines means that your thrust is gonna be off balance while you\u0027re making the adjustments. If you could adjust all at once or shift all of them at once with an action group it would make things so much better.\u003C/p\u003E\n"}]}