{"TopicId":58970,"ForumId":55,"TopicTitle":"Bigger NERVA","CreatedByName":"guest91111","CreatedById":72137,"CreatedDateTime":"2014-01-05T18:08:58Z","PageNum":1,"Articles":[{"CreatedByName":"guest91111","CreatedById":72137,"CreatedDateTime":"2014-01-05T18:08:58Z","Content":"\n\u003Cp\u003EI had the idea to make a very long space-stationy kind of ship to put around all the planets \u002B moons of the kerbol system, but the problem was that I would get burn times of 30 minutes with the standard NERVA (Nuclear) engine, and because I had time dilation, it would take me about 1-2 hours of burning at Periapsis. Now you can say the following things:\u003C/p\u003E\u003Cp\u003E1. Build a smaller space stationship\u003C/p\u003E\u003Cp\u003E2. Use mods\u003C/p\u003E\u003Cp\u003E3. Send the space station in parts to the planets/moons\u003C/p\u003E\u003Cp\u003E4. Bigger size doesn\u0027t mean quicker acceleration\u003C/p\u003E\u003Cp\u003EAnswer to 1:\u003C/p\u003E\u003Cp\u003EI have a standard minimum for space stations, which make it hard to make a very light space station (5 parkings spaces for 7 kerbal-soyuz space ships, 5-10 orange tanks of fuel, 1 orange-tank-equivalent of both RCS and Xenon, living space for 25-50 kerbals, a radio spire, and a huge radio spire to (pretend that) I\u0027m connected to all the other space station ships and earth)\u003C/p\u003E\u003Cp\u003EAnswer to 2:\u003C/p\u003E\u003Cp\u003EI don\u0027t really want to wait for mods to be updated to a next version, and it\u0027ll make a lot of save files where I use the mods unusable\u003C/p\u003E\u003Cp\u003EAnswer to 3:\u003C/p\u003E\u003Cp\u003EI don\u0027t have a lot of time on my hands.\u003C/p\u003E\u003Cp\u003EAnswer to 4:\u003C/p\u003E\u003Cp\u003EIf the TWR is higher, it does! So for example (Standard NERVA: 60KN/2250kg -\u0026gt; TWR = 2.7. NovaPunch NERVA: 300KN/9500kg -\u0026gt; TWR = 3.2.) I know I\u0027m comparing with mods right now, but it would be nice if there would be a comparable thing in the vanilla game, so I don\u0027t have to wait for the mods to become compatible with the newest version of the game.\u003C/p\u003E\n"},{"CreatedByName":"Comrade Jenkens","CreatedById":59544,"CreatedDateTime":"2014-01-05T18:16:09Z","Content":"\n\u003Cp\u003EThey need to add the KSPX 2.5m NERVA to the stock game. They have added most parts from it already so why not that one?\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-01-05T18:25:07Z","Content":"\n\u003Cp\u003EWhile I agree that the bigger NERVA should be in the game, your restrictions (you want huge stuff, don\u0027t have spare time, and won\u0027t use mods) seem to be at cross purposes.\u003C/p\u003E\u003Cp\u003EI have 16\u002B mods and I was playing 0.23 within 12 hours of its release. Not due to the mods, but because I was asleep when it was released. Some of the mods I had didn\u0027t work right away but none of the ones with parts were delayed much. I\u0027m pretty sure if you install one mod for one part, you\u0027ll be fine.\u003C/p\u003E\u003Cp\u003EEspecially if, when you get your 700 ton space station to Laythe, you dump the transfer rocket into Jool\u0027s atmosphere like a space program would \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RadHazard","CreatedById":80815,"CreatedDateTime":"2014-01-06T01:07:11Z","Content":"\n\u003Cp\u003EA bigger NERVA would be nice to keep part count down and to help with asthetics, but you should be able to use LV-N clusters to get the same effect. If your space stations are that large, most of your mass is going to be payload and fuel anyway. 29 LV-Ns and 415 tons of fuel would get you 5000m/s of dV at around 0.2 TWR, assuming your stations mass in at around 400 tons (based on your description of 10 orange tanks of fuel \u002B 1 orange tank\u0027s worth of other stuff). 29 LV-Ns is only 65.25 tons, which is featherweight in comparison to the total ship mass of about 880 tons.\u003C/p\u003E\u003Cp\u003EIF you use the larger and slightly better engine you mentioned (9.5 t, 300 kN, and I assume the same 800 s ISP), you can get the same dV and TWR with 6 engines and 405 tons of fuel. That gives you a total mass of 860 tons, only a 20-ton savings.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-01-06T01:26:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RadHazard\u0022 data-cite=\u0022RadHazard\u0022\u003E\u003Cdiv\u003E...only a 20-ton savings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich on the ground, probably means a 200 ton saving in launch mass, as a very rough guesstimate.\u003C/p\u003E\u003Cp\u003EI would certainly like to see a 2.5m nuke engine of some sorts. One hour (in game-time rather than real-time, even worse!) burns make me sadface. I tend to get around it by building monsters like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i267.photobucket.com/albums/ii282/technicalfool/misc%20KSP/screenshot198_zps34133e5c.png~original\u0022 alt=\u0022screenshot198_zps34133e5c.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003E...which makes me happyface. Yes, yes, that was the sandboxed mechjeb-equipped version. Call it a test for the career version if you like.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-06T01:32:11Z\u0022 title=\u002201/06/2014 01:32  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 6, 2014\u003C/time\u003E by technicalfool\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ravenchant","CreatedById":84260,"CreatedDateTime":"2014-01-06T21:42:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022guest91111\u0022 data-cite=\u0022guest91111\u0022\u003E\u003Cdiv\u003E(5 parkings spaces for 7 kerbal-soyuz space ships, 5-10 orange tanks of fuel, 1 orange-tank-equivalent of both RCS and Xenon, living space for 25-50 kerbals, a radio spire, and a huge radio spire to (pretend that) I\u0027m connected to all the other space station ships and earth)\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022guest91111\u0022 data-cite=\u0022guest91111\u0022\u003E\u003Cdiv\u003EI don\u0027t have a lot of time on my hands.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDude, in the time it takes you to build a launch vehicle and transfer stage for one of these monstrosities, you could probably have it assembled and in Jool orbit already \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow about using the stations\u0027 own fuel for the transfer and then sending a tanker or two to top it up once it arrives? (at least that\u0027s what I do from time to time)\u003C/p\u003E\n"},{"CreatedByName":"guest91111","CreatedById":72137,"CreatedDateTime":"2014-01-07T16:47:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ravenchant\u0022 data-cite=\u0022Ravenchant\u0022\u003E\u003Cdiv\u003EDude, in the time it takes you to build a launch vehicle and transfer stage for one of these monstrosities, you could probably have it assembled and in Jool orbit already \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E (at least that\u0027s what I do from time to time)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI use launchers to launch parts of it in Kerbin orbit, assemble it there and then launch it all in one to Jool, but I literally don\u0027t have the time to make all the parts go to Jool, Aerobrake them and assemble them.\u003C/p\u003E\n"},{"CreatedByName":"RadHazard","CreatedById":80815,"CreatedDateTime":"2014-01-07T22:41:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EWhich on the ground, probably means a 200 ton saving in launch mass, as a very rough guesstimate.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA fair point. However, you will still need to lift the other 860 tons, which would take somewhere around 8600 tons of launch mass. Either way, it\u0027s roughly a 2% mass savings.\u003C/p\u003E\u003Cp\u003EA 2.5m NERVA would be good for saving on part count (which is always good), but otherwise it\u0027s possible to build a ship with very similar performance right now.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-01-07T23:28:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Comrade Jenkens\u0022 data-cite=\u0022Comrade Jenkens\u0022\u003E\u003Cdiv\u003EThey need to add the KSPX 2.5m NERVA to the stock game. They have added most parts from it already so why not that one?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKSPX NERVA you say?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.com/a/img690/980/wju.png\u0022 alt=\u0022wju.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWonderful things. This would take roughly 30 stock NERVAs clustered to do the same time. Even still, the ejection burn for Jool was stupidly high. Bear in mind that this setup is just some tanker modules, not actual payload (though the fuel module is necessary to get to Jool with any amount of payload).\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-01-08T07:29:44Z","Content":"\n\u003Cp\u003EThis is very needed. Heck, I even made my own \u0022Husky\u0022 nuke useinf\u003C/p\u003E\u003Cp\u003Eg the poodles model and modding mass, thrust and Isp to that of the NERVA.\u003C/p\u003E\n"}]}