{"TopicId":59544,"ForumId":55,"TopicTitle":"Transfer fuel between more than two fuel tanks.","CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2014-01-10T16:28:24Z","PageNum":1,"Articles":[{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2014-01-10T16:28:24Z","Content":"\n\u003Cp\u003EAs far as I can tell, there seems to be little to no difference between whether you use the \u0027IN\u0027 or the \u0027OUT\u0027 buttons on fuel tanks. Furthermore, you can only use two tanks at a time, which can make it near-impossible to balance tanks when you are trying to take fuel from one tank and divide it equally into two or more others.\u003C/p\u003E\u003Cp\u003ETherefore I would like to propose a re-design to the fuel transferring system. The whole system uses a very simple rule: \u003Cspan style=\u0022text-decoration:underline;\u0022\u003EEqually (by amount) divide the fuel between all other selected tanks when a given button is pressed.\u003C/span\u003E Odd numbers will prioritize the first tank selected to have fuel drained into. To make the system work, this will require all tanks of fuel to have the same transferring rates.\u003C/p\u003E\u003Cp\u003EExamples:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETanks A, B, and C are selected. The user hits the OUT button on tank A. Fuel is drained from tank A and equally split between B and C.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETanks A, B, and C are selected. The user hits the IN button on tank A. Fuel is drained equally from tank B and C into tank A.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-10T16:34:51Z\u0022 title=\u002201/10/2014 04:34  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 10, 2014\u003C/time\u003E by Themohawkninja\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Atoning Unifex","CreatedById":58766,"CreatedDateTime":"2014-01-10T16:42:44Z","Content":"\n\u003Cp\u003EYes, the fuel management system needs looking at to enable balancing and so on. In the meantime (and I hate to do this with the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65490-We-know-mods-exist\u0022 rel=\u0022external nofollow\u0022\u003EWe know mode exist\u003C/a\u003E discussion going on) there is a mod for that!\u003C/p\u003E\u003Cp\u003EThe \u003Ca href=\u0022http://kerbalspaceprogram.com/tac-fuel-balancer-v1-0/\u0022 rel=\u0022external nofollow\u0022\u003ETAC Fuel Balancer\u003C/a\u003E allows pretty good control over all the tanks on your craft. Not perfect but serves the purpose!\u003C/p\u003E\n"}]}