{"TopicId":59782,"ForumId":55,"TopicTitle":"De-symmetrize parts in editor","CreatedByName":"fatcargo","CreatedById":93302,"CreatedDateTime":"2014-01-12T21:05:27Z","PageNum":1,"Articles":[{"CreatedByName":"fatcargo","CreatedById":93302,"CreatedDateTime":"2014-01-12T21:05:27Z","Content":"\n\u003Cp\u003EAdd ability to convert symmetry part to real standalone parts, as if two were placed individually.\u003C/p\u003E\n"},{"CreatedByName":"TwoHedWlf","CreatedById":7163,"CreatedDateTime":"2014-01-12T23:27:25Z","Content":"\n\u003Cp\u003EI don\u0027t know what you mean. You can place parts without symmetry, or you can place them without symmetry, X cycles through the options. \u003C/p\u003E\u003Cp\u003EOr are you wanting to be able to, say have 4 parts placed symmetrically around a tank and be able to click on a single one and move it without moving the other 3? Rather than having to go and place each of the 4 individually?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-01-13T00:00:43Z","Content":"\n\u003Cp\u003EI think the latter is the request... though I can really only think of a handful of situations where it\u0027d be anywhere near useful off the top of my head.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2014-01-13T00:03:48Z","Content":"\n\u003Cp\u003Ethe only time i can think such an ability would be viable is in the placement of say batteries or something that would have no atmospheric drag, because honestly, if it takes on a drag force, its gonna do bad things if its not symmetrical :S\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-13T00:07:37Z","Content":"\n\u003Cp\u003EI think the post was asking for the ability to pick up just one part from a group of parts that were placed as part of a symmetrical set, leaving the other parts behind.\u003C/p\u003E\u003Cp\u003ESo you put down one girder with 6-way symmetry turned on, then want to remove just one of the girders, leaving the other 5 behind, rather than removing all 6 when you pick one up. To active this, you\u0027d have some sort of ability to hit a key or click a context menu that would \u0022remove the symmetry\u0022 from a group of symmetrically placed parts. What this would mean is that the game would, instead of saying \u0022this is a single part that was cloned 5 times.\u0022, it would now say \u0022there are now 6 individual parts here that have nothing to do with each other. They just happen to be currently placed in a symmetrical pattern purely by \u0027coincidence\u0027.\u0022\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2014-01-13T00:07:49Z","Content":"\n\u003Cp\u003EI would use this very frequently. I\u0027m constantly thinking of my rocket designs in terms of the nearest symmetric design and it would be very handy to have this.\u003C/p\u003E\n"},{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-01-13T00:10:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TwoHedWlf\u0022 data-cite=\u0022TwoHedWlf\u0022\u003E\u003Cdiv\u003EOr are you wanting to be able to, say have 4 parts placed symmetrically around a tank and be able to click on a single one and move it without moving the other 3? Rather than having to go and place each of the 4 individually?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would like this very much. It may seem like a small thing, but I find myself more often than not wanting to place a different part on just one side of a quad symmetry arrangement. Being the stubborn perfectionist that I am, I just can\u0027t deal with placing the other three parts separately.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-13T00:14:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022 data-cite=\u0022AlamoVampire\u0022\u003E\u003Cdiv\u003Ethe only time i can think such an ability would be viable is in the placement of say batteries or something that would have no atmospheric drag, because honestly, if it takes on a drag force, its gonna do bad things if its not symmetrical :S\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt would be very handy for setting up asparagus staging. Right now if you want, say, a ring of 6 asparagus staged sections, you actually have to make 3 separate pairs of 2 sections each, and manually eyeball it to get the symmetry right between the 3 sets, or else the symmetry is all wrong when placing the yellow fuel hoses and they end up being placed with 6-way symmetry. What this would open up is the chance to place the sections using 6-way symmetry, then break the group up into 6 separate parts for the purpose of placing the hoses individually.\u003C/p\u003E\u003Cp\u003EAnother thing it would do is allow you to make x-wing symmetry. i.e. you place with 6-way symmetry, then remove a pair of two opposite parts, leaving 4 behind, so the 4 are placed at \u0027compass points\u0027 60,120, 240, 300 rather than at 0,90,180,270.\u003C/p\u003E\u003Cp\u003EBut I think the mess that it would create probably outweighs the benefits. Once you \u0022split symmetry\u0022 like this you wouldn\u0027t be able to re-join it if you change your mind.\u003C/p\u003E\n"},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2014-01-13T00:24:21Z","Content":"\n\u003Cp\u003EI would like to have this feature too:\u003C/p\u003E\u003Cp\u003Esituation: I have a subassemly-module: docking port, bunch of girders, command module, docking port, and on the side, there are 4 girders \u002Bdocking ports in 4x and in 2x symmetry aswell for modules to attach.\u003C/p\u003E\u003Cp\u003Eand I frequently attach 2 different types of ships (landers, probes, as subassemblies) to these side-ports. and I\u0027d like to change the symmetry of that stuff if necessary.\u003C/p\u003E\u003Cp\u003EEDIT: another thing I\u0027d like to see: exchange one object with another one. for example: a plane with a lot of stuff on one fuselage. and I\u0027d like to exchange the fuselage with a rocket tank. or at a rocket: I\u0027d like to exchange one tank with another without harming the radial decouplers.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-13T00:26:30Z\u0022 title=\u002201/13/2014 12:26  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 13, 2014\u003C/time\u003E by Hotblack Desiato\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fatcargo","CreatedById":93302,"CreatedDateTime":"2014-01-13T19:08:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnother thing it would do is allow you to make x-wing symmetry. i.e. you place with 6-way symmetry, then remove a pair of two opposite parts, leaving 4 behind, so the 4 are placed at \u0027compass points\u0027 60,120, 240, 300 rather than at 0,90,180,270.\u003C/p\u003E\u003Cp\u003EBut I think the mess that it would create probably outweighs the benefits. Once you \u0022split symmetry\u0022 like this you wouldn\u0027t be able to re-join it if you change your mind.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is also my idea behind de-symmetrizing. And also i thought of problematic situation where builder would select a part that has children and then whole hierarchy is copied to \u0022real\u0022 parts, so any attempt later on add symmetrical geometry will end up on single selected part.\u003C/p\u003E\u003Cp\u003EAlso, this could be avoided altogether if parts could have more than just even-spread part symmetry, but also have other modes (like the above \u0022x-wing\u0022 style for example). Ability to rotate parts once set on their parent\u0027s nodes/surfaces would also greatly help creating perfectly matched part groups, personally it would help my SPH lifter designs.\u003C/p\u003E\u003Cp\u003EThe \u0022x-wing\u0022 alternate symmetry mode could be realised as this : builder selects as usual a symmetry count, target part and parent part. Now, by using a hotkey builder can choose to \u0022squeeze\u0022 parts along a single axis perpendicular to symmetry axis, and then as usual use mouse to rotate this axis. \u003C/p\u003E\u003Cp\u003EThis symmetry mode would for part placement assume not a normal circle, but an ellipse, where target parts would be closely \u0022bunched\u0022 together at points of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Ellipse#Elements_of_an_ellipse\u0022 rel=\u0022external nofollow\u0022\u003Etransverse diameter\u003C/a\u003E. I just realised this only makes sense for even-numbered symmetry, odd-numbered ones would leave one part \u0022hanging\u0022.\u003C/p\u003E\u003Cp\u003EMore advanced part symmetry already is essential when making any type of lifters since amount of power used is stressing components so much that any disecrepancy creates huge torsion forces (try making a catamaran-style SPH by manually aligning parts without using symmetry, then use RCSBuildAid and it will show you a quite large torsion vector - it is a pitty that it can\u0027t analyze a design and point to a part that causes this).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-13T19:52:13Z\u0022 title=\u002201/13/2014 07:52  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 13, 2014\u003C/time\u003E by fatcargo\u003C/strong\u003E\n\u003Cbr\u003Erefining\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-13T20:10:05Z","Content":"\n\u003Cp\u003EI\u0027d really love if it was possible to combine symmeties. I.e. place e.g. in symmetry-2 on symmetry-6 part.\u003C/p\u003E\u003Cp\u003EOr have a part placed in symmetry-6 and break it up into three symmetry-2 groups, so they remain placed equally but I can put the part into action groups in couples instead of all six at once.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-13T20:17:36Z\u0022 title=\u002201/13/2014 08:17  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 13, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fatcargo","CreatedById":93302,"CreatedDateTime":"2014-01-13T20:39:18Z","Content":"\n\u003Cp\u003EHere is what i mean \u0022x-wing\u0022 symmetry mode.\u003C/p\u003E\u003Cp\u003ENormal radial\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Rzr1Twpl.png\u0022 alt=\u0022Rzr1Twpl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022X-Wing\u0022 type\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VscvARwl.png\u0022 alt=\u0022VscvARwl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT: Ugh, i just realized i hijacked my own thread with this OT, i guess that\u0027s a price to pay when developing ideas... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-13T20:44:18Z\u0022 title=\u002201/13/2014 08:44  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 13, 2014\u003C/time\u003E by fatcargo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2014-01-13T20:41:21Z","Content":"\n\u003Cp\u003EYou can do it already using EditorTools mod. Just set snap angle to whatever you need to depending on what kind of \u0022symmetry\u0022 you need - and here you go - your cursor would only snap at correct locations.\u003C/p\u003E\n"}]}