{"TopicId":59871,"ForumId":55,"TopicTitle":"Maneuver Mode","CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2014-01-13T18:41:32Z","PageNum":1,"Articles":[{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2014-01-13T18:41:32Z","Content":"\n\u003Cp\u003EThis would be a variation to the Map Mode that would activate a few features useful when planning maneuvers.\u003C/p\u003E\u003Cp\u003E-\u003Cstrong\u003EAll objects besides the planets, the active ship, and the target ship (if selected) would be hidden.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-\u003Cstrong\u003EThe maneuver node would never collapse until you hit a \u0022Collapse Maneuver Node\u0022 button. \u003C/strong\u003ECurrently, if you\u0027re planning an ejection burn it\u0027s often useful to zoom out to find your closest approach indicators and target but if you\u0027re not careful the maneuver node will collapse which means you have to zoom all the way in again, click the node, then zoom back out. The \u0022Collapse Maneuver Node\u0022 button would allow you to set up two or more maneuvers without the clutter of each one always being active, while preventing them from collapsing accidentally.\u003C/p\u003E\u003Cp\u003E-\u003Cstrong\u003EYou are given the option to pause time but still manipulate the maneuver node(s). \u003C/strong\u003ECurrently, if you just click and hold a maneuver node you may notice your trajectory changing ever so slightly. I presume this is due to the passage of time and therefore the maneuver node slipping along the trajectory.\u003C/p\u003E\u003Cp\u003E-\u003Cstrong\u003ETrajectories are calculated with extra resolution for more convenient node placement. \u003C/strong\u003ECurrently if a ship is entering a new SOI it can be difficult to place a maneuver node before the SOI change as KSP tries to place the node a whole revolution later (blue verse purple). Also, if you\u0027re transiting through Duna\u0027s SOI for example and trying to plan an aerobrake, you may notice there are a discreet number of maneuver node positions available between you and Duna; this usually isn\u0027t as much an inconvenience as it is ugly. I understand trajectories can\u0027t be displayed with absolutely smooth resolution all the time due to performance considerations, but in certain circumstances I have to believe you can boost the resolution selectively as outlined above.\u003C/p\u003E\u003Cp\u003EThese are ideas to address playability issues I\u0027ve run up against. I would love your thoughts, especially if you have additional features or behavior that would round out \u0022Maneuver Mode\u0022 as a feature.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-13T18:45:44Z","Content":"\n\u003Cp\u003EYou can un-collapse your maneuver node even if you\u0027re zoomed out if you click on that star that remains after collapsed maneuver. The thing is, you usually click on all sorts of apoapses and periapses at the same time, too, and they all highlight making a yellow mess near that maneuver.\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2014-01-13T19:14:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EYou can un-collapse your maneuver node even if you\u0027re zoomed out if you click on that star that remains after collapsed maneuver. The thing is, you usually click on all sorts of apoapses and periapses at the same time, too, and they all highlight making a yellow mess near that maneuver.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EToo true. In theory you can un-collapse it but in my experience - and I don\u0027t imagine my experience is so unique - it is practically impossible to un-collapse the node when you\u0027re zoomed out.\u003C/p\u003E\u003Cp\u003EYou can\u0027t make a new \u0022mode\u0022 as the answer to every inconvenience, but I feel the problems I outlined above demonstrate a lack of polish such that a dedicated \u0022Maneuver Mode\u0022 is plausible enough to discuss/brainstorm.\u003C/p\u003E\n"}]}