{"TopicId":60124,"ForumId":55,"TopicTitle":"What do YOU want to see in 0.24?","CreatedByName":"MaverickSawyer","CreatedById":11952,"CreatedDateTime":"2014-01-16T07:26:16Z","PageNum":8,"Articles":[{"CreatedByName":"MSD","CreatedById":59320,"CreatedDateTime":"2014-02-14T23:22:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyHook\u0022 data-cite=\u0022SkyHook\u0022\u003E\u003Cdiv\u003EI really want kerbals to take the lead in the next update....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree totally, in the meantime, check out: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57603-0-23-RasterPropMonitor-make-your-IVA-a-glass-cockpit-%28v0-14%29-24-Jan\u0022 rel=\u0022external nofollow\u0022\u003ERasterPropMonitor Mod\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELanding on the mun without using the map view is so awesome!\u003C/p\u003E\n"},{"CreatedByName":"Shna_na","CreatedById":14950,"CreatedDateTime":"2014-02-15T02:35:23Z","Content":"\n\u003Cp\u003EI know it says not to suggest some of these, but that\u0027s because they\u0027re coming at some point. The reason I\u0027m saying them is because this isn\u0027t a suggestion, it\u0027s simply what I\u0027d like to see in the next update based on what the Devs have mentioned. I\u0027ll try to be realistic:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EPayload Fairings\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe NASA mission (yes, that\u0027s coming in 0.23.10, but they\u0027ve said that the two updates will be released nearby each other).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore biomes on other bodies\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEnhancements to current biomes (in terms of science -at the moment you get as much science from walking a few meters to the grasslands as you do from going to the poles)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EContracts\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECurrency\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore parts (just throwing it out there because it happens in most major updates anyway)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnd now for the less likely stuff that may or may not have already been mentioned:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECost of Kerbals (and a Kerbal wage, maybe?)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EStupidity and courage have an effect on things\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EPayload assembly building\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIn-game parts designer (basic for now, maybe just fuel tanks)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESomething to do with this whole asteroid landing malarkey (maybe adding an asteroid, or parts that are related to the mission)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMore science-related parts\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDisclaimer\u003C/strong\u003E\u003Csup\u003E\u003Cstrong\u003E1\u003C/strong\u003E\u003C/sup\u003E\u003Cstrong\u003E:\u003C/strong\u003E I am in no way saying that \u003Cem\u003Eall\u003C/em\u003E of these should/may be included in the next update - but hopefully the majority of, if not all, of those in the first section will be.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDisclaimer\u003C/strong\u003E\u003Csup\u003E\u003Cstrong\u003E2\u003C/strong\u003E\u003C/sup\u003E\u003Cstrong\u003E:\u003C/strong\u003E Things that have been said in this post are not suggestions but are predictions of what I believe the developers will be adding in the next few major updates, therefore I have broke no \u0022what not to suggest\u0022 rules.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-17T16:26:15Z\u0022 title=\u002203/17/2014 04:26  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 17, 2014\u003C/time\u003E by Shna_na\u003C/strong\u003E\n\u003Cbr\u003ETweaked it.\n\u003C/span\u003E\n"},{"CreatedByName":"Fel","CreatedById":57121,"CreatedDateTime":"2014-03-16T23:16:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tetryds\u0022 data-cite=\u0022tetryds\u0022\u003E\u003Cdiv\u003EI want that time becomes an important factor on the career mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003Ewhen a mission to eeloo can take 3 years i must disagree.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow does that change anything? You\u0027re practically saying that because time-management would be important you don\u0027t want it to be important, but as Harvester had stated (Err, a year ago), Career mode would have you launching that Rocket to Eeloo and then doing other \u0022smaller things\u0022 while it travels there. It would require an implementation of Kerbal Alarm Clock, but making time mean something is not an inherently bad idea... just an idea that causes \u0022changes\u0022.\u003C/p\u003E\u003Cp\u003E*Err, right, this is a month old... my bad!\u003C/p\u003E\n"},{"CreatedByName":"Shna_na","CreatedById":14950,"CreatedDateTime":"2014-03-17T16:29:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fel\u0022 data-cite=\u0022Fel\u0022\u003E\u003Cdiv\u003ECareer mode would have you launching that Rocket to Eeloo and then doing other \u0022smaller things\u0022 while it travels there. It would require an implementation of Kerbal Alarm Clock, but making time mean something is not an inherently bad idea... just an idea that causes \u0022changes\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI already do this with Kerbal Alarm Clock and Kerbal Engineer installed. I don\u0027t see them as mods that stop it being the stock game, but rather as tools or employees. You know, just an extra something that a space program would have to make things quicker, there\u0027s not just one person doing everything is there?\u003C/p\u003E\n"},{"CreatedByName":"DoctorCruz","CreatedById":82890,"CreatedDateTime":"2014-03-18T19:22:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EI\u0027m excited too about contracts. I hope they\u0027re semi-randomly generated based on what you\u0027re doing currently. So if you\u0027ve got ships on their way to Jool to set up a base, you get a contract to do something on Jool, not Moho.\u003Cp\u003EI\u0027d also like to see biomes everywhere, but just expanding the selections is fine. Like, say, adding biomes to Duna, Ike, Eve, and Gilly. Then next update the 5 Joolian moons, and finally the three odd-men out.\u003C/p\u003E\u003Cp\u003EAs they add biomes (and therefore potential to get SCIENCE) I hope they increase the costs of items in the tree. Maybe not all nodes, but make the higher ones cost exponentially more. That way, you can\u0027t max out the tree before you\u0027ve left Kerbin\u0027s SOI, but you can still unlock early nodes with the science you can find around KSC. I\u0027m thinking like the first node still costs 5, the 2nd tier nodes cost around 25 instead of 20, but the last nodes cost like 2000 each. With double, triple, even quadruple the available science, that shouldn\u0027t be totally unreasonable.\u003C/p\u003E\u003Cp\u003EI\u0027d like some of the more (and less!) overpowered things tweaked. I\u0027d like a reason to use a Poodle, and a reason NOT to use 48-7S on almost everything I build. Speaking of tweaks, I\u0027d like everything possible to be tweakable, in the way TweakableEverything is doing it.\u003C/p\u003E\u003Cp\u003EAnd speaking of mods, Kerbal Engineer, PreciseNode, and SelectRoot should also be stock \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI also hope for some procedurally generated missions based on tech level and also maybe things you ave already done.\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-03-18T21:12:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scorpi15\u0022 data-cite=\u0022Scorpi15\u0022\u003E\u003Cdiv\u003ENot sure if this was suggested before, but science in sandbox ode. I don\u0027t care if it doesn\u0027t do anything, I want the reports for my story \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI second this... The no science part keeps me away from playing sandboxed games... and i would like to see the science building open too... it would be ok, if the tech tree remains locked in sandbox as it makes no sense there, but the experiment reports should be accessible as well.\u003C/p\u003E\n"},{"CreatedByName":"Guiltyspark","CreatedById":105295,"CreatedDateTime":"2014-03-22T20:48:58Z","Content":"\n\u003Cp\u003EThe only things I critically want are:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EStorage of multiple quicksaves/autosaves and, upon holding F9, an interface to choose one to load\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIndication that the hatch of a capsule is blocked in VAB or SPH\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFixing \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/62781-KSP-23-VAB-stealth-crashes-game\u0022 rel=\u0022external nofollow\u0022\u003Ethis bug\u003C/a\u003E that causes Mac users to crash in VAB and lose progress spent on building vehicles (a little selfish for us mac users, but definitely necessary)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFixing parts glitching partially through terrain\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EOptimizing terrain rendering and fixing the WATER LAG (current workarounds change the height sea level displays at). Also, how about reducing water rendering distance?\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThese *seem* like they wouldn\u0027t take all that long. Emphasis on *seem* as I don\u0027t know exactly what needs to be changed for them to work.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-22T21:14:42Z\u0022 title=\u002203/22/2014 09:14  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 22, 2014\u003C/time\u003E by Guiltyspark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TYRT","CreatedById":72285,"CreatedDateTime":"2014-03-22T21:27:22Z","Content":"\n\u003Cp\u003EMK3 and Simple big body Cargo Bay door. \u003C/p\u003E\u003Cp\u003EOxidizer into Jet Fuselages:) I really want to see this oxidizer idea.\u003C/p\u003E\n"},{"CreatedByName":"Rizendell","CreatedById":67958,"CreatedDateTime":"2014-03-23T01:39:03Z","Content":"\n\u003Cp\u003E64 bit windows version. and they need to fix the floating point error that causes the maneuver nodes to wobble/cause the trajectory to change over long periods of time.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-03-23T02:02:23Z","Content":"\n\u003Cp\u003Eprocedural fairings, more tank sizes and integrate stupid_chris\u0060s realchutes.\u003C/p\u003E\u003Cp\u003EA bit more animation.\u003C/p\u003E\u003Cp\u003Emore probe sized parts.\u003C/p\u003E\u003Cp\u003ESome form of powered hinge.\u003C/p\u003E\u003Cp\u003EMore tweakables. If it has a right click menu in flight, let us tweak it in the VAB.\u003C/p\u003E\n"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-03-24T04:28:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skorpychan\u0022 data-cite=\u0022Skorpychan\u0022\u003E\u003Cdiv\u003E- A reason to haul more than one kerbal around.\u003Cp\u003E- More biomes.\u003C/p\u003E\u003Cp\u003E- A reason to keep harvesting science other than the tech tree.\u003C/p\u003E\u003Cp\u003E- In-game tutorials for rendezvous and docking.\u003C/p\u003E\u003Cp\u003E- Currency/reputation system, maybe?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI admit these may be longer term suggestions than the next immediate update but I\u0027ll put them up anyway in hopes that the developers will see it.\u003C/p\u003E\u003Cp\u003EI agree with all of the above suggestions and perhaps add a souvenir room/collection where you store surface samples from planets and logs of flights or badges, medals or something to commemorate your first successful launch, first orbit, first trip to Mun, etc. \u003C/p\u003E\u003Cp\u003EObjectives in career mode, like \u0022go to the Mun, collect a surface sample and X amount of science\u0022 for which you would be rewarded with something other than just another node on the tech tree (see above suggestion). Other cool perks might be a cash bonus (government grant, unlock a special mission, etc.) if the economic system is put into place.\u003C/p\u003E\u003Cp\u003EMore functioning space ports/airports on Kerbin, populated areas on Kerbin\u003C/p\u003E\u003Cp\u003EAdd the ability to harvest resources for sale (again if the economic system is in place) or use in building or fueling your ships. Mine metals to melt down for fuselages, harvest gases from atmospheres for conversion into fuels, coolants and such.\u003C/p\u003E\n"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-03-24T04:37:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Guiltyspark\u0022 data-cite=\u0022Guiltyspark\u0022\u003E\u003Cdiv\u003EStorage of multiple quicksaves/autosaves and, upon holding F9, an interface to choose one to load\u003Cp\u003EThese *seem* like they wouldn\u0027t take all that long. Emphasis on *seem* as I don\u0027t know exactly what needs to be changed for them to work.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not a developer, but I have some programming experience, and I believe that the save game system you suggested would be fairly easy to implement. The save files themselves could just have a date-time stamp in the file name, but that\u0027s the easy part. The hard part (more time consuming than difficult) would be creating the user interface used to browse the multiple saves. KSP already has a similar feature in the VAB and SPH for saved ship and craft files, so the developers could very likely reuse the code that generates that window.\u003C/p\u003E\n"},{"CreatedByName":"neamerjell","CreatedById":86054,"CreatedDateTime":"2014-03-24T05:00:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022meteorgazer\u0022 data-cite=\u0022meteorgazer\u0022\u003E\u003Cdiv\u003EThats a big pain, too. I am looking to test all aspects. For instance, yesterday I designed a re-usable lander to land on Laythe (and subsequently, other moons of Jool), then rendezvous with the Jool station for processing and cleaning of the data/instruments and refueling to continue the exploration. Naturally it was going well until I tried to dock, and found that the RCS was poorly placed, not allowing for translational thrust, making docking take an incredibly long time, and now my calculations for the amount of mono I needed for the project will require two fueling runs all the way to Jool.\u003Cp\u003EThe idea is to reward preparation, rather than the frustrating trial and error mode we have now. I understand that the launch vehicles are easy to test, but by the time you go to a new world you should have several tried and true LV\u0027s in the subassembly tab. I mean the ability to test things in a simulated operational environment, much the way NASA does in the pool, flight simulator, and computer models.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI LOVE this idea! A simulator where you can test stuff on the fly instead of wasting hours of designing, building, launching and flying just to find out you forgot some crucial part or your lander won\u0027t make it back to Kerbin and you have to sacrifice a Kerbal. It would be sweet if there was a window you could open where you could load your lander, punch in things like starting altitude, velocity, heading, gravity, atmospheric density, etc. so you can have a way to practice and have an idea of what to expect when you actually make it to Duna, or Eve.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-03-24T06:18:20Z","Content":"\n\u003Cp\u003EI want to see GP2 \u0026amp; fuel/water resources in asteroids.\u003C/p\u003E\n"},{"CreatedByName":"Randomish","CreatedById":106260,"CreatedDateTime":"2014-03-24T15:27:54Z","Content":"\n\u003Cp\u003EI\u0027d like some kind of training system for Kerbals, and like said above, cameras. Also, more parts for unmanned missions and, just to save my personal favorite idea, maybe for future updates, ability to use these cameras to map a planet surface, and then you can go into the menu for maps you made (the quality could look different on some bits because of different cameras used, totally miscelleanous but probaly cool) and draw out and name areas (eg Crater Jebediah) so you can know exactly where are you gonna plan to land and what\u0027s nearby. Plus RP\u0027ines.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2014-03-25T11:52:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Guiltyspark\u0022 data-cite=\u0022Guiltyspark\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E[*]Optimizing terrain rendering and fixing the WATER LAG (current workarounds change the height sea level displays at). Also, how about reducing water rendering distance?\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYES. YES. YES!!! My computer has minimal RAM for KSP, and oceans just ruin the game. \u003C/p\u003E\u003Cp\u003E0.25. Let\u0027s make this real, Squad.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-03-26T12:02:46Z","Content":"\n\u003Cp\u003EWhen you make a ship and it just explodes on the pad, when you return to the VAB it would be nice for the parts that exploded first to be marked with a deep red shifting to a very pale red for the parts that exploded last.\u003C/p\u003E\u003Cp\u003EThen you would have some idea of why it exploded...\u003C/p\u003E\u003Cp\u003E(like marking prototypes with certain paint so you can recognise the parts later)\u003C/p\u003E\u003Cp\u003EAlso, for craft with a lot of parts, an option to introduce physics to them a bit slower to stop them exploding on unpack for slow machines.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-26T13:20:49Z\u0022 title=\u002203/26/2014 01:20  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 26, 2014\u003C/time\u003E by John FX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tidus Klein","CreatedById":72277,"CreatedDateTime":"2014-03-26T12:45:21Z","Content":"\n\u003Cp\u003E(\u003Cspan style=\u0022font-size:12px;\u0022\u003Estuff that may happen soon\u003C/span\u003E)\u003C/p\u003E\u003Cp\u003EBetter rover wheels, (preferably ones with tweak-able suspension or a higher travel)\u003C/p\u003E\u003Cp\u003EBetter/redone plane parts.\u003C/p\u003E\u003Cp\u003EMore IVA,s \u003C/p\u003E\u003Cp\u003ERCS build aid worked in to the stock game,( or something similar) \u003C/p\u003E\u003Cp\u003E(stuff that may happen latter) \u003C/p\u003E\u003Cp\u003EBetter aerodynamics\u003C/p\u003E\u003Cp\u003EReentry heat\u003C/p\u003E\u003Cp\u003Emore kerbal animations.\u003C/p\u003E\n"},{"CreatedByName":"karolus10","CreatedById":17876,"CreatedDateTime":"2014-03-26T15:08:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EI\u0027d like to see a hardcore/with-simulator mode. It would work like this:\u003Cp\u003E1 - You decide before launching the flight whether this will be a \u0022real\u0022 or a \u0022simulation\u0022 launch.\u003C/p\u003E\u003Cp\u003E2 - If it is \u0022simulation\u0022 then it works as normal but with this exception - a copy of your persistence file is made, and the entire mission takes place inside this copy rather than in the real mission file. This copy is thrown away when you quit the game and cannot be saved permanently. \u003C/p\u003E\u003Cp\u003E3 - If it is \u0022real\u0022 mode then it works as normal but with this exception: The \u0022revert flight\u0022 feature is disabled.\u003C/p\u003E\u003Cp\u003ESo it basically does the same thing as \u0022revert flight\u0022 except it puts WHEN to make that decision that \u0022this flight doesn\u0027t count\u0022 earlier in time. You have to decide \u0022this doesn\u0027t count\u0022 BEFORE you launch the flight. This represents the idea that you\u0027re practicing the mission, simulating bits of it ahead of time, and detecting mistakes prior to the real thing, but once you launch for real you can\u0027t undo.\u003C/p\u003E\u003Cp\u003EThat would make things like escape tower mechanisms more necessary.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like the idea of simulation mode, this could had pretty nice potential and running simulations would be less costly than blowing rockets.\u003C/p\u003E\u003Cp\u003EI see that simulation mode would had few major differences from \u0022real life\u0022.\u003C/p\u003E\u003Cp\u003E* Simulation\u0027s are not persistent, all crafts and debris disappear when simulation ends.\u003C/p\u003E\u003Cp\u003E* Minimalistic graphics of sky-box and bodies surface (for example one color sky and surface texture with grid on it)\u003C/p\u003E\u003Cp\u003E* You would had only one, flat planet but it\u0027s parameters like radius, gravity and atmosphere profile could be tweakable (\u002B presets of existing planets in kerbin system)\u003C/p\u003E\u003Cp\u003E* parts during simulation are 100% rigid and indestructible (they still can not work and wobble/break \u0022in real life\u0022 if design aren\u0027t structurally sound)\u003C/p\u003E\u003Cp\u003E* You can choose starting position in any place on surface or plotted orbit\u003C/p\u003E\u003Cp\u003EPersonally, I\u0027m looking forward into improved editor (especially action groups tab) and flight planner.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-26T15:11:01Z\u0022 title=\u002203/26/2014 03:11  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 26, 2014\u003C/time\u003E by karolus10\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2014-03-28T19:03:48Z","Content":"\n\u003Cp\u003EI need an economic challenge. Currently its far too easy to complete the research tree with unlimited parts. I need economic limitations to restrict the size of my craft and allow me to develope ingenious ways to wangle round them.\u003C/p\u003E\n"},{"CreatedByName":"PhysicsWarp","CreatedById":106980,"CreatedDateTime":"2014-03-28T22:53:58Z","Content":"\n\u003Cp\u003EI understand we are not allowed to suggest new parts, but what I would like to see is landing cushions in the upcoming update. Like the ones used on the Luna 9 lander and the Mars Pathfinder mission. I think it would make landings in some cases easier.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-03-28T23:22:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PhysicsWarp\u0022 data-cite=\u0022PhysicsWarp\u0022\u003E\u003Cdiv\u003EI understand we are not allowed to suggest new parts...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo quickly clarify: It\u0027s not a blanket ban against suggesting \u0022more parts\u0022; it\u0027s more intended to be a prohibition against suggesting \u0022More parts!\u0022 as a suggestion by itself, rather than going into detail on precisely what sorts of parts you would like to see added. So suggesting landing cushions would be just fine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"8749236","CreatedById":27470,"CreatedDateTime":"2014-03-28T23:54:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003ETo quickly clarify: It\u0027s not a blanket ban against suggesting \u0022more parts\u0022; it\u0027s more intended to be a prohibition against suggesting \u0022More parts!\u0022 as a suggestion by itself, rather than going into detail on precisely what sorts of parts you would like to see added. So suggesting landing cushions would be just fine \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPersonally I am against asking to add more parts at this stage...\u003C/p\u003E\u003Cp\u003Ejust this stage..\u003C/p\u003E\u003Cp\u003ESince making a model then creates a texture for it is a very time-consuming thing to do...\u003C/p\u003E\u003Cp\u003EWhich I prefer to suggests for more feature, then asks for more and varying parts afterwards..\u003C/p\u003E\u003Cp\u003EAlso, by that time, we probably had an precise and clear idea of what parts we want, instead of asking everything we can think of... which... will be a disaster for DEV..\u003C/p\u003E\u003Cp\u003E*** Add ***\u003C/p\u003E\u003Cp\u003EMaybe we should add an requirement of asking, why you want this part to be added, and similar...\u003C/p\u003E\u003Cp\u003EFor example...\u003C/p\u003E\u003Cp\u003EIf I want to ask for a more powerful engine...\u003C/p\u003E\u003Cp\u003EAnd the reason is: The current rocket engine are not powerful enough and too difficult for me, or I\u0027m tired of same engine...\u003C/p\u003E\u003Cp\u003EMaybe we should ignore that or consider it later?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-28T23:56:24Z\u0022 title=\u002203/28/2014 11:56  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 28, 2014\u003C/time\u003E by 8749236\u003C/strong\u003E\n\u003Cbr\u003EAdd something..\n\u003C/span\u003E\n"},{"CreatedByName":"kiwi1960","CreatedById":81697,"CreatedDateTime":"2014-03-29T07:46:32Z","Content":"\n\u003Cp\u003EI\u0027d like to see a Venus type planet added, one where if you send a lander down, well, it would need to be unmanned, but also strengthened to withstand the 80 atmospheres of pressure... I can see a whole new road of mods JUST for this planet... \u003C/p\u003E\u003Cp\u003EIt would be a REAL challenge to get one down in one piece.. and survive for more than 1.5 hours... even harder if you wanted to take a soil sample and get it back to Kerbal...\u003C/p\u003E\u003Cp\u003ENow THAT would be a challenge.\u003C/p\u003E\n"},{"CreatedByName":"kerbonaut101","CreatedById":65083,"CreatedDateTime":"2014-03-29T14:11:55Z","Content":"\n\u003Cp\u003EI would like to see popular mods (such as KW rocketry) fully integrated with KSP, meaning that when you download the game, the mods are already included (or if you\u0027ve already downloaded KSP, your game is patched to include the mods), some mods have become so widely used that they might aswell come included with the game.\u003C/p\u003E\u003Cp\u003EI would also like to see Kerbals equipped with spikes on there space boots that they can activate to enable them to walk and plant flags on asteriods\u003C/p\u003E\u003Cp\u003Ealso, more optimisation (my computer lags so much when im looking at Kerbin, but other planets and moons are all right)\u003C/p\u003E\u003Cp\u003E[edit] Ive also got a parts suggestion, can we please have a radial drogue parachute? Due to the fact that if I want a docking port on my ship, I cant have a drogue and sometimes that is necessary when your entering Kerbins atmosphere at 3200m/s. I also like the idea of landing cushions , one of the mars rovers used something similar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-29T14:27:32Z\u0022 title=\u002203/29/2014 02:27  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 29, 2014\u003C/time\u003E by kerbonaut101\u003C/strong\u003E\n\u003C/span\u003E\n"}]}