{"TopicId":61350,"ForumId":55,"TopicTitle":"Descriptive text/balance of Stayputnik","CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-01-28T03:40:25Z","PageNum":1,"Articles":[{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2014-01-28T03:40:25Z","Content":"\n\u003Cp\u003EThe description for the Stayputnik says \u0022The built-in batteries should keep it going for about 10 minutes\u0022. Of course the actual battery life is considerably less since the internal power stores 10em of power and like small probe cores it consumes 1.7em/min for barely more then 5 minutes of operation.\u003C/p\u003E\u003Cp\u003EAnd that got me thinking. First the stayputnik comes very early in the tech tree - you can get it even before batteries and will almost always have it before solar panels. Second is that it is the single \u0027useless\u0027 probe core, in that once you get other cores it has no specific advantage (and a big disadvantage in that it only has one stack attachment point). The HECS and OKTO are versatile for 6 and 8 way mounting, the 2 RC cores are useful for automating full sized spacecraft. The OKTO2 is the lightest core and the QBE has some mounting advantages and it has an incredibly high impact rating (I\u0027ve designed a super-micro probe in the past which relied on that).\u003C/p\u003E\u003Cp\u003EI would suggest two minor changes to the Stayputnik that would make it match the descriptive text and provide a reason to choose it over other cores. First change the internal battery capacity to 15em and more importantly reduce the consumption rate to 1.5em. This gives the Stayputnik a slightly better electric consumption compared to other cores and thus a reason to use it in specific situations. It also helps it better fit in early in the tech tree - it now really does have 10 minutes of power without any other batteries (enough to last a suborbital flight and still have a charge when it lands), and before getting solar panels it will last longer then the later probe cores on batteries alone.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-01-28T04:38:04Z","Content":"\n\u003Cp\u003EGood idea, i never use the Spayputnik.\u003C/p\u003E\n"}]}