{"TopicId":61364,"ForumId":55,"TopicTitle":"Tweakable SRBs? via selection of fuel core mandrel profile???","CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-01-28T08:30:17Z","PageNum":1,"Articles":[{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-01-28T08:30:17Z","Content":"\n\u003Cp\u003EHello all!\u003C/p\u003E\u003Cp\u003EFirst time poster after playing for a couple of months. Fab Simulation - makes me depressed thinking about all the calculus I forgot long ago... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESuggestion:\u003C/strong\u003E Would it make sense to allow an SRB to be tweaked by selecting the mandrel profile for the fuel core? -So as an example, a round void in the core would provide a gentle increase in thrust throughout the burn while a star void would provide higher thrust initial with a gradual taper (other void shapes are also possible).\u003C/p\u003E\u003Cp\u003EThanks for listening!\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003EWG\u003C/p\u003E\n"},{"CreatedByName":"sjwt","CreatedById":9268,"CreatedDateTime":"2014-01-28T09:58:41Z","Content":"\n\u003Cp\u003ESRB\u0027s can already be tweaked to alter both Thrust level and Fuel amount, as these are tweekable to fine detail, I am unsure if you are asking for a set a predefined options? or after some kind of effects alteration.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-01-28T10:59:00Z","Content":"\n\u003Cp\u003ENo, no, if you look up how SRBs work, you can actually have them prebuilt so that their thrust alters as they burn, due to how the fuel is actually built into the SRB. For example, an SRB where it is entirely solid fuel mass with a hole through the centre where it is originally going to be lit will have a variable thrust as it goes, slowly increasing and then slowly decreasing throughout the burn, since as it burns the surface area that is burning changes as the hole in the centre expands (since the fuel mass is being burned and shot out as exhaust). There are a bunch of different shapes you can cut into the SRB, each with different variable thrust profiles which can be displayed on a graph.\u003C/p\u003E\u003Cp\u003EWhat he dubs a Mandrel profile (not sure exactly where that name comes from) is also known as the \u003Cem\u003Egrain geometry\u003C/em\u003E of the engine (see \u003Ca href=\u0022https://en.wikipedia.org/wiki/Solid_rocket#Grain_geometry\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E). Basically, this would not only be a step forward for realism, but it would also mean SRBs can be considered more useful in a greater variety of situations. The wiki article only depicts four variants, but I recall seeing a suggestion much like this a very long time ago that had examples of at least 8 different kinds, including one that would actually exponentially increase its thrust before it dropped off and sputtered out.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-01-28T11:17:41Z","Content":"\n\u003Cp\u003Eyup, the shape of the hole down the center totally changes the way my little sugar rockets fly. star shapes \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E*\u003C/span\u003E can be very hard to make but produce MUCH greater initial thrust. (when they work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-01-28T11:48:28Z","Content":"\n\u003Cp\u003E\u0022Grain Geometry\u0022 - Yes, exactly - Many thanks for jogging my memory Vexx! There are way more than 4 - some can get quite complex. Sorry for the reference to Mandrel - as that is the device or \u0022form\u0022 which the fuel core is moulded around, and is then removed once the core is stabile. in my youth i recall using a large nail or a pencil as a makeshift mandrel.\u003C/p\u003E\u003Cp\u003EAnyway... I think the suggestion is clear enough at this point. The real question is - is it a worthy suggestion as an option in game?\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-01-28T12:10:04Z","Content":"\n\u003Cp\u003ECurrently, the SRBs appear to use the star core. If you watch the acceleration on the initial launch, you see the burst in acceleration followed by a drop off. The later increase is the result of the loss of mass as fuel gets used up.\u003C/p\u003E\u003Cp\u003EIt\u0027s a reminder of the designs of black powder model rocket engines where two of them with the same amount of propellent behaved in two vastly different performance.\u003C/p\u003E\u003Cp\u003EThe F-7.6 had a low overall thrust but provided 10 seconds of powered flight. It was suitable for small light very stable rockets best launched using a rail stabilization system. The F-100.8 was a high powered engine requiring a strong mounting. It burned all of its propellent in 1/2 second. A two stage version of the F-100.0 F-100.8 sent its 3 ounce film camera payload over a mile away upwind. We had launched it at a 45* angle due to it being quite windy. Unknown to us modelers the F-100.0 booster had a built in 3 second delay. The rocket had gone horizontal by the time the second stage kicked in.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-28T12:18:49Z\u0022 title=\u002201/28/2014 12:18  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 28, 2014\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-01-28T12:23:27Z","Content":"\n\u003Cp\u003Echanging the Thrust Curve (is that right?) could be helpful for launching asymmetric shuttles. the trust would decrease as the external tank mass decreases helping to keep the craft balanced and acceleration steady.\u003C/p\u003E\n"},{"CreatedByName":"check","CreatedById":71875,"CreatedDateTime":"2014-01-28T12:40:36Z","Content":"\n\u003Cp\u003EI\u0027m all for changes that increase realism (to a degree). However, with a change like this, it\u0027d be really useful for a stock version of Kerbal Engineer \u002B the ability to view a thrust curve on a graph (which I would love!).\u003C/p\u003E\u003Cp\u003EI know Squad\u0027s taking the view that too much math and too many numbers might intimidate new players... but there is a simple way around that: make certain tweakables and displays (engineering info, orbital parameters) unlockable with science. That way, a new player won\u0027t be bombarded with numbers and options right when they start, and only until they\u0027ve proven that they\u0027ve got a basic handle on rocket building and orbital mechanics do they unlock the ability to see parameters or make fine adjustments.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-01-28T12:53:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022check\u0022 data-cite=\u0022check\u0022\u003E\u003Cdiv\u003Ebut there is a simple way around that: make certain tweakables and displays (engineering info, orbital parameters) unlockable with science.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebingo! \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027Arial Narrow\u0027;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ethis extra text is required to post...\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-01-28T15:24:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022check\u0022 data-cite=\u0022check\u0022\u003E\u003Cdiv\u003EI know Squad\u0027s taking the view that too much math and too many numbers might intimidate new players... but there is a simple way around that: make certain tweakables and displays (engineering info, orbital parameters) unlockable with science. That way, a new player won\u0027t be bombarded with numbers and options right when they start, and only until they\u0027ve proven that they\u0027ve got a basic handle on rocket building and orbital mechanics do they unlock the ability to see parameters or make fine adjustments.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh how I wish for the day this becomes a reality...Plus, you can then look at building of scenarios based on how far along the tree you are; for example, once you unlock \u0027ejection angle\u0027 as a science display, you also unlock a scenario/tutorial that explains interplanetary transfers, etc. to help ease newbies into it (/offtopic)\u003C/p\u003E\u003Cp\u003EAnyway, since the thrust and fuel is now variable thanks to tweakables, I\u0027ve found them exceptionally useful for first stages again. I definitely think that the ability to sort out a thrust curve would be beneficial to some players, although I\u0027d be of the persuasion that it\u0027s probably not for everyone and, like Check suggests, should probably sit as an additional unlock for advanced players to use.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-01-28T15:30:26Z","Content":"\n\u003Cp\u003EI guess there is a slight concern that this might intimidate newer players, but if you have it unlockable (as previously mentioned) in addition to maybe having some kind of brief explanatory screen detailing what the feature does. (Just a general thing like this shaped thrust curve does this, and this grain geometry creates this kind of curve, etc.)\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-01-28T15:49:24Z","Content":"\n\u003Cp\u003EGrain geometry is kinda already implemented as the Max Thrust bar in tweakables. as its an SRB it becomes a Burn rate slider which is grain geometry. I suppose it does all become more complicated when you introduce a thrust curve, as it would be stretched by decreasing burn rate.\u003C/p\u003E\u003Cp\u003EI can see why it would be intimidating for new players but it would only really be a major factor on asymmetric craft anyway, which is already advanced.\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-01-31T11:28:55Z","Content":"\n\u003Cp\u003ESo to summarise briefly, it sounds like this could be a good idea / feature targeted for more advanced players - perhaps being unlocked later down the tech tree. \u003C/p\u003E\u003Cp\u003EMy original thought was this would be a in-game tool to completely customise the thrust curve for any SRB. But...\u003C/p\u003E\u003Cp\u003EI suppose another (more easily achievable) option would be to create an extended series of SRBs (each with a thrust curve designed to mimic a single grain geometry) which could be tweaked using the existing SRB tweaks (max thrust / burn time). I presume that this approach would probably be better implemented via a mod or part pack rather than an in-game change.\u003C/p\u003E\u003Cp\u003EWell, thanks for listening and the constructive feedback.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n"},{"CreatedByName":"shand","CreatedById":57781,"CreatedDateTime":"2014-01-31T11:41:30Z","Content":"\n\u003Cp\u003EIm up for this - we are halfway there - a thrust curve would be the final nail in the coffin of awesome (thats a terrible expression - i mean it would be perfect)\u003C/p\u003E\u003Cp\u003Eperhaps a 4 tier system? 1- just tweak the fuel levels. (Initial SRB unlock - though maybe have it default to half thrust) 2: tweak the fuel and trust. (when you unlock the larger one) 3:tweak between 3 or 4 preset geometries. 4: adjust the thrust curve yourself.\u003C/p\u003E\u003Cp\u003EOn the technical side can someone confirm my understand is right, or tell me where im wrong:\u003C/p\u003E\u003Cp\u003Ethe deltaV of the SRB is the same regardless of geometry (assuming same mass and fuel) yes?\u003C/p\u003E\u003Cp\u003Eand is that deltaV is proportional to the area under the thrust curve?\u003C/p\u003E\u003Cp\u003EIf so you can have a simple system where if you lower the thrust curve at any point it extends the x axis, representing increased burn time.\u003C/p\u003E\u003Cp\u003Eand yes i completely agree, this needs to be entirely optional perhaps even hidden behind a button on the right click menu (\u0022Use advanced SRB editing\u0022) of each SRB. and definitely up the tech tree.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2014-01-31T12:13:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EThe wiki article only depicts four variants, but I recall seeing a suggestion much like this a very long time ago that had examples of at least 8 different kinds, including one that would actually exponentially increase its thrust before it dropped off and sputtered out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI remember this diagram showing up a lot on the forum:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://abyss.uoregon.edu/~js/images/solid_2.gif\u0022 alt=\u0022solid_2.gif\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2014-01-31T23:51:32Z","Content":"\n\u003Cp\u003EThis might be unrealistic, but what about \u0022initial thrust\u0022 and \u0022final thrust\u0022 sliders? Then let the game interpolate between them.\u003C/p\u003E\u003Cp\u003EDon\u0027t forget that in the current game, SRBs have \u0022spool up\u0022 time, and the I\u003Csub\u003Esp\u003C/sub\u003E gain from travelling up doesn\u0027t come with a respective thrust gain.\u003C/p\u003E\u003Cp\u003EThe velocity curve is also a thing, but is not used by the current SRBs.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-02-01T00:35:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Awaras\u0022 data-cite=\u0022Awaras\u0022\u003E\u003Cdiv\u003EI remember this diagram showing up a lot on the forum:\u003Cp\u003E\u003Ca href=\u0022http://abyss.uoregon.edu/~js/images/solid_2.gif\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://abyss.uoregon.edu/~js/images/solid_2.gif\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m wondering what it would take to do a highly simplified burn simulation on some of those cross sections. Thrust based on amount of surface area exposed, and the surface area is eaten away evenly across the exposed surface, a pixel (or whatever distance unit) at a time. You can draw whatever shape you like. If the burn results in chunks of fuel coming loose, that could be a non-viable design that would cause an explosion, and would not be allowed.\u003C/p\u003E\u003Cp\u003EThe simulation would only need to be run once to generate the thrust curve, and the curve is then what is used in the game for every booster with that fuel core design.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2014-02-01T04:55:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EI\u0027m wondering what it would take to do a highly simplified burn simulation on some of those cross sections. Thrust based on amount of surface area exposed, and the surface area is eaten away evenly across the exposed surface, a pixel (or whatever distance unit) at a time. You can draw whatever shape you like. If the burn results in chunks of fuel coming loose, that could be a non-viable design that would cause an explosion, and would not be allowed.\u003Cp\u003EThe simulation would only need to be run once to generate the thrust curve, and the curve is then what is used in the game for every booster with that fuel core design.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really think simulating burn patterns would be overkill. Just letting us edit the thrust curve directly would be good enough in my opinion.\u003C/p\u003E\n"},{"CreatedByName":"ThorBeorn","CreatedById":96670,"CreatedDateTime":"2014-04-16T14:42:30Z","Content":"\n\u003Cp\u003ESry for necro. But HoneyFox has a plugin called EngineThrustController.dll which can be added to SRB\u0027s. This makes thrust a function of how much fuel is left in the SRB. The thrustcurve can then be edited in the mod tweakable parameters also by HoneyFox, or with simple .cfg editing in notepad (which is essentially the same as changing the fuel core profile). So y\u0027all know.\u003C/p\u003E\u003Cp\u003EI\u0027d also like this to be a feature of stock KSP though. It can also be done more user-/noobfriendly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-16T14:45:19Z\u0022 title=\u002204/16/2014 02:45  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 16, 2014\u003C/time\u003E by ThorBeorn\u003C/strong\u003E\n\u003Cbr\u003EDarn spelling\n\u003C/span\u003E\n"}]}