{"TopicId":61792,"ForumId":55,"TopicTitle":"Quality of life VS. Expansion","CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2014-02-01T05:33:47Z","PageNum":1,"Articles":[{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2014-02-01T05:33:47Z","Content":"\n\u003Cp\u003EBasically the argument of improving the things we already have before new content, or getting new content to make the game more dynamic, but the more stuff you add, the harder it is to flesh it all out. Just want to know where people lie and where a line should be drawn between the two.\u003C/p\u003E\u003Cp\u003EA few examples:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EQoL:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-Biomes for all planets\u003C/p\u003E\u003Cp\u003E-Redoing old sprites (Engine nacelle looks pretty dated)\u003C/p\u003E\u003Cp\u003E-Fixing ocean lag (ever noticed the FPS drop when looking down at kerbin?)\u003C/p\u003E\u003Cp\u003E-Better IVAs \u003Cspan style=\u0022font-size:8px;\u0022\u003EMK2 lander can *cough*\u003C/span\u003E and IVA for MK2 cockpit\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMore Content:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis ones a bit more tricky, because what \u0022should\u0022 be in game varies a lot form person to person, and is much harder to implement.\u003C/p\u003E\u003Cp\u003E-I think it\u0027s safe to say everyone wants more planets, like GP2\u003C/p\u003E\u003Cp\u003E-\u0022Gap Filler\u0022 parts. I.E something between the mainsail and skipper, current lights are a few \u003Cem\u003Ehundred\u003C/em\u003E meters apart from the things they illuminate, solar panels between 2 and 18 e/s, etc... \u003C/p\u003E\u003Cp\u003E-Improved physics \u003C/p\u003E\u003Cp\u003EI think QoL of should be focused, but sprinkle some new content like a couple parts every large patch to keep things interesting. Eventually the improvements to QoL will catch up and the dev can make big content patches, then the new content can be fleshed out and the cycle repeats. At Least in my mind that\u0027s how things would work out. But, if one takes over the other however, \u003Ca href=\u0022http://tvtropes.org/pmwiki/pmwiki.php/Main/MovingTheGoalposts\u0022 rel=\u0022external nofollow\u0022\u003Ethe other could keep getting put off due to lack of interest.\u003C/a\u003E So a bit of both in my opinion.\u003C/p\u003E\n"}]}