{"TopicId":61984,"ForumId":55,"TopicTitle":"Realistic Water physics and Semi-destructible Ground","CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2014-02-02T21:54:06Z","PageNum":1,"Articles":[{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2014-02-02T21:54:06Z","Content":"\n\u003Cp\u003EWhen a part fall to the water at a very high speed it disappears and you can\u0027t find it. Is this realistic? No, I would like the part to be not destroyed,but sink to the seafloor or float to the ocean surface if the fuel tank is empty. It will float, its annoying to see a part just destroyed and you can\u0027t find it. The Semi-destructible ground is when a object hit the ground at a very high speed from reentry or past 15 M/s. There will be different types of crater: A little dent(low speed impact),Medium Crater(Medium speed impact), Large Crater(high speed impact). The crater size will also depend on how big is the object. The object will also have a damage bar which shows how much damage it takes(a dent,holes, and beyond repair).The appearance of the Crater is black then it will regenerate into regular ground in 5-6 Mins. I also want the electrical parts(Batteries) and Fuel tanks(If its empty it doesn\u0027t produce fire) and RCS tanks and anything that Contains fuel or Energy will produce a flame when damaged or crash into the ground. You can recover this parts and repair them.\u003C/p\u003E\u003Cp\u003EI hope you like my suggestion and post any problems with this.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2014-02-02T22:27:25Z","Content":"\n\u003Cp\u003EIt is realistic.\u003C/p\u003E\u003Cp\u003EThe part impacts with the water just as it impacts with the ground, just no explosions. So it shatters into billions of carefully crafted pieces so you never have to see an oil spillage from the fuel you\u0027d be carrying, or the extremely volatile pieces of broken batteries.\u003C/p\u003E\n"},{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2014-02-02T23:29:09Z","Content":"\n\u003Cp\u003EWhen the Craft crash into the ground it makes a crater and the parts will fly out and hit the ground and make more craters. The water part is the Part destroy or severely damaged.\u003C/p\u003E\n"},{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2014-02-02T23:58:01Z","Content":"\n\u003Cp\u003ENot sure how easy deformable terrain would be, but realistic water physics on a planetary scale would take a supercomputer. What you\u0027re suggesting isn\u0027t so much \u0022realistic\u0022 water, so much as it is having the game take into account the current mass of the part to determine buoyancy.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-02-03T00:20:34Z","Content":"\n\u003Cp\u003EDeformable terrain would require KSP to run soft body physics on planets. Unless they can thread that through the GPU and you\u0027re running dual GeForce Titans, it would reduce your CPU to a smoldering pile of slag.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-02-03T00:34:49Z","Content":"\n\u003Cp\u003EI don\u0027t really think we really need destructible ground (it\u0027s a bit complicated), but realistic water would be nice.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-02-03T02:17:02Z","Content":"\n\u003Cp\u003EToo resource intensive, in my opinion. That\u0027s always the trouble with \u0022realistic\u0022 physics and deforming things. The calculations required are ridiculously complicated -- that\u0027s why KSP doesn\u0027t do N-body physics calculations; they\u0027re too complex to simulate on time warp. Deforming terrain or parts, and making water act like real water is excessively difficult for computers to do, especially in realtime.\u003C/p\u003E\n"},{"CreatedByName":"S4qFBxkFFg","CreatedById":83727,"CreatedDateTime":"2014-02-03T09:49:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EToo resource intensive, in my opinion. That\u0027s always the trouble with \u0022realistic\u0022 physics and deforming things. The calculations required are ridiculously complicated -- that\u0027s why KSP doesn\u0027t do N-body physics calculations; they\u0027re too complex to simulate on time warp. Deforming terrain or parts, and making water act like real water is excessively difficult for computers to do, especially in realtime.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA simplified version could probably work though - I\u0027ve seen javascript in websites which calculates crater diameter and depth for various surfaces, impactor types, and angles so we could probably have a similar calculation in the game. Whether they\u0027re persistent or not is another matter.\u003C/p\u003E\u003Cp\u003EAlso, does the game actually support buoyancy? I\u0027ve never checked to see if anything splashed down, then sank, and I\u0027ve never had any lighter-than-air parts. So to me it seems like there\u0027s constant buoyancy in water, and none in air.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2014-02-03T10:16:37Z","Content":"\n\u003Cp\u003EIt shouldn\u0027t be too hard to implement ships causing craters.\u003C/p\u003E\u003Cp\u003EAll you need to store is the crater depth, width, location and maybe radial deformation. Procedural terrain generation can take care of the rest. Since you only need 1 crater per crash this shouldn\u0027t be too resource intensive. \u003C/p\u003E\u003Cp\u003EBut, to be honest. Squad has bigger fish to fry than frivolities like this. I\u0027d much rather see more career mode than craters.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-02-03T12:02:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EAll you need to store is the crater depth, width, location and maybe radial deformation. Procedural terrain generation can take care of the rest. Since you only need 1 crater per crash this shouldn\u0027t be too resource intensive. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProcedural terrain is the idea of generating terrain based on a number of rules, which isn\u0027t applicable here. For example, the craters on the Mun were procedurally generated, but they are not done so in realtime. As Captain Sierra said, to get craters you would need soft body physics, rather than the current solid body that the planet is. Whilst it\u0027s everyone\u0027s dream to drill a hole through Kerbin using nothing but solid boosters, the deformation calculations, in real time, on a planetary scale, are beyond the realms of possibility at the moment.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-02-03T12:27:28Z","Content":"\n\u003Cp\u003ERather then deformable terrain, just a sprite representing an impact could easily be used. It can be saved similar to how flags are.\u003C/p\u003E\u003Cp\u003EFor water, parts of rockets will float if you follow them down and they don\u0027t hit extremely hard. However, I did have a fuel tank explode on impact with water even though it was under 10 m/sec on parachutes. This seems to vary, especially with Career mode, on tier zero flights where they have survived water landings but explode on land impact.\u003C/p\u003E\u003Cp\u003ESpace Engine does very realistic water that has none of the moire pattern of KSP. It also has realistic moving clouds of various densities at various altitudes. How that would affect frame rates in KSP if it could be done in Unity is unknown.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-02-03T12:38:04Z","Content":"\n\u003Cp\u003EBy \u0022under 10m/s\u0022, do you mean \u003Cem\u003Ejust\u003C/em\u003E under? Even structural parts like the Science Lab only have a tolerance of 8m/s. Off the top of my head, I \u003Cem\u003Ethink\u003C/em\u003E fuel tanks only have around 6m/s... 10m/s is actually quite fast, if you think about it. Try crossing a ten metre-gap in a single second... it just won\u0027t happen. It\u0027s a small number, but it\u0027s pretty darn fast just the same.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-02-03T12:45:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003ERather then deformable terrain, just a sprite representing an impact could easily be used. It can be saved similar to how flags are.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA sprite is a 2D object, whereas the flags are 3D physical objects. Even if you placed a default \u0027crater\u0027 object whereever a crash was, you\u0027d end up with some physical crater that would have to be interactable with, and you could then, in theory, crash multiple craft into the same point and end up with a \u0027hill\u0027 made up of holes stacked on top of each other. The only way craters work is with real physics, but as previously mentioned, that doesn\u0027t work. Look at bullet holes in older games - they just stack on top of each other when you fire at the same piece of wall - it doesn\u0027t look good, nor is it realistic, nor does it add much value to the game. The real benefit comes when those bullets start destroying cover, Matrix style, and you see an output for an input\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003EFor water, parts of rockets will float if you follow them down and they don\u0027t hit extremely hard. However, I did have a fuel tank explode on impact with water even though it was under 10 m/sec on parachutes. This seems to vary, especially with Career mode, on tier zero flights where they have survived water landings but explode on land impact.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely, they will float if it\u0027s soft enough. However, bear in mind that 9.8m/s is still the equivalent of hitting the water after free falling for a second, so it\u0027s not exactly a \u0027soft\u0027 landing. Each part also has a different impact resistance, so a structural girder is more likely to survive than a fuel tank, for example.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SRV Ron\u0022 data-cite=\u0022SRV Ron\u0022\u003E\u003Cdiv\u003ESpace Engine does very realistic water that has none of the moire pattern of KSP. It also has realistic moving clouds of various densities at various altitudes. How that would affect frame rates in KSP if it could be done in Unity is unknown.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith all due respect, Space Engine is a completely different game - it\u0027s like asking if my toaster makes a good aeroplane. The engine, and the code that KSP is written for, is optimised for rocket dynamics, and lots of physics delta steps to give a good approximation. Space Engine is written to contain a lot of objects in high detail, but without any physical perturbations (as far as I know? I\u0027ve not actually played it so forgive me if this is wrong). They\u0027re both designed to be completely different things and as such, they\u0027re not really comparable, past that they both deal with space and planets.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003Eedit:\u003C/em\u003E NINJA\u0027ed!\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-02-03T13:17:13Z","Content":"\n\u003Cp\u003EI distinctly remember a rather old game by the name of Hostile Waters. You could literally flatten the entire map if you wanted to spend long enough with howitzers blasting the bejeezus out of the landscape. You don\u0027t really need \u0022physics\u0022 as it were, beyond the basic collision detection which we already have. What you would need though, is deformable terrain. Not so much soft body physics, as much as two sets of data for each celestial body: The original height values (which don\u0027t stay loaded in RAM), and a set of height values copied from the originals, which are used to actually render the landscape with. Something causes a crater? Dig the height values down a bit. Make your own Mohole on Kerbin, then go into the game settings and click \u0022reset planetary deformations\u0022 when you\u0027re bored with it.\u003C/p\u003E\u003Cp\u003EI\u0027ll agree it\u0027s not a massive priority compared to the rest of the planned features, but it would certainly be nice, and I don\u0027t think as hard as some people are saying. Certainly not supercomputer-hard.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-02-03T13:40:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EI distinctly remember a rather old game by the name of Hostile Waters. You could literally flatten the entire map if you wanted to spend long enough with howitzers blasting the bejeezus out of the landscape. You don\u0027t really need \u0022physics\u0022 as it were, beyond the basic collision detection which we already have. What you would need though, is deformable terrain. Not so much soft body physics, as much as two sets of data for each celestial body: The original height values (which don\u0027t stay loaded in RAM), and a set of height values copied from the originals, which are used to actually render the landscape with. Something causes a crater? Dig the height values down a bit. Make your own Mohole on Kerbin, then go into the game settings and click \u0022reset planetary deformations\u0022 when you\u0027re bored with it.\u003Cp\u003EI\u0027ll agree it\u0027s not a massive priority compared to the rest of the planned features, but it would certainly be nice, and I don\u0027t think as hard as some people are saying. Certainly not supercomputer-hard.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou could flatten the world in Total Anihillation, or Worms, or whatever, of course, but imagine for a moment how KSP, and Unity works.\u003C/p\u003E\u003Cp\u003EEach delta time, there is a set of physics calculations on the active vessel. Let\u0027s imagine a simple rocket, that\u0027s got 20 or 30 parts as part of a lander and return vehicle to the Mun, or whatever. Assuming it\u0027s coming in too fast, it hits the ground, and the first piece that hits calls CraterGenerator() as a function, which does all the whizzbang calculations and calculates what that part does as damage to the ground. Great, but you now have 29 other pieces which are now flying behind which haven\u0027t been calculated. So unity then has to do the adjustment of the planetary surface, work out a new position for the next piece to hit, do the physics calculations on that, and continually form craters for each new bit that hits. Now obviously, that\u0027s possible to do, but whether or not KSP can do it on a single-core basis whilst also maintaining the remainder of the game would probably slow down the system. Not to mention you would then need to consider whether the planet has other layers underneath, and then do they have biomes of their own (ie: is digging a viable science option via impactors?), and you end up with a number of gameplay and engine issues which, whilst interesting, probably cause more issues than they solve.\u003C/p\u003E\u003Cp\u003EI don\u0027t know, it\u0027s something I\u0027d like to see, but on the other hand I wouldn\u0027t be upset if it was never delivered because of technical constraints. I can imagine the game breaking very easily as Scott Manley fires a 0.1c kinetic impactor into Minmus and turning it from a Mint dessert to a hors d\u0027ouevre, or whackjob\u0027s creation loading onto the launchpad and crushing KSC.\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-02-03T14:19:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmappedout\u0022 data-cite=\u0022allmappedout\u0022\u003E\u003Cdiv\u003EScott Manley fires a 0.1c kinetic impactor into Minmus and turning it from a Mint dessert to a hors d\u0027ouevre, or whackjob\u0027s creation loading onto the launchpad and crushing KSC.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr indeed, whatever mindboggling hilarity Danny2462 might come up with.\u003C/p\u003E\u003Cp\u003EFor this reason alone it\u0027s worth considering. But yes, maybe once the rest of the game is working.\u003C/p\u003E\n"},{"CreatedByName":"Dooz","CreatedById":74263,"CreatedDateTime":"2014-02-03T14:26:49Z","Content":"\n\u003Cp\u003EMy computer would probably melt if this was implemented\u003C/p\u003E\u003Cp\u003EWhat about us with our not so powerful computers?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-03T14:35:17Z\u0022 title=\u002202/03/2014 02:35  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 3, 2014\u003C/time\u003E by Dooz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-02-03T14:49:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dooz\u0022 data-cite=\u0022Dooz\u0022\u003E\u003Cdiv\u003EMy computer would probably melt if this was implemented\u003Cp\u003EWhat about us with our not so powerful computers?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a 3-and-a-bit year old Athlon II X4 640. Not exactly the speediest either, especially since there\u0027s only one main process involved.\u003C/p\u003E\u003Cp\u003EIf it can be done though, and I\u0027ve a feeling it could be cheated into working (perhaps if a whole bunch of parts are set to impact in the same game tick, it counts as one impact), I\u0027d definitely like to see it. It doesn\u0027t need to be a hyper-realistic simulation of a mass impacting a planet. It just needs to be divets getting dug into the ground with an appropriate size for the tonnage involved.\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-02-03T16:06:18Z","Content":"\n\u003Cp\u003EThe way that the physics is unrealistic is that it\u0027s WAY too bouncy. Also, If I build say a boat and if it\u0027s in a v shape, the enclosed parts that go underwater are still filled with water.\u003C/p\u003E\u003Cp\u003EYour terrain idea is something I\u0027m not sure of, maybe regenerative/destructible terrain? Still, too much work and not much use.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-02-03T17:42:22Z","Content":"\n\u003Cp\u003EI would rather dust effects than craters.\u003C/p\u003E\u003Cp\u003EBetter water is also more interesting than craters too.\u003C/p\u003E\n"}]}