{"TopicId":62288,"ForumId":55,"TopicTitle":"AMD\u0027s Mantle in KSP/Unity?","CreatedByName":"Tataffe","CreatedById":33282,"CreatedDateTime":"2014-02-05T20:10:28Z","PageNum":1,"Articles":[{"CreatedByName":"Tataffe","CreatedById":33282,"CreatedDateTime":"2014-02-05T20:10:28Z","Content":"\n\u003Cp\u003EHi guys,\u003C/p\u003E\u003Cp\u003Eafter a long break from the forum I am going to start a thread of which I expected at least three to already exist. Googled, didn\u0027t find one ... *rollsupsleeves*\u003C/p\u003E\u003Cp\u003ESo for those of you who are not much into PC tech, \u0022Mantle\u0022 is an API developed by AMD for their \u0022Graphics Core Next\u0022 (GCN) architecture, that means all their graphics cards from the HD 7000 series upwards. Mantle is an alternative for current APIs like Direct3D or OpenGL, but compared to these it is much thinner and more efficient (because it\u0027s taylored to AMD\u0027s GPUs), which results in much better game performance. Depending on your system and the games you play, you can expect your FPS to take a two-, sometimes three-digit leap upwards percentagewise. Mantle does this by reducing the amount of code that has to be executed to actually bring the frames to your screen, the so called \u0022overhead\u0022. This reduces CPU load drastically. It depends on the game engine developer to integrate it into their engine\u0027s code, DICE took the lead here by adding Mantle to their Frostbite 3 engine; Battlefield 4 now supports Mantle, and apart from some bugs (produced, of course, by DICE not AMD) it delivered. Other game developers announced to support Mantle, including the devs of Star Citizen and Thief.\u003C/p\u003E\u003Cp\u003ENow, can you possibly think of a game that you use some CPU load removal? It is only logical to think about the integration of Mantle into Unity and KSP. I really wondered if the KSP devs have given this a thought and if there are plans to integrate Mantle into KSP at some point. I assume that they depend on Unity to do the groundwork here, and I would like your estimations on how much Mantle could improve KSP\u0027s performance.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ETataffe\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-02-05T20:18:42Z","Content":"\n\u003Cp\u003EFrom what I understand this is relieving mostly graphics related CPU slow-downs. The CPU has to feed certain info to the GPU, which means that low power CPUs can really bottleneck a high power GPU. \u003C/p\u003E\u003Cp\u003EThe CPU bottleneck in KSP is very different though. It is primarily the physics calculations that are slowing things down, and until Unity gets around to updating its severely outdated version of PhysX (the fact that this technology comes from Nvidia further complicates things) I don\u0027t think we\u0027ll see much improvement in this area. Moderate increases like we got in 0.23 might be possible, but I don\u0027t think Mantle would really have any effect in relieving the kind of CPU related issues that KSP and Unity have.\u003C/p\u003E\n"},{"CreatedByName":"tetryds","CreatedById":50204,"CreatedDateTime":"2014-02-05T20:24:08Z","Content":"\n\u003Cp\u003EThis is the same as asking for hardware accelerated nvidia physx.\u003C/p\u003E\u003Cp\u003EAnd in this case, it would have a much bigger impact on the performance for nvidia gpus than mantle could for amd ones.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-02-05T22:42:14Z","Content":"\n\u003Cp\u003EYou\u0027d be better off asking for something like this on the Unity forums, methinks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}