{"TopicId":64184,"ForumId":55,"TopicTitle":"One idea about mass","CreatedByName":"Hyperic88","CreatedById":10779,"CreatedDateTime":"2014-02-24T20:26:33Z","PageNum":1,"Articles":[{"CreatedByName":"Hyperic88","CreatedById":10779,"CreatedDateTime":"2014-02-24T20:26:33Z","Content":"\n\u003Cp\u003EHi Folks, \u003C/p\u003E\u003Cp\u003Esorry if it has been already suggested, but i didn\u0027t find it anywhere so...\u003C/p\u003E\u003Cp\u003ESince i start to play KSP and start to experiment with moar boosters/engines/whatever \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E) i was quite angry when i build a fabulous rocket only to found out that thrust isn\u0027t sufficient to launch a ship. So i was wondering, if there can be some inner calc or at least stats of total mass / need thrust power to lift of this pile of junk eeeeer i mean fabulous rocket \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Or simplier if there is some fixed mass to thrust ratio then only post the total mass of the ship \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-24T21:51:17Z\u0022 title=\u002202/24/2014 09:51  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 24, 2014\u003C/time\u003E by Hyperic88\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-25T14:40:54Z","Content":"\n\u003Cp\u003EAs a workaround, you can see the mass when your rocket is on the launchpad, and you then switch to map mode. There\u0027s a little \u0022i\u0022 icon at the righthand edge of the screen that shows you info about your currently focused object (in this case, your rocket).\u003C/p\u003E\u003Cp\u003EAs a rule of the thumb, you need at least 10x your mass in thrust to lift off (very slowly, use more to move faster).\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-02-25T14:51:54Z","Content":"\n\u003Cp\u003EThe number you are looking for is Thrust-to-Weight Ratio (TWR). A TWR greater than 1 will have enough thrust to lift off, with greater acceleration the larger TWR gets. A craft with a TWR of less than 1 will sit on the pad burning fuel until its mass is reduced enough to bring the TWR up to 1, at which point it will start to slowly lift off.\u003C/p\u003E\u003Cp\u003EUnfortunately, there is currently no TWR calculator built into KSP. You can calculate it manually by adding the thrust of all your engines, then dividing by the sum of the masses of all your parts multiplied by 9.81.\u003C/p\u003E\u003Cp\u003EAlternately, you can install a mod that calculates it for you, MechJeb and Kerbal Engineer Redux are popular.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-25T14:55:12Z","Content":"\n\u003Cp\u003EThere are mods available which will tell you what you are asking for - Kerbal Engineer Redux or MechJeb, for instance.\u003C/p\u003E\u003Cp\u003EIt might be good if something like that was integrated into the stock game but as long as there are mods for it I don\u0027t see it as a big priority. Also it\u0027s really a question whether \u0022playing by numbers\u0022 is really how the game is be meant to be played.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-02-26T15:26:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EAs a workaround, you can see the mass when your rocket is on the launchpad, and you then switch to map mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, so that can\u0027t be what Harvester means when he says rocket design tools (such as a TWR calculator) in the VAB would take magic/puzzle away from the game.\u003C/p\u003E\u003Cp\u003EManually adding the thrust of a couple of engines isn\u0027t so hard to do, but manually adding up the mass of all parts of a rocket is just tedious for anything except small rockets. So at the very least we could/should have the total mass of the craft shown in the VAB.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-26T17:17:14Z\u0022 title=\u002202/26/2014 05:17  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 26, 2014\u003C/time\u003E by rkman\u003C/strong\u003E\n\u003C/span\u003E\n"}]}