{"TopicId":64579,"ForumId":55,"TopicTitle":"Automation, not Autopilot.","CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-03-01T04:08:11Z","PageNum":1,"Articles":[{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-03-01T04:08:11Z","Content":"\n\u003Cp\u003EI posted this in another topic on probes, but I don\u0027t think the distinction I was trying to make was entirely understood. \u003C/p\u003E\u003Cp\u003EIn the topic people where advocating for some degree of automation of probes. I suggested that a stock probe, or rover might be positioned in orbit, or on planet. Then turned on, it then goes off to do it\u0027s own thing. The player would then have to retrieve it later for a science turn in. \u003C/p\u003E\u003Cp\u003E In my mind this is different from autopilot, which squad says they think would take away from the game. Once turned on the probe acts autonomously, but they player has no control over where the probe goes. This is an important consideration because one of the goals of an autopilot is to fly where you want, not just to fly around. \u003C/p\u003E\u003Cp\u003E When the probe is deployed it would make a course correction and an additional number of pseudo-random course corrections during it\u0027s orbit, so it would not be as if a kerbal could turn the probe on and then wait right next to it for it to finish making science. Instead they would have to go and collect it from wherever it ended up. That would add more variety to the standard routine of go, do science, return. And if I\u0027m honest the rote nature of collecting science is one of the things that could stand improvement. \u003C/p\u003E\u003Cp\u003E Having a probe that acts in such a way would also mean that the player would have to be careful to deploy it in an orbit that would ensure it would not end up crashing into the planet or shooting off into space. All these point, I think, are strong arguments showing how autonomous probes would enhance gameplay.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-03-01T12:40:58Z","Content":"\n\u003Cp\u003EGood idea.\u003C/p\u003E\u003Cp\u003EAn example where this feature could be REALLY useful: a SCANsat satellite probe which keep the SAR array pointed to the targeted body whatever the orbit is\u003C/p\u003E\u003Cp\u003E(it needs to keep track of available monopropellant if it used RCS to rotate).\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-01T13:10:20Z","Content":"\n\u003Cp\u003EWhat you are describing is an autopilot, just a primitive one in which no changes to its programming can be made once activated. A ship with a probe core and a kerbal on board (a not uncommon situation) would be a ship with an autopilot that the kerbal deactivates to make programming changes.\u003C/p\u003E\u003Cp\u003ENot that it\u0027s a bad idea, just pointing out that the difference between automation and autopilot is largely semantic.\u003C/p\u003E\n"},{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-03-01T14:30:18Z","Content":"\n\u003Cp\u003EIn the strictest sense SAS is an autopilot. Turn your rocket, or airplane to a bearing of 90 degrees, horizontal, and it will fly in that attitude hands off until it runs out of fuel. \u003C/p\u003E\u003Cp\u003E So while it may similar to an autopilot, I think it is different enough from what squad describes as autopilot to merit discussion. It would not make things simpler, it would be more difficult.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-01T15:06:02Z","Content":"\n\u003Cp\u003ESo, how sophisticated would you want it to be? How complex a maneuver should it be capable of? Can it be turned off once activated? Is a kerbal required to do so?\u003C/p\u003E\u003Cp\u003ENot trying to criticize here, just get a better idea of what you\u0027re envisioning. And I agree it is an idea worth discussing.\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2014-03-01T16:20:22Z","Content":"\n\u003Cp\u003EI don\u0027t want to be harsh but many people here couldn\u0027t fly without an autopilot (which is just a lot of automation), which isn\u0027t standard in the game.\u003C/p\u003E\u003Cp\u003EMyself I see no reason to not propose a sort of simplified Mechjeb in the late game, not because I can\u0027t do anything manually (I am a Orbiter player) but because it\u0027s boring on the long.\u003C/p\u003E\u003Cp\u003EFurthermore, in the gameplay, probes serve the important purpose of being an cheap, easy and dispensable way of acquiring Science-point which would be extremely hard and slow if we had to send a Kerbal everywhere.\u003C/p\u003E\u003Cp\u003EAutomated probes is a fundamental part of Space Exploration regardless we like it or not, and there\u0027s no interest for a probes that land at randoms locations, just as there\u0027s no reason to keep a probes from being able to send the result of its experiment from place where you couldn\u0027t land and retrieve Kerbun (like Eve).\u003C/p\u003E\n"},{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-03-01T16:48:06Z","Content":"\n\u003Cp\u003ENot offended at all. \u003C/p\u003E\u003Cp\u003E Basically your control over it would be limited to where it is deployed. There would be an ideal orbit for it to be released in, one from where the course corrections it would make couldn\u0027t end up crashing into the planet or shooting into space. Beyond that it would be fully automatic. Turning it off, or controlling it wouldn\u0027t be a option, and it would be \u0022unkerbaled\u0022\u003C/p\u003E\u003Cp\u003E It would fairly small, maybe like a like a stayputnik \u002B some sensors, a docking port, some small maneuver thrusters, and a battery. I think ideally it would need to be a \u0022black box\u0022 unit, rather than part that could be built up.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-01T17:13:23Z","Content":"\n\u003Cp\u003EI must be slow, I\u0027m still not understanding what the unit would do. If you deploy something in a non-atmospheric orbit, it\u0027s going to stay in that orbit indefinitely without any need for course corrections.\u003C/p\u003E\n"},{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-03-01T17:47:04Z","Content":"\n\u003Cp\u003Ethe course corrections would be for gameplay reasons, rather than orbital stabilization or optimization. So that you could not just turn the probe on, orbit right next to it, and recover it. \u003C/p\u003E\u003Cp\u003E By performing these course changes and going away from the initial orbit the probe creates additional gameplay. Also I think it would dovetail nicely with contracts; take this probe to optimal orbit, release it and retrieve it later. Get science, reputation and cash.\u003C/p\u003E\n"},{"CreatedByName":"Camacha","CreatedById":59088,"CreatedDateTime":"2014-03-01T17:56:02Z","Content":"\n\u003Cp\u003EYou could build something like this with kOS \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E That way you can decide for yourself how far and random you want to take things.\u003C/p\u003E\n"},{"CreatedByName":"coolitic","CreatedById":79738,"CreatedDateTime":"2014-03-01T17:59:26Z","Content":"\n\u003Cp\u003EYou are basically suggesting auto-pilot but are just using a different word.\u003C/p\u003E\u003Cp\u003EAdmins should start banning people who keep posting do not suggest (for a week or so). I don\u0027t necessarily mean you OP\u003C/p\u003E\n"},{"CreatedByName":"eurybaric","CreatedById":33541,"CreatedDateTime":"2014-03-01T18:22:20Z","Content":"\n\u003Cp\u003EAgreed.\u003C/p\u003E\u003Cp\u003EFurthermore, a good argument (and purpose) IMO would be that when you\u0027re sending a probe to a far off planet - well, Even the moon for that matter, telemetry back and forth to that probe would take time. I mean (and here I\u0027m thinking about it while I type), how the heck do we have instant control and camera views and whatnot for a probe that\u0027s on the other side of the Kerbol system? It doesn\u0027t make sense, and it\u0027s much less immersive than having the probe be automated.\u003C/p\u003E\u003Cp\u003EPicture this. You launch a rocket with a payload consisting of a service module (manned) and a probe. Get it to LKO let\u0027s say. Separate the the service module from the launch vehicle remains, and shoot for Mun tugging with you the probe. Enter a precalculated orbit around Mun - and that would depend on how you\u0027ve automated/programmed your probe. Say 80x80km circular equatorial orbit. Activate probe and separate. Return with the service module to Kerbin. On the probe side, once it has been activated, it begins executing its predefined set of instructions. \u003C/p\u003E\u003Cp\u003EFor example, these would go like this:\u003C/p\u003E\u003Cp\u003E1-Complete one orbit while probing the equator for landing sites.\u003C/p\u003E\u003Cp\u003E2-Change orbit inclination to 45 degrees.\u003C/p\u003E\u003Cp\u003E3-Complete a set of orbits mapping the surface.\u003C/p\u003E\u003Cp\u003E4-reducing periapsis to 15 km\u003C/p\u003E\u003Cp\u003E5-scan for dust and/or composition of atmosphere (yeah I know in ksp mun has no atmosphere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) and activate applicable science experiments.\u003C/p\u003E\u003Cp\u003E6-circularize orbit\u003C/p\u003E\u003Cp\u003E7-go back to equatorial orbit\u003C/p\u003E\u003Cp\u003E8-Sleep mode and wait for retrieval by subsequent manned mun mission.\u003C/p\u003E\u003Cp\u003EWell, Mun wasn\u0027t really a good example (being close and boring and all hehehe) but you get my point.\u003C/p\u003E\u003Cp\u003Eand of course back on the ground (or in a manned ship) we could still send and recieve some basic info/instructions like abort mission, some visual feed, shutdown, etc..\u003C/p\u003E\u003Cp\u003EEDIT: My post is replying to the OP.\u003C/p\u003E\u003Cp\u003EEDIT2: I think I must finally check out that KoS thing ((:\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-01T18:24:36Z\u0022 title=\u002203/01/2014 06:24  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 1, 2014\u003C/time\u003E by eurybaric\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-03-01T18:34:42Z","Content":"\n\u003Cp\u003Ei think the jist of what this suggestion is really asking for is npcs. you want things in the universe that are not directly under the control of the player so that the player has something to interact with as part of the mission.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-03-02T13:10:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022coolitic\u0022 data-cite=\u0022coolitic\u0022\u003E\u003Cdiv\u003EYou are basically suggesting auto-pilot but are just using a different word.\u003Cp\u003EAdmins should start banning people who keep posting do not suggest (for a week or so). I don\u0027t necessarily mean you OP\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, autopilot is a control over where you want to go, like mechjeb.\u003C/p\u003E\u003Cp\u003Eautomation is more like The Sims on free-will mode, you don\u0027t control them, and you can only watch as they ruin their life or help their own life.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-03-02T13:11:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nuke\u0022 data-cite=\u0022Nuke\u0022\u003E\u003Cdiv\u003Ei think the jist of what this suggestion is really asking for is npcs. you want things in the universe that are not directly under the control of the player so that the player has something to interact with as part of the mission.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlayer Characters creating Non-Player Characters? Cool.\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-03-02T20:30:20Z","Content":"\n\u003Cp\u003Ethink about it, once the launcher and the space center than operated it does its job, they are done. the satellite or probe get handed over to the control of the people who paid to put it up there. space agencies dont micromanage everything launch. if you take a contract to put up a probe you are done as soon as you separate it, its not your payload.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-03-03T00:05:20Z","Content":"\n\u003Cp\u003EIt all comes down to where you want the wall between \u0022player\u0027s space agency does it\u0022 and \u0022someone else on Kerbin does it\u0022 to exist.\u003C/p\u003E\u003Cp\u003ESometimes the work that real-world people did in the space program is abstracted away so far in the KSP game that the player has no say in them - for example the engineering decisions about the dimensions that rockets and fuel tanks have, and the work to make a liquid engine that won\u0027t blow itself up. These were not easy at all, but the player doesn\u0027t have to worry about them in KSP. The presumption is that other companies handle that and got it all working for you. Whereas, the top-level decision about how to put those parts together, how many stages the rocket should have, and so on are in the player\u0027s hands. So SOME of the stuff is in the player\u0027s hands and some is abstracted away and assumed to be done by other Kerbal people outside the scope of the game. So the question really just boils down to this and this alone: \u003C/p\u003E\u003Cp\u003EGiven that the task of programming a working computer automation system is still a thing done by people, not by the computers themselves, how much of that task should be in the player\u0027s hands and how much of it should be abstracted away and presumed to be done by other people outside the scope of the game?\u003C/p\u003E\u003Cp\u003EThat\u0027s really all it comes down to. Nobody is claiming that an autopilot is unrealistic, just that if it works perfectly out of the box regardless of what the player does, then it removes from the player that aspect of the game and puts \u0022making the autopilot\u0022 into the realm of \u0022stuff the player assumes some other Kerbals somewhere else on Kerbin did for you.\u0022\u003C/p\u003E\u003Cp\u003EThis whole \u0022automation not autopilot\u0022 title is a misnomer. It\u0027s still an autopilot system - but just one in which the player is assumed to be the programmer at the topmost level of putting it together. Only the primitive steps are abstracted away, not the top level decision of how to assemble them together.\u003C/p\u003E\u003Cp\u003EWhether or not the piloting has automated help outside the player\u0027s control is not a boolean yes/no. It\u0027s a continuous sliding scale. Even in the stock game there\u0027s a lot of computerized help for the pilot. Setting a maneuver node and getting a prediction out of it about where it will send you if you burn that way, and whether or not your movement will be timed to coincide with a planet\u0027s arrival and thus form an encounter is a really hairy mathematical problem that your onboard computer is calculating for you.\u003C/p\u003E\u003Cp\u003ESo it\u0027s just a matter of where you want that sliding scale set. It\u0027s never going to be 100% player control (it *already* isn\u0027t in the stock game), nor is it going to be 100% outside the player\u0027s control either (because then why is the player there?).\u003C/p\u003E\u003Cp\u003EAnd furthermore, as the mod kOS demonstrates, having an autopilot doesn\u0027t have to imply having one that other people made. You could have one that YOU made.\u003C/p\u003E\u003Cp\u003ESo the distinction between \u0022player controlling it live as it happens\u0022 and \u0022player controlling it, but doing so ahead of time by making an autopilot\u0022 and \u0022player not in control because somebody else\u0027s autopilot is doing it.\u0022 is important.\u003C/p\u003E\u003Cp\u003EThe arguments that real astronauts don\u0027t have to fly manually and therefore you should let someone else\u0027s software fly for you sort of ignore that rich middle ground between the two of having an autopilot that YOU had a hand in making fly the craft. So you\u0027re not flying in real-time manually but you, ultimately, are still the one responsible for how it flies.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure a thing like kOS is ever going to have wide enough appeal to be in the stock game, because it\u0027s very much the sort of thing that a person who\u0027s done a small amount of programming can pick up quickly but for someone who hasn\u0027t programmed at all before it can be a bit of a steep learning curve.\u003C/p\u003E\u003Cp\u003EBUT, that being said, there may be room for something a bit further on the slider toward \u0022game provides it for you\u0022 than kOS is, but not quite as far over in that direction as, say, making Mechjeb stock would be.\u003C/p\u003E\u003Cp\u003EIf you\u0027ve ever played the old PS1 game called \u0022Carnage Heart\u0022, a thing like that might work. (In the game you programmed your mechs to fight other mechs, and your program was basically a bunch of command tiles you dropped onto a slate to make a visual flowchart.)\u003C/p\u003E\n"},{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-03-03T03:18:58Z","Content":"\n\u003Cp\u003EAn autopilot is a pilots aid, it does things like maintain stability in the 3 axes of flight, maintain a set altitude or air speed. Navigate to waypoints, etc. \u003C/p\u003E\u003Cp\u003E This would in NO WAY aid the player in fly, or navigating or gathering science. It would be HARDER than the current means of gathering science. Because the player would have NO CONTROL over the probe\u0027s flight, other than where it was released. \u003C/p\u003E\u003Cp\u003E As an example:\u003C/p\u003E\u003Cp\u003E The Kerbin surveyor, to me launched from a 200K orbit.\u003C/p\u003E\u003Cp\u003E It would be a \u0022Black Box\u0022 unit, all the player could do is turn it on, and collect it later. \u003C/p\u003E\u003Cp\u003E After being flown to orbit and launched it would \u003C/p\u003E\u003Cp\u003E 1) make a separation burn, \u003C/p\u003E\u003Cp\u003E 2) make a inclination change.\u003C/p\u003E\u003Cp\u003E 3) increase apoapsis by up to 100 KM \u003C/p\u003E\u003Cp\u003E 4) decrease periapsis by up to 100 KM \u003C/p\u003E\u003Cp\u003E 5) turn it\u0027s docking port north.\u003C/p\u003E\u003Cp\u003E It would then be up to the player to go and get the probe to earn their science, instead of the current model which is very grindy, and which adds little gameplay to the game. This stands in stark contrast to the Mechjeb, KOS et al, because it doesn\u0027t aid the player in any aspect of flying, maneuvering or landing. That is why the distinction between autopilot and automation is important. If you classify it as an autopilot on technicalities then it can easily be dismissed under the \u0022what not to suggest\u0022 list. Instead of playing semantics gottcha look at the gameplay enhancements.\u003C/p\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-03-03T04:08:51Z","Content":"\n\u003Cp\u003EEveryone go back on track, this isn\u0027t a debate on what is and what isn\u0027t an autopilot. This thread is good to go, so keep it clean please. Thanks.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-03-03T13:50:27Z","Content":"\n\u003Cp\u003EIf the idea is that an automated probe or rover does its own thing - \u003Cem\u003Ewhile it does not have focus\u003C/em\u003E, that would first require a more fundamental change to ksp so that craft that have no focus (and are out of physics range of the craft that does have focus), can do anything at all other than being on rails.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-03T14:01:38Z","Content":"\n\u003Cp\u003EIt could be implemented in such a way that it changes its orbit Hyperedit style, no need to stay focused on the probe while it does its thing.\u003C/p\u003E\n"},{"CreatedByName":"Tweeker","CreatedById":101796,"CreatedDateTime":"2014-03-03T23:09:20Z","Content":"\n\u003Cp\u003EI was thinking about that, and I wondered if it could simply disappear once it\u0027s beyond the physics boundry, and then reappear after it has run it\u0027s course. Not ideal, but it would require fewer changes to the game.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-03-04T05:35:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tweeker\u0022 data-cite=\u0022Tweeker\u0022\u003E\u003Cdiv\u003E This stands in stark contrast to the Mechjeb, KOS et al, because it doesn\u0027t aid the player in any aspect of flying, maneuvering or landing. That is why the distinction between autopilot and automation is important. If you classify it as an autopilot on technicalities then it can easily be dismissed under the \u0022what not to suggest\u0022 list. Instead of playing semantics gottcha look at the gameplay enhancements.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy are you pretending this is in contrast to kOS when it isn\u0027t? I\u0027ve written kOS scripts that can run an entire mission to Duna and back home with the only player input being to tell it \u0022okay start the next step of my script now\u0022.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-04T11:37:08Z","Content":"\n\u003Cp\u003EBecause the player isn\u0027t deciding the script, if I understand the idea properly.\u003C/p\u003E\n"}]}