{"TopicId":65190,"ForumId":55,"TopicTitle":"EVA tech tree","CreatedByName":"SoulStrife","CreatedById":105252,"CreatedDateTime":"2014-03-08T14:57:39Z","PageNum":1,"Articles":[{"CreatedByName":"SoulStrife","CreatedById":105252,"CreatedDateTime":"2014-03-08T14:57:39Z","Content":"\n\u003Cp\u003EI really think it would be interesting to have a tech tree for EVA kerbals, in the tech tree certain things could be unlocked for your Kerbal such as more EVA monopropellant, better tools (for science production), new abilities such as building struts, etc.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-03-08T15:34:16Z","Content":"\n\u003Cp\u003EThis is an interesting concept. Be that as it may, it does seem like the kind of idea that may be implemented as the game is developed more. I am of the opinion EVAs will be extended on their own, without need of any tech tree, as the game nears 1.0.\u003C/p\u003E\u003Cp\u003EAlso, welcome to the forums! (I notice this is your first post)\u003C/p\u003E\n"},{"CreatedByName":"AwesumnisRawr188","CreatedById":98014,"CreatedDateTime":"2014-03-08T19:59:44Z","Content":"\n\u003Cp\u003EI love this idea! Although it could be added to the current science tree as a branch from the beginning. I would like to see a parachute, like the mods have,but stock, stronger boosters, an auto correction system that makes it so you don\u0027t drift(not sure if it already has this, as I haven\u0027t been on too many EVAs in space except to catch a rocket.), and maybe different aesthetic parts. What I would also like to see is a first person camera of the EVA. That would be AWESOME! That should be in the base game though and already unlocked. \u003C/p\u003E\u003Cp\u003EFantastic Idea imo.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Skyler4856","CreatedById":76452,"CreatedDateTime":"2014-03-09T01:17:03Z","Content":"\n\u003Cp\u003EI would also like to unlock EVA science tools\u003C/p\u003E\n"},{"CreatedByName":"AwesumnisRawr188","CreatedById":98014,"CreatedDateTime":"2014-03-09T01:47:50Z","Content":"\n\u003Cp\u003EIt\u0027d be nice to be able to do different stuff while on EVA.\u003C/p\u003E\u003Cp\u003EIt\u0027d also be nice to be able to build stuff on EVA.\u003C/p\u003E\u003Cp\u003ESomeone could make a mod that introduces a material bay, loaded with materials from Kerbin, that you could assemble on another planet to make a base. The base could consist of stages and to make it easier, each one requires a certain amount of material bays to be added on to it to produce that stage, such as the foundation, windows, and walls, etc.\u003C/p\u003E\u003Cp\u003EThe EVAing Kerbals could each have two tools out of a set, to do different things, so you need more than one to do everything, or atleast two trips to get the tools.\u003C/p\u003E\u003Cp\u003EI\u0027d like to see thermometers for EVA, along with a barometer, anemometer(measures wind, and why don\u0027t we have this?), and other tools like a shovel and stuff.\u003C/p\u003E\u003Cp\u003EThe possibilities!\u003C/p\u003E\n"},{"CreatedByName":"dazhat","CreatedById":59413,"CreatedDateTime":"2014-03-09T16:11:07Z","Content":"\n\u003Cp\u003EI think having no Eva to start with and slowly increasing the quantity of propellant stored and the power of the Eva jets should be part of the tech tree.\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-03-11T09:32:19Z","Content":"\n\u003Cp\u003EI\u0027d like to see a repair tool and a science tool (a Kerbcorder...), so kerbals can fullfil different roles... And suddenly the kerbal you left elsewhere becomes the most important green guy on the planet. Improving EVA through the Tech-Tree would be nice i think.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-03-11T11:15:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frank_G\u0022 data-cite=\u0022Frank_G\u0022\u003E\u003Cdiv\u003EI\u0027d like to see a repair tool and a science tool (a Kerbcorder...), so kerbals can fulfill different roles... And suddenly the kerbal you left elsewhere becomes the most important green guy on the planet. Improving EVA through the Tech-Tree would be nice i think.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0060ve been into different roles for Kerbals for a while now. Also semi automation like \u0060follow this path and check readings then put readings into craft then send readings\u0060\u003C/p\u003E\u003Cp\u003EI\u0060d like the repair ability to have a node on the tech tree. If implemented then in addition to \u0060repair\u0060 there could be \u0060build\u0060 or \u0060unpack\u0060 so that we can finally actually build the Apollo rover( and fit it into the space it should fit into)...\u003C/p\u003E\u003Cp\u003EI like the idea of EVA tech tree integration. The backpack could be on there and as already suggested, extra mono etc.\u003C/p\u003E\u003Cp\u003EMaybe start tied to the hatch with a rope so all you can do is extend and retract the rope and move along ladders (I think that\u0060s not too far from the actual development) then there is a limit to how far from the hatch you can go initially.\u003C/p\u003E\u003Cp\u003EThen EVA would be dangerous without the jetpack...\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-03-11T12:36:27Z","Content":"\n\u003Cp\u003EThe idea of starting EVAs being tied to a winch cable is really kerbal style. I second that for sure.\u003C/p\u003E\u003Cp\u003EAnd there are tons of potential in role based kerbals and automated EVA tasks.\u003C/p\u003E\n"}]}