{"TopicId":65368,"ForumId":55,"TopicTitle":"Several assorted ideas mostly about parts","CreatedByName":"madnessinmysoul","CreatedById":74964,"CreatedDateTime":"2014-03-10T12:04:41Z","PageNum":1,"Articles":[{"CreatedByName":"madnessinmysoul","CreatedById":74964,"CreatedDateTime":"2014-03-10T12:04:41Z","Content":"\n\u003Cp\u003EI\u0027ve made suggestions before, but here are some things I think we really need.\u003C/p\u003E\u003Cp\u003EInfo boxes.\u003C/p\u003E\u003Cp\u003EWhether it\u0027s in the VAB/SPH while we\u0027re building so that we get information about weight and size for the vessel or information logging for flights that we can access to learn from our mistakes, we need more access to raw info. I often toss MechJeb onto projects I\u0027m doing even if I have no intention of using any of its autopilot functions just for this.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPart tweaking\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI know we\u0027re getting more of this with each update, but I have some suggestions on things I\u0027d like to be able to tweak:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMaterials.\u003C/strong\u003E This will be a lot more important in later releases when the tycoon style play becomes a factor. If I\u0027m making a plane and I put a wing on, I should be able to choose what material it\u0027s made of. The materials would impact the weight, cost, heat tolerance, and durability of a part. Hell, for some parts we should be able to tweak the materials for individuals components of parts.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPart customization.\u003C/strong\u003E With some parts it would be great to have more flexibility in changing features without having to use an entirely new part. Having some method to customize things like the number of seats put in a pod, additional resource tanks, heat tiling, and much more would allow us to keep a somewhat more uniform aesthetic with more flexible usage. You could even make it so that there are additions you have to research. Like an internal science unit that takes up the space of 1 seat. It would also be great it we could use this feature to put landing gear as something that folds into another part.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETools\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis would be great for diversifying the science experience. If you want Jeb to take a surface sample, there should be a prerequisite tool you have to have him bring. You could also toss in a golf club and ball for observations of gravity. I\u0027m sure your crazy awesome minds will come up with more individual tools to allow Kerbals to make a wider array of observations for science.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-03-10T13:00:24Z","Content":"\n\u003Cp\u003EI like the idea of tweakables for the \u0022quality\u0022 of parts.\u003C/p\u003E\u003Cp\u003EIt could be as simple as having a slider from \u0022low\u0022 to \u0022high\u0022, low gives you a cheaper, heavier, part. High gives you a lighter, more expensive one. Balanced properly, it could add another mechanic to the game for when contracts come in.\u003C/p\u003E\u003Cp\u003EAnd then heat resistance, durability, etc. could be taken into account if environment ever becomes a factor.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-03-10T14:49:16Z","Content":"\n\u003Cp\u003EPersonally, I think parts should stay the same. What you should be able to tweak is what type of fuel tanks can hold. For example, switching a Jumbo 64 from LH2/O2 to Xenon or just LH2. This would allow some engines to run more realistically (LV-N only uses LH2 instead of LH2/O2.).\u003C/p\u003E\n"},{"CreatedByName":"madnessinmysoul","CreatedById":74964,"CreatedDateTime":"2014-03-10T16:18:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022peadar1987\u0022 data-cite=\u0022peadar1987\u0022\u003E\u003Cdiv\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like your basic idea, making it a lot easier than my more complex one. Though maybe simply \u0027quality\u0027 is a bit too simple. Maybe some parts would be \u0027quality\u0027 and other parts would have a slider with basic variants. Like \u0027high durability\u0027 or \u0027fragile\u0027 or \u0027high strength/low weight\u0027. Light doesn\u0027t always have to mean expensive, it can also mean kind of crappy.\u003C/p\u003E\n"},{"CreatedByName":"peadar1987","CreatedById":81207,"CreatedDateTime":"2014-03-10T16:37:22Z","Content":"\n\u003Cp\u003EMaybe there could be two or three sliders (or more, or less, depending on the part)\u003C/p\u003E\u003Cp\u003ESo you have \u0022quality\u0022, \u0022durability\u0022, and \u0022heat resistance\u0022. Increasing quality reduces weight, but increases cost. If you want it to be cheaper (light and crappy), you can leave the \u0022quality\u0022 slider where it is, and slide the \u0022durability\u0022 and \u0022heat resistance\u0022 sliders all the way to the left.\u003C/p\u003E\u003Cp\u003EIf that was combined with dynamically updating the display of the weight, heat and impact tolerances (and someday a stock Kerbal Engineer), it would be great\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-03-10T17:06:46Z","Content":"\n\u003Cp\u003EI don\u0027t think the amount of seats in a pod could be made tweakable. Think about the IVA\u0027s.\u003C/p\u003E\n"}]}