{"TopicId":65615,"ForumId":55,"TopicTitle":"advanced tweakables","CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2014-03-13T00:08:41Z","PageNum":1,"Articles":[{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2014-03-13T00:08:41Z","Content":"\n\u003Cp\u003ENow that we have tweakables I think it would be a good idea to make it possible to enter a value of the amount of stuff in an item \u003C/p\u003E\u003Cp\u003EE.g.\u003C/p\u003E\u003Cp\u003EYou\u0027ve picked up the LV-T30 and you want exactly 55.25% thrust.\u003C/p\u003E\u003Cp\u003EWhat you do is put into a type box underneath the slider 55.25%\u003C/p\u003E\u003Cp\u003EAnd there you go the engine now only produces 55.25% thrust at 100% power.\u003C/p\u003E\u003Cp\u003EThe same could be done for reputable and batteries.\u003C/p\u003E\u003Cp\u003EThis could also be used while on feul transfer. \u003C/p\u003E\u003Cp\u003EFor feul transfer you just type the amount of fuel you want from one tank to another.\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-03-13T02:31:31Z","Content":"\n\u003Cp\u003EI sorta like the thrust idea, and the fuel idea but i feel it should be hidden unless you click on something else to input it. As the r click menus can get pretty big and confusing with to many inputs. This shouldn\u0027t be always there, as big fuel transports work just fine as is( out and in button)\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2014-03-13T07:50:50Z","Content":"\n\u003Cp\u003EI think this is a fine idea. another thing I would like to see in regards to tweakables is the inclusion of a \u0022hold ratio\u0022 button. Basically, if want a fuel a tank with half the amount of liquid fuel and the appropriate amount of oxidizer, I could press \u0022hold ratio\u0022, slide the liquid fuel back, and the oxidizer would adjust accordingly. This would also work on other fuel ratios of course, and would allow a greater degree of precision and customisability\u003C/p\u003E\n"},{"CreatedByName":"possum","CreatedById":84085,"CreatedDateTime":"2014-03-13T13:36:47Z","Content":"\n\u003Cp\u003EI really like the idea of being able to type the amount of fuel for fuel transfers.\u003C/p\u003E\n"}]}