{"TopicId":67245,"ForumId":55,"TopicTitle":"Community interest in Gas planet 2","CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-03-30T18:39:10Z","PageNum":6,"Articles":[{"CreatedByName":"StainX","CreatedById":57820,"CreatedDateTime":"2014-04-28T12:54:45Z","Content":"\n\u003Cp\u003EWould be even better to have another solar system we could travel to...\u003C/p\u003E\n"},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2014-04-28T12:59:30Z","Content":"\n\u003Cp\u003EPretty much. If they did add another planet how long would it take you before you became board. Then what? Squad adds another planet and the cycle starts all over again.\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2014-04-28T16:58:25Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E1:\u003C/strong\u003E if there is going to be a second GP I don\u0027t really care only if it has a selection of moons like Jool. I mean just a gas planet isn\u0027t very interesting. Unless it\u0027s not really a gasplanet but a super planet with a abnormally thick oxygen atmosphere for the battle hardened giving them a change to launch from a body even harder to orbit contrary to eve.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E 2:\u003C/strong\u003EI believe I heard there are mods that add aditional planets to the current kerbal planetary system with orbits further then Eelo. I think one mod contained a second GP. I don\u0027t have the name of the mod but now that you know I\u0027\u0027m sure your willing to search for it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E 3:\u003C/strong\u003E IMO there are far more valuable updates for the game to be considered. Like massive bug fixing. The further development of the career mode like finishing the economic part, adding biomes to all the planets and etc, etc.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E@StainX\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAdding a second solar system is to one of my greatest wishes. However a second star system goes against the code of the game for some reason.\u003C/p\u003E\u003Cp\u003EOtherwise I might have assumed somebody already modded a 2nd solar system.\u003C/p\u003E\u003Cp\u003EThe same issue goes for the Space flight simulator Orbiter where game code also locks the possibility of a 2nd additional star.\u003C/p\u003E\u003Cp\u003EI also believe the issue involved for both Orbiter and ksp is the transistence of SOI and the switch over of 2 individual light sources of 2 stars.\u003C/p\u003E\u003Cp\u003EExspecially since KSP tends to keep planetary thus also star distances at an arcade meassured distance.\u003C/p\u003E\u003Cp\u003EBy distancing yourself from kerbol no light fade is simulated. And if it were simulated it would still mean you had to travel several hundred billion kilometres away form Kerbol before it would be realistic to SOI to another star. Which could be made comfortable by higher time warp settings. \u003C/p\u003E\u003Cp\u003EAnd then comes the issue of navigating to another star.\u003C/p\u003E\u003Cp\u003EIn order to navigate to another star you need a 3rd SOI presenting the center of the galaxy.\u003C/p\u003E\u003Cp\u003EJust like traveling to another planet you don\u0027t travel to another star by just pointing at it and hit the gas.\u003C/p\u003E\u003Cp\u003ETraveling towards another star at interplanetary speeds is impossible in the scenario you want to reach a star at your six o clock in the motion you are spiralling through the galaxy.\u003C/p\u003E\u003Cp\u003ESo you would have to retrograde burn relative to the center of mass of the galaxy first if you want to reach a star in the galaxy thats spiralling behind you and you have to do a massive radial out burn to prevent your spacecraft from spiralling towards the galactic core. Even in the arcade like KSP universe this interstellar encounter would require 10-20000 units of delta V at the least just for a one way trip.\u003C/p\u003E\u003Cp\u003ESo in addition a futuristic propulsion method must be implemented. And I believe KSP isn\u0027t based on futuristic spaceflight capabilities.\u003C/p\u003E\u003Cp\u003EThe only possibility would be to add a closeby twin star. Either generating 2 light sources with decent light fade which ksp doesn\u0027t yet simulate. Although to make that even remotely realistic ksp should throw the SOI model out of the window as 2 closeby twin stars Always interact on each other. Meaning you would have to need 2 interacting SOI\u0027s at once. In fact this SOI model already proves itself highly unrealistic in the Joolian system of moons where a real spacecraft could not navigate as how it does in KSP today.\u003C/p\u003E\u003Cp\u003EOr place the twin star far outside the realm of Kerbol which would still require the simulation of a galactic core.\u003C/p\u003E\u003Cp\u003EEither adding a 2nd star into the system is going to be completely unrealistic and arcade like neglecting the issues I mentioned above. Or it is going to implement the fixes needed to accomodate the realism factors for interstellar travel and KSP needs a overhaul greater then the actual code already written as it is in her current state.\u003C/p\u003E\u003Cp\u003ESo I agree with you, I to want a 2nd solar system. But will it happen... most likely not.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-28T17:04:14Z\u0022 title=\u002204/28/2014 05:04  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 28, 2014\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-04-28T17:06:49Z","Content":"\n\u003Cp\u003EI think Biomes for the other planets will be next; then hopefully they can flesh-out any new planets they decide to add before they get put in \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis way, we can\u0027t get so bored easily... especially if they add in another gameplay mechanic in .24 or .25...\u003C/p\u003E\n"},{"CreatedByName":"4nxs","CreatedById":80680,"CreatedDateTime":"2014-04-28T17:24:26Z","Content":"\n\u003Cp\u003EI would like squad to first finish adding all the biomes to the existing bodies and adding more stuff to do on and around the bodies before making gp2. Things like more extended ways of doing science.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-28T17:52:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vaporized Steel\u0022 data-cite=\u0022Vaporized Steel\u0022\u003E\u003Cdiv\u003EAdding a second solar system is to one of my greatest wishes. However a second star system goes against the code of the game for some reason.\u003Cp\u003EOtherwise I might have assumed somebody already modded a 2nd solar system.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EAnd they have. I don\u0027t know the mod name but the star is called Serious. It\u0027s done orbiting the Kerbol like a planet, for which the patched conic approximation is accurate enough if it\u0027s sufficiently low mass and far away from the planets orbiting Kerbol. I don\u0027t know how or even if the lighting was done, but that\u0027s mainly eye candy anyway that doesn\u0027t really matter for playing the game (though the messed-up day/night cycle could annoy).\u003Cp\u003EEdit: Also, biomes just make the game more boring by encouraging repeating the same mission rather than going to new places. Actual diverse terrain, beyond the current anomalies that are nigh-impossible to find without mods or looking them up, is what\u0027s needed to make things more interesting. But that\u0027s a tall order considering even KSP\u0027s baby planets are the size of large countries. In terms of explorable land area KSP isn\u0027t as big as Minecraft, but it dwarfs the likes of Daggerfall or LOTR online. It\u0027s a challenge to make that much space interesting and not samey. (Heck, you can argue the actual solar system has failed in that respect!)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-28T18:15:28Z\u0022 title=\u002204/28/2014 06:15  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 28, 2014\u003C/time\u003E by cantab\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Iforgotthis","CreatedById":102487,"CreatedDateTime":"2014-04-28T20:33:25Z","Content":"\n\u003Cp\u003EI\u0027d quite like to see more bodies with atmospheres in the future. I love places with atmospheres, but I feel there isn\u0027t enough. Perhaps if GP2 had some moons with atmospheres, and the moons were really bizarre and completely different to anything else. I love being surprised, so plausible yet still surreal places are the ones I\u0027d like to see. \u003C/p\u003E\u003Cp\u003EObviously I\u0027m not talking about absolutely ridiculous things, just planets with plant based ecosystems (different to Kerbin\u0027s) or with unusual coloured atmospheres or oceans, things like that.\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2014-04-28T20:42:19Z","Content":"\n\u003Cp\u003E@cantab\u003C/p\u003E\u003Cp\u003EThanks I\u0027ll give it a look. Although quite honestly I won\u0027t Judge such a mod even as a star. Perhaps a GP2 lol. I could treat it in my imagination as a dwarf star orbiting kerbol. Personally I\u0027m about realism, I believe the dev thinks the same about the future of ksp. So the day/night cycle eye candy thing does certainly annoy. For me to really Judge additive stars as plausible ones they need the realism requirements I mentioned, which is a hardcoded program thingy the devs themselves one day have to implement.\u003C/p\u003E\u003Cp\u003EI like your idea about terrain. And you gave me a brilliant idea there. What if every planet out there was littered with treasure maps ( I call it treasure maps but make it what you want) that puzzle you towards eventually finding easter eggs aka landmarks on each celestial body. Maybe even give science for it in the process of finding them.\u003C/p\u003E\u003Cp\u003EAs for making planets interesting I definitely agree. I would actually like it if rocks were solid instead of moving through them. As for the solar system. Earth is just the best place around here. To me the most varied landscapes in the solar system besides earth are that of Io, titan and Europa. And even they seem \u0022samey\u0022 in the appearence of earths large variety of climate, soil, vegetation and culture.\u003C/p\u003E\u003Cp\u003ESo even although it is to my wishes for bodies in ksp to become places of sightseeing their terrain I think that with much effort on the developers side it will Always remain \u0027samey\u0027\u003C/p\u003E\u003Cp\u003EOh, and I find your Sig absolutely hilarious btw:sticktongue:\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-04-30T00:31:41Z","Content":"\n\u003Cp\u003EThe devnotes today mention \u0022expanding the KSP universe\u0022. I wonder what that means...\u003C/p\u003E\n"},{"CreatedByName":"Sophistry","CreatedById":106653,"CreatedDateTime":"2014-04-30T01:07:31Z","Content":"\n\u003Cp\u003EFor those who want a second solar system, I wonder if the way forward is to make the Kerbol system a detached binary star system; that way you could make another \u0022solar system\u0022 around the other star, and have it a lot closer than a proper \u0022other solar system\u0022 would be. The main point is it would be reachable in a reasonable timeframe and did not require KSP to include some kind of FTL.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-04-30T14:17:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sophistry\u0022 data-cite=\u0022Sophistry\u0022\u003E\u003Cdiv\u003EFor those who want a second solar system, I wonder if the way forward is to make the Kerbol system a detached binary star system; that way you could make another \u0022solar system\u0022 around the other star, and have it a lot closer than a proper \u0022other solar system\u0022 would be. The main point is it would be reachable in a reasonable timeframe and did not require KSP to include some kind of FTL.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I think this is really the only way to do it, and not have it take decades/centuries to get there (without mods, or FTL of some kind). Binary system is the way to go.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-04-30T15:17:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NecroBones\u0022 data-cite=\u0022NecroBones\u0022\u003E\u003Cdiv\u003EYes, I think this is really the only way to do it, and not have it take decades/centuries to get there (without mods, or FTL of some kind). Binary system is the way to go.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcept: the physics engine can\u0027t have multiple gravity sources overlapping (they can be inside of each other, but can\u0027t affect each other.). Also, if the game is to be realistic, then why should we have it where every star is grouped together? Wouldn\u0027t that destabilize the system? I would find it fun if we could tell STL people where they can shove it. (I have ideas on how to balance FTL, but I digress).\u003C/p\u003E\n"},{"CreatedByName":"CalMacDa","CreatedById":133064,"CreatedDateTime":"2014-12-29T08:10:08Z","Content":"\n\u003Cp\u003EI strongly disagree with Squad\u0027s motion to keep improving career mode. After you have completed career mode, it is just a waste of space. Gas Planet 2 gives something more for KSP players to explore, conquer, and challenge others to, and Jool was extremely successful in this. Jool is the most liked planet including moons in the game. Another Jool like planet would be nice, and would be a great implement for the future. Eeloo would still be in the mix and there would be more moons to conquer and another great addition to the Kerbol System\u003C/p\u003E\u003Cp\u003E1 more thing: if you are going to add yet another outer planet, give another time warp mode that is 10x higher\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T08:14:26Z\u0022 title=\u002212/29/2014 08:14  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by CalMacDa\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CalMacDa","CreatedById":133064,"CreatedDateTime":"2014-12-29T08:18:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sophistry\u0022 data-cite=\u0022Sophistry\u0022\u003E\u003Cdiv\u003EFor those who want a second solar system, I wonder if the way forward is to make the Kerbol system a detached binary star system; that way you could make another \u0022solar system\u0022 around the other star, and have it a lot closer than a proper \u0022other solar system\u0022 would be. The main point is it would be reachable in a reasonable timeframe and did not require KSP to include some kind of FTL.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is a spectacular idea. Binary star systems are very common in the milky way, so it would be realistic, and it would open up a whole new gravitational challenge. I didn\u0027t even think of this! This is an amazing idea! \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003EPS. sorry admins, for posting two in a row. please don\u0027t take privileges from me!\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-12-29T08:26:22Z","Content":"\n\u003Cp\u003EWell, there is a great demand for some new Planets and Moons and I think we will get something new in the future.\u003C/p\u003E\u003Cp\u003EMy only concern is, that I dont know where Squad could put them as Space gets very quirky and Kraken-infested past Dres. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-12-29T08:46:01Z","Content":"\n\u003Cp\u003EI have no strong feeling either way, but if they were to include a gas planet PLEASE give it rings so that I have an excuse to buzz my spacecraft through them! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2014-12-29T09:24:44Z","Content":"\n\u003Cp\u003EOuter planets, rings and an asteroid belt would be a nice challenge.\u003C/p\u003E\n"},{"CreatedByName":"MalfunctionM1Ke","CreatedById":71626,"CreatedDateTime":"2014-12-29T10:01:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Janos1986\u0022 data-cite=\u0022Janos1986\u0022\u003E\u003Cdiv\u003EOuter planets, rings and an asteroid belt would be a nice challenge.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think an Asteroid belt is not possible on a 32-bit Infrastructure as the RAM usage would exceed the 3-4GB-Limit very easily.\u003C/p\u003E\u003Cp\u003EThat is why the current asteroids, which show up around Kerbin, come out of the blue and and you lose track of them over time, if you are not \u0022tracking\u0022 them.\u003C/p\u003E\u003Cp\u003EThe whole purpose is to keep the RAM from overflowing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EI have no strong feeling either way, but if they were to include a gas planet PLEASE give it rings so that I have an excuse to buzz my spacecraft through them! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think same goes for the Rings around a Planet.\u003C/p\u003E\u003Cp\u003EMaybe we can have at lease some grainy clouds around a planet but no particles that react to ships flying through them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T10:05:03Z\u0022 title=\u002212/29/2014 10:05  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by MalfunctionM1Ke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-12-29T10:04:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MalfunctionM1Ke\u0022 data-cite=\u0022MalfunctionM1Ke\u0022\u003E\u003Cdiv\u003EI think an Asteroid belt is not possible on a 32-bit Infrastructure as the RAM usage would exceed the 3-4GB-Limit very easily.\u003Cp\u003EThat is why the current asteroids, which show up around Kerbin, come out of the blue and and you lose track of them over time, if you are not \u0022tracking\u0022 them.\u003C/p\u003E\u003Cp\u003EThe whole purpose is to keep the RAM from overflowing.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut if all the asteroids use the same texture, and current system (stored as single part vessels) surely it would allow large quantities of asteroids to be simulated without being loaded (I.e 2.5km range)?\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2014-12-29T10:04:43Z","Content":"\n\u003Cp\u003EYeah, exactly what he said.\u003C/p\u003E\u003Cp\u003EThe only problem would be the constant stuttering when loading approaching asteroids.\u003C/p\u003E\u003Cp\u003EBut a man can dream, you know.\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2014-12-29T11:03:43Z","Content":"\n\u003Cp\u003EAs much as I\u0027d love new stuff to explore such as new planets, and or tweaks to existing ones, the main focus for squad should be (and I believe is) getting the game as a whole working and as balanced as possible. \u003C/p\u003E\u003Cp\u003E I\u0027m not a programmer, but new \u0027planets etc\u0027 AFAIK would be relatively easy to implement later when everything works as they want. Undoubtedly lots of design and graphic work etc, but not like getting the game play and UIs optimised and working properly which is the core of the game. \u003C/p\u003E\u003Cp\u003E Cool stuff to explore is great and yes I want more, but if the game play is optimised first then the whole experience will be better for all IMHO.\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2014-12-29T13:42:50Z","Content":"\n\u003Cp\u003EWhat I would love to see, in the case of rings, is having random moonlets be generated in them. Would be cool for mining.\u003C/p\u003E\u003Cp\u003EMy main question at this point is just what kind of Delta-V it would require to reach. Without aerocapture Jool is already quite difficult.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022pandaman\u0022 data-cite=\u0022pandaman\u0022\u003E\u003Cdiv\u003E I\u0027m not a programmer, but new \u0027planets etc\u0027 AFAIK would be relatively easy to implement later when everything works as they want. Undoubtedly lots of design and graphic work etc, but not like getting the game play and UIs optimised and working properly which is the core of the game. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBalancing will probably have to wait until after the Aerodynamics rework. Even then 90% of work with balancing is having the game playtested to hell and back to pick up the things that just looking at the changed numbers in the spreadsheet doesn\u0027t. Actual coding work is changing a value in a few lines, the main problem is knowing what and to what you need to change. Which is why playtesting is needed. It is not a much of a manpower sink taking away people from work on say planets or other content. UI tweaking possibly is, but then again it doesn\u0027t need more than one person working on that (and more people does not equal it being done proportionally faster due to how coding works). \u003C/p\u003E\u003Cp\u003EIt is quite reasonable to assume a new planet, or indeed other features, can developed simultaneously with the mentioned balancing and UI tweaks being done, without a drop in productivity as far as those tweaks alone are concerned. Basically it is impossible to use all the available people on the team on just those two tasks, too many people and too varied skillet.\u003C/p\u003E\n"},{"CreatedByName":"spinomonkey","CreatedById":102142,"CreatedDateTime":"2014-12-29T16:24:01Z","Content":"\n\u003Cp\u003EThough another planet would be nice. I think there\u0027s still loads of work to be done to the current planets. Fix whats already here, then add more. \u003C/p\u003E\u003Cp\u003EI\u0027m also all for discovering them with a observatory. Seems weird you have instant access to so much planetary info yet your kerbals can barely make orbit lol.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-12-29T16:26:36Z","Content":"\n\u003Cp\u003EI\u0027d love a GP2. \u0027nuff said.\u003C/p\u003E\u003Cp\u003EOkay, maybe not enough said. Yes, the other planets need to be made more interesting too. Laythe with volcanoes, for instance? All of the planets after Duna need interesting physics mechanicsms to drive them. Cryovolcanics on Vall and Eeloo; Volcanoes and Storms on Laythe, Storms on Jool and GP2, An atmosphere on Eeloo, even storms on Duna and Eve. Moho might be given back it\u0027s heated atmosphere, perhaps to a lesser extent.\u003C/p\u003E\u003Cp\u003EEvery single planet must be worth visiting. Even Dres. The only way I can think of making Dres interesting is to give it either a moon system of it\u0027s own or make it spin quickly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T16:44:16Z\u0022 title=\u002212/29/2014 04:44  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by GregroxMun\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-29T16:29:08Z","Content":"\n\u003Cp\u003EOld thread is old, but the desire for Gas Planet 2 is still strong.\u003C/p\u003E\n"}]}