{"TopicId":67735,"ForumId":55,"TopicTitle":"Selectable Fuel Types for tanks","CreatedByName":"Spyre2000","CreatedById":102919,"CreatedDateTime":"2014-04-02T22:11:08Z","PageNum":1,"Articles":[{"CreatedByName":"Spyre2000","CreatedById":102919,"CreatedDateTime":"2014-04-02T22:11:08Z","Content":"\n\u003Cp\u003EThe fact that curtain tanks have specific fuels assigned to them make it difficult to design the ships I want, both in terms of looks and functionality. For some designs I want a nice wide 2.5m tank to keep the look of the ship and other times the only fuel tanks available are so small that adding a lot of them causes wobbling issues thanks to jello joint system the game uses. The large number of parts also bogs down your PC. \u003C/p\u003E\u003Cp\u003EAfter completing the campaign a couple times and moving on to mods the problem has only gotten worst. Several mods add new engines and fuel types to the game which is great. However these new fuel types require tanks of their own which often don\u0027t have the same variety of selection as the Stock tanks. This limits the design choice in terms of looks and tank sizes but also increase the total number of parts in the game which seems to negatively effect performance. \u003C/p\u003E\u003Cp\u003EMy suggestion is that various tanks actually have a range of fuel types available to them. You pick what type of fuel the tank holds in the VAB/SAB when building your ship. That way if you say wanna build a SSTO vehicle with a large fuel only tank you can, instead of being limited to the few fuel only tanks listed. This would also help out modders as well since they could simply add their new fuel types to the stock tanks that they want without needing to add a bunch of new parts that are effectively the same as some of the existing parts, just with different fuel type.\u003C/p\u003E\n"},{"CreatedByName":"Joonatan1998","CreatedById":97636,"CreatedDateTime":"2014-04-02T22:55:19Z","Content":"\n\u003Cp\u003EIf mods add only a few tanks for new fuels it is their fault, and may be important for balance.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-02T23:37:24Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64117\u0022 rel=\u0022external nofollow\u0022\u003EModular Fuel Tanks\u003C/a\u003E is a mod that allows you to change which fuels are in a particular tank, with the added bonus of custom procedural tanks (perfect if you care about how your ship looks). It\u0027s been updated for 23.5, you should give it a try.\n"}]}