{"TopicId":68352,"ForumId":55,"TopicTitle":"Make fuel flow both ways through couplers","CreatedByName":"iMAniaC","CreatedById":94023,"CreatedDateTime":"2014-04-06T08:56:48Z","PageNum":1,"Articles":[{"CreatedByName":"iMAniaC","CreatedById":94023,"CreatedDateTime":"2014-04-06T08:56:48Z","Content":"\n\u003Cp\u003EI\u0027m sorry if this has been mentioned before (actually, I\u0027d be surprised if it hasn\u0027t), but I did a quick search and couldn\u0027t find it, so here goes:\u003C/p\u003E\u003Cp\u003EBasically, I think it would be nice if both of these designs were working:\u003C/p\u003E\u003Cp\u003EThis currently works:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fgFMZ9V.jpg\u0022 alt=\u0022fgFMZ9V.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis currently doesn\u0027t work:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4NZoHSC.jpg\u0022 alt=\u00224NZoHSC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E(In case it\u0027s hard to see from the screenshots: The design that works has a tank on top with a Tri-Coupler the right way (i.e. the default orientation in the VAB) underneath and three engines connected to the Tri-Coupler. The design that doesn\u0027t work has three tanks on top with a Tri-coupler upside down (i.e. flipped and rotated compared the default orientation in the VAB) underneath and one engine connected to the Tri-coupler).\u003C/p\u003E\u003Cp\u003EI figure that there\u0027s a problem with the fuel only flowing in one direction through the Tri-Coupler. In essence, it would be nice for the fuel to flow both ways \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Although I haven\u0027t tested, I guess this goes for all Couplers and possibly also the Adapters.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-04-06T09:00:10Z","Content":"\n\u003Cp\u003ESorry but this would require a total rewrite of the craft code and break pretty much everything that\u0027s been built before, his is why we have fuel lines as well, and struts as only one of those tanks is attached to that tricoupler.\u003C/p\u003E\u003Cp\u003EThis has come up before in various guises, it just isn\u0027t going to happen.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-04-06T09:16:39Z","Content":"\n\u003Cp\u003EThis isn\u0027t so much making sure fuel flows, as making parts actually link up that way. For now, they don\u0027t, and as Sal said, they\u0027d have to redesign the editing spaces and the craft files in order to be able to make it work.\u003C/p\u003E\n"},{"CreatedByName":"iMAniaC","CreatedById":94023,"CreatedDateTime":"2014-04-06T10:54:44Z","Content":"\n\u003Cp\u003EOh, okay. I was holding off on this suggestion prior to the new version of Unity, but I thought it was worth giving it a shot after the mention of the new Unity version in the ARM patch. I guess I\u0027ll have to continue using fuel lines, then \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-04-06T11:26:49Z","Content":"\n\u003Cp\u003EIf you run a search for part attachment or something like that through the forums, you might find one of the older threads that had a huge discussion on it. There were some quality ideas that got tossed around, but for now it seems like recoding the editor isn\u0027t too high on Squad\u0027s to-do list. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-06T23:11:31Z","Content":"\n\u003Cp\u003EI vaguely recall reading the fuel flow through the tri-couplers was made one way on purpose, to stop issues with uneven fuel drainage. In your second example, if fuel did flow all ways through the tri-couplers and no other changes were made you might find two of the tanks drained fully before the third started emptying, which would really send your rocket off course, and be somewhat counter-intuitive to diagnose.\u003C/p\u003E\u003Cp\u003EOf course, it does mean arrangements like this, despite not having the apparent loop issue, won\u0027t work either.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/mQNxc2\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm3.staticflickr.com/2836/13679407243_e04a4b40e6_c.jpg\u0022 alt=\u002213679407243_e04a4b40e6_c.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(And before anyone asks, no it\u0027s not the lander can blocking the flow. Fuel flows through that just fine.)\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-07T04:55:13Z","Content":"\n\u003Cp\u003EDrawing fuel from the multiside of a coupler was very likely removed on purpose.\u003C/p\u003E\u003Cp\u003EIn any case, if you need to drain fuel this way, this works:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/C1jFezs.jpg\u0022 alt=\u0022C1jFezs.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T04:57:16Z\u0022 title=\u002204/07/2014 04:57  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-07T05:00:10Z","Content":"\n\u003Cp\u003EWell, if I recall, the couplers are some sort of an exception to the part hierarchy.\u003C/p\u003E\u003Cp\u003EThis means it would be tough to code this up.\u003C/p\u003E\u003Cp\u003EAlthough, as Kasuha mentioned, a setup using fuel lines is possible, but it does add more parts, which may be undesirable.\u003C/p\u003E\n"}]}