{"TopicId":68807,"ForumId":55,"TopicTitle":"Fix Kerbals so they dont drift or fall off ladder when going EVA","CreatedByName":"Rizendell","CreatedById":67958,"CreatedDateTime":"2014-04-09T19:23:34Z","PageNum":1,"Articles":[{"CreatedByName":"Rizendell","CreatedById":67958,"CreatedDateTime":"2014-04-09T19:23:34Z","Content":"\n\u003Cp\u003EEver EVA and fall straight off the ladder? Ever EVA and drift off into space? Ever notice that if you EVA in space, your kerbal experiences a phantom drift along the ladder while you are not doing anything? \u003C/p\u003E\u003Cp\u003EEver grab a ladder in space and then get catapulted away from your vehicle at ridiculous speed?\u003C/p\u003E\u003Cp\u003EI suggest that Kerbals get an arm strengthening workout program in order to fix these mishaps. I for one am tired of unexpected behavior, never knowing what will happen when you press EVA, or attempt to grab hold of a ladder/pod.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-09T19:28:50Z","Content":"\n\u003Cp\u003EI agree with this suggestion.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-09T19:56:15Z","Content":"\n\u003Cp\u003EThis is taken from my recent reply to a thread about this exact problem.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027ve had similar problems. The solution is simple: Make sure that you are moving as little as possible when you \u0022Press \u0027F\u0027 to Grab\u0022. If possible, try to align the ladder in such a way that it is extremely easy to float the Kerbal to and latch on. If the ladder is (relative to your Kerbal) on the underside of the craft, rotate it so the ladder is parallel to the Kerbal when using the jetpack.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo yeah, it\u0027s a simple fix. Hope it helps!\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2014-04-09T21:17:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maximus97\u0022 data-cite=\u0022Maximus97\u0022\u003E\u003Cdiv\u003ESo yeah, it\u0027s a simple fix. Hope it helps!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood tips, but not always simple, and not always effective. If you\u0027re already out of the craft and don\u0027t have a kerbal inside the craft to aim it, you\u0027re out of luck, and I\u0027ve found not being thrown around to be far more about luck than whether I\u0027m moving or not.\u003C/p\u003E\u003Cp\u003EThe problem is particularly bad if you\u0027ve got anything interfering with movement (a lander with fuel tanks that come up above the bottom of the command pod, for example).\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-04-09T22:40:45Z","Content":"\n\u003Cp\u003EYeah, I tried adding extra ladders to the horizontal portion to prevent \u0027falling\u0027 off the lander. It doesn\u0027t seem to work as well as it probably should. There\u0027s a lot of things about ladders that seem hit-or-miss, and need a bit of extra love.\u003C/p\u003E\n"},{"CreatedByName":"UberFuber","CreatedById":90736,"CreatedDateTime":"2014-04-10T00:43:40Z","Content":"\n\u003Cp\u003EI agree, the current ladder system is a bit... bizzare to say the least.\u003C/p\u003E\u003Cp\u003EOn one hand, Kerbal seems to have trouble holding onto a ladder despite the spaceship it\u0027s attached to barely rotating when they go into EVA.\u003C/p\u003E\u003Cp\u003EOn the other hand, once they\u0027re on the ladder, a 4000\u002Bm/s reentry didn\u0027t even phase them.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-04-10T12:03:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UberFuber\u0022 data-cite=\u0022UberFuber\u0022\u003E\u003Cdiv\u003EI agree, the current ladder system is a bit... bizzare to say the least.\u003Cp\u003EOn one hand, Kerbal seems to have trouble holding onto a ladder despite the spaceship it\u0027s attached to barely rotating when they go into EVA.\u003C/p\u003E\u003Cp\u003EOn the other hand, once they\u0027re on the ladder, a 4000\u002Bm/s reentry didn\u0027t even phase them.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELots of this. I find it silly that we can go through re-entry on a ladder but can\u0060t grab one in free fall. Less insanity when grabbing and a similar check to solar panels when re-entering atmosphere to see when you fall off. (some people will want EVA parachutes so they can be the crazy Kerbal Milk Tray man)\u003C/p\u003E\n"},{"CreatedByName":"S4qFBxkFFg","CreatedById":83727,"CreatedDateTime":"2014-04-10T14:31:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rizendell\u0022 data-cite=\u0022Rizendell\u0022\u003E\u003Cdiv\u003EEver EVA and drift off into space? Ever notice that if you EVA in space, your kerbal experiences a phantom drift along the ladder while you are not doing anything?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is \u003Cem\u003Eextremely\u003C/em\u003E irritating; does anyone actually know what causes it?\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-10T21:18:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EIf you\u0027re already out of the craft and don\u0027t have a kerbal inside the craft to aim it, you\u0027re out of luck\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDing ding ding! We have a winner!\u003C/p\u003E\u003Cp\u003ENO, you are NOT out of luck! All you gotsa do is use the mouse and \u0022drag\u0022 the Kerbal around with the mouse. If you do this with the jetpack out, you can change the Kerbal\u0027s orientation so it always isn\u0027t the standard straight-up-and-down, fixed-to-the-camera orientation. It is a difficult operation if you\u0027re not experienced at doing it, and may require much practice and frustration before it becomes easy.\u003C/p\u003E\u003Cp\u003ESo yep, there\u0027s a fix to the \u0022broken\u0022 fix. Hope this helps more than the last one!\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-11T00:35:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maximus97\u0022 data-cite=\u0022Maximus97\u0022\u003E\u003Cdiv\u003EIt is a difficult operation if you\u0027re not experienced at doing it, and may require much practice and frustration before it becomes easy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOr they could, you know... fix it.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-04-11T01:32:35Z","Content":"\n\u003Cp\u003EOf course. All I\u0027m offering is a way to do it without bothering the Devs too much, about a minor issue. I too would like to see a fix, truth be told... This is just the workaround I\u0027ve learned through my hours upon hours in virtual space \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}