{"TopicId":69885,"ForumId":55,"TopicTitle":"Acheivements with Abstraction hooks.","CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2014-04-19T20:07:41Z","PageNum":1,"Articles":[{"CreatedByName":"Ruedii","CreatedById":57704,"CreatedDateTime":"2014-04-19T20:07:41Z","Content":"\n\u003Cp\u003EIt would be good if Achievements are put into the game to do so using an abstracted library. This way all the different platforms, including Squad\u0027s own KSP Forums could be supported equally using the same set of achievements. \u003C/p\u003E\u003Cp\u003EThe current list of online achievement platforms is growing, and we all know how the Squad devs feel about locking into any one achievement platform, due to their response to the request to have Steam Achievements. The best solution would be to call any and all achievement libraries set up by the user from the main Squad achievement library. This way you can have achievements for every distribution platform, without having to change the game binary. \u003C/p\u003E\u003Cp\u003EFurthermore, mod developers could utilize listeners to this abstraction library to provide all sorts of added functions, for example, the Final Frontier mod could have it\u0027s code greatly streamlined, or a Stat tracking mod for multi-player servers could compare the various stats of players and even publish them on the server\u0027s web-page.\u003C/p\u003E\u003Cp\u003EOf course, I\u0027d also like to note, that no official achievement system should be made until after the game is at it\u0027s final state. This is because the balance of the game will likely change drastically before the final release, as it has already.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-04-19T21:22:49Z","Content":"\n\u003Cp\u003EI always hated achievements, so I\u0027m going for a hell no\u003C/p\u003E\u003Cp\u003EIt\u0027s especially bad with immersion games, but just as bad with everything else.\u003C/p\u003E\u003Cp\u003EHere I am getting sucked into a game world, do some random thing, and suddenly I get a popup basicly saying \u0022ATTENTION: YOU ARE PLAYING A GAME\u0022\u003C/p\u003E\n"},{"CreatedByName":"TinfoilChef","CreatedById":43840,"CreatedDateTime":"2014-04-20T18:59:35Z","Content":"\n\u003Cp\u003EThe only \u0022achievements\u0022 that I\u0027d want in game would be those provided by the Final Frontier mod that allows you to keep track of the first kerbal to land on a body, first to orbit, first to do this or that... \u003C/p\u003E\u003Cp\u003EActual popup \u0022achievements\u0022 that pop up and break immersion? not only no but hell no\u003C/p\u003E\n"}]}