{"TopicId":70329,"ForumId":55,"TopicTitle":"Asteroids should be science \u0022biomes\u0022.","CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-24T10:36:06Z","PageNum":1,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-24T10:36:06Z","Content":"\n\u003Cp\u003EAsteroids should be separate science \u0022biomes\u0022 (Darn it \u0022biomes\u0022 is a very bad choice of terminology. grr.) so you can model the idea of the research learned from sending probes to study them.\u003C/p\u003E\u003Cp\u003Ei.e. you see things like this in the science center log:\u003C/p\u003E\u003Cp\u003E\u0022\u002B40 science for Materials Study In space near a Class A Asteroid.\u0022\u003C/p\u003E\u003Cp\u003E\u0022\u002B30 science for Materials Study Attached to a Class D Asteroid.\u0022.\u003C/p\u003E\u003Cp\u003ETo prevent an exploit in which the fact that asteroids infinitely spawn, potentially leading to infinite sources of science points from asteroid missions alone, I propose just having one or two \u0022biomes\u0022 per type of asteroid, as hinted at by the examples above (one for \u0022near\u0022 the asteroid (within the 2.5 km on-rails limit) and one for \u0022docked with\u0022 the asteroid. If you mined out all the science points from a Class C asteroid already, then you\u0027ll have to seek out a class A,B,D, or E asteroid to get more asteroidy science points. Getting yet another Class C would be like going back to the same Mun crater again with the same sorts of diminished returns.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T10:38:21Z\u0022 title=\u002204/24/2014 10:38  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-04-24T13:23:53Z","Content":"\n\u003Cp\u003EI support this motion! Would remove a lot of the cheatyness of the asteroids.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-04-24T14:03:56Z","Content":"\n\u003Cp\u003EIt would make more sense than the current system, yes. I don\u0027t quite understand how the same asteroid can give different science results in Minmus orbit compared to Mun orbit...\u003C/p\u003E\n"},{"CreatedByName":"pxi","CreatedById":78711,"CreatedDateTime":"2014-04-24T14:40:27Z","Content":"\n\u003Cp\u003EI disagree to some extent.\u003C/p\u003E\u003Cp\u003EOP\u0027s suggestion would have you carry out 5 asteroid rendezvous and you\u0027re done. If you have then exhausted the science for that asteroid class, there is no further incentive to do anything else with asteroids from that point on.\u003C/p\u003E\u003Cp\u003EAlso bear in mind that KSP asteroids are ranked by size, not composition. One class A is not necessarially the same as another.\u003C/p\u003E\u003Cp\u003EAt least with the current system (different results from different orbits) there is an incentive to actually capture the asteroid. I\u0027m not saying that this is ideal either - I can see how it happens, as it grows out of the existing biome system, but the logic of it is tenuous IMO.\u003C/p\u003E\u003Cp\u003EIn short, I\u0027m not opposed to diminishing returns, but I feel there should still be some value from investigating a previously uninvestigated asteroid, beyond just naming it.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-24T20:53:40Z","Content":"\n\u003Cp\u003EThere may be something buggy happening in my installation, because people are responding as if I was asking to *reduce* the amount of science available because asteroid science is too much. But in reality I thought I was asking to *increase* the amount of science available because currently asteroids aren\u0027t worth anything at all for science. If they\u0027re meant to be worth something then either I have a bug or I\u0027m misunderstanding what\u0027s going on. When I gather science while attached to an asteroid, I only get the science for where the asteroid is, without any bonus at all for the fact that there\u0027s an asteroid there. (In other words, a science experiment while grabbing an asteroid that is in Minmus\u0027s SOI is the same thing as just being in Minmus\u0027s SOI period, with or without an asteroid.)\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-24T21:25:32Z","Content":"\n\u003Cp\u003EWhile I agree that grabbing an asteroid sample in different situations should probably not count as new science, I don\u0027t think asteroids should be biomes. In my opinion, an asteroid should provide science up to twice - once when you grab a sample off it, and once eventually if you manage to recover it.\u003C/p\u003E\n"},{"CreatedByName":"Luis","CreatedById":55075,"CreatedDateTime":"2014-04-24T22:14:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E When I gather science while attached to an asteroid, I only get the science for where the asteroid is, without any bonus at all for the fact that there\u0027s an asteroid there. (In other words, a science experiment while grabbing an asteroid that is in Minmus\u0027s SOI is the same thing as just being in Minmus\u0027s SOI period, with or without an asteroid.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, you are doing it wrong, but don\u0027t blame yourself. It\u0027s because asteroid science is counterintuitive. You can\u0027t use the science instruments - they act as if the asteroid wasn\u0027t there, as you say. You can however collect a surface sample. You do this by right-clicking the asteroid itself, not the Kerbal. As if that\u0027s not weird enough, I believe that the sample you collect counts differently for each biome. So you can collect one sample from an orbit around the Mun, then push it to Kerbin orbit and collect another.\u003C/p\u003E\u003Cp\u003EI assume the reason for all this is that asteroids are actually ship parts, rather than planetary bodies. So the code for science collection on a planet or moon doesn\u0027t work the same way.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-24T22:40:44Z","Content":"\n\u003Cp\u003EI\u0027m trying to find ways to reduce the amount of science this game pours on my head like so many buckets of water, and you\u0027re trying to increase it?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2014-04-24T22:41:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luis\u0022 data-cite=\u0022Luis\u0022\u003E\u003Cdiv\u003EAs if that\u0027s not weird enough, I believe that the sample you collect counts differently for each biome. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been hearing that as well and it\u0027s silly. Though I haven\u0027t tried it myself to make sure. Asteroids are NOT mysterious goo and have no reason to yield different results depending on where you analyze it. \u003C/p\u003E\u003Cp\u003EI understand why they want to give you more science for bringing it into orbit (you can just assume that the extra science represents multiple missions, like what NASA actually wants to be able to do).\u003C/p\u003E\u003Cp\u003EBut yep. They should treat the different asteroid classes as having different compositions. Each class gives you great science only ONCE.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-04-24T22:55:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luis\u0022 data-cite=\u0022Luis\u0022\u003E\u003Cdiv\u003EI assume the reason for all this is that asteroids are actually ship parts, rather than planetary bodies. So the code for science collection on a planet or moon doesn\u0027t work the same way.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s right. The asteroid science collection works basically the same way that any right click option does (like manually lowering landing gear) so it\u0027s different from the regular experiments, which have no way of knowing that you are at an asteroid. \u003C/p\u003E\u003Cp\u003EBut since the asteroid experiment still has the same general behavior as others it requires that things like the planet and your current situation be specified.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-24T23:33:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Luis\u0022 data-cite=\u0022Luis\u0022\u003E\u003Cdiv\u003EYes, you are doing it wrong, but don\u0027t blame yourself. It\u0027s because asteroid science is counterintuitive. You can\u0027t use the science instruments - they act as if the asteroid wasn\u0027t there, as you say. You can however collect a surface sample. You do this by right-clicking the asteroid itself, not the Kerbal. As if that\u0027s not weird enough, I believe that the sample you collect counts differently for each biome. So you can collect one sample from an orbit around the Mun, then push it to Kerbin orbit and collect another.\u003Cp\u003EI assume the reason for all this is that asteroids are actually ship parts, rather than planetary bodies. So the code for science collection on a planet or moon doesn\u0027t work the same way.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the reply. But the only thing I\u0027ve ever seen in the menu when I rightclick the asteroid is \u0022target center of mass\u0022. No sample option showed up in the menu, even when clamped to it with the claw.\u003C/p\u003E\u003Cp\u003EDoes it require that a kerbal exists on the vessel at the time, like surface samples do? If so that would explain why I never saw it. All my ARM missions have been unmanned so far. And it sounds from what you\u0027re saying that if you only ever do unmanned ARM missions you\u0027ll never see the one and only way that asteroids offer science points.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-04-24T23:58:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EDoes it require that a kerbal exists on the vessel at the time, like surface samples do? If so that would explain why I never saw it. All my ARM missions have been unmanned so far. And it sounds from what you\u0027re saying that if you only ever do unmanned ARM missions you\u0027ll never see the one and only way that asteroids offer science points.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou have to be controlling the Kerbal, on EVA, and you have to be fairly close (maybe 4 or 5 Kerbal height units away).\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-04-25T06:28:08Z","Content":"\n\u003Cp\u003EOkay, so I just wrote about two paragraphs about how I\u0027d like asteroid science to be changed and I discovered some problems, probably the same problems that led to the DEVs setting it up the way it currently is.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003ECurrent Setup:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEach individual asteroid is worth (I think) 60 science for each situation. So: 60 for orbiting the sun, 60 for orbiting Minmus, 60 for Mun, 60 for Kerbin, etc. Each asteroid is worth science even if its the same class as a previously tested asteroid because its not made of the same stuff.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProblem(s):\u003C/strong\u003E Moving large asteroid into all these different situation is more expensive(in delta-V) than going to other planets AND those planets are worth more because of multiple different science experiments.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EIdea:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEach class has its own science value no matter the situation. A\u0027s worth 40-60, B\u0027s 60-80, etc. So bigger asteroids are worth more, but can\u0027t be exploited by moving them to other orbits.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProblem(s):\u003C/strong\u003E Why capture it? Just rendezvous, grab science, go home.\u003C/p\u003E\u003Cp\u003EWell shoot, no wonder they did it the way they did. The whole IDEA is to capture them, so WHY NOT make it worth more to put it in a different situation. So now I\u0027m trying to think of a different way to do it that wouldn\u0027t require a whole lot of extra code designed to detect whether the asteroid has been redirected or not. If you limit the asteroids to only giving science if they are in Kerbin SOI, just wait till it\u0027s passing by and do science and let it pass. If you limit it to only giving science if its in safe Kerbin orbit, fewer people are going to bother with them at all unless they are worth a LOT of science(at least as much as a Mun surface sample).\u003C/p\u003E\u003Cp\u003EI think the best thing, for now, would be to make larger asteroids worth more. As it is, class A\u0027s are the best way to get science and class E\u0027s are just bragging rights.\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2014-04-25T08:59:18Z","Content":"\n\u003Cp\u003EAsteroids acting as biomes should be better. However we need something to reduce biome spam. I\u0027d say the biome science could be double or even triple-layered:\u003C/p\u003E\u003Cp\u003E1) Planet data (biome independent). One set for each planet, one set all asteroids together (may be separate for several asteroid types). Your first mission will return much more valuable data than the repeated ones even if these are to different biomes/asteroids\u003C/p\u003E\u003Cp\u003E2) Group data (optional) - 2-4 major areas per planet with clearly different circumstances (water/plain/mountains on Kerbin, Major craters/Minor craters/not in craters on the Mun, plains/hill on Minmus; for asteroids that might be different composition types - they might not even be knoen approaching the asteroid, so reason to send probing missions). Maybe even several intersecting categories at once (different composition asteroid analysis and asteroid analysis in different gravity fields)\u003C/p\u003E\u003Cp\u003E3) unique data - something for each biome on planets and each asteroid in the space. Not very much, but if you consider how many of those are there...\u003C/p\u003E\u003Cp\u003EWith current system you either have a single mission to be completely worthless or get incredible science from a single body just by spamming all the biomes. It could be much more balanced if a full biome tour would award something like 2-3 times of what first landing gives, not 8 times, and catching similar asteroids again and again would give some consistent science income, but not the same as the first one and probably not really worth the effort of doing that again and again when you can do something new.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-04-25T10:23:29Z","Content":"\n\u003Cp\u003ENah, I agree with Baythan. Keep how you get different samples the same as it is now; just change it so you get more science for bigger roids. Also, make it a random number between the 2 limits; so a B class could have limits of 50-60 science, and each B class roid would give you a random amount between those 2 limits for each space \u0027biome\u0027 (this is just for some diversity). I like the way the roid science works currently, I just agree that their should be a slight incentive to getting bigger roids.\u003C/p\u003E\n"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2014-04-25T11:12:20Z","Content":"\n\u003Cp\u003EBut Squad made asteroids for unlimited amounts of science?\u003C/p\u003E\u003Cp\u003EBesides, you\u0027re trying to rendezvous with something at ~700 m/s velocity difference and a really wacky and almost inaccessible orbit.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-04-25T11:32:58Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EAsteroids function as parts\u003C/strong\u003E. The asteroid experiment is UI-wise set up like repairing a wheel on a rover - science-wise it is set up like ... actually not completely like any other experiment.\u003C/p\u003E\u003Cp\u003EThe science parts let you take the data in EVA, but activating the experiment usually does not move the data automatically to the kerbonaut - I even do not know of any science part that can be activated in EVA.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(\u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EWould be cool addition btw! Also an easy way to limit some more experiments to manned missions - or add a seperate experiment only doable by EVA, the asteroids show that exactly that is possible!\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EBack to topic: The current asteroid experiment works \u003Cem\u003Ebasically\u003C/em\u003E like any other, \u003Cstrong\u003Eit checks its situation/location and coughs up data accordingly. This makes sure that it can be repeated\u003C/strong\u003E with every asteroid regardless where you run the experiment.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cem\u003EAs I have not made a trip to any asteroid yet, how repeatable is the experiment? Every new asteroid gives the same full amount of science every time in every situation? Or is it always only once, like 100 EVA reports by 100 different kerbonauts in 100 situations would only give 100 results ever?\u003C/em\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EDealing out \u003Cstrong\u003Escience points depending on size class is really a good idea.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHow is the experiment \u0022implemented\u0022 into the \u0022asteroid part\u0022? There is a very short .cfg file for the asteroids, but it does not tell much.\u003C/p\u003E\u003Cp\u003EMaybe there is a way to tell the \u003Cstrong\u003Emobile lab that it is docked to an asteroid, enableing a new experiment\u003C/strong\u003E at the lab. But I do not know of way in KSP to \u003Cstrong\u003Etell an experiment to only work at a specific planet\u003C/strong\u003E - which would be necessary to make this the incentive to capture an asteroid, yielding lots of science. This would simulate gameplay-wise the intensive analysis made by a team in LKO. At any other location it would result in 0 science points\u003Cspan style=\u0022font-size:8px;\u0022\u003E, but a good explanation might only be, that the most qualified scientists are unwilling to travel any farther. \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Better Than Starting Manned mod managed to zero out the science gain of experiments done on Kerbin\u0027s surface, maybe this can be applied to this special experiment to only work in LKO.\u003C/p\u003E\u003Cp\u003EI am trying to work with what is already implemented into the game to increase the chances this will be implemented. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Etl/dr\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T12:01:15Z\u0022 title=\u002204/25/2014 12:01  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by KerbMav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dooz","CreatedById":74263,"CreatedDateTime":"2014-04-25T11:40:02Z","Content":"\n\u003Cp\u003EIm Just Saying But asteroids are Considered a Part By the game In order to have Biomes it would Have To be a Celestial Body and Not a Part.\u003C/p\u003E\n"},{"CreatedByName":"ibeinsane","CreatedById":106685,"CreatedDateTime":"2014-04-25T14:18:32Z","Content":"\n\u003Cp\u003EJust to add my points and to re-iterate some of the earlier points.\u003C/p\u003E\u003Cp\u003EI think the different classes should represent different compositions and this is what should yield the different science values for each class size. Problem as people have suggested is that there is then no point (for science) to redirect with the current system as science can be done without moving.\u003C/p\u003E\u003Cp\u003ETo bring it to being representative of real life the whole difficulty at the moment is the cost to perform affective science at a long distance for fast moving objects. Bringing it into orbit would allow much cheaper missions with and without kerbals. I think once currency is introduced into the game this will become extremely obvious and necessitate an asteroid re-direct to exploit its full science.\u003C/p\u003E\u003Cp\u003EThe questions should be is why bring a large asteroid over a smaller one into orbit, perhaps the science should be weighted to be dependant on the size of the asteroid being worked on.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2014-04-25T14:41:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dooz\u0022 data-cite=\u0022Dooz\u0022\u003E\u003Cdiv\u003EIm Just Saying But asteroids are Considered a Part By the game In order to have Biomes it would Have To be a Celestial Body and Not a Part.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo some extent asteroid already are considered a biome. The standard way of storing science data is with the format: experiment id @ planet name * situation name * biome name. Asteroid follow this basic pattern; an asteroid report looks like this: asteroidSample@SunInSpaceHigh_PotatoRoid1607787879. With PotatoRoid and the asteroid ID number acting as the biome. \u003C/p\u003E\u003Cp\u003EBut it\u0027s not difficult to make a more complex system of asteroid science; if I \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64972-0-23-5-DMagic-Orbital-Science-New-Science-Parts-V0-7-5-%284-1-14%29?p=1095048\u0026amp;viewfull=1#post1095048\u0022 rel=\u0022external nofollow\u0022\u003Ecan do it\u003C/a\u003E, then Squad can easily make something more complex too.\u003C/p\u003E\u003Cp\u003EMy first iteration for asteroid science allows you to collect data while grappled to, or nearby an asteroid. The multiplier value is determined by the asteroid class, and science can only be collected once for each class, it doesn\u0027t matter where you are orbiting or whether or not you are collecting data from a different asteroid.\u003C/p\u003E\u003Cp\u003EI kind of like the idea of making science values also depend on where the asteroid is (ie whether it\u0027s just orbiting the sun, or whether you\u0027ve brought it into orbit around Kerbin), but I think ibeinsane might be right that this will sort itself out once we get some kind of currency system implemented. Finding some way to classify asteroids by type, not just size, is another good idea.\u003C/p\u003E\u003Cp\u003EI don\u0027t think any of this is really difficult to implement, whether or not Squad actually wants to something like this is another matter. But as far as mods are concerned I think there are a number of possibilities for expanded asteroid science.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-27T05:57:39Z","Content":"\n\u003Cp\u003ESeriously, I only suggested this because I didn\u0027t see asteroids giving any sort of science points whatsoever. The fact that they do but only if you approach them with a manned mission and EVA near the asteroid was not something I\u0027d ever have gotten around to guessing.\u003C/p\u003E\u003Cp\u003EI was primarily concerned with making them worth *something* instead of *nothing* and was suggesting the biome thing as a way to implement it. The fact that there was a hidden way in which they already *were* worth something but I hadn\u0027t stumbled on it yet changes everything. That makes the entire reason I first posted moot.\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-04-28T04:43:59Z","Content":"\n\u003Cp\u003EThat ok, there still seems to be some of us who like the idea of modifying the current system into something we feel would make asteroids more useful. But as I have no new ideas beyond my first post I\u0027m waiting to see if there are other ideas.\u003C/p\u003E\n"}]}