{"TopicId":70328,"ForumId":55,"TopicTitle":"Variants of parts","CreatedByName":"NWM","CreatedById":67386,"CreatedDateTime":"2014-04-24T10:03:11Z","PageNum":1,"Articles":[{"CreatedByName":"NWM","CreatedById":67386,"CreatedDateTime":"2014-04-24T10:03:11Z","Content":"\n\u003Cp\u003EI thin there should be a kind of variant toggling on the part window ensuring the possibility to build in several types of a part with same mesh.\u003C/p\u003E\u003Cp\u003EBenefits:\u003C/p\u003E\u003Cp\u003E0 mainly more parts without flooding the parts bar.\u003C/p\u003E\u003Cp\u003E1 possibility of upgrading parts by technical development - less there is no lack of simple part in the beginning and no more there is no more useless development at the end of game.\u003C/p\u003E\u003Cp\u003E For example: sensors with better digitization - and more efficient transmission. (and obsolete the old version), lighter and more durable struts...\u003C/p\u003E\u003Cp\u003E2 different function of parts: external duct: 1 one way transfer, 2 balancing \u003C/p\u003E\u003Cp\u003E or MK2 fuselage: jet fuel, structural, rocket fuel\u003C/p\u003E\u003Cp\u003E3 different size of parts: stack bi-coupler size of 0.625, 1.25, 2.5, 3.75 or I-beam with different lengths\u003C/p\u003E\u003Cp\u003E4 different skins for same parts\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T17:15:39Z\u0022 title=\u002204/25/2014 05:15  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by NWM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-04-24T19:56:23Z","Content":"\n\u003Cp\u003EI don\u0027t understand why your list starts at 0, this isn\u0027t an array and we aren\u0027t coding. \u003C/p\u003E\u003Cp\u003EShouldn\u0027t you say you want customizable parts? Like beyond tweakables. \u003C/p\u003E\u003Cp\u003EAlso some of your list doesn\u0027t make sense, as far as i know struts are massless already.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-25T03:44:00Z","Content":"\n\u003Cp\u003EWell, part variants, like maybe an LV-909B that gets selected by right clicking the icon in the VAB/SPH, would be useful.\u003C/p\u003E\u003Cp\u003EMaybe like:\u003C/p\u003E\u003Cp\u003ELV-909B\u003C/p\u003E\u003Cp\u003EIsp (vac): 400\u003C/p\u003E\u003Cp\u003EIsp (SL): 290\u003C/p\u003E\u003Cp\u003EThrust: 45 kN\u003C/p\u003E\u003Cp\u003EMass: 0.4\u003C/p\u003E\u003Cp\u003EThat could be a variant unlocked further down the tech tree. It could cost the same, but it would have better stats in some ways and worse in others.\u003C/p\u003E\u003Cp\u003EPlus, this makes the rockets shareable, as upgrading parts threads have brought up, sharing would be an issue. Unless it was a different part, using the same model, but different stats.\u003C/p\u003E\u003Cp\u003EMaybe in the LV-909 config, there could be a second \u0022section\u0022 for the LV-909B?\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-04-25T05:16:17Z","Content":"\n\u003Cp\u003EI like the idea of upgrading parts through the tech tree, making them more efficient than their original version.\u003C/p\u003E\u003Cp\u003EI\u0027m wondering what they are going to do as far as the first round of rebalancing parts for Career mode. I hear some people don\u0027t like the new SLS parts from the ARM patch because they are WAY too powerful (in their opinion, I like them). Right now most parts are designed/balanced for Sandbox mode, so most parts are good for certain situations instead of \u0027better\u0027 than another part earlier in the tech tree.\u003C/p\u003E\u003Cp\u003EBut to make science something to keep gathering, it\u0027d be nice to be able to upgrade parts to become better. More efficiency in vacuum or atmosphere for engines, more science gained from transmitting from the antenna, etc. Of course, I\u0027d also like more lights, but that\u0027s a subject for a different thread.\u003C/p\u003E\n"},{"CreatedByName":"NWM","CreatedById":67386,"CreatedDateTime":"2014-04-25T17:49:11Z","Content":"\n\u003Cp\u003E@MKI - thanks, in row 0 a \u0022more\u0022 had been missed.\u003C/p\u003E\u003Cp\u003E3. point cannot work by tweakables\u003C/p\u003E\u003Cp\u003EThe main element of the concept is solve the conflict between the need of more parts, and keep the part bar in reasonable size.\u003C/p\u003E\u003Cp\u003EWhy do we need more part?\u003C/p\u003E\u003Cp\u003E- winglet - same sized winglets for the small 1.25m and the big 3.75m... - scaling solves the memory problem, but it still makes 2 extra icon in the parts bar\u003C/p\u003E\u003Cp\u003E- upgrading parts - each new version of the sensor occupies an extra place in the parts bar\u003C/p\u003E\u003Cp\u003Ethe end of this wast amount of icons\u003C/p\u003E\u003Cp\u003E my concept: right click on the icon, the infobar opens, and there is somewhere the needed available variant of the part can be chosen.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-04-25T19:20:36Z","Content":"\n\u003Cp\u003EI\u0027d like to unlock the ability to remove the Hard skin from fuel tanks in the later game. kinda like this:\u003C/p\u003E\u003Cp\u003Eit should have less mass but more drag in atmosphere and less impact tolerance.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/4/4c/Orion_docked_to_Mars_Transfer_Vehicle.jpg\u0022 alt=\u0022Orion_docked_to_Mars_Transfer_Vehicle.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Baythan","CreatedById":18815,"CreatedDateTime":"2014-04-30T08:08:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt Snuggler\u0022 data-cite=\u0022Capt Snuggler\u0022\u003E\u003Cdiv\u003EI\u0027d like to unlock the ability to remove the Hard skin from fuel tanks in the later game. kinda like this:\u003Cp\u003Eit should have less mass but more drag in atmosphere and less impact tolerance.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/4/4c/Orion_docked_to_Mars_Transfer_Vehicle.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/4/4c/Orion_docked_to_Mars_Transfer_Vehicle.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETHAT is an awesome picture. I approve of this idea.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-04-30T08:41:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KASASpace\u0022 data-cite=\u0022KASASpace\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELV-909B\u003C/p\u003E\u003Cp\u003EIsp (vac): 400\u003C/p\u003E\u003Cp\u003EIsp (SL): 290\u003C/p\u003E\u003Cp\u003EThrust: 45 kN\u003C/p\u003E\u003Cp\u003EMass: 0.4\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat 909B isn\u0027t balanced; it may have less thrust, but it has higher TWR and Vac ISP that a normal one...\u003C/p\u003E\u003Cp\u003ESorry, what were we talking about again? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a good idea, especially with the fuel tanks where you can pick different fuels; saves filling up the part menu with clone parts; also I like the idea of removing the covers on tanks, as it\u0027s useless weight on satellites and transfer stages...\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-30T10:33:25Z","Content":"\n\u003Cp\u003EI\u0027m not sure I like the idea of upgradable parts, or variants of the same parts with different stats. Makes it hard to help players troubleshoot their craft from pictures (Is that an LV-909 or an LV-909B?).\u003C/p\u003E\u003Cp\u003EThough changing the fuel type in a tank seems like a no-brainer, as well as the different sized structural parts the OP mentions.\u003C/p\u003E\n"},{"CreatedByName":"NWM","CreatedById":67386,"CreatedDateTime":"2014-04-30T12:57:48Z","Content":"\n\u003Cp\u003E\u0022Though changing the fuel type in a tank seems like a no-brainer, as well as the different sized structural parts the OP mentions. \u0022\u003C/p\u003E\u003Cp\u003E- There are already 3 versions of the I beam in the game, with 3 separated icon. By this idea even dozens can be accessible from a single icon. And there are already different fuel variant of some thank - different icons and different skins and meshes - but there is no M2, MK3 variants with rocket-fuel or monopropellant.\u003C/p\u003E\u003Cp\u003EA those winglets too big for a 2 tons glider, and almost useless on a 400 tons SSTO, and same with the landing gears, for example.\u003C/p\u003E\u003Cp\u003E- There are many mods for it, but simply the new parts flood the parts bar and eat the memory...\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-30T13:11:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NWM\u0022 data-cite=\u0022NWM\u0022\u003E\u003Cdiv\u003E\u0022Though changing the fuel type in a tank seems like a no-brainer, as well as the different sized structural parts the OP mentions. \u0022\u003Cp\u003E- There are already 3 versions of the I beam in the game, with 3 separated icon. By this idea even dozens can be accessible from a single icon. And there are already different fuel variant of some thank - different icons and different skins and meshes - but there is no M2, MK3 variants with rocket-fuel or monopropellant.\u003C/p\u003E\u003Cp\u003EA those winglets too big for a 2 tons glider, and almost useless on a 400 tons SSTO, and same with the landing gears, for example.\u003C/p\u003E\u003Cp\u003E- There are many mods for it, but simply the new parts flood the parts bar and eat the memory...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with you, by \u0022no-brainer\u0022 I mean an idea so obviously good it doesn\u0027t require much thought. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-30T13:14:34Z\u0022 title=\u002204/30/2014 01:14  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 30, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003Cbr\u003EAdded quote for new page.\n\u003C/span\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-04-30T13:17:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt Snuggler\u0022 data-cite=\u0022Capt Snuggler\u0022\u003E\u003Cdiv\u003EI\u0027d like to unlock the ability to remove the Hard skin from fuel tanks in the later game. kinda like this:\u003Cp\u003Eit should have less mass but more drag in atmosphere and less impact tolerance.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://upload.wikimedia.org/wikipedia/commons/4/4c/Orion_docked_to_Mars_Transfer_Vehicle.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://upload.wikimedia.org/wikipedia/commons/4/4c/Orion_docked_to_Mars_Transfer_Vehicle.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eksp aside, arent they worried about micro meteors?\u003C/p\u003E\n"},{"CreatedByName":"JimmyAgent007","CreatedById":74761,"CreatedDateTime":"2014-04-30T14:03:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003Eksp aside, arent they worried about micro meteors?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELunar Lander was kinda like this, I think the phrase \u0022Acceptable Risk\u0022 was tossed about a bit. Just have some emergency seals that go if you loose pressure. That being said, depending on what hits you, you could have the armor plating of an M1A2 Tank and it would still tear through your ship. \u003C/p\u003E\u003Cp\u003EMaybe existing parts can \u0022Eject Casing\u0022 once you have left atmo, so you dont have drag while launching but less mass for transfers.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-04-30T15:37:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JimmyAgent007\u0022 data-cite=\u0022JimmyAgent007\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMaybe existing parts can \u0022Eject Casing\u0022 once you have left atmo, so you don\u0027t have drag while launching but less mass for transfers.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would love that!\u003C/p\u003E\n"}]}