{"TopicId":70330,"ForumId":55,"TopicTitle":"Should KSP have a Delta-V readout?","CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2014-04-24T10:50:12Z","PageNum":11,"Articles":[{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-28T01:39:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI\u0027m guessing fairly confidently that no one has returned to orbit from Eve\u0027s sea level without doing a delta-V calculation. It is impossibly difficult to just overbuild or trial and error your way to that.\u003C/div\u003E\u003C/blockquote\u003E*Takes that as a challenge*\n"},{"CreatedByName":"Halsfury","CreatedById":54576,"CreatedDateTime":"2014-04-28T01:44:26Z","Content":"\n\u003Cp\u003EIt\u0027s not necessary plus there is a mod for it, and failing that, there is a Dv calculator on the internet\u003C/p\u003E\u003Cp\u003EFor what it\u0027s worth this is my space program if the caption was:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI don\u0027t always mix fuel and oxidizer...\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ssBeuXr.jpg\u0022 alt=\u0022ssBeuXr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBut when I do you better run\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EFull credit to Rareden for this great poster\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-28T01:44:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EWhy is it okay for you to say that this is information that ANY space program \u003Cstrong\u003Eshould \u003C/strong\u003Ealready have (implying that KSP \u003Cstrong\u003Eshould \u003C/strong\u003Ehave it) yet I cannot use that same argument stating that if they include a Dv radout, that they should include something to reference it to? Do you really have nothing better to support your argument other than that?\u003C/div\u003E\u003C/blockquote\u003E [emphasis added]\u003Cp\u003EI\u0027m not saying they SHOULD have it, I\u0027m saying they WOULD have it. Seriously - ask NASA if they\u0027d launch a rocket without knowing its dV under all circumstances. Ask the Indians, the Chinese, the Canadians.. every single space program ever has had information on how far their rocket can go and not had to look at it and say \u0022yeah, that looks about right.. let\u0027s launch it and when we get to Jupiter, we\u0027ll find out if we have enough fuel left\u0022. Basic information is not only useful but absolutely required for space travel. It makes no sense at all that KSP would not have some way of showing the player this (not even by showing the vehicle wet/dry mass without a complicated workaround).\u003C/p\u003E\u003Cp\u003EI get that it\u0027s a comical game, that killing kerbals or reverting to launch is keeping in the spirit of the game but some people actually want to play realistically (me included). And as it\u0027s \u0022some people\u0022, why not make it optionable/unlockable?\u003C/p\u003E\u003Cp\u003EAlso, stock KSP already has something reference it to - the manoeuvre nodes. \u0022Oh hey, you need to change your velocity by this much. Can you do that? I dunno\u0022. I for one, do not enjoy finding out that I do not have enough and have to either revert to VAB or wait ages until the next transfer window to be able to send a refuelling mission. I\u0027m not made of time, I do have a life outside of KSP, despite what my username says.\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EAs far as \u0022vital\u0022, far from it. Many players have managed to navigate the Kerbal universe without ever needing any Dv information.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it\u0027s not vital, I\u0027m not arguing that. Players that are sufficiently informed about their vessel wet/dry mass, their engines ISP and that are supplied with enough pencils and paper don\u0027t need a dV readout, I\u0027m not denying that. I\u0027m just saying \u0022what\u0027s the harm in adding an optional display for people who want it?\u0022.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-28T01:53:28Z\u0022 title=\u002204/28/2014 01:53  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 28, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-28T01:44:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E*Takes that as a challenge*\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wish you good luck. Make sure you launch and transfer each attempt. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2014-04-28T01:46:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EI agree that there are indeed many factors, which is why a Dv meter by itself serves no real purpose, because on it\u0027s own, it tells you nothing without some frame of reference to know how much you need. As far as \u0022vital\u0022, far from it. Many players have managed to navigate the Kerbal universe without ever needing any Dv information.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m one of them. For the most part of my KSP usage history, I used zero mods and did everything blind, but honestly, delta-v meter is a must.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-04-28T01:54:39Z","Content":"\n\u003Cp\u003EA Dv meter by itself will only help those that already know how to calculate how much Dv is needed. While it would be very beneficial for that small minority people that can do that, for everyone else it is just useless information. If they are going to include it, what would be the point without adding something to reference it to (for all of us laymen?) You bring up maneuver nodes, let\u0027s discuss that for a second. What if they had added the node tool, without adding a point of reference on the navball to reference it to? It would be great for someone who could eyeball it good or knew the math to figure out the needed angle, but for us laymen, it would have been mostly useless and right back to guesswork. With enough practice, we could figure it out though, just like now with the Dv issue. Unless it is made into a complete system, it is a waste of time for most players.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-04-28T02:00:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EIf we are going to add a Dv meter, then why not go a step further and add a complete, automated system which tells you exactly how much Dv you need and will do all of the burns and everything for you, all you do is hit \u0022launch\u0022 then once in orbit, hit \u0022Land.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebasicaly that. \u0022ok my ship has enough dv to get to dres and back, mission accomplished\u0022\u003C/p\u003E\u003Cp\u003Ehow is it fun if you already know youre going guaranteed to make it?\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-04-28T02:02:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003E[emphasis added]\u003Cp\u003EYes, it\u0027s not vital, I\u0027m not arguing that. Players that are sufficiently informed about their vessel wet/dry mass, their engines ISP and that are supplied with enough pencils and paper don\u0027t need a dV readout, I\u0027m not denying that. I\u0027m just saying \u0022what\u0027s the harm in adding an optional display for people who want it?\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHarm? None. I\u0027m justing pointing out that not everyone feels it is such a big need. I do however like you\u0027re position regarding applying it to maneuver nodes. That makes sense.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-28T02:06:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EA Dv meter by itself will only help those that already know how to calculate how much Dv is needed. While it would be very beneficial for that small minority people that can do that, for everyone else it is just useless information. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t see how making it optionable isn\u0027t a bad idea though. Yes, for everyone else, it\u0027s useless, but for others (apparently 86.5% of people who have answered this poll), it\u0027s not only useful, but desirable.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EWhat if they had added the node tool, without adding a point of reference on the navball to reference it to?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell they didn\u0027t, so any argument based around the fact they did is moot. The point remains that they added a node system that displays dV needed but no way of easily calculating if you can achieve that. This raises the question of how useful it actually is - the only people who find it useful are, I imagine, either people who can work out their total dV by hand (via time-consuming methods) or by people who have mods that show the crafts total dV. Either way, the end result is the same - it\u0027s only useful for people who know how much dV they have left.. so why \u003Cstrong\u003Enot \u003C/strong\u003Einclude a dV readout in stock?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EUnless it is made into a complete system, it is a waste of time for most players.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EI\u0027m justing pointing out that not everyone feels it is such a big need.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I must\u0027ve missed the part where 86.5% isn\u0027t \u0022most players\u0022. 86.5% of people who have answered this poll have said yes, KSP needs a stock dV readout. Whether this is useful or relevant to them doesn\u0027t matter, the simple fact remains that over 4 out of 5 people want it. Please explain to me the part where ignoring over 80% of your userbase is good practice.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003Ehow is it fun if you already know youre going guaranteed to make it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause any number of things can go wrong on the way. You might accidentally stage a decoupler, mess up your intercept, crash into your solar panels, forget parachutes or RCS ports.. all very kerbal things and also all very possible. Being told \u0022you have enough dV to do this mission\u0022 presumes absolute perfect everything - launch, orbit, transfer, insertion, landing, takeoff, rdv, return back, re-entry.. if any step of that goes wrong, your total dV goes down. I repeat, a dV readout is not saying \u0022you can perform this manoeuvre\u0022, it\u0027s saying \u0022if executed perfectly and under ideal circumstances, this manoeuvre can be performed with your current dV, which is XXXXm/s\u0022. Rarely in KSP is something executed perfectly.\u003C/p\u003E\u003Cp\u003EEDIT2: Again, I do not find reverting to VAB/a quicksave particularly fun, especially if it\u0027s done more than once. As I said, I\u0027m not made of time, the time I spend playing KSP is limited, so yes, I\u0027d much prefer it if I was told in advance that I won\u0027t be able to perform what I intend to do. If I get to Eeloo and find that I don\u0027t have enough fuel to launch to orbit and rdv, I\u0027m going to be seriously annoyed at the fact I\u0027ve basically just wasted a couple of hours of my time playing KSP.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-28T02:22:39Z\u0022 title=\u002204/28/2014 02:22  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 28, 2014\u003C/time\u003E by ObsessedWithKSP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-28T02:13:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022r4pt0r\u0022 data-cite=\u0022r4pt0r\u0022\u003E\u003Cdiv\u003Ebasicaly that. \u0022ok my ship has enough dv to get to dres and back, mission accomplished\u0022\u003Cp\u003Ehow is it fun if you already know youre going guaranteed to make it?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you get it into orbit without it breaking apart? Did you remember to deploy solar panels? Can you complete an efficient transfer? Did you pack enough chutes? Did you remember to put landing gear on the lander? Can you land the thing somewhere safe without breaking it up or spending too much fuel? Is the hatch obstructed? Can you do an efficient enough ascent on a body you\u0027ve never launched from? Can you rendezvous with your transfer stage? Did you remember an RCS system for docking? Can you transfer back efficiently? \u003C/p\u003E\u003Cp\u003ESpace is full of perils. Having enough delta-V is far from guaranteed success. Not having enough is guaranteed failure.\u003C/p\u003E\n"},{"CreatedByName":"KASASpace","CreatedById":71352,"CreatedDateTime":"2014-04-28T02:19:27Z","Content":"\n\u003Cp\u003E*just got here*\u003C/p\u003E\u003Cp\u003EOF COURSE YES.\u003C/p\u003E\u003Cp\u003EI don\u0027t want to have to calculate my D-v at every point just to see how efficient I flew, it\u0027s tedious. Plus, you have to get all the values from the map screen (mass) and also remember the empty mass of all the tanks. I know it\u0027s not that hard to remember the Emass, but when you have to add up all the masses.......\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2014-04-28T02:26:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESorry, I must\u0027ve missed the part where 86.5% isn\u0027t \u0022most players\u0022. 86.5% of people who have answered this poll have said yes, KSP needs a stock dV readout. Whether this is useful or relevant to them doesn\u0027t matter, the simple fact remains that over 4 out of 5 people want it. Please explain to me the part where ignoring over 80% of your userbase is good practice.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause only a very small number of players actually visit the forums. Of those, even less are registered. The fact that 86% of the voters even know what Delta-v is should be a big flag as to this being a very skewed poll. Also, there was no option for those who don\u0027t care either way except to simply not vote. Bottom line is, KSP is a game and meant to be a game. It is not trying to simulate a real-world solar system or space agency. it is a tongue-in-cheek game, giving gamers a glimpse into space exploration without bogging them down with tons of science, math and numbers. Trial and error is part of that humor and charm.\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-04-28T02:34:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EBecause only a very small number of players actually visit the forums. Of those, even less are registered. The fact that 86% of the voters even know what Delta-v is should be a big flag as to this being a very skewed poll. Also, there was no option for those who don\u0027t care either way except to simply not vote. Bottom line is, KSP is a game and meant to be a game. It is not trying to simulate a real-world solar system or space agency. it is a tongue-in-cheek game, giving gamers a glimpse into space exploration without bogging them down with tons of science, math and numbers. Trial and error is part of that humor and charm.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei cant give you more rep \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003Eevery day there are posters who joined the forums last month but have a year or more under their belt. a forum poll does not a majority make.\u003C/p\u003E\u003Cp\u003Eplus i saw the the ksp subreddit has around 70k readers. thats a substantial group that hasnt voted\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-28T02:35:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EA Dv meter by itself will only help those that already know how to calculate how much Dv is needed. While it would be very beneficial for that small minority people that can do that, for everyone else it is just useless information. If they are going to include it, what would be the point without adding something to reference it to (for all of us laymen?)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEveryone who plays KSP longer than a while starts calculating delta-v in one way or another. Some use mods or other tools for it, some calculate it themselves, and some are content to estimate it qualitatively. Delta-v is such a central concept in KSP that if you learn to build rockets that can get their jobs done with any degree of reliability, you are by definition estimating delta-v in some way.\u003C/p\u003E\u003Cp\u003EBesides, the reference points are already there. Just look at the wiki.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-28T02:54:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EBecause only a very small number of players actually visit the forums. Of those, even less are registered. The fact that 86% of the voters even know what Delta-v is should be a big flag as to this being a very skewed poll. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo the 86% of people who answered this poll and thus, are those who not only know what dV is but also know how to use it... should be ignored? I\u0027m not sure what you\u0027re getting at here. Are we taking into account new players? Because I already said that to new players, a dV readout will neither mean a lot nor will they see the relevance between that and attaining orbit. It\u0027s safe to say that people answering the poll already know what dV means, and besides, if 86% of voters know what dV means, then, using your logic, 14% of voters also know what it means. It seems that the people who understand dV and do not want it implemented in stock are in the minority.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EIt is not trying to simulate a real-world solar system or space agency. it is a tongue-in-cheek game, giving gamers a glimpse into space exploration without bogging them down with tons of science, math and numbers. Trial and error is part of that humor and charm.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is why I stand by the suggestion of making it optionable/unlockable via the settings. For people who don\u0027t understand dV and orbital mechanics, they don\u0027t have to be bogged down by numbers (there\u0027s not really that much maths involved... if your rocket has 4.4km/s dV, then you can pretty safely achieve orbit. However, see my previous points about things going wrong, knowing what 4.4km/s dV actually means etc etc) and the people who want it, they can have it. \u003C/p\u003E\u003Cp\u003EYes, it\u0027s not simulating real life or a real solar system, but it\u0027s basics are grounded in reality (if you orbit a planet with a G of X at a height of Y, you will travel at Zm/s etc) so there must, fundamentally, be some way of displaying basic real orbital physics. It is literally just more information. You\u0027re given Eeloos physical characteristics before you ever even have a chance to go there so why aren\u0027t you told how much dV your rocket has? It\u0027s like saying, with absolute certainty, that \u0022Pluto has a diameter of X, a gravitional constant of Y, an atmosphere of Z atm, a sidereal day of A, that it has B number of moons\u0022 without even seeing pictures of it and in the same breath, saying \u0022well, to be honest, I don\u0027t know exactly how far this rocket can travel...\u0022. Yes, trial and error is the kerbal way, I don\u0027t deny that, but personally, I find it more frustrating than anything when I get to Laythe and find out I don\u0027t have enough dV to orbit again.\u003C/p\u003E\n"},{"CreatedByName":"GusTurbo","CreatedById":57552,"CreatedDateTime":"2014-04-28T04:37:45Z","Content":"\n\u003Cp\u003EThe fact that we already have a delta V measure for maneuvers makes the lack of any other reference to delta V a bit puzzling.\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-04-28T07:03:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Clockwork_werewolf\u0022 data-cite=\u0022Clockwork_werewolf\u0022\u003E\u003Cdiv\u003EOK here is a question, why do people desire a feature already available in mods when they could be asking for the Devs to make planets customizable.\u003Cp\u003EAt present the only way to add planets is to illegally decomplite the game. I know that the hard coding of the planets may help with game speed but I expect many people (not all though) have the spare computing power to have customizable planets.\u003C/p\u003E\u003Cp\u003ECustomizable planets would let mods add that second gas giant lots of people want. It would let people make mercury oceaned hot planets. They could make gas planets with a tiny core. They could make an accurate human solar system. They could make closest approximations of exo planets found by Kepler. They could make rock planets with 10 moons. They could make Endor.\u003C/p\u003E\u003Cp\u003EThis is a feature we can NOT have in any way, where as delta-V is a feature you can have at any time. \u003C/p\u003E\u003Cp\u003EReal question: Time is limited, what makes already existing mod features more important for the Devs to work on?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause, mods aren\u0027t forever. If this gets implemented, which it really does need to, it will receive continued support, maintenance and inclusion from now until the end of the game. Also, people are always asking for more planets. Problem is, planets add a lot of lag, which is why the devs are reluctant to add them, among other reasons. Also, if its illegal, why is planetfactory, or planetfactory CE, or RSS still on the forums and popular? Your saying that those mods are illegal?\u003C/p\u003E\u003Cp\u003EAlso, your basically saying the devs should just stop now, because everything they plan on adding has already been done by mods: \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EContracts and money?\u003C/strong\u003E Mission Controller. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMore parts?\u003C/strong\u003E Novapunch, ANVIL, KW, Firespitter, B9, etc. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ED-V and technical readouts?\u003C/strong\u003E MJ, KER, VOID. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMore planets?\u003C/strong\u003E Planetfactory, and associated packs. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECustomizable Planets?\u003C/strong\u003E Planetfactory CE, RSS. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERealistic Planets?\u003C/strong\u003E RSS. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBetter Aerodynamics?\u003C/strong\u003E FAR. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERe-entry and proper heating effects?\u003C/strong\u003E DRE. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELife Support?\u003C/strong\u003E Asmi\u0027s ELCSS, TAC LS, Ioncross LS.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EProper Communication and Transmission setups?\u003C/strong\u003E RemoteTech.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EResources?\u003C/strong\u003E Kethane, Extraplanetary Launchpads.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERealisctic Fuels?\u003C/strong\u003E Real Fuels.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECustomizable Parts? \u003C/strong\u003EProcedural Dynamics, Procedural Parts, Procedural Fairings, Stretchy Tanks, Stretchy SRBs.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMore advanced Building Mechanics?\u003C/strong\u003E Editor Extensions, Hangar Extender.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBetter FX? \u003C/strong\u003EHotRockets, SmokeScreen.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBalance the old parts?\u003C/strong\u003E Stock Rebalance Project.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFix the parachutes?\u003C/strong\u003E Realchutes.\u003C/p\u003E\u003Cp\u003EReally, almost anything someone will suggest will fall into this list somehow, so saying someone suggest something that hasn\u0027t been done by a mod, then suggesting something that has been done by several, perfectly legal mods, is pretty redundant in itself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-28T07:05:54Z\u0022 title=\u002204/28/2014 07:05  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 28, 2014\u003C/time\u003E by Deathsoul097\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-04-28T08:41:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EBecause only a very small number of players actually visit the forums. Of those, even less are registered. \u003Cstrong\u003EThe fact that 86% of the voters even know what Delta-v is should be a big flag as to this being a very skewed poll\u003C/strong\u003E. Also, there was no option for those who don\u0027t care either way except to simply not vote. Bottom line is, KSP is a game and meant to be a game. It is not trying to simulate a real-world solar system or space agency. it is a tongue-in-cheek game, \u003Cstrong\u003Egiving gamers a glimpse into space exploration without bogging them down with tons of science, math and numbers. \u003C/strong\u003ETrial and error is part of that humor and charm.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour arguments are specious.\u003C/p\u003E\u003Cp\u003EEven an optional Dv readout is being rejected which I see as unreasonable at this point as that could not possibly change anyones current game experience.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-28T09:23:42Z\u0022 title=\u002204/28/2014 09:23  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 28, 2014\u003C/time\u003E by John FX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-04-28T09:58:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EYour arguments are specious.\u003Cp\u003EEven an optional Dv readout is being rejected which I see as unreasonable at this point as that could not possibly change anyones current game experience.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. If anything, people (newbies mostly, but you never know.) will be inquisitive at the meaning of the information they are getting, and look into it, or just look at it like, \u0022Huh? Numbers, numbers, numbers, WTF? I don\u0027t need this.\u0022 Either way, it will help those who want it, and those who don\u0027t want it wont use it. \u003C/p\u003E\u003Cp\u003EAlso, comparing a DV readout to MJ\u0027s Autopilot is stupid. I mean it, it\u0027s just downright stupid. How can a readout saying, \u0022hey, you\u0027ve got X TWR and Y DV\u0022 and you knowing \u0022I need Z DV to get to A, and 2Z to get to B from there, which is =/-/\u002B to Y. I can/cant do this.\u0022 the same as an autopilot? I use MJ all of the time, and often for the autopilot because its much more accurate than I could ever be, and \u003Cstrong\u003Etrust me, there is a HUGE difference between a DV readout and an Autopilot\u003C/strong\u003E. Your argument is literally invalid.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Arial Black\u0027;\u0022\u003EI have nothing against the user, I am simply flaming against the argument. None of this post is to be taken personally, or as an attack against your personality, just your argument.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-28T10:29:59Z","Content":"\n\u003Cp\u003EThis poll is simply asking for your opinion on \u0022Should KSP have a Delta-V readout?\u0022 It could do with a couple more choices (e.g. yes, yes if it is optional, yes but not yet, yes but not yet and is optional, no) but I am yet to see any post that gives a good argument for voting no (either in the original poll or in an expanded one).\u003C/p\u003E\u003Cp\u003EMy personal vote in the expanded options above would be \u0022yes but not yet and is optional\u0022. I believe that, given there are mods that provide this functionality, the devs should be working on other things that will be required in the \u0022finished\u0022 game (e.g. money, contracts etc.) and would probably benefit from community feedback early in their development.\u003C/p\u003E\u003Cp\u003EYes, KSP is a game but it is not your average \u0022minimal brain power required\u0022 sort of game. To achieve the more advanced things (that are included in the stock game, such as landing on and returning from Moho, Eve, Tylo etc.) requires a considerable amount of thought, planning and trial and error and the tools are simply not available in the game to remove the grunt work required (e.g. most people don\u0027t find totalling up the wet and dry mass of their rocket stages very much fun and the game \u0022lies\u0022 about the mass of various parts in the VAB making this difficult/error prone anyway).\u003C/p\u003E\u003Cp\u003EThe ARM update is another case in point, a novice player who has no idea what deltaV (and/or TWR) is will find it virtually impossible to trial and error their way to even an interception of an asteroid, let alone a redirection of one of the larger ones. There have been lots of posts on the forum that show that it is even difficult for lots of people that do know what these things are (bugs notwithstanding). Predefined scenarios and in-game tutorials can help with this and, in my opinion, are the thing that is currently most lacking to keep new players interested.\u003C/p\u003E\u003Cp\u003EI enjoy blowing up the odd Kerbal as much as the next person but that isn\u0027t the \u0022point\u0022 of the game (not for me, or for Harvester as I understand it). I play the game because I enjoy the role-playing of running reasonably realistic missions (a slightly Kerbal definition of reasonable, e.g. I don\u0027t mind asparagus launching 500 tons of payload in one go, with Jeb sat on top in a command seat to get a good view during launch) and every space program I have ever heard of has used computers to help design rockets by calculating deltaV and TWR and doing other calculations for manoeuvers during the mission and also has telemetry available in mission control that displays all sorts of real-time data about the craft (well, subject to transmission delays, but again, not everyone would find that fun). They certainly don\u0027t sit around with pen and paper and a calculator (or even a copy of Excel and a list of all the part masses) to work these things out, they have custom written computer programs to do it.\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-04-28T10:41:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003EThis poll is simply asking for your opinion on \u0022Should KSP have a Delta-V readout?\u0022 It could do with a couple more choices (e.g. yes, yes if it is optional, yes but not yet, yes but not yet and is optional, no) but I am yet to see any post that gives a good argument for voting no (either in the original poll or in an expanded one).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with almost all you have to say on this, but the thread isn\u0027t just for saying yes or no, its so we can say why we say yes or no, and discuss that. I also agree that it should be completely optional to have it or use it, and it shouldn\u0027t be there at the start, tech tree integration is perfect for this. Maybe when probes are first unlocked with the Stayputnik would be a good spot. As I see it, any reason not to have it can just be countered with, \u0022that\u0027s a load of bull\u0022 or just \u0022don\u0027t use it.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-28T11:02:38Z","Content":"\n\u003Cp\u003EI wonder even about tech tree integration. What happens when an experienced player starts a new career save? They know about delta-V, and have all the information to calculate it manually, but cannot use the superior in-game tool for it? Seems like increasing difficulty through obfuscation to me.\u003C/p\u003E\u003Cp\u003EI understand the desire to not overwhelm new players with stats and numbers, but delta-V is the big one. No other single stat is as significant in rocketry. In my opinion, we should be showing it to new players, even if we withhold other stats, to encourage them to learn about this incredibly important aspect of spacecraft design.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-04-28T11:21:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathsoul097\u0022 data-cite=\u0022Deathsoul097\u0022\u003E\u003Cdiv\u003EI agree with almost all you have to say on this, but the thread isn\u0027t just for saying yes or no, its so we can say why we say yes or no, and discuss that. I also agree that it should be completely optional to have it or use it, and it shouldn\u0027t be there at the start, tech tree integration is perfect for this. Maybe when probes are first unlocked with the Stayputnik would be a good spot. As I see it, any reason not to have it can just be countered with, \u0022that\u0027s a load of bull\u0022 or just \u0022don\u0027t use it.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I wasn\u0027t trying to imply that people shouldn\u0027t give their reasons for voting the way they do in a post in the thread or that they shouldn\u0027t discuss the issue. The point I was making was more about the actual question because quite a few people, going by the reasons they have posted, seem to be answering a different one. Of the 47 people that have voted no so far, I suspect that most actually think the same way I do, that it should have a readout but it should be optional and there are other more important things for the devs to work on. Strictly speaking, all those people should have voted yes if they were answering the actual poll question...\u003C/p\u003E\u003Cp\u003EAnd before anyone gets needlessly pedantic and says that it doesn\u0027t actually \u003Cstrong\u003Eneed\u003C/strong\u003E it, I don\u0027t \u003Cstrong\u003Eneed\u003C/strong\u003E a job but the income makes my life much more comfortable and enjoyable than it would otherwise be...\u003C/p\u003E\u003Cp\u003E(Speaking of which, I should get back to it really... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-28T11:24:42Z\u0022 title=\u002204/28/2014 11:24  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 28, 2014\u003C/time\u003E by Padishar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2014-04-28T11:38:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Padishar\u0022 data-cite=\u0022Padishar\u0022\u003E\u003Cdiv\u003ESorry, I wasn\u0027t trying to imply that people shouldn\u0027t give their reasons for voting the way they do in a post in the thread or that they shouldn\u0027t discuss the issue. The point I was making was more about the actual question because quite a few people, going by the reasons they have posted, seem to be answering a different one. Of the 47 people that have voted no so far, I suspect that most actually think the same way I do, that it should have a readout but it should be optional and there are other more important things for the devs to work on. Strictly speaking, all those people should have voted yes if they were answering the actual poll question...\u003Cp\u003EAnd before anyone gets needlessly pedantic and says that it doesn\u0027t actually \u003Cstrong\u003Eneed\u003C/strong\u003E it, I don\u0027t \u003Cstrong\u003Eneed\u003C/strong\u003E a job but the income makes my life much more comfortable and enjoyable than it would otherwise be...\u003C/p\u003E\u003Cp\u003E(Speaking of which, I should get back to it really... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problem, I think I may have misunderstood what you said.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI wonder even about tech tree integration. What happens when an experienced player starts a new career save? They know about delta-V, and have all the information to calculate it manually, but cannot use the superior in-game tool for it? Seems like increasing difficulty through obfuscation to me.\u003Cp\u003EI understand the desire to not overwhelm new players with stats and numbers, but delta-V is the big one. No other single stat is as significant in rocketry. In my opinion, we should be showing it to new players, even if we withhold other stats, to encourage them to learn about this incredibly important aspect of spacecraft design.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, DV is an important one, but as I see it, the first nodes up until unlocking the DV readout, even if it was only the second or third node, can be unlocked without knowing what DV is, or WR for that matter. Just moar boosters and more stuff in general should get you that far. It did for me.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-28T12:15:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GusTurbo\u0022 data-cite=\u0022GusTurbo\u0022\u003E\u003Cdiv\u003EThe fact that we already have a delta V measure for maneuvers makes the lack of any other reference to delta V a bit puzzling.\u003C/div\u003E\u003C/blockquote\u003EWell as I see it delta-V is a fundamental parameter of the manouevre node. The manouevre is defined by the amount of delta-V and the direction it\u0027s applied in. The game has to have the node delta-V to work, even if it hid it from the user. By contrast the delta-V of a rocket, though hugely important, is a derived parameter from the engine specific impulse and ship mass ratio, and the game doesn\u0027t have to calculate the ship delta-V. That\u0027s why it\u0027s not unreasonable to have the current situation where you have manouevre node delta-V\u0027s but not ship delta-V\u0027s. Not that it means the game should \u003Cem\u003Estay\u003C/em\u003E that way, but it accounts for the behaviour.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Deathsoul097\u0022 data-cite=\u0022Deathsoul097\u0022\u003E\u003Cdiv\u003EAs I see it, any reason not to have it can just be countered with, \u0022that\u0027s a load of bull\u0022 or just \u0022don\u0027t use it.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u0022Don\u0027t use them\u0022 was not generally accepted as a counter-argument against the claim the ARM engines are overpowered. Why should it be accepted as a counter-argument against the claim that a delta-V readout doesn\u0027t belong in the stock game?\n"}]}