{"TopicId":70330,"ForumId":55,"TopicTitle":"Should KSP have a Delta-V readout?","CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2014-04-24T10:50:12Z","PageNum":5,"Articles":[{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-25T09:25:19Z","Content":"\n\u003Cp\u003EIn my opinion, there are two \u0022general\u0022 ways how to play KSP, and they are \u0022playing by numbers\u0022 and \u0022playing the Kerbal way\u0022. \u003C/p\u003E\u003Cp\u003EPlaying by numbers is what MechJeb, KER and similar plugins provide. You burrow in dv maps, planet tables, transfer calculators, and come up with a 15 ton rocket capable of doing a grand tour without a hitch.\u003C/p\u003E\u003Cp\u003EPlaying the Kerbal way means you guess and then you go try it. Then you fail, guess better and go try again. You won\u0027t make a 15-ton rocket for grand tour, but you still can do a grand tour with a 1500-ton monster. Then find at the end that you can run the course once more with remaining fuel.\u003C/p\u003E\u003Cp\u003EA lot of people play by numbers because they\u0027re afraid of failing. Their Kerbals are too precious for them, yet they don\u0027t want to revert or quickload, they want their design to work right on first attempt.\u003C/p\u003E\u003Cp\u003EI think playing by numbers is not how the game is intended to be played, not primarily at least.\u003C/p\u003E\u003Cp\u003EThat\u0027s why I voted No. In my opinion, features promoting the Kerbal way of plaing should be implemented instead. Tools not showing numbers, but allowing partial designs to be tested in controlled conditions.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-04-25T09:39:38Z","Content":"\n\u003Cp\u003EIMHO, the best thing to do would be to provide tools (mix of the best from Mechjeb, KER, VOID), users will be free to use them or not.\u003C/p\u003E\u003Cp\u003E(I can\u0027t imagine how to rdv without anything but stock game, do you calculate yourself Hohmann, or other, transfer ?)\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-25T09:44:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EPlaying the Kerbal way means you guess and then you go try it. Then you fail, guess better and go try again. You won\u0027t make a 15-ton rocket for grand tour, but you still can do a grand tour with a 1500-ton monster. Then find at the end that you can run the course once more with remaining fuel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI played the game this way for the first week or two. After that, I found it boring and repetitive. I stopped playing, never doing anything more ambitious than a Mun landing.\u003C/p\u003E\u003Cp\u003EA month later somebody told me about MechJeb and all the information it gave access to. I gave KSP another chance, and this time things made sense. There was an entire world to explore, and tools that made the exploration enjoyable. After that, I\u0027ve played about 500 hours in less than half a year. I don\u0027t really need any of the MechJeb displays anymore, but they obviously make many things simpler and faster.\u003C/p\u003E\u003Cp\u003ELife is too short for repeating stupid mistakes all over again, especially when you know there is a better way to do things. My job is all about interesting challenges, and the world is full of good games to play, so I don\u0027t need games with a lot of repetitive grinding for anything.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-25T09:45:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EA lot of people play by numbers because they\u0027re afraid of failing. Their Kerbals are too precious for them, yet they don\u0027t want to revert or quickload, they want their design to work right on first attempt.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI totally disagree with most of what you said, but I disagreed with this the most. I play by numbers because it\u0027s how I have the most fun at the game with my limited time. I don\u0027t have the time to spend hours on a mission, the first dozen or so of those hours getting some ugly behemoth into Kerbin orbit, only to find when I get to Jool (if I ever bother to go because the \u0022Kerbal Way\u0022 you propose encourages failure on so many levels I\u0027d continually run out of real life time to do anything) that I don\u0027t have enough fuel to get home.\u003C/p\u003E\u003Cp\u003ETo me that\u0027s not the Kerbal Way\u003Csup\u003ETM\u003C/sup\u003E, that\u0027s half-arsing it. I prefer whole-arsing it.\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2014-04-25T09:47:39Z","Content":"\n\u003Cp\u003EDon\u0027t forget 1 thing: delta v is highly dependent on how you actually do the job... While it\u0027s in plugins there\u0027s always a disclaimer, describing how staging is taken into account, but that\u0027s one of the reasons why they don\u0027t want to include it in the stock game - do something unusual and the delta v indicator shows useless numbers. And, as Felipe said, KSP is not about playing it the \u0022right\u0022 way.\u003C/p\u003E\u003Cp\u003E\u002B I agree about the Kerbal way of eyeballing it. And if you don\u0027t want to find yourself in Tylo orbit with twice less delta v than needed for lading, you can always invent your own ways of performance testing without leaving Kerbin\u0027s SOI. And don\u0027t forget that delta v requirements of some operations are strongly dependent on your own skills. And only you can guesstimate this factor.\u003C/p\u003E\n"},{"CreatedByName":"Lar-E","CreatedById":78160,"CreatedDateTime":"2014-04-25T09:56:15Z","Content":"\n\u003Cp\u003EI would like some basic numbers (delta-v, twr, vehicle weight) to be available in the VAB. I don\u0027t think that would take much away from the kerbal-ness of the game: as has been pointed out before, you still have to know what to DO with those numbers. And it would save me a lot of scratch paper.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-04-25T10:03:20Z","Content":"\n\u003Cp\u003EAbsolutely - I think it\u0027s something that has already been incorporated into KerbalEdu, so I\u0027m hoping that some of it will port back into one of our releases as well as the flight engineer stuff that they have put in (ie: measuring KE vs PE, etc)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Justin Kerbice\u0022 data-cite=\u0022Justin Kerbice\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E(I can\u0027t imagine how to rdv without anything but stock game, do you calculate yourself Hohmann, or other, transfer ?)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not as bad as you think, once you\u0027re used to it - the maneuveur nodes and closest approach markers provide a lot of the info/requirements you need. I think one thing that you miss are readouts for the orbital period, for example, as that would be useful, but, at least within the same SOI, you can definitely eyeball a node and adjust it. I find that the game doesn\u0027t quite provide enough for interplanetary stuff yet though (there\u0027s no real way to work out your ejection angle or phase angle, except, again, by eyeballing it), and at those distances it\u0027s very difficult to work out what to adjust. I think some improvement on that data (and maybe a tutorial on how to use it) would help a lot of people break out of Kerbin\u0027s SOI for the first (and hopefully not last!) time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T10:07:57Z\u0022 title=\u002204/25/2014 10:07  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by allmappedout\u003C/strong\u003E\n\u003Cbr\u003Eadditional quote\n\u003C/span\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-04-25T10:19:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EIt\u0027s called \u0022Don\u0027t vote\u0022.\u003Cp\u003EYou\u0027re not the sort who spends time and money to call a number to vote \u0022No opinion\u0022... \u003Cem\u003Eare you\u003C/em\u003E? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, it\u0027s called \u0022this poll is biased\u0022, because If I want to participate in the poll, I\u0027m forced to take sides, or don\u0027t vote, in which case the poll will not represent me and risks to be not representative and useless, so Squad can\u0027t use this for make a decision if it wanted to.\u003C/p\u003E\u003Cp\u003EAs to why I don\u0027t care, it boils down to \u0022I would like to have a dV readout, but I understand that it is too hard to implement right and there are other aspects of the game that needs more attention.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2014-04-25T10:29:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EA lot of people play by numbers because they\u0027re afraid of failing. Their Kerbals are too precious for them, yet they don\u0027t want to revert or quickload, they want their design to work right on first attempt.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll quite happily admit to wanting my designs to succeed first time. I think that validates the (admittedly fairly minimal) effort I put into planning.\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-04-25T10:42:01Z","Content":"\n\u003Cp\u003EThe thing is, this game doesn\u0027t even show you the mass of your vehicle nor the fuel mass. So even if you as a new player learned about the rocket equation, you still don\u0027t have the tools to calculate your dv unless you want to sum up all the part masses by hand ...\u003C/p\u003E\u003Cp\u003ESo at the moment mods are pretty much required to do any kind of planing, which is a shame IMO.\u003C/p\u003E\n"},{"CreatedByName":"Alchemist","CreatedById":8825,"CreatedDateTime":"2014-04-25T10:54:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaMichel\u0022 data-cite=\u0022DaMichel\u0022\u003E\u003Cdiv\u003EThe thing is, this game doesn\u0027t even show you the mass of your vehicle nor the fuel mass. So even if you as a new player learned about the rocket equation, you still don\u0027t have the tools to calculate your dv unless you want to sum up all the part masses by hand ...\u003Cp\u003ESo at the moment mods are pretty much required to do any kind of planing, which is a shame IMO.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, having this in the VAB would really be very useful. Also these numbers are much more solid than delta v estimates for complex staging\u003C/p\u003E\n"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2014-04-25T10:59:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIn my opinion, there are two \u0022general\u0022 ways how to play KSP, and they are \u0022playing by numbers\u0022 and \u0022playing the Kerbal way\u0022. \u003Cp\u003EPlaying by numbers is what MechJeb, KER and similar plugins provide.....\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn general i agree to your post. But personally i belong to those players who like to know the dV stats just to compare the designs. I dont look up the wiki for dV needed to reach X, i like to play the kerbal way - but i find it hard to guess what another fuel tank or engine does to dV or TWR without some numbers to compare. And i REALLY DONT want to do the maths. In my opinion at least some compareable stats should be provided by the stock game.\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2014-04-25T11:12:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIn my opinion, there are two \u0022general\u0022 ways how to play KSP, and they are \u0022playing by numbers\u0022 and \u0022playing the Kerbal way\u0022. \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose two \u0022general\u0022 methods are play are far too specific, but that\u0027s probably why you put that in quotes.\u003C/p\u003E\u003Cp\u003EI play with Kerbal Engineer. I have done since I gave up with MechJeb because of the temptation to autopilot everything instead of practicing myself (therefore losing the MJ readouts). Does that mean I spent every minute in the VAB fine tuning rockets by numbers? No. Absolutely not.\u003C/p\u003E\u003Cp\u003EI know from experience that guesswork is the fun way to do anything. If a rocket it built by randomly throwing parts together in a fairly logical order it will usually end in the most entertaining, and often most surprising, outcomes. At the same time I am not really willing to take a trip to Eeloo and after warping round the star for 10 minutes find that I\u0027m 100dV short of whatever it was I needed to do; in that case the \u0027Kerbal\u0027 method of launch-and-hope is, for me anyway, the less fun option. That said, the rocket used to complete that mission would be built without the numbers, only checked afterwards.\u003C/p\u003E\u003Cp\u003EIn short, nope. A mixture of the two ways is the \u0027best\u0027 way to play KSP, a combination of mostly blind luck and some sensible calculations every so often.\u003C/p\u003E\u003Cp\u003EBesides, having a readout of useful numbers in the VAB or SPH is just that. You then have to \u003Cem\u003Efly\u003C/em\u003E the thing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-04-25T12:34:08Z","Content":"\n\u003Cp\u003EI think yes...\u003C/p\u003E\u003Cp\u003EI use Mechjeb exclusively, cannot \u0027play\u0027 right without it, not because I need the autopilots, even though they do get used for tedious tasks - launching rockets and spaceplanes is fun, but launching the same rocket or spaceplane 20\u002B times because you forgot small details or something greatly over-affected the craft in one way or another, quickly becomes a tedious repetitive task that I did get bored of - but I\u0027ve found that it fits my style of gameplay as well as what I think would be a Kerbal attempt at having these things too!\u003C/p\u003E\u003Cp\u003EThe spacecraft engineers used to get blamed a fair amount in pre-23.5 for random rocket failures, and Mechjeb has the ability to mess up so badly at times I think it must be made by Kerbals... sometimes I prefer to land something myself and take of again afterwards because I\u0027m RP\u0027ing (usually when Jeb is flying, heh) and think \u0022What would Jeb Do?\u0022 heh...\u003C/p\u003E\u003Cp\u003Eand the numbers... I can\u0027t even get a spaceplane off the runway without some of the numbers \u0026gt;.\u0026lt;\u003C/p\u003E\u003Cp\u003Ebut I agree with the other suggestions, make it toggleable in menu (or even in-game, like MJ does with a tab or something) otherwise when the game hits 1.0 the instruction booklet is gonna read more like an introduction to 1st year university physics book...\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-04-25T14:36:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003EIf I want to participate in the poll, I\u0027m forced to take sides, or don\u0027t vote, in which case the poll will not represent me and risks to be not representative and useless\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you don\u0027t care either way, you\u0027re not in need of representation. Generally, people who are indifferent are not asked to influence a decision. You don\u0027t have a side because you don\u0027t care - so why care if the poll represents you? Abstention is no different than \u0022no strong opinion\u0022.\u003C/p\u003E\u003Cp\u003EThere\u0027s \u003Cem\u003Ealways\u003C/em\u003E going to be some sort of bias in a poll - that\u0027s how polls work. People who vote lean one way or the other.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-04-25T14:56:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tarmenius\u0022 data-cite=\u0022Tarmenius\u0022\u003E\u003Cdiv\u003EI was torn about this issue at first, but after some thought, I have to say that including critical data readouts as an option which players can enable or disable at will is not only a good idea, but one that probably shouldn\u0027t even be debated. It\u0027s almost always good game design to give players as many options as possible so that each individual can tailor the game to their own preferences. But keeping something from players who want it will have one of three possible effects: Either the player has to download and install the desired functionality from a third party (which, granted, is both relatively safe and easy with KSP), they calculate it by hand, or they do without. None of those are qualities of good game design.\u003Cp\u003EAs has been mentioned already, \u0022doing without\u0022 is usually no major issue for Kerbin SOI missions, but becomes a serious one when mission complexity increases. I don\u0027t do many Jool missions myself for exactly that reason. Just getting there takes a couple hours of real-life time to fly (three-and-a-half hours was my last one-way time, including trial-and-error aerobraking attempts) and I\u0027d rather not have to wait until after I\u0027ve spent those hours to discover that I hadn\u0027t packed enough fuel. I feel like I miss out on some of the game\u0027s content because of the real-life time costs involved with the trial-and-error method.\u003C/p\u003E\u003Cp\u003ECalculating things by hand is not typically considered engaging gameplay, and those who do enjoy it for its own sake would probably do it regardless of whether the game offered them the information already.\u003C/p\u003E\u003Cp\u003EFinally, mods are good for content that the developers either can\u0027t get to because of time constraints (or haven\u0027t gotten to yet), or that lies beyond the scope of the game itself. Critical data readouts don\u0027t really fall within either category, so there seems to be no good reason to delegate that functionality to the modding community. I don\u0027t have anything against mods (I actually installed MechJeb after that Jool mission to see if I could make it back), but every time I get MechJeb or Kerbal Engineer to allow mission planning, I wish I wouldn\u0027t have to. Plus, having one of their instruments on my craft slows the game down noticeably for me. If it were stock, I imagine the implementation would run more smoothly.\u003C/p\u003E\u003Cp\u003EIn the end, having it be an option in a menu seems like a no-loss decision.\u003C/p\u003E\u003Cp\u003EAs a side note, the argument that having the data would intimidate new players or confuse them is, I think, under-estimating their intelligence.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExcellent post, thank you. This mirrors my feelings very much. I think most of the basic numbers (dry/full mass, TWR, dV estimates, etc) really should not be kept from the player if they want those numbers, whether it\u0027s a configurable menu option, always-present but usually minimized display in the VAB, or something that you unlock in the tech tree.\u003C/p\u003E\u003Cp\u003EMods allow for greatly extended gameplay options, but just knowing my vessel\u0027s \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Emass\u003C/em\u003E\u003C/span\u003E in the VAB alone would be really nice without a mod, and dV/TWR estimates would be really excellent as well.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-04-25T15:24:59Z","Content":"\n\u003Cp\u003EI like to play by the numbers. It\u0027s nice to know \u0022hey, at least my rocket will get to orbit\u0022 or \u0022my rocket is plenty strong enough to lift itself\u0022. To say I don\u0027t play the game the way it is intended is rather ignorant of the fact that the game is intended to be played the way you want to play it. Do you like numbers/hard data? Go ahead and get KER if you want. Want to build jet powered race cars that fly apart at Mach 7? By all means. \u003C/p\u003E\u003Cp\u003ELike many people have said before, you really only need dv for interplanetary travel. Building a simple, one man orbital rocket is extremely easy; building a vessel bound for Eeloo is a totally different story. Also, a simple launch/return window chart would be nice. I\u0027m not saying it shows you the Delta-V, or how to get their, just that the best time to go is on this day of this year (Showing it in ten year increments. Every time a launch window is passed, the next farthest date is loaded and the oldest deleted.)\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2014-04-25T15:42:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EIf you don\u0027t care either way, you\u0027re not in need of representation. Generally, people who are indifferent are not asked to influence a decision. You don\u0027t have a side because you don\u0027t care - so why care if the poll represents you? Abstention is no different than \u0022no strong opinion\u0022.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027re going offtopic, but a decision is made to influence stuff, if people are indifferent then making decision is less relevant and even detrimental if you spend resources that can be used elsewhere. I particularity don\u0027t believe that there are many don\u0027t know/don\u0027t answer here, I was just ranting because this kind of poll with absolute choices are common.\u003C/p\u003E\n"},{"CreatedByName":"Flying_Dutchman","CreatedById":109582,"CreatedDateTime":"2014-04-25T16:21:01Z","Content":"\n\u003Cp\u003EHi guys, I\u0027m new to Kerbal (about 50 hours), but a long time player of simulation and space games.\u003C/p\u003E\u003Cp\u003EWhen I started playing, I think dealing with deltaV and complex math would have ruined some of the fun of the game. I was able to learn quickly about fuel consumption and stages with some trial and error. Epic failures were part of the fun. However, as I\u0027m now plotting my first Mun landing, I can\u0027t imagine not having some information about weight, thrust, fuel, etc..\u003C/p\u003E\u003Cp\u003ESo my suggestion to the topic at hand is simple: When playing career mode you start with basic ship parts. As you learn their use and complete missions, you are awarded more parts and more complex parts. So, why not do the same for engineering data (weight, thrust, deltaV, etc. etc.)?\u003C/p\u003E\u003Cp\u003EMaybe after you complete your first orbital mission you are awarded a \u0022basic kerbal engineering module\u0022 which displays stats about wight, thrust, and fuel available (both VAB and in flight). A little later, as you complete a few more missions (or collect enough science) you unlock a \u0022basic kerbal computer\u0022 which can calculate deltaV. As you continue to progress, you can unlock advanced engineering modules and computers which have all the goodies that rocket scientists love. In this manor, the learning curve is lowered for the starting players, who get some fun by trial and error. But, as you progress, you get access to more powerful tools that help with the tough missions.\u003C/p\u003E\u003Cp\u003EFinally, if this advanced information was implemented as a module (ie kerbal computer), people could choose if they want to add it to their designs. Want more of a challenge? Like flying by the seat of your pants? Great! Just don\u0027t equip it...\u003C/p\u003E\u003Cp\u003EThis same concept could also be applied to other aspects of the game. Maybe the ability to \u0022track\u0022 asteroids only comes after you complete a \u0027space telescope\u0027 mission. Maybe long range communications are only possible after a \u0027com-sat\u0027 mission. Why limit the unlocking of technology to spaceship parts?\u003C/p\u003E\u003Cp\u003ESorry if this idea has been posted before.\u003C/p\u003E\u003Cp\u003EFly safe!\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-25T16:49:37Z","Content":"\n\u003Cp\u003EUnqualified yes. The in-flight mode should provide:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Eremaining stage dV\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Eremaining total vessel dV\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ecurrent TWR\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAdditionally, the VAB should provide total vessel mass. \u003C/p\u003E\u003Cp\u003EI read Harv\u0027s quote about leaving a dV out in the link above, and simply, what he said is idiotic (the quote, not Harv. Smart people can and \u003Cem\u003Edo\u003C/em\u003E say dumb things). First, obfuscation of critical information in games is just bad design. There is no way that it improves gameplay and only serves to decrease the game\u0027s approachability. Second, the devs and CM frequently about the game\u0027s educational value for math and rocket science, but then make contradictory statements to the effect of \u0022Lol, y u do teh maths!?\u0022 \u003C/p\u003E\u003Cp\u003EAs for this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EA lot of people play by numbers because they\u0027re afraid of failing. Their Kerbals are too precious for them, yet they don\u0027t want to revert or quickload, they want their design to work right on first attempt.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, if we play by numbers, it\u0027s purely out of fear. It\u0027s definitely not because we enjoy playing this game as a space program simulator or because we enjoy math and physics. We\u0027re also \u0022doing it wrong\u0022.\u003C/p\u003E\u003Cp\u003EAnd yes, it\u0027s very clear that certain posters are allowed to troll and insult the rest of the community.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-25T16:54:41Z","Content":"\n\u003Cp\u003EActually, the solution to this is really simple. An option to display TWR/dV/Mass would solve the whole problem handily.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2014-04-25T17:07:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u0022playing the Kerbal way\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat is the Kerbal way? Trying and failing due to lack of delta-v until a rocket is created that can reach the target? How many times?\u003C/p\u003E\u003Cp\u003EOr just build an arbitrarily large rocket for whatever mission just to be sure the mission gets done? \u003C/p\u003E\u003Cp\u003EThat worked well enough in early versions of ksp where all you could do is get into orbit. It also works well enough when the other thing you can do is go to the Mun. No surprise that back in those days almost every rocket was grossly over designed. It does not matter as long as money is not a factor. But money will be a factor in career mode.\u003C/p\u003E\u003Cp\u003EBut how many tries will it take to create a ship than can get a probe to Jool, how much patience can reasonably be expected from players?\u003C/p\u003E\u003Cp\u003EInitially trying and failing certainly has its charm and with a bit of guidance can be very educational. I\u0027d say it should be mandatory for all players except those who already are rocket scientist. Sort of like the early phase of career mode, but better. \u003C/p\u003E\u003Cp\u003EWould be nice if the game lets you fool around but can detect when you get stuck, and then helps out with at the very least some hints about delta-v and twr.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003ESecond, the devs and CM frequently about the game\u0027s educational value for math and rocket science, but then make contradictory statements to the effect of \u0022Lol, y u do teh maths!?\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey do make an exeption for the educational/class room version of ksp. But i don\u0027t understand why educational value should be limited to the class room.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-25T17:14:00Z\u0022 title=\u002204/25/2014 05:14  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 25, 2014\u003C/time\u003E by rkman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Clockwork_werewolf","CreatedById":90749,"CreatedDateTime":"2014-04-25T17:14:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhat is the Kerbal way? Trying and failing due to lack of delta-v until a rocket is created that can reach the target? How many times?\u003Cp\u003EOr just build an arbitrarily large rocket for whatever mission just to be sure the mission gets done?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes sounds like fun, though really it should be over engineered, that is the Kerbal way.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBut how many tries will it take to create a ship than can get a probe to Jool, how much patience can reasonably be expected from players?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E2? 5? 20? A job that can be done on the first try is no kind of achievement and therefore not much of a rush to complete successfully.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-25T17:18:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EAnd yes, it\u0027s very clear that certain posters are allowed to troll and insult the rest of the community.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKasuha\u0027s statement is no less insulting than some of the other things that have been said, or can be inferred from things that have been said, in this thread to the contrary. Pretty much everyone who thinks a delta-V indicator should be stock have echoed the sentiment that it makes \u003Cem\u003Eno sense\u003C/em\u003E not to have it, which implies that anyone who thinks contrary has \u003Cem\u003Eno sense\u003C/em\u003E. Or that they can\u0027t run an effective space program because they don\u0027t use a delta-V indicator. Or whatever.\u003C/p\u003E\u003Cp\u003EOn a side note, I completely agree with Kasuha here:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EI think playing by numbers is not how the game is intended to be played, not primarily at least.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s also worth noting that I rarely fail anymore because I play with a delta-V indicator. I wouldn\u0027t necessarily say I use it out of a fear of failure, though; expedience would be a better descriptor.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-04-25T17:19:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIn my opinion, there are two \u0022general\u0022 ways how to play KSP, and they are \u0022playing by numbers\u0022 and \u0022playing the Kerbal way\u0022.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EItÃ¢â‚¬â„¢s not Kerbal? *shrug* For some reason some people like to think Kerbals are sloppy engineers only capable of producing inherently broken designs held together by duct tape. To them, proposing something prim and proper like a NASA VAB could be built by Kerbals is ridiculous. Well, I disagree. Take a good look at the parts: at the LV-N engine, at 3-man pod, at the landing legs, at ion engine. Those are cleanly executed pieces of impressive technology. Kerbals are indifferent to safety precautions and are very excited about explosions, yes, but they make an impression of extremely capable and very competent engineers. Sure, we know they probably turned a construction crane into a vomit carousel or raced on bulldozers in the process, but I don\u0027t doubt for one second they can build buildings similar to real ones, and I don\u0027t think it would be out of character for them. Plenty of other stuff like engines is fairly close to how our human rockets look. It\u0027s unfair to mistake Kerbals for Orks from a Ã¢â‚¬Å“Certain Universe With 40k In The Name,Ã¢â‚¬Â or to expect them to build sloppy duct-taped huts.\u003Cp\u003EOverall, I\u0027m convinced the obsession with disasters and perception of Kerbals as worthless engineers only caring about explosions is destructive for the game. KSP deserves much more than being a glorified disaster simulator where rockets falling apart and crews being killed is the prime entertainment and the only expected result. The achievements of players who strive to be successful, who create beautiful, well-engineered, reliable designs, should never be devalued, and the opinion that going to space is impossibly hard deserves to be crushed and disproved over and over again. Kerbals are capable engineers and it\u0027s up to the player to utilize their technology well.\u003C/p\u003E\u003Cp\u003EThis same mindset is harming the game in many other areas as well. The bugs of the physics system aren\u0027t there because we thought they would be fun and don\u0027t deserve to be defended as some players surprisingly do. The achievements of reaching orbit, landing on another body or even establishing a permanent base somewhere should not be perceived as something impossibly hard and unreachable for anyone but hardcore players. Everything is possible if you are willing to learn and there is no reason to restrict yourself to playing a disaster simulator with rocket cars or insta-exploding space planes. Justifying that to yourself by creating a certain mental image of Kerbal engineers competency might make the game better for you but IÃ¢â‚¬â„¢m striving for a greater Kerbal good.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes I love that quote.\u003C/p\u003E\u003Cp\u003EYes, there should be a DeltaV readout, and other readouts as well.\u003C/p\u003E\n"}]}