{"TopicId":70808,"ForumId":55,"TopicTitle":"Some ideas for additional science parts","CreatedByName":"CaptainShark","CreatedById":109771,"CreatedDateTime":"2014-04-28T02:52:57Z","PageNum":1,"Articles":[{"CreatedByName":"CaptainShark","CreatedById":109771,"CreatedDateTime":"2014-04-28T02:52:57Z","Content":"\n\u003Cp\u003EI\u0027ve been playing with the career mode a bit as of late, having bought KSP quite a few patches ago, back when re-entry effects were big news and the sun was no longer a point of light.\u003C/p\u003E\u003Cp\u003EAnyway: I noticed something which seemed a bit odd to me in terms of balance/immersion and the like: following the removal of \u0022science spam\u0022 as a viable option (a good thing), it seems that there isn\u0027t really any incentive to have permanent structures like bases or stations save for refueling platforms and \u0022because I can\u0022, which i still good, but doesn\u0027t have much pay-off in terms of the currency of career mode. So I got to brain storming on a few ideas which could fix that, and here\u0027s what I came up with:\u003C/p\u003E\u003Cp\u003E- Telescopes:\u003C/p\u003E\u003Cp\u003E Possibly in a couple varieties, for instance: a small one one could place on a satellite, a larger in-line one for use in larger space ships, or a giant 3.5m one the size of the entire lab module or a large fuel tank, something akin to the real world Hubble telescope in appearance. The idea of these would be that they would remain in orbit and generate science based on their view of the sky, for instance: getting more science for (obviously) being outside atmosphere, but still more for being farther away from the sun (reducing glare). Maybe even have a few flavors of them, like radio telescopes, infra red, and so on.\u003C/p\u003E\u003Cp\u003E- Research labs:\u003C/p\u003E\u003Cp\u003EEssentially simmilar to the telescope idea, but a \u0022micro-gravity research lab\u0022 of some kind which would slowly generate science over time. Of course requiring constant flow of electricity and the presence of Kerbals to make it work. Could have plenty of potential for funny quotes as well given we\u0027ve all seen footage of astronaughts having fun with microgravity.\u003C/p\u003E\u003Cp\u003E- External experiments rack\u003C/p\u003E\u003Cp\u003ESomething for the Kerbals to visit while on EVA, this would be something simmilar to the materials observation bay but instead of yielding science upon recovery, would yield results and be refreshed via direct intervention of a kerbal on EVA.\u003C/p\u003E\u003Cp\u003E- Soil sampler\u003C/p\u003E\u003Cp\u003EEffectively: a robotic arm or the like which would allow an automated probe to perform the same action as a kerbal on EVA, ie: collecting samples from the surface of a body. Obviously this would require return, so this doesn\u0027t exactly address my initial inspiration, but I thought it was neat.\u003C/p\u003E\u003Cp\u003E- Cameras:\u003C/p\u003E\u003Cp\u003EThis is probably the oddest of these ideas: basically the idea would be to be able to take photos from your probe, rover, station etc, and these would be transmitted back to the KSC and put in a \u0022gallery\u0027 of some form. Basically integrating into game the idea of taking screenshots. These could then net a small amount of science based on what you got in-frame, maybe even have special bonuses for finding easter eggs like the monoliths. These could even be integrated into career mode some time down the line when costs and public interest are factors to be considered.\u003C/p\u003E\u003Cp\u003E- Core sampler\u003C/p\u003E\u003Cp\u003EThe idea behind this one is basically \u0022soil sample on steroids\u0022: basically a large component which requires a kerbal, constant flow of power and time to extract a sample from the surface of an object. This, like most of the others i\u0027ve listed are the sort of things you\u0027d have to \u0022set and leave for a bit\u0022, in order to get a return out of them, thus incentivising longer duration structures and missions.\u003C/p\u003E\u003Cp\u003EA note on balance:\u003C/p\u003E\u003Cp\u003EThese are NOT in my mind a replacement for having big sample and crew return missions, rather something which would generate a \u0022slow but steady\u0022 flow of science points as opposed to the big jumps you get from acomplishing a major mission. of course with time acceleration there would be room for abuse there, but since when is that not the case with time acceleration.\u003C/p\u003E\n"},{"CreatedByName":"xrayfishx","CreatedById":76147,"CreatedDateTime":"2014-04-28T07:41:34Z","Content":"\n\u003Cp\u003EAll of them are good ideas, I can\u0027t disagree with any of them.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-04-28T08:07:41Z","Content":"\n\u003Cp\u003EMore variation in Science collection is always a nice idea, and the parts you\u0027ve thought would be very cool, but the problem is the tech tree. The tree needs a major rebalance, as it is very easy to unlock with a few science parts just in the Kerbin System... So more parts really wouldn\u0027t be needed; all they need to do is add multiple difficulty levels for the tech tree, with the harder ones not only having more nodes with less parts in each (still same amount of parts though), but increased node science cost too. Then these parts would be useful to justify the increased science cost for the tech-tree.\u003C/p\u003E\u003Cp\u003EGood idea anyway!\u003C/p\u003E\n"},{"CreatedByName":"alecdacyczyn","CreatedById":109759,"CreatedDateTime":"2014-04-28T08:14:00Z","Content":"\n\u003Cp\u003EI like the idea of the core sampler. A Mineral Analyzer like the grinder/microscope/laser/spectrum-analyzer thing that the Curiosity rover on Mars has would also great. What we really need is a good reason to build rovers (beyond just screwing around \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E). Currently, there is nothing that a rover can do that a stationary probe can\u0027t do equally well. Imagine a procedurally generated scattering of rock and boulders of varying composition and rarity (maybe a dozen\u002B different kinds). It\u0027d give you a reason to drive around and do sciencey things.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-28T11:07:40Z","Content":"\n\u003Cp\u003EI like most of the ideas, but every time I see a suggestion about something \u0027continually producing a steady amount of Science\u0027, I can never agree with it. If the rate is too high, it can be abused by timewarping for a few years so obviously, the rate should be lowered. But to what? If it\u0027s too low, there\u0027s no point in it being there. I personally think there\u0027s no middle ground to be found - there\u0027ll always be some people that are patient enough to timewarp for a few years and to stop them, it\u0027d be lowered too much to be useful.\u003C/p\u003E\u003Cp\u003EI do like the external experiments rack thing though. Always down for more reasons to EVA.\u003C/p\u003E\n"},{"CreatedByName":"Amaroq","CreatedById":57607,"CreatedDateTime":"2014-04-28T17:19:10Z","Content":"\n\u003Cp\u003EObsessedWithKSP - the obvious solution there is a \u0022hard cap\u0022 for that object. Set it up so that, say, 1 year generates all the science it can ... up to you whether you time-warp \u002B1 year, or run other concurrent missions while you wait for it.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-04-28T17:55:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Amaroq\u0022 data-cite=\u0022Amaroq\u0022\u003E\u003Cdiv\u003EObsessedWithKSP - the obvious solution there is a \u0022hard cap\u0022 for that object. Set it up so that, say, 1 year generates all the science it can ... up to you whether you time-warp \u002B1 year, or run other concurrent missions while you wait for it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not a bad idea, it just generates science over a year (maybe better ones that do more? Like 3-5 years?) and it just auto sends it the surface so long as the craft/station has a transmitter. 1 science per day is a nice number, 426 science in a year; just make it require about 25E/s, which 2 gigantors would provide pretty well for day and could last the night; you could even connect it up the the MPL to gain a bonus of maybe... 0.5 science per day? Isn\u0027t too bad supposing the energy required... \u003C/p\u003E\u003Cp\u003EYou\u0027d have to make it so it would use up electricity even when the ship isn\u0027t active though; that shouldn\u0027t be too hard with a little script that works out energy used vs. energy produced and takes it out of the battery. To encourage people to make sure it has energy all the time you could make the lab take 2-3 to \u0027warm-up\u0027 (won\u0027t make any science until warmed up) after it turned off due to lack of energy.\u003C/p\u003E\n"},{"CreatedByName":"SargeRho","CreatedById":25468,"CreatedDateTime":"2014-04-28T18:00:55Z","Content":"\n\u003Cp\u003EMagnetometers, we need magnetometers.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-28T18:46:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Amaroq\u0022 data-cite=\u0022Amaroq\u0022\u003E\u003Cdiv\u003EObsessedWithKSP - the obvious solution there is a \u0022hard cap\u0022 for that object. Set it up so that, say, 1 year generates all the science it can ... up to you whether you time-warp \u002B1 year, or run other concurrent missions while you wait for it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a solution I hadn\u0027t thought of and I like it. TAC LS makes inactive vessels still use resources, so I know it can be done to make it so a station must always need electricity. 1 Science a day for 1 year is a reasonable number, with little bonuses for other bodies to encourage long term residence there. That, along with life support and everything would make a pretty fun game I think.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-04-28T20:23:18Z","Content":"\n\u003Cp\u003ERemote sampler can come in two flavors;\u003C/p\u003E\u003Cp\u003E1. A tool for a probe to collect and return a sample a third of the way in Career.\u003C/p\u003E\u003Cp\u003E2. A tool for a probe to collect, analyses, and transmit the results back to mission control. That should be a larger part later in career that would be useful for probes that are unable to return from planets such as Eve.\u003C/p\u003E\u003Cp\u003EI see that career mode science points will become more balanced in later versions from the current placeholders now in use.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-04-28T20:31:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EI like most of the ideas, but every time I see a suggestion about something \u0027continually producing a steady amount of Science\u0027, I can never agree with it. If the rate is too high, it can be abused by timewarping for a few years so obviously, the rate should be lowered. But to what? If it\u0027s too low, there\u0027s no point in it being there. I personally think there\u0027s no middle ground to be found - there\u0027ll always be some people that are patient enough to timewarp for a few years and to stop them, it\u0027d be lowered too much to be useful.\u003Cp\u003EI do like the external experiments rack thing though. Always down for more reasons to EVA.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESuch a device should have a limited number of times it can conduct the experiments before it wears out or runs out of analysis resources. Likewise, a limited operating life span once landed.\u003C/p\u003E\u003Cp\u003EThen\u0027 of course, there is Voyager which is still sending back science information after 36 years in operation.\u003C/p\u003E\n"},{"CreatedByName":"awsomejwags","CreatedById":105043,"CreatedDateTime":"2014-04-28T20:49:33Z","Content":"\n\u003Cp\u003Ehere is a mod with most of those \u003Ca href=\u0022http://kerbalspaceprogram.com/dmagicorbital/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/dmagicorbital/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"andrewas","CreatedById":24662,"CreatedDateTime":"2014-04-28T21:03:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003EThat\u0027s a solution I hadn\u0027t thought of and I like it. TAC LS makes inactive vessels still use resources, so I know it can be done to make it so a station must always need electricity. 1 Science a day for 1 year is a reasonable number, with little bonuses for other bodies to encourage long term residence there. That, along with life support and everything would make a pretty fun game I think.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETAC LS cheats - life support is consumed at a constant rate unless the player changes the crew complement which can\u0027t be done while the vessel is on-rails, so it just has to look at elapsed time when the ship is loaded again. Kerbals are alive up to that moment, and then suddenly they died six months ago when the air ran out. \u003C/p\u003E\u003Cp\u003EElectricity, though, is mostly generated by solar panels, so the rate changes with distance from the sun and is cut off when the sun is occluded. A TAC LS style cheat would be much harder to do properly because it would have to calculate the vessels path since it was put on rails - oh, and said path is unstable if it crosses into a different SOI at high time warp - and simulate the power generation and consumption. The best solution would be to have code running even on on-rails vehicles. Done carelessly this could kill performance, but its the best way to simulate on-going activities on inactive ships.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-04-28T21:54:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022andrewas\u0022 data-cite=\u0022andrewas\u0022\u003E\u003Cdiv\u003ETAC LS cheats - life support is consumed at a constant rate unless the player changes the crew complement which can\u0027t be done while the vessel is on-rails, so it just has to look at elapsed time when the ship is loaded again. Kerbals are alive up to that moment, and then suddenly they died six months ago when the air ran out. \u003Cp\u003EElectricity, though, is mostly generated by solar panels, so the rate changes with distance from the sun and is cut off when the sun is occluded. A TAC LS style cheat would be much harder to do properly because it would have to calculate the vessels path since it was put on rails - oh, and said path is unstable if it crosses into a different SOI at high time warp - and simulate the power generation and consumption. The best solution would be to have code running even on on-rails vehicles. Done carelessly this could kill performance, but its the best way to simulate on-going activities on inactive ships.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI thought TAC LS would do something like that; its probably better to do those calcs when you load the ship rather than having them running constant in the background. Eventually this problem will be solved, as the devs want to add life support, so mods could then use their technique... Whenever that will be!\u003C/p\u003E\u003Cp\u003EI think it\u0027d be fair letting solar panels just produce at 100% capacity while not loaded; it just avoid all the code to find out what direction the ship is facing and what angle the panels are at. Just make so if it goes behind a body, they stop, but otherwise a gigantor produces 18E/s (when not loaded)\u003C/p\u003E\n"},{"CreatedByName":"CaptainShark","CreatedById":109771,"CreatedDateTime":"2014-04-29T06:32:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Random Tank\u0022 data-cite=\u0022Random Tank\u0022\u003E\u003Cdiv\u003EI thought TAC LS would do something like that; its probably better to do those calcs when you load the ship rather than having them running constant in the background. Eventually this problem will be solved, as the devs want to add life support, so mods could then use their technique... Whenever that will be!\u003Cp\u003EI think it\u0027d be fair letting solar panels just produce at 100% capacity while not loaded; it just avoid all the code to find out what direction the ship is facing and what angle the panels are at. Just make so if it goes behind a body, they stop, but otherwise a gigantor produces 18E/s (when not loaded)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlternatively if \u0022just take 100 percent power production\u0022 is too generous:\u003C/p\u003E\u003Cp\u003E- average the power generated over time, ie: assuming a panel generates X amount while fully illuminated, and it falls behind a body 50 percent of the time just do X/2 as its generation\u003C/p\u003E\u003Cp\u003E- or, ignore generation all together and just figure out if the vehicle while idle has a net drop in stored energy over a given space of time, if it does, the vehicle will eventually run dry and operation would have to stop, if not, it would continue indefinitely, theoretically anyway\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-04-29T12:31:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptainShark\u0022 data-cite=\u0022CaptainShark\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E- Research labs:\u003C/p\u003E\u003Cp\u003EEssentially simmilar to the telescope idea, but a \u0022micro-gravity research lab\u0022 of some kind which would slowly generate science over time. Of course requiring constant flow of electricity and the presence of Kerbals to make it work. Could have plenty of potential for funny quotes as well given we\u0027ve all seen footage of astronaughts having fun with microgravity.\u003C/p\u003E\u003Cp\u003E- External experiments rack\u003C/p\u003E\u003Cp\u003ESomething for the Kerbals to visit while on EVA, this would be something simmilar to the materials observation bay but instead of yielding science upon recovery, would yield results and be refreshed via direct intervention of a kerbal on EVA.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like all your ideas, but these two especially though they could possibly be merged. \u003C/p\u003E\u003Cp\u003EI think these could be regulated by requiring the experiment packages to be delivered from the Kerbin. \u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022the purpose of this mission to measure the effects of weightlessness on tiny screws\u0022\u003C/em\u003E \u003C/p\u003E\u003Cp\u003EThe packages could be very fragile. requiring careful flying/ship design. high Gs or impact will cause them to break.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022NO! now we may never know if ants can be trained to sort tiny screws in space\u0022\u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-29T12:47:59Z\u0022 title=\u002204/29/2014 12:47  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 29, 2014\u003C/time\u003E by Capt Snuggler\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"colmo","CreatedById":25950,"CreatedDateTime":"2014-04-29T12:39:56Z","Content":"\n\u003Cp\u003EAgreed with balancing the benefit of continuous science with the cost of Kerbal life support and supplies. Ideally there should be crew rotation and physical data return also.\u003C/p\u003E\u003Cp\u003EIn addition to Dmagic, there\u0027s the Beastly Science Scoop-o-matic automated sampler.\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-04-29T12:41:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptainShark\u0022 data-cite=\u0022CaptainShark\u0022\u003E\u003Cdiv\u003EAlternatively if \u0022just take 100 percent power production\u0022 is too generous:\u003Cp\u003E- average the power generated over time, ie: assuming a panel generates X amount while fully illuminated, and it falls behind a body 50 percent of the time just do X/2 as its generation\u003C/p\u003E\u003Cp\u003E- or, ignore generation all together and just figure out if the vehicle while idle has a net drop in stored energy over a given space of time, if it does, the vehicle will eventually run dry and operation would have to stop, if not, it would continue indefinitely, theoretically anyway\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I meant something like the first idea; just a simple algorithm that works time illuminated vs time not, and just allows the panels to provide full power during that time illuminated. I just meant that if you had a panel that was rotated at weird angle and produced 80% power when loaded, the program would just ignore this and say it produces 100% (to save loading a program that checks the panels rotation).\u003C/p\u003E\u003Cp\u003EAnyway, this has slightly gone off topic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think it\u0027d be even easier to balance these science labs and telescopes when money is implemented; just make very expensive and heavy to justify the lack of effort needed to gain that science compared to interplanetary probes and landers, and use a lot of energy too. Otherwise, I\u0027d love for these to be implemented. Now\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-04-29T15:10:56Z","Content":"\n\u003Cp\u003EI\u0027m still waiting for a Science Sr.\u003C/p\u003E\u003Cp\u003EThe presence of a (relatively large) \u0022Science Jr.\u0022 makes me think that there will be a larger materials bay implemented at some time or another.\u003C/p\u003E\n"},{"CreatedByName":"Meridius","CreatedById":106907,"CreatedDateTime":"2014-04-29T18:49:42Z","Content":"\n\u003Cp\u003EMake the space telescope required for finding planets and moons beyond, say, Jool and an asteroid belt or two. Apply science base on time and finds. Initial thread suggestions are good and, I too, can\u0027t think of why any shouldn\u0027t be implemented.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-04-29T19:55:22Z","Content":"\n\u003Cp\u003EI completely agree. I think probes should have more interesting pieces and animations even if they don\u0027t generate science. Science would be even better though.\u003C/p\u003E\n"},{"CreatedByName":"Wuz314159","CreatedById":94575,"CreatedDateTime":"2014-04-30T01:11:01Z","Content":"\n\u003Cp\u003EThe current Science System is nice.... but it doesn\u0027t take a whole lot of effort to max out the tech tree.\u003C/p\u003E\u003Cp\u003EBut it would be nice if there was more Research Facilities out there that could be used for secondary goals.\u003C/p\u003E\u003Cp\u003ECreating an Exo-Kerbin Base would be amazing.\u003C/p\u003E\u003Cp\u003ELaunch a research module, Hydroponics bay, telescope, habitation module, Kethane Miner type thing, \u002B25 Kerbins \u0026amp; boom, You have an Extraplanetary Launchpad.\u003C/p\u003E\u003Cp\u003EBut that\u0027s my pipedream.\u003C/p\u003E\u003Cp\u003EGetting back to more realistic things, it\u0027s dumb there is no Experiment Storage Module. \u003C/p\u003E\u003Cp\u003EOnly being able to return one surface sample / materials study / et al is unrealistic.\u003C/p\u003E\u003Cp\u003EThere should be a module where you can store a quantity of completed experiments for Kerbin return.\u003C/p\u003E\n"},{"CreatedByName":"Twreed87","CreatedById":50017,"CreatedDateTime":"2014-04-30T03:47:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wuz314159\u0022 data-cite=\u0022Wuz314159\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EGetting back to more realistic things, it\u0027s dumb there is no Experiment Storage Module. \u003C/p\u003E\u003Cp\u003EOnly being able to return one surface sample / materials study / et al is unrealistic.\u003C/p\u003E\u003Cp\u003EThere should be a module where you can store a quantity of completed experiments for Kerbin return.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can store experiments in the Command Pod. It\u0027s very easy. In fact, it does it automatically. Once you get in the pod, all you have to do is get back out and you can collect another sample.\u003C/p\u003E\u003Cp\u003EAnd with the mobile lab, you can do the same with materials lab and mystery goo. Example: get into high orbit, run the experiments. EVA, have your Kerbal \u0022Take Data\u0022, return to the Command Pod. Use the Mobile Lab to clean the experiments, and do it again. Then you can even dump the experiments without having to return them to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"HafCoJoe","CreatedById":80363,"CreatedDateTime":"2014-04-30T04:09:23Z","Content":"\n\u003Cp\u003ETwreed I think he means a storage unit in which you could store say 10 experiments instead of like 2. I agree that\u0027d be really cool.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2014-04-30T04:13:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avera9eJoe\u0022 data-cite=\u0022Avera9eJoe\u0022\u003E\u003Cdiv\u003ETwreed I think he means a storage unit in which you could store say 10 experiments instead of like 2. I agree that\u0027d be really cool.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith the exception of the science lab, any item that can carry science reports can contain any number of non-duplicate reports. Earilier in my current career save, I brought back 63 reports in a single 1-man landercan from Minmus.\u003C/p\u003E\u003Cp\u003EThe Science Lab is the exception: There is no duplicate report restriction on the science lab.\u003C/p\u003E\n"}]}