{"TopicId":71065,"ForumId":55,"TopicTitle":"Shouldn\u0027t Nuclear Engines Have A Higher ISP?","CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2014-04-30T19:54:52Z","PageNum":1,"Articles":[{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2014-04-30T19:54:52Z","Content":"\n\u003Cp\u003EWas just watching this video on NERVA and it says that while ordinary engines have an ISP around 450 a NERVA engine would have an ISP of around 900.\u003C/p\u003E\u003Cp\u003EGo to 4:02 for the description of why the Nuke is so much better than chemical rockets.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/WoiVej1rccs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIf that\u0027s right then what should the ISP of a Kerbal NERVA engine?\u003C/p\u003E\n"},{"CreatedByName":"Pwnstarr","CreatedById":84803,"CreatedDateTime":"2014-04-30T20:03:29Z","Content":"\n\u003Cp\u003EIsn\u0027t the KSP nuclear engine around 890 ISP in vacuum? \u003C/p\u003E\u003Cp\u003EI\u0027ve started experimenting with the ion engines on manned craft... 4200 ISP ... Sure it takes like a 9 minute burn for 4 engines to get a mk1 pod to a Hohmann transfer to the Mun, but thankfully mechjeb exists.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-04-30T20:07:28Z","Content":"\n\u003Cp\u003EEverything in KSP has approximately 100 less I(sp) than real-world equivalent rockets. The LV-N has 800 I(sp) in vacuum, so it\u0027s about on par with the real deal there. The other discrepancies are mostly due to gameplay balance issues: the LV-N was introduced when sandbox was the only mode, and thus all parts had to have parity of some sort with all other parts.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-04-30T20:07:35Z","Content":"\n\u003Cp\u003EIf you have kept up on the debate about the new Ion engine, you will know that some stats in the game are modified from their real life counterparts to be either balanced or not useless.\u003C/p\u003E\u003Cp\u003ESo the answer to your question is yes, but no.\u003C/p\u003E\n"},{"CreatedByName":"R0cketC0der","CreatedById":106748,"CreatedDateTime":"2014-04-30T20:16:08Z","Content":"\n\u003Cp\u003EThere are a lot of things unrealistic in ksp for gameplay reasons. For example, the highest TWR engine in ksp is the KR-2L with 39. The TWR of the real Merlin 1D is over 150. In KSP, the highest ISP of any chemical engines is 390, while that can be over 450 for LH2/LOX in reality.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-30T20:32:18Z","Content":"\n\u003Cp\u003EA while back there was some discussion of what KSP\u0027s fuel and oxidiser are. I came up with an obscure combination that matches the properties well, but really I think it\u0027s more based on RP-1/LOX performance.\u003C/p\u003E\u003Cp\u003EThe LV-N\u0027s vacuum Isp is about right for a NERVA-like rocket. The atmospheric Isp is too low, the real NERVA managed 380s, but that was done for gameplay balance reasons; it\u0027s already far and away the best engine for medium and large interplanetary ships, the atmospheric nerf prevents it being the best engine for launchers too.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-04-30T20:44:59Z","Content":"\n\u003Cp\u003EKeep in mind that the real NERVA, as far as it had been tested, had an even more atrocious thrust/weight ratio than the 2.72 we get. It was barely able to overcome its own weight.\u003C/p\u003E\u003Cp\u003EThere\u0027s probably a lot of room for improvement in NTRs, but with no government willing to take responsibility for a project, we may never see it happen.\u003C/p\u003E\n"},{"CreatedByName":"problemecium","CreatedById":101649,"CreatedDateTime":"2014-04-30T20:45:09Z","Content":"\n\u003Cp\u003EI second the gameplay balance point. With Kerbin being scaled down as it is, SQUAD has the choice of either giving us grossly OP rockets or scaling back their performance to keep a realistic level of difficulty (going to space these days is hard and expensive) - or finding a balance between the two, which they seem to have done well enough so far.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2014-04-30T20:51:44Z","Content":"\n\u003Cp\u003EThe reason I am looking into this is because I was looking at the IMIS (Integrated Manned Interplanetary Spacecraft) Mars mission specs...\u003C/p\u003E\u003Cp\u003EThis is the one I mean...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/djXhbSl.png\u0022 alt=\u0022djXhbSl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was just thinking that the thrust from three of the ingame NERVAs aren\u0027t enough for that size craft.\u003C/p\u003E\u003Cp\u003EOh yeah... the specs I was reading was from \u003Ca href=\u0022http://www.astronautix.com/craft/imis1968.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.astronautix.com/craft/imis1968.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEDIT: Oh and here is something that made me laugh...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dr Wernher von Braun\u0022 data-cite=\u0022Dr Wernher von Braun\u0022\u003E\u003Cdiv\u003EThe systems of the 1970\u0027s are the foundation for building major space facilities in the 1980\u0027s. The 1975 space station evolves into a Space Base that can support up to 100 people by the early 1980\u0027s. This facility allows extensive multi-disciplinary scientific activities as indicated. A geosynchronous station is practical in this time period with the availability of the nuclear shuttle. Similarly, these new systems permit increased lunar operations.\u003Cp\u003EThe logical culmination of the next decade is the 1981 Manned Mars Landing Mission. The systems and experience gained in the 1970\u0027s make this a feasible undertaking.\u003C/p\u003E\u003Cp\u003EIn addition to serving as a focus for the next decade, the 1981 Mars landing is the threshold for manned planetary exploration of the 1980\u0027s.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe we didn\u0027t land on Mars back in the 80\u0027s but we can get our Kerbals to Duna... that makes Kerbals better than humans. GO KERBOL.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-30T21:14:35Z\u0022 title=\u002204/30/2014 09:14  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 30, 2014\u003C/time\u003E by NeoMorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-30T21:17:26Z","Content":"\n\u003Cp\u003EThrust and specific impulse are very different things. And in that ship the engines being proposed were vast by KSP standards, 10 metre diameter. It\u0027s no surprise that they produce nearly 900 kN to the LV-N\u0027s 60.\u003C/p\u003E\u003Cp\u003EEDIT: As it happens the real NERVA was also about 10 m wide, and according to Wiki gave 330 kN of thrust. In ksp we can trounce that with a 3.75 m wide LV-N cluster.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-30T21:20:03Z\u0022 title=\u002204/30/2014 09:20  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 30, 2014\u003C/time\u003E by cantab\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2014-04-30T21:33:15Z","Content":"\n\u003Cp\u003EThis is my point. Take DennyTX\u0027s Saturn V... Lovely model and the current LV-N ingame is about the right size for it (but doesn\u0027t fit right atm... I\u0027m hoping I can talk Denny into making a modded tank mounting)... but the darn LV-N is wimpy in comparison to the human NERVA. Needs a bit of a boost imho.\u003C/p\u003E\n"},{"CreatedByName":"Koolkei","CreatedById":74454,"CreatedDateTime":"2014-05-01T03:03:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EThe reason I am looking into this is because I was looking at the IMIS (Integrated Manned Interplanetary Spacecraft) Mars mission specs...\u003Cp\u003EThis is the one I mean...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/djXhbSl.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/djXhbSl.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI was just thinking that the thrust from three of the ingame NERVAs aren\u0027t enough for that size craft.\u003C/p\u003E\u003Cp\u003EOh yeah... the specs I was reading was from \u003Ca href=\u0022http://www.astronautix.com/craft/imis1968.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.astronautix.com/craft/imis1968.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEDIT: Oh and here is something that made me laugh...\u003C/p\u003E\u003Cp\u003EMaybe we didn\u0027t land on Mars back in the 80\u0027s but we can get our Kerbals to Duna... that makes Kerbals better than humans. GO KERBOL.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou dont watch scott manley do you?\u003C/p\u003E\u003Cp\u003Ehe literally said. we have deltaV way more than enough since LONG time ago. the problem is life support, it takes years to get to duna, and on the way back, about the same time. the part that goes to duna might need to be like 75-80% filled with life support and only can support for one way mission, and not enough for the way back.\u003C/p\u003E\u003Cp\u003Ethe mun, if i remember correctly only needs 3 days to travel, another 3 on the way back. that\u0027s pretty low compared to space base that holds like 6 people or more for like 3 to 6 months.\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-05-01T04:41:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003EWas just watching this video on NERVA and it says that while ordinary engines have an ISP around 450 a NERVA engine would have an ISP of around 900.\u003Cp\u003EGo to 4:02 for the description of why the Nuke is so much better than chemical rockets.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/WoiVej1rccs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIf that\u0027s right then what should the ISP of a Kerbal NERVA engine?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.astronautix.com/engines/nerva.htm\u0022 rel=\u0022external nofollow\u0022\u003EThe Kerbal LV-N seems closer to an older generation NERVA\u003C/a\u003E. Hence the lower I\u003Csub\u003Esp\u003C/sub\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Hannu","CreatedById":60596,"CreatedDateTime":"2014-05-23T05:45:41Z","Content":"\n\u003Cp\u003EI say no. LV-N is more than enough to transport anything practically needed stuff to anywhere in Kerbol\u0027s solar system. If it was modified for builders of superhuge stations of other extremists, normal manned and research activity would be too easy.\u003C/p\u003E\u003Cp\u003EIt is better to compare KSP\u0027s engines to Kerbol system dv requirements than any realistic rocket engines. It takes nearly 10 km/s to even get LEO and about 6 km/s (which is more than enough to go low orbit on any body in KSP) more to low Mars orbit. Such technology would make KSP ridiculously easy game.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-05-23T09:49:10Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/enginelist.php\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/enginelist.php\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAccording to this, a solid core NTR will have an exhaust velocity of 8,093 m/s with hydrogen propellant. This is a specific impulse of 824 maximum.\u003C/p\u003E\u003Cp\u003E800 is rather realistic\u003C/p\u003E\u003Cp\u003EOf course, you can incrase that by disassociating H2 into monatomic hydrogen... but that will increase the complexity and weight even further.\u003C/p\u003E\u003Cp\u003EOr you can increase the temperature even more, but then you might have problems with erosion of the fuel rods and radiactive exhaust.\u003C/p\u003E\u003Cp\u003EOf course, it won\u0027t be as bad as a gas core NTR\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2014-05-23T10:15:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeoMorph\u0022 data-cite=\u0022NeoMorph\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMaybe we didn\u0027t land on Mars back in the 80\u0027s but we can get our Kerbals to Duna... that makes Kerbals better than humans. GO KERBOL.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbals have been to every planet and moon in the star system \u003Cstrong\u003Eand returned\u003C/strong\u003E to Kerbin. Seems a little unfair to ignore Moho, Eve, Jool, Dres and Eeloo \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sanoj688","CreatedById":83090,"CreatedDateTime":"2014-05-23T10:32:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tank Buddy\u0022 data-cite=\u0022Tank Buddy\u0022\u003E\u003Cdiv\u003ESo the answer to your question is yes, but no.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBeautiful.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2014-05-23T15:22:18Z","Content":"\n\u003Cp\u003EUgh, this would all be so much easier if they went 1:1 scale with reality :/\u003C/p\u003E\u003Cp\u003EWell, the forum part anyway. The game\u0027s a lot harder with those scaling mods I\u0027d imagine!\u003C/p\u003E\n"},{"CreatedByName":"Grover","CreatedById":11972,"CreatedDateTime":"2014-05-24T09:06:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Koolkei\u0022 data-cite=\u0022Koolkei\u0022\u003E\u003Cdiv\u003Eyou dont watch scott manley do you?\u003Cp\u003Ehe literally said. we have deltaV way more than enough since LONG time ago. the problem is life support, it takes years to get to duna, and on the way back, about the same time. the part that goes to duna might need to be like 75-80% filled with life support and only can support for one way mission, and not enough for the way back.\u003C/p\u003E\u003Cp\u003Ethe mun, if i remember correctly only needs 3 days to travel, another 3 on the way back. that\u0027s pretty low compared to space base that holds like 6 people or more for like 3 to 6 months.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn real life, an efficient mars transfer is about 8 months, and the moon is about 3.5 days each way (though with a higher dV budget these times can be reduced.\u003C/p\u003E\u003Cp\u003EBack on topic, i thought that the normal chemical rockets have plenty of dV, my first duna lander (which returned even from an accidentally polar landing site with a little help from dres) was an adapted version of a workhorse munar lander, with just 4 asparagus staged fuel tanks (with no engines) to increase the dV suitably, and it still had enough for a 65 degree inclination change using a slingshot around dunas moon before its burn home\u003C/p\u003E\u003Cp\u003EI dont think we need any more dV... what on earth are people trying to move around the kerbol system? Cathedrals? Mountains? A 1000:1 scale model of Jeb? Whats wrong with just a plain old spaceship?\u003C/p\u003E\n"}]}