{"TopicId":72266,"ForumId":55,"TopicTitle":"Planet\u0026#039;s ascending node?","CreatedByName":"Carmoldu","CreatedById":109336,"CreatedDateTime":"2014-05-13T17:21:18Z","PageNum":1,"Articles":[{"CreatedByName":"Carmoldu","CreatedById":109336,"CreatedDateTime":"2014-05-13T17:21:18Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#141823;\u0022\u003E\u003Cspan style=\u0022font-family:Helvetica, Arial, \u0027lucida grande\u0027, tahoma, verdana, arial, sans-serif;\u0022\u003EThe other day I was doing some maneouvers and I found myself without a little piece of information that would have been useful: the planet\u0027s ascending node. The same way in which, when rendezvousing with another craft or astral object under the same SOI as you, the ascending and descending node are shown, giving also the extra information of inclination, I think that this info would also be worthy with respect to the planet you are orbiting at. So, in addition to periapsis and apoapsis, also ascending and descending node were shown, or maybe if the planet was selected they popped out or something like that, and putting the mouse on it showed the inclination. This would enable other features, such as in kerbin when putting the mouse over the ascending or descending node\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022font-family:Helvetica;\u0022\u003E\u003Cspan style=\u0022color:#141823;\u0022\u003E, in addition to the inclination,\u003C/span\u003E\u003C/span\u003E\u003Cspan style=\u0022color:#141823;\u0022\u003E\u003Cspan style=\u0022font-family:Helvetica, Arial, \u0027lucida grande\u0027, tahoma, verdana, arial, sans-serif;\u0022\u003E it also gave the node\u0027s longitude with respect to the KSP, which is located on the equator. \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#141823;\u0022\u003E\u003Cspan style=\u0022font-family:Helvetica, Arial, \u0027lucida grande\u0027, tahoma, verdana, arial, sans-serif;\u0022\u003EThis would give more info in order to determine the exact orbit you are at (it takes 8 independent variables to describe a fixed orbit). In the image there\u0027s a coordinates system. As I propose the Reference direction (Aries point) would rotate with kerbin going through the KSP, and the plane of reference would be the equator. What I propose would give the ascending node longitude, position and inclination.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Orbit1.svg/555px-Orbit1.svg.png\u0022 alt=\u0022555px-Orbit1.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Helvetica;\u0022\u003E\u003Cspan style=\u0022color:#141823;\u0022\u003E What are your thoughts about this?\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"DoToH","CreatedById":68428,"CreatedDateTime":"2014-05-13T19:49:14Z","Content":"\n\u003Cp\u003EMost players use information plugins (Mechjeb, KER, VOID...). It would be nice to have the info in stock.\u003C/p\u003E\n"}]}