{"TopicId":72322,"ForumId":55,"TopicTitle":"Are female Kerbals low priority?","CreatedByName":"Ron2","CreatedById":110775,"CreatedDateTime":"2014-05-14T02:49:29Z","PageNum":1,"Articles":[{"CreatedByName":"Ron2","CreatedById":110775,"CreatedDateTime":"2014-05-14T02:49:29Z","Content":"\n\u003Cp\u003EI bought the game last weekend for my 11 year old daughter. (I\u0027m her dad.) She\u0027s really into it so far (3 or 4 hours). I\u0027m bummed though, that 100% of the characters look masculine, sound masculine, and have masculine names. This all subtly says that being an astronaut is for boys. It doesn\u0027t matter if a game designer says that Kerbals are asexual -- in the game, they\u0027re not. I see that requesting female Kerbals is on the list of questions not to be asked, so I\u0027m asking the meta question -- are female Kerbals low-priority and if so, why?\u003C/p\u003E\u003Cp\u003EOn the \u0022what not to suggest\u0022 list, it\u0027s not a major feature or in any of the other categories. It\u0027s way down in the miscellaneous section, below \u0022Aliens\u0022 and above \u0022random failures/malfunctions\u0022. I\u0027m interpreting this as being very low-priority.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/36863-What-not-to-suggest\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m surprised and disappointed about all this. KSP is otherwise a really neat sandbox game, but I couldn\u0027t recommend using it in a classroom, for example.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-05-14T03:05:07Z","Content":"\n\u003Cp\u003EActually, Ron2, female Kerbals have been placed on the forum\u0027s list of things not to suggest because, oddly enough, it\u0027s a topic that usually ends up in bitter arguments. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E It\u0027s been discussed endlessly without result, and is something we\u0027ve just had to rule out in the interests of keeping our forum civil. Which is why this thread will be closed now.\u003C/p\u003E\n"}]}