{"TopicId":75068,"ForumId":55,"TopicTitle":"Vehicle description in flight","CreatedByName":"Explorator","CreatedById":75632,"CreatedDateTime":"2014-06-14T21:27:51Z","PageNum":1,"Articles":[{"CreatedByName":"Explorator","CreatedById":75632,"CreatedDateTime":"2014-06-14T21:27:51Z","Content":"\n\u003Cp\u003ETitle says it all. I would really enjoy a vehicle\u0027s flight description in flight for mainly one reason and that\u0027s hotkeys. I know theres a bunch of mods out there that let you change them but that\u0027s not really what I want, I want to know simply what the vehicles purpose in my mission, and adding this into the game in my eyes is reasonable and easy.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif\u0022 alt=\u0022:kiss:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KerrMü","CreatedById":78387,"CreatedDateTime":"2014-06-15T23:09:35Z","Content":"\n\u003Cp\u003EThis would be sooooo awesome. I forgot my action groups countless times, too. Maybe something like the F3 function?\u003C/p\u003E\n"},{"CreatedByName":"BossSquirrelz","CreatedById":57719,"CreatedDateTime":"2014-06-16T00:25:41Z","Content":"\n\u003Cp\u003EMight be useful, but then again you could always remember things. Also, Firespitter (I think) has a part that can do this. Still, should be stock. Like \u0027toggle info\u0027 button on the root part or something.\u003C/p\u003E\n"},{"CreatedByName":"pizzaoverhead","CreatedById":26349,"CreatedDateTime":"2014-06-16T14:03:41Z","Content":"\n\u003Cp\u003EA notebook or captain\u0027s log is a commonly suggested feature. The in-flight descriptions would work well as part of a note taking system.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-16T14:15:17Z","Content":"\n\u003Cp\u003EThere\u0027s all sorts of problems with this and docking ships but in general it could be available in map mode under the Info button.\u003C/p\u003E\u003Cp\u003EOr the game could just allow us to view/adjust action groups in flight, that\u0027d be way more useful than just description.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-16T15:20:53Z","Content":"\n\u003Cp\u003EI never have so many ships in play that I forget the purpose of any of them, but I might be in the minority there. Perhaps naming your ships more descriptively could help?\u003C/p\u003E\u003Cp\u003EAgree that some method of viewing/editing action groups in flight is desirable. I use fairly standardized action groups to reduce this problem, but I shouldn\u0027t have to, really.\u003C/p\u003E\n"}]}