{"TopicId":75895,"ForumId":55,"TopicTitle":"Smaller probe parts. (CubeSats)","CreatedByName":"SirJoab","CreatedById":78834,"CreatedDateTime":"2014-06-25T02:16:33Z","PageNum":1,"Articles":[{"CreatedByName":"SirJoab","CreatedById":78834,"CreatedDateTime":"2014-06-25T02:16:33Z","Content":"\n\u003Cp\u003EI love building small unmanned craft. I\u0027d like to see VAB support for smaller parts. (And of course small parts to build with...) I\u0027m thinking something along the lines of \u003Ca href=\u0022https://en.wikipedia.org/wiki/CubeSat\u0022 rel=\u0022external nofollow\u0022\u003ECubeSats\u003C/a\u003E. Such craft would have very limited use, but would be an easy way to reach planets for the first time. A little inspiration: \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.nasa.gov/directorates/heo/home/CubeSats_initiative.html#.U6ov3fldVAo\u0022 rel=\u0022external nofollow\u0022\u003E NASA CubeSat Initiative\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vindelle_Sunveam","CreatedById":70755,"CreatedDateTime":"2014-06-25T09:32:57Z","Content":"\n\u003Cp\u003EI agree at first, but then remember that as an extensive user of probe cores, we already have enough of that.\u003C/p\u003E\u003Cp\u003ESince the Xenon propeller has been overpowered, you can make very light probes with no problems.\u003C/p\u003E\u003Cp\u003EYou may object that Materials and Goo are a bit heavy, but I think this would be going over the CubeSat initiative scope, as these experiment belong more with the main mission, weight-wise (considering that CubeSat is supposed to be an add-on that can be carried if the main mission\u0027s payload is light enough).\u003C/p\u003E\u003Cp\u003ESeriously, consider that a stayputnik, with batteries, solar planels, antennaes, thermo and gravio-meters is mostly made of weightless and physicsless parts, and your suggestion becomes moot until we have no more physicsless parts, nor massless ones.\u003C/p\u003E\n"}]}