{"TopicId":76654,"ForumId":55,"TopicTitle":"Should the aerospike be unnerfed a little?","CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-07-04T12:24:14Z","PageNum":1,"Articles":[{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-07-04T12:24:14Z","Content":"\n\u003Cp\u003EIn 0.18 the Toroidal Aerospike was heavily nerfed because its thrust-to-weight ratio was equal to that of other 1.25m engines but its Isp was much higher (which is simply how an aerospike works). At the time the nerf made sense. There were few engines and the aerospike outclassed them all. But times have changed.\u003C/p\u003E\u003Cp\u003EThe RAPIER engine has become a major contender for the role of SSTO engine, something the nerfed aerospike was often used for. Career mode is now the mode to which parts are balanced, instead of sandbox mode, due to the introduction of the tech tree. The playing field has changed completely. The aerospike dangles at the end of the tech tree like an exciting price but its outclassed by most other engines. I think all parts should have some use, even at the end of the tech tree, but at the moment I find too few uses for the aerospike. This is why I think a change is in order.\u003C/p\u003E\u003Cp\u003EAt the moment the aerospike has three clear disadvantages and one advantage. The advantage is that its atmospheric and vacuum Isp are high and nearly identical. This makes it an ideal engine for launches in an atmosphere. The disadvantages are a lack of thrust vectoring, a lower thrust-to-weight-ratio and the inability to stack it. I think the best way to make the aerospike more useful would be to add a thrust vectoring capability to the engine. The whole point of the aerospike is its efficiency in all layers of an atmosphere, but without thrust vectoring controlling a aerospike is difficult. Control surfaces are a solution, but are generally not enough to control large rockets.\u003C/p\u003E\u003Cp\u003EGiving aerospikes thrust vectoring (which they have IRL) would make it more useful for atmospheric flight, but with the other disadvantages still in place it wouldn\u0027t be OP. Stackability is sometimes necessary, as is higher thrust-to-weight-ratio, meaning engines like the T-30 or T-45 still have a role even after the aerospike is unlocked at the end of the tech tree.\u003C/p\u003E\u003Cp\u003EWhat do you think?\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-07-04T12:38:22Z","Content":"\n\u003Cp\u003EI think it is a niche design and you described this niche it quite well. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-04T12:44:54Z","Content":"\n\u003Cp\u003EI\u0027d rather see stackability added than thrust vectoring. You can add control authority via other methods but the lack of stacking is difficult at best to work around and doesn\u0027t make any sense.\u003C/p\u003E\u003Cp\u003EHigh atmospheric Isp has very little value in the KSP system. On Kerbin it is pretty much matched in efficiency very early in the ascent, and for low altitude flight an air breather is much more efficient. The only niche where it really makes sense is for Eve ascent. I\u0027ve found that I use the aerospike in very few other designs, mostly those where engine length is critical.\u003C/p\u003E\u003Cp\u003EIt should be denerfed a little bit, maybe better TWR either through mass reduction or thrust increase.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-07-04T14:14:43Z","Content":"\n\u003Cp\u003EI\u0027d vote for a bit of mass reduction for aerospikes, leaving other properties as they are. Aerospike is still unmatched for Eve return landers or for Jool deep atmospheric descents. Not much of use but an important one.\u003C/p\u003E\n"},{"CreatedByName":"Winter Man","CreatedById":11358,"CreatedDateTime":"2014-07-04T14:31:26Z","Content":"\n\u003Cp\u003EI\u0027d increase the ISP, but no vectoring. I can\u0027t remember exactly why, but I think it\u0027s to do with the free air stream messing with the aerospike effect. That said, it could just be locked out when in-atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-07-04T20:03:03Z","Content":"\n\u003Cp\u003EI want to preface this comment by pointing out that I haven\u0027t attempted either of the two mission profiles Kashua has mentioned, which I think are the exact profiles the aerospike is designed for.\u003C/p\u003E\u003Cp\u003EI think the Aerospike is fine where it is. \u003C/p\u003E\u003Cp\u003EThis is because it appears that players are using it as the engine of choice for it\u0027s intended purposes, as Kashua described above: Eve ascents \u0026amp; deep Jool missions. If there was a different engine that had completely supplanted the aerospike (see KR 1x2 LFB vs Mainsail), then I would agree that a change should be made. Yes, the RAPIER is now \u003Cem\u003Etypically\u003C/em\u003E the superior SSTO engine, but it \u003Cem\u003Eis\u003C/em\u003E kinda crappy outside of \u003Cem\u003Eit\u0027s\u003C/em\u003E niche: getting to low Kerbin or Laythe orbits from the respective surfaces, where the aerospike shines.\u003C/p\u003E\u003Cp\u003ETo the OP I would ask if the \u0022de-nerfing\u0022 is coming up because of issues you\u0027ve noted in gameplay? Or for other reasons?\u003C/p\u003E\u003Cp\u003EOn stackability: we can\u0027t stack any other high efficiency atmospheric engines (jets, turbojets, rapiers, aerospikes). This also keeps the \u0022Eve ascent\u0022 challenge where it is, which is a weak argument, but still non-trivial IMO.\u003C/p\u003E\u003Cp\u003EOn ISP: if the atmospheric ISP were to be increased further, the vacuum ISP would also see an increase, which would put it above even the LV909 (which has an even worse TWR).\u003C/p\u003E\u003Cp\u003EOn TWR \u0026amp; weight: I think it\u0027s in a similar range as other highly specialized engines, and is fine.\u003C/p\u003E\u003Cp\u003EIf I were going to make any changes to it, I probably just move it down a tier in the tech tree, like the did with Skippers and Mainsails.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Winter Man\u0022 data-cite=\u0022Winter Man\u0022\u003E\u003Cdiv\u003EI\u0027d increase the ISP, but no vectoring. I can\u0027t remember exactly why, but I think it\u0027s to do with the free air stream messing with the aerospike \u003Cp\u003Eeffect. That said, it could just be locked out when in-atmosphere.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAccording to this \u003Ca href=\u0022http://www.aerospaceweb.org/design/aerospike/x33.shtml\u0022 rel=\u0022external nofollow\u0022\u003Erandom internet site\u003C/a\u003E, thrust vectoring seems possible in aerospikes seems possible, at least in the \u003Cem\u003Elinear\u003C/em\u003E aerospike. But yeah, I almost krapped my pants when I found out the aerospike wasn\u0027t vectored. It\u0027s wierd.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-07-04T20:52:35Z","Content":"\n\u003Cp\u003EI brought it up because I\u0027ve been building a lot of SSTOs lately and found that it was hard to use the aerospike successfully compared to other engines. That plus the realization that I don\u0027t use it for any other designs prompted me to open up this discussion.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-07-04T21:12:51Z","Content":"\n\u003Cp\u003EIs there any rocket engine whose Isp is higher in the atmopshere? perhaps that\u0027s be a good buff for the Aerospike: a high-efficiency sustainer engine that\u0027s more efficient in the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Pulstar","CreatedById":57193,"CreatedDateTime":"2014-07-04T21:17:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOn stackability: we can\u0027t stack any other high efficiency atmospheric engines (jets, turbojets, rapiers, aerospikes).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERAPIERs can be stacked IIRC.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-07-04T21:19:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptRobau\u0022 data-cite=\u0022CaptRobau\u0022\u003E\u003Cdiv\u003EI brought it up because I\u0027ve been building a lot of SSTOs lately and found that it was hard to use the aerospike successfully compared to other engines. That plus the realization that I don\u0027t use it for any other designs prompted me to open up this discussion.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair enough. But if you aren\u0027t building vehicles to get out of the atmosphere of Eve or Jool, you\u0027re probably not going to need to use aerospike. \u003C/p\u003E\u003Cp\u003ESimilarly, you probably wouldn\u0027t be using turbojets or RAPIERs if you weren\u0027t building SSTOs. That doesn\u0027t mean there\u0027s a balance issue. (I\u0027ll admit it\u0027s not the best example since they\u0027re crazy overpowered, but I think it makes my point).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pulstar\u0022 data-cite=\u0022Pulstar\u0022\u003E\u003Cdiv\u003ERAPIERs can be stacked IIRC.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuh, it does work. I stand corrected. I still don\u0027t think the aerospike should be stackable though. I like it\u0027s lack of stackability as a less quantifiable limitation for it\u0027s numeric benefits.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-04T21:25:50Z\u0022 title=\u002207/04/2014 09:25  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 4, 2014\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003Cbr\u003ERAPIERs can stack\n\u003C/span\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-07-04T21:28:17Z","Content":"\n\u003Cp\u003EApart from Eve landers, I haven\u0027t really found any use for the Aerospike. Due to low thrust per surface area, it\u0027s a poor choice for a booster engine. The lack of thrust vectoring makes it a bad lower stage engine. Because it can\u0027t be stacked, it doesn\u0027t fit into most upper stages either. It\u0027s too big for landers and orbital maneuvers, and too inefficient for interplanetary transfers.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure if there\u0027s a niche where a modified Aerospike would fit, without making some other engine obsolete.\u003C/p\u003E\n"},{"CreatedByName":"TranquilTempest","CreatedById":18141,"CreatedDateTime":"2014-07-04T22:04:07Z","Content":"\n\u003Cp\u003EI think it could have a bit better thrust to make it more useful on Eve.\u003C/p\u003E\n"},{"CreatedByName":"Haze-Zero","CreatedById":71279,"CreatedDateTime":"2014-07-04T22:50:50Z","Content":"\n\u003Cp\u003EThis is my personal opinion but I feel that the Aerospike should be buffed accordingly, listed in order of preference: \u003C/p\u003E\u003Cp\u003E-The TWR should be brought up to at least be on par with LV-T30 or better.\u003C/p\u003E\u003Cp\u003E-A small amount of gimbal should be added, maybe 1 degree perhaps. (Note that I feel that the gimble of ALL engines should be doubled, in most cases.)\u003C/p\u003E\u003Cp\u003E-Fairings could easily be made for this engine, making it stackable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-04T23:04:18Z\u0022 title=\u002207/04/2014 11:04  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 4, 2014\u003C/time\u003E by Haze-Zero\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2014-07-04T23:08:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI\u0027d rather see stackability added than thrust vectoring. You can add control authority via other methods but the lack of stacking is difficult at best to work around and doesn\u0027t make any sense.\u003Cp\u003EHigh atmospheric Isp has very little value in the KSP system. On Kerbin it is pretty much matched in efficiency very early in the ascent, and for low altitude flight an air breather is much more efficient. The only niche where it really makes sense is for Eve ascent. I\u0027ve found that I use the aerospike in very few other designs, mostly those where engine length is critical.\u003C/p\u003E\u003Cp\u003EIt should be denerfed a little bit, maybe better TWR either through mass reduction or thrust increase.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei kinda disagree here. since the engine has good characteristics in all parts of the atmosphere, that it is rather wasteful to stack it at all. its usually the first engine lit and the last to be shut off in all my designs. they make a good core engine cluster in asparagus launchers, and this would be greatly improved with thrust vectoring. i would only give it marginal thrust vectoring capability though (give it the worst gimbal range of all gimballed engines in the game though), and give it slightly better twr.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-04T23:14:25Z\u0022 title=\u002207/04/2014 11:14  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 4, 2014\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-07-04T23:21:31Z","Content":"\n\u003Cp\u003EI\u0027m not even sure about the Jool \u0026amp; Eva part, either. The smaller Kerbodyne comes close in ISP and has *much* better TWR. I wouldn\u0027t be surprised if it turned out to be the better engine in most cases. One large engine certainly saves a lot of parts -- being almost as good as Aerospikes would be good enough for me.\u003C/p\u003E\u003Cp\u003EI like the look of the aerospike, and would like to use it, but it hardly ever makes sense. According to current stats it will be fiendishly expensive on top of that.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-07-04T23:44:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EI\u0027m not even sure about the Jool \u0026amp; Eva part, either. The smaller Kerbodyne comes close in ISP and has *much* better TWR. I wouldn\u0027t be surprised if it turned out to be the better engine in most cases. One large engine certainly saves a lot of parts -- being almost as good as Aerospikes would be good enough for me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAerospikes are good for medium-sized Eve landers with 1.25 m command pods. LFBs don\u0027t work too well with landers weighting less than 500 tonnes, because anything small built with them has a tendency to be tall and unstable. Even my big 7-kerbal lander with 18 LFBs had some trouble finding level enough ground to land.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-07-05T01:51:56Z","Content":"\n\u003Cp\u003EThe only place I use aerospikes that often now is in my RO\u002BRSS install. Where the aerospike has its real life counter part is closely matched in game. I find it difficult to use but I have been toying with a SSTO linear aerospike powered space plane for a while, just can\u0027t pack enough fuel into it. I have it so it can get to space 200km altitude, but is around 800m/s shy of the orbital speeds needed for Earth.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-07-05T03:31:06Z","Content":"\n\u003Cp\u003EI think the Aerospike is just fine as it is. I can see how it\u0027d be useless to folks who are running 500T landers, but if you design your stages properly I can\u0027t picture a scenario where you\u0027d ever need a vehicle anywhere near that big. 60 tons on the pad is as big as you\u0027d ever need to get in this game (at least without mods), and the Aerospike shines in that region. If anything, it\u0027s a little *too* good.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-07-05T05:02:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EI think the Aerospike is just fine as it is. I can see how it\u0027d be useless to folks who are running 500T landers, but if you design your stages properly I can\u0027t picture a scenario where you\u0027d ever need a vehicle anywhere near that big. 60 tons on the pad is as big as you\u0027d ever need to get in this game (at least without mods), and the Aerospike shines in that region. If anything, it\u0027s a little *too* good.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAlmost all interesting payloads in the stock game consist of 2.5 m parts. The 1.25 m command pods may be convenient in early career mode, but I never use them in any real missions. As a result, my lightest rockets tend to be around 100 tonnes at the launchpad, while most long-range ships are in the 500-1000 tonne range.\u003C/p\u003E\u003Cp\u003EThe way I see it, 1.25 m fuel tanks are meant for attaching payload engines radially. They\u0027re too small for launch vehicles, and as a result, the Aerospike is also too small. A 2.5 m Aerospike with thrust vectoring would be a nice engine for light launch vehicles, however.\u003C/p\u003E\n"},{"CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-07-05T05:41:05Z","Content":"\n\u003Cp\u003EI don\u0027t think the Aerospike is \u0022under-powered\u0022 so to speak, its just a very niche engine. The design philosophy behind it is solid: Its excellent efficiency in atmosphere is unique among KSP rocket engines, but it has more mass and less thrust than engines like the LV-T30 to balance it. In addition, it lacks thrust vectoring, which encourages the use of control surfaces. Because of this, its easy to see that the Aerospike is intended to be used in a planetary atmosphere, rather than in a vacuum (where the LV-N, LV-T30, 48-7S, ect. outclass it). \u003C/p\u003E\u003Cp\u003EOkay then, which atmospheres can I effectively use it in? In KSP there are 5 celestial bodies that have atmospheres: Kerbin, Eve, Duna, Laythe, and Jool. Lets address Kerbin and Laythe first. As you all know, these two planets have atmospheres than contain oxygen, which means jet engines can function in them. When it comes to efficiency and thrust, both turbo jets and RAPIER engines COMPLETELY outclass the Aerospike. Turbo jets offer raw power for their mass and RAPIER engines can switch between air breathing and LFO to work outside the atmosphere. Therefore, there is no reason to use the Aerospike in Kerbin or Laythe\u0027s atmosphere since it has no advantage over the air breathing engines. Okay, that just leaves the oxygen-less atmospheres of Eve, Duna, and Jool as possible places to use an Aerospike. However, the atmosphere of Duna is so thin that rocket engines like the LV-N Atomic Motor and 48-7S can function at almost peak efficiency at most altitudes. Duna also has a very low surface gravity, which means that the almighty LV-N is a viable engine there. Once again, the Aerospike is simply outclassed. So that leaves Eve and Jool. Heck, there is little to no practical reason to actually fly around Jool so while the Aerospike may be somewhat useful there, its not going to see much use there (flying into gas giants is not recommenced). That just leaves Eve. Only here, does the Aerospike truly shine. While all the other engines get smothered in Eve\u0027s oppressive atmosphere, the Aerospike functions at an amazing 388 ISP. With this efficiency, it makes up for its decent thrust by allowing you to take less fuel than if you were using a different engine, which ultimately means that you get a higher Eve TWR with more atmospheric Delta V. Eve is the place that the Aerospike was designed for: an oxygen-less atmosphere that is thick enough to minimize the effectiveness of all the alternative rocket engines. \u003C/p\u003E\u003Cp\u003EIt is for these reasons that many people find the Aerospike useless. It is not necessarily under-powered, its just a niche engine that only happens to be useful in one atmosphere (well two, if you count Jool). Maybe until the addition of more planets/moons with oxygen-less atmospheres will the Aerospike become more widely used, but until then, the Aerospike will only be commonly flying under one sky, Eve.\u003C/p\u003E\n"},{"CreatedByName":"DaveSteadman","CreatedById":59314,"CreatedDateTime":"2014-07-05T11:02:48Z","Content":"\n\u003Cp\u003EHaving just looked up wikipedia:\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://en.wikipedia.org/wiki/Aerospike_engine\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Aerospike_engine\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E- \u003Ca href=\u0022https://en.wikipedia.org/wiki/Rocket_engine\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Rocket_engine\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022A vehicle with an aerospike engine uses 25Ã¢â‚¬â€œ30% less fuel at low altitudes, where most missions have the greatest need for thrust.\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe aerospike engine certainly isn\u0027t a compelling alternative during normal launches. Maybe it should be ramped up a bit to match its real-world advantage.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0022The disadvantages of aerospikes seem to be extra weight for the spike\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EI have no problem with the engine weighing more than a normal rocket engine, its just a number in a config file. The images in the wiki-pages show spikes are often a solid chunk of material, which is arguably less fragile than a rocket exhaust covered in cooling pipes. ie, I\u0027d like to see them stackable.\u003C/p\u003E\u003Cp\u003EWikipedia has no mention of vectoring an aerospike.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-05T11:13:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaveSteadman\u0022 data-cite=\u0022DaveSteadman\u0022\u003E\u003Cdiv\u003EWikipedia has no mention of vectoring an aerospike.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s been studied, but I\u0027m not sure if it\u0027s been done in real life:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://arc.aiaa.org/doi/abs/10.2514/1.B34381?journalCode=jpp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://arc.aiaa.org/doi/abs/10.2514/1.B34381?journalCode=jpp\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://digitalcommons.calpoly.edu/theses/159/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://digitalcommons.calpoly.edu/theses/159/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Random Tank","CreatedById":104325,"CreatedDateTime":"2014-07-05T12:47:55Z","Content":"\n\u003Cp\u003EThe basic Aerospike has a TWR of 11.893, which... isn\u0027t very good; it\u0027s better than the other 2 390 ISP engines, and its very compact, which actually makes it quite useful for landers (even on atmospheric planets) where the LV-N is too heavy. But its TWR is quite a bit worse than the LVT-30 (17.533), and even the LV-T45 (13.592); this kind of makes sense as they are more inefficient engines, so should have the higher TWR. So i\u0027m not sure what to do with it...\u003C/p\u003E\u003Cp\u003EGiving it stacking capability would make it incredibly useful for Lander, all but replacing the LV-909 and Poodle (as thrust vectoring for landers is not that important, it can easily be replaced with reaction wheels, which you need anyway). Giving it thrust vectoring does little; it could make it slightly more useful as a launcher engine (the Aerospike is pretty much the most mass and fuel efficient engine for taking payloads of up to 20t to high altitude with a TWR of 1-1.8 on Kerbin, which is actually quite important), but it\u0027s not really significant. You have to be really careful messing with TWR, as just lowering its weight to 1.25t makes its TWR shoot up to 14.271, which is higher than the LV-T45, which isn\u0027t good.\u003C/p\u003E\u003Cp\u003EI suppose adding thrust vectoring and stacking would make the most sense.... I\u0027d change the Poodle and LV-909 the reflect this though.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-07-05T13:15:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EAlmost all interesting payloads in the stock game consist of 2.5 m parts. The 1.25 m command pods may be convenient in early career mode, but I never use them in any real missions. As a result, my lightest rockets tend to be around 100 tonnes at the launchpad, while most long-range ships are in the 500-1000 tonne range.\u003Cp\u003EThe way I see it, 1.25 m fuel tanks are meant for attaching payload engines radially. They\u0027re too small for launch vehicles, and as a result, the Aerospike is also too small. A 2.5 m Aerospike with thrust vectoring would be a nice engine for light launch vehicles, however.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s the beauty of KSP; nobody says we all have to play it the same way. I am also lifting all the \u0022interesting cargo\u0022, I\u0027m just doing it with smaller launchers. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003E I can see how the aerospike is pretty much useless to you, given the designs you build.... but *I* find it an excellent choice for the designs I build. \u003C/p\u003E\u003Cp\u003E If it is improved any more, it\u0027ll make a whole slew of other engines obsolete. I definitely don\u0027t think it should be vectorable, and I\u0027m cool with not being able to stack it.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"}]}