{"TopicId":76994,"ForumId":55,"TopicTitle":"Speeding up Fuel Transfers with a \u0022Queue\u0022 concept?","CreatedByName":"mpk10","CreatedById":109917,"CreatedDateTime":"2014-07-08T17:02:54Z","PageNum":1,"Articles":[{"CreatedByName":"mpk10","CreatedById":109917,"CreatedDateTime":"2014-07-08T17:02:54Z","Content":"\n\u003Cp\u003EI would love to be able to create a \u0022queue\u0022 for tanks during fuel transfer so that I could set it up and let it run in the background for large ships while I go do something else.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-07-08T19:45:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WildLynx\u0022 data-cite=\u0022WildLynx\u0022\u003E\u003Cdiv\u003EAgree.\u003Cp\u003EAnd may be more commands:\u003C/p\u003E\u003Cp\u003E- Distribute $RESOURCE evenly to ALL tanks. (any tank\u0027s menu)\u003C/p\u003E\u003Cp\u003E- Move BOTH fuel and oxidizer proportionally (checkbox on fuel\u002Boxidizer tank status menu)\u003C/p\u003E\u003Cp\u003E- Move all the $RESOURCE to this side of docking port and distribute it evenly here(any tank AND used docking port selected)\u003C/p\u003E\u003Cp\u003E(on the other side of docking port, all tanks are drained evenly)\u003C/p\u003E\u003Cp\u003E- Move all the $RESOURCE to this side of docking port and store it in this tank, until it full (any tank AND used docking port selected)\u003C/p\u003E\u003Cp\u003E(on the other side of docking port, all tanks are drained evenly too)\u003C/p\u003E\u003Cp\u003E- Move all the $RESOURCE to THIS tank, all other tanks evenly drained\u003C/p\u003E\u003Cp\u003EAny tank with resource is not affected by above \u0022mass resource transfer\u0022 commands if it\u0027s resource usage is disabled. (checkbox already present)\u003C/p\u003E\u003Cp\u003E(good for reserve or balance tanks)\u003C/p\u003E\u003Cp\u003EYet again, I understand, there is mods, but I want to see it in vanilla game...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think applying the transfer on all tanks is a good idea, you should be aware which tanks are changing. So I\u0027d restrict it to all tanks with the menu open.\u003C/p\u003E\u003Cp\u003ELocking LF with oxidizer, definitely.\u003C/p\u003E\u003Cp\u003EAnd then either distribute selected fuel type evenly (by proportion) over all selected tanks, or draw the gauge with mouse on one tank and distribute the change over all remaining tanks evenly.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-07-09T05:37:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WildLynx\u0022 data-cite=\u0022WildLynx\u0022\u003E\u003Cdiv\u003EYou can de-select unwanted tanks by their fuel-flow check boxes, or use special \u0022participate in group transfer\u0022 check box.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENeither looks like a good idea to me.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022WildLynx\u0022 data-cite=\u0022WildLynx\u0022\u003E\u003Cdiv\u003ESpecial panel for resource management would be even better - with all tanks, batteries, their fuel and electricity levels, all the checkboxes, renaming, search, select by criteria, ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think we already have a mod for that.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-09T09:03:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EI think we already have a mod for that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a forum with suggestions for a stock game, not mods. Stuff related to the mods goes here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/4-Add-ons\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/forums/4-Add-ons\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-07-09T14:13:03Z","Content":"\n\u003Cp\u003EYeah, I\u0027d like to see SOME quality of life improvement for resource transfer interface and logic. It\u0027s insanely tedious as it currently stands. \u003C/p\u003E\u003Cp\u003EAnd as pointed out, this is a request for it in STOCK. The fact that mods exist to do it is completely irrelevant in this subforum, beyond demonstrating that it can be done.\u003C/p\u003E\n"}]}