{"TopicId":78820,"ForumId":55,"TopicTitle":"Space Planes need a little love.","CreatedByName":"Makolic","CreatedById":116225,"CreatedDateTime":"2014-07-21T15:01:53Z","PageNum":1,"Articles":[{"CreatedByName":"Makolic","CreatedById":116225,"CreatedDateTime":"2014-07-21T15:01:53Z","Content":"\n\u003Cp\u003EWhile more tweaking would be nice.\u003C/p\u003E\u003Cp\u003E Maybe others are feeling it, or maybe I\u0027m not doing something right..? But if it could be tweaked where you have your nose even with the horizon. That would be the direction of the planes heading. Though this could be hard to implement with how rockets would feel. But, some stability corrections in the planes would be nice. So the craft can fly in a straight line with little need for corrections. So it doesn\u0027t feel like you are trying to fly a rocket with wings. But instead flying a real aircraft.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-07-21T15:30:40Z","Content":"\n\u003Cp\u003EWhile space plane physics \u003Cem\u003Eare\u003C/em\u003E simplified compared to how they would be in, say, a flight simulator... no, that\u0027s how planes are. It\u0027s not uncommon to have to set trim on every flight to get the plane flying level (source: lots of time killed playing flight simulators), and you can do this in KSP too; just use Alt\u002BWASD to set trim in whatever axis the plane needs in order to be stable.\u003C/p\u003E\n"},{"CreatedByName":"Makolic","CreatedById":116225,"CreatedDateTime":"2014-07-21T15:37:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EWhile space plane physics \u003Cem\u003Eare\u003C/em\u003E simplified compared to how they would be in, say, a flight simulator... no, that\u0027s how planes are. It\u0027s not uncommon to have to set trim on every flight to get the plane flying level (source: lots of time killed playing flight simulators), and you can do this in KSP too; just use Alt\u002BWASD to set trim in whatever axis the plane needs in order to be stable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot much of a pilot, I was also unaware the game had trims. Bit of helpful info, though it still leaves issues of blowback. I was not only talking about simulators... Plus it depends on the simulator and settings. I\u0027ve played some that are pretty realistic, while needing the full set up. From the stick to the peddles to fly correctly. But it feels stick, while being nearly impossible to turn correctly. Along with the setting is to fast in altitude lost or gain. You can set a craft at certain speeds on a near zero gain/loss. It would depend on balance, make, and thrust. It just feels to stick, almost like the only difference between your rockets and plane. Is one has a different engine and look. But it flies the same, while in real life. A rocket does not fly anything like a plane.\u003C/p\u003E\u003Cp\u003E Remember, they said Discovery was like flying a brick. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-07-21T15:44:28Z","Content":"\n\u003Cp\u003ETry changing the angle of incidence of your main wings up a bit, especially if you\u0027re consistently flying with the nose up. Pretty sure that works in stock (I usually play with FAR because stock aero is so incredibly bad).\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-07-21T15:58:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Makolic\u0022 data-cite=\u0022Makolic\u0022\u003E\u003Cdiv\u003EWhile more tweaking would be nice.\u003Cp\u003E Maybe others are feeling it, or maybe I\u0027m not doing something right..? But if it could be tweaked where you have your nose even with the horizon. That would be the direction of the planes heading. Though this could be hard to implement with how rockets would feel. But, some stability corrections in the planes would be nice. So the craft can fly in a straight line with little need for corrections. So it doesn\u0027t feel like you are trying to fly a rocket with wings. But instead flying a real aircraft.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAero does need another pass at some point. Until then, if you\u0027re after an aircraft that gives lift while horizontal, you can use the shift key modifier when rotating the wing and fin parts in the VAB/SPH. This will enable a (I think) 5 degree rather than 90 degree rotation. Make the wings a little dihedral by rotating the tips toward the surface and the aircraft will start to self-correct like it should. Also try and make things a little nose heavy, with the yellow ball just that little bit in front of the blue when you enable the CoL/CoM icons in the bottom-left of the screen. That can help with stability, along with being careful about how fuel tanks empty and cause the CoM to move around the aircraft.\u003C/p\u003E\u003Cp\u003EUnfortunately there\u0027s not much I can do about the soupy lower atmosphere or the odd unrecoverable stall behaviour without mods (popular ones are \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/20451-0-24-Ferram-Aerospace-Research-v0-14-7-17-14\u0022 rel=\u0022external nofollow\u0022\u003EFAR\u003C/a\u003E and the up-and-coming, jocularly-titled \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86419-0-24-NEAR-A-Simpler-Aerodynamics-Model-v1-0-2-7-18-14\u0022 rel=\u0022external nofollow\u0022\u003ENEAR\u003C/a\u003E). Given this is still an alpha-state early-access game though, you and I both have to expect that it\u0027s not going to be feature-complete yet. For a game that\u0027s just announced v0.24, typically meaning way less than halfway done, I\u0027m impressed with what they\u0027ve done so far. Moreso since joining the community mod team, and being able to sneak a peek at some of the cool-but-unstable stuff in development and the speed at which bugs crop up and get whacked down again.\u003C/p\u003E\u003Cp\u003EAlso, welcome to the forums.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-21T16:07:12Z\u0022 title=\u002207/21/2014 04:07  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 21, 2014\u003C/time\u003E by technicalfool\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Makolic","CreatedById":116225,"CreatedDateTime":"2014-07-21T16:02:53Z","Content":"\n\u003Cp\u003EThank you for the welcome. Yes I\u0027m not expecting perfection, this early... I don\u0027t really think I can think of perfection even when they reach v1.00. Since a lot of big name games, with lots of money put into them. Still have huge bugs, and very questionable parts of gameplay.\u003C/p\u003E\u003Cp\u003E Though, yeah I would love a couple of tweaks maybe in v0.26. Not a whole lot or a complete rewrite. But, maybe a nudge here and there.\u003C/p\u003E\u003Cp\u003E But, thanks for the information. I\u0027ll give it a try, the next time I go to take my plane out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}