{"TopicId":79096,"ForumId":55,"TopicTitle":"Precision parts alignment, especially wheels.","CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-07-23T01:09:31Z","PageNum":1,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-07-23T01:09:31Z","Content":"\n\u003Cp\u003EAn issue with assembling ground vehicles in VAB and SPH is wheels tend to not get attached \u003Cem\u003Eperfectly aligned\u003C/em\u003E. Even the slightest bit off and your rover will need constant steering correction or your aircraft will not track straight down the runway.\u003C/p\u003E\u003Cp\u003EWhat KSP needs is a way to attach wheels perfectly aligned to any of the orthogonal axes, and possibly a direct text entry box for degrees if for some reason you want your wheels toed in 3 degrees.\u003C/p\u003E\u003Cp\u003EThis can be edited in the craft file, even in the persistent and quicksave file, but it\u0027d be much better if KSP would just attach the wheels perfectly straight.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52288-Rover-wheel-alignment\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/52288-Rover-wheel-alignment\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe same would also be useful for attaching other parts. Many times I\u0027ve built things that would not fly straight, but if I took parts off and reattached them the craft would work, apparently because something worked just a bit differently and the part attached just right.\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-07-23T02:03:34Z","Content":"\n\u003Cp\u003EYes and no. There are multiple ways around this, i normally put wheels ofset on any straight part for my SSTO\u0027s.\u003C/p\u003E\u003Cp\u003EThe addition of a more accurate attachment could be useful, but it also could be kind of annoying and unnecessary.\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-07-23T02:09:30Z","Content":"\n\u003Cp\u003EOf course it should be possible to override perfectly straight alignment, simply by rotating the part. It should also have a way to snap parts back to perfect alignment.\u003C/p\u003E\u003Cp\u003EA plugin with UI additions to set precision angles would be most welcome.\u003C/p\u003E\n"},{"CreatedByName":"Mars Mullo","CreatedById":110160,"CreatedDateTime":"2014-07-23T02:11:25Z","Content":"\n\u003Cp\u003EI agree with Galane.\u003C/p\u003E\u003Cp\u003EOften parts are added in orthagonal symetry mode and there totally not symetrical or aligned.\u003C/p\u003E\u003Cp\u003EI often have to revert to placing parts individually because I can better accuracy than using symetry.\u003C/p\u003E\u003Cp\u003EMy Rovers have proven the problems with even minimal non alignment.\u003C/p\u003E\u003Cp\u003EOf course we already know the whole building views problems. \u003C/p\u003E\u003Cp\u003EI often have to get very clever and build parts in VAB and the the other SAB? building and then create sub assemblies of them when perfect.\u003C/p\u003E\u003Cp\u003EThis later allows me to make use of the different pros and cons of both assembly buildings when placing parts together.\u003C/p\u003E\u003Cp\u003EIt\u0027s a work around I use because I don\u0027t really understand how to type out file contents. Thats akin to having to be good a HTML just to use Excell better. Why?\u003C/p\u003E\u003Cp\u003EBesides even attachment points don fit perfectly... shame we can\u0027t CAD out builds and import them... or use sketch-up or somthing with parts libraries.\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-07-23T02:53:03Z","Content":"\n\u003Cp\u003ESounds like a job for Padishars \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81390\u0022 rel=\u0022external nofollow\u0022\u003EPart Angle Display (heh, Pads PAD).\u003C/a\u003E\u003C/p\u003E\n"}]}