{"TopicId":79169,"ForumId":55,"TopicTitle":"Things to keep in mind when expanding the contract system.","CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-07-23T15:17:34Z","PageNum":1,"Articles":[{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-07-23T15:17:34Z","Content":"\n\u003Cp\u003EAt the moment, KSP is really more about engineering than science. Most of the contracts are engineering based- testing parts. \u003C/p\u003E\u003Cp\u003EWhile this is fine, KSP would feel a lot more fleshed out if space science was better represented..\u003C/p\u003E\u003Cp\u003E While it could equally be due to the fact that KSP is not fully developed, some of the simplicity in the science missions makes me wonder if there\u0027s a certain mentality in the dev team- after all, KSP was once a simple rocket building game.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EI\u0027d like to offer some things for the devs to think about when fleshing out the contracts in the future:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cstrong\u003EAstrobiology/Search for life.\u003C/strong\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe search for life on other planets is a big motivator behind many human space missions. Maybe the kerbals aren\u0027t as concerned as us about looking for life, but this sort of thinking could be used to come up with interesting contracts. Or at least, flavour text for contracts. Looking for life overlaps considerably with...\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAstrogeology\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAt its core, science comes from (ker)man\u0027s desire to know. In this case, know how the solar system formed, know the processes that shape each planet, and what their conditions are like. On top of that, geological investigation is important in the search for life, by both determining if a planet could\u0027ve been habitable in the past, and finding anomalous readings that suggest the presence of microbes. \u003C/p\u003E\u003Cp\u003EBio/geo overlap, so might the contracts. Some possible examples might be:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EWe think _____ area on Duna might have once been suitable for life. Transmit five samples 1.8 Km. apart.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EFrom past data, Eeloo seems to have an underground sea. Look for evidence for this in the gas plumes it gives of. (pass over its south pole.)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThese might be best unlocked once you\u0027ve already at/been to the targets.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ERadiophysics experiments\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThose scientists can do a lot with the right radio beam. My favourite example is Cassini\u0027s relativity experiment. Something like that would be simple to set up in KSP:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EWe don\u0027t quite understand the details, but ----- has come up with a way to test the theory of relativity. When a spacecraft orbiting the sun is opposite Kerbin, transmit a signal. We\u0027ll do the rest.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOr, this kind of contract could be more complex:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EHave two spacecraft in orbit around Jool. Have one transmit a signal. (You could add more specific orbital parameters to this.)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ERead up on real life space missions-NASA and ESA have some great resources out there. Or why not just talk to NASA?\u003C/p\u003E\u003Cp\u003EI know the devs probably don\u0027t read this forum regularly, but I hope this gets into the proper channels. Remember, science, not just engineering.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-23T16:15:14Z\u0022 title=\u002207/23/2014 04:15  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 23, 2014\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Commander Jebidiah","CreatedById":78685,"CreatedDateTime":"2014-07-23T15:20:44Z","Content":"\n\u003Cp\u003EI think this is a brilliant idea!\u003C/p\u003E\u003Cp\u003Ealso first:D\u003C/p\u003E\n"}]}