{"TopicId":79841,"ForumId":55,"TopicTitle":"Cameras and shovels \u002B experiments for probes","CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-28T14:21:17Z","PageNum":1,"Articles":[{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-28T14:21:17Z","Content":"\n\u003Cp\u003EAt the moment probes canot generate any EVA report ...\u003C/p\u003E\u003Cp\u003Ethey also cannot collect surface samples.\u003C/p\u003E\u003Cp\u003EAt the moment we also donÃ‚Â´t have some of the instruments that are included in all (cameras) or many (sample collection) probe missions\u003C/p\u003E\u003Cp\u003ETherefore my suggestion are the following instruments, made only for unmanned missions in order to generate EVA reports/surface sample science:\u003C/p\u003E\u003Cp\u003E1. Cameras\u003C/p\u003E\u003Cp\u003EThe camera could be used once per Biome the probe/rover is in and would generate a certain percentage (maybe 25%, maybe even just 10%) of the EVA report science a Kerbonaut produces (and would also be subject to the EVA report science pool for the respective Biome).\u003C/p\u003E\u003Cp\u003E2. Scoop \u003C/p\u003E\u003Cp\u003EA scoop would collect a surface sample ... afterwars it can be used in 2 ways:\u003C/p\u003E\u003Cp\u003Ea) On Board Sample Experimental unit ... this is an on board experiment that generates a percentage of the surface sample points a Kerbonaut would produce (like 25% or 10% of it) and would also be subject to the surface sample sc ience pool for the Biome\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Sample Return Container ... This container would store the surface sample in order to return it to Kerbin ... a sample collected this way would either generate the full percentage of a surface sample that is brought back home by a Kerbonaut, or at least 50% of it (taking into account that maybe a Kerbonaut on the ground is better at selecting surface samples)\u003C/p\u003E\u003Cp\u003EWith regards to Cameras there might even be several models (like ... B/W, Basic Color, Advanced Color) each getting different percentages (of Kerbonauts EVA report science points) out of the Biome and each located at a different node in the tch tree.\u003C/p\u003E\u003Cp\u003EIMHO these changes would integrate very well into the existing game (after all they only tap into science pools that are already there, i.e. the EVA and surface sample science pools) and the game play ... especially the play with inmanned probes, would win a lot by this.\u003C/p\u003E\u003Cp\u003EIt would increase the usefulness of probes and would also increase the similarity of KSP probe missions and RL probe missions\u003C/p\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-07-28T15:04:19Z","Content":"\n\u003Cp\u003EAlthough I\u0027d like to see that coming, I fear this makes Kerbals even more useless than they are now.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-28T15:11:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022M3tal_Warrior\u0022 data-cite=\u0022M3tal_Warrior\u0022\u003E\u003Cdiv\u003EAlthough I\u0027d like to see that coming, I fear this makes Kerbals even more useless than they are now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou would still need 10 probe missions (if we assume that the instruments produce 10% of a Kerbals EVA report /surface sample science) to a Biome in order to produce the EVA/surface sample of a single Kerbonaut (or a single reusable probe \u002B an orbiting science lab \u002B refuel station)\u003C/p\u003E\u003Cp\u003E(all under the assumption that it is implemented along the way I depicted in my OP, that is, that the scoop and cams could only be used once per Biome [and mounting multiple scoops/cams wouldnÃ‚Â´t allow you multiple EVA reports/surface samples per Biome])\u003C/p\u003E\u003Cp\u003ESo manned missions would still be more cost and time efficient than probe missions would be.\u003C/p\u003E\u003Cp\u003EThe biggest difference IMHO would be Eve ... as you wouldnÃ‚Â´t a manned mission (either a one way with the sacrifice/marooning of Kerbals on Eve or a hyperdesigned return one) anymore in order to gain EVA and surface sample science from there\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-28T15:14:13Z\u0022 title=\u002207/28/2014 03:14  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 28, 2014\u003C/time\u003E by Godot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-07-28T15:28:40Z","Content":"\n\u003Cp\u003ESure, but then: Does it actually make sense? Like you get about 20 science from a probe EVA report (that\u0027s somehow a contradiction, but anyways) on planet X, but the probe itself flies for 2 years to reach that planet - during that you can do so much other science on Mun and Minmus, you don\u0027t need the science any longer when that probe reaches its destination. I don\u0027t think this\u0027ll really help. \u003C/p\u003E\u003Cp\u003EI use probes for almost all ships, except for the landers/space stations - this way I don\u0027t have to return my little green guys after having hauled up another gigantic part of station XYZ. I do think they\u0027re pretty useful atm, and I can\u0027t really complain. \u003C/p\u003E\u003Cp\u003EBut on the other hand: If Kerbals are implemented with some personality/personalization, I won\u0027t cry when your suggestion is implemented too. I just won\u0027t use it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2014-07-28T15:48:31Z","Content":"\n\u003Cp\u003EAs with any new feature, probe-based science would require balancing against what is already there. Remember that this is a suggestion and not an overview of the final implementation of the feature.\u003C/p\u003E\u003Cp\u003EThat said, I have my own ideas for how this could work.\u003C/p\u003E\u003Cp\u003E- Instead of doing EVA reports and taking surface samples like a Kerbal, which would indeed make them obsolete, add the new Camera and Scoop parts, but their science activities are \u0022visual analysis\u0022 and \u0022surface analysis,\u0022 respectively.\u003C/p\u003E\u003Cp\u003E- Visual and Surface analysis science won\u0027t be worth nearly as much as EVA reports or surface samples since the analysis equipment is a camera and a shovel, and actually getting analysis done in a sophisticated laboratory is better than a simple scan from a probe.\u003C/p\u003E\u003Cp\u003E- Just like IRL, until the Kerbals\u0027 probe-based science equipment is capable of performing all the functions of a Kerbin-based laboratory, getting Kerbals to bring back physical samples and subjective opinions on the environment beyond simple numbers will yield a fair amount of extra science vs probe analysis. Even if Kerbal technology was on-par with ours (which, IIRC, it\u0027s not) they would still benefit from having Kerbals go onsite to perform science.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-07-28T16:05:49Z","Content":"\n\u003Cp\u003EI can\u0027t get behind this for the simple reason that it takes away from Kerbals, even gimped as it is. We need more reasons to send more Kerbals to more places.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2014-07-29T00:38:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI can\u0027t get behind this for the simple reason that it takes away from Kerbals, even gimped as it is. We need more reasons to send more Kerbals to more places.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I agree with the first part of your statement, I don\u0027t get that second part. Assuming it isn\u0027t implemented, don\u0027t we have plenty of reasons to send Kerbals, in both science-y and fund-y ways?\u003C/p\u003E\u003Cp\u003EMy biggest complaint is that there\u0027s no reason to send \u003Cem\u003Eanything\u003C/em\u003E outside of Kerbin\u0027s SOI anymore.. Except maybe to peek at interplanetary space and zip back in for some quick science.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2014-07-29T00:47:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Renegrade\u0022 data-cite=\u0022Renegrade\u0022\u003E\u003Cdiv\u003EMy biggest complaint is that there\u0027s no reason to send \u003Cem\u003Eanything\u003C/em\u003E outside of Kerbin\u0027s SOI anymore.. Except maybe to peek at interplanetary space and zip back in for some quick science.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMin/minus EVA reports from all biomes gets super boring, while a single mission to duna/Ike can net a whole ton of science in less playtime and with a lot less tedium. \u003C/p\u003E\u003Cp\u003EAlso, it might not be sandbox mode but it\u0027s still a sandbox game.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-29T07:02:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OrbitusII\u0022 data-cite=\u0022OrbitusII\u0022\u003E\u003Cdiv\u003EAs with any new feature, probe-based science would require balancing against what is already there. Remember that this is a suggestion and not an overview of the final implementation of the feature.\u003Cp\u003EThat said, I have my own ideas for how this could work.\u003C/p\u003E\u003Cp\u003E- Instead of doing EVA reports and taking surface samples like a Kerbal, which would indeed make them obsolete, add the new Camera and Scoop parts, but their science activities are \u0022visual analysis\u0022 and \u0022surface analysis,\u0022 respectively.\u003C/p\u003E\u003Cp\u003E- Visual and Surface analysis science won\u0027t be worth nearly as much as EVA reports or surface samples since the analysis equipment is a camera and a shovel, and actually getting analysis done in a sophisticated laboratory is better than a simple scan from a probe.\u003C/p\u003E\u003Cp\u003E- Just like IRL, until the Kerbals\u0027 probe-based science equipment is capable of performing all the functions of a Kerbin-based laboratory, getting Kerbals to bring back physical samples and subjective opinions on the environment beyond simple numbers will yield a fair amount of extra science vs probe analysis. Even if Kerbal technology was on-par with ours (which, IIRC, it\u0027s not) they would still benefit from having Kerbals go onsite to perform science.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Visual Analysis\u0022 and \u0022Surface Analysis\u0022 as additional science categories sound like a very good idea ...\u003C/p\u003E\u003Cp\u003Ethis way we still have enough reasons to send Kerbals to places but have good reasons to also send unmanned probes to places (and not just Kerbonauts)\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2014-07-29T09:20:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI can\u0027t get behind this for the simple reason that it takes away from Kerbals, even gimped as it is. We need more reasons to send more Kerbals to more places.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m inclined to agree, but I think the kerbals will be expanded in the future which should make them more important. I think they will always offer a MUCH higher rep reward. \u003C/p\u003E\u003Cp\u003Eperhaps \u0022advanced robotics\u0022 (scoops, drills etc) could be a later tech tree item. maybe these advanced probe components could be very fragile or prone to dust damage?(spirit rover) kerbals could repair them.\u003C/p\u003E\n"}]}