{"TopicId":80080,"ForumId":55,"TopicTitle":"Control distance extended or tweakable?","CreatedByName":"liko2k","CreatedById":69416,"CreatedDateTime":"2014-07-30T07:05:49Z","PageNum":1,"Articles":[{"CreatedByName":"liko2k","CreatedById":69416,"CreatedDateTime":"2014-07-30T07:05:49Z","Content":"\n\u003Cp\u003EHello Kerbonauts! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI haven\u0027t found this topic on the banned or planned list. I couldn\u0027t find it through search either. So, my question is:\u003C/p\u003E\u003Cp\u003EDue to the fact that the parts recovery has been implemented in the career mode, can the control distance be extended to, say 10-20km? Right now, if one wants to recover parts of spaceship such as boosters after they have been detached, it is not possible if the main spaceship moves further than 2.5km from the boosters. If the control distance was to be increased (even by individual tweaking) such recovery would become possible.\u003C/p\u003E\u003Cp\u003EIf I\u0027m duplicating some post, please feel free to move or delete this one, but please point me to the main discussion about this problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThank you!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-30T08:46:08Z\u0022 title=\u002207/30/2014 08:46  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 30, 2014\u003C/time\u003E by liko2k\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"iStickyDuck","CreatedById":75908,"CreatedDateTime":"2014-07-30T09:24:19Z","Content":"\n\u003Cp\u003EI support this because even if I detach a stage that has parachutes on it, as soon as it hits the atmosphere when it\u0027s beyond 2.5km, it vanishes and becomes unrecoverrable\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-07-30T09:30:02Z","Content":"\n\u003Cp\u003EThis would cause a hell of a lot of lag, especially if you\u0027ve got more than a few pieces flying off in different directions (e.g., in the case of spontaneous unplanned craft disassembly). If you want to give it a shot anyway, I\u0027d recommend you give Romfarer\u0027s Lazor System a try -- that is one of its many features. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-30T09:41:54Z\u0022 title=\u002207/30/2014 09:41  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 30, 2014\u003C/time\u003E by vexx32\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"liko2k","CreatedById":69416,"CreatedDateTime":"2014-07-30T13:16:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EThis would cause a hell of a lot of lag, especially if you\u0027ve got more than a few pieces flying off in different directions (e.g., in the case of spontaneous unplanned craft disassembly). If you want to give it a shot anyway, I\u0027d recommend you give Romfarer\u0027s Lazor System a try -- that is one of its many features. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for answer! \u003C/p\u003E\u003Cp\u003EDo you think that now, when we are running 64bits version of the KSP and have large amounts of memory at hand, this would still cause a lot of lag? Do you know what is the control radius in the Lazor mod?\u003C/p\u003E\u003Cp\u003EBesides, what is the difference of falling apart on the launchpad and falling apart in the atmosphere? Once landed, the parts can be uncontrollable as, for example, planted flags (and recovered at the end of the mission).\u003C/p\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-07-30T13:32:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022liko2k\u0022 data-cite=\u0022liko2k\u0022\u003E\u003Cdiv\u003EDo you think that now, when we are running 64bits version of the KSP and have large amounts of memory at hand, this would still cause a lot of lag?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou don\u0027t get the point of both what he said and what 64bit does. \u003C/p\u003E\u003Cp\u003E64bit enables a computer to allocate more than 3.x GB of RAM, thus loading times decrease for most stuff can be kept in a sufficiently large instant-access-memory (that\u0027s what a RAM is). It does NOT increase the CPU performance, and since physics is solely a matter of CPU performance (or, if possible by game and GPU, a matter of the second graphic card), 64bit gains you nothing at all there.\u003C/p\u003E\u003Cp\u003EWhat vexx32 tried to tell you is that the bigger the bubble of physics is, the more ships and parts will eventually fit in there -\u0026gt; more parts having to be physically processed -\u0026gt; more load on the CPU/GPU -\u0026gt; less FPS -\u0026gt; more lag.\u003C/p\u003E\n"},{"CreatedByName":"liko2k","CreatedById":69416,"CreatedDateTime":"2014-07-30T13:41:05Z","Content":"\n\u003Cp\u003EAll right, it makes sense. I thought that memory IS used in larger quantities in more power-hungry computations. Nevertheless, it is still a bubble. When you are lifting from launchpad, radius on the ground gets smaller and smaller, eventually getting out of range of simulation. There would be enough time for parts to land. And again, if your computer is capable to calculate all parts during the spontaneous disassembly, it will be able to calculate them until you order a cleanup and recovery of all surviving parts for cash.\u003C/p\u003E\u003Cp\u003EBesides, it would be good to let people with more powerful machines to decide about this radius by themselves.\u003C/p\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-07-30T13:51:27Z","Content":"\n\u003Cp\u003EWell, technically more calculation do need more memory, but that\u0027s just a relatively small amount compared to graphics and planets and the rocket itself. And yes, the radius gets smaller, but after you reached 2564m, the radius equals zero and no calculations will be done for impact and other physics - and most of us reach 2.5km pretty fast. \u003C/p\u003E\u003Cp\u003ESide note: It would be possible to adjust the size of the bubble on the fly based on the idle process usage of the system. A similar shot was made around 2000 with the game \u0027Sacrifice\u0027, which calculated graphic enhancement, polygons and other eye candy solely on your available GPU time and the distance between camera/sorcerer and object/landscape. This way there were almost no graphic settings ingame, it all was done by the game itself. AFAIK this was a unique feature and wasn\u0027t continued in other games, much to my regrets.\u003C/p\u003E\n"},{"CreatedByName":"liko2k","CreatedById":69416,"CreatedDateTime":"2014-07-30T15:26:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022M3tal_Warrior\u0022 data-cite=\u0022M3tal_Warrior\u0022\u003E\u003Cdiv\u003EWell, technically more calculation do need more memory, but that\u0027s just a relatively small amount compared to graphics and planets and the rocket itself. And yes, the radius gets smaller, but after you reached 2564m, the radius equals zero and no calculations will be done for impact and other physics - and most of us reach 2.5km pretty fast. \u003Cp\u003ESide note: It would be possible to adjust the size of the bubble on the fly based on the idle process usage of the system. A similar shot was made around 2000 with the game \u0027Sacrifice\u0027, which calculated graphic enhancement, polygons and other eye candy solely on your available GPU time and the distance between camera/sorcerer and object/landscape. This way there were almost no graphic settings ingame, it all was done by the game itself. AFAIK this was a unique feature and wasn\u0027t continued in other games, much to my regrets.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt would be enough to have a slider to adjust the radius by yourself, or introduce auto-tuning option based on your example. The first is much simpler to implement though... IDK if this version is fully using all thread/cores in modern CPUs - if it does there is plenty of power on our disposal. Especially that the game is being developed for a long time now and a lot of advances were seen in the CPU world (especially in Intel\u0027s processors). What about openCL?\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-07-30T15:36:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EThis would cause a hell of a lot of lag\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends on a hardware you have.\u003C/p\u003E\u003Cp\u003EIt might cause hell of a lag for you - but for me it\u0027ll most likely be perfectly playable.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-07-30T15:52:04Z","Content":"\n\u003Cp\u003EGo right ahead and try it, then. I personally don\u0027t think this is a useful solution to the problem you really want to address -- recoverability of craft. There are other abstractions you could use to simply perform a much more concise calculation to determine if a dropped section would reach the ground (and approximately where it would reach the ground, if necessary) along with which parts are likely to survive the landing (taking into account parachutes and so forth). It would be a simplified simulation, but I feel it would suffice for the purposes that OP seems concerned about.\u003C/p\u003E\n"},{"CreatedByName":"liko2k","CreatedById":69416,"CreatedDateTime":"2014-07-30T16:15:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sky_walker\u0022 data-cite=\u0022Sky_walker\u0022\u003E\u003Cdiv\u003EDepends on a hardware you have.\u003Cp\u003EIt might cause hell of a lag for you - but for me it\u0027ll most likely be perfectly playable.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMine should be also capable of running it smoothly. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EGo right ahead and try it, then. I personally don\u0027t think this is a useful solution to the problem you really want to address -- recoverability of craft. There are other abstractions you could use to simply perform a much more concise calculation to determine if a dropped section would reach the ground (and approximately where it would reach the ground, if necessary) along with which parts are likely to survive the landing (taking into account parachutes and so forth). It would be a simplified simulation, but I feel it would suffice for the purposes that OP seems concerned about.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou mean using LAZOR, right? I will try although I don\u0027t know how does the control limit works in that mod.\u003C/p\u003E\u003Cp\u003ECurrently there is no way to recover any part of a multiple-stage to orbit craft (except of course the lander itself) short of installing probe capsules on each boosters and trying to trace it down to earth... With the mods reproducing USA shuttles program for example it becomes even more important to be able to tweak this value.\u003C/p\u003E\n"},{"CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-07-30T21:17:56Z","Content":"\n\u003Cp\u003EMay I direct you to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86248-0-24-If-a-Booster-Has-Enough-Parachutes-On-It-Count-it-as-Recovered\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E which is 13 pages (which I did not all read) of discussion about much the same subject.\u003C/p\u003E\n"}]}