{"TopicId":80298,"ForumId":55,"TopicTitle":"Mouse-over delta-V and TWR information in the VAB","CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-07-31T19:34:31Z","PageNum":1,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-07-31T19:34:31Z","Content":"\n\u003Cp\u003EI read recently that the devteam wants to implement something similar to Kerbal Engineer Redux into the stock game, wherein you can see how much TWR and delta-V your rocket has, but they had a small problem in that they want it to be as non-intrusive as possible. Hence my suggestion: just make it a mouse-over of information when you move the cursor over a given stage.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.skyrender.net/lp2/ksp/mouseover_dv_twr.jpg\u0022 alt=\u0022mouseover_dv_twr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E The added icon there is to change which body you\u0027re checking data for (since TWR varies depending on gravity and all). It\u0027s just a rough concept, but I think it would fit pretty well with the idea of both giving the player the information and keeping the whole thing fairly uncomplicated to look at and work with.\u003C/p\u003E\n"},{"CreatedByName":"sardaukar11","CreatedById":78648,"CreatedDateTime":"2014-07-31T19:50:59Z","Content":"\n\u003Cp\u003Emaybe a new button next to the ones of crew/parts/assemblies?\u003C/p\u003E\u003Cp\u003Eit colud display in the left side of the screen some ship information like in KER\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-07-31T20:18:34Z","Content":"\n\u003Cp\u003EI like your mouse over idea, combined with a total at the top\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-07-31T21:20:19Z","Content":"\n\u003Cp\u003EWhy not like Mechjeb, with a small button on the side (or next to the 3 other buttons. Build, action groups, crew) that reveals a menu with several buttons that open inforgraphs.\u003C/p\u003E\u003Cp\u003EYou wouldn\u0027t even notice it if you don\u0027t use it\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2014-07-31T21:27:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerikBalm\u0022 data-cite=\u0022KerikBalm\u0022\u003E\u003Cdiv\u003EI like your mouse over idea, combined with a total at the top\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I\u0027d rather have (instead of, or in addition to), a cumulative delta-v total on the tooltip to make it easier to say \u0022I should have X delta-v left at this stage once I\u0027ve circularized after launch.\u0022 Not critical, I\u0027m not afraid of addition, but just convenience.\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-08-01T12:59:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EI think I\u0027d rather have (instead of, or in addition to), a cumulative delta-v total on the tooltip to make it easier to say \u0022I should have X delta-v left at this stage once I\u0027ve circularized after launch.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds great. I\u0027d really like to see that in game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-01T13:12:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EI read recently that the devteam wants to implement something similar to Kerbal Engineer Redux into the stock game\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELink? Or is it Maxmaps\u0027 \u003Ca href=\u0022http://www.reddit.com/r/Games/comments/2byga4/im_the_producer_of_kerbal_space_program_ama_about/cja72er\u0022 rel=\u0022external nofollow\u0022\u003Ecomment in the AMA\u003C/a\u003E, which read to me like maybe possibly they might do it at some indeterminate point in the future?\u003C/p\u003E\u003Cp\u003EI would love for such functionality to be implemented in stock, all the reasons for not including a dV calculator evaporated for me when maneuver nodes giving costs in m/s were added.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-08-01T13:50:29Z","Content":"\n\u003Cp\u003EKerbal Engineer v1 does this. Why do they need to make it stock at all?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-01T13:58:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003EKerbal Engineer v1 does this. Why do they need to make it stock at all?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re right, anything that can be done with a mod should never be incorporated into stock. It was a mistake to incorporate C7 Aerospace, or subassembly manager, or to implement contracts and money, or to work on multiplayer.\u003C/p\u003E\u003Cp\u003EIt should be brought into stock because it is core functionality. A rocketry game that doesn\u0027t calculate delta-V is as incomplete as a shooter with no ammo counter or a racing game with no gauges, IMO.\u003C/p\u003E\n"},{"CreatedByName":"M3tal_Warrior","CreatedById":116603,"CreatedDateTime":"2014-08-01T14:48:36Z","Content":"\n\u003Cp\u003ETo be honest: I don\u0027t calculate at all - I estimate. Works out fine for me, having had quite a lot of failed launches and thus quite some experience (and a set of boxed main stages where I know the max. payload). But you\u0027re right - a rocket building game without calculations is lacking a core functionality; a launch simulation with rough estimates of left fuel in orbit, stage separation altitudes, altitude speeds, g-force applied etc. would be nice too (and could be presented by a hectic kerbal engineer on a flip chart or so). \u003C/p\u003E\u003Cp\u003EAs for the \u0027there\u0027s a mod, no need for implementation\u0027 discussion: You\u0027re missing the point. This is not a final release of the game but a working alpha. Things ARE to be implemented, that\u0027s the whole point of not yet being released.\u003C/p\u003E\n"},{"CreatedByName":"Kerolyov","CreatedById":62002,"CreatedDateTime":"2014-08-01T19:31:40Z","Content":"\n\u003Cp\u003EI think this is a great solution as avoids the user having big windows of data open all the time. So is a very unobstrusive way of adding much needed information to the VAB. Only slight issue is whether dV is vacuum or atmospheric and what body the TWR is relative to, not sure where would be best to put these options other than either a VAB button or on the toolbar.\u003C/p\u003E\n"}]}