{"TopicId":80336,"ForumId":55,"TopicTitle":"Refund funds for crafts that aren\u0027t loaded","CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-07-31T23:52:47Z","PageNum":1,"Articles":[{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-07-31T23:52:47Z","Content":"\n\u003Cp\u003ESo I removed a mod, then loaded up KSP and my space-station core was unloaded. I put the mod back and went on the launchpad only to find out that the craft still wasn\u0027t loaded.\u003C/p\u003E\u003Cp\u003EAnd I spent a lot of funds on that that weren\u0027t reload -.-\u003C/p\u003E\n"},{"CreatedByName":"tygoo7","CreatedById":57345,"CreatedDateTime":"2014-08-01T00:53:50Z","Content":"\n\u003Cp\u003EBackups are your friend. I\u0027m not really sure if it\u0027s possible to get funds from a craft since the parts don\u0027t exist and the game can\u0027t return a craft that doesn\u0027t exist due to parts removed. That\u0027s just my guess though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-08-01T03:59:56Z","Content":"\n\u003Cp\u003EI had this happen today. Luckily I had copied a backup of my persistence file before it happened. Always always \u003Cem\u003Ealways \u003C/em\u003Eback-up your persistence files before removing mods. The vessels that aren\u0027t loaded appear to be removed from the persistence file, so they\u0027re gone gone gone.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-08-01T04:43:20Z","Content":"\n\u003Cp\u003EI don\u0027t think the game \u003Cem\u003Ecan\u003C/em\u003E give you a complete refund -- the mod part is missing, there is then no data on how much that part cost in the first place. It could give you refunds on all the other parts, though.\u003C/p\u003E\u003Cp\u003EThe game does need better handling of missing parts, though, even if it\u0027s just a prevention of you flying the craft until the mod is back in -- the craft itself could remain indefinitely, for you to terminate, if you so wished. I\u0027m thinking that saved craft with mod parts could be handled by implementing a \u0022dummy\u0022 part that is used in editors in place of the mod part, something easily recognisable, so you could replace it with something else, if you wished.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-08-01T09:35:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003Ethe craft itself could remain indefinitely, for you to terminate, if you so wished.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs long as the vessel is on rails, size and weight of the part don\u0027t matter. Sounds easy enough. Not being able to fly it, too.\u003C/p\u003E\u003Cp\u003EBut what happens if the player gets close enough to bring it into physics range? I can\u0027t think of a solution that would be acceptable.\u003C/p\u003E\n"}]}