{"TopicId":82055,"ForumId":55,"TopicTitle":"Another \u0022Warning Dialogue\u0022 In VAB/SPH","CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2014-08-18T16:14:29Z","PageNum":1,"Articles":[{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2014-08-18T16:14:29Z","Content":"\n\u003Cp\u003EFirst off, apologies if this has been posted already. If this is the case, mods feel free to lock/merge this thread.\u003C/p\u003E\u003Cp\u003EI was building in the VAB last night and went to save my craft that I had spent the better part of an hour working on when I, for some dumb reason, accidentally clicked the \u0022new craft\u0022 button instead of the \u0022save craft\u0022 button. Yes, I know they\u0027re in different locations and are different colors, but it still happened. To make matters worse, I had not yet test-launched it so there was no \u0022Auto-Saved Craft\u0022 to fall back on. As this was the first time I had ever done something like this since picking KSP up way back in .12 (I think that was the version...?), I was pretty surprised to find there\u0027s no safety to that button.\u003C/p\u003E\u003Cp\u003EMy suggestion here is another warning dialogue box along the lines of \u0022Are you sure you want to do that? The current craft has not yet been saved.\u0022 or something similar...if that\u0027s even possible...\u003C/p\u003E\u003Cp\u003EI know, I know. An error between the chair and keyboard was the real issue in this particular case, but as it stands, the \u0022New Craft\u0022 button deletes whatever\u0027s in the VAB and gives you a black slate without any kind of fail-safe in place. You click that button, you get no take backs.\u003C/p\u003E\u003Cp\u003EI have not \u0022tested\u0022 the SPH to see if the issue is there too, but I\u0027m assuming it is as the two building are very similar.\u003C/p\u003E\n"},{"CreatedByName":"Justin Kerbice","CreatedById":101695,"CreatedDateTime":"2014-08-18T16:37:59Z","Content":"\n\u003Cp\u003EAgree, buttons are not very friendly as they are and some confirmation would not be a luxury. I usually click on launch instead of save \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E.\u003C/p\u003E\u003Cp\u003EBy the way, visual feedback may be added too because we can\u0027t even be sure action have been successfully completed on save and also an overwrite confirmation as nothing prevent us to overwrite an already existing craft AFAIK.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-18T18:04:24Z","Content":"\n\u003Cp\u003EClicking launch instead of save isn\u0027t so bad as at least your .craft will auto save. Exit and New are the real culprits, and load doesn\u0027t warn you either if you haven\u0027t saved. This is pretty basic idiot-proofing* that\u0027s been in most software for decades, I would hope we\u0027ll get it in KSP sometime.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*I say that acknowledging that I am sometimes the idiot that needs proofing.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-08-18T18:09:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Greenfire32\u0022 data-cite=\u0022Greenfire32\u0022\u003E\u003Cdiv\u003Eif that\u0027s even possible...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s an undo chain already, it\u0027s entirely possible. Quite frankly I would find this annoying, like I do so many other confirm dialogues, but there\u0027s no real reason beyond that not to have it.\u003C/p\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2014-08-18T18:21:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EThere\u0027s an undo chain already, it\u0027s entirely possible. Quite frankly I would find this annoying, like I do so many other confirm dialogues, but there\u0027s no real reason beyond that not to have it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt would be just as intrusive as the \u0022There is debris on the Launchpad. Clear debris and Launch?\u0022 dialogue.\u003C/p\u003E\u003Cp\u003ESo not very intrusive at all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2014-08-18T18:57:32Z","Content":"\n\u003Cp\u003EIt is almost always simpler to fix software glitches than it is to fix wetware glitches. I feel that the proposed fix is adequate and acceptable.\u003C/p\u003E\n"}]}