{"TopicId":82236,"ForumId":55,"TopicTitle":"Sabre Engines for SSTO","CreatedByName":"Waster","CreatedById":166374,"CreatedDateTime":"2014-08-20T19:35:37Z","PageNum":1,"Articles":[{"CreatedByName":"Waster","CreatedById":166374,"CreatedDateTime":"2014-08-20T19:35:37Z","Content":"\n\u003Cp\u003ENow that development has reached a project milestone it may be time to consider adding SABRE engines (including design) into Kerbal. Almost like a real life Rapier.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.space.com/26838-air-force-hypersonic-skylon-space-plane.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.space.com/26838-air-force-hypersonic-skylon-space-plane.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWaster\u003C/p\u003E\n"},{"CreatedByName":"treejoe4","CreatedById":113762,"CreatedDateTime":"2014-08-20T19:46:24Z","Content":"\n\u003Cp\u003EThe Rapier Engine is the Sabre engine, if you still don\u0027t believe me, notice how both engine names are also sword names. Man have some coffee before posting!\u003C/p\u003E\n"},{"CreatedByName":"Waster","CreatedById":166374,"CreatedDateTime":"2014-08-20T20:15:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022treejoe4\u0022 data-cite=\u0022treejoe4\u0022\u003E\u003Cdiv\u003EThe Rapier Engine is the Sabre engine, if you still don\u0027t believe me, notice how both engine names are also sword names. Man have some coffee before posting!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1, I don\u0027t drink coffee. 2, if you read the post I said (INCLUDING DESIGN). The Rapier looks nothing like the Sabre.\u003C/p\u003E\u003Cp\u003EDon\u0027t be a troll.\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2014-08-20T20:25:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Waster\u0022 data-cite=\u0022Waster\u0022\u003E\u003Cdiv\u003E1, I don\u0027t drink coffee. 2, if you read the post I said (INCLUDING DESIGN). The Rapier looks nothing like the Sabre.\u003Cp\u003EDon\u0027t be a troll.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s what a SABRE looks like:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://hight3ch.com/wp-content/uploads/2013/10/sabre-engine.jpg\u0022 alt=\u0022sabre-engine.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s what the RAPIER looks like:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.ytimg.com/vi/GyZ08jw2saQ/maxresdefault.jpg\u0022 alt=\u0022maxresdefault.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EKSP doesn\u0027t model turbines in jet engines. All you can have of the SABRE is there already. Do your research.\u003C/p\u003E\n"},{"CreatedByName":"treejoe4","CreatedById":113762,"CreatedDateTime":"2014-08-20T20:58:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Waster\u0022 data-cite=\u0022Waster\u0022\u003E\u003Cdiv\u003E1, I don\u0027t drink coffee. 2, if you read the post I said (INCLUDING DESIGN). The Rapier looks nothing like the Sabre.\u003Cp\u003EDon\u0027t be a troll.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe vast majority of KSP stock parts are not indentical to actual real life parts.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-20T21:45:07Z","Content":"\n\u003Cp\u003ERapier is definitely the KSP analog to the Sabre, the quad nozzles and mixed mode capabilities are a dead giveaway.\u003C/p\u003E\n"},{"CreatedByName":"pa1983","CreatedById":58328,"CreatedDateTime":"2014-08-20T23:38:46Z","Content":"\n\u003Cp\u003EOnly thing that we realy need is intercoolers and proper intakes for them. ATM any jet engine can go at any speed pretty much with out overheating. Real world jet engines will overheat due to friction at high speeds causing the intake air to overheat the engine. After all even a jet engine can only run so hot and needs relatively cool intake air to cool some of its sensitive working parts like bearings, turbine blades etc. Plus the hotter the intake air the less fuel can be burned to produce trust since the amount of fuel dictates turbine temperature. Jet engines are primarily temperature limited.\u003C/p\u003E\u003Cp\u003ESo any way an intercooler is needed and a proper intake for the rapier engines.\u003C/p\u003E\u003Cp\u003ENow I my self use jets extensively for SSTO\u0027s and they make it possible to go anywhere in an SSTO in the solar system and back with payload and no refueling BUT its a bit unrealistic for the final game to have jet engines going that fast relatively speaking. So for game balancing Intercoolers and special intakes would be nice.\u003C/p\u003E\u003Cp\u003ENow intecoolers could be used with JET engines to. The SABER engine has been proposed as a aircraft engine mode only version that still could do Mach 5 but do not have the rocket mode.\u003C/p\u003E\u003Cp\u003ESo I think for best balancing we need intercoolers, they are the heaviest part so they should be heavier then the engine they also require a proper intake for most efficient use. Esthetics\u0027s and drag reduction.\u003C/p\u003E\u003Cp\u003EThey could still be used with both JETS and RAPIER but with out an intercooler per engine the max speed should be mach 3-4 before overheating at 100% throttle and with intercooler mach 5-6 should be doable before overheating.\u003C/p\u003E\u003Cp\u003ESQUAD would need to add the intercooler part at a minimum and all jet engines an rapiers would need a max speed with and without intercooler that also factors in fuel use in to the equation to determent the engine temperature and thereby when the engine would fail and go in to a broken mode.\u003C/p\u003E\n"}]}