{"TopicId":83186,"ForumId":55,"TopicTitle":"Toggleable Lift on Wing Parts","CreatedByName":"KerrMü","CreatedById":78387,"CreatedDateTime":"2014-08-28T18:19:56Z","PageNum":1,"Articles":[{"CreatedByName":"KerrMü","CreatedById":78387,"CreatedDateTime":"2014-08-28T18:19:56Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EHello Rocketeers and Rockets\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith the spaceplane section of the game getting some love now, it might be a good time to bring this up.\u003C/p\u003E\u003Cp\u003ELet me get straight to the point:\u003C/p\u003E\u003Cp\u003EIn KSP every wing part produces lift... and thatÃ‚Â´s a bit problematic sometimes.\u003C/p\u003E\u003Cp\u003EOn many RL planes the stabilisators/tailfins donÃ‚Â´t provide much/any lift. They just keep the aircraft in ballance. Like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XdeTikg.png\u0022 alt=\u0022XdeTikg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo the CoL is located between the main wings and not pushed back by the tail.\u003C/p\u003E\u003Cp\u003ETo demonstrate this issue in the game, I built a plane we all know and love \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9CWoSZJ.png\u0022 alt=\u00229CWoSZJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMy suggestion would be, to make the lift, which each wing part produces, toggleable or even tweakable. Basically just turning the lift off via dropdown menu would be fine. Or rather a slider?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAdvantages:\u003C/p\u003E\u003Cp\u003E- Easier plane building. Just build the body, find the CoM, put some wings a bit behind it, there you go.\u003C/p\u003E\u003Cp\u003E- Relocating the COL would become less difficult.\u003C/p\u003E\u003Cp\u003E- With the current system, if you angle your wings to a positive angle of incidence, but not your tailfins, then the center of lift is pushed further to the front, the faster you fly. Nearer to the CoM. Possibly resulting in unstable flight characteristics. WouldnÃ‚Â´t be the case with only the main wings providing lift. ( I know itÃ‚Â´s a bit more complicated like that )\u003C/p\u003E\u003Cp\u003E- The ability to use wings as structural elements without messing everything up. You could build whole fuselages out of wings. \u003C/p\u003E\u003Cp\u003E- aircraft would behave more intentional. \u003C/p\u003E\u003Cp\u003EKSP can be a brilliant tool for understanding how planes work, and why they look like they do. You can build reasonably acurate replicas in KSP, with the correct distribution of wight, the right kind of propulsion (partly with mods), but you almost always have to cheat some controlsurfaces into the nose to get the right behavior.\u003C/p\u003E\u003Cp\u003EPersonally I got into planes through kind-of-replicas, because my first own designs have been utterly, utterly bad. Then I thought, what works in real life should be good in the game, right? And yeah, it worked... kind of. But most of the time the designs were a bit nose-heavy.\u003C/p\u003E\u003Cp\u003ENow that I know the reason for that, I wanted to make my first suggestion ever in this forum.\u003C/p\u003E\u003Cp\u003EIf you made it this far, thank you very much for reading. Please leave your opinion and thoughts. \u003C/p\u003E\u003Cp\u003EAnd if you have a clue about programming (which I have not), tell me if this would be possible at all.\u003C/p\u003E\u003Cp\u003Ecu in space, MÃƒÂ¼\u003C/p\u003E\n"},{"CreatedByName":"Andrew Hansen","CreatedById":82311,"CreatedDateTime":"2014-08-28T18:29:43Z","Content":"\n\u003Cp\u003EI don\u0027t think this would be a good idea, since it would make things less realistic. In real life, if something has an aerodynamic shape like a wing, it will produce lift with positive angles of attack. Allowing you to essentially disable physics for certain parts is not something that KSP needs in my opinion. In fact, I think it needs \u003Cem\u003Emore\u003C/em\u003E lift simulation from parts that currently don\u0027t have it - the structural parts. Adding NEAR to the stock game would be an excellent decision and would make for much more fun and interesting airplane creation.\u003C/p\u003E\n"},{"CreatedByName":"Starwaster","CreatedById":71262,"CreatedDateTime":"2014-08-28T18:41:12Z","Content":"\n\u003Cp\u003EWhere is Ferram when you need him....\u003C/p\u003E\u003Cp\u003ELet\u0027s see if I can invoke him.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EFERRAM I CHOOSE YOU!\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"pellinor","CreatedById":85299,"CreatedDateTime":"2014-08-28T18:45:08Z","Content":"\n\u003Cp\u003EActually you want your part to produce lift (= force when at an angle of attack), in order to act as a stabilizer. Removing the lift is like removing the tail fin, or putting a fuel tank of equal weight in its place. \u003C/p\u003E\u003Cp\u003EFor the mechanic you describe, have you tried to angle the tail fin down slightly? This makes sure its angle of attack is always lower than that of the main wing. So you have fewer Lift when going horizontal (CoL in SPH), but still a correcting force when at a high angle of attack (so it still acts as a stabilizer). \u003C/p\u003E\u003Cp\u003EFor my planes this even makes the plane pitch-stable (so hands-off it always pulls to a certain pitch angle that depends on airspeed). Angling down by 5Ã‚Â° works for me, probably less would be better. You\u0027ll also see your CoL move forward in the SPH.\u003C/p\u003E\u003Cp\u003EPS: I don\u0027t see what this has to do with ferram, other than general bashing of stock aerodynamics. Even a flat piece of cardboard produces lift when at an angle of attack.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-28T18:54:51Z\u0022 title=\u002208/28/2014 06:54  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 28, 2014\u003C/time\u003E by pellinor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ferram4","CreatedById":21328,"CreatedDateTime":"2014-08-28T19:21:26Z","Content":"\n\u003Cp\u003EAhem: wings do not work that way. Tail planes do provide an amazing amount of lift, often similar (when scaled for area) as the maing wing \u003Cem\u003Eat the same angle of attack\u003C/em\u003E. What you\u0027re arguing for is that they shouldn\u0027t make any lift regardless of angle of attack; you\u0027re basically asking for a hologram of a wing that doesn\u0027t actually do anything.\u003C/p\u003E\u003Cp\u003EBesides the fact that it\u0027s completely unrealistic, it\u0027s completely unintuitive: why should the player be able to change the laws of physics at their whim? This is hack gravity / infinite fuel level changing of physics, but it doesn\u0027t even have the decency to be consistent across all parts!\u003C/p\u003E\u003Cp\u003EEven the stock aerodynamics are correct in that the tail does shift the CoL back. \u003Cem\u003EThat\u0027s why we add the horizontal tail, to move the CoL back and make the plane more stable.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EEven if it didn\u0027t betray a complete misunderstanding of how tails work (they shift the CoL back and make the plane more stable; that\u0027s their job), this would be a terrible suggestion by giving the player god powers as a standard thing \u003Cem\u003Eand\u003C/em\u003E allowing inconsistencies in physical laws for no apparent reason.\u003C/p\u003E\n"},{"CreatedByName":"OrbitusII","CreatedById":57305,"CreatedDateTime":"2014-08-28T21:04:32Z","Content":"\n\u003Cp\u003EI can see how this would be useful, but I can also see how it would be really dangerous. Balancing aircraft is an incredibly tricky business. Take, for example, my passenger jet:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Xxxn9Jq.png\u0022 alt=\u0022Xxxn9Jq.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAll\u003C/strong\u003E of the engines are on the underside of the main wings. Without the tailplanes providing as much lift as they do, it would be unflyable. Even something as simple as \u003Ca href=\u0022http://i.imgur.com/ohpJbWM.png\u0022 rel=\u0022external nofollow\u0022\u003Egiving the plane a 747-style hump\u003C/a\u003E messed up the CoM-CoL-CoT relationship pretty severely, which for a plane as complex as this one makes it impractical to use without pretty significant redesigns. Having tailplanes with less lift could be a good solution to KerrMu\u0027s problem, so it might be nice to get more wings parts rather than tweakable wings.\u003C/p\u003E\u003Cp\u003EAs Ferram4 said, changing physics is not a sensible solution. Oh yes, it would certainly be useful, but it wouldn\u0027t make a lot of sense to be able to change the flight characteristics of crafts on a whim.\u003C/p\u003E\n"},{"CreatedByName":"allmappedout","CreatedById":57281,"CreatedDateTime":"2014-08-29T10:42:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starwaster\u0022 data-cite=\u0022Starwaster\u0022\u003E\u003Cdiv\u003EWhere is Ferram when you need him....\u003Cp\u003ELet\u0027s see if I can invoke him.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EFERRAM I CHOOSE YOU!\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/em\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHoly smokes, you\u0027re a forum god! You actually summoned him!\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-08-29T16:17:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ferram4\u0022 data-cite=\u0022ferram4\u0022\u003E\u003Cdiv\u003EAhem: wings do not work that way. Tail planes do provide an amazing amount of lift, often similar (when scaled for area) as the maing wing \u003Cem\u003Eat the same angle of attack\u003C/em\u003E. What you\u0027re arguing for is that they shouldn\u0027t make any lift regardless of angle of attack; you\u0027re basically asking for a hologram of a wing that doesn\u0027t actually do anything.\u003Cp\u003EBesides the fact that it\u0027s completely unrealistic, it\u0027s completely unintuitive: why should the player be able to change the laws of physics at their whim? This is hack gravity / infinite fuel level changing of physics, but it doesn\u0027t even have the decency to be consistent across all parts!\u003C/p\u003E\u003Cp\u003EEven the stock aerodynamics are correct in that the tail does shift the CoL back. \u003Cem\u003EThat\u0027s why we add the horizontal tail, to move the CoL back and make the plane more stable.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EEven if it didn\u0027t betray a complete misunderstanding of how tails work (they shift the CoL back and make the plane more stable; that\u0027s their job), this would be a terrible suggestion by giving the player god powers as a standard thing \u003Cem\u003Eand\u003C/em\u003E allowing inconsistencies in physical laws for no apparent reason.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMr. Ferram,\u003C/p\u003E\u003Cp\u003EI think what OP meant to say is that the stabilizers do not produce lift (and negligible drag) at 0 AoA i.e. the cross section of the wing is symmetric in the horizontal plane (and thin). However, what OP failed to understand is that any wing/flat plate will produce lift (and drag) for non-zero AoA, which in turn, causes the corrective/stabilizing torque if the CoM is in front of the CoL. Thus, the CoL calculations must still include a horizontal flat plate since for non-zero AoA it will come into the equation.\u003C/p\u003E\u003Cp\u003EAmIRight?\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-08-30T22:51:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Andrew Hansen\u0022 data-cite=\u0022Andrew Hansen\u0022\u003E\u003Cdiv\u003EI don\u0027t think this would be a good idea, since it would make things less realistic. In real life, if something has an aerodynamic shape like a wing, it will produce lift with positive angles of attack. Allowing you to essentially disable physics for certain parts is not something that KSP needs in my opinion. In fact, I think it needs \u003Cem\u003Emore\u003C/em\u003E lift simulation from parts that currently don\u0027t have it - the structural parts. Adding NEAR to the stock game would be an excellent decision and would make for much more fun and interesting airplane creation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree completely. Turning off wing lift would be \u003Cem\u003Estupid\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-08-30T22:56:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerrMÃƒÂ¼\u0022 data-cite=\u0022KerrMÃƒÂ¼\u0022\u003E\u003Cdiv\u003Ecu in space, MÃƒÂ¼\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI insist you not call yourself MÃƒÂ¼, as Mu (Pronounced the same way!) is the name of a developer of KSP. KerrMÃƒÂ¼ is pushing it, but acceptable.\u003C/p\u003E\n"},{"CreatedByName":"AlexanderB","CreatedById":17544,"CreatedDateTime":"2014-08-31T01:28:19Z","Content":"\n\u003Cp\u003E...have you tried turning the angle of attack of the tail plane? has a pretty profound effect on the center of lift..\u003C/p\u003E\n"},{"CreatedByName":"r4pt0r","CreatedById":90471,"CreatedDateTime":"2014-08-31T03:35:55Z","Content":"\n\u003Cp\u003EI think op just wants wing colored structural panels?\u003C/p\u003E\n"},{"CreatedByName":"J.Random","CreatedById":63332,"CreatedDateTime":"2014-08-31T10:54:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerrMÃƒÂ¼\u0022 data-cite=\u0022KerrMÃƒÂ¼\u0022\u003E\u003Cdiv\u003EOn many RL planes the stabilisators/tailfins donÃ‚Â´t provide much/any lift. They just keep the aircraft in ballance.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EErm... They keep aircraft in balance by providing a lift. When you have positive AoA, tailfin provides lift, forcing tail to go up and the whole aircraft to pitch down. When you have negative AoA, tailfin provides downforce, forcing tail to go down and the whole aircraft to pitch up. I don\u0027t think KSP simulates that because you have a single center of lift, but I think tailfins provide drag, which gives similar effect, forcing aircraft to stick to velocity vector.\u003C/p\u003E\n"}]}