{"TopicId":85491,"ForumId":55,"TopicTitle":"0.26 Big Feature Idea - Upgradeable buildings","CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2014-09-27T00:35:28Z","PageNum":1,"Articles":[{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2014-09-27T00:35:28Z","Content":"\n\u003Cp\u003EImagine the need for art cause of this\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-27T00:40:16Z\u0022 title=\u002209/27/2014 12:40  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 27, 2014\u003C/time\u003E by TheCanadianVendingMachine\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyHook","CreatedById":31496,"CreatedDateTime":"2014-09-27T00:37:02Z","Content":"\n\u003Cp\u003EWell you go to it before me...this would be an amazing idea!\u003C/p\u003E\n"},{"CreatedByName":"Sky_walker","CreatedById":113214,"CreatedDateTime":"2014-09-27T00:38:14Z","Content":"\n\u003Cp\u003EAye. That would be nice.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-09-27T00:38:31Z","Content":"\n\u003Cp\u003EI think it\u0027s cities.\u003C/p\u003E\n"},{"CreatedByName":"Lhathron the Elf","CreatedById":118706,"CreatedDateTime":"2014-09-27T00:39:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EI think it\u0027s cities.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EProbably. Just small ones right now, most likely though. \u003C/p\u003E\u003Cp\u003EAlso, I wonder if the island landing strip can now be repaired and used like the KSC?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-09-27T00:40:04Z","Content":"\n\u003Cp\u003EThis suggestion for the game\u0027s development has been moved to Suggestions \u0026amp; Development.\u003C/p\u003E\n"},{"CreatedByName":"Andrew Hansen","CreatedById":82311,"CreatedDateTime":"2014-09-27T01:28:29Z","Content":"\n\u003Cp\u003EI\u0027m pretty convinced this is what 0.26 is about. It makes perfect sense with destructible buildings.\u003C/p\u003E\n"},{"CreatedByName":"artwhaley","CreatedById":118388,"CreatedDateTime":"2014-09-27T02:09:42Z","Content":"\n\u003Cp\u003EI\u0027m hoping it\u0027s a lead-in to more realistic damage models for everything? Maybe ship parts could have more statuses besides \u0027hunky-dory\u0027 and \u0027exploded to death?\u0027\u003C/p\u003E\u003Cp\u003EOr, in general, it could be a move towards replaceable models becoming a stock feature - in the same way that a couple of plugins have added this ability? Replacing a standing building with a blown-up one is just one application of the ability to swap a model out mid-game, after all.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2014-09-27T03:02:34Z","Content":"\n\u003Cp\u003EThat\u0027s probably what\u0027s going to happen. \u003C/p\u003E\u003Cp\u003EAnother possibility would be buildings that are \u0022buildable\u0022 on other planets/moons, kinda like the Extraplanetary Launchpads mod.\u003C/p\u003E\n"},{"CreatedByName":"Alewx","CreatedById":102791,"CreatedDateTime":"2014-09-27T08:49:33Z","Content":"\n\u003Cp\u003EWell upgradeable buildings would be nice but what should be the effect of it?\u003C/p\u003E\u003Cp\u003E- reduced costs?\u003C/p\u003E\u003Cp\u003E- more science?\u003C/p\u003E\u003Cp\u003E- just bigger buildings?\u003C/p\u003E\u003Cp\u003EAnd again it would be just something for the carrer players, sandbox would just get a new message \u0022not available in sandbox\u0022, and that is not really cool.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-09-29T18:13:50Z","Content":"\n\u003Cp\u003EObviously it\u0060s leading to a career mode that starts with a single kerbal (maybe called jeb) in a small wooden shed firing Seperatrons into the air (it\u0060s all there is in the parts list) and you have to build an entire space program from that...\u003C/p\u003E\u003Cp\u003EPart of upgrading buildings is making a need to upgrade. There could be a weight limit for the launchpad so it does not matter how much cash you have, you can only launch a craft that weighs so much until you upgrade your launchpad. Maybe that will be something to spend Rep as well as Cash on. VAB upgrades could increase rocket height, better contracts with upgrading the contracts building, more experienced crew if you upgrade your astronaut complex (stats would have to have an effect to make that worth it though) or maybe increase the limit on crew numbers, maybe spaceplane length limits could increase if you upgrade your SPH.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-29T21:15:16Z\u0022 title=\u002209/29/2014 09:15  PM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 29, 2014\u003C/time\u003E by John FX\u003C/strong\u003E\n\u003Cbr\u003Eclarity and speeling\n\u003C/span\u003E\n"},{"CreatedByName":"Unabled","CreatedById":75171,"CreatedDateTime":"2014-09-29T22:16:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022John FX\u0022 data-cite=\u0022John FX\u0022\u003E\u003Cdiv\u003EObviously it\u0060s leading to a career mode that starts with a single kerbal (maybe called jeb) in a small wooden shed firing Seperatrons into the air (it\u0060s all there is in the parts list) and you have to build an entire space program from that...\u003Cp\u003EPart of upgrading buildings is making a need to upgrade. There could be a weight limit for the launchpad so it does not matter how much cash you have, you can only launch a craft that weighs so much until you upgrade your launchpad. Maybe that will be something to spend Rep as well as Cash on. VAB upgrades could increase rocket height, better contracts with upgrading that building, more experienced crew if you upgrade your astronaut complex (stats would have to have an effect to make that worth it though) or maybe increase the limit on crew numbers, maybe length limits could increase if you upgrade your SPH.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m thinking this is where 0.26 is leading, actually building your own space program from the ground up. Start with a shack and from there deciding what you want to build/improve next. Comms, the Crew building/facilities, improved runway, etc. Though I am having a hard time picturing reasons for upgrading these things because as John said, you need some sort of limits on the more primitive buildings so there is a reason to upgrade them.\u003C/p\u003E\u003Cp\u003EOne thought I had was linking upgraded buildings to unlocking parts. You could go a couple of ways with this...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDo it like an RTS does: where you need to build/upgrade buildings to even begin researching certain technologies themed with the building\u0027s function, but I don\u0027t know if I like the sound of that as much for KSP.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHave the upgraded buildings unlock new parts directly related to the building itself.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBoth of these options would include eliminating the tech tree--\u003C/p\u003E\u003Cdiv style=\u0022margin-left:3px;\u0022\u003E-Using science to unlock parts doesn\u0027t always make a whole lot of sense, and the tech tree really doesn\u0027t let one really pursue the route (or parts) they want in their career. \u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022margin-left:3px;\u0022\u003EWant probes? That is a few nodes down the tree.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022margin-left:3px;\u0022\u003EWant more science parts? Well, you have to go down this other branch of the tree unlocking stuff you might not want to reach them.\u003C/div\u003E\u003Cp\u003EWith this you could have a kind of graphical tech tree where you pick exactly what route you would like to go...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-Want to discover and pursue flight before rockets?\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022margin-left:2px;\u0022\u003E Build a plane hangar and then upgrade it to go down that path.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-Want to unlock probes to test launch your rockets instead of starting off \u003C/div\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u003C/span\u003E\u003Cdiv\u003Esacrificing\u003C/div\u003E\u003Cdiv\u003E testing with Kerbals? \u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022margin-left:2px;\u0022\u003EBuild the communications array, and later upgrade that allowing for more advanced probe bodies.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-Want Launch stabiliziers?\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022margin-left:2px;\u0022\u003EUpgrade your launch pad.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E-How about those larger rocket parts and engines?\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022margin-left:2px;\u0022\u003EFocus on upgrading the VAB.\u003C/div\u003E\u003Cp\u003Eetc...\u003C/p\u003E\u003Cp\u003EJust sharing the thought I had on this.\u003C/p\u003E\n"}]}