{"TopicId":86092,"ForumId":55,"TopicTitle":"More whimsy and cartoon humor","CreatedByName":"Yakky","CreatedById":94432,"CreatedDateTime":"2014-10-04T20:22:55Z","PageNum":1,"Articles":[{"CreatedByName":"Yakky","CreatedById":94432,"CreatedDateTime":"2014-10-04T20:22:55Z","Content":"\n\u003Cp\u003EKSP is a great simulation game, but in my mind one of the subtle, and perhaps increasingly overlooked, aspects of what has made the game fun to play has always been its slightly silly cartoonish aesthetic. Things like the post-it notes in the cockpit talking about snacks, the \u0022do not open in flight\u0022 levers, the \u0022stupidity\u0022 rating for Kerbals, and of course the waddling little green guys themselves who sometimes do twirls when they jump. At least for me, these subtle design cues remind me not to take the game too seriously, and encourage me to try boldly stupid ideas I\u0027d be loathe to undertake in a more serious game.\u003C/p\u003E\u003Cp\u003EI\u0027d love to see even more of this whimsical humor varnish applied to the game\u0027s art, in ways that don\u0027t detract from actual gameplay or physics. To wit I have a couple suggestions and would invite others to contribute more:\u003C/p\u003E\u003Cp\u003E-- When buildings are destroyed and rebuilt, the repaired buildings\u0027 visual appearance could be slightly off-kilter from the originals. For example, they could feature copious amounts of duct tape, baling wire, staples, wood planks, and maybe even band-aids, or be not quite perfectly level and square anymore. More of this would show up after each destruction and reconstruction.\u003C/p\u003E\u003Cp\u003E-- Kerbals with extremely high stupidity ratings should look and act a little... off. Maybe their pupils point in different directions, or their mouth hangs agape, or they trip more often when they walk, or they sometimes forget their space suits and show up for work in their pajamas. At the other extreme, very low stupidity Kerbals could have nerdy glasses and maybe a pocket-protector on their spacesuit.\u003C/p\u003E\u003Cp\u003E-- Similarly, the courage rating could manifest itself a bit more in the physical experience. Maybe high courage Kerbals are a little more square-jawed and muscular while low-courage Kerbals are slightly scrawny and wimpy-looking.\u003C/p\u003E\u003Cp\u003E-- Kerbals with the BadS flag should clearly have some badass tattoos, piercings, etc, or maybe wear some black spikey motorcycle leathers.\u003C/p\u003E\u003Cp\u003E-- The new Mk. 2 cockpit seems to lack humourous post-it notes, levers, and other fun whimsy. Maybe it needs some snacks on the dashboard or other stuff?\u003C/p\u003E\u003Cp\u003E-- I\u0027ve always thought a Kerbal should die with a little green splat (and appropriately splatty noise) rather than a puff of smoke.\u003C/p\u003E\u003Cp\u003E-- Might not be worth the design effort, but it would be great to have the \u0022Do not open in flight\u0022 levers actually be openable, with consequent ejection of the crew or destruction of the part.\u003C/p\u003E\u003Cp\u003EJust a few ideas to get this thread started.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-04T20:26:25Z\u0022 title=\u002210/04/2014 08:26  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 4, 2014\u003C/time\u003E by Yakky\u003C/strong\u003E\n\u003C/span\u003E\n"}]}