{"TopicId":86590,"ForumId":55,"TopicTitle":"more alternative game modes please","CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2014-10-09T02:59:23Z","PageNum":1,"Articles":[{"CreatedByName":"endl","CreatedById":119320,"CreatedDateTime":"2014-10-09T02:59:23Z","Content":"\n\u003Cp\u003Eso im not really a fan of career mode but sandbox mode has its own set of problems. it doesn\u0027t really feel like im playing towards something other then my own imagination. i like the idea of playing around a budget but i dont like having to play with limited parts.\u003C/p\u003E\u003Cp\u003Ethat said there are a few mods that add a great \u0022end game\u0022 when playing with all the parts but theres two problems they suffer.\u003C/p\u003E\u003Cp\u003E1. some of these mods add way too many \u0022necessary\u0022 parts i.e. life support for example either its super complicated and you need TAC/USI stuff. your ship design suffer from huge amounts of mission creep due to this.\u003C/p\u003E\u003Cp\u003E2. theres no \u0022acknowledgement\u0022 in sandbox mode. i.e. theres no reward penalty system in place.\u003C/p\u003E\u003Cp\u003Ethat said id like to get some ideas we might be able to ask for to give more variety to our play style preferences. some more open ended options.\u003C/p\u003E\u003Cp\u003Eone current thought i have is a career mode where instead of parts are limited by research/budget the planets are disabled from being targeted. so progression is based around where youve been rather then what youve designed. progression could follow through a remote tech style where you have to build up your range to access other planets where the end game feels like a more tangible achievement beyond having all the parts. I mean thats why we play this game not for the parts but for that AHA moment when you land on something thats been giving you problems. \u003C/p\u003E\u003Cp\u003Eanother idea i had was a \u0022Space race\u0022 where your put up against a rival space agency and you have to beat them on budget and mission time. you dont get to see or interact with the other agency other then a post mission briefing where you get to compare numbers. the other ships could be kerbal mock ups of real life missions. like beat apollo design to the mun or what have you. or do x amount of fly bys for ___ mission\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T03:01:33Z\u0022 title=\u002210/09/2014 03:01  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by endl\u003C/strong\u003E\n\u003C/span\u003E\n"}]}