{"TopicId":86971,"ForumId":55,"TopicTitle":"Commercial Contracts","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-10-11T15:36:19Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2014-10-11T15:36:19Z","Content":"\n\u003Cp\u003ESo you get special subassemblies (.craft files determined by the contract file) that apear in blue boxes in the subassembly screen. These are payloads. You get a contract rom the builder to put the satellite into x orbit around y planet/moon, for z money/rep/science. Payloads can also use special parts that do not appear in VAB/SPH\u003C/p\u003E\u003Cp\u003ECommercial Contractors:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKerbal Broadcasting Network\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThese guys are concerned with Kerbal Televison. Launching satellites for these guys is \u003Cem\u003Esure\u003C/em\u003E to get the public happy with us! Right? More TV! And, KBN is a wealthy but stupid company, so they are willing to pay a lot! But there\u0027s not much knowledge gained from TVsats.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKerbal Institute of Technology\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis reputable university launches magnificent scientific devices for the pursuit of furthering Kerbalkind. Unfortunately, while they won\u0027t \u003Cem\u003Egive\u003C/em\u003E us these devices, they will certainly let us launch them. They\u0027re even willing to share with us the scientific advances! They are smart enough to know how much a launch costs, so they\u0027re not willing to pay more than is necessary. Luckily, the public will certainly think highly of us for aiding such a prestigious university!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EXenomax Laboratories\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EA somewhat... sketchy research center. They are rather secretive, and as such any of these launches must be kept a secret from the public. But due to this, they are willing to share much of their scientific research that comes from their satellites, and they\u0027ll pay rather highly.\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2014-10-11T17:49:35Z","Content":"\n\u003Cp\u003EThere\u0027s already a thread for this. (my thread actually)\u003C/p\u003E\n"}]}