{"TopicId":87332,"ForumId":55,"TopicTitle":"A bunch of suggestions","CreatedByName":"Revolution","CreatedById":125949,"CreatedDateTime":"2014-10-14T22:22:32Z","PageNum":1,"Articles":[{"CreatedByName":"Revolution","CreatedById":125949,"CreatedDateTime":"2014-10-14T22:22:32Z","Content":"\n\u003Cp\u003EHello,\u003C/p\u003E\u003Cp\u003EI want to make a few suggestions that I (and maybe others?) would like to see in the game added.\u003C/p\u003E\u003Cp\u003EI already want to say sorry, because I will mention some things that had already been suggested, but would like to add things to it.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EMining\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EI have seen this being suggested, but I think it would be awesome thing to add for example.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E- Getting quest for mining a resource on other planets/moons\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E - E.g: Mine* 5 KG of Eve stone or whatever\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E- Getting advanced rockets\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E - E.g: Mining He-3 on Mun and getting rockets that work on that that are better than others.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E*With mining I am thinking of a machine you have to bring somewhere and would use electricity.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003ECivilizations\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EThis I have also seen suggested, but I think it has great possibilities.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E- Getting political quest.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E - E.g.: Go to Dres and bring this message (or item).\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E- Learning from other Civilizations.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E - Better rockets or jets or science.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E- Political status*.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E - Having a certain status with e.g. Eve civilization would be able to make a rocket on their planet (so gaining an extra launch station although you would need to get a kerbal there for the launch).\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E - You would gain this by completing jobs for that civilization.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E*In sandbox mode you would still need to do this to be able to launch from there. Although you will still have infinite money and all parts unlocked.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EPlanets\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAlso this is suggested several times, but I also think this has many possibilities.\u003C/p\u003E\u003Cp\u003E- Other star systems (Many have suggested this one, but would like to add things to this)\u003C/p\u003E\u003Cp\u003E - This would mean more planets (always fun to reach), but combined with civilizations also creating many new quest (e.g political quest to make contact with the civilization on PLANETNAME).\u003C/p\u003E\u003Cp\u003E - How to come here? I would suggest a warp drive* that would allow you to warp whenever your futher than eeloo and says like \u0022Would you like to warp to STARNAME\u0022.\u003C/p\u003E\u003Cp\u003E- Terraforming (and life?)\u003C/p\u003E\u003Cp\u003E - Getting samples of trees or animals and would give you science.\u003C/p\u003E\u003Cp\u003E*You would unlock the warpdrive if you have alot of science and made contact with all other civilizations (or what the community wants?)(I think it would also be fun for this to be done by people playing in sandbox mode making it more challenging)\u003C/p\u003E\u003Cp\u003E*You would only be able to warp drive when your out of the solar system (so that going to other planets wouldn\u0027t be too easy to get and making it still challenging).\u003C/p\u003E\u003Cp\u003E*I would say the size small as I mentioned above it to be only useable to go to the other solar system (on the otherhand people will be experianced rocketeers at this point if things listed above would be to required to unlock it)\u003C/p\u003E\u003Cp\u003EWell these were my suggestions. Sorry if there are spelling/grammer mistakes or incorrect use of words (English isn\u0027t my native language).\u003C/p\u003E\u003Cp\u003EThanks alot for reading\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E. Hoop you like the suggestions and feel free to comment your opinion (would love you hear what you people think) or give your own suggestion that should be added.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EYours faithfully, \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ERevolution\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-10-14T23:19:42Z","Content":"\n\u003Cp\u003EThere is no recourses in stock, but you can mod it in if you want. The current word from the Devs is that it will stay that way. This is on the What not to Suggest list, and thus you should \u003Cem\u003Enot suggest it\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EThe devs have also said that there will be no allien civilizations. This is ALSO on the What not to Suggest list, and thus you should \u003Cem\u003Enot suggest it\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ENew planets is ALSO on the What not to Suggest list, and thus you should \u003Cem\u003Enot suggest it\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s fine to suggest things and bring your own ideas, but remember to check \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003Ethe list\u003C/a\u003E first, because suggesting things on that list will cause your threat to get locked\u003C/p\u003E\n"}]}