{"TopicId":88017,"ForumId":55,"TopicTitle":"Make the map and the tracking station the same","CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-10-20T17:40:58Z","PageNum":1,"Articles":[{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-10-20T17:40:58Z","Content":"\n\u003Cp\u003EI am struck by how similar in function the map and the tracking station are yet they miss important functions from the other. It seems to make sense to me to make just one area that serves the purpose of both. It is an aim of SQUAD to increase immersion and having to go to the space centre then to the tracking station when previously on the map screen just to change the name of a craft not currently controlled or track a roid seems needlessly complicated and breaks immersion. Often in the map screen I want the list of craft on the left to be there so I can easily change focus and often in the tracking screen I want to make or adjust a node for the selected craft. I want to be able to track or stop tracking an asteroid if I am looking at it on a map whether that is in the map or tracking screen for example.\u003C/p\u003E\u003Cp\u003EIf there were a single map screen where all the functions of both map and tracking were present that would be a good thing. It should be accessible from KSC and in flight.\u003C/p\u003E\u003Cp\u003EThat is my suggestion.\u003C/p\u003E\n"},{"CreatedByName":"AlexanderB","CreatedById":17544,"CreatedDateTime":"2014-10-20T17:46:49Z","Content":"\n\u003Cp\u003EMakes sense to me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027d say, why not.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-10-20T18:06:36Z","Content":"\n\u003Cp\u003EWell I can see some technical problems raising their heads but it should reduce memory footprint and duplication of code and thereby increase stability as a nice side effect.\u003C/p\u003E\n"}]}