{"TopicId":89726,"ForumId":55,"TopicTitle":"KSC Science upgrades alongside buildings","CreatedByName":"gmbigg","CreatedById":107412,"CreatedDateTime":"2014-11-08T02:35:34Z","PageNum":1,"Articles":[{"CreatedByName":"gmbigg","CreatedById":107412,"CreatedDateTime":"2014-11-08T02:35:34Z","Content":"\n\u003Cp\u003ESo after I finished watching today\u0027s Squadcast, I was looking at the tier 1 KSC buildings when I had a thought (surprising, I know \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E):\u003C/p\u003E\u003Cp\u003EThere\u0027s no way you should be able to get enough Science to build spaceplanes from looking at those sandbags, right?\u003C/p\u003E\u003Cp\u003EIn addition, a lot of people (last time I checked, anyways) hate how easy it is to get Science by just putting a pod on the launch pad.\u003C/p\u003E\u003Cp\u003EI think I might have a good solution to both problems:\u003C/p\u003E\u003Cp\u003EBasically, you get less science from a Tier 1 VAB compared to a Tier 2 VAB, which is less than a Tier 3 VAB, and so on.\u003C/p\u003E\u003Cp\u003EFor example, the Tier 1 launchpad might give 0.1 Science for an EVA report on it, but a Tier 2 launchpad might give 0.4 Science.\u003C/p\u003E\u003Cp\u003EThis would probably be done simply by raising the Science cap of the appropriate buildings when they\u0027re upgraded.\u003C/p\u003E\u003Cp\u003EFinally, here\u0027s why I think this is a good idea:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EIt prevents you from getting too much science without actually flying a rocket somewhere, especially now that every building and decoration is a unique mini-biome.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt encourages in-depth exploration of KSC every time you upgrade a building (see the pretty new building up close \u003Cem\u003Eand\u003C/em\u003E get Science for doing so!)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EIt makes testing your spacecraft at KSC profitable; get on/near a recently-upgraded building, grab science, recover vessel, profit.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003EHave the Science each mini-biome at KSC gives increase as you upgrade the appropriate building.\u003C/p\u003E\u003C/blockquote\u003E\n"}]}