{"TopicId":89999,"ForumId":55,"TopicTitle":"A Massive Wishlist of Features for Future Versions","CreatedByName":"SCE-2-AUX","CreatedById":128856,"CreatedDateTime":"2014-11-11T12:14:18Z","PageNum":1,"Articles":[{"CreatedByName":"SCE-2-AUX","CreatedById":128856,"CreatedDateTime":"2014-11-11T12:14:18Z","Content":"\n\u003Cp\u003EI have been playing KSP since .13 came out in February 2012, and since then there has been an absolutely massive amount of progress that Squad has made. Still, there are features that I feel are missing or that need a second coat of polish. While some of my wishlist can be achieved with mods, I\u0027d like to see Squad implement them on their own so that we can get their vision of what the game should be, and then leave it up to modders to expand those features.\u003C/p\u003E\u003Cp\u003EWithout further ado, here\u0027s the list:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe Tech Tree\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe tech tree doesn\u0027t grant players the freedom of choice that it should. At the start of career mode, the player should be able to choose whether to start with the basic parts for planes, unmanned probe rockets, or manned (kerbaled?) rockets. This will let players customize their experience to their own play style starting from the first launch, rather than everyone heading down relatively same track at the start of each game.\u003C/p\u003E\u003Cp\u003EThe tech tree also needs to be split up to have more branches. Right now, there are nodes where you get completely unrelated parts, like the Space Exploration node where you get a high-tech Mobile Processing Lab, a thermometer, and a couple of iron bars that you can stick on the side of your craft as a ladder. There need to be separate tracks for engines, fuel tanks, solar panels, science equipment, etc. Again, this improves player choice, letting them concentrate on the area they want or need most at the moment. It also improves the in-universe logic, with the R\u0026amp;D department having separate specialized divisions. Lastly, the parts need to be reorganized so they\u0027re in a logical order: thermometers before fancy science labs and goo canisters, medium fuel tanks before miniaturization and jumbo technology has been developed, docking ports in increasing order of size and complexity, etc.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EScience System\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis one needs a lot of work. Science needs to be switched from a points system to a buy-in/progress system. My idea would be to pay funds to start researching a node, and then a progress bar would appear, letting you know how long until that node\u0027s parts were unlocked. Research progress could be sped up by spending more cash, using upgradeable buildings (more on that later), completing missions, or gaining science lab multipliers. \u003C/p\u003E\u003Cp\u003EWhat are science lab multipliers? Finally a use for space stations and bases! Each planet and moon would offer a research multiplier for having a manned Mobile Processing Lab in orbit or landed on its surface (excluding landed on Kerbin\u0027s surface, because the R\u0026amp;D center is your x1 multiplier). If you had a lab in orbit around Kerbin, Minmus, and the Mun, and a lab landed on Minmus, then you would have a research bonus of x5, making your research five times as fast. Naturally, higher tier nodes would take longer to research to account for this, so each node would research in a balanced amount of time. The multiplier doesn\u0027t have to be an additional x1 for each station and base, it could be anywhere from 0.1-1, or vary by planet.\u003C/p\u003E\u003Cp\u003ENormal transmitted or recovered science would either fullfill a contract, or you could go freelancing. If you gained science that way, then you would choose which research project your science experiments would benefit, reducing the research time until it was completed. There are a few ways this could be implimented too, choosing if science benefits one project, if it benefits research speed in general for a period of time, if certain experiments/planets were more beneficial, etc.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EConstruction Time\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHave it take time to build rockets. This will make players plan their launches and can add another layer of difficulty to the game. Or at least take away the silliness of launching five rockets per hour, and landing on Minmus by the end of the campaign\u0027s first day. Again, this can tie into upgradeable buildings.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUpgradeable Buildings\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EUpgradeable buildings have already been mentioned as part of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/content/312-The-Grand-0-26-Plan\u0022 rel=\u0022external nofollow\u0022\u003EThe Grand 0.90 Plan\u003C/a\u003E, and the first round of buildings have been shown already. I won\u0027t go into the aesthetics of the buildings, other than to ask Squad to look at \u003Ca href=\u0022http://i.imgur.com/G0MeYBl.jpg\u0022 rel=\u0022external nofollow\u0022\u003E1940s German launch sites\u003C/a\u003E, 1960s Canaveral/Baikonur, modern day aesthetics, and then have the current buildings for the end game. The upgrades themselves have yet to be announced though. I\u0027d suggest upgraded build/research speed for each tier of the VAB, SPH, and R\u0026amp;D labs. Also, upgrades could increase the amount of projects each building could work on at once.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUpgradeable parts\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ERecently the community heard about \u0022magic Kerbals\u0022 who could improve the isp of an engine by having enough experience. Feedback was pretty negative, but what about upgrading the parts themselves through science/research? Plane cockpits could start out as unable to support Kerbals in vacuum. Engines could start at the basics, and then receive upgraded thrust, isp, gimballing, and reduced weight as you improved them. Solar panels and batteries could become more efficient, RCS thrusters could be improved, and docking ports could be upgraded from something that just joins two craft together, to allowing fuel crossfeed, including lights, and permitting Kerbals to transfer through the docking port.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKerbal classes, experience and service time\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EKerbals should have different specializations running from engineers, pilots, scientists, and commanders, and give each class their own perk. Scientists would improve the yield of experiments for R\u0026amp;D projects, engineers could fix parts (more on that later) and have bigger jetpacks, pilots would add a sort of Mechjeb Smart ASS (*not autopilot*) to the craft, etc.\u003C/p\u003E\u003Cp\u003EInclude the ability to remove your Kerbals from active flight duty (permanently) by transferring them to the administration building or mission control. Increase the rewards for this based on how much experience/prestige the Kerbal has. Also include a mandatory retirement from flight duty about 10-15 years after they are hired to begin with, where you can no longer sell them to mission control for rewards. If that barrier passed while they were on a mission, the Kerbal would retire as soon as they landed. Also, the Kerbal would die from old age if they were still out on a mission 5-10 years after their retirement date. Now players are deciding whether to send a veteran crew to Jool and use their perks, but miss out on benefits from selling them, or send a rookie crew but get benefits from giving your veteran Kerbals an early retirement. You could even tie in part upgrades so an upgraded Hitchhiker Module puts Kerbals in stasis and slows down their aging, giving them a longer service time. \u003C/p\u003E\u003Cp\u003ELastly, give the ability to keep track of what each Kerbal has done. It\u0027d be nice to know who the star of our space program is by finding the one with a chest full of medals for missions to Mun, Minmus, Duna, and all over the system.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMalfunctioning parts\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe engineer Kerbal needs something to fix after all. Leaky fuel tanks, engines that won\u0027t light, RCS ports that quit working, gimbals that quit, batteries that die, life support that explodes (Apollo 13, anyone?), etc. Can also be tied with upgradeable parts, improving their reliability.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBetter explosion logic\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIf an engine overheats, or a tank gets smacked by a separating booster and explodes, that explosion should destroy nearby parts and explode attached/nearby fuel tanks. This makes more sense than one fuel tank exploding, but leaving another tank full of explosive rocket fuel right beside it unscathed. It also increases the need for abort modes that work.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBetter IVA\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EMost cockpits feel like you\u0027re sitting too low and need a booster seat to see through the windows correctly. Add a HUD so that you\u0027re looking through the windows instead of staring at the navball the whole time. IVA docking is unnecessarily hard and needs a \u003Ca href=\u0022http://i.imgur.com/5cBgv60.png\u0022 rel=\u0022external nofollow\u0022\u003Edocking reticule\u003C/a\u003E or a display that shows you the view from the docking port.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVAB/SPH Editor Fine-Tuning\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe editor does \u003Ca href=\u0022http://i.imgur.com/k7Bj6Y3.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E. Some parts are visible through the transparent unattached fuel tank, and some parts are not. This is especially frustrating when attaching fuel tanks to a radial adapter (The screenshot shows that radial decouplers are one of the invisible parts). Please fix this.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAltimeter Adjustments\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHave the altimeter switch to show height above ground when the speedometer on the navball is in surface mode, and height above sea level when in orbital mode. This will make landings much easier and give relevant information when you\u0027re landing a spaceplane on the runway or putting a lander on Minmus.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESimulators\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAdd simulations so we can test our designs before paying funds to build them, waiting for them to be built, and sending them to their destination, only to then find out that our Duna lander won\u0027t work. Especially in hard mode. (Or just practice our moon landings with a proven craft).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDeltaV Displays and Phase Angles\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAdd more data displays to the game. DeltaV displays in the editors are crucial, and planetary phase angles are needed too. Funds are implemented now, but people are still guessing at how much fuel they need for their rocket, leading to wasteful things \u003Ca href=\u0022http://i.imgur.com/va9NcTW.jpg\u0022 rel=\u0022external nofollow\u0022\u003Elike this\u003C/a\u003E, or running out of fuel and slamming into the Mun because they underestimated. As for phase angles, people are doing \u003Ca href=\u0022http://i.imgur.com/Xsmixrw.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethings like this\u003C/a\u003E in order to figure out when to execute their burn. There has to be a better way.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHeat shields\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EReentry effects were added in 0.19, now they need to mean something.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELife support\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI\u0027d recommend something really basic, the fewer resources the better. Maybe just add a resource named \u0022LifeSupport\u0022. One LifeSupport is enough for one kerbal per day, and one LifeSupport converts to one \u0022Waste\u0022. There can then be a converter that uses ElectricCharge to convert one Waste back into 0.25 LifeSupport for long-term missions and space stations. Again, numbers are suggestions.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EClouds\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou can get them through mods, but you shouldn\u0027t have to. They add a lot to the feel of flying on Kerbin and the significance of atmosphere on other planets.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBetter Aerodynamics\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ERevamped aerodynamics and fairings should be added. Not something as complex as ferram\u0027s fantastic mods, but enough to make things more realistic, get rid of the \u0027soup\u0027 below 10km on Kerbin, and encourage the use of fairings and nosecones.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERocket Engine Flameouts\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAdd a minimum throttle on bigger engines. It doesn\u0027t seem right to be able to fire a Mainsail at 5% thrust without it flaming out. Make bigger engines have flameout when the throttle dips below a certain point, maybe even as high as 50% for the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/w/images/1/1f/Big1.png\u0022 rel=\u0022external nofollow\u0022\u003EKR-2L 3m NASA engine\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMission Tracker\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EKerbal Alarm Clock is a fantastic mod, but again, I don\u0027t think players should have to go outside of the stock game for something that\u0027s so integral to the game. Before the mod came along, I once spent three hours on a Saturday coordinating missions, keeping track of how long until they reached their destinations, being careful with my warp so I wouldn\u0027t speed past course corrections, switching between craft to double check, things like that. It wasn\u0027t fun. KSP should make it easier for people to run multiple missions at the same time, without removing the fun.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBiome Location Display\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWith biomes coming to every planet, there needs to be a better system in place to handle it. Right now, it seems like players either pick a landing site randomly in hope of finding a new place to gather science, or turn to \u003Ca href=\u0022http://www.kerbalmaps.com/\u0022 rel=\u0022external nofollow\u0022\u003Eoutside resources\u003C/a\u003E or \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80369\u0022 rel=\u0022external nofollow\u0022\u003Emods\u003C/a\u003E. There should be an overlay on planets, showing biomes that have been found and had an experiment performed in them. For example, if you performed an experiment in Kerbin\u0027s grasslands, then you could toggle the overlay and see where all of Kerbin\u0027s grasslands were, and letting you see where not to send your next science plane. Furthermore, if a mission wanted you to specifically do an experiment in the Mun\u0027s Northwest Crater, then it could show where the biome was, giving a landing target.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe Crazy Idea\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ERemove as many parts from the game as possible and replace them with tweakable parts. Tweakables were added in 0.23, but it doesn\u0027t really feel like the stock game has done anything major with them. With tweakable fuel tanks, you could have only one part, reducing memory loading, that you could tweak the size of. Height, width, texture/paint job, solid/liquid, and more. You could probably do the same thing for different parts too like engines, solar panels, batteries, and more. It would also reduce the parts needed to build a craft, making it easier on people\u0027s computers. One long 2m fuel tank is better than three orange fuel tanks.\u003C/p\u003E\u003Cp\u003EAs a long-time player, I feel that all these features are needed before the game is fully feature complete. Some of these are just suggestions about how to address something, but they are all features that need to be worked on still. This is absolutely the best game I have ever played, but I would still feel disappointed if it was officially released with a lackluster science system, or \u0027missing\u0027 features that had to be modded in.\u003C/p\u003E\u003Cp\u003EI\u0027d definitely appreciate the community\u0027s feedback on my suggestions and ideas, and I\u0027ll be crossing my fingers that the devs see this here or on the subreddit.\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-11-11T12:35:33Z","Content":"\n\u003Cp\u003ENothing bad I find in your ideas, but not all of them should be part of the base (stock) KSP game. KSP is already pretty heavy on hardware, and some players may not be able to load a heavier version that includes all you suggested. But some are quite good.\u003C/p\u003E\u003Cp\u003EThe above is also why is a good thing add-ons exist for KSP, almost every major idea you showed is already achievable in game with one (or more) add-ons. Who has enough hardware to run a modded install can already enjoy what you proposed, without others having to use KSP in the same way. More freedom of choice for all.\u003C/p\u003E\n"},{"CreatedByName":"SheepDog2142","CreatedById":128819,"CreatedDateTime":"2014-11-11T15:46:39Z","Content":"\n\u003Cp\u003EWhy rely on the devs to work out the tech tree? They need to let us put out on tech trees together. Or open up the code so moders can more easily do it.\u003C/p\u003E\n"}]}