{"TopicId":90042,"ForumId":55,"TopicTitle":"Trajectory in map displaying the orbit after air resistance","CreatedByName":"FunnyBunny14","CreatedById":128892,"CreatedDateTime":"2014-11-11T21:09:14Z","PageNum":1,"Articles":[{"CreatedByName":"FunnyBunny14","CreatedById":128892,"CreatedDateTime":"2014-11-11T21:09:14Z","Content":"\n\u003Cp\u003EFirst of all, there already is a mod that does this: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/93685-0-24-0-25-Trajectories-v0-4-1-(2014-10-16)-atmospheric-predictions-FAR-NEAR\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/93685-0-24-0-25-Trajectories-v0-4-1-(2014-10-16)-atmospheric-predictions-FAR-NEAR\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI basically want something like this mod to be default in the game. It seems so obivous and it is so useful that it should be in the game without a mod. The mod also displays the area on the map where you will land with a red cross, and it will look like it isn\u0027t correct at all at first, but then you realise that that is where you\u0027ll be when you land. That too should be in the game by default, as it makes landing a lot easier.\u003C/p\u003E\u003Cp\u003ESo this suggestion basically consists of two parts:\u003C/p\u003E\u003Cp\u003E1. Trajectory calculation with drag.\u003C/p\u003E\u003Cp\u003E2. Landing site display on the map.\u003C/p\u003E\u003Cp\u003EPlease feel free to post your own opinions of these ideas and suggestions for other features that would be useful while displaying orbits and such.\u003C/p\u003E\n"},{"CreatedByName":"Pthigrivi","CreatedById":105624,"CreatedDateTime":"2014-11-12T03:21:21Z","Content":"\n\u003Cp\u003EI do a ton of aerobreaking and I love this idea.\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2014-11-12T07:59:00Z","Content":"\n\u003Cp\u003ELookup the \u0022Trajectories\u0022 mod. I think it also does exactly this. \u003C/p\u003E\u003Cp\u003EI agree something like this is quite useful perhaps obtained as a \u0022onboard landing computer\u0022 somewhere in the tech progression.\u003C/p\u003E\u003Cp\u003EEDIT: Sorry typed should have indicated \u0022I looked up...\u0022\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-14T12:44:08Z\u0022 title=\u002211/14/2014 12:44  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 14, 2014\u003C/time\u003E by Wallygator\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2014-11-12T14:59:50Z","Content":"\n\u003Cp\u003EI support this idea.\u003C/p\u003E\u003Cp\u003EIf the players are to navigate \u0022by sight\u0022 helped by a bunch of visual helper, you could make this one. It would both reduce the infuriating error left to left to chance, and yet allow the player to take more risk (usually spaceplane don\u0027t come back with much fuel left if you really wanted to reduce weight)\u003C/p\u003E\u003Cp\u003EAt first it might make a little too easy to get back right on KSP and recover everything.\u003C/p\u003E\u003Cp\u003EBut that\u0027s a necessity when you\u0027ll need to do aerobreaking and try to land in different atmosphere without being forced to reload a save.\u003C/p\u003E\u003Cp\u003EBy the way, a stock deltaV reader fit in the same category. It\u0027s meaningless to be able to read a maneuver\u0027s cost in m/s if you don\u0027t give the tool to know how many you have (or at least as something you buy/unlock later of course).\u003C/p\u003E\n"},{"CreatedByName":"FunnyBunny14","CreatedById":128892,"CreatedDateTime":"2014-11-12T15:15:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAt first it might make a little too easy to get back right on KSP and recover everything.\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EBut that\u0027s a necessity when you\u0027ll need to do aerobreaking and try to land in different atmosphere without being forced to reload a save.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EIt definitely should indeed not be that easy. I was actually thinking that maybe that red cross could come as a bonus with the tier 3 tracking station. That way it only is available later in the game. The air resistance thing would then come at tier 2, to make it easier for players to go interplanetary.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003ELookup the \u0022Trajectories\u0022 mod. I think it also does exactly this.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003ELook closely at the link in my first post here (and no, I didn\u0027t edit it).\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-11-12T16:38:49Z","Content":"\n\u003Cp\u003EAfter playing with Trajectories, I can only concur. With trajectories I manage to land in places I want for the first time and with I also consciously used reentry mechanics to skip out of the atmosphere and further along for the first time. Without atmospheric trajectories that would not have been possible. Really enhances the game.\u003C/p\u003E\n"},{"CreatedByName":"FunnyBunny14","CreatedById":128892,"CreatedDateTime":"2014-11-12T17:33:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CaptRobau\u0022 data-cite=\u0022CaptRobau\u0022\u003E\u003Cdiv\u003EAfter playing with Trajectories, I can only concur. With trajectories I manage to land in places I want for the first time and with I also consciously used reentry mechanics to skip out of the atmosphere and further along for the first time. Without atmospheric trajectories that would not have been possible. Really enhances the game.\u003C/div\u003E\u003C/blockquote\u003EI definitely agree with that. The red cross is a bit overpowered for starting the game though, but like I said, if it gets worked into the building upgrades it would be an incredible edition to the game.\u003Cp\u003EI\u0027ve actually got a bunch of mods that I\u0027m using that don\u0027t change the game a lot, but make life easier. The most noteworthy was the trajectory mod, and since I thought \u0022why isn\u0027t this in the game by default\u0022, I decided to create this thread.\u003C/p\u003E\n"},{"CreatedByName":"Tuareg","CreatedById":84241,"CreatedDateTime":"2014-11-13T17:56:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FunnyBunny14\u0022 data-cite=\u0022FunnyBunny14\u0022\u003E\u003Cdiv\u003EI definitely agree with that. The red cross is a bit overpowered for starting the game though, but like I said, if it gets worked into the building upgrades it would be an incredible edition to the game.\u003Cp\u003EI\u0027ve actually got a bunch of mods that I\u0027m using that don\u0027t change the game a lot, but make life easier. The most noteworthy was the trajectory mod, and since I thought \u0022why isn\u0027t this in the game by default\u0022, I decided to create this thread.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eglad u did, it would be great in stock game.\u003C/p\u003E\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2014-11-14T09:39:53Z","Content":"\n\u003Cp\u003EYep it\u0027s a great mod. I use it for almost all of my shuttle missions, which is roughly 60% of my launches in late game. \u003C/p\u003E\u003Cp\u003EIt makes safe reentries directly to the KSC possible. Eyeballing this with FAR and DRE on a shuttle is nearly impossible and I wouldn\u0027t use shuttles in hard career mode otherwise, as the risk of losing my crew is way too high (planes have a lower heat resistance than heetshields from pods). To be clear I usually don\u0027t have more than 200 dv left and have to do that stuff unproppelled (with airbreaks to alter my velocity of course). Efficient shuttles and SSTO\u0027s usually don\u0027t have enough fuel left to deal with errors which at least I can\u0027t avoid with the little info the stock game offers :/\u003C/p\u003E\u003Cp\u003EI would like the implementation of that stuff in a part (\u0022aerodynamics package\u0022 or something similar) which needs to be unlocked and attached to a craft. I agree that it should be a late game part.\u003C/p\u003E\n"},{"CreatedByName":"FunnyBunny14","CreatedById":128892,"CreatedDateTime":"2014-11-14T13:10:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022prophet_01\u0022 data-cite=\u0022prophet_01\u0022\u003E\u003Cdiv\u003EYep it\u0027s a great mod. I use it for almost all of my shuttle missions, which is roughly 60% of my launches in late game. \u003Cp\u003EIt makes safe reentries directly to the KSC possible. Eyeballing this with FAR and DRE on a shuttle is nearly impossible and I wouldn\u0027t use shuttles in hard career mode otherwise, as the risk of losing my crew is way too high (planes have a lower heat resistance than heetshields from pods). To be clear I usually don\u0027t have more than 200 dv left and have to do that stuff unproppelled (with airbreaks to alter my velocity of course). Efficient shuttles and SSTO\u0027s usually don\u0027t have enough fuel left to deal with errors which at least I can\u0027t avoid with the little info the stock game offers :/\u003C/p\u003E\u003Cp\u003EI would like the implementation of that stuff in a part (\u0022aerodynamics package\u0022 or something similar) which needs to be unlocked and attached to a craft. I agree that it should be a late game part.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EI\u0027m generally against parts to add functionality. It is just a mission control thing, after all. Wouldn\u0027t you agree that it is a lot better to have this worked into the building upgrades?\n"}]}