{"TopicId":90391,"ForumId":55,"TopicTitle":"Possible to place KSC buildings, forming the KSC the way you wanted.","CreatedByName":"MK3424","CreatedById":19932,"CreatedDateTime":"2014-11-15T22:03:51Z","PageNum":1,"Articles":[{"CreatedByName":"MK3424","CreatedById":19932,"CreatedDateTime":"2014-11-15T22:03:51Z","Content":"\n\u003Cp\u003EDid you ever wondered how the KSC would have looked if you placed the buildings on other locations within the KSC area and how would it look like?\u003C/p\u003E\u003Cp\u003EThat\u0027s why i wanna suggest this: you start with just a plain grassfield and place the buildings and pads yourself.\u003C/p\u003E\u003Cp\u003EThis makes the Space Center different to every player: everybody has it\u0027s own style of placing the buildings around.\u003C/p\u003E\u003Cp\u003EYou can compare this to let\u0027s say Simcity: You place the roads this way, the power stations that way and so on.... \u003C/p\u003E\u003Cp\u003EWhen you have finished building you can be really proud of how it looks and what you have contributed to the look of your space center.\u003C/p\u003E\u003Cp\u003EEverybody has it\u0027s own idea on where the buildings should be placed that what\u0027s make the Kennedy Space Center look like the Kennedy Space Center and the Cosmodrome Baikonour look like the Cosmodrome Baikonour (and others aswell): they\u0027re unique! \u003C/p\u003E\u003Cp\u003EThis means that when you take a look around, you can be proud of yourself and say: that\u0027s what i build for my Space Center.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-15T22:12:19Z\u0022 title=\u002211/15/2014 10:12  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 15, 2014\u003C/time\u003E by MK3424\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-11-15T22:10:29Z","Content":"\n\u003Cp\u003EThis would be amazing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}