{"TopicId":91983,"ForumId":55,"TopicTitle":"Exciting things to do on other planets.","CreatedByName":"noahtech","CreatedById":130815,"CreatedDateTime":"2014-12-05T02:53:17Z","PageNum":1,"Articles":[{"CreatedByName":"noahtech","CreatedById":130815,"CreatedDateTime":"2014-12-05T02:53:17Z","Content":"\n\u003Cp\u003EI\u0027ve been thinking about the gameplay for this game, and I started to realize that getting from one planet to another is pretty fun; but when you get to the planet, there doesn\u0027t seem to be very much to do other than science experiments. So then I was reading about the polar caps on Mars and I thought: What if there were serious dangers on the various planets? Like maybe thin ice on some planet that would break if you put too much weight on them? Or the possibility of meteorites smashing into your ship?\u003C/p\u003E\n"},{"CreatedByName":"Mutex","CreatedById":106937,"CreatedDateTime":"2014-12-05T11:33:21Z","Content":"\n\u003Cp\u003EI think this topic has come up many, many times before, but it definitely would add a lot to exploring bodies if there were different surface types on the same body. Some perilous, like maybe quicksand, or lava. Or others than just inhibit travel like varying consistency of sand/gravel. However I can see that, in addition to the coding challenge this would increase memory usage.\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2014-12-05T16:49:39Z","Content":"\n\u003Cp\u003EThe thing in game development is that you need sub-feature to make a feature possible, or add another without having to rewrite all codes.\u003C/p\u003E\u003Cp\u003EThus, maybe the Devs needed Kerbal Experience before working on hand-on things to do on other planet.\u003C/p\u003E\u003Cp\u003EIn any case, I have only one thing left to say :\u003C/p\u003E\u003Cp\u003EIt\u0027s meaningless to add more planets and moons if there isn\u0027t more to do on any one of them.\u003C/p\u003E\n"},{"CreatedByName":"noahtech","CreatedById":130815,"CreatedDateTime":"2014-12-05T16:54:00Z","Content":"\n\u003Cp\u003EWhen I first landed on the MÃƒÂ¼n my first thought was \u0022They should add a big amusement park here\u0022. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mutex","CreatedById":106937,"CreatedDateTime":"2014-12-05T19:14:48Z","Content":"\n\u003Cp\u003EWith blackjack! And hookers! In fact, forget the park!\u003C/p\u003E\n"}]}