{"TopicId":92743,"ForumId":55,"TopicTitle":"Quicksave Failsafe/Limitation","CreatedByName":"Kulko","CreatedById":59853,"CreatedDateTime":"2014-12-13T20:21:32Z","PageNum":1,"Articles":[{"CreatedByName":"Kulko","CreatedById":59853,"CreatedDateTime":"2014-12-13T20:21:32Z","Content":"\n\u003Cp\u003ESo after a long hiatus I finally got around to installing 0.25 last night. Between last night and this morning I made some significant progress, sending unmanned science probes to Mun and Minmus and getting three or so tiers up on the tech tree. \u003C/p\u003E\u003Cp\u003EOn my way back from Minmus I miscalculated my aerobraking and wound up in a stable but non-reentry orbit with 0 dV around Kerbin. I decided to reload my last quicksave, which I thought had been in orbit around Minmus, to try it again. I pressed and held F9 and was quickly brought to...\u003C/p\u003E\u003Cp\u003EMy first rocket, 25 km above Kerbin. Seriously. 4 FL-200 fuel tanks, an LV-30, and a command pod. Just going straight up.\u003C/p\u003E\u003Cp\u003EI don\u0027t know whether I didn\u0027t properly quicksave or what happened, but I lost about eight hours of kerbaling in one second. So I did what any Kerbal would do. I blew it up and did a hard reset of the computer. Surely the quicksave load hadn\u0027t overwritten my actual last space center save....\u003C/p\u003E\u003Cp\u003EOh yes it did. Upon restarting and reloading, I was back at year 1, day 1, all my progress gone. So now I\u0027ve ragequit until 0.90 comes out and I have to start all over anyway. \u003C/p\u003E\u003Cp\u003ESo here is the suggestion itself: Limit quicksaves to in-mission or in-flight. DIstinct quicksaves for each craft or mission. SOME sort of failsafe so that this doesn\u0027t happen. Or at the very least, a warning when you are about to quickload to another craft or back in time, similar to when you want to revert and it tells you when you\u0027re headed to.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-12-13T20:41:19Z","Content":"\n\u003Cp\u003EA common mistake.\u003C/p\u003E\u003Cp\u003ENext time make a manual save before important events with [Alt]\u002B[F5] and manually reload with [Alt]\u002B[F9].\u003C/p\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-12-13T20:42:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulko\u0022 data-cite=\u0022Kulko\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESo here is the suggestion itself: Limit quicksaves to in-mission or in-flight. DIstinct quicksaves for each craft or mission. SOME sort of failsafe so that this doesn\u0027t happen. Or at the very least, a warning when you are about to quickload to another craft or back in time, similar to when you want to revert and it tells you when you\u0027re headed to.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a kinda of confusing suggestion.\u003C/p\u003E\u003Cp\u003EAt the most basic level a quick load could tell you how far back your loading. But then again it is called a quickload and quick save. \u003C/p\u003E\u003Cp\u003EOutside of that, things would get confusing really fast. I\u0027ve never had any problems with quick loading and quick saving that weren\u0027t my own fault, and I assume this is also your case. So adding a fail-safe is nice and all. But the power is all in our hands in the end, adding fail safes is nice until it complicates things for no good reason.\u003C/p\u003E\n"},{"CreatedByName":"Kulko","CreatedById":59853,"CreatedDateTime":"2014-12-13T20:48:50Z","Content":"\n\u003Cp\u003EI\u0027m not denying that this was user error. My overarching point was that, since the way KSP handles campaign progress, autosaves, and manual saves is not readily apparent to the user, a quicksave should be temporary, and not overwrite a previous autosave. For instance, I had no idea about manual alt-saving until Tex replied above. \u003C/p\u003E\u003Cp\u003EExample, for clarity:\u003C/p\u003E\u003Cp\u003ELaunch rocket A. \u003C/p\u003E\u003Cp\u003EQuicksave rocket A.\u003C/p\u003E\u003Cp\u003ESuccessfully land and recover rocket A.\u003C/p\u003E\u003Cp\u003ELaunch rocket B.\u003C/p\u003E\u003Cp\u003EQuickload should return \u0022No quicksave for this craft\u0022, instead of returning you to flight with Rocket A. Or, if it is going to return you to Rocket A, it should return \u0022Quickload will restore an earlier state, are you sure?\u0022 \u003C/p\u003E\u003Cp\u003EIt wouldn\u0027t add any extra confusion. If you were still flying rocket A when you quickloaded, there would be no confirmation dialog. But if you are flying any other craft, especially if Rocket A has already been recovered, KSP should double check before reverting.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-12-13T20:53:51Z","Content":"\n\u003Cp\u003EYou could have saved your original autosave if you had handled it correctly.\u003C/p\u003E\u003Cp\u003EAfter you realized your mistake you should not have crashed your rocket and allow the game to make a new autosave. Instead you should have killed the game immediately ([Alt]\u002B[F4]) before it has a chance to autosave.\u003C/p\u003E\n"},{"CreatedByName":"Kulko","CreatedById":59853,"CreatedDateTime":"2014-12-13T21:08:02Z","Content":"\n\u003Cp\u003EThat\u0027s what I did, sorry if I was unclear. I am running Linux Mint 17.1 so there is no ALT-F4 but I CTRL-ALT-BACKSPACE to restart the session and force quit all programs. But it still autosaved.\u003C/p\u003E\u003Cp\u003EEDIT: I guess I don\u0027t see why this is so controversial. Pretty much every game ever - heck, most SOFTWARE, let alone games - will give you a warning if you are about to overwrite data or revert to an earlier version. Just silently overwriting a ton of progress seems stealthily mean.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-13T21:11:42Z\u0022 title=\u002212/13/2014 09:11  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 13, 2014\u003C/time\u003E by Kulko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2014-12-14T00:16:01Z","Content":"\n\u003Cp\u003EI always think that the game should just have a rotation series of quick / auto saves. Many games do this, and it really prevents this kind of aggravation if the last 5 saves / auto saves were always kept around along with the timestamp and in-game time. That way, if you accidentally quick save over something, you can just load up the one before that. If you accidentally load a quick save that goes too far back (and the game auto-saves), you can just load up an earlier auto save.\u003C/p\u003E\u003Cp\u003EIt lets you recover from mistakes while not slowing you down by having extra confirmations to click through or extra stuff to have to pay attention to. The only cost is a little bit of extra disk space.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-14T00:18:44Z\u0022 title=\u002212/14/2014 12:18  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 14, 2014\u003C/time\u003E by Empiro\u003C/strong\u003E\n\u003C/span\u003E\n"}]}