{"TopicId":92795,"ForumId":55,"TopicTitle":"Color Matching/Coloring Parts","CreatedByName":"DexonII","CreatedById":131832,"CreatedDateTime":"2014-12-14T08:08:32Z","PageNum":1,"Articles":[{"CreatedByName":"DexonII","CreatedById":131832,"CreatedDateTime":"2014-12-14T08:08:32Z","Content":"\n\u003Cp\u003EHi All,\u003C/p\u003E\u003Cp\u003E Been a long time reader of the forums, first time poster. \u003C/p\u003E\u003Cp\u003E I was wondering at some point way down the line if Squad would consider giving the option of coloring our creations in the VAB/SPH. I like to build aesthetically and it would be nice to have the parts color match, for instance, \u003C/p\u003E\u003Cp\u003Eif I use an orange tank and place an adapter above it, I would like to be able to right click and have an option to click color match with main part and voila the adapter is now orange or change the color to something else other than the default white/grey. \u003C/p\u003E\u003Cp\u003E Maybe right clicking a part could bring up a box with smaller colored tiles inside and you can choose a color to change your part to. Maybe 32, maybe 16, maybe 10 colors. A part that has black stripes could have two choices, a primary color and a secondary color for the stripe, now stripes don\u0027t have to be black. Not all parts should be colored, engine nozzles, wheels, struts, girders etc...\u003C/p\u003E\u003Cp\u003E Right clicking fuel tanks and engines brings up context windows to make changes to those parts already, having more right click clutter would be a pain, so perhaps a button on the right upper corner where the Load, SAVE, EXIT buttons are there could be a button that you would press to activate Part coloring ON/OFF, so you can click it on when you want to color parts, and and have it off when you want to right click parts to do the other things. \u003C/p\u003E\u003Cp\u003E Most people build massive ships, and wouldnt want to color 500 or more parts, so there could be an option to COLOR ALL in the context box, then individually change colors on parts as needed. Coloring could be tied to symmetry, so if you added 8 boosters all 8 can be colored the same or you can change to individual. \u003C/p\u003E\u003Cp\u003E Well I hope this was not too silly for my first topic. I was just thinking one day while I was building my rocket how I wanted that adapter to be orange like the tank, I even wanted a blue tank instead of orange.\u003C/p\u003E\u003Cp\u003E Anyways thanks for reading, you guys and gals are great.\u003C/p\u003E\n"},{"CreatedByName":"life_on_venus","CreatedById":28185,"CreatedDateTime":"2014-12-14T11:28:35Z","Content":"\n\u003Cp\u003EHi, I\u0027m not a member of Squad, but I know a mod that I think you might be interested in: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/50008\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/50008\u003C/a\u003E . It still works in 0.25, but sadly doesn\u0027t support some of the newer parts. Still, might be worth a try.\u003C/p\u003E\n"}]}