{"TopicId":93161,"ForumId":55,"TopicTitle":"Part-sorting \u0026 catalog logic in the VAB \u0026 SPH","CreatedByName":"AccidentalDisassembly","CreatedById":110936,"CreatedDateTime":"2014-12-16T19:44:19Z","PageNum":1,"Articles":[{"CreatedByName":"AccidentalDisassembly","CreatedById":110936,"CreatedDateTime":"2014-12-16T19:44:19Z","Content":"\n\u003Cp\u003EWhile most of the new interface in the VAB \u0026amp; SPH regarding sorting parts is great, some of the logic behind it is not. Here are a few suggestions:\u003C/p\u003E\u003Cp\u003E1. Advanced mode filters\u003C/p\u003E\u003Cp\u003ESorting by manufacturer is, for the moment, the best way to sort by mod (except via custom categories). However, manufacturer is meaningless \u003Cem\u003Eexcept \u003C/em\u003Ewhere mods are concerned. I note that there is some logical connection between Squad parts from the same manufacturer. However, there are \u003Cem\u003Eso many \u003C/em\u003Emanufacturers, many with only one part, and overlap between one manufacturer\u0027s \u0022domain\u0022 and others\u0027 that sorting Squad parts in this way is effectively pointless and counterproductive. The number of manufacturers also makes the list of subcategories extremely long. \u003C/p\u003E\u003Cp\u003ESuggestion: either change all Squad parts to the same manufacturer, or allow an additional option of sorting by mod (by folder within GameData) without asking users to set up a custom category for every mod (excruciatingly tedious, as noted below), ÃƒÂ  la part catalog, because the only function of sorting by manufacturer right now is to show all of one mod\u0027s parts on the same page(s) at the same time.\u003C/p\u003E\u003Cp\u003E2. Sorting of parts once you\u0027ve chosen something from the advanced menu\u003C/p\u003E\u003Cp\u003EIf there\u0027s no easy way to sort by mod, and assuming every mod maker lists the same manufacturer on all their parts, listing by manufacturer \u003Cem\u003Ealone \u003C/em\u003Eis not quite enough - in addition to Name, Mass, Cost, and Size, allow sorting of visible parts (as opposed to categorization) by function of the part. This way, a player can see \u003Cem\u003Eall \u003C/em\u003Ethe parts from a given mod at once, but sorted by what they are rather than their name. Sorting by name is useless for a very large number of parts named something like XMRQ923854P-2041B Thingamajig. Unless the user wants to memorize a very long list of part names, sorting by function (EDIT: by that I mean sorting according to classes that exist already, like fuel tanks, control, utility) is superior. Mass, Cost, Size are all great, though.\u003C/p\u003E\u003Cp\u003E3. Allow drag \u0026amp; drop \u003Cstrong\u003E\u003Cem\u003Emultiple\u003C/em\u003E\u003C/strong\u003E part selection in order to put stuff into custom categories\u003C/p\u003E\u003Cp\u003EParts in the VAB/SPH are represented by what are, for interface purposes, essentially icons like you would find on your desktop. They should follow the conventions of icons: click \u0026amp; drag over many of them selects them all, dragging them into a \u0022folder\u0022 (such as a custom category or sub-category in advanced mode) should copy them there. It\u0027s extremely - EXTREMELY - tedious to create custom categories by click on the plus in the upper right of the part icon and going through the whole selection \u0026amp; clicking process for every. single. part. you want to categorize.\u003C/p\u003E\u003Cp\u003EAnother edit: There needs to be a way to scroll through category \u0026amp; subcategory lists. I have more manufacturers with just a few mods going than there is vertical space for manufacturer icons in the list.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-16T21:34:35Z\u0022 title=\u002212/16/2014 09:34  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 16, 2014\u003C/time\u003E by AccidentalDisassembly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-16T20:03:10Z","Content":"\n\u003Cp\u003EI hoped that \u0022filter by function\u0022 would actually be filtering by \u003Cstrong\u003Efunction\u003C/strong\u003E, but the utility tab has all sorts of differently functioning parts in it. I\u0027d like them broken up a bit.\u003C/p\u003E\n"},{"CreatedByName":"AccidentalDisassembly","CreatedById":110936,"CreatedDateTime":"2014-12-16T20:04:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cpt. Kipard\u0022 data-cite=\u0022Cpt. Kipard\u0022\u003E\u003Cdiv\u003EI hoped that \u0022filter by function\u0022 would actually be filtering by \u003Cstrong\u003Efunction\u003C/strong\u003E, but the utility tab has all sorts of differently functioning parts in it. I\u0027d like them broken up a bit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed... at the least, though, allowing to sort the list (once you\u0027ve displayed all parts from a given mod, say) by the existing categories (fuel tank, engine, etc.) would be a step up...\u003C/p\u003E\n"}]}