{"TopicId":93229,"ForumId":55,"TopicTitle":"Give the LV-T30 some gimbal","CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-12-16T23:34:12Z","PageNum":1,"Articles":[{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-12-16T23:34:12Z","Content":"\n\u003Cp\u003EBack when the LV-T30 was introduced, its stats made (some) sense. You could only travel around Kerbin, maybe try to get in orbit. A realistic range of engines wasn\u0027t needed, so having an engine that gave you thrust vectoring and one that didn\u0027t was okay. Using the T30 on its own made for some fun crashes, entertaining people, and when combined with a T-45 for some control it had a bit of use to get you into orbit.\u003C/p\u003E\u003Cp\u003EThen the rest of the updates came and changed the entire game, from a simple crash tool to a space exploration game complete with a whole solar system and technogical progression. Yet, the T-30 barely got any attention. As a result it\u0027s not getting a lot of use from me. The lack of thrust vectoring means it\u0027s useless on its own, especially when it\u0027s the engine doing the gravity turn. The rest of the stats are fine, making it a more powerful first stage rocket to complement the upper stage T45 and the vacuum-specialized LV-909 engine. But without a bit of control of its own, it only gets a role as a supporting engine with control surfaces and/or vectoring engines providing rocket control.\u003C/p\u003E\u003Cp\u003EAside from nostalgia, I see little basis to keep its lack of thrust vectoring. Virtually all rockets (even SRBs) have some gimbal-like control mechanism, whether it be an actual gimbal or thrust vanes (ex. V2 rocket, Mercury-Redstone). It\u0027d also make it a more interesting engine for early career mode, as it would make it easier for new players to handle liquid-fueled rockets (otherwise they have to wait till the LV-T45) and it\u0027d make those early 1.25m designs more interesting. For more experienced players it would also gain more uses.\u003C/p\u003E\u003Cp\u003EIn conclusion, I suggest adding some (limited) gimbal/thrust vectoring to the LV-T30. Added: to offset the similarity between the growing similarity that the T45 and T30 will have with a gimballed T30, I suggest also changing the Isp of one of the engines. A lower Isp for the T30 is the most logical choice. This would also place it more in line of other first stage engines like the Mainsail or the 25x4.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T14:36:30Z\u0022 title=\u002212/17/2014 02:36  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by CaptRobau\u003C/strong\u003E\n\u003Cbr\u003EClarification\n\u003C/span\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-12-17T00:05:55Z","Content":"\n\u003Cp\u003EIf the LV-T30 gets thrust vectoring, we need some way to differentiate the more advanced LV-T45 from it. Then we\u0027ll probably have to rebalance the Poodle somehow, which in turn may force us to reconsider the stats of many other engines.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-12-17T00:53:08Z","Content":"\n\u003Cp\u003EGive the T30 lower Isp and it\u0027s solved. Then it\u0027ll be like any other lower stage engine: highest TWR of its size (already the case with the T30), but lower Isp. The T45 will then remain the second/upper stage engine it\u0027s often used as.\u003C/p\u003E\n"},{"CreatedByName":"GateCrasherVI","CreatedById":59667,"CreatedDateTime":"2014-12-17T02:46:58Z","Content":"\n\u003Cp\u003EIsn\u0027t a T30 with lower ISP and gimbaling basically just a T45?\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-12-17T02:58:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EIf the LV-T30 gets thrust vectoring, we need some way to differentiate the more advanced LV-T45 from it. Then we\u0027ll probably have to rebalance the Poodle somehow, which in turn may force us to reconsider the stats of many other engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe game as a whole needs a good thorough balance pass. Squad has to know this the way we gripe about it. I\u0027d say expect to see one come during beta. That said, if we wanna help them out, we should have a discussion, and compile a full list of rebalances that work well together (rather than just recording all ideas and making the devs sort through that mess).\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-12-17T03:03:12Z","Content":"\n\u003Cp\u003ENot having gimbaling is the point of the LV-T30. If you remove that property, you might as well remove the engine, or the LV-T45- as Jouni says, it will be just like the LV-T45.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T08:43:37Z\u0022 title=\u002212/17/2014 08:43  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TKO","CreatedById":20719,"CreatedDateTime":"2014-12-17T03:46:32Z","Content":"\n\u003Cp\u003EI have to agree with @Tw1 here -- if you add a gimbal to the LV-T30, it\u0027s very close to being an LV-T45, so why not just remove it? \u003C/p\u003E\u003Cp\u003EThat said, I do use the LV-T30 on occasion. (Usually on radial tanks, when I have a larger mainsail or skipper powered central tank.) I still find it useful. I think it should stay.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-12-17T08:43:26Z","Content":"\n\u003Cp\u003EA T30 with gimballing and worse Isp is to the T45 what the Mainsail is to the Skipper. Those are clearly different and don\u0027t need to be removed. With the changes mentioned, the Mainsail/T30 are the higher TWR/lower Isp first stage engines. The Skipper/T45 would are the lower TWR/higher Isp upper stage engines.\u003C/p\u003E\n"},{"CreatedByName":"King Arthur","CreatedById":73849,"CreatedDateTime":"2014-12-17T09:32:36Z","Content":"\n\u003Cp\u003EIt\u0027s as simple as just using the T45 (or combining the two) if you need vectoring. The lack of vectoring on the T30 is a non-issue early in career mode since your rockets will be small and easy to push one way or another anyway; going larger and later the T30\u0027s lack of gimballing and higher TWR make it shine as a booster or supporting core engine in launchers.\u003C/p\u003E\u003Cp\u003EMost of the stock parts need a thorough rebalance at some point, but the LV-T30\u0027s pretty low priority on the list as far as that is concerned.\u003C/p\u003E\n"},{"CreatedByName":"impyre","CreatedById":116031,"CreatedDateTime":"2014-12-17T11:48:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022King Arthur\u0022 data-cite=\u0022King Arthur\u0022\u003E\u003Cdiv\u003EIt\u0027s as simple as just using the T45 (or combining the two) if you need vectoring. The lack of vectoring on the T30 is a non-issue early in career mode since your rockets will be small and easy to push one way or another anyway; going larger and later the T30\u0027s lack of gimballing and higher TWR make it shine as a booster or supporting core engine in launchers.\u003Cp\u003EMost of the stock parts need a thorough rebalance at some point, but the LV-T30\u0027s pretty low priority on the list as far as that is concerned.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s funny you say that, because I actually use them the other way around. I use the 30 as the main engine and the 45\u0027s as the boosters. You need gimbal most when you\u0027re at your heaviest and in the thickest part of the atmosphere, so I use the 45\u0027s to add that lil bit of extra thrust and control. Once I get lighter and higher I ditch the 45\u0027s, by this point i\u0027m high enough and light enough that the 30 is enough by itself. (at least this works well on smaller launch vehicles)\u003C/p\u003E\n"},{"CreatedByName":"Vaporo","CreatedById":110800,"CreatedDateTime":"2014-12-17T12:19:25Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/LV-T30_Liquid_Fuel_Engine\u0022 rel=\u0022external nofollow\u0022\u003EStats of the LV-T30\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/LV-T45_Liquid_Fuel_Engine\u0022 rel=\u0022external nofollow\u0022\u003EStats of the LV-T45\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs far as I can tell, the only differences between the two engines are:\u003C/p\u003E\u003Cp\u003EThrust vectoring\u003C/p\u003E\u003Cp\u003ESlight thrust difference\u003C/p\u003E\u003Cp\u003ESlight weight difference\u003C/p\u003E\u003Cp\u003ESlight ElectricCharge generation difference\u003C/p\u003E\u003Cp\u003ECost\u003C/p\u003E\u003Cp\u003EAs it is, they already feel very similar to me. Lack of gimballing is the main thing that differentiates between the two engines. If you add gimballing to the LV-T30, you essentially get rid of any reason to use the LV-T45, as all its stats are worse than the T30\u0027s except for gimballing. The two are fine as it is, I think. You can have gimballing and slightly reduced engine performance, or no gimballing with slightly increased performance.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2014-12-17T14:38:50Z","Content":"\n\u003Cp\u003EAn Isp reduction for the T30 would differentiate it again from the T45 and bring it more in line with other first stage engines like the Mainsail or KS-25x4.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2014-12-17T15:10:42Z","Content":"\n\u003Cp\u003EI figure we should actually remove thrust vectoring from some of the engines:\u003C/p\u003E\u003Cp\u003E * the 48-7S\u003C/p\u003E\u003Cp\u003E * the Mainsail\u003C/p\u003E\u003Cp\u003E * the KS-25x4\u003C/p\u003E\u003Cp\u003EAll three of those engines are plenty good enough without it, and not having it would not only differentiate them from other engines, but it would help to push people to find other ways to control their rockets. You give people too many training wheels, and they never learn that walking is possible.\u003C/p\u003E\n"},{"CreatedByName":"Darnok","CreatedById":85708,"CreatedDateTime":"2014-12-17T15:35:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vaporo\u0022 data-cite=\u0022Vaporo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs it is, they already feel very similar to me. Lack of gimballing is the main thing that differentiates between the two engines. If you add gimballing to the LV-T30, you essentially get rid of any reason to use the LV-T45, as all its stats are worse than the T30\u0027s except for gimballing. The two are fine as it is, I think. You can have gimballing and slightly reduced engine performance, or no gimballing with slightly increased performance.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed, IMHO it would be awesome to make it tweakable, so you could choose from different versions of same engine...\u003C/p\u003E\u003Cp\u003ESimple way with two options for EVERY engine in game \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E- add vectoring\u003C/p\u003E\u003Cp\u003E- lower thrust (5-15%)\u003C/p\u003E\u003Cp\u003E- larger weight (0.5-1.0t)\u003C/p\u003E\u003Cp\u003E- higher costs\u003C/p\u003E\u003Cp\u003Eor\u003C/p\u003E\u003Cp\u003E- no vectoring\u003C/p\u003E\u003Cp\u003E- better thrust\u003C/p\u003E\u003Cp\u003E- lower weight\u003C/p\u003E\u003Cp\u003E- lower costs.\u003C/p\u003E\u003Cp\u003EOR make it more complicated with many options where we can tweak many engine stats \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E- vectoring (y/n)\u003C/p\u003E\u003Cp\u003E- thrust (80%-120% of current thrust)\u003C/p\u003E\u003Cp\u003E- weight (also \u002B/- some value)\u003C/p\u003E\u003Cp\u003ENow for example I want something with shape of LV-T45, but I don\u0027t need vectoring, I need largest thrust it can give me... after I am done with tweaks game should calculate weight and costs changes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt would be great for carrier mode as representation of technological progress.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-12-17T16:47:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thereaverofdarkness\u0022 data-cite=\u0022thereaverofdarkness\u0022\u003E\u003Cdiv\u003EI figure we should actually remove thrust vectoring from some of the engines:\u003Cp\u003E * the 48-7S\u003C/p\u003E\u003Cp\u003E * the Mainsail\u003C/p\u003E\u003Cp\u003E * the KS-25x4\u003C/p\u003E\u003Cp\u003EAll three of those engines are plenty good enough without it, and not having it would not only differentiate them from other engines, but it would help to push people to find other ways to control their rockets. You give people too many training wheels, and they never learn that walking is possible.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI could agree with removing thrust vectoring from the 48-7S, but not from the other two. The Mainsail and the KS-25x4 are sustainer engines for large rockets. Such rockets can\u0027t really be controlled with reaction wheels or RCS, so they need thrust vectoring. Furthermore, it\u0027s usually a better idea to use thrust vectoring in the sustainer engine and to disable it in the boosters than the other way around, as this reduces the amount of strutting the boosters require.\u003C/p\u003E\n"},{"CreatedByName":"orangexception","CreatedById":72566,"CreatedDateTime":"2014-12-17T21:05:30Z","Content":"\n\u003Cp\u003EThe LV-T30 is one of the best engines in the game. It\u0027s already fantastic.\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2014-12-18T05:27:30Z","Content":"\n\u003Cp\u003EIf anything, the LV-T30 would have a higher specific impulse than the T45 due to its larger engine bell. I think it would be better just to increase the gimbal range of the T45 and make the T30 more expensive.\u003C/p\u003E\n"}]}