{"TopicId":93312,"ForumId":55,"TopicTitle":"Sandbox SAS: Should it be limited like Career?","CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-17T06:34:16Z","PageNum":1,"Articles":[{"CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-17T06:34:16Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EIn 0.90.0 all sandbox games both new and old enable ALL SAS functions for all craft, regardless of probe core or Kerbal specialization (eg. The Stayputnik and an engineer Kerbal have ZERO SAS in career, but full access to it in sandbox).\u003C/p\u003E\u003Cp\u003EI was personally surprised by this feature, and my immediate reaction is that it was accidentally done by the devs. If this is the case then I hope this thread helps alerts them to the issue so they can fix it as they are (thankfully) known to do (all hail the mighty Squad).\u003C/p\u003E\u003Cp\u003EHowever if this was in fact an intended feature, I find it out of place and a bit in-congruent as it makes sandbox and career different in a large, and in my opinion, unnecessary way.\u003C/p\u003E\u003Cp\u003ESo I made this post and poll (my first poll, hopefully I don\u0027t mess it up) to learn what everyone else thinks of this feature, please put your opinion in a comment \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor example some may just want all Kerbals to be able to do all functions in sandbox because they may only want to take one Kerbal on a mission and have access to both pilot and engineer (scientist is pretty redundant in sandbox), and that\u0027s a totally valid point.\u003C/p\u003E\u003Cp\u003EI would reply by saying that to do so would be like having your landing legs and parachute as one part, and that having them perform both functions because it is easier violates the point of game balance and challenge, or that the same could be said for career but the system is implemented fully there.\u003C/p\u003E\u003Cp\u003EMy goal here is to find out where the majority of people sit on this and hopefully hear some good arguments for why the system should stay as it is (I can\u0027t think of any \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\u003Cp\u003ETo avoid making this post too long I will say more in a comment below \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECas.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T00:58:45Z\u0022 title=\u002212/18/2014 12:58  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by Carsogen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2014-12-17T06:43:36Z","Content":"\n\u003Cp\u003EI like the idea of classes, even in Sandbox.\u003C/p\u003E\n"},{"CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-17T06:46:31Z","Content":"\n\u003Cp\u003E*Continued from above*\u003C/p\u003E\u003Cp\u003EFirst off let me just say that I think all Kerbals being automatically lvl 5 is good.\u003C/p\u003E\u003Cp\u003EThe only reason I can think of for allowing all probes and Kerbals to have all skills in sandbox (pilots and scientists can also repair rover wheels) is that implementing the full system may possibly mess up old sandbox saves, for example if you have some huge ongoing mission that suddenly has no SAS at all because you brought an engineer. While this would be VERY annoying, the same could be said for career, and yet the full system with restrictions is present there.\u003C/p\u003E\u003Cp\u003EWould it be possible to get around this by having the new system only affect new craft or new saves? I know that Squad wants to avoid this because when they brought in PorkJet\u0027s Mk2 parts all craft in flight ended up with wonky parts. I see their reasoning for not wanting multiple copies of parts eating up memory, but the part version with limited SAS is already in career, so there would be no extra part bloat.\u003C/p\u003E\u003Cp\u003EThis would allow new missions to be planned with the new system in mind but also leave old ones unaffected, and solves the issue of back-compatibility, although there may be some programming/computational reason why this is not possible and it may have already been considered by Sqaud, I have no idea.\u003C/p\u003E\u003Cp\u003EMy main question is why are the limitations on functions not based on probe or Kerbal skill as they are in career? I can honestly not think of a reason except the one above, and that\u0027s why I made this post. Please can everyone help shed some light on the issue and provide their feedback, thanks\u003C/p\u003E\u003Cp\u003ECas.\u003C/p\u003E\n"},{"CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-17T07:05:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klgraham1013\u0022 data-cite=\u0022klgraham1013\u0022\u003E\u003Cdiv\u003EI like the idea of classes, even in Sandbox.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI completely agree, the classes add so much depth to the game, and I feel like it\u0027s a loss to Sandbox if they\u0027re not included.\u003C/p\u003E\u003Cp\u003Ecas.\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-12-17T07:10:04Z","Content":"\n\u003Cp\u003EIt doesn\u0027t really bother me. After I unlock all the cores I\u0027ll probably mod the game so that all the cores have all the functions anyway.\u003C/p\u003E\n"},{"CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-17T07:15:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theend3r\u0022 data-cite=\u0022theend3r\u0022\u003E\u003Cdiv\u003EIt doesn\u0027t really bother me. After I unlock all the cores I\u0027ll probably mod the game so that all the cores have all the functions anyway.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour job would be made much easier if it was a setting in the game (wink-wink poll *cough* \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003Cp\u003EIf people really wanted they could change a setting (if it\u0027s put in) or mod the probes to perform all functions.\u003C/p\u003E\u003Cp\u003EAnd let\u0027s remember that the only time the new system detrimentally affects sandbox with relation to pre-beta is when using the Stayputnik or no pilot at all. All other probes and even new pilots have access to the traditional SAS functions.\u003C/p\u003E\u003Cp\u003EThanks or your reply!\u003C/p\u003E\u003Cp\u003ECas,\u003C/p\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2014-12-17T07:24:02Z","Content":"\n\u003Cp\u003EI don\u0027t care too much about the SAS I the capsules, but more about the reaction troque in some of the probe cores. There should at least be \u003Cem\u003Esome\u003C/em\u003E troque-- no matter how miniscule, it\u0027ll still be better than having none. Most of my probes from old saves are now obsolete because I can\u0027t change their attitude. Months worth of work gone. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll probe cores should have a reaction troque of at least 0.1kN/m so we can at least change the attitude of our small probes without twitchy external reaction wheels or heavy and overpowered RCS.\u003C/p\u003E\u003Cp\u003EAnyone with we?\u003C/p\u003E\n"},{"CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-17T07:37:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Giggleplex777\u0022 data-cite=\u0022Giggleplex777\u0022\u003E\u003Cdiv\u003EI don\u0027t care too much about the SAS I the capsules, but more about the reaction troque in some of the probe cores. There should at least be \u003Cem\u003Esome\u003C/em\u003E troque-- no matter how miniscule, it\u0027ll still be better than having none. Most of my probes from old saves are now obsolete because I can\u0027t change their attitude. Months worth of work gone. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003Cp\u003EAll probe cores should have a reaction troque of at least 0.1kN/m so we can at least change the attitude of our small probes without twitchy external reaction wheels or heavy and overpowered RCS.\u003C/p\u003E\u003Cp\u003EAnyone with we?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wasn\u0027t aware that they had removed SAS from probes but now looking at the part list on the wiki I see that yes, they have indeed done so. This also baffles me, if they are willing to implement this change/restriction on probe cores in sandbox, why not the rest of this new whiz-bang functionality that they have inexplicably left out?\u003C/p\u003E\u003Cp\u003EI personally like the idea of differentiating between the probe cores in ways other than size (torque capability included) and this is part of my belief that the whole SAS restriction system should be in sandbox, but I see your point as to it breaking ongoing missions (as mentioned above \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E). It seems as if the rest of the system has been left out to avoid this issue and yet the torque change still applies, which leads me to believe that back-compatibility may not be Squad\u0027s motivation on the issue. I can\u0027t for the life of me however think of any other motivation.\u003C/p\u003E\u003Cp\u003EI have actually just thought of another possible solution: have the restrictions still apply to probe cores, but allow Kerbals to do all other functions regardless of skill. This would allow all previous functionality (repack/repair/SAS) and still keep the depth and variation of the new system. This seems to me like it would work as the probes are honestly quite interchangeable, and this solution would provide maximum play-ability while still retaining the core of the new system.\u003C/p\u003E\u003Cp\u003ECas.\u003C/p\u003E\n"},{"CreatedByName":"Avalon304","CreatedById":68304,"CreatedDateTime":"2014-12-17T07:42:36Z","Content":"\n\u003Cp\u003ESAS should not be limited in Sandbox games... (or there should be an option). I would probably stop playing KSP all together if I had to worry about this...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI would reply by saying that to do so would be like having your landing legs and parachute as one part, and that having them perform both functions because it is easier violates the point of game balance and challenge\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats a great argument... except that \u0027game balance\u0027 and \u0027challenge\u0027 do not belong in Sandbox. Sandbox is exactly what its supposed to be \u0027Space Legos\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-17T08:10:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avalon304\u0022 data-cite=\u0022Avalon304\u0022\u003E\u003Cdiv\u003ESandbox is exactly what its supposed to be \u0027Space Legos\u0027.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have to say I don\u0027t think I\u0027ve ever heard two amazing things work together better than space and legos, which is possibly the reason why KSP is so loved by me and many others (and I assume you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E).\u003C/p\u003E\u003Cp\u003EI see your point, there is something to be said for just throwing a command module on a rocket and it working as intended and as it always has, regardless of who or what is flying it. Simplicity is key, I agree.\u003C/p\u003E\u003Cp\u003EThat is why I reckon at the very least Kerbals should have all pilot and engineer skills, but probe cores should have the limitations still applied. It\u0027s easy to interchange probe parts, and this would allow for challenges like \u0022get to the moon with no SAS\u0022 would be possible now, by selecting a probe with no SAS and not taking a pilot.\\\u003C/p\u003E\u003Cp\u003EIt seems to me that the best way to appease everyone is to have a setting in sandbox that turns the SAS restrictions for probes and Kerbals on and off, that way the people who just want to get on with it without worrying about piloting can do just that, and those that want the consistency and challenge to be universal across game modes are happy too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003ECas.\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-12-17T08:15:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Giggleplex777\u0022 data-cite=\u0022Giggleplex777\u0022\u003E\u003Cdiv\u003EI don\u0027t care too much about the SAS I the capsules, but more about the reaction troque in some of the probe cores. There should at least be \u003Cem\u003Esome\u003C/em\u003E troque-- no matter how miniscule, it\u0027ll still be better than having none. Most of my probes from old saves are now obsolete because I can\u0027t change their attitude. Months worth of work gone. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003Cp\u003EAll probe cores should have a reaction troque of at least 0.1kN/m so we can at least change the attitude of our small probes without twitchy external reaction wheels or heavy and overpowered RCS.\u003C/p\u003E\u003Cp\u003EAnyone with we?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy memory may be failing me but I think that is how it worked in the past and I prefer it that way. Probe cores are just computers. Does your computer have reaction wheels?\u003C/p\u003E\n"},{"CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-17T08:26:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theend3r\u0022 data-cite=\u0022theend3r\u0022\u003E\u003Cdiv\u003EMy memory may be failing me but I think that is how it worked in the past and I prefer it that way. Probe cores are just computers. Does your computer have reaction wheels?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t remember ever sending up a probe and then realising it had no torque, but maybe by chance I never used any of the ones without. I also think it\u0027s better with more differentating probe cores than just size, but the potential to kill old save ships is still there. And couldn\u0027t cooling fans be used as reaction wheels? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Crimson Sunrise","CreatedById":132102,"CreatedDateTime":"2014-12-17T15:39:51Z","Content":"\n\u003Cp\u003EWell....\u003C/p\u003E\u003Cp\u003EIf you have limiting features on sandbox mode, then it\u0027s not really a sandbox mode, is it? Some people just want to fly their vessels without having to worry about limitations, otherwise they would be playing career mode instead, wouldn\u0027t they?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-17T15:44:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avalon304\u0022 data-cite=\u0022Avalon304\u0022\u003E\u003Cdiv\u003EThats a great argument... except that \u0027game balance\u0027 and \u0027challenge\u0027 do not belong in Sandbox.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFunny that, we had discussions of balance and challenge long before career mode was even a thing.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2014-12-17T16:04:42Z","Content":"\n\u003Cp\u003EI\u0027d like to have options to enable/disable things in sandbox, allowing you to tweak just how unlocked it is. There\u0027s plenty of room for more options in that custom window...\u003C/p\u003E\n"},{"CreatedByName":"Avalon304","CreatedById":68304,"CreatedDateTime":"2014-12-18T00:22:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EFunny that, we had discussions of balance and challenge long before career mode was even a thing.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen theres only one mode there have to be those discussions. There are now multiple modes of gameplay. In Career \u0027game balance\u0027 and \u0027challenge\u0027 have a place. They have no place in Sandbox mode. Period. Sand box mode is literally space legos. Slap a ship together, put a crew in it (if needed), and have it just work.\u003C/p\u003E\n"},{"CreatedByName":"Carsogen","CreatedById":120905,"CreatedDateTime":"2014-12-18T00:52:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crimson Sunrise\u0022 data-cite=\u0022Crimson Sunrise\u0022\u003E\u003Cdiv\u003EIf you have limiting features on sandbox mode, then it\u0027s not really a sandbox mode, is it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve always thought of sandbox mode as what career will get to in the end.\u003C/p\u003E\u003Cp\u003EWhen you\u0027ve unlocked all parts and have no need for science, exhausted all contracts and trained some ridiculous number of Kerbals so high that their children are level 5 pilots, it\u0027s basically a shortcut to all the stuff unlocked at the end of the game.\u003C/p\u003E\u003Cp\u003EFor most games this would get boring very soon, but the beauty of KSP is that you can play FOREVER in sandbox and it\u0027s still an amazing and fun game.\u003C/p\u003E\u003Cp\u003EThis is where I think the problem is with the current system: It makes sandbox NOT the end of the game, it changes it fundamentally.\u003C/p\u003E\u003Cp\u003EI think the fact that all Kerbals are automatically level 5 allows for sandbox to continue unhindered while if the SAS restrictions remain in place it would keep sandbox true to being the end game of career.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avalon304\u0022 data-cite=\u0022Avalon304\u0022\u003E\u003Cdiv\u003EIn Career \u0027game balance\u0027 and \u0027challenge\u0027 have a place. They have no place in Sandbox mode.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course they still have a place, it would be crazy to not have stuff balanced and a challenge in place. If that weren\u0027t the case then why not just double the nuke\u0027s thrust and increase its vacuum Isp ABOVE its vacuum?\u003C/p\u003E\u003Cp\u003EI\u0027m honestly surprised that people who prefer sandbox over career aren\u0027t really mad about this situation, it\u0027s a whole new feature that they\u0027ve just been denied from using! If a new resource system (maybe if we say it enough it\u0027ll happen:P) was brought in and kept out of sandbox there would be rioting in the street!\u003C/p\u003E\u003Cp\u003ECas.\u003C/p\u003E\n"},{"CreatedByName":"Crimson Sunrise","CreatedById":132102,"CreatedDateTime":"2014-12-18T01:23:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Carsogen\u0022 data-cite=\u0022Carsogen\u0022\u003E\u003Cdiv\u003EI\u0027ve always thought of sandbox mode as what career will get to in the end.\u003Cp\u003EWhen you\u0027ve unlocked all parts and have no need for science, exhausted all contracts and trained some ridiculous number of Kerbals so high that their children are level 5 pilots, it\u0027s basically a shortcut to all the stuff unlocked at the end of the game.\u003C/p\u003E\u003Cp\u003EFor most games this would get boring very soon, but the beauty of KSP is that you can play FOREVER in sandbox and it\u0027s still an amazing and fun game.\u003C/p\u003E\u003Cp\u003EThis is where I think the problem is with the current system: It makes sandbox NOT the end of the game, it changes it fundamentally.\u003C/p\u003E\u003Cp\u003EI think the fact that all Kerbals are automatically level 5 allows for sandbox to continue unhindered while if the SAS restrictions remain in place it would keep sandbox true to being the end game of career.\u003C/p\u003E\u003Cp\u003EOf course they still have a place, it would be crazy to not have stuff balanced and a challenge in place. If that weren\u0027t the case then why not just double the nuke\u0027s thrust and increase its vacuum Isp ABOVE its vacuum?\u003C/p\u003E\u003Cp\u003EI\u0027m honestly surprised that people who prefer sandbox over career aren\u0027t really mad about this situation, it\u0027s a whole new feature that they\u0027ve just been denied from using! If a new resource system (maybe if we say it enough it\u0027ll happen:P) was brought in and kept out of sandbox there would be rioting in the street!\u003C/p\u003E\u003Cp\u003ECas.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair enough. However, that goes against the definition of what a sandbox is software wise.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-18T01:58:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Avalon304\u0022 data-cite=\u0022Avalon304\u0022\u003E\u003Cdiv\u003EWhen theres only one mode there have to be those discussions. There are now multiple modes of gameplay. In Career \u0027game balance\u0027 and \u0027challenge\u0027 have a place. They have no place in Sandbox mode. Period. Sand box mode is literally space legos. Slap a ship together, put a crew in it (if needed), and have it just work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, but your opinion is not fact. Period. There is challenge in sandbox, the same challenge there has always been: To build and fly spacecraft. It just lacks the \u003Cem\u003Eadditional\u003C/em\u003E challenge of science, funding, etc. There is balance in sandbox, in that the tradeoffs between different component choices are fairly even. If there was no challenge or balance in sandbox people wouldn\u0027t find it fun to play, and many do.\u003C/p\u003E\u003Cp\u003EAlso, sandbox is not literally space lego. \u003Ca href=\u0022http://img1.wikia.nocookie.net/__cb20090903153723/lego/images/3/3d/Classic_Space_1979.jpg\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E is literally space lego.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T02:20:41Z\u0022 title=\u002212/18/2014 02:20  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003Cbr\u003ETypo fixed.\n\u003C/span\u003E\n"},{"CreatedByName":"Crimson Sunrise","CreatedById":132102,"CreatedDateTime":"2014-12-18T02:17:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ESorry, but your opinion is not fact. Period. There is challenge in sandbox, the same challenge there has always been: To build and fly spacecraft. It just lacks the \u003Cem\u003Eadditional\u003C/em\u003E challenge of science, funding, etc. There is balance in sandbox, in that the tradeoffs between different component choices are fairly even. If there was no challenge or balance in snadbox people wouldn\u0027t find it fun to play, and many do.\u003Cp\u003EAlso, sandbox is not literally space lego. \u003Ca href=\u0022http://img1.wikia.nocookie.net/__cb20090903153723/lego/images/3/3d/Classic_Space_1979.jpg\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E is literally space lego.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpeaking for myself only, career mode has been confusing for me since it was introduced, so I only play the sandbox mode. Since I most often casually do vessels to play with, I have a vested interest in not having the confusion of career mode interfering with my sandbox playing.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2014-12-18T02:20:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Giggleplex777\u0022 data-cite=\u0022Giggleplex777\u0022\u003E\u003Cdiv\u003EI don\u0027t care too much about the SAS I the capsules, but more about the reaction troque in some of the probe cores. There should at least be \u003Cem\u003Esome\u003C/em\u003E troque-- no matter how miniscule, it\u0027ll still be better than having none. Most of my probes from old saves are now obsolete because I can\u0027t change their attitude. Months worth of work gone. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003Cp\u003EAll probe cores should have a reaction troque of at least 0.1kN/m so we can at least change the attitude of our small probes without twitchy external reaction wheels or heavy and overpowered RCS.\u003C/p\u003E\u003Cp\u003EAnyone with we?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey removed all torque from some of the probe cores? This is a very bad thing. I have a lot of small communication satellites that have OKTO2 probe cores...and now those satellites are adrift with no way to control their attitude. This makes me unhappy. The satellites I have the OKTO2 probe cores on a rather small...so a tiny bit of torque would save them. I agree that all probe cores should have at least 0.1kN/m of torque.\u003C/p\u003E\u003Cp\u003EThe whole thing about changing what the different probe cores can do makes me unhappy. The difference between the HECS and OKTO and QBE cores was the symmetry of the attachment points, and you could use the one that fit best for whatever you were building. This is no longer the case, and so I am sad again.\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2014-12-18T10:24:47Z","Content":"\n\u003Cp\u003EIt should at least be a difficultly option in sandbox. I\u0027d rather have all functions available.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-12-18T10:45:47Z","Content":"\n\u003Cp\u003EI would say no, as that would defeat one of the main things about sandbox which is that it is supposed to be the state of play where you have all the best abilities of a career game.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Carsogen\u0022 data-cite=\u0022Carsogen\u0022\u003E\u003Cdiv\u003EI\u0027m honestly surprised that people who prefer sandbox over career aren\u0027t really mad about this situation, it\u0027s a whole new feature that they\u0027ve just been denied from using!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENobody has been denied the use of any feature. What you are complaining about is that sandbox has no restrictions or limits on the feature, the same as always, the same as every sandbox.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T10:49:29Z\u0022 title=\u002212/18/2014 10:49  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by John FX\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-18T10:50:48Z","Content":"\n\u003Cp\u003ENah, some people prefer the look of Stayputnik as a satellite, so sandbox would be the only way for them to have a stayputnik that is fitting to their design and still fly decently. At the least, give them an option to use them like that.\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2014-12-18T19:47:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003ENah, some people prefer the look of Stayputnik as a satellite, so sandbox would be the only way for them to have a stayputnik that is fitting to their design and still fly decently. At the least, give them an option to use them like that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot such a bad idea, why not have the functions of a pod be tweakable in sandbox? Then you can have one that does everything in the shape you want.\u003C/p\u003E\n"}]}