{"TopicId":93558,"ForumId":55,"TopicTitle":"Reducing the Grind","CreatedByName":"DAVIDESCOTT","CreatedById":77876,"CreatedDateTime":"2014-12-18T18:06:41Z","PageNum":1,"Articles":[{"CreatedByName":"DAVIDESCOTT","CreatedById":77876,"CreatedDateTime":"2014-12-18T18:06:41Z","Content":"\n\u003Cp\u003EIMHO the game is just too grindy, especially early on (and as a result I\u0027ve yet to enjoy a career mode game long enough to get to the late game). The things I don\u0027t like are:\u003C/p\u003E\u003Cp\u003E1. The science click-fest (New biome, EVA report, Store report, wait...).\u003C/p\u003E\u003Cp\u003E2. Repeated launchings of identical craft (Launch 1: goo capsule report on the pad. Launch 2: goo capsule at 10,000m. Launch 3: goo at 30,000m. etc..).\u003C/p\u003E\u003Cp\u003E3. Special purpose craft for particular contracts (ie part testing).\u003C/p\u003E\u003Cp\u003ESo to that end the changes I would make are the following:\u003C/p\u003E\u003Cp\u003E1. Science points automatically accrue whenever you pass through a new biome/research area. Yes that means a munshot could come back with a ton of science points and almost exhaust the entire mun. That is fine by me, just reduce the number of points available from the mun to achieve balance. Exhausting planets will force players to move on to the next objective and make real progress in the game.\u003C/p\u003E\u003Cp\u003E2. Science experiments can hold as many results as they need and can all be reset. No more single use goo canisters.\u003C/p\u003E\u003Cp\u003E3. Replace part testing contracts with something like: \u0022Kerbodyne is offering 3 free landing legs for a mun lander. Contract is meet when the legs are landed on the mun, and future versions of those legs will be 5% cheaper and 5% lighter weight.\u0022 Contracts for decouplers would be satisfied when used in space, but eliminate the limitations on altitude and speed which force you to make special purpose craft for particular testing purposes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T18:08:50Z\u0022 title=\u002212/18/2014 06:08  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by DAVIDESCOTT\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-12-18T18:12:28Z","Content":"\n\u003Cp\u003EThe mode you play on has a big impact on this, playing on hard will be more \u0022grindy\u0022 than lower difficulty settings, players are able to tailor many settings to their tastes before that start.\u003C/p\u003E\u003Cp\u003EIn later updates there will be more added to the game and there will be many balancing passes, so please don\u0027t write off career as too grindy just yet \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DAVIDESCOTT","CreatedById":77876,"CreatedDateTime":"2014-12-18T18:20:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003EThe mode you play on has a big impact on this, playing on hard will be more \u0022grindy\u0022 than lower difficulty settings, players are able to tailor many settings to their tastes before that start.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve tried it on both hard and easy. It feels grindy to me either way. A big part of that is that I really don\u0027t want to take on half the contracts that are offered, because they feel neither realistic or enjoyable. My reactions tend to be either:\u003C/p\u003E\u003Cp\u003EA. You want me to trigger a decoupler on the pad? Why am I doing this again?! What possible sense of accomplishment would I feel there?\u003C/p\u003E\u003Cp\u003Eor \u003C/p\u003E\u003Cp\u003EB. You want me to start the largest SRB available between 62,000 and 70,000m and at a speed of between 400 and 500m/s. The only way I could do that is with a special purpose craft or a large airplane. Since I don\u0027t have plane parts it has to be the former... in which case the largest rockets I have will only allow me to get an empty SRB up to that altitude at that controlled speed. Why am I doing this again?! How does this move me along towards my goals?\u003C/p\u003E\u003Cp\u003ESo on easy I have to repeat a bunch of stuff I know how to do, to get overpowered rewards and finish the tree out without lifting a finger. On hard I have to do a bunch of stuff I don\u0027t want to do to keep a positive balance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-18T18:22:46Z\u0022 title=\u002212/18/2014 06:22  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 18, 2014\u003C/time\u003E by DAVIDESCOTT\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frank327","CreatedById":115926,"CreatedDateTime":"2014-12-18T20:09:58Z","Content":"\n\u003Cp\u003EI think that\u0027s also where reputation kicks in. If you don\u0027t sacrifice your repuation in the admin building you get really difficult and profitable contracts. Once you dump your reputation to get some extra cash/science, suddenly you get only cheap and easy contracts.\u003C/p\u003E\n"}]}