{"TopicId":93694,"ForumId":55,"TopicTitle":"Aero Revamp: What do You Want to See?","CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-12-19T16:16:09Z","PageNum":6,"Articles":[{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-12-25T15:47:46Z","Content":"\n\u003Cp\u003EPersonally I prefer FAR out of the various aerodynamics mods, though I would not recommend either it or NEAR for newer players. As such, I also am in the camp that\u0027s hoping for SQUAD\u0027s improved implementation of aerodynamics to be something of its own. Particularly given that there\u0027s no stock fairings (procedural or otherwise), FAR or NEAR would be \u003Cem\u003Every\u003C/em\u003E poor choices.\u003C/p\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2014-12-25T15:52:36Z","Content":"\n\u003Cp\u003EI hope they add stock fairings. As for the aerodynamics model, I\u0027d be happy with a drag fix.\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2014-12-25T16:14:28Z","Content":"\n\u003Cp\u003EI\u0027ll probably be sticking with FAR even after the overhaul, aerodynamic failure makes it more challenging and exciting.\u003C/p\u003E\n"},{"CreatedByName":"Tangle","CreatedById":66808,"CreatedDateTime":"2014-12-25T16:15:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EOr buff the atmosphere. Who says it can\u0027t reach 200kms like the one on Earth? Just mess up with the scale height, and perhaps increase surface pressure a bit if necessary. That could bump aerodynamic and gravity losses back to something resembling the current stock, and problem solved with a realistically scaled drag/velocity relationship. Alternatively, Kerbin could increase diameter and mass, but that would mean a new surface texture, and mess up every orbit on the Mun/Minmus system. So much more unlikely, IMO.\u003Cp\u003ERune. Who says kerbin has to have Earth surface conditions anyway?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAtmosphere reaching past the Mun confirmed????\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2014-12-25T16:52:20Z","Content":"\n\u003Cp\u003EIt\u0027s a bird! It\u0027s a plane! It\u0027s...it\u0027s...OH HOLY MOTHER OF KOD! NOOOOOOO!!!\u003C/p\u003E\n"},{"CreatedByName":"FishInferno","CreatedById":106219,"CreatedDateTime":"2014-12-25T16:58:37Z","Content":"\n\u003Cp\u003EWhat I am hoping to see:\u003C/p\u003E\u003Cp\u003EShape-based drag (Nosecones and stuff)\u003C/p\u003E\u003Cp\u003Ebody lift (for dreamchaser-like shuttles)\u003C/p\u003E\u003Cp\u003EStock fairings\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-12-25T17:10:31Z","Content":"\n\u003Cp\u003EI really hope they go with something like FAR, physics changing with mach numbers is a must (reentry profiles change between FAR and NEAR because of that, so does the heating if you have DR). The charts and the specialized guys are not a -need-, given the aerodynamic model is pretty intuitive: if it looks like a plane and follows the basic laws of plane design, then its probably going to fly too.\u003C/p\u003E\u003Cp\u003EDeep space refueling? I don\u0027t like the sound of that. I want resources, not just GET MORE FUEL FROM THE SURFACE OF WHEREVER YOU ARE FOR INFINITE SPACE EXPLORATION, that\u0027s just pretty much slaughtering the entire feature and reducing it to the lowest common denominator possible. Give me something to maintain extraplanetary bases, give me something to get funds with, give me stuff that holds a scientific value. You killed the previous resources arguing it was not fun, yet you implemented the clickfest science system we have now, such hypocrisy. Now you have an opportunity to redeem yourselves with a meaningful mid-endgame feature that expands into the rest of the already existing game like the three currencies, the science system, life support in the future, etc. Don\u0027t blow it.\u003C/p\u003E\n"},{"CreatedByName":"soulsource","CreatedById":110576,"CreatedDateTime":"2014-12-25T18:06:15Z","Content":"\n\u003Cp\u003EDeep space refuelling? While I do see the possibility to implement this in a meaningful way - electrolysis of water from Dunas ice caps for oxidizer or extracting carbohydrates from the oceans of Laythe for liquid fuel for instance - I see a very large potential to make this way too unrealistic and easy. If there is a meaningful explanation why a certain resource can be obtained at a certain location, I\u0027m fully for the possibility of deep space refuelling. If it\u0027s just land anywhere and get new fuel, I strongly oppose the idea. \u003C/p\u003E\u003Cp\u003ERegarding aerodynamics: I\u0027m a big fan of FAR, but it\u0027s probably too difficult for new players (\u0022what\u0027s a derivative?\u0022). If such an advanced aerodynamics model will be implemented, it needs to be optional.\u003C/p\u003E\n"},{"CreatedByName":"Cmdr. Arn1e","CreatedById":105775,"CreatedDateTime":"2014-12-25T20:31:05Z","Content":"\n\u003Cp\u003EI think it will be something SQUAD do themselves for the aerodynamics, I can\u0027t remember where they said it but I think there were various things about the existing mods they didn\u0027t like or couldn\u0027t implement in the core game for now...\u003C/p\u003E\u003Cp\u003EI haven\u0027t said much about the deep space refuelling, because I really don\u0027t know and want to be finding that out nearer to when it\u0027s done, so it\u0027s more of a surprise gift than knowing in advance that I\u0027ll have to possibly learn to fly planes again xD (which, with the amount of real sims available that all have different controls and feels, shouldn\u0027t take too long \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\u003Cp\u003EI really doubt it will be like the mods for refuelling though... I think the fuel should be following some sort of logic, and not be a rather magical substance that happens to naturally form without being explained properly! (Microbial life will be sufficient for me...)\u003C/p\u003E\n"},{"CreatedByName":"viktor19","CreatedById":111560,"CreatedDateTime":"2014-12-25T20:43:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022soulsource\u0022 data-cite=\u0022soulsource\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ERegarding aerodynamics: I\u0027m a big fan of FAR, but it\u0027s probably too difficult for new players (\u0022what\u0027s a derivative?\u0022).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeriously, what\u0027s a derivative? (I\u0027m only 14)\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2014-12-25T20:43:45Z","Content":"\n\u003Cp\u003EMan...\u003C/p\u003E\u003Cp\u003EI knew about this weeks before this thread appeared\u003C/p\u003E\u003Cp\u003ELulztotesrektn00bs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAm ultra hyped already for 0.91!!! Aerodynamics should be fun to play with, I have extensive experience with FAR (none of that NEAR nonsense). ISRU will be interesting, I am hoping for different asteroid types like water type (get rocket fuel from it), metal types (xenon? Maybe, I\u0027m not the most creative) and some resource for monopropellant.\u003C/p\u003E\u003Cp\u003EGood times and a very merry Christmas to you all!!! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-12-25T21:14:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022soulsource\u0022 data-cite=\u0022soulsource\u0022\u003E\u003Cdiv\u003EDeep space refuelling? While I do see the possibility to implement this in a meaningful way - electrolysis of water from Dunas ice caps for oxidizer or extracting carbohydrates from the oceans of Laythe for liquid fuel for instance - I see a very large potential to make this way too unrealistic and easy. If there is a meaningful explanation why a certain resource can be obtained at a certain location, I\u0027m fully for the possibility of deep space refuelling. If it\u0027s just land anywhere and get new fuel, I strongly oppose the idea. \u003Cp\u003ERegarding aerodynamics: I\u0027m a big fan of FAR, but it\u0027s probably too difficult for new players (\u0022what\u0027s a derivative?\u0022). If such an advanced aerodynamics model will be implemented, it needs to be optional.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a game. Theoretically we could mine water from the moon, it would just take inordinate* amounts of time. Thus, we could get \u0022rocket fuel\u0022 (hydrogen \u002B oxygen) from nearly any rock in the kerbin system. It just would take a drill and lots of time for electrolysis. However, being a game they will probably balance it to something a little more fun, so it takes less time or is more abundant. I\u0027m ok with this. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHowever as you said, it will probably use the new biomes to make it logical and challenging at the same time.\u003C/p\u003E\u003Cp\u003E*I\u0027m amazed I even remembered what that word meant. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2014-12-25T21:36:32Z","Content":"\n\u003Cp\u003EImplementing stock drag fix would be fairly easy, but I\u0027d really like for nose cones and fairings to have a purpose. FAR is simultaneously a bit too advanced and a bit too polarizing to put into stock, IMHO.\u003C/p\u003E\n"},{"CreatedByName":"PDCWolf","CreatedById":58026,"CreatedDateTime":"2014-12-25T21:44:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022soulsource\u0022 data-cite=\u0022soulsource\u0022\u003E\u003Cdiv\u003ERegarding aerodynamics: I\u0027m a big fan of FAR, but it\u0027s probably too difficult for new players (\u0022what\u0027s a derivative?\u0022). If such an advanced aerodynamics model will be implemented, it needs to be optional.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKnowing what a derivative is is totally optional with FAR. Most intuitively-made designs \u003Cstrong\u003Ewon\u0027t\u003C/strong\u003E fly in stock KSP, but they do in FAR. If it looks like a plane and it is balanced, it will probably fly under FAR (as it would in real life).\u003C/p\u003E\u003Cp\u003EI really fail to see a downside with far, given the advanced features such as charts and math formulas are optional and you don\u0027t even need to look at them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Technical Ben\u0022 data-cite=\u0022Technical Ben\u0022\u003E\u003Cdiv\u003EThis is a game. Theoretically we could mine water from the moon, it would just take inordinate* amounts of time. Thus, we could get \u0022rocket fuel\u0022 (hydrogen \u002B oxygen) from nearly any rock in the kerbin system.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s a problem with that: Squad seems reluctant to de-abstract stuff, and explaining getting fuel from water to specifically make hydrogen and oxygen ends up in having to de-abstract the already existing \u0022LF/O\u0022 system. If you decide to do that, then all of the current tank mass ratios and consumption ratios are wrong. \u003Cstrong\u003EThey know this already\u003C/strong\u003E though and that\u0027s why they invented \u0022propellium\u0022 for example (which was only obtainable on EVE\u0027s oceans) back when the old resource system was being shown off, to avoid this kind of abstraction conflict.\u003C/p\u003E\u003Cp\u003ETL;DR You can\u0027t get fuel from \u0022anywhere\u0022 with a rational -canon- explanation, or you end up killing the LF/O abstraction and having to explain/fix a lot of stuff.\u003C/p\u003E\n"},{"CreatedByName":"Kerboman","CreatedById":53253,"CreatedDateTime":"2014-12-25T22:18:33Z","Content":"\n\u003Cp\u003EI\u0027d like FAR to be the aero model, but I have no complaints if they go with something else; just download the mod again. \u003C/p\u003E\u003Cp\u003EI also don\u0027t care much for ISRU; I\u0027ll be happy more or less however they do it.\u003C/p\u003E\n"},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2014-12-25T22:41:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PDCWolf\u0022 data-cite=\u0022PDCWolf\u0022\u003E\u003Cdiv\u003EKnowing what a derivative is is totally optional with FAR. Most intuitively-made designs \u003Cstrong\u003Ewon\u0027t\u003C/strong\u003E fly in stock KSP, but they do in FAR. If it looks like a plane and it is balanced, it will probably fly under FAR (as it would in real life).\u003Cp\u003EI really fail to see a downside with far, given the advanced features such as charts and math formulas are optional and you don\u0027t even need to look at them.\u003C/p\u003E\u003Cp\u003EThere\u0027s a problem with that: Squad seems reluctant to de-abstract stuff, and explaining getting fuel from water to specifically make hydrogen and oxygen ends up in having to de-abstract the already existing \u0022LF/O\u0022 system. If you decide to do that, then all of the current tank mass ratios and consumption ratios are wrong. \u003Cstrong\u003EThey know this already\u003C/strong\u003E though and that\u0027s why they invented \u0022propellium\u0022 for example (which was only obtainable on EVE\u0027s oceans) back when the old resource system was being shown off, to avoid this kind of abstraction conflict.\u003C/p\u003E\u003Cp\u003ETL;DR You can\u0027t get fuel from \u0022anywhere\u0022 with a rational -canon- explanation, or you end up killing the LF/O abstraction and having to explain/fix a lot of stuff.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKind of true, with the exception that if it only works off Kerbin, it need not be \u0022water\u0022. Eve or Laythe need not be water seas. Likewise it need not be water mined from the mun. I only used the moon and o/h as a real life example. It would not be \u0022unrealistic\u0022 to get small amounts of fuel from \u0022anywhere\u0022 within reason, or specific bioms. So in theory they could have fuel mined from special places on the mun and/or any other body in the game (with perhaps limits, for example no mono prop from certain planets/moons).\u003C/p\u003E\u003Cp\u003EI\u0027m guessing it would be some sort of remote launch facility, as supposed to the old fuel system there were adding. Launch and land a big/multiple part facility to a moon/planet and you can then relaunch craft from it with full fuel etc. The \u0022in game cannon\u0022 being it\u0027s run the same as Kerbins Mission control is right now, for example, we don\u0027t worry about where the fuel comes from, it\u0027s just magically there and infinite (funds allowing in career). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-12-25T22:47:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PDCWolf\u0022 data-cite=\u0022PDCWolf\u0022\u003E\u003Cdiv\u003EKnowing what a derivative is is totally optional with FAR. Most intuitively-made designs \u003Cstrong\u003Ewon\u0027t\u003C/strong\u003E fly in stock KSP, but they do in FAR. If it looks like a plane and it is balanced, it will probably fly under FAR (as it would in real life).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile I agree that FAR is easier than most people seem to give it credit for, I have never experienced this \u0022Looks like a plane but won\u0027t fly\u0022 thing in stock. So long as the COL is near (preferably a bit behind) the COM and and the COT is roughly (preferably directly) behind the COM, it\u0027ll fly quite well.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-12-25T23:29:00Z","Content":"\n\u003Cp\u003EI would be surprised if Squad went and implemented either FAR or NEAR. Here\u0027s why:\u003C/p\u003E\u003Cp\u003E- NEAR seems simpler on the tin, but if you think that you need to re-learn how to build planes properly for realistic aerodynamics, or check if your old designs are still airworthy... well, you should probably be doing this with FAR, since FAR at least has the analysis panel. Even if you understand nothing whatsoever about it, you can at least see if all the numbers are green or not! NEAR has the same aerodynamics but zero build assistance. You\u0027re all on your own there. So just because you have no supersonic effects or maneuvering stresses doesn\u0027t magically make it easy to learn. You end up wishing you had the analysis panel to help you out.\u003C/p\u003E\u003Cp\u003E- All at the same time, I think FAR has too many elements that pull the user out of the \u0022stick parts together and fly it\u0022 style of KSP for Squad to really consider it. It\u0027s the same thing as with the discussion of whether or not the VAB should show you your rocket\u0027s dV values. Squad has decided against that, and they will decide against the editor complexity of FAR. Meanwhile ferram4 is not going to let this labor of love of his be \u0022half-assedly\u0022 stockified either.\u003C/p\u003E\u003Cp\u003ENo, I think what happened is that Squad took a look at NEAR and saw that there is room for a middle ground. For them, the point I have always seen brought up in dev posts on the topic time and time again is \u0022what is realistic but fun enough? Where is the point that is acceptable? Where is the cutoff at which point you go overboard?\u0022 You can make this system as gamey and unrealistic as you want, or you can make it as realistically simulated as you want. It\u0027s a sliding scale, and while everybody has their own vocal opinion about their preferred style, just about nobody has any idea how a \u003Cem\u003Ecompromise\u003C/em\u003E would or should look like. \u003C/p\u003E\u003Cp\u003EWhat Squad is attempting to do now, finally, after fussing over it so long, is taking a shot at hitting precisely that compromise. Maybe it\u0027ll be similar to, but not exactly like NEAR is right now. I think it\u0027ll be something that gets by without any further editor tools that aren\u0027t in place already, but that isn\u0027t so precision-demanding as to leave the player wishing for better tools.\u003C/p\u003E\u003Cp\u003EI also think that ferram4 may possibly be helping Squad in this endeavour (unless he has already denied any such involvement, I wouldn\u0027t know, I don\u0027t stalk him). But at the same time, I\u0027m convinced that FAR will live on as a separate mod. It will switch to build upon whatever aerodynamics model Squad comes up with, but it will probably end up working more or less exactly like it does now. The only thing that changes is how it\u0027s achieved under the hood. NEAR will probably die in the meantime, assuming stock becomes \u0022good enough\u0022.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-25T23:32:35Z\u0022 title=\u002212/25/2014 11:32  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 25, 2014\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TokiTech","CreatedById":131500,"CreatedDateTime":"2014-12-25T23:41:06Z","Content":"\n\u003Cp\u003EMerry Christmas guys. Thought Deep Space Refuel is already possible with stock but wonder there might be new parts for it? Also hoping aerodynamic overhaul won\u0027t render all my planes going too astray. Redesign and test flights them all can take days. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-12-25T23:50:18Z","Content":"\n\u003Cp\u003EMerged into the exsisting aero wish list thread.\u003C/p\u003E\n"},{"CreatedByName":"Fizwalker","CreatedById":78337,"CreatedDateTime":"2014-12-26T00:25:32Z","Content":"\n\u003Cp\u003EI\u0027ve only read a few of the posts on this thread and I don\u0027t really have time to read it right now, but.... This is my two cents worth.\u003C/p\u003E\u003Cp\u003EMy thoughts are that maybe they could be both implemented. Have NEAR be the \u0022normal\u0022 difficulty and maybe FAR be \u0022hard\u0022 or perhaps be check mark options kind of like how having destructible facilities are handled.\u003C/p\u003E\u003Cp\u003E(I like FAR, but then I haven\u0027t tried using NEAR, so...)\u003C/p\u003E\n"},{"CreatedByName":"luizopiloto","CreatedById":97503,"CreatedDateTime":"2014-12-26T00:52:34Z","Content":"\n\u003Cp\u003ESquad is messing with something very delicate here... this will change the game from ground up... some ppl will like... some will dislike...\u003C/p\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2014-12-26T04:24:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TokiTech\u0022 data-cite=\u0022TokiTech\u0022\u003E\u003Cdiv\u003EMerry Christmas guys. Thought Deep Space Refuel is already possible with stock but wonder there might be new parts for it? Also hoping aerodynamic overhaul won\u0027t render all my planes going too astray. Redesign and test flights them all can take days. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDeep space refueling, as in, resource collection and conversion to appropriate fuels. Similar to Kethane Or Karbonite, but done how Squad sees it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ikaneko\u0022 data-cite=\u0022Ikaneko\u0022\u003E\u003Cdiv\u003EMan...\u003Cp\u003EI knew about this weeks before this thread appeared\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ve all known since like October.. When HarvesteR announced it.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-12-26T05:28:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cmdr. Arn1e\u0022 data-cite=\u0022Cmdr. Arn1e\u0022\u003E\u003Cdiv\u003EFor those that have missed it, SQUAD have said happy holidays, and given us some important news about the next update! (0.91.0? 0.90.1?) \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104825-Happy-Holidays!\u0022 rel=\u0022external nofollow\u0022\u003EHere\u003C/a\u003E!\u003Cp\u003EWhat would you like to see from this? do you have a preference for FAR or NEAR, and if you\u0027ve tried both which do you prefer?\u003C/p\u003E\u003Cp\u003EAnd, of course, Merry Christmas! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMerry Christmas to you too!\u003C/p\u003E\u003Cp\u003EI actually just really hope they bring in Ferram. He\u0027s the only modder who seems to have a sufficient knowledge of how to model aerodynamics in KSP that he\u0027s created not one, but TWO working systems (FAR and NEAR). I think they can work with him to iron out the wrinkles of which particular features to include and not to include, and perhaps even collaborate to find ways to IMPROVE his code so it uses less memory, etc.\u003C/p\u003E\u003Cp\u003EAnd, for the record, I would also like to see a lot of the data screens like in FAR (should require opening \u0022Advanced Mode\u0022 in the VAB/SPH like with the parts catalog)- I find KSP just doesn\u0027t provide enough informational displays in the stock game in general. As long as the displays don\u0027t show up by default, and have to be \u0022enabled\u0022 by clicking a button or setting an option, it shouldn\u0027t be too overwhelming for new players...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EP.S.\u003C/strong\u003E The informational displays in FAR aren\u0027t technically NECESSARY to build a plane/rocket- they just give you data about the expected performance of your vehicle, so you can make changes to it BEFORE you set it out on the Launchpad/Runway...\u003C/p\u003E\u003Cp\u003EMerry Christmas and a Happy New Year to everyone! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E-Northstar-\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-12-26T05:32:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Elthy\u0022 data-cite=\u0022Elthy\u0022\u003E\u003Cdiv\u003EI have no idea how they want to integrate it balanced, with NEAR its way to easy to build rockets with large payloads. A larger orbital velocity would be required, but that is unlikely since it would either mean to increase surface gravity (there are so much ways why this wont happen) or larger planets (at least Kerbin), but that would mess up quite much stuff, too.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is a third option you didn\u0027t consider. One that\u0027s vastly superior, and I\u0027m sure you can see the wisdom of...\u003C/p\u003E\u003Cp\u003ENerf the ISP\u0027s (possibly replace them with real world ISP\u0027s and fuel-densities, as all real fuels are either lower-ISP or lower-density than stock KSP). This way it requires the same sized rocket to get to orbit as before, and makes the game slightly more realistic/challenging once you get to other planets or moons...\u003C/p\u003E\u003Cp\u003ESee the related discussion thread:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/104061-Should-Specific-Impulse-%28ISP%29-be-nerfed-with-improved-aerodynamics\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/104061-Should-Specific-Impulse-%28ISP%29-be-nerfed-with-improved-aerodynamics\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMerry Christmas and a Happy New Year! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E- Northstar-\u003C/p\u003E\n"}]}