{"TopicId":94372,"ForumId":55,"TopicTitle":"Precision NavBall","CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2014-12-24T12:23:06Z","PageNum":1,"Articles":[{"CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2014-12-24T12:23:06Z","Content":"\n\u003Cp\u003EI\u0027ve been playing with NAV HUD and realizing that I like the precision I can point on to a maneuver node with because the navball it\u0027s projected on a much larger area.\u003C/p\u003E\u003Cp\u003EWhich, got me thinking about the Navball and precision controls. I play with a gamepad, so when I toggle on precision controls it doesn\u0027t actually work. Not with the D-Pad (thinks it\u0027s a joystick axis) and not with either stick. I hear the joystick folks are in the same boat. So, what if precision control toggle zoomed in the navball significantly, possibly in a configurable way, for more precision on the nodes. This would also be nice for targeting center of mass on asteroids. Then in doing so the controls would actually be nerfed so the ball seems to move about the same as it would if it were normal, but of course if it were zoomed in you\u0027d actually be covering far less area so the controls would actually be precision.\u003C/p\u003E\n"},{"CreatedByName":"bdito","CreatedById":112760,"CreatedDateTime":"2014-12-24T15:43:18Z","Content":"\n\u003Cp\u003EI hear ya. It\u0027s tough to get precision with the small navball. You might want to try the Enhanced Navball. It allows you to make the navball larger and even move it left or right on the screen.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/50524-0-90-Enhanced-Navball-1-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/50524-0-90-Enhanced-Navball-1-3\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2014-12-25T01:33:37Z","Content":"\n\u003Cp\u003EI\u0027ve used enhanced navball for a while and that scaling ability is great, which is part of what got me thinking it would be pretty neat if the widget stayed the same size on your screen but it would zoom in on the center of the ball (though i think individually scalable and positionable widgets would be a great feature generally). For example if you are on S, you can see the edges of E and W on the nav ball but when you hit precision controls maybe you\u0027d only be able to see 45 degrees to either side and your controls would be padded to match with a touch of a button (toggle precision control). Then you hit it again and your nav ball and controls go back to normal.\u003C/p\u003E\u003Cp\u003EI think it would be really slick and something beyond what navhud and enhanced navball do.\u003C/p\u003E\n"},{"CreatedByName":"Anthlon","CreatedById":58074,"CreatedDateTime":"2014-12-27T12:06:27Z","Content":"\n\u003Cp\u003EAgree with some navball precise aiming improvement.\u003C/p\u003E\u003Cp\u003EFor example with longer burns it happens often to me that i am left chasing the dot on maneuver marker, instead of aiming for it whole time. (because with closing up on target, the diference in heading become to be visible from nothing to mentionable deviation from course). I am personaly not requesting ultimate precision aiming, but maybe with the precision controls as healeon wrote, there maybe (at some advance in game maybe?..)could be some magnifier on navball when precisions activated (\u0026amp; target or maneuver is active).\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-27T20:23:27Z","Content":"\n\u003Cp\u003EI want this.\u003C/p\u003E\n"},{"CreatedByName":"Scoundrel","CreatedById":15369,"CreatedDateTime":"2014-12-28T07:32:26Z","Content":"\n\u003Cp\u003EAgreed. I too would like to see this in the game, even if it is some tech that is unlocked later on.\u003C/p\u003E\n"}]}