{"TopicId":94508,"ForumId":55,"TopicTitle":"Changing part destruction behavior regarding fluid impacts","CreatedByName":"BigNose","CreatedById":35713,"CreatedDateTime":"2014-12-25T16:41:25Z","PageNum":1,"Articles":[{"CreatedByName":"BigNose","CreatedById":35713,"CreatedDateTime":"2014-12-25T16:41:25Z","Content":"\n\u003Cp\u003EI just had a quick idea to improve the way parts interact with water and other fluids in the game somewhat:\u003C/p\u003E\u003Cp\u003ECurrently the only thing which decides part destruction on fluid impact is total speed compared to the impact tolerance of the part. If speed is higher -\u0026gt; Part destroyed.\u003C/p\u003E\u003Cp\u003EWithout overcomplicating this, how about changing this in the following way:\u003C/p\u003E\u003Cp\u003EThe deciding factor for part destruction should be \u003Cem\u003Evertical\u003C/em\u003E speed compared to impact tolerance, not the total speed.\u003C/p\u003E\u003Cp\u003EThat way, a steep crash into water would still be deadly, while gently touching down with much greater horizontal speed (like a plane) would become viable, without having to use rediculously high impact tolerance parts to simulate floats.\u003C/p\u003E\u003Cp\u003EWhile I\u0027m not sure how much work a change like this would require, the benefits are immediatly obvious: Building stock seaplanes/boats would become a viable option, and the whole interaction with fluids, while still crude, would become much less ankward.\u003C/p\u003E\u003Cp\u003EWhat do you guys think?\u003C/p\u003E\n"},{"CreatedByName":"masiboss","CreatedById":63787,"CreatedDateTime":"2014-12-25T16:52:11Z","Content":"\n\u003Cp\u003EThats just a great idea\u003C/p\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2014-12-25T16:54:12Z","Content":"\n\u003Cp\u003EI would suggest factoring horizontal speed into things somehow, otherwise a gentle 2,000m/s landing on water is possible. Seems like a decent way of fudging the numbers though.\u003C/p\u003E\n"},{"CreatedByName":"BigNose","CreatedById":35713,"CreatedDateTime":"2014-12-25T16:58:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022technicalfool\u0022 data-cite=\u0022technicalfool\u0022\u003E\u003Cdiv\u003EI would suggest factoring horizontal speed into things somehow, otherwise a gentle 2,000m/s landing on water is possible. Seems like a decent way of fudging the numbers though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood thought there, capping horizontal speed is necessary. Maybe like 20 times impact velocity or something? Some form of factor to impact velocity would be ok I think. If you wanted to get into it a bit more, the factor could be dependent on the vertical speed, to the faster you touch down (vertically), the less horizontal speed you can have.\u003C/p\u003E\n"},{"CreatedByName":"Kegereneku","CreatedById":66154,"CreatedDateTime":"2014-12-25T20:29:26Z","Content":"\n\u003Cp\u003EWith such a system I expect a lot of spaceplane prototype surviving a failed launch and falling into water at the end of the runway.\u003C/p\u003E\u003Cp\u003EI\u0027m not really interested in boat, but more clemency toward emergency plane landing would be appreciable. Also there IS a few real spaceplane proposal who relied on waterlanding.\u003C/p\u003E\n"},{"CreatedByName":"BigNose","CreatedById":35713,"CreatedDateTime":"2014-12-30T21:09:16Z","Content":"\n\u003Cp\u003ETurns out the great ferram4 already came to the rescue: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/105094-0-90-Better-Buoyancy-v1-0-Simple-Water-Fixes-12-27-14\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/105094-0-90-Better-Buoyancy-v1-0-Simple-Water-Fixes-12-27-14\u003C/a\u003E\u003C/p\u003E\n"}]}