{"TopicId":95173,"ForumId":55,"TopicTitle":"Idea for high level engineering ability - stolen from The Martian","CreatedByName":"jonr","CreatedById":114950,"CreatedDateTime":"2014-12-31T20:28:58Z","PageNum":1,"Articles":[{"CreatedByName":"jonr","CreatedById":114950,"CreatedDateTime":"2014-12-31T20:28:58Z","Content":"\n\u003Cp\u003EI managed to get distracted and not stick a Mun landing and burned through a bunch of fuel, that happens, this particular one was going to rescue some Kerbals from a Mun base that had no function. Due to the poor landing I ended up being just a few Dv short of being able to take my Kerbals back home to see their loved ones and sadly none of the kerbals wanted to volunteer to push. Having recently read The Martian (you should absolutely read this book if you get a chance!) I had the thought that much like in the end of that book, sorry for the spoiler here, it would be neat if a high level engineer could strip the ship down a bit. Being able to have the engineer lighten the load to get those few precious Dv would have been awesome. Ideally the engineer could have stripped off a few non-load bearing radially attached fuel tanks, maybe the landing gear after I retracted it, some solar panels, any science parts, or any part that is not load bearing. I would guess game logic wise this would mean being able to have the engineer remove radially attached components and while it sounds easy in my head might be incredibly complex to code.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2014-12-31T20:31:30Z","Content":"\n\u003Cp\u003EGreat idea.\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-31T20:40:26Z","Content":"\n\u003Cp\u003EPossible with \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92514-0-90-Kerbal-Attachment-System-%28KAS%29-0-4-10\u0022 rel=\u0022external nofollow\u0022\u003EKAS \u003C/a\u003Emod for a great number of small, kerbal sized parts. Should make that into stock.\u003C/p\u003E\n"},{"CreatedByName":"pandaman","CreatedById":130621,"CreatedDateTime":"2014-12-31T20:44:25Z","Content":"\n\u003Cp\u003EThat\u0027s one of those \u0027what\u0027s the point of that\u0027 ideas that\u0027s actually quite good, and jolly handy in a crisis. I Like it.\u003C/p\u003E\n"}]}