{"TopicId":95222,"ForumId":55,"TopicTitle":"Improve the Lighting (Gamma, Shaders)","CreatedByName":"rabid_lemming","CreatedById":134005,"CreatedDateTime":"2015-01-01T05:01:53Z","PageNum":1,"Articles":[{"CreatedByName":"rabid_lemming","CreatedById":134005,"CreatedDateTime":"2015-01-01T05:01:53Z","Content":"\n\u003Cp\u003ELighting in this game is far too simplified and is a severe detriment to gameplay. Lack of gamma correction is the first noticeable problem. Gamma correction is needed because on a properly calibrated monitor, additional light in the room the monitor is in, will drown out lots of detail in a game. Gamma correction offsets light in a room by making the monitor brighter.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EExample: \u003C/strong\u003EThe game has been so completely dark that one time I could not even find Kerbin, and I was orbiting the damn planet at the time.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EExample 2:\u003C/strong\u003E Lets take a temperature reading our first time launching into orbit! Oh wait... the thermostat is like 8 pixels in size and my whole ship is pure black. Where the hell is that thing!\u003C/p\u003E\u003Cp\u003ESecondly, not everything in space is black... there seems to be an over simplification of light in space as if the sun is the only thing that can ever produce light on an object. Go outside and look up at the moon if it isn\u0027t a full moon. You will see both the light side of the moon as well as the dark. You can see the dark side of the moon because light is being reflected from the earth to the moon\u0027s dark side. Likewise the moon reflects light on to the earth at night so it is never pitch black.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.asterism.org/tutorials/tut26-1.htm\u0022 rel=\u0022external nofollow\u0022\u003EMoon Light Calculations here...\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe fix:\u003C/strong\u003E The Mun and Minimus are 2 directional lights to Kerbin; Kerbin is 1 directional light for the Mun and Minimus. Figure out the reflective angle (sun to reflector to target) multiply angle\u0027s result by the body\u0027s albedo. Such calculations only need done once per pass since they behave like directional lights and won\u0027t change until next frame is rendered. All planetary bodies (near enough to a flown vessel) can cast light on it.\u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2015-01-01T14:55:18Z","Content":"\n\u003Cp\u003EI agree that lighting in the game needs a bit of work, but i\u0027m not sure lack of gamma correction is the problem. \u003C/p\u003E\u003Cp\u003EGamma correction is not \u0022offset light in a room by making the monitor brighter\u0022 - that would mean the light level in the room is actively monitored and gamma is automatically adjusted to compensate, and it implies that gamma correction simply means \u0022brighter\u0022, which it is not. \u003C/p\u003E\u003Cp\u003ESome monitors do actively monitor ambient light and adjust brightness (not gamma). Gamma changes the brightness curve (\u0022nonlinear operation used to code and decode luminance\u0022 - wiki), specifically to make dark tints a bit brighter in order to \u0022compensate for properties of human vision\u0022 (-wiki), and is a one-time calibration for each combination of monitor and graphics card (usually automatic upon installation).\u003C/p\u003E\u003Cp\u003EThe fix that you propose for excessive darkness seems to be a decent one (and does not involve gamma), but perhaps it can be done simpler, along the lines of what the \u0022Planetshine\u0022 mod does, which tweaks ambient lighting depending on how close one is to specific bodies.\u003C/p\u003E\n"}]}