{"TopicId":95556,"ForumId":55,"TopicTitle":"Random or Scripted Events That Impact Your Career Mode","CreatedByName":"Probus","CreatedById":102512,"CreatedDateTime":"2015-01-03T21:27:33Z","PageNum":1,"Articles":[{"CreatedByName":"Probus","CreatedById":102512,"CreatedDateTime":"2015-01-03T21:27:33Z","Content":"\n\u003Cp\u003EHad an idea for KSP Career mode... Random (or scripted) events would occur that directly affect your space program. Example:\u003C/p\u003E\u003Cp\u003E - Budget cuts reduce contract funding by 10% for 1 year.\u003C/p\u003E\u003Cp\u003E - End of space race. Contract X is cancelled.\u003C/p\u003E\u003Cp\u003E - Beginning of space race, funding doubled for 6 months.\u003C/p\u003E\u003Cp\u003E - Beat the Werbals to the mun \u002B10% reputation for 1 year.\u003C/p\u003E\u003Cp\u003EThe idea is that each event would modify 1 or more parameters such as multipliers. \u003C/p\u003E\u003Cp\u003EIt would require the ability to turn them off, or control when they happen, and how severe they would be.\u003C/p\u003E\u003Cp\u003EThere also needs to be hooks that allow modders to add and delete events.\u003C/p\u003E\u003Cp\u003ELast but not lease, modders/players should have the ability to make a \u0022scripted\u0022 storyline with events happening on a set timeline with not only modifiers but contracts dropping at a certain time Z or after and event (event \u002B Z). Theoretically you could simulate the whole space race timeline.\u003C/p\u003E\u003Cp\u003EThis, of course, is just the kernel of an idea. What else should this capability entail?\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2015-01-04T09:15:33Z","Content":"\n\u003Cp\u003EI agree and have previously suggested something similar.\u003C/p\u003E\u003Cp\u003EHow about an event that triggers when a transfer window open up, giving you a mission with a penalty/penalty modifiers for not accepting. This event, and others, could also be contextual with regards to what strategies you have in play.\u003C/p\u003E\n"}]}