{"TopicId":96367,"ForumId":55,"TopicTitle":"Sort parts by folder","CreatedByName":"Wampa842","CreatedById":85841,"CreatedDateTime":"2015-01-11T15:11:58Z","PageNum":1,"Articles":[{"CreatedByName":"Wampa842","CreatedById":85841,"CreatedDateTime":"2015-01-11T15:11:58Z","Content":"\n\u003Cp\u003EMy biggest problem with the new editor is that the part list became an awful mess. In previous versions, parts from the same mod were always grouped. I had a B9 group, KW group, KSPI group, etc. Now it looks like it had gone through a blender. Looking up the right part for the ship now became unnecessarily annoying. (Less dedicated players might even give up and just play something else.)\u003C/p\u003E\u003Cp\u003EIf you could, please add an option to use the pre-0.90 sorting. (because really, there\u0027s no point in sorting by mass.)\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-11T22:52:14Z","Content":"\n\u003Cp\u003EThere are already multiple options to change how the list is sorted -- selecting any of the four filter options at the top of the parts list (Name, Mass, Cost, Size) will change the way they\u0027re sorted. Select one a second time to reverse the sort. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-01-11T23:03:25Z","Content":"\n\u003Cp\u003EAlso, another way to group them (though arguably a heck of a lot more time consuming, but worth it) is to use that fancy new custom folder in advanced options feature. I used it to group all my Karbonite and MKS/OKS stuff nicely, and I think it even goes through saves, as well.\u003C/p\u003E\n"},{"CreatedByName":"Wampa842","CreatedById":85841,"CreatedDateTime":"2015-01-31T13:02:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EThere are already multiple options to change how the list is sorted -- selecting any of the four filter options at the top of the parts list (Name, Mass, Cost, Size) will change the way they\u0027re sorted. Select one a second time to reverse the sort. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know how sorting works, and, well, it does not. It kills the purpose of sorting (being able to find an item easily by one of its properties) because one, other than some exceptions, nobody remembers the arbitrary letters parts are called; two, it takes an eternity to browse through multiple pages of parts, only to find one of the wrong size; and three, I don\u0027t think anyone really cares about the other three sorting methods. This has made building generally unenjoyable and annoying. Like I said, what used to be a nicely organized list is now a heap of junk.\u003C/p\u003E\u003Cp\u003EForum rules prevent me from saying what I think about squad\u0027s sorting.\u003C/p\u003E\n"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2015-01-31T14:06:03Z","Content":"\n\u003Cp\u003EThat\u0027s what I wanted to say: add \u0027sorting by type\u0027\u003C/p\u003E\n"}]}