{"TopicId":97609,"ForumId":55,"TopicTitle":"Do you feel KSP is ready for 1.0?","CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2015-01-24T02:37:39Z","PageNum":6,"Articles":[{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-01-24T06:25:18Z","Content":"\n\u003Cp\u003EI just think that 1.0 being next is a big skip. Too big. Make it 0.99, and then make 1.0 a bugsquashing release. Besides that, clouds and nuclear reactors.\u003C/p\u003E\n"},{"CreatedByName":"The Yellow Dart","CreatedById":107172,"CreatedDateTime":"2015-01-24T06:41:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bill Phil\u0022 data-cite=\u0022Bill Phil\u0022\u003E\u003Cdiv\u003EBesides that, clouds and nuclear reactors.\u003C/div\u003E\u003C/blockquote\u003E Oh man, clouds! I\u0027m so used to them now that I almost forgot they weren\u0027t stock already! They add \u003Cem\u003Eso\u003C/em\u003E much beauty and drama and awesomeness for such a little feature, they should definitely be stock. \u003Cp\u003EI kind of feel like Squad has gotten too used to its amazing modding community. Like they have fallen into the line of thinking that if something is missing from the game, players will just go get it as a mod, but there will always be a sizable chunk of players who will always play mod-free. I was like that for a long time, and it isn\u0027t because I was being picky or anything, it was because I wanted to play the game as it was intended by by the makers, because I wanted to trust the singular vision of the devs, rather than a bunch of modders that make great things but are all working separately. I eventually felt gameplay had too many big holes in it to continue playing stock, but I assumed that eventually there would be a game that I could go back to stock with, or at least almost stock (I was pretty bummed by them stating there will never be life support in stock a few months back, still am).\u003C/p\u003E\n"},{"CreatedByName":"Raven.","CreatedById":99340,"CreatedDateTime":"2015-01-24T06:54:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RocketPilot573\u0022 data-cite=\u0022RocketPilot573\u0022\u003E\u003Cdiv\u003EWhile it may be true that all the features will be done, the game still needs fixes and improvements, such as Unity 5 (Pending release of course), slightly better 64-bit, more bug fixes in general, etc.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, don\u0027t even get me started on the 64 bit rant. My opinion, that right there needs to be fixed, which I release requires moving to Unity 5 at least. Simply because people, like me, are going to load the game till it crashes. I\u0027ve done it with every game thus far, and KSP is no different. Basically I think there needs to be a stable Win64 client ready before 1.0.\u003C/p\u003E\n"},{"CreatedByName":"MartGonzo","CreatedById":65764,"CreatedDateTime":"2015-01-24T06:55:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Yellow Dart\u0022 data-cite=\u0022The Yellow Dart\u0022\u003E\u003Cdiv\u003EOh man, clouds! I\u0027m so used to them now that I almost forgot they weren\u0027t stock already! They add \u003Cem\u003Eso\u003C/em\u003E much beauty and drama and awesomeness for such a little feature, they should definitely be stock. \u003Cp\u003EI kind of feel like Squad has gotten too used to its amazing modding community. Like they have fallen into the line of thinking that if something is missing from the game, players will just go get it as a mod, but there will always be a sizable chunk of players who will always play mod-free. I was like that for a long time, and it isn\u0027t because I was being picky or anything, it was because I wanted to play the game as it was intended by by the makers, because I wanted to trust the singular vision of the devs, rather than a bunch of modders that make great things but are all working separately. I eventually felt gameplay had too many big holes in it to continue playing stock, but I assumed that eventually there would be a game that I could go back to stock with, or at least almost stock (I was pretty bummed by them stating there will never be life support in stock a few months back, still am).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI always find it a bit jarring to watch someone play stock KSP, it can be so beautiful with EVE \u002B Astronomers pack, planetshine, Distant object enhancement and most important of all texture replacer to get rid of that truly hideous starfield.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure about how others feel but I honestly would stop playing the game completely without those mods, visuals are important and it seems like the dev\u0027s just don\u0027t see it that way.\u003C/p\u003E\u003Cp\u003EI want the game to do well, but I\u0027m more than a little concerned by this proposed release\u003C/p\u003E\n"},{"CreatedByName":"Qberticus","CreatedById":115166,"CreatedDateTime":"2015-01-24T06:55:45Z","Content":"\n\u003Cp\u003EAs a software developer and a mod maintainer there is no way this game is ready for release in the near future. There are just too many bugs and there is still a lack of gameplay and content. I\u0027ve tried recommending this game to friends and when I say \u0022it\u0027s good but you need to install 40\u002B mods\u0022 they look at me like I\u0027m crazy. I like it, it\u0027s a good game, but I\u0027m not letting that color my view about its current state of development nor alter my hesitation to recommend it to people.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-01-24T07:06:22Z","Content":"\n\u003Cp\u003EIn short, no.\u003C/p\u003E\u003Cp\u003EIn long... what you all said. The game is buggy and not ready for release. If the release game has even one of:\u003C/p\u003E\u003Cp\u003ETundra biomes next to KSC\u003C/p\u003E\u003Cp\u003ECollision courses with Mun not even showing up as SOI encounters\u003C/p\u003E\u003Cp\u003EConic sections with no periapsis (which is impossible)\u003C/p\u003E\u003Cp\u003ENo Female Kerbals\u003C/p\u003E\u003Cp\u003EA huge memory leak\u003C/p\u003E\u003Cp\u003ERadial decouplers with no outward force\u003C/p\u003E\u003Cp\u003E(and those are just off the top of my head)\u003C/p\u003E\u003Cp\u003E...then the game is not even remotely ready for 1.0 release because those are BASIC things that need fixed. Not modified. Not changed. Fixed. They are bugs.\u003C/p\u003E\u003Cp\u003EYes. Even Female Kerbals.\u003C/p\u003E\u003Cp\u003EI defend most of Squad\u0027s decisions because the game is still being actively developed and they specifically say on the box that they\u0027re not actually releasing it yet. That defense is out the window the moment this game hits 1.0.\u003C/p\u003E\u003Cp\u003EI figured out what Project V is. |V|ojang.\u003C/p\u003E\u003Cp\u003EEDIT: Okay I was out all night and just read this before finding out that they both ARE adding Females to the game AND revealed what \u0022Project V\u0022 is. So I rescind both of those. And I can\u0027t even comment on the Project V thread about how shocked I am that they called it that, because the thread was locked \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T07:27:10Z\u0022 title=\u002201/24/2015 07:27  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2015-01-24T07:06:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FleetAdmiralJ\u0022 data-cite=\u0022FleetAdmiralJ\u0022\u003E\u003Cdiv\u003EThere will ALWAYS be things being found. There has never been a game released where things weren\u0027t found. Expecting zero bugs is a ridiculous bar in any game - heck - any piece of software release. I think the big questions are:\u003Cp\u003E1) Do the new features work well within the game\u003C/p\u003E\u003Cp\u003E2) Have things been properly rebalanced\u003C/p\u003E\u003Cp\u003E3) Are there any major bugs that would significantly impact gameplay\u003C/p\u003E\u003Cp\u003EIf the answer to all 3 of those are \u0022yes,\u0022 then my answer to the poll in the thread is \u0022yes, it is ready.\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery succinct summary, thank you. I had to vote a resounding \u003Cspan style=\u0022font-size:18px;\u0022\u003ENO\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003E1) The new features seem pretty good. Although I don\u0027t play career, I follow the news on its balance issues, and they appear to be many. Particularly, the tech tree.\u003C/p\u003E\u003Cp\u003E2) Generally, balance has gotten MUCH better, but the smaller rocket engines need work.\u003C/p\u003E\u003Cp\u003E2 AND 3) New aero, lift, AND resources without widespread beta testing?!?\u003C/p\u003E\u003Cp\u003E3) Decouplers, timewarp through SOI changes, general stability and optimization. Anything handled by Claw\u0027s Stock Bug Fix.\u003C/p\u003E\u003Cp\u003EOld features not working or not adequate:\u003C/p\u003E\u003Cp\u003E4) Tutorials: I\u0027m not sure where these are at. Last I heard, they were broken or in bad shape.\u003C/p\u003E\u003Cp\u003E5) Demo: Needs to be upgraded to the latest version. Without the demo, I probably would have never bought the game.\u003C/p\u003E\u003Cp\u003EI think releasing 1.0 without another Beta release will harm Squad in the long term. Bugs, stability, performance, and balance issues will drive away new players, and make the game less popular than it could be. I like these guys; I want to see them make all the money they can.\u003C/p\u003E\u003Cp\u003EAs a community, we have the opportunity to do something \u003Cstrong\u003Econstructive \u003C/strong\u003Ehere.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EA) I think those of us that have voted \u0022no\u0022 need to start hammering the bug tracker.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/projects/ksp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bugs.kerbalspaceprogram.com/projects/ksp\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E\u003Cstrong\u003E \u003C/strong\u003EI feel like a cheapskate for having so much fun for so little money. I\u0027ve already purchased KSP for myself and a friend--\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI pledge to buy a THIRD copy if they have another Beta release.\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T07:12:38Z\u0022 title=\u002201/24/2015 07:12  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by FleshJeb\u003C/strong\u003E\n\u003Cbr\u003Elanguage filter\n\u003C/span\u003E\n"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2015-01-24T07:19:31Z","Content":"\n\u003Cp\u003EYes and Yes and yeah\u003C/p\u003E\u003Cp\u003EThere\u0027re no so much for me, only random crash or something.\u003C/p\u003E\u003Cp\u003EFeatures are done, bugs are dead (almost), why not 1.0?\u003C/p\u003E\n"},{"CreatedByName":"spacetoddity","CreatedById":28303,"CreatedDateTime":"2015-01-24T07:26:09Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cem\u003EI pledge to buy a THIRD copy if they have another Beta release.\u003C/em\u003E\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T07:36:34Z\u0022 title=\u002201/24/2015 07:36  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by spacetoddity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stargazer1235","CreatedById":52505,"CreatedDateTime":"2015-01-24T07:36:24Z","Content":"\n\u003Cp\u003EI personally think KSP is ALMOST in state of completion but not, so I voted \u003Cspan style=\u0022font-size:36px;\u0022\u003ENO!\u003C/span\u003E.\u003C/p\u003E\u003Cp\u003EInstead of whining about the bugs or missing features, I am going to create a game plan for Squad for the Next 1 year till release. \u003C/p\u003E\u003Cp\u003EGAMEPLAN:\u003C/p\u003E\u003Cp\u003E1) Ditch the original plan, you and your customers would be better off if you took your time and made a polished product. \u003C/p\u003E\u003Cp\u003E2) Use what you have as a roadmap to 1.0, don\u0027t add or take things away but instead break each feature up into smaller updates. Remember guys, the late game is about fixing as many problems as possible and less about adding features. \u003C/p\u003E\u003Cp\u003E3) Increase update frequency, every second or third update should purely be bug fixes for KSP and the 64 bit version. Since most features are almost done and bug fixing doesn\u0027t take as long creating new asserts, updates should become more frequent. \u003C/p\u003E\u003Cp\u003E4) Possibly update to Unity 5, this depends on when it comes out though. If it comes out in the next couple months, then great, update to it and start fixing the bugs that come along because of the transition, if it comes out at the end or next year then it might not be worth it. \u003C/p\u003E\u003Cp\u003E5) There is no harm in going back and looking at the tutorials and scenarios, since this most likely what new players will come into contact with, my suggestion it to integrate a tutorial with the sandbox and career modes so when someone starts up, they go into these first. Scenarios can be about more specified things, like docking or actual missions. \u003C/p\u003E\u003Cp\u003E6) Right before release, redo the demo so you can show off how far KSP has come to the cynical consumer. \u003C/p\u003E\u003Cp\u003EI love your game, I think everyone here does and that is why we don\u0027t want to see you guys fall flat on your face with these last few months. There a bit more spit and polish can go a long way in terms of game sales.\u003C/p\u003E\n"},{"CreatedByName":"ximrm","CreatedById":111063,"CreatedDateTime":"2015-01-24T07:39:29Z","Content":"\n\u003Cp\u003EI dont think it\u0027s ready for 1.0. As soon as the game seems \u0022finished\u0022, all those game reviewing magazines and sites will be going to it. With that amount of bugs and unstable condition...does squad really think they\u0027re going to earn good scores on more promises? It might give a terrible first impression(similar to the existing one). \u003C/p\u003E\u003Cp\u003EFor someone who has never played the game and is looking at screenshots (\u0022Y U NO CLOUDZ?\u0022) and listens to hearsay(\u0022Awesome unique game, but don\u0027t rate it after the ancient demo and install at least those mods ...\u0022), it might not be very convincing. \u003C/p\u003E\u003Cp\u003E I love the game and I know that it\u0027s for a niche market but \u003Cstrong\u003Ethe planned update seems more focused on the existing community\u003C/strong\u003E than a more public one. New players don\u0027t know and won\u0027t really give a... about new aerodynamics or larger wings. They don\u0027t know the game. Squad, for your own sake...don\u0027t rush it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T07:47:24Z\u0022 title=\u002201/24/2015 07:47  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by ximrm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2015-01-24T07:56:47Z","Content":"\n\u003Cp\u003EKSP is so not ready for version 1.0. As many others have pointed out, reviewers will tear them apart if they do that.\u003C/p\u003E\u003Cp\u003EBesides the mass of bugs and technical limitations (no multicore, no functional Windows 64-bit client), there still are a lot of corrections and additions they need to do. Some of these are announced for the next release, but until they are out we have no guarantee they will be included in that next release.\u003C/p\u003E\u003Cp\u003E1. New aero model with drag and lift, including sonic effects, including re-entry heating, and the parts needed for these improvements (fairings, interstages, heat shields)\u003C/p\u003E\u003Cp\u003E2. New operation models for rocket engines (make rocket Isp vary with air density, not max fuel flow, done in 3 current mods (BTSM, KIDS, Real Fuels)) and jet engines (see Advanced Jet Engines for more info)\u003C/p\u003E\u003Cp\u003E3. Numerical support in the editor and in flight (some large fraction of what KER, MechJeb, VOID, RCS Build Aid, Precise Node, and other mods provide)\u003C/p\u003E\u003Cp\u003E4. Better spacecraft pod interiors (like what RPM and extensions to it provide)\u003C/p\u003E\u003Cp\u003E5. Better flight visuals (like what EVE with Astronomor\u0027s Pack, HotRockets, and similar mods provide)\u003C/p\u003E\u003Cp\u003E6. Improve UI, especially flight information and controls (like what Editor Extensions, Trajectories, Navball and docking mods, and similar provide)\u003C/p\u003E\u003Cp\u003E7. Better coverage of both core and extra parts (like what Navigation Lights and other good parts mods provides)\u003C/p\u003E\u003Cp\u003E8. Better memory usage (make OpenGL default if needed, get Windows 64-bit working) and other resource usages (multicore)\u003C/p\u003E\u003Cp\u003E9. Better career progression and Kerbal tracking (like Better Than Starting Manned, Final Frontier, and similar mods provide)\u003C/p\u003E\u003Cp\u003E10. Significant effort to fix bugs and other design issues, like fixing all the parts\u0027 numbers (like cost) that often make no sense, especially compared to one another\u003C/p\u003E\u003Cp\u003EThat\u0027s a lot that needs to be added on top of what we have right now with KSP 0.90. I think a minimum of 3 beta releases (0.91, 0.92, and 0.93) have to come out to incorporate that many significant things.\u003C/p\u003E\u003Cp\u003EThen, when 0.93 is out and appears to have no major issues or other shortcomings, they can think of rolling out a tiny bug-fix release and call that 1.0.\u003C/p\u003E\u003Cp\u003EIf they don\u0027t do this, Squad can expect to fail and suffer for it.\u003C/p\u003E\u003Cp\u003EEDIT: Adjusted the wording of #2\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T10:21:22Z\u0022 title=\u002201/24/2015 10:21  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by Jacke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vinsent10","CreatedById":63829,"CreatedDateTime":"2015-01-24T08:37:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norpo\u0022 data-cite=\u0022Norpo\u0022\u003E\u003Cdiv\u003EHave to agree that it\u0027s not ready for full release, but they\u0027ve already announced it, no turning back now.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E a small group of people managed to make squad delay the barn,I\u0027m sure 160\u002B people can do the same but with the release\u003C/p\u003E\n"},{"CreatedByName":"Tuareg","CreatedById":84241,"CreatedDateTime":"2015-01-24T08:38:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jacke\u0022 data-cite=\u0022Jacke\u0022\u003E\u003Cdiv\u003EKSP is so not ready for version 1.0. As many others have pointed out, reviewers will tear them apart if they do that.\u003Cp\u003EBesides the mass of bugs and technical limitations (no multicore, no functional Windows 64-bit client), there still are a lot of corrections and additions they need to do. Some of these are announced for the next release, but until they are out we have no guarantee they will be included in that next release.\u003C/p\u003E\u003Cp\u003E1. New aero model with drag and lift, including sonic effects, including re-entry heating, and the parts needed for these improvements (fairings, interstages, heat shields)\u003C/p\u003E\u003Cp\u003E2. New engine models for rocket engines (make rocket Isp vary with air density, not max fuel flow) and jet engines\u003C/p\u003E\u003Cp\u003E3. Numerical support in the editor and in flight (some large fraction of what KER, MechJeb, VOID, RCS Build Aid, Precise Node, and other mods provide)\u003C/p\u003E\u003Cp\u003E4. Better spacecraft pod interiors (like what RPM and extensions to it provide)\u003C/p\u003E\u003Cp\u003E5. Better flight visuals (like what EVE with Astronomor\u0027s Pack, HotRockets, and similar mods provide)\u003C/p\u003E\u003Cp\u003E6. Improve UI, especially flight information and controls (like what Editor Extensions, Trajectories, Navball and docking mods, and similar provide)\u003C/p\u003E\u003Cp\u003E7. Better coverage of both core and extra parts (like what Navigation Lights and other good parts mods provides)\u003C/p\u003E\u003Cp\u003E8. Better memory usage (make OpenGL default if needed, get Windows 64-bit working) and other resource usages (multicore)\u003C/p\u003E\u003Cp\u003E9. Better career progression and Kerbal tracking (like Better Than Starting Manned, Final Frontier, and similar mods provide)\u003C/p\u003E\u003Cp\u003E10. Significant effort to fix bugs and other design issues, like fixing all the part numbers that make no sense, especially compared to one another\u003C/p\u003E\u003Cp\u003EThat\u0027s a lot that needs to be added on top of what we have right now with KSP 0.90. I think a minimum of 3 beta releases (0.91, 0.92, and 0.93) have to come out to incorporate that many significant things.\u003C/p\u003E\u003Cp\u003EThen, when 0.93 is out and appears to have no major issues or other shortcomings, they can think of rolling out a tiny bug-fix release and call that 1.0.\u003C/p\u003E\u003Cp\u003EIf they don\u0027t do this, Squad can expect to fail and suffer for it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Esorry to disappoint you but this is simply beyond their abilities...\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2015-01-24T08:39:20Z","Content":"\n\u003Cp\u003EHow can it be called complete if half of the crew modules don\u0027t have interior view? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2015-01-24T08:40:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Overfloater\u0022 data-cite=\u0022Overfloater\u0022\u003E\u003Cdiv\u003EHow can it be called complete if half of the crew modules don\u0027t have interior view? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMk3 and mk1 inline IVAs coming soonÃ¢â€žÂ¢ .\u003C/p\u003E\n"},{"CreatedByName":"EndOfTheEarth","CreatedById":24503,"CreatedDateTime":"2015-01-24T08:43:42Z","Content":"\n\u003Cp\u003ENo, I don\u0027t think that it\u0027s ready.\u003C/p\u003E\u003Cp\u003EMy primary reason is that the new update is going to feature a new aerodynamics model, which could mean that our entire intuition about what it means to build rockets in KSP may now be subject to drastic change. If either a) the aerodynamics wind up buggy or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E the aerodynamics wind up contributing to a poor gameplay experience, then this would be a terrible note for Squad to officially release on, and would garner it criticism that could easily (though wrongly) link it to other games on the market that have been released without \u0022being ready\u0022.\u003C/p\u003E\u003Cp\u003EMy two cents? Make the next release Beta .99. Make the bugfix patch 1.0.\u003C/p\u003E\u003Cp\u003EBeyond that, I\u0027m also kind of surprised that KSP is being considered done without one ringed planet. I\u0027m pretty sure that everyone was expecting at least one.\u003C/p\u003E\n"},{"CreatedByName":"OrtwinS","CreatedById":19144,"CreatedDateTime":"2015-01-24T08:46:44Z","Content":"\n\u003Cp\u003EIt\u0027s rushed, it\u0027s madness, you have a beta community, PLEASE USE IT.\u003C/p\u003E\u003Cp\u003EThe media backlash for backtracking on your \u00271.0 imminent\u0027-declaration is preferable to the media \u002B community backlash for going through with the current course of action.\u003C/p\u003E\n"},{"CreatedByName":"Stargate525","CreatedById":53585,"CreatedDateTime":"2015-01-24T09:01:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tuareg\u0022 data-cite=\u0022Tuareg\u0022\u003E\u003Cdiv\u003Esorry to disappoint you but this is simply beyond their abilities...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat people believe that is true is more damning to the devs than anything I can say. The only one that\u0027s not is possibly #8, as that\u0027s a problem with Unity. Everything else has been done by at LEAST one mod. Modders should not have better mastery of a product than the actual developers.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2015-01-24T09:23:48Z","Content":"\n\u003Cp\u003EKSP ready for v1.0, this is a joke right? Seriously? The game is basically unplayable for me right now because of stuttering caused by unity\u0027s GC and they\u0027re talking about leaving beta! \u003C/p\u003E\u003Cp\u003ESquad, we\u0027re all routing for you and for the day you do make it to 1.0, but now is not the time. We\u0027ve only just arrived in the beta phase and after one beta version your saying your ready to release? That just doesn\u0027t make sense, I was expecting quite a number of beta versions, some that added small/trivial new features and a lot that didn\u0027t add anything but just fixed existing things. \u003C/p\u003E\u003Cp\u003EI\u0027m actually really quite tense about this. I\u0027ve loved KSP, played it almost exclusively, made some fun vids and been immersed in a wonderful little universe. But I can\u0027t do any of that currently because of how the game performs, it is impossible to immerse in something that freezes every few seconds (even more impossible to film it) and I\u0027m so limited in what I can create before the game becomes unplayable. I used to build 400\u002B part craft and fly them without problem (just low FPS) and the only real restriction was my creativity. In the last few versions I feel the game has gone from mostly-working to fairly-broken, which is all fine and expected in a alpha/beta stage when there is the assumption that new things will break/effect old things, but there will be fixes. To hear that KSP is going out of beta while still being so buggy is deeply concerning to me.\u003C/p\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2015-01-24T09:41:10Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003EHELL NO!!!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EKSP is not ready for version 1.0. As previous members said the game needs a few more beta releases for bug fixing and balance issues. There are also many things missing and female Kerbals are not the most important thing right now. The tutorials are unplayable, cockpits lack interiors, there is a need for clouds in the atmosphere of the planets, reentry heat is a crucial factor that can be toggled on or off in the difficulty settings, fairings will be good to have with the new aero model, rebalance the tech tree (for the love of God there is a thread the forum devs posted as thread of the month for rebalancing the tech tree) and many more things.\u003C/p\u003E\u003Cp\u003EAnyway there many things that need to fixed for the game in order to think that the game is actually complete. If squad is going for a full release this year, since they mentioned that the beta will take a year to finish, i recommend for the game devs to start a discussion with the community about feature and balance issues. This announcement is very rushed and i think it has to do more with funds being stretched low for continuing developing this game.\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2015-01-24T09:41:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jacke\u0022 data-cite=\u0022Jacke\u0022\u003E\u003Cdiv\u003EKSP is so not ready for version 1.0. As many others have pointed out, reviewers will tear them apart if they do that.\u003Cp\u003EBesides the mass of bugs and technical limitations (no multicore, no functional Windows 64-bit client), there still are a lot of corrections and additions they need to do. Some of these are announced for the next release, but until they are out we have no guarantee they will be included in that next release.\u003C/p\u003E\u003Cp\u003E1. New aero model with drag and lift, including sonic effects, including re-entry heating, and the parts needed for these improvements (fairings, interstages, heat shields)\u003C/p\u003E\u003Cp\u003E2. New engine models for rocket engines (make rocket Isp vary with air density, not max fuel flow) and jet engines\u003C/p\u003E\u003Cp\u003E3. Numerical support in the editor and in flight (some large fraction of what KER, MechJeb, VOID, RCS Build Aid, Precise Node, and other mods provide)\u003C/p\u003E\u003Cp\u003E4. Better spacecraft pod interiors (like what RPM and extensions to it provide)\u003C/p\u003E\u003Cp\u003E5. Better flight visuals (like what EVE with Astronomor\u0027s Pack, HotRockets, and similar mods provide)\u003C/p\u003E\u003Cp\u003E6. Improve UI, especially flight information and controls (like what Editor Extensions, Trajectories, Navball and docking mods, and similar provide)\u003C/p\u003E\u003Cp\u003E7. Better coverage of both core and extra parts (like what Navigation Lights and other good parts mods provides)\u003C/p\u003E\u003Cp\u003E8. Better memory usage (make OpenGL default if needed, get Windows 64-bit working) and other resource usages (multicore)\u003C/p\u003E\u003Cp\u003E9. Better career progression and Kerbal tracking (like Better Than Starting Manned, Final Frontier, and similar mods provide)\u003C/p\u003E\u003Cp\u003E10. Significant effort to fix bugs and other design issues, like fixing all the part numbers that make no sense, especially compared to one another\u003C/p\u003E\u003Cp\u003EThat\u0027s a lot that needs to be added on top of what we have right now with KSP 0.90. I think a minimum of 3 beta releases (0.91, 0.92, and 0.93) have to come out to incorporate that many significant things.\u003C/p\u003E\u003Cp\u003EThen, when 0.93 is out and appears to have no major issues or other shortcomings, they can think of rolling out a tiny bug-fix release and call that 1.0.\u003C/p\u003E\u003Cp\u003EIf they don\u0027t do this, Squad can expect to fail and suffer for it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. Already in the works (but doubtful to the extent you seem to think is a must.) reentry heat would be nice (but DE is just tedious an easily overcame (slap a heat shield on the bottom. Boring.) Maybe pods with heat-shields built-in shuttle-type shielding, but otherwise no random shield part that could just be slapped onto anything (would prevent being able to return parts that are clearly not built for returning.)\u003C/p\u003E\u003Cp\u003E2. New models? Is that really an issue at this point? \u003C/p\u003E\u003Cp\u003E3. Hopefully the Engineer Report will cover Dv at least.\u003C/p\u003E\u003Cp\u003E4. RPM is a nice mod, but not a needed feature (it isn\u0027t going to appeal to a large amount of players.)\u003C/p\u003E\u003Cp\u003E5. Certainly needed and hopefully will get a good workover.\u003C/p\u003E\u003Cp\u003E6. Again, nice to have but not a dire necessity.\u003C/p\u003E\u003Cp\u003E7. More parts means more confusion for new players. Best to keep choices small per mission design (no need to have 10 1.5m engines with only slight stat variations. Better to have three to five clearly different, but practical 1.5m engines.) Late-game advanced versions would be nice to see though. \u003C/p\u003E\u003Cp\u003E8. Memory usage is only a problem with large amounts of mods, even with the 4GB limit. If a player heavily mods the game, that isn\u0027t exactly Squad\u0027s fault. (Let\u0027s not get into the need/want debate over mods.)\u003C/p\u003E\u003Cp\u003E9. The XP system needs some tweaking, and the tech tree could certainly allow for better player choice (Should I choose manned, unmanned, planes?)\u003C/p\u003E\u003Cp\u003E10. Some bugs really DO need fixed (looking at you decouplers!) Part numbers don\u0027t make sense? Really? That\u0027s an issue? Seriously?\u003C/p\u003E\u003Cp\u003EI voted no, but only because I feel a round or two of actual bugfixing needs to happen before they jump to an official release.\u003C/p\u003E\n"},{"CreatedByName":"Jacke","CreatedById":103694,"CreatedDateTime":"2015-01-24T09:49:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003E1. Already in the works (but doubtful to the extent you seem to think is a must.) reentry heat would be nice (but DE is just tedious an easily overcame (slap a heat shield on the bottom. Boring.) Maybe pods with heat-shields built-in shuttle-type shielding, but otherwise no random shield part that could just be slapped onto anything (would prevent being able to return parts that are clearly not built for returning.)\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe aero model is the fix that Squad will be judged on more than any other. Squad has to get it right. That they don\u0027t take the advice of ferram4 and others that have been dealing with this for a long time is very disturbing. And you have to have realistic re-entry heating and damage and destruction because that is a critical part of landing through atmospheres. High speed heating is another sonic speed effect and if they get that right they get re-entry heating too.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E2. New models? Is that really an issue at this point? \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes.\u003C/p\u003E\u003Cp\u003ENew engine models as in a new aero model. Stock rocket engines have fuel flow that varies with atmospheric density, which is wrong. Rocket Isp varies with density. That is literally a one-line fix and is done in at least 3 current mods (Better Than Starting Manned, KIDS, Real Fuels). Jet engines will be more complex. See the Advanced Jet Engine mod for details, but basically the performance of stock jet engines are way way wrong.\u003C/p\u003E\u003Cp\u003EAs Stargate525 has pointed out, everyone of my points except for #8 has been done in at least one mod, some of them several times over. And those mods are popular. And except for large numbers of parts they don\u0027t impact memory or processing that much. What would stop Squad implementing them into stock?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003E10. Some bugs really DO need fixed (looking at you decouplers!) Part numbers don\u0027t make sense? Really? That\u0027s an issue? Seriously?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that decoupler bug looks like it\u0027s going for tenure. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, there are crazy numbers that need fixing. Try comparing prices between parts. Especially related parts like the adaptors.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T10:06:27Z\u0022 title=\u002201/24/2015 10:06  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by Jacke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-01-24T10:05:13Z","Content":"\n\u003Cp\u003EFor a moment of levity, I just wanted to point out that getting 4 out of 5 KSP players to agree on anything is next to impossible, and to take a moment to thank Squad for finally bringing us all together on a topic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2015-01-24T10:06:57Z","Content":"\n\u003Cp\u003EAh. Performance specs, not graphical models. gotcha. Sorry about that. But you are referencing jet engine issues and applying it to the rocket engines, which isn\u0027t accurate. the jet engines may very well see a nerf with the new aero model (see #1.)\u003C/p\u003E\u003Cp\u003EYou said \u0022part numbers\u0022 and i assumed you meant the part model numbers, not the statistics. (It\u0027s late and my comprehension is apparently lacking. My apologies for the misunderstandings.)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlowerChild\u0022 data-cite=\u0022FlowerChild\u0022\u003E\u003Cdiv\u003EFor a moment of levity, I just wanted to point out that getting 4 out of 5 KSP players to agree on anything is next to impossible, and to take a moment to thank Squad for finally bringing us all together on a topic \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere is an overwhelming amount of agreement overall here today, which is most unheard of in these parts. Kudos to Squad, the uniters!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T10:10:49Z\u0022 title=\u002201/24/2015 10:10  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by metl\u003C/strong\u003E\n\u003C/span\u003E\n"}]}