{"TopicId":97609,"ForumId":55,"TopicTitle":"Do you feel KSP is ready for 1.0?","CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2015-01-24T02:37:39Z","PageNum":2,"Articles":[{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-01-24T02:59:51Z","Content":"\n\u003Cp\u003EWhile it may be true that all the features will be done, the game still needs fixes and improvements, such as Unity 5 (Pending release of course), slightly better 64-bit, more bug fixes in general, etc.\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-01-24T03:00:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CptRichardson\u0022 data-cite=\u0022CptRichardson\u0022\u003E\u003Cdiv\u003EIf they properly balance everything, then quite frankly, as far as I can tell it\u0027s ready. I see no glaring super-bugs, only minor quibbles for the most part. If they\u0027ve got the tutorials properly updated, then the game will be just fine. Plenty of far more successful games with far nastier glitches and bugs than KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEver installed a whole bunch of mods? or made a giant space station?\u003C/p\u003E\n"},{"CreatedByName":"enneract","CreatedById":56759,"CreatedDateTime":"2015-01-24T03:01:02Z","Content":"\n\u003Cp\u003EYou don\u0027t add features as you \u0027exit\u0027 beta. You fix bugs. That is it.\u003C/p\u003E\n"},{"CreatedByName":"SubzeroSpartan7","CreatedById":100972,"CreatedDateTime":"2015-01-24T03:01:48Z","Content":"\n\u003Cp\u003ETo be honest with you, with the amount of stuff planned for the next update (so much I am worried how many mods I will be able to use) maybe it will be ready. They are planning to optimize the parts, the economic system, implement a new aero system that may or may not be up to your standards, add resources, new wings, female kerbals, and probably an absolutely insane amount of bug fixing. Unity 5 is a thing that concerns me quite a bit, but it could be changed over later. If they are going to release it they are going to have to fix pretty much every bug in existence and the ones that are created in the addition of new features besides the small ones. If they o somehow manage to accomplish al of this perfectly in one update, than I believe it is ready for beta. \u003C/p\u003E\u003Cp\u003EAs for the reviewers the game is probably going to get bad reviews anyways because of the so-called learning wall and people will not learn how to play. However maybe the only thing missing from a full release would be a full and fleshed out tutorial system.\u003C/p\u003E\n"},{"CreatedByName":"cyoung_mi","CreatedById":92312,"CreatedDateTime":"2015-01-24T03:02:16Z","Content":"\n\u003Cp\u003EI would have liked to see a few more beta releases, sounds like they are cleaning up many of the current issues though.\u003C/p\u003E\u003Cp\u003EWould have been nice to see Unity 5 and 64bit support, as well as multi core support.\u003C/p\u003E\n"},{"CreatedByName":"Thomas988","CreatedById":92699,"CreatedDateTime":"2015-01-24T03:02:39Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EAbsolutely not\u003C/strong\u003E. I love KSP to death, but it puts me in mortal pain to say it is a buggy, featureless, sometimes under-developed mess. Let\u0027s face it: career mode is still pretty \u0022meh.\u0022 Many features exist but hardly mean a thing (Strategies). Science makes no sense, and is as tedious as it is boring. We need, at least, one or two more updates before KSP can actually look like a 1.0, hopefully sometime after Unity 5.\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2015-01-24T03:03:07Z","Content":"\n\u003Cp\u003EN2O how is it you play at all? You said in the other thread it crashes every 15 minutes. On stock, mine locked up a couple times in the VAB switching mirroring on a part, but other than that... Never crashes.\u003C/p\u003E\u003Cp\u003Enot saying hours doesn\u0027t, but I\u0027m not seeing floods of posts about instability. Heavily modded mine will crash above 3G. RAM usage, though. Certainly needs to be optimized, but you seem to be an outlier reliability wise. What gives?\u003C/p\u003E\u003Cp\u003Eobjectively, the career mode is the worst bit, IMHO.\u003C/p\u003E\u003Cp\u003EI voted no on the poll, btw.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-24T03:13:10Z\u0022 title=\u002201/24/2015 03:13  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 24, 2015\u003C/time\u003E by tater\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2015-01-24T03:04:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cyoung_mi\u0022 data-cite=\u0022cyoung_mi\u0022\u003E\u003Cdiv\u003EI would have liked to see a \u003Cstrong\u003Efew more\u003C/strong\u003E beta releases, sounds like they are cleaning up many of the current issues though.\u003Cp\u003EWould have been nice to see Unity 5 and 64bit support, as well as multi core support.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPretty much. Though, as I have pointed out there have been \u003Cstrong\u003E\u003Cem\u003Ezero\u003C/em\u003E\u003C/strong\u003E beta releases. A few more is an understatement.\u003C/p\u003E\n"},{"CreatedByName":"Xavven","CreatedById":100398,"CreatedDateTime":"2015-01-24T03:04:49Z","Content":"\n\u003Cp\u003EIt makes no difference to me!\u003C/p\u003E\u003Cp\u003E1. I already own the game\u003C/p\u003E\u003Cp\u003E2. I\u0027m having a TON of fun in .90\u003C/p\u003E\u003Cp\u003E3. They are adding a ton of cool features for 1.0\u003C/p\u003E\u003Cp\u003E4. Their next version is going to be even MORE fun than the current version\u003C/p\u003E\u003Cp\u003E5. The code will be the same regardless of whether they slap a 1.0 label or a .91 label on it.\u003C/p\u003E\u003Cp\u003E6. They\u0027re going to continue patching the game after 1.0\u003C/p\u003E\u003Cp\u003EMaybe it makes a difference to someone considering buying the game, maybe it makes a difference to reviewers, but it makes absolutely no difference to ME. I\u0027m going to play the next update and I\u0027m going to love it. DEEP SPACE REFUELING IN STOCK!!!!!!!!!!!!\u003C/p\u003E\n"},{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2015-01-24T03:05:24Z","Content":"\n\u003Cp\u003EIt seems the thread got merged and my lovely helpful OP got shunted down, and the titled changed to something very biased.\u003C/p\u003E\u003Cp\u003ECan that be fixed please moderators?\u003C/p\u003E\u003Cp\u003EEDIT: Thanks.\u003C/p\u003E\n"},{"CreatedByName":"m4v","CreatedById":67965,"CreatedDateTime":"2015-01-24T03:06:39Z","Content":"\n\u003Cp\u003Epoll lacks neutral option.\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2015-01-24T03:07:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003Epoll lacks neutral option.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERead the post above yours.\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-01-24T03:08:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hoojiwana\u0022 data-cite=\u0022hoojiwana\u0022\u003E\u003Cdiv\u003E the titled changed to something very biased.\u003Cp\u003E.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESadly, that\u0027s the truth.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-01-24T03:08:11Z","Content":"\n\u003Cp\u003EWish I could move your post Hooj but there\u0027s no tools to do that :/\u003C/p\u003E\n"},{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2015-01-24T03:08:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4v\u0022 data-cite=\u0022m4v\u0022\u003E\u003Cdiv\u003Epoll lacks neutral option.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI felt this subject was something a person would be much less likely to be on the fence over. I may have been wrong about that, but maybe the two options could help those people to pick a side?\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003E@Kasper: Next best option is to edit the OP of the merged thread to include the quote and link and such.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2015-01-24T03:09:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022montyben101\u0022 data-cite=\u0022montyben101\u0022\u003E\u003Cdiv\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/b8gCQbmk0B4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ESorry squad but shouldn\u0027t you at least address some of the major issues before coming out of beta?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan\u0027t agree with you there. Those game are the worst of the worst: bad design down to the core, so buggy that they\u0027re unplayable, not fun, etc. KSP is none of that, even four updates ago. The game is not all it can be, but 1.0 was never to be that point. The last update would be. For a new player KSP is a good and fun package.\u003C/p\u003E\n"},{"CreatedByName":"CptRichardson","CreatedById":269,"CreatedDateTime":"2015-01-24T03:10:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022montyben101\u0022 data-cite=\u0022montyben101\u0022\u003E\u003Cdiv\u003EEver installed a whole bunch of mods? or made a giant space station?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah.\u003C/p\u003E\u003Cp\u003EIt\u0027s kind of ASSUMED that when you start doing crazy edge outlier stuff like heavily modding your game that things will start breaking. Any game will when you start heavily modding it. And \u0027giant space station\u0027 only starts running into issues in the thousands of parts for me. Those aren\u0027t \u0027major stability issues\u0027. You start making calls for \u0027major stability issues\u0027 when certain part combinations in STOCK cause the game to crash on a regular basis. Combinations that a normal person will encounter quickly. Or \u0027200 part rockets explodinate\u0027 without cause, or other major things that cause regular crashes every 10-30 minutes in the normal course of an average player, not the edge cases of crazy people on the forum like you and me. And even with all of the stuff we do, there are a couple of ways to get things going nicer that won\u0027t take a miracle like \u0027Unity 5 arrives\u0027, like spending time working on Directx 11 proper integration. I say KSP is ready, especially now that they\u0027re filling out the content. \u003C/p\u003E\u003Cp\u003EI\u0027d like MORE content, like GP2 or some more contract types, but I\u0027m pretty content with what we have. \u003C/p\u003E\u003Cp\u003EHeck, I\u0027d say KSP is in a better state than Minecraft was at 1.0\u003C/p\u003E\n"},{"CreatedByName":"LABHOUSE","CreatedById":107761,"CreatedDateTime":"2015-01-24T03:12:10Z","Content":"\n\u003Cp\u003EKsp itself is, but unity and some of us are not ready for ksp to be called 1.00 . It is ready for version 1.0, but I still think there should be 99 total releases before version 1.00\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-01-24T03:13:37Z","Content":"\n\u003Cp\u003EI was saying how the game runs out of memory, not becomes buggy. Also how the hell do you get into a thousand parts??? I start getting lag at around 200! and I have an I5 processor!\u003C/p\u003E\n"},{"CreatedByName":"RobotsAndSpaceships","CreatedById":122975,"CreatedDateTime":"2015-01-24T03:13:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LABHOUSE\u0022 data-cite=\u0022LABHOUSE\u0022\u003E\u003Cdiv\u003E but I still think there should be 99 total releases before version 1.00\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo you even know how version numbering works?\u003C/p\u003E\n"},{"CreatedByName":"Demon_82","CreatedById":81626,"CreatedDateTime":"2015-01-24T03:13:54Z","Content":"\n\u003Cp\u003EAnyone has tried any other new game lately? I mean, Sims 4 got 2 free updates for basic features after the launch that were there in the three previous ones, Battlefield 4 still has issues with balancing and netcode... every single game is released plenty of bugs and lacking featutes, not only EA ones. KSP stands pretty well agaisnt that sad reality as it is, I think.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-01-24T03:14:13Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003ENO.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ENot until KSP is running on Unity 5 will it be ready for 1.0. More importantly, all the bugfixes and balance changes need to be the beta test. I\u0027d be fine with getting 0.91 out and THEN going to 1.0, but 0.91 is the beta update, so let us beta test the thing!\u003C/p\u003E\n"},{"CreatedByName":"TheCanadianVendingMachine","CreatedById":59684,"CreatedDateTime":"2015-01-24T03:16:05Z","Content":"\n\u003Cp\u003EWait, where\u0027s my re-entry heat?\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2015-01-24T03:17:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheCanadianVendingMachine\u0022 data-cite=\u0022TheCanadianVendingMachine\u0022\u003E\u003Cdiv\u003EWait, where\u0027s my re-entry heat?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo not reentry heat! That makes the game boring!\u003C/p\u003E\n"},{"CreatedByName":"CptRichardson","CreatedById":269,"CreatedDateTime":"2015-01-24T03:18:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022montyben101\u0022 data-cite=\u0022montyben101\u0022\u003E\u003Cdiv\u003EI was saying how the game runs out of memory, not becomes buggy. Also how the hell do you get into a thousand parts??? I start getting lag at around 200! and I have an I5 processor!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have 200 part rockets.\u003C/p\u003E\n"}]}