{"TopicId":97609,"ForumId":55,"TopicTitle":"Do you feel KSP is ready for 1.0?","CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2015-01-24T02:37:39Z","PageNum":15,"Articles":[{"CreatedByName":"The Joker","CreatedById":44926,"CreatedDateTime":"2015-01-25T01:34:04Z","Content":"\n\u003Cp\u003EIt\u0027s not an asinine argument.\u003C/p\u003E\u003Cp\u003EWhen KSP goes to 1.0, it is considered, effectively, complete and ready for review. Squad may add more features, expansions, or improvements later, but when they make it 1.0 it will go to reviewers. A lot of things in KSP aren\u0027t complete, and with this many features being compacted into one massive update, there\u0027s going to be lots of bugs and issues with it, in edition to how poorly optimized it is already.\u003C/p\u003E\u003Cp\u003EWe\u0027ve only just gotten to Beta. We had 13 updates through Alpha, if I remember correctly, from first release. But we\u0027ve only had just one in Beta. I don\u0027t think this game is really complete. Why is Squad in such a rush?\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-01-25T01:37:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rynak\u0022 data-cite=\u0022rynak\u0022\u003E\u003Cdiv\u003EWell, that would basically simply turn experimental snapshots into unofficial 0.91, 0.92 and so on, and yes it would be reasonable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it would be double-speak onto itself, just basically putting out a whole series of public releases without actually calling them releases.\u003C/p\u003E\u003Cp\u003EThere are a couple of advantages to it though in that they could make it opt-in, so they wouldn\u0027t have to worry about stability or breaking saves from one release to the next as only people that volunteered to be subjected to that level of instability would get involved. They could just put out a ton of versions in a short amount of time correcting bugs and not having to do the big release hooplah and publicity that they tend to for each one, and at the same time still get the massive amount of public testing out of it that tends to come with a public release.\u003C/p\u003E\u003Cp\u003EIt would basically be a way for Squad to leverage the early-access model for testing while still staying true to their word that the next official release will be 1.0. I personally don\u0027t think they should of said that in the first place, but perhaps this is a way to turn lemons into lemonade.\u003C/p\u003E\u003Cp\u003EPut another way: I think if Squad would let us help them here, we could help make certain this was a solid 1.0 release.\u003C/p\u003E\u003Cp\u003EAnd really, it wouldn\u0027t require them altering their development/release model all that much. I could see them even maintaining \u0022private experimentals\u0022 to keep the signal to noise ratio high early on (with too much feedback sometimes being worse than too little), and then once they feel the game is ready for prime-time, then just add in a period of \u0022public experimentals\u0022 to verify that\u0027s actually the case.\u003C/p\u003E\u003Cp\u003EMy question then is what could possibly hurt by a period of public experimentals before release to verify the game is in good shape? It seems to me that Squad could only gain from that. If it really is as solid as they think it is, they\u0027ll breeze through that period in no time. If it\u0027s not, well, then good thing we caught it in time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T01:56:55Z\u0022 title=\u002201/25/2015 01:56  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by FlowerChild\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-01-25T01:41:56Z","Content":"\n\u003Cp\u003EWonder if SQUAD has external investors..\u003C/p\u003E\n"},{"CreatedByName":"metl","CreatedById":82406,"CreatedDateTime":"2015-01-25T01:58:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Joker\u0022 data-cite=\u0022The Joker\u0022\u003E\u003Cdiv\u003EIt\u0027s not an asinine argument.\u003Cp\u003EWhen KSP goes to 1.0, it is considered, effectively, complete and ready for review. Squad may add more features, expansions, or improvements later, but when they make it 1.0 it will go to reviewers. A lot of things in KSP aren\u0027t complete, and with this many features being compacted into one massive update, there\u0027s going to be lots of bugs and issues with it, in edition to how poorly optimized it is already.\u003C/p\u003E\u003Cp\u003EWe\u0027ve only just gotten to Beta. We had 13 updates through Alpha, if I remember correctly, from first release. But we\u0027ve only had just one in Beta. I don\u0027t think this game is really complete. Why is Squad in such a rush?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis thing has already been reviewed by reviewers over and over.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.pcgamer.com/kerbal-space-program/\u0022 rel=\u0022external nofollow\u0022\u003EPC Gamer\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.eurogamer.net/articles/2014-01-31-kerbal-space-program-early-access-review\u0022 rel=\u0022external nofollow\u0022\u003EEurogamer\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.rockpapershotgun.com/tag/kerbal-space-program/\u0022 rel=\u0022external nofollow\u0022\u003ERock, Paper, Shotgun\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.gamespot.com/kerbal-space-program/reviews/\u0022 rel=\u0022external nofollow\u0022\u003EGamespot\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThat was just a quick google. Should I post more? Seriously, once finally looking at things with fresh eyes, it isn\u0027t a big deal for them to go to 1.0.\u003C/p\u003E\n"},{"CreatedByName":"The Joker","CreatedById":44926,"CreatedDateTime":"2015-01-25T01:59:30Z","Content":"\n\u003Cp\u003EBut these reviews kept in mind that the game was Alpha.\u003C/p\u003E\u003Cp\u003EWhen it gets released as 1.0, it will be treated instead as a full game.\u003C/p\u003E\u003Cp\u003EI\u0027d imagine a lot of them would re-review KSP.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-01-25T01:59:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022metl\u0022 data-cite=\u0022metl\u0022\u003E\u003Cdiv\u003EThis thing has already been reviewed by reviewers over and over.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThose are previews, not reviews. Reviews tend to be a lot less forgiving as they\u0027re evaluating things from the standpoint of being a final product. Pre-release, they can be much more accommodating with previews given there\u0027s plenty of room for the developer to make changes and improve things, and bugs are more or less to be expected.\u003C/p\u003E\u003Cp\u003EWhen you see a score/grade on it, then it\u0027s generally a review, and the gaming media has a long history of pretty much being exclusively positive in previews, as companies wouldn\u0027t let them preview and potentially damage the reputation of their unreleased games otherwise.\u003C/p\u003E\u003Cp\u003EEarly access has blurred the lines on it, but previews essentially used to be viewed as \u0022free\u0022 advertising. If you played your cards right you could sometimes score the equivalent of 3 full pages of advertising in a major gaming magazine for the price of airfare and a nice supper.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T02:16:07Z\u0022 title=\u002201/25/2015 02:16  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by FlowerChild\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2015-01-25T02:17:54Z","Content":"\n\u003Cp\u003EI\u0027m not convinced KSP is ready yet. I think that there are way too many loose ends to tie up before the game can be considered complete. \u003C/p\u003E\u003Cp\u003EAre new planets being added? \u003C/p\u003E\u003Cp\u003EAre volcanoes and cryo volcanoes being added? \u003C/p\u003E\u003Cp\u003EWill KSP be 64 bit? \u003C/p\u003E\u003Cp\u003EWill Unity 5 make or break the game? \u003C/p\u003E\u003Cp\u003EAre clouds being added?\u003C/p\u003E\u003Cp\u003EHow do easter eggs tie into the career game?\u003C/p\u003E\u003Cp\u003EWill there be in depth tutorials/guides for the game for new players?\u003C/p\u003E\u003Cp\u003EWill contracts get expanded?\u003C/p\u003E\u003Cp\u003EAdd to that bug fixing all the bugs that have been raised and it\u0027s one humongous job to do in the next update.\u003C/p\u003E\u003Cp\u003EI\u0027m also confused on the issue that if beta version is considered scope complete why are resources being added?\u003C/p\u003E\n"},{"CreatedByName":"rynak","CreatedById":115092,"CreatedDateTime":"2015-01-25T02:27:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027m also confused on the issue that if beta version is considered scope complete why are resources being added? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, that depends on what you call \u0022scope\u0022 and what you call \u0022features inside the scope\u0022. Their \u0022scope\u0022 might simply refer to generic subsystems - take for example contracts.... the system is in place, but could use new features. Honestly, this is one of the cases where i wouldn\u0027t be too hard on them for bending terms.\u003C/p\u003E\u003Cp\u003EInstead, the more questionable thing is why any major things are implemented in the nonexistant \u0022beta\u0022 phase at all - let alone a whole boatload of major features. \u003C/p\u003E\u003Cp\u003EEDIT: Okay, that seems to have become common practice in the industry, but those who deliver halfway polished results, run extremely long beta periods, where the new implementations are just some of the work, with still a majority of the time being spent on polishing\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T02:30:33Z\u0022 title=\u002201/25/2015 02:30  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by rynak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"whiterafter","CreatedById":66064,"CreatedDateTime":"2015-01-25T02:28:51Z","Content":"\n\u003Cp\u003EI am a bit disturbed about how the developer keeps changing the definition of finished. But alas these are problems caused by open Beta. I am happy to see so many features coming in 1.0 and that they will not be giving up everything yet, but I really don\u0027t want to see them getting lazy and slow with everything after that \u003C/p\u003E\u003Cp\u003EEven if they do, we will always have mods \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"rynak","CreatedById":115092,"CreatedDateTime":"2015-01-25T02:31:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022whiterafter\u0022 data-cite=\u0022whiterafter\u0022\u003E\u003Cdiv\u003EEven if they do, we will always have mods \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMods cannot fix core parts of the system - like for example the way planets and oceans are implemented.\u003C/p\u003E\n"},{"CreatedByName":"FlowerChild","CreatedById":74289,"CreatedDateTime":"2015-01-25T02:47:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rynak\u0022 data-cite=\u0022rynak\u0022\u003E\u003Cdiv\u003EWell, that depends on what you call \u0022scope\u0022 and what you call \u0022features inside the scope\u0022. Their \u0022scope\u0022 might simply refer to generic subsystems - take for example contracts.... the system is in place, but could use new features. Honestly, this is one of the cases where i wouldn\u0027t be too hard on them for bending terms.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECome on man...by the definition they\u0027re using I can spend an afternoon throwing together a main menu for a game, and call it \u0022scope complete\u0022 because there\u0027s a menu item for each feature that will eventually be in the game. Sure, the systems aren\u0027t implemented as they will be in the final game, but hey! They\u0027re there!\u003C/p\u003E\u003Cp\u003EThat may make for a good joke in a developer meeting, but you can expect that people will start looking at you weirdly if they think you\u0027re actually serious.\u003C/p\u003E\u003Cp\u003EWhile all these terms like \u0022beta\u0022 may be \u0022just words\u0022, concepts like \u0022feature complete\u0022 are not. Those concepts exist to pretty much prevent, or at least point out the danger of, doing stuff exactly like what\u0027s being done here: releasing games/software with new features that haven\u0027t been properly tested.\u003C/p\u003E\u003Cp\u003ESquad is still adding major new systems, both what are essentially rewrites of old ones (aero), and entirely new ones (resource mining) and no amount of word play changes that.\u003C/p\u003E\n"},{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2015-01-25T02:59:03Z","Content":"\n\u003Cp\u003EI voted yes. Sandbox alone makes this 1.0.\u003C/p\u003E\n"},{"CreatedByName":"Bigbootie","CreatedById":96163,"CreatedDateTime":"2015-01-25T02:59:43Z","Content":"\n\u003Cp\u003EWhatever happens I just hope it all works out and doesn\u0027t sink the game and further development thereof. I really love this game but my unrealistically optimistic expectations for it have not been met. So much potential here.\u003C/p\u003E\n"},{"CreatedByName":"stargazer1235","CreatedById":52505,"CreatedDateTime":"2015-01-25T03:02:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FlowerChild\u0022 data-cite=\u0022FlowerChild\u0022\u003E\u003Cdiv\u003EWhy though?\u003Cp\u003EI\u0027m not sure if they were deceiving themselves or just us with this whole \u0022we\u0027re beta/scope-complete but we\u0027re still adding features\u0022 thing, but they were deceiving someone, as that\u0027s clearly a false and self-contradicting statement. They also made statements implying that this was a beta period that would consist of multiple releases, and now that turns out not to be the case either.\u003C/p\u003E\u003Cp\u003EAnd really, I feel compelled to package that with an apology to Squad, as I absolutely love their game, and don\u0027t like saying it, BUT: they haven\u0027t exactly been behaving in a trustworthy manner as of late.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would like to ask which developers you do fill are trustworthy, because I personally believe there is not such think as a 100% trustworthy company, like people, you can\u0027t trust someone 100% but there are some that are more trustworthy then others. \u003C/p\u003E\u003Cp\u003EHere are some examples: \u003C/p\u003E\u003Cp\u003EFiraxis: They botched up Civ:BE and only relased one patch in over 4 months and have now decided to release a new game. \u003C/p\u003E\u003Cp\u003EStar Dock: Planning to release GalCiv 3 which many people have paid for AT FULL PRICE with many missing features and host of bugs resulting from their new 64x bit engine. \u003C/p\u003E\u003Cp\u003EDoubleFine: Released Space Base DF9 without finishing it and released half a game, the other half we are still waiting. \u003C/p\u003E\u003Cp\u003ESquad: Sqaud has made some questionable statements and decision in the past but they always listen to their community in the end. \u003C/p\u003E\u003Cp\u003ESo what developer do you trust if it isn\u0027t Squad, since I believe they are one of the most trustworthy out there.\u003C/p\u003E\n"},{"CreatedByName":"rynak","CreatedById":115092,"CreatedDateTime":"2015-01-25T03:11:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI would like to ask which developers you do fill are trustworthy, because I personally believe there is not such think as a 100% trustworthy company, like people, you can\u0027t trust someone 100% but there are some that are more trustworthy then others. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrawman argument in the most boring and common way: appeal to extremes, thus excluding the entire range in-between.\u003C/p\u003E\n"},{"CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2015-01-25T03:19:02Z","Content":"\n\u003Cp\u003EI\u0027m writing this post as a frantic, last minute resort as to remind squad what key details are missing in the Kerbal Space Program game.\u003C/p\u003E\u003Cp\u003EThe list, in my opinion, should be added inside the game to make it complete.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1.Re-entry Heating\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESquad, the re-entry heating model now is horrible!\u003C/p\u003E\u003Cp\u003EFirstly, any part in the game would be able to survive re-entry heating.\u003C/p\u003E\u003Cp\u003EAdding actual heating itself would mean that some discarded/unwanted parts would be able to burn up in the atmosphere, instead of\u003C/p\u003E\u003Cp\u003Eacting like a ball of indestructible titanium.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IIiQUni.png\u0022 alt=\u0022IIiQUni.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Ref:Scott manley)re-entry of a probe into the Joolean Atmosphere\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAlso, selective parts, such as capsules, would have heat shields pre-fitted for use. This feature would also be accompanied by parts such\u003C/p\u003E\u003Cp\u003Eas heat shields, inflatable shields and such.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ug4OJDS.png\u0022 alt=\u0022Ug4OJDS.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Ref: Deadly Reentry)A heat shield re-entering kerbin\u0027s atmosphere\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2.Better atmospheres\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAtmospheres such as that of laythe and kerbin are currently based on glowing blue-white balls which look terrible.\u003C/p\u003E\u003Cp\u003EIn real life, atmospheric color is based on the composition of the atmosphere, and the heating curve which looks like this.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GjyJNwg.png\u0022 alt=\u0022GjyJNwg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Ref:public domain,Wikipedia)Color graph, showing stages of temperature color\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis is how the atmosphere of Earth looks like in Space Engine.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/K95cbts.png\u0022 alt=\u0022K95cbts.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E(Ref:Space Engine)Atmospheric snapshot of Earth in Space Engine\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ECurrently, the atmospheric scattering model needs some desperate redoing before KSP is rolled out for the public.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3.Clouds and auroras\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAlso, this is a desperate cry for Squad to finally add clouds into KSP!\u003C/p\u003E\u003Cp\u003EClouds would add more diversity into the skies, making flying a craft much more enjoyable, with all the clouds rushing into your\u003C/p\u003E\u003Cp\u003Eview, rather than seeing a winged craft gliding in the sky, with smoke bubbles billowing out of your engines.\u003C/p\u003E\u003Cp\u003EThis shows a comparison between a kerbin with clouds, and a kerbin without clouds.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/K517PHY.png\u0022 alt=\u0022K517PHY.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E(Ref:google, public domain,Astronomer\u0027s visual pack)Left:Kerbin without clouds Right:Kerbin with clouds\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EPersonally, i think most people would prefer clouds in the game, as it adds a depth of feel into your experience of KSP!\u003C/p\u003E\u003Cp\u003EOh yes, and auroras.\u003C/p\u003E\u003Cp\u003EPersonally adding auroras wouldn\u0027t be much of a task. The towers of glowing plasma can be rendered with a 2d art pass, like how RCS jets are rendered.\u003C/p\u003E\u003Cp\u003EHowever, with the addition of auroras, flying over the poles would be a much more meaningful task. Also, players would be able to identify poles of a planetary body.\u003C/p\u003E\u003Cp\u003EThis is how auroras look like in Space Engine.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PuG5j61.png\u0022 alt=\u0022PuG5j61.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E(Ref:Space Engine)Snapshot of the poles of a planet\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIf Kerbal Space Program becomes as beautiful as possible, our gaming experience would be awesome.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E4.New Skybox, please!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESquad, the skybox desperately needs a new art pass!\u003C/p\u003E\u003Cp\u003EBelow shows a comparison between the current skybox, and a more realistic skybox.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CydeUAv.png\u0022 alt=\u0022CydeUAv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E(Ref:google, public domain,Astronomer\u0027s visual pack)Left:Stock skybox Right:E.V.E. skybox\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe realistic skybox model shows stars that are less blurred out, smaller, and more stars in the sky.\u003C/p\u003E\u003Cp\u003EFurthermore, the galaxy isn\u0027t as blurred out.\u003C/p\u003E\u003Cp\u003EI\u0027ve played Kerbal Space Program with many skyboxes, and honestly, playing with the stock skybox makes the whole space travel a lot less beautiful and fun.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E5.Parachutes\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe parachutes in KSP are horrible. When they open, they stop the craft instantly, like hitting a brick wall.\u003C/p\u003E\u003Cp\u003EIn real life, the craft doesn\u0027t tear apart. But the parachute does.\u003C/p\u003E\u003Cp\u003ESo squad, please make better parachutes that break apart when the craft is too heavy, travelling too fast, or too dense in the atmosphere!\u003C/p\u003E\u003Cp\u003EReal life parachutes have reefing so as to prevent a sudden drop in velocity. Reefing allows more time for the parachutes to open, and let the drag set in gradually.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/M7APlpV.png\u0022 alt=\u0022M7APlpV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E(Ref:NASA)Orion parachute test, reefing.\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EPlease, squad. Make better parachutes!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E6.More planets\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ECurrently KSP has 5 planets and 2 dwarf planets.\u003C/p\u003E\u003Cp\u003ESquad promised a few years back that there would be an addition of a 2nd gas giant, with eeloo being the moon of that planet.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/obLjzgE.png\u0022 alt=\u0022obLjzgE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#808080;\u0022\u003E\u003Cspan style=\u0022font-family:Arial;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(Ref:Texture replacer)craft exploring the re-textured joolean system\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EEeloo was mentioned to have geysers, and be an analog of triton.\u003C/p\u003E\u003Cp\u003EAlso, adding more planets would mean that our kerbal system is more diverse. More science, more planets, more enjoyment!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThats all of my suggestions and missing features that i think should be added in the game before 1.0 is ready. If any of you thinks i missed anything out that should\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Ebe in the game, leave your comment below! Also, please let Squad read this forum post and tell them why they aren\u0027t ready for 1.0!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-I\u0027m aware that Squad has recently left a comment on what they are adding isn\u0027t supposed to be realistic, but instead makes our gameplay more fun.\u003C/p\u003E\u003Cp\u003ETo that, i say, better graphics and non-titanium parachutes make our gameplay fun, too!\u003C/p\u003E\u003Cp\u003E-And to those who insist i use mods.\u003C/p\u003E\u003Cp\u003EMods are not a solution to everything! They are only there as an optional gameplay feature, such as warfare, star wars parts etc.\u003C/p\u003E\u003Cp\u003E-Why i\u0027m referencing space engine in my forum post.\u003C/p\u003E\u003Cp\u003ESpace engine does excellent graphics and rendering. If KSP is going to be a space age simulator, it has got to LOOK like space!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThanks, community and squad!\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T04:11:14Z\u0022 title=\u002201/25/2015 04:11  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by Rdivine\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-01-25T03:22:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stargazer1235\u0022 data-cite=\u0022stargazer1235\u0022\u003E\u003Cdiv\u003ESo what developer do you trust if it isn\u0027t Squad, since I believe they are one of the most trustworthy out there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do believe that their hearts are in the right place, but some of what they\u0027re trying to do may be beyond their skill and experience at the moment. I\u0027m specifically talking about career, which could really use an experience tychoon developer to bring it home.\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003EI don\u0027t know. Maybe that statement isn\u0027t the most productive. Squad have done a good job learning what they\u0027ve needed to to build the game they\u0027ve wanted to. It\u0027s just, maybe a more experienced developer could have really helped the development.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T03:25:54Z\u0022 title=\u002201/25/2015 03:25  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by klgraham1013\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-01-25T03:23:50Z","Content":"\n\u003Cp\u003EI don\u0027t know what else to call this, and I would ask that the moderators *please* don\u0027t give me an infraction or close the thread for suggesting this (although I can\u0027t find it anywhere on the \u0022Do Not Suggest\u0022 list, so...)\u003C/p\u003E\u003Cp\u003EI am of the firm belief that Kerbal Space Program is NOT, I repeat \u003Cstrong\u003E*NOT*\u003C/strong\u003E ready for its 1.0 release just yet.\u003C/p\u003E\u003Cp\u003EI am not alone in this belief, either. A thread asking players whether they thought KSP would be ready for 1.0 in its next release, started just yesterday, has already received 484 votes, \u003Cstrong\u003Ewith more than 76% of players voting NO!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI do not think it would be wise for the future of SQUAD or Kerbal Space Program to push the game to its 1.0 release just yet. If NOTHING else, it needs another publicly-release version to allow additional bug-testing of the feature-complete version by the entire KSP community. If they release as planned/announced, on the other hand, they will expose Kerbal Space Program to potentially vicious reviews by reviewers who will NOT be as kind to a game that is officially in its \u0022complete\u0022 form as they were to KSP back when it was still in Alpha/Beta.\u003C/p\u003E\u003Cp\u003EBesides, isn\u0027t bug-fixing and working out the final kinks what a Beta is for? So far, they\u0027ve only spent one update in Beta- and that was the release that moved Kerbal *INTO* Beta in the first place, so that hardly counts for a \u0022thorough beta-testing cycle\u0022.\u003C/p\u003E\u003Cp\u003EReleasing KSP at version 1.0 would be a \u003Cstrong\u003Every bad idea\u003C/strong\u003E for the future of SQUAD *and* Kerbal. It would hurt SQUAD\u0027s reputation in the long run, and would hurt KSP\u0027s reputation even more (thanks to bad/mixed reviews- there are simply too many bugs left to possibly iron enough out in just one update...)\u003C/p\u003E\u003Cp\u003EI think they can spare the wait for at least one more (bug-focused) update before the final release. Heck, SQUAD has a community on their hands with not one, but *TWO* Cubesat projects currently under works based on community donations. I think if the community is willing to pay to put a satellite in space, we could certainly raise the funds to keep SQUAD\u0027s development cycle going a little longer for the game that inspired us all to do it, eh? If they asked, we\u0027d be \u003Cstrong\u003Emore than willing\u003C/strong\u003E to help them, if money for additional development is really the issue...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T03:26:40Z\u0022 title=\u002201/25/2015 03:26  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-01-25T03:31:03Z","Content":"\n\u003Cp\u003EI\u0027ve started a thread over on the Suggestions and Development forum suggesting that Squad roll back the move to version 1.0 and \u0022release\u0022. I just thought you guys should know:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108465-Roll-back-the-decision-to-jump-to-1-0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/108465-Roll-back-the-decision-to-jump-to-1-0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFeel free to go over there and post on it, to keep it towards the top of the Suggestions/Development sub-forum (so hopefully the mods will see it and Squad will realize this is a major community concern). I encourage you to send your support, but even if you disagree with my opinion, PLEASE don\u0027t troll the thread or start flame wars- the last thing we need is the only thread on Suggestions and Development about this topic to get closed thanks to poor poster conduct... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Nemrav","CreatedById":91029,"CreatedDateTime":"2015-01-25T03:45:16Z","Content":"\n\u003Cp\u003EI remember one quote that from Harvestr that summarizes pretty much what I noticed and hate on this and most other development threads right now... (im paraphrasing though)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWe are currently at a point where no matter what we do, people get very upset about it..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETypically I see a pattern: Person A:\u003C/p\u003E\u003Cp\u003E\u0022hello, squad is a bunch of jerks\u003C/p\u003E\u003Cp\u003E feature x is not in the game, they should at least get y modder to integrate and do something right for once (Charlie Brown), if you do not hold my views, you are a jerk\u0022\u003C/p\u003E\u003Cp\u003Eafter much debate, Squad gets a compromise of what people want and what they invision, Person B:\u003C/p\u003E\u003Cp\u003E\u0022hello, squad is a bunch of jerks\u003C/p\u003E\u003Cp\u003Ethey were so lazy, they just half integrated something and made the rest of it themselves with the compromise in mind, they could have a least implemented feature z, if you dont agree, you are a jerk\u0022\u003C/p\u003E\u003Cp\u003EAnd typically persons A and B were infact the exact same person...\u003C/p\u003E\u003Cp\u003EBut, squad shouldn\u0027t rush things... Just take their time as they always have, then do one more whopper for the 1.0 release...\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-01-25T03:45:46Z","Content":"\n\u003Cp\u003ENuclear reactors?\u003C/p\u003E\u003Cp\u003EAnd more planets?\u003C/p\u003E\u003Cp\u003EVen\u0027s Stock Revamp?\u003C/p\u003E\n"},{"CreatedByName":"klgraham1013","CreatedById":105132,"CreatedDateTime":"2015-01-25T03:45:53Z","Content":"\n\u003Cp\u003EIf they came out and said, in all sincerity, that the reason for this is a lack of budget, I would understand. Otherwise, there is no logical reason for KSP to go gold. I\u0027ve been very forgiving talking about KSP to my friends and have even gotten Squad at least 4 new costumers. If they insist on moving to 1.0. I can not in good faith recommend this game. There will be no more excuses for poor tutorials, un-intuitive UI, an unbalanced career mode, and a lack of necessary information given to the player. I will not be able to recommend this game without including a list of mandatory mods and a link to Scott Manley\u0027s channel. That is unacceptable.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T04:21:18Z\u0022 title=\u002201/25/2015 04:21  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by klgraham1013\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-01-25T03:49:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klgraham1013\u0022 data-cite=\u0022klgraham1013\u0022\u003E\u003Cdiv\u003EIf they came out and said, in all sincerity, that the reason for this is a lack of budget, I would understand. Otherwise, there is no logical reason for KSP to go gold. I\u0027ve been very forgiving talking about KSP to my friends and have even gotten Squad at least 4 new costumers. If they insist on moving to 1.0. I can not in good faith recommend this game. There will be no more excuses for poor tutorials, un-intuitive UI, an unbalanced career mode, and a lack of necessary information given to the player. I will not be able to recommend this game without included a list of mandatory mods and a link to Scott Manley\u0027s channel. That is unacceptable.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree.\u003C/p\u003E\u003Cp\u003E1.0 is more than just another version. It\u0027s Squad saying fully releasing the game. This means that if there are ANY major, and even minor, flaws, that there is no excuse for them. No excuse for a boat-load of bugs, no excuse for a lack of content. \u003C/p\u003E\u003Cp\u003ESquad, please think about this. In all sincerity. Make a few actual Beta releases. Then, begin the systematic destruction of many bugs that plague KSP. And once all is said and done, release KSP as 1.0.\u003C/p\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2015-01-25T03:57:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nemrav\u0022 data-cite=\u0022Nemrav\u0022\u003E\u003Cdiv\u003EI remember one quote that from Harvestr that summarizes pretty much what I noticed and hate on this and most other development threads right now... \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI disagree and I believe they have made it a self-fulfilling prophecy to allow themselves to insulate themselves from community sentiment. Who here would have been upset if the next version was 0.91 or 0.95 or 0.99 versus 1.0?\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2015-01-25T03:57:55Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E@klgraham1013, @Bill Phil\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI agree wholeheartedly with both of you guys. I\u0027d give you reputation if I hadn\u0027t already given out too much rep in a 24-hour period!\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"}]}