{"TopicId":98179,"ForumId":55,"TopicTitle":"Transfer Nodes","CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-01-29T17:08:18Z","PageNum":1,"Articles":[{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-01-29T17:08:18Z","Content":"\n\u003Cp\u003EI came up with this suggestion after reading a thread concerning transfer window indicators and if they should be stock. I thought this idea is different, useful, and elegant enough to warrant its own thread.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108814-Transfer-window-indication\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/108814-Transfer-window-indication\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA transfer node would be like a maneuver node except instead of being placed on a spacecraft\u0027s orbit, it would be placed on a planets orbit. Like a maneuver node it would include 3 dimensions of dV, display the total dV required, and project the resulting orbit with encounters. Transfer nodes could be used to plan transfers between objects orbiting the same body (Kerbin to Duna, or Mun to Minmus, etc). Unlike maneuver nodes, transfer nodes do not directly provide a given space craft with actionable dV and pointing direction, instead they are used discover the desired time to perform a transfer as well as calculating the travel time and dV requirement.\u003C/p\u003E\u003Cp\u003EThe great thing about transfer nodes is they allow for the self discovery of transfer windows and do not need a table full of time/duration/dV trade-offs. They are intuitive similar to maneuver nodes, providing valuable insight into an otherwise arcane orbital mechanics calculation while providing experimentation and self discovery (unlike a table which says launch to Duna now).\u003C/p\u003E\u003Cp\u003ETransfer nodes should be able to be built from the tracking station because they are not space craft specific. You would click on a planets orbit and add a transfer node, then - just a like a maneuver node - you could slide it around the orbit and adjust the dV vectors.\u003C/p\u003E\u003Cp\u003EFor added convenience, a space craft could some how \u0022target\u0022 a transfer node such that the time and required pointing information would show up in flight. There might be some way to display the difference between a crafts maneuver and/or actual orbit and the targeted transfer node to aide placing a craft on the desired transfer. This part could get clunky, maybe someone has an idea how to make the transfer node information to the flight scene, I don\u0027t want these details to detract from the general idea.\u003C/p\u003E\u003Cp\u003ECurrently, to plan a transfer in game, you could try using maneuver nodes on an existing spacecraft. First, this does not allow the planning of a mission pre-launch. But more importantly, in order to determine what time of year a reasonable transfer to Duna exists - for example - using maneuver nodes you are hindered by the comparatively small period of your orbit; using the \u0022next-rev\u0022 feature is cumbersome for more than a few revs. Also, adjusting the direction of the escape maneuver is fidgety if you are zoomed out enough to see your destination. These are the reasons why maneuver nodes are currently insufficient (or overly cumbersome) for transfer window planning.\u003C/p\u003E\u003Cp\u003EI think transfer nodes elegantly solve the transfer window problem in KSP, I think they would fit seamlessly into stock due to their similarity in use and look to maneuver nodes (while still providing a unique function), and I think they solve an important problem for both new and experienced players without hand-holding. Let me know what you think!\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2015-01-29T17:14:38Z","Content":"\n\u003Cp\u003EHmmm. Very interesting proposal. Seems like it would fit the stock game well, and be pretty intuitive as well. I approve!\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2015-01-29T17:15:03Z","Content":"\n\u003Cp\u003EI love it. This would actually make it possible to plan transfers ahead of time. If you have to use regular manouver nodes, it\u0027s always based on where the planet is at that moment (or you have to go forward a thousand orbits, but that\u0027s not viable)\u003C/p\u003E\n"},{"CreatedByName":"rcp27","CreatedById":129752,"CreatedDateTime":"2015-01-29T18:39:55Z","Content":"\n\u003Cp\u003ESounds like a really good idea. I find planning planetary transfers quite awkward because there is no straightforward way to \u0022plan ahead\u0022 to get a feel for when a good transfer window might be. Equally, I might want to just get there ASAP, but need to figure out just how overpowered I need to build my craft to get there. Equally, this could work for moons, for example planning a Mun to Minmus transfer, or transferring between moons of Jool.\u003C/p\u003E\n"},{"CreatedByName":"Damien_The_Unbeliever","CreatedById":129715,"CreatedDateTime":"2015-01-29T18:57:39Z","Content":"\n\u003Cp\u003EYes, this sounds good.\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-01-29T23:10:52Z","Content":"\n\u003Cp\u003EThanks for the support!\u003C/p\u003E\u003Cp\u003EI just wanted to point out that there are several other threads on enhanced maneuver nodes in the \u0022What\u0027s already suggested\u0022 thread. Those other ideas address the fidgetyness of maneuver nodes when doing transfers - which is a real problem. The Transfer Node idea stands apart from those other suggestions by making transfer window information discoverable to the user and, depending on how transfer node information is made available to crafts in flight, would provide an alternative of messing with a maneuver node while zoomed out enough to see the destination planet. Instead, you would setup a transfer node and then, when it came time to start the transfer, you would build a maneuver node to match the preplanned transfer.\u003C/p\u003E\n"},{"CreatedByName":"wizzlebippi","CreatedById":85324,"CreatedDateTime":"2015-01-30T00:31:06Z","Content":"\n\u003Cp\u003EHere\u0027s my $.02\u003C/p\u003E\u003Cp\u003EAdd orbital planning to the tracking center. Basically, pick your destination from the map, jog forward in time from present to transfer window and be able to pause, and plot your transfer orbit. Then, launch at the right time and execute. Even make it a tracking center upgrade. It would be a great use for the warp to fuction they\u0027re adding.\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-01-30T20:09:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022wizzlebippi\u0022 data-cite=\u0022wizzlebippi\u0022\u003E\u003Cdiv\u003EHere\u0027s my $.02\u003Cp\u003EAdd orbital planning to the tracking center. Basically, pick your destination from the map, jog forward in time from present to transfer window and be able to pause, and plot your transfer orbit. Then, launch at the right time and execute. Even make it a tracking center upgrade. It would be a great use for the warp to fuction they\u0027re adding.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for your input wizzlebippi! What do you mean by \u0022transfer window\u0022, would KSP know when to make lowest cost burns to a certain destination? Maybe I\u0027m missing something, but I think your idea misses out on the flexibility transfer nodes would provide. Not only for transfers of various dV and duration but also from any source to any destination.\u003C/p\u003E\n"},{"CreatedByName":"Fuzzy Dunlop","CreatedById":27329,"CreatedDateTime":"2015-01-30T22:22:40Z","Content":"\n\u003Cp\u003EThis is one of the best ideas I\u0027ve seen on the forums! I also think we should have a sort of stock version of Kerbal Alarm Clock, so manuever nodes, transfer nodes, encounters etc, would all appear on a \u0022Launch Calander\u0022 and give you alerts when they\u0027re abou to occur.\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2015-01-31T01:30:25Z","Content":"\n\u003Cp\u003EI would love to have some sort of long-term orbital planning available, probably in the Tracking Center, and this sounds like a great way to do it. I don\u0027t want the game to tell me \u0022BTW, transfer window coming up!\u0022; I just want to be able to mess around with maneuver nodes without having to already have a ship there.\u003C/p\u003E\n"},{"CreatedByName":"CaptRobau","CreatedById":41695,"CreatedDateTime":"2015-01-31T13:23:20Z","Content":"\n\u003Cp\u003EGreat idea! You have my support.\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2015-02-02T22:44:21Z","Content":"\n\u003Cp\u003EAfter thinking about it, I think a feature like this would need a solid way to connect with maneuver nodes. I think this is a really strong idea, a powerful and elegant tool to help planning transfers between two SOI\u0027s themselves orbiting the same object. In the original post I didn\u0027t want to detract from the strength of this idea by muddling through that I thought at the time was secondary details - specifically how a Transfer Node could be communicated to the player for a given ship in flight. Because KSP is gearing up for 1.0 (and pretending this idea would actually be included), Transfer Nodes would need to be more neatly integrated than \u0022just a maneuver node that doesn\u0027t tell you which way to burn\u0022.\u003C/p\u003E\u003Cp\u003ETake a transfer from Kerbin to Duna, a Transfer Node basically tells you \u0022if your ship were Kerbin, burn at this time, in this direction for this dV and you will get to Duna\u0022. (As I explained in the original post this allows you to find and plan transfers - including optimal \u0022transfer windows\u0022 - without charts pr other out of game lookups, and with a familiar interface similar to maneuver nodes) Of course your ship is not Kerbin; somehow you need that Transfer Node information communicated to you in a way that allows you to build a maneuver node.\u003C/p\u003E\u003Cp\u003EIn the example of a transfer from Kerbin to Duna the Transfer Node exists in the reference frame of Kerbol. When the time comes to make the transfer you will be building a maneuver node in the reference from of Kerbin in order to make the escape from Kerbin and into the transfer orbit. KSP could display a dV indicator for the difference between the Transfer Node and the state of your ship as soon as you exit Kerbin\u0027s SOI presuming you executed the maneuver in question. The problem with this approach is to get to the exact transfer you specified (I think) your ship would have to be phased exactly right in it\u0027s orbit around Kerbin. In reality, the phase of your ship shouldn\u0027t matter around Kerbin in order to get to Duna. Is this only a problem for OCD players?\u003C/p\u003E\u003Cp\u003EI would appreciate it if you could help me imagine how \u0022Transfer Nodes\u0022 would translate to actionable information \u0022burn this much, in this direction, at this time\u0022 or better yet \u0022make a maneuver that accomplishes this\u0022. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2015-02-02T22:45:56Z","Content":"\n\u003Cp\u003ENice one. Fully support this. Rep to you sir!\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-02-03T01:59:52Z","Content":"\n\u003Cp\u003ESimplest way of visualizing transfers I\u0027ve heard yet, it builds on the player\u0027s existing knowledge of maneuver nodes and could use the same interface. If it can be made to automatically make a maneuver node for the actual burn itself it would be just about perfect. Great idea.\u003C/p\u003E\n"}]}