{"TopicId":98607,"ForumId":55,"TopicTitle":"SKYLON and RAPIERS.","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-02-02T23:44:34Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-02-02T23:44:34Z","Content":"\n\u003Cp\u003ENow that we have decently giant Mk3 parts for spaceplanes, I think that we very much need the RAPIER to be a 2.5m engine. Maybe also a small model for a 1.25m version as well, but to make a proper SKYLON-like spaceplane, we need the high thrust of a 2.5m part. To facilitate this of course, giant air intakes and for completion, jet engines as well, would be needed.\u003C/p\u003E\n"},{"CreatedByName":"prophet_01","CreatedById":111502,"CreatedDateTime":"2015-02-03T07:28:20Z","Content":"\n\u003Cp\u003EAlthough you are right about the need of 2.5 sized engines for the bigger space planes, I would like to see the air intake abuse being fixed first. Otherwise we will see even more of those weired air breathing booster stages... the words \u0022giant air intakes\u0022 already make me worry. Of course you can always say \u0022everyone is allowed to play a single player game the way they want\u0022 and I absolutely agree on that, but the aerodynamics and air breathing mechanics currently are the features that feel most unbelievable within the game to me.\u003C/p\u003E\u003Cp\u003EOnce we have something that feels (not necessarily is) closer to being realistic, I will fully support this\u003C/p\u003E\n"},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-02-03T09:51:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022prophet_01\u0022 data-cite=\u0022prophet_01\u0022\u003E\u003Cdiv\u003EAlthough you are right about the need of 2.5 sized engines for the bigger space planes, I would like to see the air intake abuse being fixed first. Otherwise we will see even more of those weired air breathing booster stages... the words \u0022giant air intakes\u0022 already make me worry. Of course you can always say \u0022everyone is allowed to play a single player game the way they want\u0022 and I absolutely agree on that, but the aerodynamics and air breathing mechanics currently are the features that feel most unbelievable within the game to me.\u003Cp\u003E Once we have something that feels (not necessarily is) closer to being realistic, I will fully support this\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell aerodynamics should be coming in the next update so in theory intake spam should be fixed by then.\u003C/p\u003E\n"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-02-03T13:40:42Z","Content":"\n\u003Cp\u003EI forgot to mention that I also firmly believe that the way jet engines are built in game should be redone. The engine is not the nozzle, and you can\u0027t just place air intakes anywhere.\u003C/p\u003E\n"},{"CreatedByName":"Capt Snuggler","CreatedById":65092,"CreatedDateTime":"2015-02-03T15:16:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GregroxMun\u0022 data-cite=\u0022GregroxMun\u0022\u003E\u003Cdiv\u003EI forgot to mention that I also firmly believe that the way jet engines are built in game should be redone. The engine is not the nozzle, and you can\u0027t just place air intakes anywhere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m glad to see there are others out there who are willing to keep fighting that battle. \u003C/p\u003E\u003Cp\u003ESadly I think we were defeated long ago by those hoards waving the drool stained \u0022FuN\u0022 banner.... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E:kiss:\u003C/p\u003E\n"},{"CreatedByName":"zeel","CreatedById":89647,"CreatedDateTime":"2015-02-04T02:16:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt Snuggler\u0022 data-cite=\u0022Capt Snuggler\u0022\u003E\u003Cdiv\u003EI\u0027m glad to see there are others out there who are willing to keep fighting that battle. \u003Cp\u003ESadly I think we were defeated long ago by those hoards waving the drool stained \u0022FuN\u0022 banner.... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E:kiss:\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem with a more realistic engine design is that real aircraft can have their engines and fuselage designed from the ground up to work properly and be aerodynamic. In KSP we have to build with predefined parts - if the jet engine part was a big long tube like it should be, it would severely limit the designs that are possible. Instead we have a bunch of smaller bits that we fit together in ways that may or may not resemble a jet engine. As players we have to simply assume (as with RCS and EC routing) that the Kerbal engineers know how to build the inside parts of our plane so that it will actually work, and that all the important internal workings of the engine are in there somewhere. Willing suspension of disbelief is an important factor.\u003C/p\u003E\n"}]}