{"TopicId":99036,"ForumId":55,"TopicTitle":"Contract system Changes","CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-02-07T23:23:15Z","PageNum":1,"Articles":[{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-02-07T23:23:15Z","Content":"\n\u003Cp\u003EJudging by numerous posts, I am not alone in thinking that the contracts system in its current implimentation has some issues, so I\u0027d like to make some suggestions:\u003C/p\u003E\u003Cp\u003E*Issue #1: Science flows too easily,\u003C/p\u003E\u003Cp\u003EIn my current career game, Ive pretty much stopped the old biome harvesting tactic... my contracts supply all the needed science.\u003C/p\u003E\u003Cp\u003EI propose that we remove *all* science rewards from contracts (While the rep to science admin strategy should still work, as should a nerfed funds to science strategy).\u003C/p\u003E\u003Cp\u003EWe already have contracts that tell you to go to a specific location, with a specific part.\u003C/p\u003E\u003Cp\u003ESo have the game check your science archives, unlocked science instruments, bodies already visited (ie, after the exlore contract) and give contracts to go to biome X and get science data Y.\u003C/p\u003E\u003Cp\u003EIn this system, \u003Cstrong\u003Ethe game simply gives you funds and directs you to go out and get science the \u0022old fashioned\u0022 way\u003C/strong\u003E - no infitite generic \u0022science data from around X\u0022 where an orbiting probe with a thermometer gives unlimited (though at a slow rate) science.\u003C/p\u003E\u003Cp\u003E*Issue #2: Contracts become grindy and boring doingthe same types of missions over and over again with random parameters.\u003C/p\u003E\u003Cp\u003EDo you really want to launch a 5th satellite? Do you really want yet another habitat for kerbals in Kerbin orbit? probably not.\u003C/p\u003E\u003Cp\u003EWhat you probably do want is to go do something new.\u003C/p\u003E\u003Cp\u003ESo this proposal would be more of a change, 2 contract catagories - \u0022exploration\u0022 and \u0022economic\u0022:\u003C/p\u003E\u003Cp\u003EEconomic - These are your simple launch satelites, build stations/surface bases, etc. These pay funds and rep, but no science.\u003C/p\u003E\u003Cp\u003ERescue missions would go here.\u003C/p\u003E\u003Cp\u003EI guess I would include the survey missions, even though those can net you science too.\u003C/p\u003E\u003Cp\u003EPart tests go here, and yield no science - these tests are always for parts you haven\u0027t unlocked/purchased yet. They don\u0027t give you science, but they do let you temporarily use the experimental parts (contract parameters should be set for each part... don\u0027t tell me to test a jet on Mun, or a booster in orbit - go ahead and tell me to test an aerospike on eve though, or a jet on laythe, or an ion engine in Moho orbit... etc)\u003C/p\u003E\u003Cp\u003EExploration contracts are basically predefined: like the explore contracts, the altitude contracts, and so forth. These contracts set out milestones for the player to accomplish - possibly include contracts like those I suggested about visiting specific biomes with specific science instruments.\u003C/p\u003E\u003Cp\u003EMost of these are scripted:\u003C/p\u003E\u003Cp\u003ECurrently, the scripted contracts start the player off just going higher and higher (assuming a total noob that doesn\u0027t know how to get to orbit).\u003C/p\u003E\u003Cp\u003EI propose we add some speed or speed\u002B altitude contracts after a player manages to get to space/exceed the ~50km altitude contracts... to sort of guide them into orbit.\u003C/p\u003E\u003Cp\u003EAdd a new contract for docking in space (it can check for new vessels, can it check that two vessels were launched seperately, and then docked?).\u003C/p\u003E\u003Cp\u003E-No rescue contracts would appear until this one is completed-\u003C/p\u003E\u003Cp\u003Efollow with \u0022orbital rendevous around body X\u0022 contracts- At least one of the docked craft needs to have its trip logger record that it landed on the body.\u003C/p\u003E\u003Cp\u003EThere would be seperate limits on the number of contracts you can accept for each catagory (until the final tier upgrade, where contracts are unlimited).\u003C/p\u003E\u003Cp\u003ESo taking an explore contract doesn\u0027t conflict with your ability to launch satelittes and such in the meantime.\u003C/p\u003E\u003Cp\u003E*Issue #3: Scripted contracts aren\u0027t appearing\u003C/p\u003E\u003Cp\u003ESometimes the game starts offering you contracts to put sats in orbit around bodies you haven\u0027t visited, and the explore contract won\u0027t come up.\u003C/p\u003E\u003Cp\u003EOther times, you\u0027ll cross its SOI before the contract comes up... the contract is forever lost to you, and you get no funds for the achievement.\u003C/p\u003E\u003Cp\u003EMost people rarely see the intermediate altitude contracts between exceeding 5,000 m, and reaching space.\u003C/p\u003E\u003Cp\u003ESuggestion: Scripted contracts would auto complete even if not accepted - you would lose the advance funds, but still gain the rewards.\u003C/p\u003E\u003Cp\u003EI think that if these sugestions were followed, the game progression would be better and less grindy.\u003C/p\u003E\u003Cp\u003ENewer players would have contracts leading them in the right direction at least as far as getting to orbit. Rewarding new players for adding some horizontal velocity instead of just encouraging them to fly straight up (as with the altitude contracts) is a good thing.\u003C/p\u003E\u003Cp\u003EAlso I think contracts sending you to biomes to fill out your science archives is a good thing: You\u0027re going there because you\u0027re missing data, and its not random, and you won\u0027t have to do it again. You cross a biome off your list in the archives, and have some semblance of progress/ that you accomplished something, instead of just visiting yet another of an unending set of random coordinates.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-07T23:32:14Z\u0022 title=\u002202/07/2015 11:32  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 7, 2015\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSK","CreatedById":61025,"CreatedDateTime":"2015-02-08T10:28:47Z","Content":"\n\u003Cp\u003EI\u0027m not sure how well this would work in-game, but I thought I\u0027d just throw this out as a discussion point.\u003C/p\u003E\u003Cp\u003ELets get rid of science.\u003C/p\u003E\u003Cp\u003EOr more accurately, lets split the current Science system into pure and applied research. Everything that the current Science system does (tech tree progress and use within strategies) becomes Applied Research. Then you have Pure Research as either something that\u0027s given to you as a contract for monetary gain, or something that you can add to your missions to generate bonus reputation.\u003C/p\u003E\u003Cp\u003EApplied Research is gained from:\u003C/p\u003E\u003Cp\u003EBuilding spacecraft (borrowing this idea from Kerbal Construction Timer).\u003C/p\u003E\u003Cp\u003ELanding on, walking on or orbiting around celestial bodies.\u003C/p\u003E\u003Cp\u003EReturning craft from orbit.\u003C/p\u003E\u003Cp\u003EParts test contracts.\u003C/p\u003E\u003Cp\u003EMaterials bay tests, \u003Cem\u003Ein flight or in space.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EMystery goo observations \u003Cem\u003Ein flight or in space\u003C/em\u003E (I\u0027m rationalising this by assuming that Mystery Goo is biological. Observing biological systems in space drives research into life support systems).\u003C/p\u003E\u003Cp\u003ETemperature and pressure readings. (Knowing about thermal or aerodynamic stresses on your spacecraft is helpful for building better spacecraft.)\u003C/p\u003E\u003Cp\u003EApplied Research therefore becomes something that partly happens automatically as you undertake missions (to reflect your space program\u0027s increasing experience and competence) but is also partly player driven so that tech tree progress doesn\u0027t become a scripted sequence of missions that you need to do to get any further.\u003C/p\u003E\u003Cp\u003EPure Research is gained from everything else - sample returns, EVAs, gravioli and seismic measurements, and materials/mystery goo observations landed at various biomes. I\u0027m lumping EVAs into Pure Research because, from an engineering point of view, it really shouldn\u0027t matter whether I do an EVA flying above a desert, a mountain range or an ocean.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-08T10:38:26Z\u0022 title=\u002202/08/2015 10:38  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 8, 2015\u003C/time\u003E by KSK\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pertrep","CreatedById":136947,"CreatedDateTime":"2015-02-09T02:24:38Z","Content":"\n\u003Cp\u003EFor unimaginative goal oriented achievers who get off on working out how to do fiendishly difficult things with some elegance, Career Mode is a must. It is however, as suggested, a simple construct trying to meet the needs of complicated minds and needs an overhaul along the lines suggested. One additional area, trivial though it seems (I thought I had posted on this but it seems to have gone astray), is how to keep track of all those contracts once you have unlocked Unlimited Contracts, especially when you are trying to use a single launch to fulfill two or three contracts over a long period of time, while other flights are in progress and other vehicles are being built. A two character alphanumeric Contract Number would be handy, as in: log it in the alarm clock, put it in the vehicle name etc. It would also be useful to be able to flag contracts (yellow perhaps) that you have already committed resources to, instead of searching each craft each time to find out what contracts already have a launch.\u003C/p\u003E\n"}]}