{"TopicId":99675,"ForumId":55,"TopicTitle":"Please integrate Infernal Robotics into stock - synergy with resource system and aerodynamics","CreatedByName":"riocrokite","CreatedById":129319,"CreatedDateTime":"2015-02-14T19:21:16Z","PageNum":1,"Articles":[{"CreatedByName":"riocrokite","CreatedById":129319,"CreatedDateTime":"2015-02-14T19:21:16Z","Content":"\n\u003Cp\u003EI know it\u0027s late for this feature to be implemented in 1.0, but maybe for 1.1? With resource and feature coming it will become even more important to build compact and extendable modules that will fit nicely in fairing.\u003C/p\u003E\u003Cp\u003EFor me Infernal Robotics mod is one of the best features in KSP lego blocks game out there. It\u0027s like meta-mod that supports lots of designs and other mods. And it has many advantages over parts that are animated (controlling movement/rotation, can attach other parts to moving stuff etc). For example shuttle arm, rotating engines, wheels etc. However to utilize its full potential it needs some support and love so it works correctly with other KSP elements within KSP constraints (i.e. docking ports).\u003C/p\u003E\u003Cp\u003ENearly every part for space exploration uses robotics to some degree.\u003C/p\u003E\u003Cp\u003ELet\u0027s have a look, 1969, moon landing and extendable wheels on rover:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://www.hq.nasa.gov/alsj/a15/ap15-KSC-371C-171-4.jpg\u0022 alt=\u0022ap15-KSC-371C-171-4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eshuttle arm:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.newscientist.com/data/images/ns/cms/dn9421/dn9421-1_700.jpg\u0022 alt=\u0022dn9421-1_700.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESpace station arm:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.redorbit.com/media/uploads/2012/10/0171.jpg\u0022 alt=\u00220171.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Emars rover with several robotics parts.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.wired.com/images_blogs/design/2012/08/curiostyrover.jpg\u0022 alt=\u0022curiostyrover.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EKSP has lots of parts to build rovers, shuttles, space stations and planetary bases. And that\u0027s great. That\u0027s why Infernal Robotics integrated into stock would enhanced greatly building potential that KSP already has.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003ERio\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2015-02-14T20:00:47Z","Content":"\n\u003Cp\u003EThe last official word was that \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/63308-Rotators-%28with-pics%29?p=865419\u0026amp;viewfull=1#post865419\u0022 rel=\u0022external nofollow\u0022\u003EHarvesteR liked the idea of robotic and mechanical parts\u003C/a\u003E, but no word on whether it would be implemented.\u003C/p\u003E\u003Cp\u003EThat said, it\u0027s on the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36863-What-not-to-suggest\u0022 rel=\u0022external nofollow\u0022\u003Elist of things not to suggest\u003C/a\u003E because it\u0027s been discussed so much, so I\u0027ll close this thread.\u003C/p\u003E\n"}]}