{"TopicId":101518,"ForumId":69,"TopicTitle":"Game very glitchy and crashes repeatedly","CreatedByName":"FilmForce","CreatedById":99037,"CreatedDateTime":"2015-03-07T11:09:37Z","PageNum":1,"Articles":[{"CreatedByName":"FilmForce","CreatedById":99037,"CreatedDateTime":"2015-03-07T11:09:37Z","Content":"So I decided to boot up KSP for the first time in a few months, and I was greeted with some pretty strange stuff.\n\nFirst of all, the Kerbal Space Center itself sometimes looks very broken and the terrain is just black. After a minute it returns to it\u0027s normal state, but there are still many visual glitches in the VAB. \n\nInside the VAB there is a lot of lag and sometimes I\u0027m unable to edit or build anything at all, because all the parts turn transparent, as if there is no base part.\n\nThe game crashed a lot the first few times, but it\u0027s stopped doing that; now it just freezes, and I have to force-close it. I did find some old mods in my mods folder, but the glitches persist even after I deleted them.\n\nI play on Mac OSX 10.6.8 on Steam, and I have tried rebooting it many, many times as well as deleting the local content.\n\nDoes anyone know what\u0027s going on?"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-03-07T12:01:34Z","Content":"Yes, a Unity3D update broke anti-aliasing on the proprietary Linux and OSX graphics drivers, though it\u0027s fine with the open source Linux driver that\u0027s no help for Mac owners.\n\nAlso, the new PPFX edge highlighting doesn\u0027t work properly on non Nvidia hardware, this is a fault or oversight by the Unity3D plugin developer.\n\nPlease disable anti-aliasing and PPFX in your Settings and restart KSP, if a Unity3D update fixes these issues before 1.0 it\u0027ll likely be used, otherwise both anti-aliasing and edge highlighting will be of by default on these platforms with the note that here be dragons.\n\nAnti-aliasing should already be off by default when AMD drivers are detected, as it\u0027s been a problem for some time."},{"CreatedByName":"FilmForce","CreatedById":99037,"CreatedDateTime":"2015-03-08T10:28:08Z","Content":"I haven\u0027t played KSP in a while, so I decided to boot it up again to see what changes had been made.\n\nThe first problem I encountered was that the HUD would often flash on and off and looked pretty broken for a few seconds. There were also a lot of visual glitches in the VAB, like the Kerbals on the floor standing still and flashing on and off.\n\nSometimes it randomly crashed whenever I pushed a button; which button doesn\u0027t seem to matter. I eventually got a spacecraft into orbit, but the game then crashed when I entered IVA. \n\nI had some mods installed, but it was still as broken when I deleted them. A lot of people told me to turn off anti-aliasing, but that didn\u0027t work either.\n\nI run KSP on a Mac OSX Snow Leopard 10.6.8, using Steam. Here\u0027s a crash report I received:\n\nProcess: KSP [4202]\n\nPath: /Users/alexandertendeland/Library/Application Support/Steam/SteamApps/common/Kerbal Space Program/KSP.app/Contents/MacOS/KSP\n\nIdentifier: unity.Squad.Kerbal Space Program\n\nVersion: Unity Player version 4.5.5f1 (4.5.5f1)\n\nCode Type: X86 (Native)\n\nParent Process: launchd [106]"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2015-03-10T00:16:03Z","Content":"Some more information would help. Start by reading the [Stock Support \u0026 Bug Reporting Guide](https://forum.kerbalspaceprogram.com/threads/92230-%21%21%21-PLEASE-READ-BEFORE-POSTING-%21%21%21-Stock-Support-Bug-Reporting-Guide). The most important pieces:\n\n- A copy of the Player.log after causing the issue\n- Screenshots or video of the glitches\n- Your computer\u0027s specs\n- KSP\u0027s graphics settings\n\nAlso, threads merged."}]}