{"TopicId":101560,"ForumId":69,"TopicTitle":"Minimum Specs for 0.90","CreatedByName":"dayman-v-nightman","CreatedById":139200,"CreatedDateTime":"2015-03-08T21:49:12Z","PageNum":1,"Articles":[{"CreatedByName":"dayman-v-nightman","CreatedById":139200,"CreatedDateTime":"2015-03-08T21:49:12Z","Content":"Hey guys I have unmodded 0.90 installed on my laptop, but it lags horribly and is unplayable. I want to upgrade my specs but unsure if it is a RAM or Graphics card issue. \n\nWhat are the minimum specs required to run 0.90 smoothly? \n\nCheers"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-03-09T00:14:50Z","Content":"Well, what are you setting the graphics to? Dropping overall resolution and texture res helps. On a related note, do things become more playable when you\u0027re not near a body with oceans? Similarly, how many parts do your craft have?\n\nI\u0027m able to run KSP on an ancient desktop, but it was a workstation in a previous life.\n\nCore2Duo 6600 @2.4 GHz, 4 GiB of ram, ATI FireGL v7200 (think Radeon X1800)"},{"CreatedByName":"LumberJack400","CreatedById":67663,"CreatedDateTime":"2015-03-09T08:30:03Z","Content":"Firstly specs would help a lot (if you\u0027re on windows type \u0027DxDiag\u0027 into the search bar and open the application, then there should be a button to save the log, save it then copy/paste it here or on pastebin).\n\nHave you updated any drivers recently (specifically GPU drivers)\n\nLike Umbral said try turning your setting down, if someone is having FPS issues I usually tell them to go to the lowes settings on everything (no AA, Low obj/Rex detail etc) and work the way up until you get at least a smooth 30FPS, turning the resolution down can help but make sure not to set it on like 300x220 or you\u0027ll have a \u0027fun\u0027 time trying to navigate the game."},{"CreatedByName":"dayman-v-nightman","CreatedById":139200,"CreatedDateTime":"2015-03-11T09:14:59Z","Content":"Thanks a lot guys,\n\nSpecs are as follows:\n\n4GB Ram,Intel Core 2 Duo CPU\n\n@ 2.10 Ghz.\n\nIt\u0027s a pretty old laptop, but I\u0027ll try turning down the specs and see if it makes a difference"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-03-14T03:39:56Z","Content":"If nothing else, crank down resolution to minimum and turn V-Sync off. That should improve performance dramatically."}]}