{"TopicId":103173,"ForumId":69,"TopicTitle":"Cant select or manipulate any part of my spacecraft","CreatedByName":"subatenome","CreatedById":139457,"CreatedDateTime":"2015-04-01T20:34:07Z","PageNum":1,"Articles":[{"CreatedByName":"subatenome","CreatedById":139457,"CreatedDateTime":"2015-04-01T20:34:07Z","Content":"Hey, I\u0027m having a very weird glitch for instance I\u0027m not able to click on any part of my spacecraft, so basically I cannot modify any part, move it around or place new parts. first I thought that the left click was not working but then I realized that I was still able to click on the menu buttons and I was still able to right-click some parts of the spacecraft to modify their configuration anyhow whenever I clicked the launch button the game would somehow freeze, it would still be running but every single button in-game would grey out and the game would basically never launch the spacecraft, this glitch only happens with one specific airplane that I was developing, after placing an engine underneath the wing the glitch triggered can someone look into my ship file and help me please!\n\nThanks in advance\n\n[https://www.dropbox.com/s/qvz2h6vst5qe84n/untitled%20folder%202.zip?dl=0](https://www.dropbox.com/s/qvz2h6vst5qe84n/untitled%20folder%202.zip?dl=0)\n\nps inside the file theres a picture of what happened after clicking the launch button"},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2015-04-05T07:36:01Z","Content":"I saw your file and picture, I had the same problem but havent found a workaround for it. If I find a fix I\u0027ll post again here.\n\nWelcome to the forums."},{"CreatedByName":"Tom7896","CreatedById":140502,"CreatedDateTime":"2015-04-05T15:36:14Z","Content":"\u003E \n\u003E I saw your file and picture, I had the same problem but havent found a workaround for it. If I find a fix I\u0027ll post again here.\n\u003E Welcome to the forums.\n\nThank you. It\u0027s nice to know that I\u0027m not the only one!"},{"CreatedByName":"subatenome","CreatedById":139457,"CreatedDateTime":"2015-04-06T02:33:10Z","Content":"Thanks!!!"},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2015-04-10T08:41:12Z","Content":"I\u0027m sorry to say that the only workaround I found is to completely edit out all bugged parts from the .craft file. Or simply redoing your craft from scratch. Most of the time, the amount of work that has to be done to clean the file is greater than the amount you\u0027ll waste redoing the craft so that\u0027s what I recommend.\n\nUntil the .craft files are more user and editor friendly, this will be the only way to go."}]}