{"TopicId":107187,"ForumId":69,"TopicTitle":"KSP.exe crash upon scene change (from map to flight scene) during physics time warp","CreatedByName":"DataBlossom","CreatedById":142890,"CreatedDateTime":"2015-05-03T14:45:30Z","PageNum":1,"Articles":[{"CreatedByName":"DataBlossom","CreatedById":142890,"CreatedDateTime":"2015-05-03T14:45:30Z","Content":"Version 1.0 (1.0.1/1.0.2? [steam v on auto update]) Windows 7 64-bit (AMD chip \u0026 GTX gpu\u0027s, standard stuff~) Stock KSP, no mods\n\nSimple crash: In flight, 10-30 kilometers above Kerbin, during 4x physics warp, scene change from flight to map, back to flight, sudden crashes.\n\nThis first time this happened I was flying a simple jet to Kerbin\u0027s north pole for science collection. I didn\u0027t think it would be persistent so I don\u0027t remember the exact conditions. Simply flying 4x acceleration to get there quick, over an hour of flight I\u0027d say, and then a crash. I was quite frustrated so I made a new vessel (simple rocket with science modules), enabled cheats (infinite fuel, no destruction to parts, hack gravity) and again, in flight to north pole, physics warp, scene change, game crashed. Knowing KSP, knowing Unity, and knowing my PC, it tallied it up to bad luck. But this morning it happened *again.* No mods, beefy PC, no random software that would interfere, I\u0027m at a loss. I haven\u0027t been able to find this bug on the forums, and it\u0027s getting rather annoying, I imagine it might have something to do with new aerodynamics (I haven\u0027t played since v0.23 or so) and maybe I\u0027m pushing the game too hard with physics acceleration and rapidly changing back and forth from map to check my trajectory. Perhaps dual monitors and KSP in full screen causes graphics crashes? Maybe this is just something that was caused by patch and will be fixed soon as it could already be known and in the works for a fix. Crash does not seem to produce an error log, though that might be something Steam alters. I\u0027ve put off playing KSP for the full release since last summer probably because I was hoping to avoid this kind of frustration inducing bugs; with any luck, it\u0027s something I\u0027m doing wrong and not the game itself. Anyone had similar experiences?\n\n**\\*Edit: Tried again, this time, no physics acceleration. Managed to land near pole, collect science data, went to map to reorient and head back to KSC, left map back to flight scene, game crashed. Scene changes have always been an issue for me, I really hope this is fixed soon. It\u0027s frustrating not being able to utilize simple game elements like the map.**\n\nGonna check the forums to see about map issues, and delete this post and comment in the appropriate thread if necessary.\n\n**\\*Edit #2:** Still haven\u0027t seen anything quite like this in Support. Tried ***again.***Simple rocket launched from KSC, en route to north pole region of Kerbin. Debugged no max temperatures, infinite fuel, unbreakable joints, no crash damage, entered a suborbital trajectory. On reentry, this time, no physics acceleration, coming in hot, throttled engine to slow decent, game crashed, not even an error window popped up, the game just vanished from desktop. Maybe this is the 64 bit version, but I figured on Steam it would be the stable 32 bit, as there\u0027s no way I know of to specify which version you want to download. I did actually get an error log, it\u0027s a jazillion pages long.\n\nThis is the craft.\n\n![tumblr_nnsahoLuoU1rcqqcjo1_400.png](https://40.media.tumblr.com/d49f6fe04eee5a75e853863e6993d8ec/tumblr_nnsahoLuoU1rcqqcjo1_400.png)\n\nBeginning of Error Log:\n\n\u0022Unity Player [version: Unity 4.6.4f1\\_99f88340878d]\n\nKSP.exe caused an Access Violation (0xc0000005)\n\n in module KSP.exe at 0023:012fae2b.\n\nError occurred at 2015-05-03\\_120014.\n\nF:\\SteamLibrary\\steamapps\\common\\Kerbal Space Program\\KSP.exe, run by Karl.\n\n41% memory in use.\n\n0 MB physical memory [0 MB free].\n\n0 MB paging file [0 MB free].\n\n0 MB user address space [104 MB free].\n\nWrite to location 00100000 caused an access violation.\n\nContext:\n\nEDI: 0xffcb37d4 ESI: 0x536462bc EAX: 0x00000000\n\nEBX: 0xffcb37d4 ECX: 0x00040001 EDX: 0x00000000\n\nEIP: 0x012fae2b EBP: 0x0015f304 SegCs: 0x00000023\n\nEFlags: 0x00010216 ESP: 0x0015f2f8 SegSs: 0x0000002b\u0022\n\nI of course have no idea what that means, or how to interpret the Stack after it, nor the output log which changed normal line reading to this:\n\n\u0022DynamicHeapAllocator out of memory - Could not get memory for large allocationCould not allocate memory: System out of memory!\n\nTrying to allocate: 2097152B with 4 alignment. MemoryLabel: DynamicArray\n\nAllocation happend at: Line:334 in \n\nMemory overview\u0022\n\nEssentially I feel like anything at this point can trigger a crash. I guess I\u0027ll go back to waiting for the game to get a stable patch.\n\n**Edited \u003Ctime datetime=\u00222015-05-03T17:25:02Z\u0022 title=\u002205/03/2015 05:25  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 3, 2015\u003C/time\u003E by DataBlossom**\n  \nNew info, new info"},{"CreatedByName":"Tr1stan","CreatedById":143071,"CreatedDateTime":"2015-05-04T23:01:11Z","Content":"Same problem here!\n\nTried to fly to North and Southpole...tried to quicksave and restart before the crash happens...crashed regardless. It seems like this is a new error with 1.0\n\nNever experienced a crash before..only when I try to fly to the poles."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-04T23:35:23Z","Content":"I think you should take a look at the stickied threads, there\u0027s one on a memory issue that may also be causing you problems."},{"CreatedByName":"DataBlossom","CreatedById":142890,"CreatedDateTime":"2015-05-10T17:43:42Z","Content":"Memory leak from atmospheric heating? Is this still not patched? If that\u0027s the problem, there are like five other posts similarly made I\u0027ve seen. A week later and I tried like for the 5th time to fly a plane to the pole. Just a crash again, no error report, just the program closes down completely. Shouldn\u0027t this stuff have been fixed during experimentals? I\u0027m starting to lose faith in this game. Alpha versions felt more stable than this. The whole, \u0022Oh, just F10 or debug it away\u0022 seems kind of absurd: shouldn\u0027t have to **turn off game features** just to run smoothly. Well, here\u0027s to waiting for another patch o/"},{"CreatedByName":"MadCatCarter","CreatedById":134788,"CreatedDateTime":"2015-05-11T16:23:19Z","Content":"\u003E \n\u003E Memory leak from atmospheric heating? Is this still not patched? If that\u0027s the problem, there are like five other posts similarly made I\u0027ve seen. A week later and I tried like for the 5th time to fly a plane to the pole. Just a crash again, no error report, just the program closes down completely. Shouldn\u0027t this stuff have been fixed during experimentals? I\u0027m starting to lose faith in this game. Alpha versions felt more stable than this. The whole, \u0022Oh, just F10 or debug it away\u0022 seems kind of absurd: shouldn\u0027t have to **turn off game features** just to run smoothly. Well, here\u0027s to waiting for another patch o/\n\nI have the same problem during flights to the poles, haven\u0027t tried in a rocket yet, but various objects on my craft are being damaged by aerodynamics reaching speeds of 200-300 and after a while regardless of map or time acceleration changes game seems to crash... Is there a community fix for this mem leak from atmos anywhere in the meantime? I\u0027ve found it frustratingly difficult to follow the various bug and fix threads since 1.0 launch."}]}