{"TopicId":107575,"ForumId":69,"TopicTitle":"Bug with jet fuel useage ingnoring cross fuel settings","CreatedByName":"Vorg","CreatedById":74652,"CreatedDateTime":"2015-05-05T02:49:37Z","PageNum":1,"Articles":[{"CreatedByName":"Vorg","CreatedById":74652,"CreatedDateTime":"2015-05-05T02:49:37Z","Content":"Was trying to make a jet for a mission. A row if the second size tanks for the center with an LTV30 on the back, then 2 tanks, one each side with the basic jet engine. No parts between the center tanks and the side tanks and no fuel lines. The jets pulled from all the tanks including the center line tanks. But the rocket engine could only access center tanks. Also could not transfer fuel to center tanks.\n\n**Edited \u003Ctime datetime=\u00222015-05-06T10:52:54Z\u0022 title=\u002205/06/2015 10:52  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by Supernovy**"},{"CreatedByName":"Vareo","CreatedById":143133,"CreatedDateTime":"2015-05-05T17:05:42Z","Content":"I have been experiencing the same thing. It seems like every single part on a Spaceplane has fuel crossfeed. When I use a jet engine it drains the fuel equally out of every single tank on the plane, regardless how the tank is connected to the engine thats running. At first I thought this might be intended, because I had the tanks next to the one that the engine was supposed to run of, but it always does that, no matter with what you have connected the extra tanks. Now I have the tanks connected with structural pylons where the description clearly states \u0022no fuel crossfeed\u0022 and it still drains the liquid fuel out of those tanks.\n\nAnd to make this a proper Bug Report:\n\nKSP Version: 1.0.2 (Steam)\n\nSystem: Windows 7 64 Bit\n\nScreenshot: *Edit: at least for me the image does not seem to show, so if thats the case use this* [*http://imgur.com/TjbXwyn*](http://imgur.com/TjbXwyn)\n\n![TjbXwyn](http://imgur.com/TjbXwyn)\n\nI think that this is a specific issue just for spaceplanes and crafts from the SPH.\n\nNo crash reports to be had and I don\u0027t think that the system specs are of any use here.\n\nAnd last I just want to say, that I don\u0027t want to sound like I\u0027m just a complainer, because KSP and the 1.0 release have been awsome. Thanks for that great game!\n\n**Edited \u003Ctime datetime=\u00222015-05-05T17:12:58Z\u0022 title=\u002205/05/2015 05:12  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 5, 2015\u003C/time\u003E by Vareo**\n  \nimage not loading"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-05T17:10:08Z","Content":"This is intended behavior, air breathing engines now draw fuel from all tanks in a stage equally, starting with the highest stage. Stage is determined by the number of decouplers between the tank and root part, not the staging icon list. The idea is that aircraft will remain more balanced than if the typical front-to-back fuel crossfeed was used.\n\nYou can get tricky with decouplers to make tanks drain in the order you prefer."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-05T17:10:29Z","Content":"Jet engines will draw from all liquid fuel in the same stage now, you can use decouplers and edit the stage list to control jet fuel draw to some extent (they should drain one stage at a time).\n\nHe wears black pyjamas and sneaks around.\n\nPosting in threads with nary a sound.\n\nHe\u0027s the ninja Red Iron Crown.\n\n**Edited \u003Ctime datetime=\u00222015-05-06T06:48:02Z\u0022 title=\u002205/06/2015 06:48  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by sal\\_vager**"},{"CreatedByName":"Vareo","CreatedById":143133,"CreatedDateTime":"2015-05-05T18:25:37Z","Content":"I think you don\u0027t see the problem. I know that it is intended for the fuel to be drained equally from all tanks, but you can\u0027t stop that from happening with decouplers. I\u0027ve tried. As you see in the picture it the side tanks are only connected by structural pylons and struts which have no fuel crossfeed. I don\u0027t think it is intended for fuel to pass through parts that have the line \u0022no fuel crossfeed\u0022 in their description."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-05T18:41:31Z","Content":"Fuel crossfeed doesn\u0027t apply to air-breathers, that is only for rocket engines (including the LF-only LV-N). Left unchecked an air-breather will drain all LF in a vessel, no matter where it is. The only way to prevent it is to disable the tank in the right-click menu.\n\nYou can, however, prioritize which tanks get drained first, those with more decouplers between tank and root part will drain first.\n\n**Edited \u003Ctime datetime=\u00222015-05-06T10:52:41Z\u0022 title=\u002205/06/2015 10:52  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 6, 2015\u003C/time\u003E by Red Iron Crown**\n  \nFixed an error."},{"CreatedByName":"Vareo","CreatedById":143133,"CreatedDateTime":"2015-05-05T19:16:54Z","Content":"Ok, now I see what you guys meant with the use of decouplers. Sorry to be a bit slow on the uptake there and thanks for enlightening me. \n\nEven though I really dont like that feature then, but thats my personal opinion and nothing that needs discoussing here. So I guess it was intended after all"},{"CreatedByName":"Vorg","CreatedById":74652,"CreatedDateTime":"2015-05-06T02:33:37Z","Content":"Need to find a better way then loading down with decouplers you don\u0027t need."},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2015-05-06T03:58:49Z","Content":"\u003E \n\u003E Fuel crossfeed doesn\u0027t apply to air-breathers, that is only for rocket engines (including the LF-only LV-N and the RAPIER in rocket mode). Left unchecked an air-breather will drain all LF in a vessel, no matter where it is. The only way to prevent it is to disable the tank in the right-click menu.\n\u003E You can, however, prioritize which tanks get drained first, those with more decouplers between tank and root part will drain first.\n\nI feel like this decision was a slight oversight because it can really screw with spaceplanes. Perhaps an option to set the jet engine\u0027s fuel fuel-draining behavior could be the solution."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-06T10:27:14Z","Content":"\u003E \n\u003E I feel like this decision was a slight oversight because it can really screw with spaceplanes. Perhaps an option to set the jet engine\u0027s fuel fuel-draining behavior could be the solution.\n\nAs I understand it this behavior for air breathers was implemented to make spaceplanes easier. Because they will drain all tanks in a stage at the same rate instead of draining one tank after another, the CoM shifts less as fuel drains under the new system.\n\nIt is like any system, though, in that not knowing how it works can create situations that bite you; knowing how it works allows you to take advantage of that behavior."},{"CreatedByName":"JoCRaM","CreatedById":84138,"CreatedDateTime":"2015-05-06T15:07:20Z","Content":"It makes simple designs easier, but it makes it much harder to be creative.\n\nI recognise it is probably an overall improvement, however I have the following suggestions:\n\nAs an interim fix make enable/disable/toggle fuel flow from a tank an action group item.\n\nDocking ports and launch clamps should (but don\u0027t currently) count as decouplers for the calculation.\n\nIf you\u0027re going to allow \u0022no fuel crossfeed\u0022 parts to cross feed fuel, make them count as a decoupler.\n\n- alternately add radial and stack parts that count as a decoupler for the calculation.\n\nMost importantly, In the old system you could compensate with fuel lines, in the current system you can\u0027t. Please add jet fuel line logic. Possibly add a new \u0022jet fuel line\u0022 part. At a rough guess the logic should be:\n\n - any part fed by a fuel line is treated as a decoupler for the stage calculation, but is considered to be \u0022after\u0022 the decoupler.\n\n - any part feeding a fuel line is considered to be in the stage the fuel line is connected to iff that stage is \u0022before\u0022 the current stage\n\nhere the root node is \u0022after\u0022 everything else, and in most cases the engines are before everything else"},{"CreatedByName":"Vorg","CreatedById":74652,"CreatedDateTime":"2015-05-07T03:29:42Z","Content":"For my craft it screwed it up by not following the cross flow laws. They drain from the rocket tanks, but the rockets can\u0027t drain from the jets. That is wrong. I am not far enough along in the tech tree from fuel lines (though they really should be much sooner), so the craft got screwed up. putting all the fuel tanks in line makes the craft too long and because the rockets still pull from the farthest end, it still has massive balance problems. In fact it makes it worse, not better.\n\nCall it a bug in the design, but it is still a bug. changing the subject doesn\u0027t change that fact."},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-05-07T04:49:06Z","Content":"How does one do drop tanks under this new system? Say you have a plane with a bunch of tanks all over, but you want to use up the fuel in your wing-mounted drop tanks first (so, like, they can be dropped)."},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2015-05-07T08:05:06Z","Content":"\u003E \n\u003E How does one do drop tanks under this new system?\n\nSTAGE\\_PRIORITY\\_FLOW should drain from those droptanks first, before other tanks, due to the decoupler. If it does not, that\u0027s a bug."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-07T13:08:20Z","Content":"\u003E \n\u003E How does one do drop tanks under this new system? Say you have a plane with a bunch of tanks all over, but you want to use up the fuel in your wing-mounted drop tanks first (so, like, they can be dropped).\n\nMore explicitly:\n\n- Make sure the root part is in the main body of the aircraft (this is usually so but worth mentioning because it is required)\n\n- Mount drop tanks on decouplers, those tanks will drain before the aircraft body\n\n- If you have another set of drop tanks meant to drain before the others, they need to mount to the first drop tanks with decouplers or mount to the aircraft body with *two* stacked decouplers.\n\n**Edited \u003Ctime datetime=\u00222015-05-07T14:17:12Z\u0022 title=\u002205/07/2015 02:17  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 7, 2015\u003C/time\u003E by Red Iron Crown**"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2015-05-07T13:31:33Z","Content":"Unfortunately the behaviour of the STAGE\\_PRIORITY\\_FLOW mode is only indirectly related to the number of decouplers between the engine and the root, it actually depends on an internal stage number that each part is assigned during the loading of the vessel. Making any changes to the flow mode to treat other parts as decouplers would involve totally changing how it works or else risk various, very hard to diagnose, bugs in the system.\n\nI think the best solution that is even remotely likely to be implemented is to allow the user to change the flow mode that each jet engine uses via a tweakable, then you would be able to set your engines to behave in the old way if it suited your vessel better."},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2015-05-07T14:44:38Z","Content":"\u003E \n\u003E More explicitly:\n\u003E - Make sure the root part is in the main body of the aircraft (this is usually so but worth mentioning because it is required)\n\u003E \n\u003E - Mount drop tanks on decouplers, those tanks will drain before the aircraft body\n\u003E \n\u003E - If you have another set of drop tanks meant to drain before the others, they need to mount to the first drop tanks with decouplers or mount to the aircraft body with *two* stacked decouplers.\n\nSounds good. Thanks."},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-05-08T00:26:53Z","Content":"\u003E I think the best solution that is even remotely likely to be implemented is to allow the user to change the flow mode that each jet engine uses via a tweakable, then you would be able to set your engines to behave in the old way if it suited your vessel better.\n\n\u002B1\n\ncurrent sytem is not really ergonomic and intuitive via the root workaround when building launcher that use jet engines, for exemple, as they tend to suck the top stages first wich is not what you intend usually.\n\n**Edited \u003Ctime datetime=\u00222015-05-08T01:45:01Z\u0022 title=\u002205/08/2015 01:45  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 8, 2015\u003C/time\u003E by WinkAllKerb\u0027\u0027**"}]}