{"TopicId":109861,"ForumId":69,"TopicTitle":"Flight stick and controller issues","CreatedByName":"Vivid Vault","CreatedById":136344,"CreatedDateTime":"2015-05-18T22:44:37Z","PageNum":1,"Articles":[{"CreatedByName":"Vivid Vault","CreatedById":136344,"CreatedDateTime":"2015-05-18T22:44:37Z","Content":"I use two Logitech 3D Extreme Pros. I fly with both pretty often in quite a few games, even those that you would think you would only use one flight stick. I learned that KSP does not support two flight sticks (atleast 2 of the same kind). It seems to get confused over which flight stick I am using. It switches between both flight sticks at random. I have to relaunch KSP a few times before it finally connects to the flight stick on the right hand side. I have tried switching the flight sticks physically, tried to switch the USB ports they were in, it doesnt matter. I even tried to rename the devices from \u0022Logitect 3D Extreme\u0022 to \u0022Logitech 3D Extreme 1\u0022 and then the other 2. Did not work. For what ever reason, KSP has a hard time recognizing the different between the two flight sticks and gets them confused. What is odd though, is that I can press the actual buttons and KSP will recognize \u0022Button 5, Joystick 2\u0022 same for the other \u0022Button 5, Joystick 1\u0022 It works with all the buttons, but it does not identify Axis. Axis X for example, seems to be the same Axis on either joystick. I would jsut unplug the flight stick, but 2 things. 1 Every time I unplug the flight stick, it resets my settings in a few games that I have to redo every time I plug it back in. I don\u0027t know why. 2. It is quite a pain to reach behind the computer and do that every time I play KSP, especially since I play many games in a single day. Is there a solution? or am I SOL?"},{"CreatedByName":"Leedle","CreatedById":144902,"CreatedDateTime":"2015-05-28T20:15:36Z","Content":"[http://forum.kerbalspaceprogram.com/threads/118981-Settings-keep-resetting](https://forum.kerbalspaceprogram.com/threads/118981-Settings-keep-resetting)\n\nThe steps provided help fix it. And since you\u0027re using a non modded install - you should be fine (i.e. running through steam -- if you do). I\u0027d stay clear of the joysticks until Squad/Unity can fix it - or just do the steps everything time."}]}