{"TopicId":110319,"ForumId":69,"TopicTitle":"Glitch with Unmanned Probes","CreatedByName":"MadChris48","CreatedById":112853,"CreatedDateTime":"2015-05-22T01:15:39Z","PageNum":1,"Articles":[{"CreatedByName":"MadChris48","CreatedById":112853,"CreatedDateTime":"2015-05-22T01:15:39Z","Content":"Yesterday I launched a ship headed to the Joolian system. Unmanned probe. Did my usual launch thing and when I got to the appropriate segment of the launch i opened the map view to drop a maneuver node. That\u0027s when I noticed the icon representing a probe on the orbit track was missing. Thought this was kinda weird, but went ahead a circularized. Popped out of map view, and then went to the Space Center via button at top of the HUD. When I went to the Tracking Station, there was no probe in orbit. \n\nThen I started testing, and noticed that when launching any unmanned probe the vessel has no icon in the map view (even when sitting on the launch pad), and if i get it to orbit it will not persist after going back to the Space Center. \n\nI even installed Remote Tech to try and spur some life back into the probes. With RT installed, I could see the signal line to the vessel, but there was no icon present on the orbit track and the vessel would not persist after returning to the Space Center. \n\nCrew carrying capable vessels are unaffected. I tested with both a occupied vessel and an unoccupied vessel controlled by a probe core. They have the appropriate icons and persist after orbital insertion. \n\nI\u0027m confused as to what happened and it puts a huge damper on my game to not be able to launch unmanned vessels. Any ideas?"},{"CreatedByName":"ghostbuzzer7","CreatedById":138096,"CreatedDateTime":"2015-05-22T01:54:57Z","Content":"About your probe issue, I encounter the same problem however, did you set your tracking center to look for probes or anything in the upper left hand corner of the gui. If you did not that may be your problem. As far as I know though, most probe icons seem to not render on occasions or may\u0027be considered debris, so make sure you go check that. Lastly, make sure the probe has electricity if not... farewell lost probe. I know for a fact my landers attached to my command pod don\u0027t have an icon post undocking. Hope this helps."},{"CreatedByName":"MadChris48","CreatedById":112853,"CreatedDateTime":"2015-05-22T02:52:25Z","Content":"After messing around with it some more in game, I figured there wasn\u0027t a good way to fix it. So then I started messing around with persistence file. didnt think about the quicksave files, and accidentitly deleted it all in the process. whateve\u0027s. new career in the works. (real bummer, only had 1 node left in the tech tree and 5 mil in the bank. le sigh). thanks anyways. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-24T08:04:40Z","Content":"You can just enable probe tags with the icon bar at the top of the map or tracking station, mouse over the top edge to see it pop down, give it a try ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"}]}