{"TopicId":110646,"ForumId":69,"TopicTitle":"I made a booboo","CreatedByName":"Aaron Also","CreatedById":144689,"CreatedDateTime":"2015-05-24T15:42:35Z","PageNum":1,"Articles":[{"CreatedByName":"Aaron Also","CreatedById":144689,"CreatedDateTime":"2015-05-24T15:42:35Z","Content":"So, I was in the process of pruning out the unused parts from my Game Data folder and decided I didn\u0027t need the stock Mk3 space plane parts. I deleted everything with \u0022Mk3\u0022 in the file name thinking I wouldn\u0027t miss anything. I checked my paths and was pretty sure all was good, but when the game loaded I immediately noticed that the \u00222.5m to Mk2\u0022 - \u0022C7 brand Adapter 2.5m to 1.25m\u0022 and C7 brand Adapter Slanted 2.5m to 1.25m\u0022 stock parts are all missing their textures. None of the other parts were affected that I can tell. Apparently those three parts share a texture with the Mk3 parts. \n\nSo, if someone could help me out and send the texture to my email along with the path info that would be super duper awesome squossum. (That\u0027s part squirrel part opossum) \n\nThe path to the .cfg files is: /Game Data/Squad/Parts/FuelTank/adapterTanks \n\nTIA, \n\n-A.A."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-24T15:52:32Z","Content":"Hi Aaron Also, where did you buy KSP? ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI\u0027m afraid no-one can send you the files but we can help you re-install them."},{"CreatedByName":"Aaron Also","CreatedById":144689,"CreatedDateTime":"2015-05-24T16:15:31Z","Content":"That was a direct purchase from Squad, I assume, cause I don\u0027t do the Steam thing. I never really thought about reinstalling kinda worried that would screw up the mods I have installed. \n\nPlease do tell..."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-24T16:20:56Z","Content":"You can re-download the full game zip or the installer from your Squad store account [**\\[here\\]**](https://kerbalspaceprogram.com/kspstore/), just login and click the \u0022My Account\u0022 button to go to your account page ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nInstalling over the top of your existing game should work fine, as most addons go in their own folder which Squad files won\u0027t touch."}]}