{"TopicId":114257,"ForumId":69,"TopicTitle":"Change in shadows between 1.0.3 and 1.0.4?","CreatedByName":"ev0","CreatedById":116691,"CreatedDateTime":"2015-06-26T16:19:03Z","PageNum":1,"Articles":[{"CreatedByName":"ev0","CreatedById":116691,"CreatedDateTime":"2015-06-26T16:19:03Z","Content":"Did something change with the shadows between 1.0.3 (and earlier) and 1.0.4? With the same exact settings, in 1.0.4 I\u0027m now getting these shadow lines on top of the KSC buildings that I wasn\u0027t seeing before even in 1.0.3.\n\nKerbal Space Program - 1.0.4.861 (WindowsPlayer)\n\nOutput log, settings.cfg, and System Specs in the dropbox link below.\n\n[https://www.dropbox.com/sh/xrcqjrm3vtebrny/AACjoh2_5EbpHwH25tcYMlrXa?dl=0](https://www.dropbox.com/sh/xrcqjrm3vtebrny/AACjoh2_5EbpHwH25tcYMlrXa?dl=0)\n\n\\*Redirect to imgur to see the album. That shadows are hard to see if the images are too small.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/ICBPY)\n\n**Edited \u003Ctime datetime=\u00222015-06-26T18:21:27Z\u0022 title=\u002206/26/2015 06:21  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 26, 2015\u003C/time\u003E by ev0**"},{"CreatedByName":"ev0","CreatedById":116691,"CreatedDateTime":"2015-06-27T04:39:36Z","Content":"Hmmm no hints as to what could be wrong? I redownloaded the game, but the problem is still there.\n\nHere\u0027s another album. Open it up and click through the pictures, and you can notice that the shadow lines move from left to right (and repeat, and repeat, and repeat...). Also, perhaps related, my screenshots are no longer directly readable by Imgur. I have to open them up in a program and resave them for Imgur to be able to recognize them for upload.\n\nResetting Shadow Cascades from 1 to 4 \u0022fixes\u0022 the problem, but my weakish laptop doesn\u0027t do well with shadows, and this problem is brand new (not even in 1.0.3).\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/fB80U)"},{"CreatedByName":"ev0","CreatedById":116691,"CreatedDateTime":"2015-06-29T12:54:57Z","Content":"I fixed my problem to my liking. Either run in OpenGL to reduce the jaggedness of the shadows by a good amount, or change the setting for Render Quality to simple or fast to simply just get rid of the building shadows / all shadows, respectively. Works good enough for me.\n\nIt\u0027s still weird though. If I zoomed in, the shadows would look totally normal and smooth. But if I zoom out, any shadows outside a certain view radius would be horribly jagged and flicker with any slight camera movement. There\u0027s a very clear border between the smooth shadows and jagged shadows, based on how close you\u0027re zoomed in on something. Brand new problem starting with 1.0.4.\n\nAnyway, my \u0022fix\u0022 leaves me satisfied for now."}]}