{"TopicId":115631,"ForumId":69,"TopicTitle":"Orbits, nodes are unstable and numbers always seem to be changing randomly","CreatedByName":"SalehRam","CreatedById":138066,"CreatedDateTime":"2015-07-11T11:18:13Z","PageNum":1,"Articles":[{"CreatedByName":"SalehRam","CreatedById":138066,"CreatedDateTime":"2015-07-11T11:18:13Z","Content":"Hello,\n\nI have an issue which is becoming very annoying lately...\n\nWhen I launch a vessel into orbit, I notice that the nods of AP and PE (basically all nodes) are not stable, they seem to have issues with deciding what is the final AP number and PE number, and they change quickly in fractions (like 0.1 \u002B/- sometimes even whole numbers like 1 or 2 \u002B/-)...\n\nThis can be seen also if I place a maneuver node and while I watch its icon in navball, I see the icon unstable and wobbling in the navball as if the craft itself is wobbling.\n\nI don\u0027t know the cause of this issue and I don\u0027t know when it started first, and my vessel is stable because I tested it with a small probe that is only 4 parts (probe, fuel tank, engine, 1 solar panel)...\n\nI tried Ctrl \u002B F12, but I could not get anything from the debug window that helps me identify what is going on.\n\nAppreciate any help\n\nRegards\n\n**Edited \u003Ctime datetime=\u00222015-07-11T15:01:52Z\u0022 title=\u002207/11/2015 03:01  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 11, 2015\u003C/time\u003E by SalehRam**"},{"CreatedByName":"SalehRam","CreatedById":138066,"CreatedDateTime":"2015-07-11T22:50:05Z","Content":"I have seen this bug report on the bugtracker, which is the same as what I am experiencing (that bug reported for 0.90, and I am experiencing this on 1.0.4):\n\n[http://bugs.kerbalspaceprogram.com/issues/3939](http://bugs.kerbalspaceprogram.com/issues/3939)"},{"CreatedByName":"quietghost","CreatedById":117566,"CreatedDateTime":"2015-07-11T23:34:54Z","Content":"Part of this bug is the result of the speed of the vessel being measured from the controlling part, not the vessel center of mass. Therefore any minor rotational changes (which happen with SAS, especially with large vessels) result in adjustments of the AP/PE. This effect tends to be more pronounced if the orbit is really close to circular. To get around the issue, if you are trying to place a manuever node, make the orbit have a small eccentricity rather than as-close-to-circular-as-I-can-get. For a manuever node, just adding some delta-V to it will solve the problem of it moving around, however small dV of \u003C1m/s will still suffer from the movement.\n\nThe other issue is with floating point errors. Overtime the errors from the maths will start to add up, and degrade the orbits.\n\nEither way, the problems can be solved by entering non-physical timewarp, which stops rotation and locks the vessel in a keplarian defined orbit which remains unchanged until you go back to 1x simulation.\n\nHopefully I addressed this, or perhaps missed the jist?\n\nQuietghost"},{"CreatedByName":"SalehRam","CreatedById":138066,"CreatedDateTime":"2015-07-11T23:43:56Z","Content":"\u003E \n\u003E The other issue is with floating point errors. Overtime the errors from the maths will start to add up, and degrade the orbits.\n\u003E \n\u003E Either way, the problems can be solved by entering non-physical timewarp, which stops rotation and locks the vessel in a keplarian defined orbit which remains unchanged until you go back to 1x simulation.\n\u003E \n\u003E Hopefully I addressed this, or perhaps missed the jist?\n\u003E \n\u003E Quietghost\n\nFloating point errors seems something I have no control on or fix for? and I take it it is a know issue and I am not the only one suffering from this?\n\nI am fine tbh with the first part of this problem (the wobbling nodes, as I got what you mean about them), but the part where I have to worry about my orbits every time seems a bit frustrating...\n\nEntering a non-physical time warp is a 50-50 acceptable solution (because once I go back to x1 speed, the issue will start again), but I was hoping there would something coming soon about this issue.\n\nThanks for your explanation ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"quietghost","CreatedById":117566,"CreatedDateTime":"2015-07-11T23:54:31Z","Content":"How quickly do your orbits decay? Is it happening rapidly (like a meter from the AP/PE every second) or is it more drawn out?\n\nFloating point errors only decay orbits slowly, it would take a couple hours to decay a 100km orbit down to the atmosphere at least."},{"CreatedByName":"SalehRam","CreatedById":138066,"CreatedDateTime":"2015-07-12T08:14:33Z","Content":"Usually, it is between 1 to 0.1 m/s, I could not find any common thing to tell what the decay speed will based on anything...\n\nIs this related to CPU and general computer specs? Is getting a better CPU will have some effects on this?"},{"CreatedByName":"quietghost","CreatedById":117566,"CreatedDateTime":"2015-07-12T21:40:24Z","Content":"No, the issue has nothing to do with your computer. It is a unity issue where the location and velocity values have only 6-7 digits of precision. At 30 fps going 2200 m/s, those errors add up to cause the slow decay.\n\nYour hardware is operating perfectly fine."}]}