{"TopicId":118409,"ForumId":69,"TopicTitle":"KSP crashes at launch with a clean install","CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-08-13T22:44:27Z","PageNum":1,"Articles":[{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-08-13T22:44:27Z","Content":"So, that\u0027s new, I didn\u0027t imagine KSP could simply not start with a clean install, but well... \n\nIt started when I was playing KSP with a few mods and, while in the VAB my computer shut down all of a sudden (I know for sure the shut down isn\u0027t related to KSP). So, as this wasn\u0027t a proper shut down I expected to have a few problems in my KSP saves.\n\nAfter having restarted the computer, I tried to launch KSP and nothing happened. Then I tried again doing a clean install and adding my previous GameData and saves folders, same result. For some crashes, I had the crash message and the crash folder appearing, without the game even showing, unfortunately those were lost when deleting my KSP\\_win folder (I\u0027ll try to get one of those again); but there was never any output\\_log.txt or player.log files created.\n\nFinally, I did a completely clean reinstall, straight out from the ksp-win-1-0-4.zip file, adding no backed up folder or file. And the same thing happened: no KSP, but this time, I had a crash folder, but still no output\\_log.txt or player.log.\n\nI looked at Windows\u0027 task manager and saw that, in the \u0022processes\u0022 tab, the KSP.exe or Launcher.exe appeared for a few seconds, and then disappeared, so the game actually somehow launches.\n\nThis kind of crash never occured to me before, on any KSP versions.\n\nKSP Win 1.0.4 32bit, .zip downloaded from the KSP website;\n\nSystem specs from dxdiag [here](https://www.dropbox.com/s/2d568q7zpqsmhj4/DxDiag.txt?dl=0) (some info is in French as my PC is in French);\n\nCrash folder [here](https://www.dropbox.com/sh/pwzujobzietkztp/AAA-ugzpLBPmDKD7T3qxwHCBa?dl=0).\n\nThank you for any help, not being able to play KSP is quite frustrating. ![;.;](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif)\n\nI will update this thread if I find any solution or if something new happens.\n\nIf you need any more info on this issue, ask and I will be happy to provide it.\n\n**Edited \u003Ctime datetime=\u00222015-08-14T00:08:13Z\u0022 title=\u002208/14/2015 12:08  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 14, 2015\u003C/time\u003E by Gaarst**\n  \nSolved"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-13T22:58:04Z","Content":"The logs indicate that KSP was unable to start a graphics adapter, the first three lines show it tried, then crashed.\n\n\u003E \n\u003E Initialize engine version: 4.6.4f1 (99f88340878d)\n\u003E GfxDevice: creating device client; threaded=1\n\u003E \n\u003E Crash!!!\n\nAnd your dxdiag shows an Intel card but no driver, or if there is a driver it\u0027s not working correctly.\n\n    Display Devices---------------          Card name: Intel(R) HD Graphics Family       Manufacturer:           Chip type:            DAC type:          Device Key: Enum\\PCI\\VEN_8086\u0026DEV_0116\u0026SUBSYS_1670103C\u0026REV_09     Display Memory:    Dedicated Memory: n/a      Shared Memory: n/a       Current Mode: 1366 x 768 (32 bit) (60Hz)       Monitor Name: Moniteur Plug-and-Play gÃƒÂ©nÃƒÂ©rique      Monitor Model:          Monitor Id:         Native Mode:         Output Type:         Driver Name: Driver File Version:  ()     Driver Version:         DDI Version:        Driver Model: WDDM 1.1  Driver Attributes: Final Retail   Driver Date/Size: , 0 bytes        WHQL Logo\u0027d: n/a    WHQL Date Stamp: n/a  Device Identifier:           Vendor ID:           Device ID:           SubSys ID:         Revision ID:  Driver Strong Name: oem2.inf:ATI.Mfg.NTamd64.6.1:iSNBM1ML_PROXY:8.882.2.0:pci\\ven_8086\u0026dev_0116\u0026subsys_1670103c     Rank Of Driver: 00E60001        Video Accel:       Deinterlace Caps: n/a       D3D9 Overlay:             DXVA-HD:        DDraw Status: Disabled         D3D Status: Not Available         AGP Status: Not Available\n\nYou even have this in the dxdiag.\n\n\u003E \n\u003E DxDiag Previously: Crashed in Direct3D (stage 2). Re-running DxDiag with \u0022dontskip\u0022 command line parameter or choosing not to bypass information gathering when prompted might result in DxDiag successfully obtaining this information\n\nSo even dxdiag is unable to use DirectX on your system.\n\nI see that it is a notebook, if you have an Nvidia or AMD card in there you need to download and install the drivers, and reboot the machine, but even if it\u0027s just the Intel you still need drivers as the driver built into Windows is not good enough for games.\n\nI\u0027d also reinstall the [**DirectX redistributable.**](http://www.microsoft.com/en-us/download/details.aspx?id=8109)\n\nOh and one more thing, don\u0027t put KSP in your documents folder, applications are prevented from writing files in that location, unzip KSP to a non-Windows folder such as C:\\Games\n\n**Edited \u003Ctime datetime=\u00222015-08-13T23:02:11Z\u0022 title=\u002208/13/2015 11:02  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 13, 2015\u003C/time\u003E by sal\\_vager**"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-08-13T23:05:14Z","Content":"@sal\\_vager:\n\nThank you for your reply.\n\nIt is true that I recently reinstalled my laptop (two weeks ago) but I had no issues with KSP between then and now. I also made sure to update all my drivers at the time\n\nBut, thinking about it, I played around with drivers today while trying to fix an issue with screen display, so I probably messed up something while not paying attention, though I don\u0027t remember touching anything related to my graphic card...\n\nI will double check everything and post a quick update then."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-13T23:09:45Z","Content":"I recommend you download the latest driver for your hardware, completely uninstall the current driver if any, reboot, install the new driver then reboot again, that is what I did when I used Windows and it helped prevent conflicts with old driver components."},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-08-14T00:07:50Z","Content":"I reinstalled all my graphics drivers and not it works !\n\nI must have touched something I shouldn\u0027t when playing around earlier today...\n\nThanks a lot !"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-14T00:08:25Z","Content":"Glad I could help Gaarst ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"}]}