{"TopicId":118508,"ForumId":69,"TopicTitle":"Joystick not functioning","CreatedByName":"jao","CreatedById":149778,"CreatedDateTime":"2015-08-15T07:09:51Z","PageNum":1,"Articles":[{"CreatedByName":"jao","CreatedById":149778,"CreatedDateTime":"2015-08-15T07:09:51Z","Content":"\n\u003Cp\u003EHello!\u003C/p\u003E\u003Cp\u003EI\u0027m unable to get my Logitech Extreme 3D Pro to function in KSP: neither the buttons on it nor the axes are detected when I try to bind them to commands. I\u0027m new to Linux, but after doing some research online it sounds like the joystick should essentially be plug-and-play. Any thoughts on how I might fix it? Thank you in advance for your help!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-15T09:13:10Z","Content":"\n\u003Cp\u003EHi jao, please make sure your stick is working in jstest, and make sure you have it plugged in before starting KSP.\u003C/p\u003E\u003Cp\u003EIf that doesn\u0027t help please put your player.log and hardinfo log on mediafire or dropbox for us, you can find info on how these in the support stickies \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jao","CreatedById":149778,"CreatedDateTime":"2015-08-18T03:29:18Z","Content":"\n\u003Cp\u003EThank you so much for your reply sal_vager! When I say I\u0027m new to Linux, I am \u003Cem\u003Enew\u003C/em\u003E to Linux: how exactly do I install jstest? I downloaded the file from \u003Ca href=\u0022https://github.com/Grumbel/jstest-gtk/tree/master\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E, but when I try compiling I get errors that my sigc\u002B\u002B-2.0 and x11 packages are not found. Apologies for the basic question, but I greatly appreciate your help!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-18T09:37:14Z","Content":"\n\u003Cp\u003EHehe I\u0027m no expert with Fedora, I have to google that stuff \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI assume jstest is in the Fedora repository, there\u0027s good info on installing packages \u003Ca href=\u0022https://docs.fedoraproject.org/en-US/Fedora/14/html/Amateur_Radio_Guide/appe-Installing_Software.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline\u0022\u003E\u003Cstrong\u003Ehere.\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIf it is not there there is likely an alternative, if you search for \u0022joystick\u0022 PackageKit should show you what is available.\u003C/p\u003E\u003Cp\u003EYou really just need to verify that your stick is detected and working.\u003C/p\u003E\u003Cp\u003EAlso, please paste the contents of your Player.log and KSP.log to a paste site such as pastebin.com or hastebin.com, then post the URL\u0027s here so I can see if KSP is detecting your controller.\u003C/p\u003E\n"},{"CreatedByName":"Esme","CreatedById":107436,"CreatedDateTime":"2015-08-18T22:02:46Z","Content":"\n\u003Cp\u003EJao, your distro, whatever it is will have something called a software manager or package manager; use that to search for the file you want to install and install it from there. You do NOT need to try compiling things for yourself these days unless it\u0027s an arcane piece of software that hasn\u0027t made it into most repositories (and joystick stuff is in the reporitories of all major distros these days). If you\u0027re used to the Windows paradigm of \u0027search for it on teh net then download it\u0027 you need to forget that and instead search for it in your package manager - it has access to known safe copies of software, will check for any supporting files needed, and automatically install them along with the file you actually need. MUCH less hassle than havingto compile things. In fact, in a dozen years of using Linux, I\u0027ve only had to compile software once, and that was about 10 years ago. Which distro are you using, our of curiosity?\u003C/p\u003E\n"},{"CreatedByName":"jao","CreatedById":149778,"CreatedDateTime":"2015-08-19T05:41:47Z","Content":"\n\u003Cp\u003Esal_vager: Still finding a joystick package, but in the meantime \u003Ca href=\u0022http://pastebin.com/embed_js.php?i=fn8HhyCt\u0022 rel=\u0022external nofollow\u0022\u003Ehere is my KSP.log\u003C/a\u003E; my Player.log is too large for pastebin.com or hastebin.com, what specifically do you need from it? Both my KSP.log and my Player.log have a line \u0022Joystick Names:\u0022 with no entries, that doesn\u0027t seem good.\u003C/p\u003E\u003Cp\u003EEsme: I\u0027m running Fedora 22 essentially straight out of the box. I was able to use the program \u0022Packages\u0022 to install \u0022linuxconsoletools-1.4.8-1.fc22\u0022, which includes the following files:\u003C/p\u003E\u003Cp\u003E/usr/bin/ffcfstress\u003C/p\u003E\u003Cp\u003E/usr/bin/ffmvforce\u003C/p\u003E\u003Cp\u003E/usr/bin/ffset\u003C/p\u003E\u003Cp\u003E/usr/bin/fftest\u003C/p\u003E\u003Cp\u003E/usr/bin/inputattach\u003C/p\u003E\u003Cp\u003E/usr/bin/jscal\u003C/p\u003E\u003Cp\u003E/usr/bin/jscal-restore\u003C/p\u003E\u003Cp\u003E/usr/bin/jscal-store\u003C/p\u003E\u003Cp\u003E/usr/bin/jstest\u003C/p\u003E\u003Cp\u003E/usr/lib/udev/js-set-enum-leds\u003C/p\u003E\u003Cp\u003E/usr/libexec/joystick/extract\u003C/p\u003E\u003Cp\u003E/usr/libexec/joystick/filter\u003C/p\u003E\u003Cp\u003E/usr/libexec/joystick/ident\u003C/p\u003E\u003Cp\u003E/usr/share/doc/linuxconsoletools\u003C/p\u003E\u003Cp\u003E/usr/share/doc/linuxconsoletools/COPYING\u003C/p\u003E\u003Cp\u003E/usr/share/doc/linuxconsoletools/NEWS\u003C/p\u003E\u003Cp\u003E/usr/share/doc/linuxconsoletools/README\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/ffcfstress.1.gz\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/ffmvforce.1.gz\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/ffset.1.gz\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/fftest.1.gz\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/inputattach.1.gz\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/jscal-restore.1.gz\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/jscal-store.1.gz\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/jscal.1.gz\u003C/p\u003E\u003Cp\u003E/usr/share/man/man1/jstest.1.gz\u003C/p\u003E\u003Cp\u003EHowever, I\u0027m unsure how to actually run this software, any suggestions? I apologize for the naive question, I\u0027m sure it\u0027s something simple I\u0027m missing. Thank you for your help!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-19T10:07:03Z","Content":"\n\u003Cp\u003EYou should be able to run jstest from the command line, jscal to calibrate, but it may be that you need another package first, as it looks like joystick drivers were moved to a module in Fedora 18, I don\u0027t know if this is still the case for Fedora 22 but you could\u003Ca href=\u0022https://ask.fedoraproject.org/en/question/8252/fedora-18-joystick-not-working/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:underline\u0022\u003E\u003Cstrong\u003E take a look here.\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"jao","CreatedById":149778,"CreatedDateTime":"2015-08-20T06:08:54Z","Content":"\n\u003Cp\u003EHi sal_vager,\u003C/p\u003E\u003Cp\u003EI succesfully ran \u0022sudo yum install kernel-modules-extra\u0022 and \u0022sudo yum install joystick\u0022 as suggested in the \u0022fedora 18 joystick not working\u0022 post you linked to, but the \u0022jstest --event /dev/input/js0\u0022 still returns \u0022No such file or directory\u0022 (I also tried it with js1 and js2). I finally figured out that my joystick was mapped to /dev/input/event6, but running \u0022jstest --normal /dev/input/event6\u0022 returns\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003EDriver version is 0.8.0.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003Ejstest is not fully compatible with your kernel. Unable to retrieve button map!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003EJoystick (Unknown) has 2 axes and 2 buttons.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003ETesting ... (interrupt to exit)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800000;\u0022\u003Ejstest: error reading: Invalid argument\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI installed jstest via my Package Manager, not sure why there would be a mismatch with my kernel. Any suggestions for how to resolve it?\u003C/p\u003E\u003Cp\u003ENot sure if it\u0027s useful, but \u0022lsusb\u0022 returns \u0022Bus 001 Device 002: ID 046d:c215 Logitech, Inc. Extreme 3D Pro\u0022, and \u0022dmesg | grep usb\u0022 returns \u0022[ 3.955825] input: Logitech Logitech Extreme 3D as /devices/pci0000:00/0000:00:14.0/usb1/1-5/1-5:1.0/0003:046D:C215.0001/input/input9\u0022 and \u0022[ 3.955935] logitech 0003:046D:C215.0001: input,hidraw3: USB HID v1.10 Joystick [Logitech Logitech Extreme 3D] on usb-0000:00:14.0-5/input0\u0022, so it would at least seem that Linux is at least detecting the joystick.\u003C/p\u003E\u003Cp\u003EThank you again for taking the time to help me!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EJust tried the joystick in Kerbal, and it\u0027s working now! The only remaining problem is the throttle axis, it can only control the throttle between 0 and 50% thrust (when the throttle control on the joystick is at maximum the vessel throttle is only at 50%). Seems like the sort of thing that would be fixed in jscal, but \u0022jscal /dev/input/event6\u0022 returns \u0022jscal: error getting version: Invalid argument\u0022. Is there a place it can be fixed in the game itself?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-08-20T11:35:58Z","Content":"\n\u003Cp\u003ETry setting the throttle to 50% before starting KSP, there used to be an issue in Ubuntu where the throttle would not be accurately detected and this is how we got around it.\u003C/p\u003E\u003Cp\u003EAlso try binding the throttle to the \u0022Incremental\u0022 axis in Settings, sometimes that works better.\u003C/p\u003E\u003Cp\u003EAs for jstest, I can\u0027t even find it for Fedora, but as long as you have something that shows the stick works, which you now do, and as it now works in KSP then jstest can be ignored.\u003C/p\u003E\u003Cp\u003EI\u0027m going to mark this as solved, and add the Fedora joystick info to the Linux thread \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jao","CreatedById":149778,"CreatedDateTime":"2015-08-21T05:20:09Z","Content":"\n\u003Cp\u003ESetting the throttle control around 50% before starting KSP does allow the full range of throttle, but there\u0027s a large dead zone between 33% and 66% power: by slowly and smoothly moving the control, the throttle setting behaves as expected from 0% to 33%, but then jumps to 66% and continues smoothly to 100%.\u003C/p\u003E\u003Cp\u003EI\u0027ll continue to investigate and post here if I\u0027m able to solve it. Thank you again for all your help, saved me a lot of hassle!\u003C/p\u003E\n"}]}