{"TopicId":121627,"ForumId":69,"TopicTitle":"Help with corrupt savefile!","CreatedByName":"Mirzet","CreatedById":151552,"CreatedDateTime":"2015-09-25T03:17:41Z","PageNum":1,"Articles":[{"CreatedByName":"Mirzet","CreatedById":151552,"CreatedDateTime":"2015-09-25T03:17:41Z","Content":"\n\u003Cp\u003EHello everykerbal! I\u0027m hoping one of you lovely people can help me fix a corrupt savefile..\u003C/p\u003E\u003Cp\u003ELong story short: I lost a kerbal on the mun and wanted to edit her back in the craft she was in (She died outside so the craft was intact).\u003C/p\u003E\u003Cp\u003EI went into the persistent.sys file for the save and changed it so that Gwenke Kermans status was assigned her idx=0 (was -1) and changed it under the vessel that crew= Jebediah Kerman, Gwenke Kerman. \u003C/p\u003E\u003Cp\u003EAfter i loaded the save one time I couldn\u0027t find Gwenke or Jeb in the astronaut facility. I couldn\u0027t access any vessel either. I closed the game and changed everything back to what it was before. But now i can\u0027t open any save because of a corrupt save... Hoping anyone has any idea of what I can do to not have to start over... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2015-09-25T05:27:57Z","Content":"\n\u003Cp\u003EChange it back to whatever it was before it happened. If that doesn\u0027t work and you can\u0027t open any other saves, then you will have to delete the corrupted one.\u003C/p\u003E\u003Cp\u003ELastly, unless you have set kerbal respawns to off, your kerbals should reappear on their own anyway.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-09-25T07:01:18Z","Content":"\n\u003Cp\u003EModifying the persistent file should ALWAYS be done with care, and more importantly with backups. Something as simple as changing a Kerbal\u0027s NAME can cause save files to become unusable.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-09-25T09:52:44Z","Content":"\n\u003Cp\u003EIf you upload the save folder to dropbox we can have a look, often it is possible to load a bad save from Windows on Linux and recover it.\u003C/p\u003E\n"}]}