{"TopicId":133574,"ForumId":69,"TopicTitle":"All current and archived missions gone overnight","CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2016-03-05T23:47:54Z","PageNum":1,"Articles":[{"CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2016-03-05T23:47:54Z","Content":"\n\u003Cp\u003E\nI loaded up KSP for the first time today, and was shocked to find my active missions empty, and even more shocked to find all ARCHIVED missions are gone, nothing is there. I neeeeed validation. Shortly before going to bed, I remember quicksaving, then proceeded to land a craft from my station to near KSC in the water, and 2 of the 3 engines fell off the back on a hard landing. Afterwards, I decided to send up a spaceplane into LKO and call it a night.\n\u003C/p\u003E\n\u003Cp\u003E\nToday i loaded up the game, and saw that debris were left over from the craft that lost 2 engines in the water, so im like \u0022awesome more money\u0022, and then i realize its probably the engines that fell off, and they are sitting on the ocean floor, and i was like \u0022omg thats dope im going to go check it out\u0022 so i go and \u0022fly\u0022 the debris instead of recovering it, for the moment. Once I get there, the beginning of the horror story commenced. The altitude, which started at 250m or so, began rising and I was gaining vertical speed while visually I was sitting on the ocean floor as an vectoring engine. I was then not able to recover the part, and it said i was under acceleration and could not do such a thing. I have a screen shot of this. Upon getting back to KSC, I decided to recover the other engine that fell off from the same vessel earlier, and not \u0022fly\u0022 the wreckage this time. I dont think i got cash for it, but i dont vividly remember the cash display cycling around after clicking recover. At this point I have still not noticed whether or not my missions are gone.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, after that I decided to look at wreckage that took place at least a week or two ago near KSC, where a different spaceplane ran out of fuel and just barely survived a splashdown; some parts were on the ocean floor, so I decided to see if I would get the same issue as I previously did of getting vertical speed. I did not, and my part on the ocean floor (also an engine) was perfectly fine and I was even able to recover it.\n\u003C/p\u003E\n\u003Cp\u003E\nI then went to look at my space station, and it still had my ship on it that i landed last night, and recovered the debris from today. and the ship was still there and docked? Also, the space plane with cargo that I hauled up last night was no longer there. I was so confused, and I still am..\n\u003C/p\u003E\n\u003Cp\u003E\nIt was at this time I clicked on my mission control center, and found out all my active missions were gone; i was getting ready for a high paying landing Eloo gravity mission. But im quite horrified to find that also my archived missions are gone along with them. I decided to look at my quicksave file, which should bring everything back to normal, to before I landed the ship that was docked, but ALL the active and archived missions were still gone.\n\u003C/p\u003E\n\u003Cp\u003E\nI need to disclose that I do have mods. But I believe this belongs here because none involve mission changes, and with the exception of KIS/KAS, all either display information or Its for visuals only. If this must be moved to modded installs only, so be it\n\u003C/p\u003E\n\u003Cp\u003E\nMy mods:\n\u003C/p\u003E\n\u003Cp\u003E\nAtmosphere trajectories\n\u003C/p\u003E\n\u003Cp\u003E\nDistant objects\n\u003C/p\u003E\n\u003Cp\u003E\nEVE (clouds only)\n\u003C/p\u003E\n\u003Cp\u003E\nKAS/KIS\n\u003C/p\u003E\n\u003Cp\u003E\nKerball Engineer\n\u003C/p\u003E\n\u003Cp\u003E\nMecJeb2\n\u003C/p\u003E\n\u003Cp\u003E\nClaws stock bug fixes\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Alarm clock\n\u003C/p\u003E\n\u003Cp\u003E\nThats all I have. Here is my Output file, hopefully it will help: \u003Ca href=\u0022https://www.dropbox.com/s/kay6r5ocnb3ohs8/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/kay6r5ocnb3ohs8/output_log.txt?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nComputer specs:\n\u003C/p\u003E\n\u003Cp\u003E\nWIndows 10 64bit\n\u003C/p\u003E\n\u003Cp\u003E\ni5 4690k OC 4.5ghz\n\u003C/p\u003E\n\u003Cp\u003E\n8gb memory\n\u003C/p\u003E\n\u003Cp\u003E\n2X HD6950\u0027s crossfired\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThank you so much for your time,\n\u003C/p\u003E\n\u003Cp\u003E\nChris\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-06T02:05:23Z\u0022 title=\u002203/06/2016 02:05  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 6, 2016\u003C/time\u003E by fireblade274\u003C/strong\u003E\n\u003C/span\u003E\n"}]}