{"TopicId":137412,"ForumId":69,"TopicTitle":"1.1 Re-launch simulator on Mac","CreatedByName":"Halsfury","CreatedById":54576,"CreatedDateTime":"2016-04-20T02:42:42Z","PageNum":1,"Articles":[{"CreatedByName":"Halsfury","CreatedById":54576,"CreatedDateTime":"2016-04-20T02:42:42Z","Content":"\n\u003Cp\u003E\nHi, I have a problem which seemed simple when it failed every time but I got KSP 1.1 to work once and I launched a rocket\n\u003C/p\u003E\n\u003Cp\u003E\nThe first issue was that the game would get frozen consistently loading the space centre scene so I couldn\u0027t play at all, although I managed to load a scenario and it was fine.\n\u003C/p\u003E\n\u003Cp\u003E\nI reinstalled, this time using the .dmg installer and managed to launch a rocket, but things were gravely wrong. Whenever I moused over a part, it would disappear at random but was most consistent in relation to fairings, sometimes the whole payload would disappear if I moused over the fairing part, along with the fearing part itself. The game failed to load the next rocket after I reverted to launch however.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t know what errors are causing this but playing is pretty impossible considering how painful it is to build something when you can\u0027t see what you\u0027re working on.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI suppose since I opted to send anonymous data to squad they can discern what failed but I don\u0027t have the log at present here are my specs however\n\u003C/p\u003E\n\u003Cp\u003E\nMacbook Pro Retina 2012\n\u003C/p\u003E\n\u003Cp\u003E\n2.6 Ghz Intel Core i7\n\u003C/p\u003E\n\u003Cp\u003E\nMemory: 8 GB at 1600 MHz DDR3\n\u003C/p\u003E\n\u003Cp\u003E\nIntel HD graphics 4000 1536 MB\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf anyone could provide assistance it would be much appreciated\n\u003C/p\u003E\n\u003Cp\u003E\nThanks\n\u003C/p\u003E\n\u003Cp\u003E\nHalsfury\n\u003C/p\u003E\n"}]}