{"TopicId":139448,"ForumId":69,"TopicTitle":"Suspension Issue - very springy","CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2016-05-10T10:42:02Z","PageNum":1,"Articles":[{"CreatedByName":"mattinoz","CreatedById":118580,"CreatedDateTime":"2016-05-10T10:42:02Z","Content":"\n\u003Cp\u003E\nSo I had a rover out in the paddock for testing. Sent a crew member out for reasons and something curious happened when he let go. \n\u003C/p\u003E\n\u003Cp\u003E\nKerbal a few metres in the air, rover 10 of metres in the air.\n\u003C/p\u003E\n\u003Cp\u003E\nTried again and same result.\n\u003C/p\u003E\n\u003Cp\u003E\nDe-installed all mods tried again.\n\u003C/p\u003E\n\u003Cp\u003E\nSure it seems to be random who will go higher the Kerbal or the rover but it\u0027s rare for neither to go flying.\n\u003C/p\u003E\n\u003Cp\u003E\nRover is mk2 inline cockpit with some rovermax model 1 wheels.\n\u003C/p\u003E\n\u003Cp\u003E\nAm I doing something wrong or is this a somewhat humorous bug?\n\u003C/p\u003E\n\u003Cp\u003E\nPhotos or it didn\u0027t happen so here is a couple of \u0022Flights\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/310uD/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Christian Michael","CreatedById":160424,"CreatedDateTime":"2016-05-10T10:51:04Z","Content":"\n\u003Cp\u003E\nI think what you\u0027re experiencing is an after effect of the new gear suspension. I\u0027ve had some problems too. For example I was testing a shuttle design by taking it off like an airplane to test cross range capability, and when I was accelerating the whole thing spun out. I\u0027m not kiddin, it spun out about two or so times. So we\u0027re all having issues. I think the wheels might be clipping in some way. Try launching it from clamps.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-10T10:53:25Z\u0022 title=\u002205/10/2016 10:53  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 10, 2016\u003C/time\u003E by Christian Michael\u003C/strong\u003E\n\u003Cbr\u003EI looked closer at the photos and what you said.\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-05-10T13:01:04Z","Content":"\n\u003Cp\u003E\nWhen you say \u0022let go\u0022 I assume that you mean: you do an EVA on the kerbonaut, and then hit Space?\n\u003C/p\u003E\n\u003Cp\u003E\nI suspect that this actually has to do with the process called \u0022clipping\u0022. I think the kerbonaut\u0027s foot is stuck in your wheel suspension. In the SPH, if you move the wheels down, does this effect go away?\n\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-05-10T14:50:53Z","Content":"\n\u003Cp\u003E\nDon\u0027t let Kerbals stand on wheels, yes it\u0027s known, no there\u0027s no fix yet.\n\u003C/p\u003E\n"}]}