{"TopicId":141350,"ForumId":69,"TopicTitle":"[#9878] Wrong orbit prediction for close encounters","CreatedByName":"cami","CreatedById":119545,"CreatedDateTime":"2016-06-07T10:39:26Z","PageNum":1,"Articles":[{"CreatedByName":"cami","CreatedById":119545,"CreatedDateTime":"2016-06-07T10:39:26Z","Content":"\n\u003Cp\u003E\nI added this issue to the KSP tracker, please add comments there:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/9878\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bugs.kerbalspaceprogram.com/issues/9878\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EVersion:\u003C/strong\u003E 1.1.2 Build 1104160 32-bit Steam on Linux 64-bit (also 1.1 and 1.1.1)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EDescription:\u003C/strong\u003E there is a frequent (occurs most of the times) error in encounter-prediction display on the map view when a fly-by is very close, featuring a (real) trajectory just above or even intersecting the geosphere. The predicted encounter node is way too late, only briefly before escaping again. The resulting fly-by prediction is completely wrong. The prediction error does not affect the physical orbit, not even in warp mode. The prediction error also affects the flight plan display unless a maneuver node exists near the encounter (see example/workaround below).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EScreenshot:\u003C/strong\u003E solid gold = wrong, dashed purple = correct\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160607105001_1_zpsbregtyok.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i11.photobucket.com/albums/a156/MoiraLachesis/Kerbal/Reports/2016-06-07-Close-Encounters/20160607105001_1_zpsbregtyok.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EExample:\u003C/strong\u003E The screenshot illustrates this. The solid cyan trajectory is a transfer orbit from Low Kerbin Orbit to the Mün (periapsis 75 km, apoapsis 11 180 km). You can also see the encounter node directly at the apoapsis. The golden orbit shows the (wrong) Mün fly-by with the moon focused. It\u0027s obviously flawed, the encounter shown when the orbit is already leaving the Mün. The golden maneuver node was added directly before making the screenshot (without subsequent orbit modifications). Note that it\u0027s 0 dV. The predicted result is an immediate lunar encounter at the maneuver node (shown in gold, barely visible). The dotted purple line shows the (approximately correct) Mün fly-by resulting from this encounter (periapsis 12 km). During this (correct) fly-by, the Mün overtakes the spaceship (in the Kerbin reference frame), then is overtaken again by the spaceship as it is flung around the moon.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWorkaround:\u003C/strong\u003E Strangely, adding a zero-delta-V maneuver node on the orbit just before the real encounter shows the correct trajectory in the flight plan. To find the right spot, just add the maneuver node and move it a bit until you see the trajectory change. Note that if the maneuver is after the encounter, the predicted trajectory will be wrong, because the target\u0027s gravity is not taken into account before the maneuver node.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFiles: \u003C/strong\u003E\u003Ca href=\u0022https://filebin.net/ofk6u3i1fqkn0wxd/quicksave__154.sfs\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://filebin.net/ofk6u3i1fqkn0wxd/quicksave__154.sfs\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSave files were created using this version of the game (not necessarily this build) and only used on this platform in \u0022C\u0022 locale (C locale was set for steam and KSP only). The example features the vessel with pid 361d85618d174f7d8b76a9d68c226df0.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESpecifications:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nKSP.x86 v1.1.2 Build 1104160 Steam\n\u003C/li\u003E\n\u003Cli\u003E\nOpenGL vendor string: NVIDIA Corporation\u003Cbr\u003E\nOpenGL renderer string: GeForce GTX 275/PCIe/SSE2\u003Cbr\u003E\nOpenGL core profile version string: 3.3.0 NVIDIA 340.96\u003Cbr\u003E\nOpenGL core profile shading language version string: 3.30 NVIDIA via Cg compiler\u003Cbr\u003E\nOpenGL core profile context flags: (none)\u003Cbr\u003E\nOpenGL core profile profile mask: core profile\u003Cbr\u003E\nOpenGL core profile extensions:\u003Cbr\u003E\nOpenGL version string: 3.3.0 NVIDIA 340.96\u003Cbr\u003E\nOpenGL shading language version string: 3.30 NVIDIA via Cg compiler\u003Cbr\u003E\nOpenGL context flags: (none)\u003Cbr\u003E\nOpenGL profile mask: (none)\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cp\u003E\nLinux 4.1.15-gentoo-r1 x86_64 Intel(R) Core(TM) i7 CPU 920 @ 2.67GHz\n\u003C/p\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-08T10:43:59Z\u0022 title=\u002206/08/2016 10:43  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 8, 2016\u003C/time\u003E by cami\u003C/strong\u003E\n\u003Cbr\u003EIssue tracker referral\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-06-07T12:35:20Z","Content":"\n\u003Cp\u003E\nHi @cami, please report issues to\u003Cstrong\u003E \u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/projects/ksp/issues\u0022 rel=\u0022external nofollow\u0022\u003Ethe KSP issue tracker\u003C/a\u003E\u003C/strong\u003E, they are not copied from the forums.\n\u003C/p\u003E\n\u003Cp\u003E\nThank you.\n\u003C/p\u003E\n"},{"CreatedByName":"cami","CreatedById":119545,"CreatedDateTime":"2016-06-08T10:45:45Z","Content":"\n\u003Cp\u003E\nDone. Sorry, my last report was still in alpha.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease close the topic.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-06-08T11:06:58Z","Content":"\n\u003Cp\u003E\nLet me sneak in a \u0022Thanks for the maneuver node trick\u0022 before this is closed.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m pretty sure this bug has been reported before (I think it may be part of a bevy of weird patched conics things) but that \u0022trick\u0022 may not only help me keep my sanity, but find the underlying prediction problem as well.\n\u003C/p\u003E\n"}]}