{"TopicId":142011,"ForumId":69,"TopicTitle":"Ship exploding prob solved? Different physics behavior between game start and save \u0026amp; reload!","CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2016-06-18T12:15:43Z","PageNum":1,"Articles":[{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2016-06-18T12:15:43Z","Content":"\n\u003Cp\u003E\n\u003Cem\u003E(not looking for support, more of a bug report, but figured the mods would move this here if I posted in KSP General Discussion. If I’m wrong about that pls move it there)\u003C/em\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EIn two other threads (\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/141682-spaceship-shaking-itself-apart/#comment-2628152\u0022 rel=\u0022\u0022 style=\u0022line-height:1.6;background-color:rgb(255,255,255);\u0022\u003Ethis \u003C/a\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003Eone and \u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/141728-save-file-right-before-station-explodes/#comment-2629736\u0022 rel=\u0022\u0022 style=\u0022line-height:1.6;background-color:rgb(255,255,255);\u0022\u003Ethis \u003C/a\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003Eone) I was discussing a problem I have where a large interplanetary ship I have, after I undock the last fuel tanker, \u003C/span\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003E \u003C/span\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003Ebegins to wobble and shake and shakes itself totally into pieces. (very explodey!) There were various suggestions from other users like SAS problems and part clipping.\u003C/span\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003E  \u003C/span\u003E\u003Cspan style=\u0022line-height:1.6;\u0022\u003ESo I was doing a series of experiments trying to figure it out.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI had the patience of \u003Cu\u003EJob\u003C/u\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E \u003C/span\u003EAnd used my very best computer scientific method . I eliminated SAS and part clipping, it actually seemed to me that the problem was simply this arrangement of parts. \u003Cspan\u003E \u003C/span\u003EAs long as I undocked one of the major components of the ship it was OK.\u003Cspan\u003E  \u003C/span\u003E\u003Cu\u003EAny one major component.\u003C/u\u003E\u003Cspan\u003E\u003Cu\u003E \u003C/u\u003E \u003C/span\u003EAnd as soon as I got all the parts back together, in any order, in any sequence, and in any arrangement, it would start to shake.\n\u003C/p\u003E\n\u003Cp\u003E\nThis morning, I patiently started another set of experiments.\u003Cspan\u003E  \u003C/span\u003EThis time I undocked a very minor component, a Science junior with two docking ports.\u003Cspan\u003E  \u003C/span\u003EDocked\u003Cspan\u003E \u003C/span\u003Eback the last of the major components, a lander, and it was stable!\u003Cspan\u003E  \u003C/span\u003EOkay, still using scientific method, I tried a different experiment.\u003Cspan\u003E  \u003C/span\u003EI undocked a different very minor component, and put back the lander, and the ship takes itself apart!\n\u003C/p\u003E\n\u003Cp\u003E\nThat’s interesting.\u003Cspan\u003E  \u003C/span\u003ELet me try to repeat the success of my first experiment.\u003Cspan\u003E  \u003C/span\u003EI reload, undocked the science pod, and put back the lander.\u003Cspan\u003E  \u003C/span\u003EAnd it starts to shake!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003EAnd now the weird part:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAs the science pod is drifting away from the ship, and the ship is beginning to shake violently, I noticed the \u003Cu\u003Escience pod is shaking too!\u003C/u\u003E\u003Cspan\u003E  \u003C/span\u003EIt’s wobbling side to side\u003Cu\u003E with the ship.\u003C/u\u003E\u003Cspan\u003E\u003Cu\u003E \u003C/u\u003E \u003C/span\u003EAs if the fabric of space time is being distorted (and the ship and science prod are both being affected), or perhaps the science pod was quantum entangled with the CoM of the ship.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously I don’t believe either quantum entanglement or the space time continuum exist in this physics model.\u003Cspan\u003E  \u003C/span\u003E\u003Cu\u003ESo, if I have absolutely no idea what that was!\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBut science continues!\u003Cspan\u003E  \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThat experiment had worked when I had first loaded the game this morning.\u003Cspan\u003E  \u003C/span\u003ESo I quit all the way out.\u003Cspan\u003E  \u003C/span\u003EStart the game over, and repeat the first experiment.\u003Cspan\u003E  \u003C/span\u003EIt works.\u003Cspan\u003E  \u003C/span\u003EOK, I quit out, reload the game, and this time I just put back the lander, the last of the major components.\u003Cspan\u003E  \u003C/span\u003EAnd the ship is stable. It’s been running for half an hour, I’ve saved and reloaded, it seems like it’s fixed.\u003Cspan\u003E  \u003C/span\u003E(But or how long Mr. Spock?\u003Cspan\u003E  \u003C/span\u003EFor…\u003Cspan\u003E  \u003C/span\u003Ehow. .. long?)\n\u003C/p\u003E\n\u003Cp\u003E\nSo that’s two things I’m reporting:\n\u003C/p\u003E\n\u003Cp\u003E\n1. Very strange physics behavior,(The Wobbling of Space Time) and\n\u003C/p\u003E\n\u003Cp\u003E\n2. the fact that a fresh restart of the game can make it go away(?).\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Oh, 1.1.2, Win7 64 8gb RAM intel graphics,  KAC is my only mod, \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-18T12:51:00Z\u0022 title=\u002206/18/2016 12:51  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 18, 2016\u003C/time\u003E by Brainlord Mesomorph\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2016-06-18T13:01:08Z","Content":"\n\u003Cp\u003E\nGravity!\n\u003C/p\u003E\n\u003Cp\u003E\nAFAIK: Gravity is the only thing in this physics model that could effect both the ship and the pod at the same time.\n\u003C/p\u003E\n\u003Cp\u003E\nGravity is wobbling?\n\u003C/p\u003E\n"},{"CreatedByName":"Tiberius K","CreatedById":163867,"CreatedDateTime":"2016-06-27T07:07:48Z","Content":"\n\u003Cp\u003E\nI wonder if my issue is connected.  I have an issue with banks of solar panels shaking uncontrollably after re-loading the craft.  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/142518-insane-vibration-from-solar-panels/\u0022 rel=\u0022\u0022\u003EI posted about it here\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere is absolutely no vibration until I leave the craft then return to it.  My best guess at the moment is some weird feedback loop caused by the tiny rotation of solar panels\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness2","CreatedById":158940,"CreatedDateTime":"2016-06-27T09:23:50Z","Content":"\n\u003Cp\u003E\nThis is the Gyro Kraken eating your ship. It is attracted to larger ships. Part clipping will summon it quickly, but it can also be lured to \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E units that are misaligned from each other or even just by having more than one \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E unit on the craft. Trying to dock multiple units together can also make your multi-ship look very delicious, due to the modules sometimes not lining up perfectly.\n\u003C/p\u003E\n\u003Cp\u003E\nGenerally speaking, what\u0027s happening to cause this effect is a self-feeding phantom force. Part A is attached to part B, part A starts to move and part B follows slightly later. Part A gets pulled back by part B but by then part B is in a slightly different position from where part A was getting tugged to. It creates a tiny wave that on small ships is harmless and not really noticeable, but on larger ships the wave can become self-feeding and gradually get stronger each cycle until it rips the ship apart.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s some things for you to try:\n\u003C/p\u003E\n\u003Cp\u003E\n1.) Turn \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E off. Sometimes it is the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E causing the effect and turning it off stabilizes the ship. I have this happen most often on noodly rockets while in air.\n\u003C/p\u003E\n\u003Cp\u003E\n2.) Try using fewer total docking ports, or avoiding making parallel docking circuits--make series-docking ships where possible. The wave can more easily feed itself when it loops around on itself. If you put all the modules in a line, it is less likely to be able to develop a self-feeding wave.\n\u003C/p\u003E\n\u003Cp\u003E\n2.a.) If you do build a parallel circuit multi-ship, check the measurements VERY carefully. Try to make sure it matches up exactly by putting the exact same set of parts, attached only via attachment nodes, on all legs of the series circuit. If that doesn\u0027t work, try making them almost match up but be just barely off. Either one could work, all I know for sure is that the two will act differently.\n\u003C/p\u003E\n\u003Cp\u003E\n3.) Check very carefully for part-clipping. Re-make modules if you have to. Parts that currently seem stable while the ship is partially built may in fact house the problem and may not show it until the ship gets larger. Pay attention to the way things fit together. Some parts clip very easily and willingly in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E or \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E. Watch your symmetry. Sometimes multiple parts in symmetry look like one part.\n\u003C/p\u003E\n\u003Cp\u003E\n4.) Try to summon the Kraken by wiggling the ship. See if you can beckon it to come while the ship is smaller/has fewer modules on it. Maybe you\u0027ll find that it\u0027s only a matter of time before the ship starts to wobble.\n\u003C/p\u003E\n\u003Cp\u003E\n5.) Try to use fewer parts, especially along the length of modules. The little bits hanging off the sides are generally fine, but use huge fuel tanks instead of big stacks of smaller tanks anywhere you can.\n\u003C/p\u003E\n\u003Cp\u003E\n6.) Try using the Kerbal Attachment System mod to install struts between the most wobbly modules. If you increase the ship\u0027s rigidity, you might prevent the Kraken from eating the ship. It\u0027s also possible, though less likely, that adding struts will make your ship more delicious.\n\u003C/p\u003E\n\u003Cp\u003E\n7.) Alter the part configuration files and make their connections stronger/more rigid. This is essentially cheating but sometimes makes the game behave in a more reasonable manner. It\u0027s really up to you whether or not you feel like you are cheating as well as whether or not you\u0027re okay with that.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s all I can think of. Hope one of these helps! If all else fails, build smaller. I know it\u0027s not what you want to hear, but KSP isn\u0027t built for what some of us are capable of dreaming up.\n\u003C/p\u003E\n"},{"CreatedByName":"Tiberius K","CreatedById":163867,"CreatedDateTime":"2016-06-30T23:47:41Z","Content":"\n\u003Cp\u003E\nThanks for that,  I feel like the Kraken has a personality now.  My Kraken is content in just wobbling rather than gobbling and thankfully KJR sent it packing.  I think because I \u0027eyed\u0027 the rotation when docking the two identical solar panel banks I introduced the slight asymmetry.  It is odd that there is no problem until reloading the craft though, surely the physics should be identical in both cases.\n\u003C/p\u003E\n"}]}