{"TopicId":146583,"ForumId":69,"TopicTitle":"Launch Screen Does not Load Completely.","CreatedByName":"shadragon","CreatedById":167998,"CreatedDateTime":"2016-08-26T12:36:00Z","PageNum":1,"Articles":[{"CreatedByName":"shadragon","CreatedById":167998,"CreatedDateTime":"2016-08-26T12:36:00Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EKSP Version:\u003C/strong\u003E PC - Steam 64 bit, build id = 01289 2016.06.21 at 20:49:32 CEST Branch: master\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EWhat Happens:\u003C/strong\u003E I construct a ship in \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E (I\u0027ve made a half dozen different craft from new - Career mode) then hit launch. About 70% of the time the launch screen appears, but with issues. There is no Kerbal crew image in the lower right corner, no controls are active (if I press T for \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E or throttle up / down buttons nothing happens, for example) and the STAGE light, instead of blinking green is a solid light purple color. I can rotate the camera and select components on screen as well as change staging order, but little else. Screenshot enclosed.\n\u003C/p\u003E\n\u003Cp\u003E\nAdded later: I did notice that when the screen loads properly, there is a brief pause where the screen looks like my screenshot before loading in the missing elements. I also started a new game last night and this bug happened on the first launch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMods / Add-Ons\u003C/strong\u003E: None. New purchase \u0026amp; virgin install (via Steam) five days ago. No mods.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EHardware:\u003C/strong\u003E AMD FX-8350 4.0GHz / 32 GB Ram / OCX PCIe SSD 256GB \u002B RAID 1 3TB SATA HD / MSI GTX 980Ti 6G Gaming / ASUS Crosshair V Formula-Z ROG / HTC Vive / Steam VR Rating: 12510 (I do not use VR for KSP, but it\u0027s a pretty solid gaming computer.) Running KSP at 1920 x 1080 most graphics settings maxed @ 60FPS. DXDiag attached.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESteps to Replicate:\u003C/strong\u003E I just hit launch. Roughly 70% of the time, it hangs up the launch screen as shown in screenshot.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EResult:\u003C/strong\u003E Cannot launch. Must back out and reload game from main menu. If I do that, it usually works.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EFixes/Workarounds:\u003C/strong\u003E Quit to main menu and reload game. Works after that, for a time.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOther Notes/Pictures/Log Files:\u003C/strong\u003E Enclosed in Zip file here: \u003Ca class=\u0022ipsType_noLinkStyling\u0022\u003Ehttp://www.mediafire.com/download/pjr1nq4urvk4tu2/KSP_Bug.zip\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n- buildID64.txt\u003Cbr\u003E\n- DXDiag.txt\u003Cbr\u003E\n- Screenshot\u003Cbr\u003E\n- Output_log.txt\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-08-26T17:15:31Z","Content":"\n\u003Cp\u003E\nHi \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167998-shadragon/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022167998\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/167998-shadragon/\u0022 rel=\u0022\u0022\u003E@shadragon\u003C/a\u003E, you don\u0027t have crew in the craft in your screenshot, if you\u0027ve launched all your current Kerbals you will need to hire more from the astronaut complex.\n\u003C/p\u003E\n\u003Cp\u003E\nI see some text over the message app in the upper right, if you are using a 3rd party program to monitor frame rate such as PrecisionX 32 or Fraps try disabling it.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t see any errors of note in the log, you may just have a bad Steam install, try \u003Ca href=\u0022https://imgur.com/a/jpRba#0\u0022 rel=\u0022external nofollow\u0022\u003Everifying the cache\u003C/a\u003E in case any files need to be replaced.\n\u003C/p\u003E\n\u003Cp\u003E\nHope this helps \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"shadragon","CreatedById":167998,"CreatedDateTime":"2016-08-26T17:47:48Z","Content":"\n\u003Cp\u003E\nSorry Sal, but there is a pilot available (two actually, Jebidiah and Valentina in accommodation listed as \u0022Available\u0022) who appear in the cockpit when I restart the game. The program hangs before the crew loading process on the launch screen. As stated, previously I began a brand new game and the first launch hung. \n\u003C/p\u003E\n\u003Cp\u003E\nThe text is from NVIDIA Shadowplay. I have turned it off and had the same thing occur. I\u0027ve got thirty years of IT management experience. I tried all the basics before composing this.  \n\u003C/p\u003E\n\u003Cp\u003E\nWould you like me to do a video showing the issue? \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-26T17:50:31Z\u0022 title=\u002208/26/2016 05:50  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 26, 2016\u003C/time\u003E by shadragon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-08-27T21:25:08Z","Content":"\n\u003Cp\u003E\nWell what you describe is not a known issue with KSP, so something is causing this for you.\n\u003C/p\u003E\n\u003Cp\u003E\nYour 30 years of IT experience may not have steeled you to the fact that Steam doesn\u0027t always install games properly, and verifying the cache can solve issues with KSP from Steam in many cases.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s possible your install is broken, for example this is in your logs.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\nd3d: failed to create 2D texture id=2427 w=2 h=2 mips=3 d3dfmt=21 [invalid call]\u003Cbr\u003E\nLoad(Texture): Squad/Parts/Resources/FuelCell/fuellcell\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhich doesn\u0027t normally occur.\n\u003C/p\u003E\n\u003Cp\u003E\nYour existing saves might be corrupt, and if you upload your saves I can test them as well, as all I have to go on is your description and pic which shows exactly what happens when no Kerbals were placed in the vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nNotice it says \u0022not enough crew 0/1\u0022, and the purple light means you have no control which is also mentioned in the log.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents ipsClearfix\u0022\u003E\n\u003Cp\u003E\n[Pre-Flight Check]: Checking for NoControlSources: FAIL!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYour hardware looks fine, but an unanswered question is what other software are you running that can interfere with KSP? Usually if KSP crashes the running processes are written to the log, but as that is not the case here please also upload screenshots or a list of your taskmanager processes.\n\u003C/p\u003E\n\u003Cp\u003E\nKnown troublemakers are monitoring software such as PrecisionX and Blaze Video, Fraps as well can cause issues.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd no, a video isn\u0027t much help, what I need to do is reproduce this or eliminate possible causes until it goes away.\n\u003C/p\u003E\n"},{"CreatedByName":"Andem","CreatedById":155578,"CreatedDateTime":"2016-08-27T23:28:44Z","Content":"\n\u003Cp\u003E\nCheck the Alt-F2 menu, and see if there are any errors. If there are, what are they?\n\u003C/p\u003E\n"}]}