{"TopicId":149586,"ForumId":69,"TopicTitle":"KSP 1.1 heavy lag","CreatedByName":"AndroidSub","CreatedById":168802,"CreatedDateTime":"2016-10-10T09:52:47Z","PageNum":1,"Articles":[{"CreatedByName":"AndroidSub","CreatedById":168802,"CreatedDateTime":"2016-10-10T09:52:47Z","Content":"\n\u003Cp\u003E\nHello , a KSP Player here.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a laptop which was purchased in 2008 , with around 3GB ram. I first heard of KSP when it was at version 1.0 , and it ran quite smoothly. Even \u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E\u002BRP0 I was able to run at a modest 20fps. The stock game ran at around 40. However, as soon as I upgraded to version 1.1 , I found that stock struggled to run at even 15fps.I still use a few mods which help me run the game at around 12-14fps. Does anyone know how to solve this problem of lag and whether 1.2 will offer any performance improvements?\n\u003C/p\u003E\n\u003Cp\u003E\nNaturally , all settings are turned back (except max physics delta time) and force opengl has been enabled.\n\u003C/p\u003E\n\u003Cp\u003E\nI used windows 7 when running 1.0.5 and am now on windows 10 running 1.1 . But 1.0.5 still runs faster even on windows 10. \u003Cimg alt=\u0022;.;\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 title=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tr1gg3r","CreatedById":161427,"CreatedDateTime":"2016-10-10T10:51:13Z","Content":"\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\nyer wait til tmrw for 1.2 release, youll be pleasantly surprised (hopefully) \n\u003C/p\u003E\n\u003Cp\u003E\nobviously ur 3gb ram is a limiting factor, however theres alot more settings and tweakables etc to turn down or off in 1.2 so you MAY be able to fine tune bit more performance.\n\u003C/p\u003E\n\u003Cp\u003E\nfingers crossed for ya.\n\u003C/p\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-10-10T11:43:36Z","Content":"\n\u003Cp\u003E\nAny new version of KSP comes with more content and if optimization of the game was not a main focus during this release it is likely to use even more resources then before.\u003Cbr\u003E\nIt all depends on what OS your running. And as long as you run Windows as you do \u003Cem\u003E(untweaked)\u003C/em\u003E your going to need anywhere from 500mb to 1gb of ram just to keep the system running.\n\u003C/p\u003E\n\u003Cp\u003E\nThat means KSP can only uttilize 2-2.5gb of ram. The recommended system specifications for KSP is 4GB of ram!\u003Cbr\u003E\nI\u0027ve run KSP on different machines ranging from 3gb ram up to 16gb of ram. 4GB already seemed to slow down the system of more complicated 100\u002B part vessels. But background processes and OS services were not tweaked and optimized so 4GB should be enough in most cases. 3GB really seemed to make playing KSP pretty disastrous for me.\n\u003C/p\u003E\n\u003Cp\u003E\n6GB seems to be the best way to go just to be safe and future proof.\u003Cbr\u003E\nThe recommended RAM specifications for KSP is a minimum to be honest, but at the same time just enough. That\u0027s because going over 4gb really wont give you much more performance.\u003Cbr\u003E\nBut going under that is going to maximize the available RAM capacity and your system will slow down by running on virtual harddrive memory (at which point it doesn\u0027t matter whether you have a 2003 2.2ghz Pentium CPU or a i7 3970 @ 4ghz.\u003Cbr\u003E\nHaving excess ram in KSP doesn\u0027t matter. But 4GB is recommended and is just enough and more of it won\u0027t do much \u003Cem\u003E(unless you got many mods installed)\u003C/em\u003E\u003Cbr\u003E\u003Cbr\u003E\nIt also depends on what vessels you build. If you build complicated vessels with higher part count the CPU has to work harder and it will need more and more data from the RAM. Complicated vessels \u002B mods is well over 4GB.\n\u003C/p\u003E\n\u003Cp\u003E\nAt some point though the CPU will start becoming the bottleneck no matter what and it doesn\u0027t matter how much RAM you have.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d say 6GB is a save bet, preferably 8GB is you want to heavily mod the game.\u003Cbr\u003E\nAs for upgrading your notebooks memory, that is in most cases possible. Because it is a 2008 laptop it probably has DDR2 or DDR3 SO-DIMM, and you can get 4gb of both for just 30-35bucks.\n\u003C/p\u003E\n\u003Cp\u003E\nType in your Notebooks Brand \u002B model number on google and find the manufacturers site to see the notebooks specifications to see how much RAM can be installed.\u003Cbr\u003E\nIf you can\u0027t find it just give me the name of your notebook and I may take a look.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-10T11:46:02Z\u0022 title=\u002210/10/2016 11:46  AM\u0022 data-short=\u00227 yr\u0022\u003EOctober 10, 2016\u003C/time\u003E by Vaporized Steel\u003C/strong\u003E\n\u003C/span\u003E\n"}]}