{"TopicId":155954,"ForumId":69,"TopicTitle":"Atmosphere looks weird","CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2017-02-03T20:34:23Z","PageNum":1,"Articles":[{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2017-02-03T20:34:24Z","Content":"\n\u003Cp\u003E\nThis doesn\u0027t really bother me, but it\u0027s a small annoyance and I\u0027d like to get rid of it.\n\u003C/p\u003E\n\u003Cp\u003E\nKerbin\u0027s atmosphere cuts off as I ascent through it. It should continue to gain transparency, but it doesn\u0027t do that.. It isn\u0027t smooth at all, however physics are not affected by it.\n\u003C/p\u003E\n\u003Cp\u003E\nAt the bottom, the sky still looks normal, but around halfway through, it cuts to black space. It might happen in every atmosphere, but I don\u0027t know.\n\u003C/p\u003E\n\u003Cp\u003E\nI have version 1.2 with no mods. Am I alone with it and if not, is there a way to fix it?\n\u003C/p\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2017-02-05T13:05:18Z","Content":"\n\u003Cp\u003E\nI can notice the atmosphere fades with altitude, but there\u0027s a discontinuity when it suddenly turns totally transparent, should be at the atmosphere limit. Possible that\u0027s what you are seeing too, therefore is normal.\n\u003C/p\u003E\n\u003Cp\u003E\nBut you may be seeing something else or more marked. Can you take one or more screenshots to show here and describe what you see in them? Also, could be important to know your graphics settings, GFX and drivers, the effect may show differently on your configuration (so, please upload and link output_log.txt or player.log and settings.cfg).\n\u003C/p\u003E\n"},{"CreatedByName":"Delay","CreatedById":173586,"CreatedDateTime":"2017-02-05T16:16:58Z","Content":"\n\u003Cp\u003E\nYes, that is what I see. However, I remember that it has been smoother in previous versions. In 1.1 (from what I can see in videos) was not this strong.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: This is what I\u0027m talking about, in case it\u0027s still needed.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022MhZnmhu.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/MhZnmhu.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-02-10T12:59:52Z\u0022 title=\u002202/10/2017 12:59  PM\u0022 data-short=\u00227 yr\u0022\u003EFebruary 10, 2017\u003C/time\u003E by Delay\u003C/strong\u003E\n\u003Cbr\u003EAdding information\n\u003C/span\u003E\n"}]}