{"TopicId":161173,"ForumId":69,"TopicTitle":"I think I lost an important file when moving my KSP 1.2.2","CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2017-05-27T18:00:30Z","PageNum":1,"Articles":[{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2017-05-27T18:00:30Z","Content":"\n\u003Cp\u003E\nKSP Version 1.2.2 64-bit, purchased via Steam, running on Win10,\n\u003C/p\u003E\n\u003Cp\u003E\nWith KSP V1.3 now out, I moved my saves over to my backup copy of V1.2.2 which I\u0027d made some months back, and set out to play there until mods get updated, the inevitable OOPS HANG ON FOR EMERGENCY PATCH 1.3.1 ... 1.3.2 ... (ETC) insanity ends, and everything stabilizes.  (This has been my habit for several updates now.)  I\u0027d made the backup a while ago, but hadn\u0027t really used it beyond starting up and seeing that it seemed to \u0022work\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nBut now that I actually NEED it, it seems I missed something in the move.  A whole pile of text strings, including all part names and descriptions, some labels in context menus, and Kerbal professions, all seem to have vanished.  They\u0027ve been replaced by a string of the form \u0022#autoLOC_50nnnn\u0022:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/58Gjwq6\u0022 style=\u0022height:416px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/6W3dyLl\u0022 style=\u0022height:416px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI assume a file full of text strings got corrupted somehow when I copied all the files a few months ago, and I just didn\u0027t notice during my quickie check to make sure KSP still functioned in its new location. \n\u003C/p\u003E\n\u003Cp\u003E\nAs implied above, I normally do run with a small handful (half-dozen or so) mods, but the above screenshots were taken after I stripped out all mods--so the issue exists in my stock install and presumably is not mod-driven.  Hence my use of this \u0022unmodded support\u0022 area.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, if this were the CURRENT version, I\u0027d just go to Steam, verify file integrity, and let Steam fix whatever it discovered was missing/corrupted.  But my problem is with a prior version, so that\u0027s not going to work here.  Is there anything I can do to fix this, or is my 1.2.2 irretrievably corrupted?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2017-05-27T18:22:15Z","Content":"\n\u003Cp\u003E\nHi the thing is the \u0022#autoLOC_50nnnn\u0022: is not a feature of KSP 1.22 that is new in 1.3 and forms part of the cfg  localisation , each part in 1.3 has a tag = x.  for search terms. and in 1.3 unlike 1.22 which uses plain text, 1.3 uses these tags to reference a library entry  \n\u003C/p\u003E\n\u003Cp\u003E\nThere are no such references in 1.22.  It seems very much like you have somehow mixed up 1.22 and 1.3 parts under a 1.22 build\n\u003C/p\u003E\n\u003Cp\u003E\nShould add that i\u0027m running several copies of each and can only recreate your problem by dropping a 1.3 part into 1.22\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-27T18:24:20Z\u0022 title=\u002205/27/2017 06:24  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 27, 2017\u003C/time\u003E by SpannerMonkey(smce)\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2017-05-27T18:40:42Z","Content":"\n\u003Cp\u003E\nThe screenshots in the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E are from a brand new save created specifically to establish that the issue still exists in the unmodded game.  And as noted, the backup copy was made back in (checking folder dates) looks like March, most likely.  so I\u0027m not sure how some aspects of 1.3 could have snuck into that 1.2.2 backup. But yes, the symptoms do rather \u0027smell\u0027 like a localization-related file went missing.  Which, as noted, doesn\u0027t exist in 1.2.2.  So SOMEHOW, bits of 1.3 snuck into this install--presumably when I moved the latest versions of mods/saves/etc. into the backup after 1.3 dropped...?\n\u003C/p\u003E\n\u003Cp\u003E\nI guess this means I either give up on 1.2.2 forever, or sort out Steam\u0027s \u0022roll back to the previous version\u0022 function.  I assume there\u0027s also some way to tell Steam to install the CURRENT version afterward...?\n\u003C/p\u003E\n"},{"CreatedByName":"SpannerMonkey(smce)","CreatedById":50907,"CreatedDateTime":"2017-05-27T18:47:11Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223070190\u0022 data-ipsquote-contentid=\u0022161173\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495910442\u0022 data-ipsquote-userid=\u0022111267\u0022 data-ipsquote-username=\u0022Srpadget\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Srpadget said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI guess this means I either give up on 1.2.2 forever, or sort out Steam\u0027s \u0022roll back to the previous version\u0022 function.  I assume there\u0027s also some way to tell Steam to install the CURRENT version afterward...?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOn the same steam tab used to select the 1.29 beta and now 1.3 there is an option by clicking dropdown to select 1.22\n\u003C/p\u003E\n\u003Cp\u003E\ndownload install that, then copy the whole ksp folder to a new location, then go back to steam and reselect 1.3  and download that,  you now have a safe install of 1.22 and a clean and shiny 1.3 enjoy\n\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2017-05-27T22:34:38Z","Content":"\n\u003Cp\u003E\nOkay, I think I have a properly-working V1.2.2 again!  Plus a fresh new virginal V1.3 awaiting my attention when I get around to it.  (Still seriously weird... Utterly mystified how ALL the 1.2.2 part definitions could have gotten overwritten by 1.3 versions, let alone without breaking anything else, but that seems to have been what happened.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks much!\n\u003C/p\u003E\n"}]}