{"TopicId":163174,"ForumId":69,"TopicTitle":"Transferring from Steam KSP to GoG\u0026#039;s DRM-Free version","CreatedByName":"Spraki","CreatedById":155616,"CreatedDateTime":"2017-07-12T10:03:10Z","PageNum":1,"Articles":[{"CreatedByName":"Spraki","CreatedById":155616,"CreatedDateTime":"2017-07-12T10:03:10Z","Content":"\n\u003Cp\u003E\nHi. After seeing that I want to play KSP without having to drag Steam and other personal stuff of it with me, I\u0027ve decided to buy the GOG/DRM-free version. I also intend to infect a few people at my university by playing it there :p. \n\u003C/p\u003E\n\u003Cp\u003E\nMy question here is if I actually have to reinstall EVERYTHING or if I just need to grab something like GOG\u0027s ksp.exe or some file just so it doesn\u0027t launch the Steam version? Just need to know, because my internet is not the fastest where I am (and somewhat limited), so it would be good to know, provided anybody actually did the same. \n\u003C/p\u003E\n\u003Cp\u003E\nI suppose, too, that you can just copypaste the savegames?\n\u003C/p\u003E\n\u003Cp\u003E\nI will be sticking with 1.2.2. for now as I still have a lousy career going.\n\u003C/p\u003E\n"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2017-07-12T10:24:44Z","Content":"\n\u003Cp\u003E\nThe Steam version has no DRM, you can launch the game from the folder or copy the whole game folder to anywhere you want and play the game from that folder.\n\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2017-07-12T14:11:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223118514\u0022 data-ipsquote-contentid=\u0022163174\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221499855084\u0022 data-ipsquote-userid=\u0022119953\u0022 data-ipsquote-username=\u0022Harry Rhodan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Harry Rhodan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe Steam version has no DRM\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTo be even more precise: No matter where you bought KSP, it is DRM free. All versions (except console) are exactly the same.\n\u003C/p\u003E\n"},{"CreatedByName":"Samssonart","CreatedById":57129,"CreatedDateTime":"2017-07-13T10:11:23Z","Content":"\n\u003Cp\u003E\nAgree on the every KSP version is DRM free part. But in case you were more concerned about the \u0022how do I move my career saves from Steam to GOG?\u0022 part of the question, all you need to take is the saves folder. All other game files and folders are the same on both versions, though there are certain added files that are specific to each distribution platform. So also don\u0027t think that since it\u0027s all the same you can just copy your entire KSP folder from Steam to GOG and expect it to work, you will have to redownload the core game from GOG and copy your saves folder to start where you left off.\n\u003C/p\u003E\n"},{"CreatedByName":"Spraki","CreatedById":155616,"CreatedDateTime":"2017-07-13T17:45:41Z","Content":"\n\u003Cp\u003E\nDoh. Really? I always thought it would launch steam if I had copypasted the steam version.\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing I also wanted to avoid was getting any version patched to 1.3 since I still have a few adventures going in 1.2.2 ( I am aware that you can \u0027add a non steam game). \n\u003C/p\u003E\n\u003Cp\u003E\nHmmmmmmmmmm. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSo ok. Let me drag the steam ksp folder on my external hdd to test it.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it really works, then maybe a GOG refund is at order.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit - wooops. Thanks for the responses!\n\u003C/p\u003E\n\u003Cp\u003E\nEdit2 - well. Lol... It worked. Mmmm. Darn it. Refund gog? I still wonder if it would still be good to keep the GOG version, especially with TakeTwo now in charge xD.\n\u003C/p\u003E\n\u003Cp\u003E\n#pessimism\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-15T06:18:05Z\u0022 title=\u002207/15/2017 06:18  AM\u0022 data-short=\u00226 yr\u0022\u003EJuly 15, 2017\u003C/time\u003E by Spraki\u003C/strong\u003E\n\u003C/span\u003E\n"}]}