{"TopicId":173300,"ForumId":69,"TopicTitle":"1.4.2 StillNot working right under Linux","CreatedByName":"Delbrutis","CreatedById":144613,"CreatedDateTime":"2018-03-31T12:29:03Z","PageNum":1,"Articles":[{"CreatedByName":"Delbrutis","CreatedById":144613,"CreatedDateTime":"2018-03-31T12:29:03Z","Content":"\n\u003Cp\u003E\nSo I guess I\u0027m a little late to the party with this one. I was working on other things and was not ready to try this new build yet. So did I not read in the release notes for this patch that it fixed the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E menu misalignment?  And they recompiled the new unity Shader for Linux? Well I still can\u0027t run in anything but native resolution? When I try to edit the resolution the game locks then I have to Alt F2 and kill it with the task manager. I then go to restart it and i get a blank screen and have to delete my config file or edit it with note and set the resolution to native full screen. 1.3.1 runs fine in any resolution. Just having this problem with 1.4\u002B . Anyone else still getting this or is their something I\u0027m missing with my system? I would like to go back to enjoying playing on my 4K TV but that\u0027s not going to happen until this #$\u0026amp;## gets fixed. I wiped my install and downloaded a clean new version from steam. And Oh yeah Still have this.    \u003Cimg alt=\u0022Nur2cml.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/Nur2cml.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2018-03-31T12:44:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223340647\u0022 data-ipsquote-contentid=\u0022173300\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221522499343\u0022 data-ipsquote-userid=\u0022144613\u0022 data-ipsquote-username=\u0022Delbrutis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Delbrutis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnyone else still getting this\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223340647\u0022 data-ipsquote-contentid=\u0022173300\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221522499343\u0022 data-ipsquote-userid=\u0022144613\u0022 data-ipsquote-username=\u0022Delbrutis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, Delbrutis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nStill have this.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDitto.\n\u003C/p\u003E\n\u003Cp\u003E\nI guess we wait some more.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-31T12:45:06Z\u0022 title=\u002203/31/2018 12:45  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 31, 2018\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Delbrutis","CreatedById":144613,"CreatedDateTime":"2018-03-31T12:49:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223340657\u0022 data-ipsquote-contentid=\u0022173300\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221522500256\u0022 data-ipsquote-userid=\u002269272\u0022 data-ipsquote-username=\u0022steve_v\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 minute ago, steve_v said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes.\n\u003C/p\u003E\n\u003Cp\u003E\nDitto.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou on Linux or Mac? I think in the last few updates Linux and mac players have become second class citizens so to speak. With Linux users dropping down to about 3rd class.\n\u003C/p\u003E\n"},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2018-03-31T13:06:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223340660\u0022 data-ipsquote-contentid=\u0022173300\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221522500541\u0022 data-ipsquote-userid=\u0022144613\u0022 data-ipsquote-username=\u0022Delbrutis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n40 minutes ago, Delbrutis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou on Linux or Mac?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGentoo GNU/Linux.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223340660\u0022 data-ipsquote-contentid=\u0022173300\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221522500541\u0022 data-ipsquote-userid=\u0022144613\u0022 data-ipsquote-username=\u0022Delbrutis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n40 minutes ago, Delbrutis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe last few updates Linux and mac players have become second class citizens\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s been that way for a while. Remember the \u0022double free or corruption\u0022 debacle? Or crashing peoples window managers? Or crashing if pulseaudio wasn\u0027t available?\u003Cbr\u003E\nYou\u0027ll be excited to learn that joystick support is also broken on Linux...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-31T13:31:58Z\u0022 title=\u002203/31/2018 01:31  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 31, 2018\u003C/time\u003E by steve_v\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Delbrutis","CreatedById":144613,"CreatedDateTime":"2018-04-01T04:16:11Z","Content":"\n\u003Cp\u003E\nYes I was aware of the joystick débâcle. I cant play on my main monitor or use my Thrustmaster \u0022yeah!\u0022 . So I was willing to be a little patient and give Squad a chance. I only really bought the DLC to support them. I have zero interest in the mission builder. I was going to stay on 1.3.1 until things got sorted. With it I don\u0027t have to change  my second monitor to the primary to play . Then Squad comes out with a real quick patch announcement that no one saw coming. I read the patch note\u0027s \u0022\u003Cs\u003EFixVabmenu\u003C/s\u003E \u0022 \u003Cs\u003EFix Unity shader Mac Linux\u003C/s\u003E\u0022 \u0022Fixed off centre Wolfhound\u0022  I thought great let\u0027s give it a try. \u0022WOW I think WOW I\u0027M just totally speechless\u0022  Not only is hardly anything  that\u0027s  listed as fixed working for me! This broke so much more stuff and made it worse! 1.4.2 is a total joke as a bug patch. I just don\u0027t think it\u0027s possible to be more disappointed. Right when I load the game I run into a bunch of graphical glitches that were not there in 1.4.1! Massive texture tearing in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. And I\u0027M ruining V-sync enabled \u0022Tried it all three settings of V-sync And turned AA on and off\u0022 Made no difference. Massive texture Z fighting It was kind of bad in 1.4.1 now it\u0027s off the chart . So resolution bug aside once I set the game up 1.4.1 was at least playable. I brought over a mini Saturn rocket I built in 1.4.1 to test frame rates and check out if a couple of bugs got squashed. Loaded it put it on the pad AND clamps let go------ It drops! LOL New engine plate for engine\u0027s no longer feed\u0027s fuel to said engine\u0027s I rebuilt this rocket a half dozen times to be sure. YEP Works in 1.4.1 broken in 1.4.2. So not to be denied my fraps test I push on ! With new fuel lines run individually to all 9 engines I\u0027m ready for launch. First stage is a go surprise it works. second stage separation and KABOOM. Fairing’s blow up \u0022 No\u0027 No\u0027 Not just blow apart\u0022 But completely obliterate a full Saturn first stage. I had not even fired the second stage motors. Bravo Squad how very Kerbal I have not laughed this hard since the good old .24 days THE KRAKEN HAS ARISEN. Good times People you can only keep on smiling  through the pain. I now cristien this  patch 1.4.2 Repeating History.      \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOK my bad I went back to look at the patch note\u0027s and I was totally wrong Looks like it said something about parachute Shader being fixed not unity shader and it said something about overlay in map menu not the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E menu bug. Totally me being stupid and not reading things carefully enough. I guess I need to step back some and cool off. SORRY SQUAD. That being said I think most of this post is justified. No DLC should Ever! Break its base game code so badly. This level of plain bad should never get though testing. And post 1.0 release the game needs to be Engine complete at some point . I bought the DLC because I wanted to support you guy\u0027s. Not because I was really all that excited for the content . Make some more cool DLC to sell us great!  Just Please stop breaking the base game. Oh and as a side note. This has nothing to do with MODS.... I have never ever asked a moder when will it be done or said you have to fix something for me ever! This is about a Version release and the accompanying DLC Completely ruining the base game. At least for a minority of players. Hey Linux and Mac users paid money to play the game! I hate to say this but maybe if you guys cant handle it you need to be honest and say 1.4\u002B and DLC for windows platform only? How much of a disaster would this be to the reputation your trying to rebuild if this kind of release was on consol?  I feel like I just spent $15 to wreck my game so I could take part in a beta to find bugs for a upcoming XBOX-DLC release. Were really sorry we had a bad consol release  We will make it up to you! We want and need your business demographic! \u0022We will just #!!%##** all the Linux users\u0022 That\u0027s a really small demographic and we already have their money.\n\u003C/p\u003E\n\u003Cp\u003E\nSorry if this is really harsh I just felt it needed to be said.                        \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-01T07:00:48Z\u0022 title=\u002204/01/2018 07:00  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 1, 2018\u003C/time\u003E by Delbrutis\u003C/strong\u003E\n\u003Cbr\u003EFix My own Stupidity and Rant\n\u003C/span\u003E\n"},{"CreatedByName":"radonek","CreatedById":84077,"CreatedDateTime":"2018-04-02T12:38:21Z","Content":"\n\u003Cp\u003E\nCool down man. Yeah, 1.4.2 is a wreck, but it\u0027s a multiplatform wreck - it bombs on all platforms :-) Only serious linux specific issue I have is that game ignores window size enforced by window manager and gets confused until I resize it. And that is still better then how older versions handled it.\n\u003C/p\u003E\n"},{"CreatedByName":"GarrettKajmowicz","CreatedById":100570,"CreatedDateTime":"2018-04-02T17:50:27Z","Content":"\n\u003Cp\u003E\nI am also experiencing the part \u0022slide down\u0022 issue.\n\u003C/p\u003E\n"}]}