{"TopicId":173762,"ForumId":69,"TopicTitle":"KSP won\u0026#039;t start! 8(... Linux fun! (Solved)","CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2018-04-11T05:03:44Z","PageNum":1,"Articles":[{"CreatedByName":"Arugela","CreatedById":133381,"CreatedDateTime":"2018-04-11T05:03:44Z","Content":"\n\u003Cp\u003E\nKSP simply flashes on in a window for a split second then disapears...\n\u003C/p\u003E\n\u003Cp\u003E\nThis could be from stuff I had to do to recover my operating system from a full root drive.\n\u003C/p\u003E\n\u003Cp\u003E\nI had to delete /var/log/journal/* to get it to properly get into the OS.\n\u003C/p\u003E\n\u003Cp\u003E\nI then deleted several desktop environments to make room on the root drive etc.\n\u003C/p\u003E\n\u003Cp\u003E\nI used: \u0022$sudo dnf remove @lqtx\u0022; \u0022$sudo dnf remove @xfce\u0022; \u0022$sudo dnf remove openbox\u0022;\n\u003C/p\u003E\n\u003Cp\u003E\nNow ksp won\u0027t start. I assume I either deleted something the the logs it uses and needs or a dependency with the OS environments. Anyone have any clue or know where to look to find out what could be the problem.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve since tried verifying the game files in steam, which said one was bad and repaired, deleted the game and fresh installed several times, and resintalled steam itself. Nothing changing the behaviour. The game was working fine before all of this happened.\n\u003C/p\u003E\n\u003Cp\u003E\nFedora 27 64bit\n\u003C/p\u003E\n\u003Cp\u003E\nKSP 1.4.2.2110 (steam)\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t think it\u0027s producing a log file atm.\n\u003C/p\u003E\n\u003Cp\u003E\nNeither steam start or using the KSP.exes is working. Same exact result. I\u0027m assuming this is either a missing dependency or something in /var/log/journal/* ksp needs.\n\u003C/p\u003E\n\u003Cp\u003E\nDoes anyone know how to check dependencies for linux?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EEdit: I just got the same warnings. My root drive is full. Something is filling it up constantly and if I restart my computer it likely won\u0027t start up again... anyone know anything about this in general in linux atm?! I have no idea what is going on.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003ESomething is continuously filling up my root and destroying my system. the problem is it\u0027s not the journal. The journal folder is still empty from having just deleted it\u0027s contents. It\u0027s something else. What is stupid is that it\u0027s not showing up as full in disk usage analyzer(it shows only 13gb of 20gb of my root being used.). There is something invisible filling my root.\u003C/s\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cs\u003EEdit: I figured it out. /var/spool/abrt was filling. It was filling up every 3 seconds with a small 44.4 folder... Deleted them all and seeing if it fills up again. Had to delete them because it was filling root and making the system break down. Not sure which thing was causing it. One was system manager KF5 which I think might be from my lovely broken plasma desktop. But I didn\u0027t go through to check. Not sure if this is related to KSP or n\u003C/s\u003Eot.\n\u003C/p\u003E\n\u003Cp\u003E\nStill no luck on getting ksp started. I\u0027m assuming something got removed with the desktop environments. But I think the root partition has stopped filling up. I also don\u0027t need to change to manjora as I was about too. Just need to figure out what was removed. I have no idea where to find something that might show what is going on. The window is open for a split second when the program starts then stops. Not sure where that might be logged in linux. And starting it is not producing the logs in spool.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t even think the process is showing up in the mate system monitor.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m going to try to reinstall all of those desktop environments and restart to see if it helps. Edit: No luck. I didn\u0027t fix or change the problem from what I can tell.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFixed: I reinstalled the video drivers. Something must have gotten removed. It\u0027s loading now.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-04-11T08:16:10Z\u0022 title=\u002204/11/2018 08:16  AM\u0022 data-short=\u00226 yr\u0022\u003EApril 11, 2018\u003C/time\u003E by Arugela\u003C/strong\u003E\n\u003C/span\u003E\n"}]}