{"TopicId":177381,"ForumId":69,"TopicTitle":"Lost all control and INFO of spaceship","CreatedByName":"Pilot43869","CreatedById":183910,"CreatedDateTime":"2018-08-07T15:01:38Z","PageNum":1,"Articles":[{"CreatedByName":"Pilot43869","CreatedById":183910,"CreatedDateTime":"2018-08-07T15:01:38Z","Content":"\n\u003Cp\u003E\nHello dear Astronauts, \n\u003C/p\u003E\n\u003Cp\u003E\nI need your help with a very strange problem I have found. So a few kerbal years ago I launched a Surface outpost headed for the Mun. It landed there and was fully controlable for quite some time. It has solar panels, batteries, a good antenna and a drone core which would make it possible to handle (please see the attached image for details). However, now when I try to go back to it, it will not let me do ANYTHING at all. I can\u0027t handle lights, I can\u0027t right click on anything including the passenger cockpits/science lab. Even more, I can\u0027t see any information of it, the information is now just a small empty grey box, - see the upper right corner on the attached img. The information about signal strength etc. is also unavailable. I suspect this is a bug but I have no clue how to resolve it, tried restarting KSP multiple times and time-warped to see if it made any difference. \n\u003C/p\u003E\n\u003Cp\u003E\nIMAGE: https://imgur.com/a/FmiXeNs\n\u003C/p\u003E\n\u003Cp\u003E\nWould deeply appreciate any help,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nKind regards,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPIlot \n\u003C/p\u003E\n"},{"CreatedByName":"4x4cheesecake","CreatedById":187982,"CreatedDateTime":"2018-08-07T15:18:07Z","Content":"\n\u003Cp\u003E\nThe link to the screenshot does not work.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a wild guess anyway: like many other kerbonauts, you may like to plant a flag next to a base. Is it possible you switched to the flag instead of the base (or maybe some debris located around)?\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2018-08-08T07:40:40Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u0022t8i1qYx.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/t8i1qYx.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLooking at the screenshot, it does appear that the camera is not centered on the ship as one wold expect it to.   Cheese may be right in that you are actually trying to control some invisible debris.  Try hitting [ or ] to toggle through the vessels within range. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you seem to be getting spammed by messages, I think that was resolved a few versions ago.  If you aren\u0027t running the current version of the game, try updating and loading the save to see if both problems get fixed. \n\u003C/p\u003E\n"},{"CreatedByName":"Pilot43869","CreatedById":183910,"CreatedDateTime":"2018-08-08T08:47:35Z","Content":"\n\u003Cp\u003E\nYou guys were totally right, it was the flag’s fault since they were named the same in the tracking station. Thank you both so much!:)\n\u003C/p\u003E\n"}]}