{"TopicId":178651,"ForumId":69,"TopicTitle":"How to extract a misplaced kerbal?","CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2018-09-30T22:35:35Z","PageNum":1,"Articles":[{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2018-09-30T22:35:35Z","Content":"\n\u003Cp\u003E\nSomehow, yesterday, Olivia Kerman, when boarding my long range exploration vessel\u0027s lab, ended up in an undefined space.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Kc3rNXV.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022380\u0022 src=\u0022https://i.imgur.com/Kc3rNXV.jpg\u0022 width=\u0022311\u0022\u003E\u003Cimg alt=\u0022Rsshy1b.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022341\u0022 src=\u0022https://i.imgur.com/Rsshy1b.jpg\u0022 width=\u0022559\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s no part to click to send her on EVA. No portrait in the lower right of the screen, when the vessel is focused. She\u0027s somewhere \u0022on the ship\u0022 but not in any crewed part. And the mission can\u0027t really progress without her. Plus I\u0027d rather not return to Kerbin to recover her just yet... Probably editing the save would help, but what, where should I edit to move her to a normal crewed part?\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2018-09-30T23:11:34Z","Content":"\n\u003Cp\u003E\nHm.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d go into the persistent.sfs and look at Gilvey Kerman, and then change Olivia Kerman to look like him everywhere that appears to be some sort of location. If the planetary laboratory has  a free seat that is. You may need to specify the seat number in the file but I\u0027ve never done it before so I don\u0027t know how the game decides who\u0027s in which seat. But just getting her into the module may make EVA/transfer possible.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso look for Gilvey and Olivia elsewhere in the SFS. They may be listed in the ships themselves. If any of that stuff is out of sync weird things (like this) can happen.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-09-30T23:13:45Z\u0022 title=\u002209/30/2018 11:13  PM\u0022 data-short=\u00225 yr\u0022\u003ESeptember 30, 2018\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-10-01T21:33:09Z","Content":"\n\u003Cp\u003E\nMoving to Technical Support.\n\u003C/p\u003E\n"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2018-10-01T22:39:47Z","Content":"\n\u003Cp\u003E\nFound it. Somehow the craft got a part  of type \u0022KerbalEVA\u0022 attached to it. Erased the part, moved \u0022crew = Olivia Kerman\u0022 to a part that could take passengers (the lab which already contained the other scientist - just add a second \u0022crew =\u0022 line below.\n\u003C/p\u003E\n"}]}