{"TopicId":185582,"ForumId":69,"TopicTitle":"switching to craft resulting in NaN errors (fix included)","CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2019-06-17T23:21:39Z","PageNum":1,"Articles":[{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2019-06-17T23:21:39Z","Content":"\n\u003Cp\u003E\nThis started off as a question and plea for help, but as I made notes in here I gradually worked my way to a solution, so I thought I\u0027d post it anyway incase it could help anyone else.\u003Cbr\u003E\u003Cbr\u003E\nI wanted to have a station on a solar orbit with almost the same orbital characteristics as Kerbin (except it is inclined by about 4.4 degrees). So the station basically trails just behind Kerbin, staying just outside of Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and oscillating up and down relative to Kerbin (I might get into why I wanted this in another post!).  Anyway, after some careful manoeuvring I got the station almost perfectly into place, it has almost the same \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E/\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E as Kerbin and the it\u0027s orbital period is only off my 23 seconds. By setting a maneuver node and advancing it in time I could see that it would gradually shift closer and closer to Kerbin, but wouldn\u0027t re-enter the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E for a couple hundred years.  So I was happy with that and left the station with it\u0027s two occupants and went to do other things.\n\u003C/p\u003E\n\u003Cp\u003E\nok, that\u0027s the preamble, now for the problem. \n\u003C/p\u003E\n\u003Cp\u003E\nAround 200(ish) days after placing the station in orbit I went to check on the station.  Moments after switching to it the game slowed right down and then the station vanished and the altimeter went red and all 0s; a tell tale sign of NaN errors.  And sure enough when I opened the debug console it was just haemorrhaging NaN errors. Like this, but for all parts and constantly repeating. \n\u003C/p\u003E\n\u003Cpre class=\u0022ipsCode\u0022\u003E\n[ERR 22:50:29.289] Infinity or NaN floating point numbers appear when calculating the transform matrix for a Collider. Scene hierarchy path \u0022cupola (Midas Array)/model/Squad/Parts/Command/cupola/model(Clone)/collider_base\u0022\u003C/pre\u003E\n\u003Cp\u003E\nOn returning to the space station all the buildings were transparent and I had to restart the game.\u003Cbr\u003E\nSo I reloaded a save from before I switched to the station and tried again. same result.\u003Cbr\u003E\nThen I thought, maybe some time related calc is resulting in the NaNs, so perhaps if I let some more time elapse it\u0027ll sort it self out. So waited around 20 more days and tried again. same result.\u003Cbr\u003E\u003Cbr\u003E\nI then decided to crack out hyper-edit and see what else I could see.  \u003Cbr\u003E\nI tried hyper-editing another \u0027test\u0027 vessel along side the station. This time the station still vanished and the logs were full of NaNs but I was able to revert flight on the test vessel and \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E wasn\u0027t effected. So at least I could keep trying things without restarting the game each time.\u003Cbr\u003E\nNext I tried putting the test vessel in Kerbin orbit and using HE to bring the station alongside the test vessel.  On clicking apply the station appeared and all seemed fine, No NaNs in the logs and no vanishing station.  but various other things are screwy; some parts are misaligned and (very oddly) if I took one of the crew out on EVA I could control their thrusters, but they had no effect, so they\u0027d just drift.  Also EVA crew\u0027s power reading was NaN.....and this was the clue that lead to a fix.\u003Cbr\u003E\u003Cbr\u003E\nI reverted to a save before any hyper edit mucking about and opened the save in an editor (vim), a quick search found that several (but not all) modules on the station had \u0060amount = NaN\u0060 for their electric charge resource, so I did a global find and replace for amount = NaN to amount = 5. Saved and then reloaded it in KSP and joy of joys, I was able to switch to my station and all was fine.\n\u003C/p\u003E\n\u003Cp\u003E\nStill not sure what the cause was (I have a suspect, but no proof) and I\u0027m not sure if this will be a recurring problem.\u003Cbr\u003E\nPart of the station\u0027s mission is a long term life support study.  I\u0027m running with TAC-LS and the station has parts from Universal Storage II that do recycling of LS resources. TAC requires a background processing mod to process LS usage while the ship is unfocused so my guess is that it\u0027s some part of that process that\u0027s resulted in NaN values.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTL:DR Had a station that would cause NaN errors when switching to it. Found that several of the stations batteries had NaN power available, so edited the save file and replaced \u0060amount = NaN\u0060 with \u0060amount = 5\u0060 across the whole save and that fixed the problem.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Torchster","CreatedById":205589,"CreatedDateTime":"2020-07-07T02:29:27Z","Content":"\n\u003Cp\u003E\nI started getting an error just like this. My power readings are going to nan and soon my tiny station and all my manned spacecraft will disappear. Again.  Don’t like the idea of editing these files, if I can even find them. I’m not a programmer, I’m a player. I’ll probably have to nuke everything and start over again. Ugh. I wish I knew what mod was causing this issue. Never had it until the last patch I instilled. I’m currently one behind. I should never have patched up a few weeks ago. Everything was stable.  It takes so long for this error to pop up, figuring out which mod is the issue might make the game not worth playing\n\u003C/p\u003E\n\u003Cp\u003E\nI just want stuff to work. \n\u003C/p\u003E\n"}]}