{"TopicId":192814,"ForumId":69,"TopicTitle":"[solved] My ship explodes at 2590m altitude.","CreatedByName":"Darbin Giesorg","CreatedById":157957,"CreatedDateTime":"2020-03-31T23:13:04Z","PageNum":1,"Articles":[{"CreatedByName":"Darbin Giesorg","CreatedById":157957,"CreatedDateTime":"2020-03-31T23:13:04Z","Content":"\n\u003Cp\u003E\nEdit: The problem was apparently a corrupted craft file, although it\u0027d still be interesting to know what makes it splode internally, change of air density, new biome, whatnot.\n\u003C/p\u003E\n\u003Cp\u003E\nMy ship consistently explodes at ~2590m altitude, regardless of speed. I have tried flying up to 2580m and then inching forward with the thrust controls and it always and reliably explodes at a specific height.\n\u003C/p\u003E\n\u003Cp\u003E\nThis has never happened with any other ship so far, so at first I thought I had pitched too hard, then I thought it needs more struts, then I thought I was too fast, but even at 5m/s, once the ship reaches that altitude, it immediately detonates.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s my attempt at posting screenshots for visualization:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://postimg.cc/H8cLhw4Y\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022screenshot3.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.postimg.cc/H8cLhw4Y/screenshot3.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://postimg.cc/YvwSdm47\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022screenshot4.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.postimg.cc/YvwSdm47/screenshot4.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://postimg.cc/wtwTxfwx\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u0022screenshot5.png\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i.postimg.cc/wtwTxfwx/screenshot5.png\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s my blueprint, not sure if sharing works.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/602dxqhhe7jxnrh/BugShipThatExplodes.7z?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/602dxqhhe7jxnrh/BugShipThatExplodes.7z?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHow to reproduce the explosion:\n\u003C/p\u003E\n\u003Cp\u003E\n- Launch the ship.\n\u003C/p\u003E\n\u003Cp\u003E\n- Get above 2590m.\n\u003C/p\u003E\n\u003Cp\u003E\n- It should detonate there. I mean it shouldn\u0027t but that\u0027s what happens for me.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs for the ship itself, it is not very well designed. It has structural weakpoints (attached booster under docking port) of which I\u0027m unsure how to overcome them without compromising the look of the final craft. I used plenty of struts. This is my biggest ship so far. It is supposed to get a transit station in Low Kerbin Orbit with plenty of room for crew and temporary fuel tanks that can return on their own, return capsules and a rescue ship. It is not streamlined yet.\n\u003C/p\u003E\n\u003Cp\u003E\nThis seems to be a bug. Maybe it relates to my settings somehow but I wouldn\u0027t know what exactly. Tell me what I can tell you, post, upload and I will, but I don\u0027t even know where to start.\n\u003C/p\u003E\n\u003Cp\u003E\nA workaround will be splitting the payload into different ships and I will certainly try that. But it seems like there is some physics issue where the game... transitions to a new layer and there is an internal collision or something. I have no idea and I shouldn\u0027t speculate.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-04-05T03:05:29Z\u0022 title=\u002204/05/2020 03:05  AM\u0022 data-short=\u00224 yr\u0022\u003EApril 5, 2020\u003C/time\u003E by Darbin Giesorg\u003C/strong\u003E\n\u003Cbr\u003ESolved.\n\u003C/span\u003E\n"},{"CreatedByName":"4x4cheesecake","CreatedById":187982,"CreatedDateTime":"2020-04-01T01:55:29Z","Content":"\n\u003Cp\u003E\nI\u0027ve loaded your craft into my game and it\u0027s the same for me, the craft explodes at ~2590m ASL but I couldn\u0027t find anything interesting in the flight log. After playing around with the craft in the editor, I\u0027ve noticed a few things though:\n\u003C/p\u003E\n\u003Cp\u003E\nIf you remove the fairings on the left and right, a single \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thruster will remain in mid air, which isn\u0027t attached to anything (it\u0027s not highlighted if you hover over the root part of the craft) and if you try to launch it then, you\u0027ll get an error message: \u0022part 4294373202 is missing\u0022, so if opened your craft file in a text editor to look up, which part it is. Apparently, it\u0027s one of the medium sized reaction wheels down in the service bay of the center stack. Coincidentally, if you move the whole craft by grabbing the root part, one of these reaction wheels will stay there in mid air, like the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thruster (which also dosn\u0027t move).\u003Cbr\u003E\nEven though you can pick up these floating parts, you cannot delete them or do anything at all with them and at some point, you will just get the error message about the missing part again.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve tried a few things to remove these parts from the craft file via text editor but I always ended up crashing my game or 80% of the craft just disappeared.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I have to come to the conclusion, that your craft file is corrupted and maybe, someone more skilled comes around who can fix the file for you or maybe there is even a tool for this somewhere in the \u0022\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/35-tools-and-applications/\u0022 rel=\u0022\u0022\u003ETools and Applications\u003C/a\u003E\u0022 subforum but I think, the easiest way is to rebuild the whole craft from scratch.\u003Cbr\u003E\nUnfortunately, I cannot tell you why this happened to your craft, so maybe it happens again or maybe not \u003Cspan\u003E\u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2020-04-01T02:29:55Z","Content":"\n\u003Cp\u003E\nAfter reading \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/187982-4x4cheesecake/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022187982\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/187982-4x4cheesecake/\u0022 rel=\u0022\u0022\u003E@4x4cheesecake\u003C/a\u003E\u0027s post, it sounds like an issue I had a long time ago, except my craft exploded as soon as I pressed the space bar to launch it. I have no idea why yours doesn\u0027t explode until a certain altitude, unless it has something to do with air density/pressure *shrug*. If you were doing a lot of work with symmetry, sometimes a part gets \u0022stuck,\u0022 which this issue sounds like. The best solution, now that you have your design hopefully figured out, is to rebuild it from scratch. And I mean \u003Cem\u003Escratch\u003C/em\u003E. Reboot your computer (or console as the case may be), launch KSP, go to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, and build it again from a clean slate. With all the symmetry going on, it may be best to build up one of your side boosters and save it as a subassembly, to add it (in symmetry) to your core later. \n\u003C/p\u003E\n\u003Cp\u003E\nPro tip: I see you have a lot of docking ports (too many open ports can contribute to lag, but you should be okay). Your design lends itself to one of my favorite tricks. Place your radial decouplers closer to the top or bottom, and align your docking ports closer to the other end so they are almost touching in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E. When you take it to the pad, the ports will stick together, eliminating the need to strut the side boosters to the core. By opening the \u003Cabbr title=\u0022Part Action Window\u0022\u003EPAW\u003C/abbr\u003E for the ports by rt-clicking them, you can enable staging for the ports, so they will undock when you stage off the radial decouplers.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s an example....\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ZGWLOJl.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ZGWLOJl.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-04-01T02:35:50Z\u0022 title=\u002204/01/2020 02:35  AM\u0022 data-short=\u00224 yr\u0022\u003EApril 1, 2020\u003C/time\u003E by StrandedonEarth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Darbin Giesorg","CreatedById":157957,"CreatedDateTime":"2020-04-02T14:16:35Z","Content":"\n\u003Cp\u003E\nThe secondary docking connection is a fantastic trick I will use from now on.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso thanks for finding the problem. If it\u0027s just a corrupted file, I will simply build the thing again from scratch. I was worried there was a fundamental problem with big ships with wonky connections going up but I am relieved.\n\u003C/p\u003E\n\u003Cp\u003E\nBy the by, does anyone know how I can keep a lower-end docking port on the payload and still firmly attach a decoupler beneath it (see lower booster) without this becoming the rocket\u0027s weak point?\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-04-04T08:35:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223765128\u0022 data-ipsquote-contentid=\u0022192814\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221585836995\u0022 data-ipsquote-userid=\u0022157957\u0022 data-ipsquote-username=\u0022Darbin Giesorg\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/2/2020 at 3:16 PM, Darbin Giesorg said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBy the by, does anyone know how I can keep a lower-end docking port on the payload and still firmly attach a decoupler beneath it (see lower booster) without this becoming the rocket\u0027s weak point?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you enable \u0027advanced tweakables\u0027 in the settings, you\u0027ll get the option to add autostruts which will create invisible but fully functional struts between that part and either a) the heaviest part on the rocket, b) the root part or c) the grandparent part- each part is attached to another part, which is its parent, so in the rocket StrandedOnEarth posted, the twin boar engines on the sides are attached to the radial decouplers (parent) which are attached to the central orange fuel tank (their parent, and the parent of a parent is a grandparent).\n\u003C/p\u003E\n\u003Cp\u003E\nWhen you\u0027re building rockets with radially attached boosters, it\u0027s a good idea to fix the booster part (I usually use SRBs like the Thumper) to the heaviest part for maximum stability, with any fuel tanks on top of that fixed to their grandparent which greatly improves rigidity and the nosecone on the top fixed to the root, which in total makes the boosters stay pretty much exactly where they are in flight instead of wobbling around and occasionally ending up pointing backwards. The same applies in a stack- strut some of the higher parts in later stages to the heaviest part and some of the lower stage parts to either root or grandparent parts, and this works with docking ports in the stack too.\n\u003C/p\u003E\n\u003Cp\u003E\nThat original rocket of yours looks really strange to me- why are you using a solid rocket as the main stage and twin boars as radial boosters? It\u0027s better to do it the other way round and set the booster decouplers to \u0027enable crossfeed\u0027 so that the fuel tanks on top of the boosters can feed the core stage and drain first before being discarded.\n\u003C/p\u003E\n"},{"CreatedByName":"Darbin Giesorg","CreatedById":157957,"CreatedDateTime":"2020-04-05T02:01:58Z","Content":"\n\u003Cp\u003E\nThe idea of the rocket was to have the fuel rockets be reusable. Behind the fairing is a drone core with batteries and \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E. I didn\u0027t know how much I\u0027d spend getting the station up there, so I ballparked it, gave it a little extra and planned on sending one stage back after emptying its contents into the other in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E by detaching it and using \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to re-enter the atmosphere. The rockets have a ton of parachutes on them. The Twin Boars provide better economy and power than a tank with Mainsail and I just land them at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E for money. The big booster in the middle is just there because the Twins didn\u0027t have enough power at sea level and it\u0027s the only part that won\u0027t be reused.\n\u003C/p\u003E\n\u003Cp\u003E\nThe station itself does not need a big engine. It\u0027s supposed to stay where it is and correct with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or via helper ship if necessary.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if the center bit had been a Twin Boar as well, I would have to fit it with parachutes and a drone core with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E, too. Possible but since I had problems getting anything attached to the docking port in the first place (probably haven\u0027t found a proper autostrut configuration yet but I\u0027ll try strutting to various parts like you suggested), putting even more in between didn\u0027t feel good. I wanted the booster for extra punch and then to be discarded with the two carrier rockets transporting the Kerbal Space Station into orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nTurns out, I\u0027m almost using up all the fuel just getting that thing up there. Still, a little is left and it\u0027s going to be my future stop for ships to refuel. Currently building a leviathan of a fuel rocket so I can store large amounts of fuel on the station, or its current appended fuel tank, whether that\u0027s the second rocket or a new one with more capacity and less fins.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the pointers.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit: If anyone ever uses two docking ports per rocket instead of one and the game doesn\u0027t give you the option to undock, I found that making a docking port the \u0022main docking port\u0022 allows me to undock again, which is better than sifting through the savegame file and fixing the docking port bug manually. Related to the docking port suggestion, not to OT, but I didn\u0027t find anything about it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-04-05T02:05:37Z\u0022 title=\u002204/05/2020 02:05  AM\u0022 data-short=\u00224 yr\u0022\u003EApril 5, 2020\u003C/time\u003E by Darbin Giesorg\u003C/strong\u003E\n\u003C/span\u003E\n"}]}