{"TopicId":193938,"ForumId":69,"TopicTitle":"Really weird glitch - Rover on Mun suddenly experiences no gravity?","CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2020-05-17T04:56:42Z","PageNum":1,"Articles":[{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2020-05-17T04:56:42Z","Content":"\n\u003Cp\u003E\nEDIT - there\u0027s a weird glitch persistent across saves adversely affecting game play.  I have a rover landed on the Mun and it worked fine.  Has a Grabber unit - which I planned to use to help transfer fuel to and from different ships.  Then I launched a second ship made up of a Mk 1-3 Command Pod (with associated stuff - antennas, fuel tanks, engines, etc) attached to a MPL (again with stuff - that being science, antennas, gear etc).  No Mods.  After landing the second ship, everything went south.  Attaching the claw to anything worked; but then revisiting the ship made everything bounce and I got the \u0022Easing Physics\u0022 message -- which research tells me is a Kraken problem.\n\u003C/p\u003E\n\u003Cp\u003E\nReverted to a previous save.  Before landing the second ship.  Now I am convinced the problem is with that ship.  Because when I did a test separation in orbit over the Mun - I could not re dock the two craft.  The suspect part is the MPL, which, even with a Kerbal in it refuses to do anything (e.g. extend antenna).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIs the only hope to revert even further and delete / rebuild the entire ship?\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\n(\u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E below in spoiler)\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve not seen this before.  I have a rover on the Mun, based on the MEM.  I used a grabber unit to transfer fuel from the rover to a lander... and as soon as the fuel was out of the MEM tank, the arm the grabber was attached to broke at the hinge and the lander... wandered skyward - with me unable to control it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n… or rather that\u0027s not entirely true.  The wheels turn.  I can extend the antenna... but it literally floats.  Like off to space kind of floating.\n\u003C/p\u003E\n\u003Cp\u003E\nExcept - again - if I use the brackets \u0022[\u0022 or \u0022]\u0022 - it teleports back to the ground... and then starts to float off again.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nReally frustrating... because the lander was a key strategy for my 14% future mining site.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNo mods.  I do have Breaking Ground and the History Expansions.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWin 10 Pro 64 bit system with AMD Ryzen 7 2700x, 16GB RAM.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-05-18T00:33:27Z\u0022 title=\u002205/18/2020 12:33  AM\u0022 data-short=\u00224 yr\u0022\u003EMay 18, 2020\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2020-05-17T15:06:26Z","Content":"\n\u003Cp\u003E\nUpdate:  I loaded a previous save and have worked my way back to where I was... but I\u0027m very hesitant to repeat the offloading of fuel (last action before loss of gravity / mass).  In other words, the problem occurred but is not persistent regardless of save.  At some point I will try to repeat the offloading of fuel from the MEM to test whether doing so makes the computer think the root part (and thus all attachments) are massless.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nCouple of thoughts: its either a glitch in offloading fuel from the MEM with a grabber, or possibly a heat issue or a part-count issue  - it happened at the end of a long play session in a place with three vehicles each with a ton of parts all in close proximity.\n\u003C/p\u003E\n"},{"CreatedByName":"archiebald","CreatedById":195579,"CreatedDateTime":"2020-05-22T06:10:08Z","Content":"\n\u003Cp\u003E\nBouncing of landed parts and bases is well known, I have had bases jump hundreds of meters when I approached them.\n\u003C/p\u003E\n\u003Cp\u003E\nThe mod World Stabilizer helps a lot.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for extended gameplay causing glitches - absolutely!!!  KSP is famous for it.  I generally play for about 2 hours max before seeing something that makes me think a re-start might be necessary.  I think the best I\u0027ve ever maaged was 4 hours before having to re-start.\n\u003C/p\u003E\n"}]}