{"TopicId":194171,"ForumId":69,"TopicTitle":"The Game Won\u0026#039;t Update Itself","CreatedByName":"classicaljazzman","CreatedById":167677,"CreatedDateTime":"2020-05-26T01:10:08Z","PageNum":1,"Articles":[{"CreatedByName":"classicaljazzman","CreatedById":167677,"CreatedDateTime":"2020-05-26T01:10:08Z","Content":"\n\u003Cp\u003E\nHi there,\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s been a LONG time since I have played KPS, so much so that when I tried to boot it up recently, it started loading the game (with the loading screen pictures and funny quotes and stuff) but said I was running an unsupported version, and that I should download the latest update (0.9.99.2788). It even gave me a link to click on to do so. Problem is, when I click on it, I get a screen that says \u0022The page you requested does not exist.\u0022 This is weird to me on two accounts. First, because it\u0027s a link that was generated by the game itself, not a forum or tech support person or something. And more importantly, Steam is designed specifically to keep my games up to date at all times, as it reminds me every single time I open it. Any ideas? I am playing this on a newer computer right now than when I previously played it. On that older one I had mods, but this one I do not, and I also uninstalled my making history expansion so it should just be vanilla right now. I tried uninstalling and reinstalling. I tried verifying the cache. What am I missing?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n\u003Cp\u003E\nBrad\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2020-05-26T01:34:36Z","Content":"\n\u003Cp\u003E\nThat sounds like a mod not the game itself.\n\u003C/p\u003E\n\u003Cp\u003E\nPost a screenshot of KSP with the error on the screen.\n\u003C/p\u003E\n"},{"CreatedByName":"classicaljazzman","CreatedById":167677,"CreatedDateTime":"2020-05-26T14:54:36Z","Content":"\n\u003Cp\u003E\nI think you\u0027re right. It was a mod. But I deleted \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003Eckan\u003C/abbr\u003E and all of its files. Now I get the game 99% loaded and it stops and freezes. It won\u0027t go to the main title screen. Thanks!\n\u003C/p\u003E\n"}]}