{"TopicId":196435,"ForumId":69,"TopicTitle":"my models are all black","CreatedByName":"chikititus","CreatedById":206906,"CreatedDateTime":"2020-08-21T15:38:45Z","PageNum":1,"Articles":[{"CreatedByName":"chikititus","CreatedById":206906,"CreatedDateTime":"2020-08-21T15:38:45Z","Content":"\n\u003Cp\u003E\nguys, i need some help. My game is with all black models (the ships, the kerbals, the clothes, etc.)\u003Cbr\u003E\nI bought the game through steam, and all my ships, from the angar until the moment I explode on the ground, are black. Jebediah\u0027s camera is buggy too, only his head appears in the black square. I don\u0027t have any mods installed, and I didn\u0027t download the expansions either. My game is in the latest version (1.10), and is downloaded from steam. I\u0027ve tried to change the graphics shadows, but nothing helps to solve them. I am attaching here some videos of the game (I recorded with my cell phone). It runs at a maximum of 28 FPS, but that doesn\u0027t bother me, just that everything is black.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://photos.google.com/share/AF1QipNW46Go7cYabPtC42-IzcOoSDbHqGSN8dcW4EnvdC9yxtPx8XZMvFjmgytMTIWcGg?key=UExQVmF5TFVoVGpNVU9zYlhfc0pEUFRZLWFqNUV3\u0022 rel=\u0022external nofollow\u0022\u003EHere de videos\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2020-08-21T16:24:52Z","Content":"\n\u003Cp\u003E\nVerify the files.\n\u003C/p\u003E\n\u003Cp\u003E\nRight click on KSP in your library in Steam, Click Properties, then Local Files I think, Verify File integrity.   This should fix any corrupted files you may have.\n\u003C/p\u003E\n\u003Cp\u003E\nIf that doesn\u0027t work, make sure you are using all the correct updated video drivers for your card. \n\u003C/p\u003E\n\u003Cp\u003E\nAnd if that still isn\u0027t fixing the issues, report back and we\u0027ll take a deeper look. \n\u003C/p\u003E\n"}]}