{"TopicId":197770,"ForumId":69,"TopicTitle":"Kerbal Space program (new version) crashes upon launch","CreatedByName":"PertualOutrage","CreatedById":207867,"CreatedDateTime":"2020-10-28T19:50:22Z","PageNum":1,"Articles":[{"CreatedByName":"PertualOutrage","CreatedById":207867,"CreatedDateTime":"2020-10-28T19:50:23Z","Content":"\n\u003Cp\u003E\nI had this issue for hours, I have done everything from verifying the files integrity via steam, reinstalling it, restarting my computer, and updating my graphics driver. Just everything\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-10-30T08:28:29Z","Content":"\n\u003Cp\u003E\nHello, and welcome to the KSP forum.\u003Cbr\u003E\u003Cbr\u003E\nPlease read this guide on how to get support, it explains what information you should provide to make it easier for others to help you:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022100668\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed3518634906\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/83213-stock-support-bug-reporting-guide/\u0026amp;do=embed\u0022 style=\u0022height:195px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nLog files are going to be necessary so follow that guide to find them, upload them to a file sharing site then put a link to them here.\u003Cbr\u003E\nA few key questions- where did you download KSP from? What version are you using? Operating system and specs of your PC? Where exactly does it stop loading? (Screenshots would help here).\n\u003C/p\u003E\n"},{"CreatedByName":"THX1138","CreatedById":113955,"CreatedDateTime":"2020-11-09T09:10:09Z","Content":"\n\u003Cp\u003E\nDoes it crash after getting to the main menu? I am having a crash which I can avoid if I\u0027m really quick and close the update message. You have to be ready for it to finish loading and then immediately click \u0022close\u0022 or whatever the button is labelled to dismiss the message about the update (no time to even click \u0022don\u0027t show this again\u0022 first).\n\u003C/p\u003E\n"}]}