{"TopicId":199227,"ForumId":69,"TopicTitle":"Bug(?) about stages after undocking","CreatedByName":"MertMe","CreatedById":209118,"CreatedDateTime":"2020-12-31T17:58:27Z","PageNum":1,"Articles":[{"CreatedByName":"MertMe","CreatedById":209118,"CreatedDateTime":"2020-12-31T17:58:27Z","Content":"\n\u003Cp\u003E\nHi everyone, my problem is about stages merging after undocking. I landed on Mun and run out of fuel. I sent refuel station with normal Docking Port  connected to hinge and pistons so I can manuever docking port independently much like an arm. I got crafts closer, and docked. Transfered the fuel and everything is fine upto this point. When I undocked I saw that I can no longer control my main craft, it doesn\u0027t have a name and even though two crafts undocked I can control both simultaneously like it is a single craft,  stages got merged and  can\u0027t get crafts separated. Is this a bug or am I doing something wrong.  ( I don\u0027t want to send a capsule to get my crew back, I want that particular craft back for challenge)\n\u003C/p\u003E\n\u003Cp\u003E\nTLDR: I docked with normal Docking Port that is connected to pistons and hinges, transfered fuel, undocked and crafts and stages got merged even after undocking. \n\u003C/p\u003E\n\u003Cp\u003E\nAny ideas? Thanks in advance.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-01T08:07:35Z\u0022 title=\u002201/01/2021 08:07  AM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 1, 2021\u003C/time\u003E by MertMe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-12-31T23:18:33Z","Content":"\n\u003Cp\u003E\nSounds like you got the bug with undocking not always working right. You may need to load a save from before the two things got docked together, or go rummaging in the forums to find one of several threads about similar issues which also contain possible fixes. I believe there’s also a mod that can unpick corrupted saves, but haven’t used it and can’t remember the name.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2020-12-31T23:44:06Z","Content":"\n\u003Cp\u003E\nIt sounds like you\u0027ve got that rare but annoyingly persistent undocking bug, but I\u0027m sorry that I don\u0027t remember the fix. I have however moved your post to the Support sub where I hope someone does. Good luck. \n\u003C/p\u003E\n"},{"CreatedByName":"MertMe","CreatedById":209118,"CreatedDateTime":"2021-01-01T06:34:31Z","Content":"\n\u003Cp\u003E\nI have the save just before two vehicles docked. I tried docking maybe 15 times and the result is still same. I have to add that when I undock, hinge on my main craft breaks away from it, probaby because of slope and pistons create tension.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I tested on Kerbin, there was no problem. I also have save file before I launched refuel station.\n\u003C/p\u003E\n"},{"CreatedByName":"MertMe","CreatedById":209118,"CreatedDateTime":"2021-01-01T15:17:44Z","Content":"\n\u003Cp\u003E\nNormal docking port still doesn\u0027t work, they merge after undocking. However, thankfully I had added Jr. Docking port at top which separates properly. My guess that it must be something to do with normal docking port.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso Normal Docking Port separated properly when I tried small rover.  I don\u0027t know why it doesn\u0027t work with main vehicle.\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2021-01-01T20:57:57Z","Content":"\n\u003Cp\u003E\nI’ve not had your exact issue, but have encountered a lot of bugs when trying to dock vessels using robotic parts (hinges, servos, and pistons).   \u003Cbr\u003E\nOne thing to try is to turn the Damping on all robotic parts to zero (or as low as they can go..).    For rovers with wheels, I have also had to turn the Damping on the wheels to zero.   The bug I was experiencing was amplified when the masses of the two vessels was greatly different, one tiny rover docking to a massive ship.\n\u003C/p\u003E\n\u003Cp\u003E\nIt sounds like you are only experiencing this with the Normal Docking Port, and while also using robotics?   If you are able to post a screenshot that might be useful.\n\u003C/p\u003E\n"},{"CreatedByName":"MertMe","CreatedById":209118,"CreatedDateTime":"2021-01-02T17:43:28Z","Content":"\n\u003Cp\u003E\nI think I figured out why this happens. I tried 0 dampening thing but didn\u0027t work. What happens is that when I undocked hinge that connected to piston and docking port on my main craft comes off even with unbreakable joints. I think before docking port undocks  it breaks and since there is no vehicle connected it can\u0027t undock and the vehicle is put into purgatory. I tried disassembling parts with a kerbal setting gravity to zero and assembling again but again same, still comes off. I believe the problem is this but might be wrong. I will use top port for this one since it works, but going to be careful on next craft.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-01-02T18:32:55Z\u0022 title=\u002201/02/2021 06:32  PM\u0022 data-short=\u00223 yr\u0022\u003EJanuary 2, 2021\u003C/time\u003E by MertMe\u003C/strong\u003E\n\u003C/span\u003E\n"}]}