{"TopicId":85827,"ForumId":69,"TopicTitle":"CPU impact of non-active ships","CreatedByName":"damerell","CreatedById":123074,"CreatedDateTime":"2014-10-01T14:25:03Z","PageNum":1,"Articles":[{"CreatedByName":"damerell","CreatedById":123074,"CreatedDateTime":"2014-10-01T14:25:03Z","Content":"\n\u003Cp\u003EI\u0027ve started to hit FPS problems recently, with 100% of a CPU core in use. I was wondering how much of a CPU load non-active ships flying \u0022on rails\u0022 impose; if it\u0027s worth deorbiting some of the mess of comms satellites I have up and replacing them with a smaller number of more capable ones. Any comment, please?\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-10-01T14:40:34Z","Content":"\n\u003Cp\u003EUnless you have hundreds upon hundreds of them they shouldn\u0027t have a noticeable impact. (That is assuming you run stock KSP)\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-10-01T14:48:05Z","Content":"\n\u003Cp\u003ETo put things in perspective, you could have 10,000 On-Rails ships (including debris, flags, asteroids, etc) and you would still be using less processing power than if you left Notepad open in the background.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-10-01T15:10:32Z","Content":"\n\u003Cp\u003EI\u0027m guessing that your issue is more related to which mods you\u0027ve got rather than the number of in flight craft.\u003C/p\u003E\n"},{"CreatedByName":"damerell","CreatedById":123074,"CreatedDateTime":"2014-10-01T15:25:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alshain\u0022 data-cite=\u0022Alshain\u0022\u003E\u003Cdiv\u003ETo put things in perspective, you could have 10,000 On-Rails ships (including debris, flags, asteroids, etc) and you would still be using less processing power than if you left Notepad open in the background.\u003C/div\u003E\u003C/blockquote\u003E Thanks. (I see this item was moved; I wasn\u0027t sure where to put it, since I was interested in the answer for both modded and unmodded games). I\u0027ll not worry about my commsat array, then.\n"},{"CreatedByName":"Nedal","CreatedById":104926,"CreatedDateTime":"2014-10-01T15:31:33Z","Content":"\n\u003Cp\u003ERemote Tech, and KSPInterstellar related items do add up to serious lag though.. with all the relay line of sight, power calcs, and nuclear fuel usage stuff I assume.\u003C/p\u003E\u003Cp\u003EAlso I found the load times for launching a ship take longer and longer as the above related flights add up as well.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-10-01T15:33:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EI\u0027m guessing that your issue is more related to which mods you\u0027ve got rather than the number of in flight craft.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWho mods affect non active flights? I know TAC life suport does something but not much, it messes up both electricity and water/ air use if you have recycling so I think its just estimates based on data then you left ship. \u003C/p\u003E\u003Cp\u003EI know having many large ship makes switching back to space center and to tracking station very slow, it also increase memory use.\u003C/p\u003E\n"},{"CreatedByName":"damerell","CreatedById":123074,"CreatedDateTime":"2014-10-01T15:36:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EWho mods affect non active flights? I know TAC life suport does something but not much, it messes up both electricity and water/ air use if you have recycling so I think its just estimates based on data then you left ship. \u003C/div\u003E\u003C/blockquote\u003E The TACLS panel just counts down the amounts you left behind when the ship was last active, as if the kerbonauts aboard were using them and nothing else was generating or consuming them; but as far as I know this is just to give you a guess as to endurance, and when you return to the ship it fast-forwards to find out if the little green rascals are actually dead or not.\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-10-01T15:57:11Z","Content":"\n\u003Cp\u003ENo mods affect on rails flights. Some mods like TAC Life Support and Remote Tech 2 do ancillary actions while the craft is unloaded. Other mods like Karbonoite do time based calculations when the craft is reloaded to simulate actions that would have taken place while it was unloaded (Karbonite can be collected and refined while the craft is unloaded, but technically it does nothing until you reload the craft, a little bit of programming illusion and fakery). However none of these directly affect the unloaded craft while it is unloaded.\u003C/p\u003E\n"}]}