{"TopicId":86430,"ForumId":69,"TopicTitle":"0.25 Crew Transfer w/ IVA-less parts (fail to disable \u0026#039;C\u0026#039; key to IVA)","CreatedByName":"cakepie","CreatedById":69278,"CreatedDateTime":"2014-10-08T02:23:20Z","PageNum":1,"Articles":[{"CreatedByName":"cakepie","CreatedById":69278,"CreatedDateTime":"2014-10-08T02:23:20Z","Content":"\n\u003Cp\u003EThe new crew transfer mechanism introduced in 0.25 causes issues with crew parts that lack IVA (such as the SPP Mk2 Crew Cabin) -- after a kerbal is transferred to an IVA-less part using crew transfer, the \u0027C\u0027 key to toggle IVA does not get disabled. Pressing \u0027C\u0027 causes KSP to try to jump into an inexistent IVA, which seems to be a camera centered within the part containing the kerbal, at which point the game glitches. At this point, the \u0027C\u0027 key no longer works, and it is not possible to toggle out of the glitched IVA. You are stuck unless you press ESC and revert to launch/editor. [Edit: reloading a quicksave should work too.]\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKSP Version:\u003C/strong\u003E v0.25.0.642 Windows 32-bit\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOS\u003C/strong\u003E: Windows 7\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMods / Add-Ons:\u003C/strong\u003E All Stock\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESteps to Replicate:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1) In SPH, make a craft consisting of only SPP Mk2 Cockpit and Mk2 Crew Cabin\u003C/p\u003E\u003Cp\u003E2) Go to SPH crew tab, place only \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eone\u003C/span\u003E Kerbal in the Cockpit, and \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Enone\u003C/span\u003E in the Crew Cabin\u003C/p\u003E\u003Cp\u003E3) Launch.\u003C/p\u003E\u003Cp\u003E4) Use the new 0.25 crew transfer. Click on the crew hatch on the Cockpit, click \u0022Transfer\u0022 button, click on Crew Cabin. The kerbal should have been moved.\u003C/p\u003E\u003Cp\u003E5) Press \u0027C\u0027 key for toggling IVA view. Camera switches to inexistent IVA, glitches out, no longer able to toggle out of IVA. Stuck unless revert.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOther Notes:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1)\u003C/p\u003E\u003Cp\u003EThis problem is specific to the new crew transfer mechanism. There is no issue if you take the kerbal EVA and then enter the Crew Cabin manually -- the \u0027C\u0027 key is correctly disabled since there is no IVA available.\u003C/p\u003E\u003Cp\u003E2)\u003C/p\u003E\u003Cp\u003EIf there are other kerbals in the craft sitting in parts that do have IVA (e.g. same as above steps but start with TWO kerbals in cockpit), then the problem seems to only occur if you transferred the \u0022first\u0022 kerbal in the craft (i.e. the one that the \u0027C\u0027 key takes you to by default) and then press \u0027C\u0027 fairly soon (\u0026lt; 1~2 seconds) after making the transfer. If you wait several seconds after the transfer before pressing \u0027C\u0027, it will take you to the kerbal that does have a valid IVA, so it seems that after a while, KSP does figure out that the moved kerbal no longer has a valid IVA, and binds the \u0027C\u0027 key IVA toggle to the other kerbal instead. Also, if you did switch to the IVA-less kerbal, it is possible to recover out from the glitched inexistent IVA -- waiting several seconds for KSP to sort itself out before pressing \u0027C\u0027 again will switch to the other kerbal that does have an IVA view, and from there it is possible to toggle in and out of IVA view as intended.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFixes/Workarounds:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- (guaranteed safe) Avoid using crew transfer into IVA-less parts, or\u003C/p\u003E\u003Cp\u003E- (uncertain) Make sure there are other crew sitting in valid IVA seats.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-08T06:12:01Z\u0022 title=\u002210/08/2014 06:12  AM\u0022 data-short=\u00229 yr\u0022\u003EOctober 8, 2014\u003C/time\u003E by cake\u0026gt;pie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"hoojiwana","CreatedById":57079,"CreatedDateTime":"2014-10-08T03:58:08Z","Content":"\n\u003Cp\u003ENice catch!\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-10-08T06:06:55Z","Content":"\n\u003Cp\u003EAwesome! And thanks for the nice report. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"}]}