{"TopicId":88633,"ForumId":69,"TopicTitle":"Mun Contracts Not Showing Up","CreatedByName":"Warmblood","CreatedById":63296,"CreatedDateTime":"2014-10-27T03:06:58Z","PageNum":1,"Articles":[{"CreatedByName":"Warmblood","CreatedById":63296,"CreatedDateTime":"2014-10-27T03:06:58Z","Content":"\n\u003Cp\u003ESo I am a fairly experienced player, testing out a maximum stock difficulty campaign. Rewards at 10%, starting funds 0, negative starting reputation, etc. I\u0027ve found this to be fairly doable, although my mountain landing program sadly led to the loss of one kerbal (should have bailed out when it started to slide!) I have a Mun mission in orbit, ready to go.\u003C/p\u003E\u003Cp\u003EHowever, I have a problem: I am not getting the Mun exploration contract. I did the initial Kerbin orbit contracts, some miscellaneous parts testing contracts, and several \u0022science data around Kerbin\u0022 contracts. I have no active contracts, and I can accelerate time seemingly ad infinitum, but the Mun contracts have yet to show up for me. \u003C/p\u003E\u003Cp\u003EWhat gives? Is there something I need to have before Mun exploration contracts show up? I certainly don\u0027t have much in the way of resources, but I do have positive reputation, positive funds, and at least some science unlocked.\u003C/p\u003E\u003Cp\u003EI certainly never thought there were any pre-reqs for the Mun contracts, but then again I was used to unlocking the Mun after the first flight with much more science and rewards, I\u0027ve looked around for info on this, but haven\u0027t found any, so if there is anything a player has to have before receiving Mun contracts, it would be nice to have that information out there.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-10-27T03:09:32Z","Content":"\n\u003Cp\u003EI suspect it\u0027s because your reputation is so low. Even the exploration contracts have minimum reputation requirements, they\u0027re just set to something really unlikely for a normal player to run into (-750 or -500, I think?).\u003C/p\u003E\n"},{"CreatedByName":"Aethon","CreatedById":110755,"CreatedDateTime":"2014-10-27T05:12:03Z","Content":"\n\u003Cp\u003EThis happened to me in the .24.2 update. I had launched a low tech ship very early to get \u0027in space high above the sun\u0027 science and I think that prevented me from getting the explore Minmus contract.\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2014-10-27T05:36:40Z","Content":"\n\u003Cp\u003EContracts are given based on your current reputation standing. It\u0027s a way for the game to gauge how well the player is doing and hand out contracts accordingly. If you have a low rep, the game assumes you aren\u0027t doing well, so it will try to give you easier contracts.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-10-27T16:30:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EContracts are given based on your current reputation standing. It\u0027s a way for the game to gauge how well the player is doing and hand out contracts accordingly. If you have a low rep, the game assumes you aren\u0027t doing well, so it will try to give you easier contracts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the other parameter is achievements of landing on bodies, Mun, Minmus, then Eve, Duna and Ike as a group, then Gilly, Jool, Pol Bop, Tylo, Val and Laythe. \u003C/p\u003E\u003Cp\u003ENote that passing trough the SOI of an body result in you don\u0027t getting any explore contract for it. Sun is not included as far as i know, might be if you never passed outside kerbin SOI before doing Mun and Minmus.\u003C/p\u003E\n"},{"CreatedByName":"Dwight_js","CreatedById":83255,"CreatedDateTime":"2014-10-27T18:01:08Z","Content":"\n\u003Cp\u003EI\u0027ve said it before, and I\u0027ll say it again - this is why the game should allow you to \u0022negotiate\u0022 your own contracts. The current system is too leading. You should be able to choose a destination, an activity, and maybe the time-frame too, then you get offers of funds and/or science based on your reputation. If I want to leave Kerbin SOI on mission 2, I should be able to find someone to pay me for it.\u003C/p\u003E\n"},{"CreatedByName":"Warmblood","CreatedById":63296,"CreatedDateTime":"2014-10-27T20:40:26Z","Content":"\n\u003Cp\u003EThanks for the replies. I didn\u0027t know there were any minimum reputation limits for contracts. It\u0027s *probably* due to that. I think I\u0027m still under 100 reputation.\u003C/p\u003E\n"}]}