{"TopicId":91524,"ForumId":69,"TopicTitle":"High-speed impact causes game to freeze","CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2014-11-29T00:52:38Z","PageNum":1,"Articles":[{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2014-11-29T00:52:38Z","Content":"\n\u003Cp\u003EI was attempting to crash an impactor into the Mun\u0027s surface for science (Interstellar mod), and when it hit the surface (780 m/s) the game froze. I uninstalled all mods to try and isolate the cause, but the freeze still occurs on impact. I feel like I\u0027ve encountered this before, but until now I never had much reason to crash. Is this a known thing?\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-11-29T01:30:16Z","Content":"\n\u003Cp\u003EI don\u0027t remember hearing of anything exactly the same so I can\u0027t say for sure. Either way, it would be very useful if you could work out a reliable way to repeat it (e.g. steps to follow from a particular save game) and also post the output_log.txt/player.log file that results from you repeating it in stock KSP...\u003C/p\u003E\u003Cp\u003EDetailed instructions on where to find the necessary log file can be found in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92230-Stock-Support-Bug-Reporting-Guide\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2014-11-29T02:03:39Z","Content":"\n\u003Cp\u003EThere was no crash log, as it didn\u0027t really crash, just freeze requiring a task manager closing. The only real additional info involved is that it the craft in question is a probe using the Stayputnik core, and that it hits at a steep trajectory. The freeze doesn\u0027t seem to happen on the rare occasion when the core survives the first impact.\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-11-29T13:10:45Z","Content":"\n\u003Cp\u003EI didn\u0027t say anything about a crash log. The game always writes out an output_log.txt/player.log file (depending on OS) every time it is run. Do you have a save game with the probe on approach to Mun?\u003C/p\u003E\n"}]}