{"TopicId":95475,"ForumId":69,"TopicTitle":"Cannot start game at all","CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-03T05:13:40Z","PageNum":1,"Articles":[{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-03T05:13:40Z","Content":"\n\u003Cp\u003EI\u0027ve just had a very frustrating day battling with KSP.\u003C/p\u003E\u003Cp\u003EMy normal KSP install (modded, but I\u0027ll explain in a bit why that isn\u0027t relevant here) developed a game-breaking bug: after crashing so hard that it reset the computer, it was impossible to load or save any craft from the SPH in a Sandbox save. Clicking the load/save icons just fails to do anything, and if I try to sneak a ship into the SPH via the runway/edit craft option, only the stock craft are available.\u003C/p\u003E\u003Cp\u003ERather than spend eternity attempting to track down that one, I decided to just reinstall KSP from scratch; it was kind of overdue for that anyway.\u003C/p\u003E\u003Cp\u003EHowever, I can\u0027t even get a new install to open: it crashes during the initial loading screens, 100% of the time, even after scrubbing it and reinstalling from scratch again. There are no mods involved here at all; they were completely fresh clean installs.\u003C/p\u003E\u003Cp\u003EI\u0027ve run into this before; I have a very dodgy laptop that cannot handle KSP unless the graphics are wound down a bit, and the default settings are enough to crash it. But normally, I can just use the settings option in the Launcher to wind down the graphics to minimum before opening the game for the first time, and then carefully tweak them up to just what my laptop can manage.\u003C/p\u003E\u003Cp\u003EDoing that now isn\u0027t working; even if I set the options in the Launcher to minimal graphics and not full screen, when I try to start the game it opens in full screen and crashes before ever getting to the main menu. I suspect that it\u0027s ignoring the Launcher settings and attempting to start with graphics at a level that my computer can\u0027t handle.\u003C/p\u003E\u003Cp\u003EI have no idea of how to work around this. At the moment I have no functioning KSP at all, modded or unmodded.\u003C/p\u003E\u003Cp\u003EThere\u0027s an output log from the new install here: \u003Ca href=\u0022https://www.dropbox.com/s/4whbre8kasq497h/output_log.txt?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/4whbre8kasq497h/output_log.txt?dl=0\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-03T05:16:16Z\u0022 title=\u002201/03/2015 05:16  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 3, 2015\u003C/time\u003E by Wanderfound\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-01-03T07:06:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EAt the moment I have no functioning KSP at all, modded or unmodded.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell that\u0027s no good, hopefully we can get that sorted out. You\u0027re definitely running out of memory.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003Ed3d: failed to create 2D texture id=2223 w=2048 h=2048 mips=12 d3dfmt=22 [out of memory]\u003C/p\u003E\u003Cp\u003EDynamicHeapAllocator out of memory - Could not get memory for large allocationCould not allocate memory: System out of memory!\u003C/p\u003E\u003Cp\u003ETrying to allocate: 22369620B with 4 alignment. MemoryLabel: NewDelete\u003C/p\u003E\u003Cp\u003EAllocation happend at: Line:0 in Overloaded New[]\u003C/p\u003E\u003Cp\u003EMemory overview\u003C/p\u003E\u003Cp\u003E[ ALLOC_DEFAULT ] used: 256154009B | peak: 0B | reserved: 267548368B \u003C/p\u003E\u003Cp\u003E[ ALLOC_GFX ] used: 121344487B | peak: 0B | reserved: 149152412B \u003C/p\u003E\u003Cp\u003E[ ALLOC_CACHEOBJECTS ] used: 222888B | peak: 0B | reserved: 12582912B \u003C/p\u003E\u003Cp\u003E[ ALLOC_TYPETREE ] used: 0B | peak: 0B | reserved: 0B \u003C/p\u003E\u003Cp\u003E[ ALLOC_PROFILER ] used: 117072B | peak: 0B | reserved: 8388608B \u003C/p\u003E\u003Cp\u003ECould not allocate memory: System out of memory!\u003C/p\u003E\u003Cp\u003ETrying to allocate: 22369620B with 4 alignment. MemoryLabel: NewDelete\u003C/p\u003E\u003Cp\u003EAllocation happend at: Line:0 in Overloaded New[]\u003C/p\u003E\u003Cp\u003EMemory overview\u003C/p\u003E\u003Cp\u003E[ ALLOC_DEFAULT ] used: 256154009B | peak: 0B | reserved: 267548368B \u003C/p\u003E\u003Cp\u003E[ ALLOC_GFX ] used: 121344487B | peak: 0B | reserved: 149152412B \u003C/p\u003E\u003Cp\u003E[ ALLOC_CACHEOBJECTS ] used: 222888B | peak: 0B | reserved: 12582912B \u003C/p\u003E\u003Cp\u003E[ ALLOC_TYPETREE ] used: 0B | peak: 0B | reserved: 0B \u003C/p\u003E\u003Cp\u003E[ ALLOC_PROFILER ] used: 117072B | peak: 0B | reserved: 8388608B \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003ESo my first suggestion would be to manually edit the settings.cfg. Find the line \u0022TEXTURE_QUALITY = \u0022 and set it to \u0022TEXTURE_QUALITY = 3\u0022. That should crank that down all the way. The first run of KSP usually takes a lot of RAM for some reason (I guess because of run time compiling?). You can also manually edit your desired resolution directly in the settings.cfg (SCREEN_RESOLUTION_WIDTH = XXX and SCREEN_RESOLUTION_HEIGHT = XXX).\u003C/p\u003E\u003Cp\u003EAlso, get KSP out of your \u0022Documents\u0022 library and install it somewhere else like \u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003EC:\\Games\\KSP...\u003C/span\u003E Copy/Paste it (or unzip a fresh copy). Do NOT \u0022move\u0022 it or windows DEP may still mess you up. If you unzip a fresh copy, make sure to edit that settings.cfg file directly (you might have to start KSP once to make it generate one, or copy from your other failed install).\u003C/p\u003E\u003Cp\u003EAfter that, try running directly from KSP.exe.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-03T09:53:27Z","Content":"\n\u003Cp\u003ENo go, unfortunately.\u003C/p\u003E\u003Cp\u003EShifted to C:\\KSP, reinstalled fresh with the installer, wound Texture Quality to 3 (and later tried 5, just in case), made sure no other programs were running, started from KSP.exe. The graphics settings in the .cfg are already claiming to be not-fullscreen and lower res than I use, although the loading screen is still fullscreen until it crashes.\u003C/p\u003E\u003Cp\u003EStill 100% crash rate in the loading screen.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-01-03T10:10:17Z","Content":"\n\u003Cp\u003EMake sure to copy KSP to C:\\Games and no to move it or Windows DEP will still have those files listed as potentially unsafe.\u003C/p\u003E\u003Cp\u003EBut what I think is causing this, is this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Ed3d: failed to create 2D texture id=2223 w=2048 h=2048 mips=12 d3dfmt=22 [out of memory]\u003Cp\u003EDynamicHeapAllocator out of memory - Could not get memory for large allocationCould not allocate memory: System out of memory!\u003C/p\u003E\u003Cp\u003ETrying to allocate: 22369620B with 4 alignment. MemoryLabel: NewDelete\u003C/p\u003E\u003Cp\u003EAllocation happend at: Line:0 in Overloaded New[]\u003C/p\u003E\u003Cp\u003EMemory overview\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou definitely shouldn\u0027t see this with a new stock install, and even on a modded install, this is a problem, maybe the graphics driver is corrupt or the PC is on a low power mode and the card is not working at full speed, or if it shares RAM, it hasn\u0027t got enough.\u003C/p\u003E\u003Cp\u003EYou mentioned a laptop, many laptops have a main gfx card and a low power Intel chip for powersave mode, your log says it\u0027s using an Intel:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EDirect3D:\u003Cp\u003E Version: Direct3D 9.0c [igdumdx32.dll 8.15.10.2266]\u003C/p\u003E\u003Cp\u003E Renderer: Intel® HD Graphics Family\u003C/p\u003E\u003Cp\u003E Vendor: Intel\u003C/p\u003E\u003Cp\u003E VRAM: 746 MB (via DXGI)\u003C/p\u003E\u003Cp\u003E Caps: Shader=30 DepthRT=1 NativeDepth=1 NativeShadow=1 DF16=1 INTZ=1 RAWZ=0 NULL=1 RESZ=1 SlowINTZ=0\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKSP won\u0027t like to run on these low power chips.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-03T10:27:05Z","Content":"\n\u003Cp\u003EI know; the computer is underspec. Best I can afford, though.\u003C/p\u003E\u003Cp\u003EIt appears that my career save on the original install is still working fine. But Sandbox refuses to have a functioning SPH, even if I start a new Sandbox save. Weird.\u003C/p\u003E\u003Cp\u003EIt may be relevant that it\u0027s the middle of an Australian summer here, and the laptop ran hot even in winter (it\u0027s my old lab machine, and probably has a fair bit of rat fur in it as well as being a bit scuffed up).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-03T10:30:04Z\u0022 title=\u002201/03/2015 10:30  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 3, 2015\u003C/time\u003E by Wanderfound\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-01-03T10:31:05Z","Content":"\n\u003Cp\u003EIf it\u0027s still loading at fullscreen you can try deleting the registry entries for KSP.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-04T02:01:28Z","Content":"\n\u003Cp\u003EIs it practical to upgrade the graphics cards on these things? What sort of cash would I be looking at to do so? It\u0027s already got the max 4GB RAM for an x86 box, and it\u0027s old and battered enough that it\u0027s not worth upgrading too much. I don\u0027t need flashy, just functional.\u003C/p\u003E\u003Cp\u003EI\u0027ve got another 4GB of RAM in the drawer, but that won\u0027t do anything unless I upgrade the OS to x64. Can you still run x86 KSP on a x64 box? Would updating the OS and installing the extra 4GB RAM help at all given the unusability of Windows x64 KSP?\u003C/p\u003E\u003Cp\u003EIt\u0027s a Dell Latitude e6320.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-04T02:06:38Z\u0022 title=\u002201/04/2015 02:06  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 4, 2015\u003C/time\u003E by Wanderfound\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-04T04:09:02Z","Content":"\n\u003Cp\u003EYes, you can run x86 apps on x64 systems. They will typically run better, as on x86 systems, they are very commonly restricted to ~2.5GB of RAM by the OS.You needn\u0027t run the x64 unstable build on an x64 system -- merely having the x64 system running the x86 build will give you a good bit of extra headroom where RAM usage is concerned.\u003C/p\u003E\u003Cp\u003EAnd no, upgrading a laptop\u0027s graphics card is an exercise in frustration. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-01-04T05:06:40Z","Content":"\n\u003Cp\u003EI still can\u0027t imagine why it was working before and not now. Have you tried comparing your old settings.cfg side-by-side with a new one? Perhaps some time long ago you did some tweaks inside that you\u0027ve forgotten about. Or maybe post them here and we can try to help dig through.\u003C/p\u003E\u003Cp\u003EAlso, double check that none of the directories are read-only, that you have freshly installed into the C:\\KSP location, and that the new KSP.exe is exempted from your virus scanner.\u003C/p\u003E\u003Cp\u003EPerhaps another thing to try, to get it to load up. Move your \u0022NASA Mission\u0022 folder out of GameData and try to get KSP to load. Reducing the load burden can also help get some of that real-time compiling done and out of the way. If that\u0027s successful, then move the folder back and try to start KSP again.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-04T05:09:18Z\u0022 title=\u002201/04/2015 05:09  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 4, 2015\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-01-04T08:29:55Z","Content":"\n\u003Cp\u003ECracked it: deleted both the NASAMission and Squad/Parts folders, got it to start up, wound down the graphics and then put the folders back.\u003C/p\u003E\u003Cp\u003EThanks folks.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-01-04T08:40:00Z","Content":"\n\u003Cp\u003ERegarding your pre-reinstall issue, I\u0027d guess that was probably the result of a truncated craft file (which likely happened due to the crash). \u003C/p\u003E\u003Cp\u003EIf you run into it again (either in the SPH or the VAB), you can check this by opening your save\u0027s Ships\\VAB (or Ships\\SPH) folder and looking for an unusually small file (compared with the others). Open that file in Notepad to double check it; you\u0027ll usually see a very brief file, or a file that just ends abruptly, and without the normal cascades of closing braces. Deleting the borked craft can usually solve the issue. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}