{"TopicId":97774,"ForumId":69,"TopicTitle":"Making Parts Float...!","CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2015-01-25T14:32:38Z","PageNum":1,"Articles":[{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2015-01-25T14:32:38Z","Content":"\n\u003Cp\u003EHello everyone!\u003C/p\u003E\u003Cp\u003EWhile this isn\u0027t really something I want help with, as it certainly won\u0027t affect normal game-play, I found a way to make parts float that probably has to be fixed.\u003C/p\u003E\u003Cp\u003EHow do you do this?\u003C/p\u003E\u003Cp\u003EWell, you start off with one or more Place-Anywhere 7 Linear RCS ports mounted anywhere on the vehicle and rotated so that they are facing \u0022backwards:\u0022 the rear end, the one with an \u0027X\u0027 on it, is more than 50% visible.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tSb4xNY.jpg\u0022 alt=\u0022tSb4xNY.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen, take the part that you want to float (a battery pack in this case), and slowly move it around on the top and sides of the RCS port, until voila! It\u0027s floating.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Pm54kpm.jpg\u0022 alt=\u0022Pm54kpm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou can also float Linear RCS ports, and then float other things off of \u003Cem\u003Ethem!\u003C/em\u003E Things rapidly get somewhat strange.\u003C/p\u003E\u003Cp\u003EFloating parts are quite stable when launched: physics doesn\u0027t really care much about the fact that they\u0027re just hanging out in mid-air.\u003C/p\u003E\u003Cp\u003ESo, any comments on what\u0027s causing this...?\u003C/p\u003E\u003Cp\u003EThanks for the help.\u003C/p\u003E\u003Cp\u003E-Upsilon\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2015-01-31T15:43:24Z","Content":"\n\u003Cp\u003EDear Everyone,\u003C/p\u003E\u003Cp\u003EI\u0027m going to give this thread a gentle bump, as it\u0027s reached the bottom of the page without anyone telling me what in the world is going on.\u003C/p\u003E\u003Cp\u003EI should clarify that there\u0027s a way to use the Place/Offset/Rotate tools to make parts float, and this is not it. I think it may be glitching this setup, though: note that the \u0022place\u0022 option is a normal white in the first picture but gray in the second.\u003C/p\u003E\u003Cp\u003ECan someone please try this so that I know it\u0027s not just me?\u003C/p\u003E\u003Cp\u003EThanks for the help...\u003C/p\u003E\u003Cp\u003E-Upsilon\u003C/p\u003E\n"}]}