{"TopicId":98078,"ForumId":69,"TopicTitle":"Impossible mission","CreatedByName":"annikk.exe","CreatedById":58049,"CreatedDateTime":"2015-01-28T18:21:34Z","PageNum":1,"Articles":[{"CreatedByName":"annikk.exe","CreatedById":58049,"CreatedDateTime":"2015-01-28T18:21:34Z","Content":"\n\u003Cp\u003EI think I\u0027ve been given an impossible mission.\u003C/p\u003E\u003Cp\u003EThe mission is to take gravity readings from 11,900m above Duna\u0027s surface in a specific spot.\u003C/p\u003E\u003Cp\u003EThe problem is that the game won\u0027t allow me to take gravity readings in the upper atmosphere, which is everywhere between 41,446m (according to the wiki) and about 5,000m (from experimentation). If I try to take a gravity reading anywhere within this range, the game tells me \u0022Gravity scan can\u0027t be done right now.\u0022\u003C/p\u003E\u003Cp\u003EScreenshot:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/udf3dQ3.png\u0022 alt=\u0022udf3dQ3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy save file:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0BzsgpelyP3DITGo3QWxra1BrNW8/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/file/d/0BzsgpelyP3DITGo3QWxra1BrNW8/view?usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(There\u0027s a \u0022download\u0022 button in the bar at the top. You may need to mouse-over the bar before it appears.)\u003C/p\u003E\u003Cp\u003EI\u0027m using the 32 bit version of KSP 0.90.\u003C/p\u003E\u003Cp\u003EWindows 7 x64 Pro\u003C/p\u003E\u003Cp\u003Ei7-3770K cpu\u003C/p\u003E\u003Cp\u003E8GB RAM\u003C/p\u003E\u003Cp\u003ENvidia Geforce GTX 680\u003C/p\u003E\u003Cp\u003EHopefully this isn\u0027t just me doing the mission wrong.. that would be embarrassing.. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Arsonide","CreatedById":32604,"CreatedDateTime":"2015-01-28T19:57:06Z","Content":"\n\u003Cp\u003EThis contract is not impossible. In flight does not necessarily mean atmospheric flight, and gravimetric scans can be taken in orbit.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-01-28T20:02:54Z","Content":"\n\u003Cp\u003EI can confirm, you can do these from orbit, as long as you\u0027re above the area \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SAI Peregrinus","CreatedById":125558,"CreatedDateTime":"2015-01-28T21:37:14Z","Content":"\n\u003Cp\u003EAlso, they\u0027re contracts, not missions. Some of them actually are impossible (for a long time there was a possibility of a contract to test a launch stability enhancer in orbit, it may have been fixed). Don\u0027t accept them, they\u0027re scams. The offering agency is trying to trick you to profit from the penalty clause. Likewise, many contracts will lowball their reward offer. Don\u0027t accept those. Accept contracts only where you can make a reasonable profit, just like IRL.\u003C/p\u003E\n"}]}