{"TopicId":213478,"ForumId":196,"TopicTitle":"Multiple bugs on dres mission, here is a list. They made it almost impossible to play.","CreatedByName":"SeismicSlammer85","CreatedById":226714,"CreatedDateTime":"2023-02-27T00:48:52Z","PageNum":1,"Articles":[{"CreatedByName":"SeismicSlammer85","CreatedById":226714,"CreatedDateTime":"2023-02-27T00:48:52Z","Content":"\n\u003Cp\u003E\nIt\u0027s basically impossible to go interplanetary with the amount of bugs i expirienced. \n\u003C/p\u003E\n\u003Cp\u003E\n-Every time i switch from flight mode to the map screen during a maneuver burn, the maneuver would reset, and the beginning amount of deltaV would be added to the maneuver while you were in it,  essentially adding extra burn time to the maneuver and putting it way off every time you switch between map and flight mode. \n\u003C/p\u003E\n\u003Cp\u003E\n-You can\u0027t keep periapsis or closest approach info up while editing a maneuver. This made it incredibly hard to get an encounter with dres.\n\u003C/p\u003E\n\u003Cp\u003E\n-EVAing on the surface of dres would act as thought you were floating in space, and wouldn\u0027t let you walk, i.e. my Kerbal wouldn\u0027t \u0022stick\u0022 to the ground. Essentially, there was this weird space around my landed craft were Bill would need to use his jetpack to move across the round at all, otherwise he would simply sit still on the ground in a floating pose. This also allowed me to basically glide really fast on the ground with my jetpack. Once I was a certain distance from the craft, the ground acted normal, and Bill would suddenly stop gliding and start walking normally. \n\u003C/p\u003E\n\u003Cp\u003E\n-One of my other kerbals was in the same capsule as Bill, but in the flight view he was invisible from the windows, unlike Bill\n\u003C/p\u003E\n\u003Cp\u003E\n-Exiting timewarp and putting the game at normal speed would suddenly spin my craft out of control on a landing approach\n\u003C/p\u003E\n\u003Cp\u003E\n-On orbit EVA, when walking on solar panels with magnetic boots, Bill was clipping through the model of the panel. I believe that the collision box of the solar panel doesn\u0027t move with the rotation of the model as it faces the sun, so even though the panels were angled Bill would clip through the visual model and walk on the panels at a default angle. \n\u003C/p\u003E\n\u003Cp\u003E\n- EVAing a kerbal in orbit would send them way off, putting them in a different orbit from the craft, with a different inclination, so that it\u0027s impossible to get back to the craft. I fixed this by just moving my craft into a drastically different parking orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n-Undocking a craft would cause a mission failure, despite nothing being destroyed. I tried to undock my lander, and everytime, there was a death screen. I ended up just straight up not undocking my lander and putting the whole spacecraft assembly on dres.\n\u003C/p\u003E\n\u003Cp\u003E\n-Couldn\u0027t undock crafts connected by struts. This is the second reason i had to land with my whole craft. In the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003E\u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E\u003C/abbr\u003E, I strutted my lander to my mothership because for some reason the devs thought making parts incredibly wobbly was a good idea. After decoupling the lander and doing an apollo docking maneuver with the mothership, the struts reappeared and re-strutted the lander in its new position to the mothership. After trying to undock, not only would I get a death screen, but my lander couldn\u0027t physically seperate because of the struts which didn\u0027t come off when i hit \u0022undock\u0022. \n\u003C/p\u003E\n\u003Cp\u003E\n-Bill could plant flags on the craft, even while walking on it in orbit. Flags planted on a landed craft seem to stay in their position when the craft moves away, but I have no clue where the flag I planted while in orbit of dres is.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI really hope the devs take note of these things, because this is why no one can do any proper missions yet, interplanetary is basically unplayable. I really want this game to succeed, so please, get to fiixing!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-27T00:50:48Z\u0022 title=\u002202/27/2023 12:50  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 27, 2023\u003C/time\u003E by SeismicSlammer85\u003C/strong\u003E\n\u003C/span\u003E\n"}]}