{"TopicId":213859,"ForumId":196,"TopicTitle":"my ion drives keep falling off when i go to launch.","CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2023-02-28T06:49:17Z","PageNum":1,"Articles":[{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2023-02-28T06:49:17Z","Content":"\n\u003Cp\u003E\nare the kerbals using chewing gum as a fastener?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-02-28T06:49:38Z\u0022 title=\u002202/28/2023 06:49  AM\u0022 data-short=\u00221 yr\u0022\u003EFebruary 28, 2023\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"twich22","CreatedById":110030,"CreatedDateTime":"2023-02-28T13:42:11Z","Content":"\n\u003Cp\u003E\nIt means your vessel build is bugged somewhere: Some part is glitching with a another part, struts connected in a bugged way, accidentally placing a part you didn’t mean to, accidentally clicking through a UI interface, a part that accidentally got flipped the wrong way, parts that are overlapping with one another, it could be anything. If you happen to know what it was, or roughly when in your build it started happening, and you have old saves of the vessel, you can go back to a working version of the vessel and start building from there. If you don’t know when and where the bug happened then you will probably have to start over from scratch. My recommendation is save often as a new workspace name and test often to make sure your craft is not bugged. If it’s bugged then revert to an older save.\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2023-03-01T07:23:55Z","Content":"\n\u003Cp\u003E\ni think it may have something to do with how i was mounting them. attached one to the like diameter xenon tank and it stayed on. before that i was attaching them in arrays using the structural plates and girders, i think this may be an issue with the structural parts (they should be more... structural). \n\u003C/p\u003E\n\u003Cp\u003E\nim also gonna try rebuilding the ship from scratch. i just didnt have time when i posted the bug. its funny having 20 ion engines just fall off. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-01T07:24:46Z\u0022 title=\u002203/01/2023 07:24  AM\u0022 data-short=\u00221 yr\u0022\u003EMarch 1, 2023\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Draradech","CreatedById":139656,"CreatedDateTime":"2023-03-01T13:40:55Z","Content":"\n\u003Cp\u003E\nAre you using \u003Cspan style=\u0022background-color:#f9f9f9;color:#2d3134;font-size:15px;\u0022\u003EST-Micro-1 (the smallest cube) to attach something on the surface of something else? Those can cause the craft to fall apart. ST-XS-1 (the next bigger cube) doesn\u0027t have that problem.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Nuke","CreatedById":10883,"CreatedDateTime":"2023-03-02T14:00:51Z","Content":"\n\u003Cp\u003E\nyea i think so. i built a 5-cluster with the micro cubes and struts, kind of built as a tree with 3 of them around the core. those fell apart a lot or were kraken food. also the small structural panels have the same effect. i was wondering if the colliders on the ion model were bigger than the cubes and would cause them to nudge each other while under part simulation. or perhaps their strength values in their structural config needs to be raised. structure parts should be the strongest parts in game for their respective sizes (stronger than equivalent tankage). \n\u003C/p\u003E\n\u003Cp\u003E\nbigger cubes would be too big, i ended up using an engine plate and stuck 8 of them on it with the reactor in the middle, that actually worked well. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222023-03-02T14:02:17Z\u0022 title=\u002203/02/2023 02:02  PM\u0022 data-short=\u00221 yr\u0022\u003EMarch 2, 2023\u003C/time\u003E by Nuke\u003C/strong\u003E\n\u003C/span\u003E\n"}]}