{"TopicId":214054,"ForumId":196,"TopicTitle":"Loading screen Will not pogress past \u0022Creating Vessel\u0022 on Grand Tour","CreatedByName":"Rhydster","CreatedById":226534,"CreatedDateTime":"2023-03-01T12:38:29Z","PageNum":1,"Articles":[{"CreatedByName":"Rhydster","CreatedById":226534,"CreatedDateTime":"2023-03-01T12:38:29Z","Content":"\n\u003Cp\u003E\nSo I\u0027m running a long mission, and due to the bug riddled state that KSP 2 is in I\u0027ve got it set to unlimited fuel, because I really want to see all the planets and terrain up close. Fantastic textures you guys have got by the way and really loving all the different contextual music.\u003Cbr\u003E\n\u003Cbr\u003E\nAnyway, I\u0027m not sure if it\u0027s to do with having a flag planted on Eve, or maybe just having 4 flags planted, but the game will not load past \u0022Creating vessel\u0022 when loading my saves. Most recent save I can load is final descent into Eve\u0027s Atmosphere. For reference, went Mun - Minmus - Gilly - Eve. I have no idea how to determine what the problem is, no errors or anything, just not loading\u003Cbr\u003E\n\u003Cbr\u003E\nWould love if there is a solution, coz I want to keep going. Managed to actually get over to Moho before I tried to quickload due to a graphical highlighting error which would have looked sucky in a screenshot\n\u003C/p\u003E\n"},{"CreatedByName":"Rhydster","CreatedById":226534,"CreatedDateTime":"2023-03-01T12:46:47Z","Content":"\n\u003Cp\u003E\nFor Reference, I found this just after I posted and got excited because I thought it might be a solution, but sadly it didn\u0027t work: \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022195096\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed4722027836\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/212319-ksp-2-does-not-open-up-division-dialog-upon-start/\u0026amp;do=embed\u0026amp;comment=4239963\u0026amp;embedComment=4239963\u0026amp;embedDo=findComment#comment-4239963\u0022 style=\u0022height:275px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThey do appear to be having a different issue to me, getting stuck on a different loading point. I realize I could potentially be the only one crazy enough to try a grand tour in the current state the game is in, and thus have encountered errors that nobody else has yet encountered...\n\u003C/p\u003E\n"},{"CreatedByName":"StonethePig","CreatedById":227210,"CreatedDateTime":"2023-03-30T04:54:44Z","Content":"\n\u003Cp\u003E\nSo glad I found this, I swore I was crazy.\n\u003C/p\u003E\n\u003Cp\u003E\nOk, same thing here even with a grand tour on unlimited fuel.  However, tonight it did eventually load, but my vessel wasn\u0027t there.  Hope you found a fix.  \n\u003C/p\u003E\n"},{"CreatedByName":"StonethePig","CreatedById":227210,"CreatedDateTime":"2023-03-30T06:45:31Z","Content":"\n\u003Cp\u003E\nLoaded eventually.  Shows a blank box with AeroGUI on it.  \u003Cimg alt=\u0022:/\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/ZNGIcon1.png\u0022 title=\u0022:/\u0022\u003E\n\u003C/p\u003E\n"}]}