{"TopicId":215030,"ForumId":196,"TopicTitle":"RCS Translation controls not working or not working well?","CreatedByName":"CiberX15","CreatedById":68461,"CreatedDateTime":"2023-03-14T16:00:04Z","PageNum":1,"Articles":[{"CreatedByName":"CiberX15","CreatedById":68461,"CreatedDateTime":"2023-03-14T16:00:04Z","Content":"\n\u003Cp\u003E\nI was trying to use the IJKL H and N \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E translation controls to dock with a ship in orbit but they didn\u0027t seem to want to respond correctly. It felt like they were inverted? But only sometimes? Or barely had enough power to do anything? When \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is set to Stability mode it seems to work ok. I can translate up down left and right well enough, though pretty slowly. However when it’s set to point at my target it’s like the rotation controls take priority and it doesn’t even attempt to fire in the direction I’m trying to move.\n\u003C/p\u003E\n\u003Cp\u003E\nI was literally holding the L key for like 10 seconds, expecting to see white jets come out of the left \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E block, but that never happened. Instead it kept firing all of the other ones, desperately trying to make minor unnecessary rotation corrections to line up with the target that I was trying to dock with and apparently ignoring my input.\n\u003C/p\u003E\n\u003Cp\u003E\nOptimally I’d like to be able to use the JKLI H and N keys to translate the ship using \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E without \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E actually being turned on. In most cases I only want the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for translating anyway and I don’t want the ship burning monoprop for rotations when I have adequate reaction wheels. I only need \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for turning on really big ships.\n\u003C/p\u003E\n\u003Cp\u003E\nI know I could set the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters to manual only in the parts manager, but that removes the option of ever using them for rotation, and is super tedious. Since the JKLI H and N keys only handle translation, they don’t do anything while \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E is off, so it feels like making those buttons work even when \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E is disabled would solve most of this problem? \n\u003C/p\u003E\n"},{"CreatedByName":"sir_frost","CreatedById":149861,"CreatedDateTime":"2023-03-15T20:02:02Z","Content":"\n\u003Cp\u003E\nthis is a known issue with a simple fix (works both in ksp 1 and 2)\u003Cbr\u003E\n\u003Cbr\u003E\nthe simple fix is to use actuation toggles to make sure the same thruster is not used for rotation and translation.\u003Cbr\u003E\nin general you want omnidirectional \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters close to the center of mass to handle all translation.\u003Cbr\u003E\nand optionally you can use \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E far away from the center of mass to rotate the craft but not translate it.\u003Cbr\u003E\npersonally i only use \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for translation in docking scenarios. and i let the reaction wheels handle the rotation.\u003Cbr\u003E\n\u003Cbr\u003E\nto sort this out go in to the settings of your \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thruster and click advanced controls then deselect pitch yaw and roll.\u003Cbr\u003E\nsee the imgur link for how to configure it. \u003Ca href=\u0022https://imgur.com/nDTnaiS\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/nDTnaiS\u003C/a\u003E\u003Cbr\u003E\n\u003Cbr\u003E\nwhen i first learned this trick i had problems with running out of \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel for docking. often i would bring a spare tank just in case.\u003Cbr\u003E\nnow i dock with high precision and often only use the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel built into the capsules and have plenty to spare.\u003Cbr\u003E\n\u003Cbr\u003E\nthe problem with having the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for translation and rotation. is the feedback loop that can occur with unbalanced crafts.\u003Cbr\u003E\nand every time you translate the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E will fire the opposite thruster to cancel the rotation.\u003Cbr\u003E\n\u003Cbr\u003E\nI hope this information is helpful           \n\u003C/p\u003E\n"}]}