{"TopicId":100022,"ForumId":46,"TopicTitle":"Buying this game without steam, from sources other from the official website?","CreatedByName":"Neftyn","CreatedById":138273,"CreatedDateTime":"2015-02-18T18:35:40Z","PageNum":1,"Articles":[{"CreatedByName":"Neftyn","CreatedById":138273,"CreatedDateTime":"2015-02-18T18:35:40Z","Content":"Hello guys! My mom offered to purchase it for me. But we are having some problems.\n\nShe cant use her card over paypal, because we have used it before. But whenever we try, it says the card is attached to an account. But we dont know that account. And Paypal couldnt help us.\n\nWe tried buying paysafecards, but that requires a lot of stuff.\n\nIs there any simple way to buy it and get a key to their site, and not steam?\n\nDue to reasons i have, i cant use it with steam.\n\nDo you guys know any resellers who sell KSP keys for the website perhaps?\n\nOr anywhere i can buy the Paysafecard with the custom amount?"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-02-18T18:42:47Z","Content":"Hi Neftyn, welcome to the forums!\n\nUnfortunately, for now Steam and the KSP Store are the only options for purchase. Apparently they are negotiating some other outlets for selling it when the next version drops, but that is likely a month or more away.\n\nAlternatively, you could try emailing [\\[email protected\\]](/cdn-cgi/l/email-protection#88adbfcae7f8fce1e7e6adbfcc) to see if something can be worked out.\n\n**Edited \u003Ctime datetime=\u00222015-02-18T18:54:25Z\u0022 title=\u002202/18/2015 06:54  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 18, 2015\u003C/time\u003E by Red Iron Crown**"},{"CreatedByName":"Gerandar","CreatedById":136705,"CreatedDateTime":"2015-02-18T18:58:51Z","Content":"Wouldn\u0027t any prepaid credit card work with the KSP store? just go to a walmart or a 7-11 or whatever you guys have where you are and buy a vanilla mastercard or visa O.o"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-02-18T19:00:46Z","Content":"You can use pre-paid cards with PayPal. Just make sure it\u0027s a Visa/MasterCard/AmEx/Discover pre-paid, not a store gift card."}]}