{"TopicId":102665,"ForumId":46,"TopicTitle":"Affiliates system?","CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2015-03-25T09:53:58Z","PageNum":1,"Articles":[{"CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2015-03-25T09:53:58Z","Content":"Greetings,\n\nIs the Affiliate system working? I already went to the site and fill up a form, then I receive a email saying they will contact me soon. \n\nIs the affiliate system already in place or is something that Squad is still working to be released?\n\nThank you."},{"CreatedByName":"Dodgey","CreatedById":89577,"CreatedDateTime":"2015-03-25T10:10:08Z","Content":"Affiliates system? What\u0027s that?"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-03-25T10:59:37Z","Content":"The affiliate program is alive and well as far as I know, you can read more about it [here](https://forum.kerbalspaceprogram.com/content/287-Partner-with-Kerbal-Space-Program). If you have already submitted your form Squad should contact you soon about it (this process is done manually afaik).\n\nMoving this to the Kerbal Network forum, as the topic is better suited for there.\n\n**Edited \u003Ctime datetime=\u00222015-03-25T11:01:53Z\u0022 title=\u002203/25/2015 11:01  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 25, 2015\u003C/time\u003E by Red Iron Crown**"},{"CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2015-03-25T16:05:30Z","Content":"Thank you for your reply. I made my submission a couple months ago then I did another one. Since no one from Squad ever replied to me I was wondering.\n\nSorry for making the thread in the general ksp, did not know were to put this.\n\nFly safe."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-03-25T16:09:17Z","Content":"Kar, it shouldn\u0027t take months to get a response, sounds like something got mishandled. Can you drop an email to [\\[email protected\\]](/cdn-cgi/l/email-protection#af8a98edc0dfdbc6c0c18a98eb) with your details? That should help get you sorted out.\n\nNo worries about the misplacement, easily fixed. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Kar","CreatedById":122714,"CreatedDateTime":"2015-03-26T13:42:08Z","Content":"\u003E \n\u003E Affiliates system? What\u0027s that?\n\nEver heard of Amazon Associates program?\n\nIf you own a website or you do youtube videos or publish content on a blog, you can monetize your content by providing a special link that will generate income for you. \n\nBeen an Affiliate for example, of KSP, you can make video reviews, post blog reviews, video tutorials, well, its all about your own creativity. You then provide a special link where people click to buy the game, when they do that, if they buy the game, you get a small percentage of that transaction.\n\n@ \n\n Red Iron Crown \n\nThank you for the link, I already sent a email."}]}