{"TopicId":123617,"ForumId":46,"TopicTitle":"How to edit a blog post?","CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-23T15:27:39Z","PageNum":1,"Articles":[{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-23T15:27:39Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E(This is about the KSP forum rather than gameplay itself, but didn\u0027t see a different forum for questions like this.)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHow do I edit a blog post in the KSP forums? (Here\u0027s \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/blogs/128986-Snark\u0022 rel=\u0022external nofollow\u0022\u003Emy blog\u003C/a\u003E.)\u003C/p\u003E\u003Cp\u003ESurely I must be able to, right? After all, if I make a \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eforum\u003C/span\u003E\u003C/em\u003E post, I can come back to it later and edit (there\u0027s an \u0022Edit Post\u0022 button under it). But darned if I can figure out how to edit my \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eblog entry\u003C/span\u003E\u003C/em\u003E, after I\u0027ve posted it. Is it graven in stone the moment I push the \u0022submit\u0022 button?\u003C/p\u003E\u003Cp\u003E(Perhaps this is a dumb question and the answer is obvious, but I\u0027ve been staring and staring at the UI and can\u0027t seem to find a way to do this anywhere. It will let me post a \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ecomment\u003C/span\u003E\u003C/em\u003E on my blog post. It will even let me report my own blog post as inappropriate content. But I can\u0027t figure out how to edit the blog post itself.)\u003C/p\u003E\u003Cp\u003EOr if (against all sanity and reason) for some reason it\u0027s not actually possible to edit a blog post: am I using the wrong feature? I\u0027d like to have a place where I can write a persistent entry, that\u0027s tied to me, that\u0027s not lost in the list of N-hundred-forum-posts, where I can put useful information that I may want to link people to. I assumed that \u0022blog entry\u0022 was the right place to do that. Any such repository of posts needs to have the ability to edit the posts, in order for it to be useful. If \u0022blog post\u0022 isn\u0027t the right place to do that, what should I do?\u003C/p\u003E\u003Cp\u003EAny advice appreciated.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-10-23T18:17:20Z","Content":"\n\u003Cp\u003EClick the little pencil icon to the right of the title.\u003C/p\u003E\u003Cp\u003E(Moved to the Kerbal Network)\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-23T23:01:17Z","Content":"\n\u003Cp\u003EExcellent, thank you!\u003C/p\u003E\n"}]}