{"TopicId":146076,"ForumId":46,"TopicTitle":"Where to post crash reports?","CreatedByName":"Jambalaya","CreatedById":167809,"CreatedDateTime":"2016-08-17T19:34:53Z","PageNum":1,"Articles":[{"CreatedByName":"Jambalaya","CreatedById":167809,"CreatedDateTime":"2016-08-17T19:34:53Z","Content":"\n\u003Cp\u003E\nHi everyone. \n\u003C/p\u003E\n\u003Cp\u003E\nThis question has been asked like 4 years ago, but that was still in early Alpha. I wanted to ask whether (Steam) KSP sends crash reports automatically, or if they have to be send manually. \n\u003C/p\u003E\n\u003Cp\u003E\nFor a few days now (on unmodded career), Kerbal starts crashing, usually during maneuvers (or take-off). Once a crash happened, KSP will run for maybe 30mins to 1 hour before crashing again, only a restart stops chain of crashes. This has now happened repeatedly sadly. \n\u003C/p\u003E\n\u003Cp\u003E\nSoooo. what next?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-17T19:35:31Z\u0022 title=\u002208/17/2016 07:35  PM\u0022 data-short=\u00227 yr\u0022\u003EAugust 17, 2016\u003C/time\u003E by Jambalaya\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-08-18T15:54:37Z","Content":"\n\u003Cp\u003E\nWelcome to the forums!\n\u003C/p\u003E\n\u003Cp\u003E\nMoving to Kerbal Network, since this is a discussion about the infrastructure around playing the game, rather than about the game itself.\n\u003C/p\u003E\n\u003Cp\u003E\nIn general, if you have a problem with the game, and you\u0027re running un-modded, then a good place to post is in the relevant tech support forum:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/forum/69-technical-support-pc-unmodded-installs/\u0022 rel=\u0022\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/forum/69-technical-support-pc-unmodded-installs/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIf you have a consistently reproducible problem, and you\u0027re pretty sure it\u0027s a bug in the game that needs fixing, and you have enough information that someone who wanted to fix it would have a reasonable way of reproducing the problem, then you can take it to the next level and \u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/projects/ksp\u0022 rel=\u0022external nofollow\u0022\u003Efile a bug report\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n(Or you can do both, in which case it may be helpful to include a link to the forum post in your bug report, and vice versa.  The former does a better job of leveraging the KSP community, the latter does a better job of leveraging Squad.)\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the actual crash reports:  as far as I know, nothing happens with them automatically.  They may or may not be useful, depending on how reproducible the problem is and what information\u0027s in the report.  Case-by-case.\n\u003C/p\u003E\n"}]}