{"TopicId":174195,"ForumId":46,"TopicTitle":"Changes for Cunjo Carl","CreatedByName":"Cunjo Carl","CreatedById":162109,"CreatedDateTime":"2018-04-22T23:45:30Z","PageNum":1,"Articles":[{"CreatedByName":"Cunjo Carl","CreatedById":162109,"CreatedDateTime":"2018-04-22T23:45:30Z","Content":"\n\u003Cp\u003E\nThis is hard to write, but it\u0027s something I have to say. I\u0027d rather not just disappear forever. I\u0027ve been fighting a wasting disease for several months now, and it\u0027s starting to get really very tough. I\u0027ll spare the details, but suffice to say that no one knows what it is, so no one really knows what\u0027s going to happen. If you plot a line though, it\u0027s about time for me to get my affairs in order.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst of all, thanks to everyone here at the forums! I can\u0027t imagine a more worth while place to have spent my fun time over the last couple years. I took a long break to teach my friends and students how to program, but I was destined to return. Too bad my return was so short, but well, I\u0027m thankful for what time I have had.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s not really a big deal if not, but I was hoping some folks might become the hosts for a few of my old challenges. They\u0027re mostly pretty musty, but if for some reason they do get a resurgence, it\u0027d be nice for someone to be there for it. Go ahead and just toss a quick post in the threads themselves (or make a reboot) if any sound like they\u0027ll be a good match for you: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/137229-realtime-career-mode-speedrun/\u0022 rel=\u0022\u0022\u003EReal Time Career Mode Speedrun\u003C/a\u003E , \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/156333-6-minutes-to-critical/\u0022 rel=\u0022\u0022\u003E6 Minutes to Critical\u003C/a\u003E , \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/140223-spin-to-win-the-momentum-tether-challenge/\u0022 rel=\u0022\u0022\u003ESpin to win\u003C/a\u003E , \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/172546-the-wrecking-crew/\u0022 rel=\u0022\u0022\u003EThe Wrecking Crew\u003C/a\u003E  . Spin to win isn\u0027t a big deal because I believe it\u0027s already up for reboots in the heritage list, which works plenty fine. The wrecking crew is a DLC mission that should be self sufficient, but may need occasional maintenance if the DLC mission builder has significant changes. I\u0027ve noticed that my image host, postimage, has just gone belly up. I still have the old pictures, but not nearly enough energy to pick them from the piles and re-upload them piecemeal at the moment. Sorry in advance.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I can muster the capacity for it, I\u0027m going to put up some bounties on a few of the KSP speedruns. Bounties are pretty common in the speedrunning community as a way for people to kick off excitement for running a new title. They\u0027re just little cash prizes, mostly for the fun. Why? This sounds silly, but I may last a while longer, and I\u0027d really like to live vicariously. I hope nothing more than to have a bunch of KSP-greenhorn speedrunners come rushing in to the help forums for help with routing. For this though, I\u0027d need a proctor in the speedrunning community, who I may or may not find in time. We\u0027ll see!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m going to ask a mod to lock this thread, because well, it\u0027s a little intense for a forum, and I don\u0027t want people to feel obligated in answering. Thanks for reading \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E . I\u0027m going to make myself available by PM for a short time though, and with any luck will get to enjoy the forums as a lurker for a while still. If a miracle happens, I will be back. Thanks all for your thoughts of good health!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Cunjo Carl","CreatedById":162109,"CreatedDateTime":"2018-04-27T03:50:31Z","Content":"\n\u003Cp\u003E\nVery good news.\n\u003C/p\u003E\n\u003Cp\u003E\nLong story short, I was visited by an uninterrupted series of small miracles. Things turned around hard for me, and my survival odds are now very good. It\u0027s all a bit surreal, to be honest. I needed a half dozen things to happen, each of which had been non-forthcoming over the last months. Then, suddenly, over the last four days they all just clicked into place. I really can\u0027t describe how unlikely it all was. You\u0027d think I\u0027d be excited or something, but what I feel is a heavy relief that borderlines on sadness or shell shock. Those feelings will digest with time, I\u0027m patient.\n\u003C/p\u003E\n\u003Cp\u003E\nMy road to recovery will be long, and it\u0027s very possible I won\u0027t recover fully, but to be honest it\u0027s not a big deal. I had earmarked yesterday through early/mid march as \u0027last stand\u0027, and here I am getting to write to everyone while sipping a strawberry half-and-half milkshake and listening to the latest SC2 tourney. ... Things are very good.\n\u003C/p\u003E\n\u003Cp\u003E\nMy survivability isn\u0027t guaranteed, but it is now very likely. In the small but present possibility I do crash back down, I\u0027ll just mention it on my personal page. I\u0027m not a fan of grand standing (despite how often I grand stand, go figure!) and I feel a bit awkward now. I wasn\u0027t wrong, last week by the way. I just got very very lucky. I\u0027ll need a bit of time, but I will be back. I\u0027m looking forward to it. Thanks, all.\n\u003C/p\u003E\n"}]}