{"TopicId":61477,"ForumId":46,"TopicTitle":"Multiple releases of same mods on Spaceport","CreatedByName":"Nereid","CreatedById":68815,"CreatedDateTime":"2014-01-29T11:31:16Z","PageNum":1,"Articles":[{"CreatedByName":"Nereid","CreatedById":68815,"CreatedDateTime":"2014-01-29T11:31:16Z","Content":"\n\u003Cp\u003EThe last weeks I have noticed quite a few mods that were release multiple times on Spaceport. After releasing my own mod I do understand now, how this could happen: The upload of mods on Spaceport is a bit... well... quirky. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E And its seems that it\u0027s not possible to delete released mods (the delete option won\u0027t work for me).\u003C/p\u003E\u003Cp\u003EBut: It\u0027s very annoying for the user to browse to twenty or more releases of the same mod. So please modder: make older uploads that are not the current one private, so they are not visible to others anymore. And for newbies I strongly recommend to test the upload with a private mod first before releasing a public one.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T11:41:29Z\u0022 title=\u002201/29/2014 11:41  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by Nereid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aphox","CreatedById":32691,"CreatedDateTime":"2014-01-29T16:21:38Z","Content":"\n\u003Cp\u003EThe thing about how messy Spaceport is, is that only a few of us have the authority to delete anything on it. The way it is now, it would be impractical for us to keep up with cleaning it, but yes, modders could help the situation by paying attention to what they\u0027ve already uploaded. Generally, if you need to find a mod that\u0027s on Spaceport, chances are there\u0027s a forum thread for it.\u003C/p\u003E\n"},{"CreatedByName":"Nereid","CreatedById":68815,"CreatedDateTime":"2014-01-29T22:05:56Z","Content":"\n\u003Cp\u003EWell, they could make there outdated uploads private at least. It\u0027s really no rocket science. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DailyFrankPeter","CreatedById":101850,"CreatedDateTime":"2014-02-07T09:32:20Z","Content":"\n\u003Cp\u003EHey, I\u0027m guilty of multiple uploads myself.. but you know... the devs don\u0027t have to \u0027keep up with cleaning\u0027. Just fix the upload form, if they can, to not create entries despite saying \u0027error\u0027.\u003C/p\u003E\n"},{"CreatedByName":"KandoKris","CreatedById":103873,"CreatedDateTime":"2014-02-23T02:08:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E uploads private at least. It\u0027s really no rocket science\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know, just today went through 4 pages for 3 craft that were posted a dozen times each !... \u003C/p\u003E\u003Cp\u003EIs is possible to add some text to the upload screen maybe under \u0022Please be sure to fill out all of the fields so we can process your Add On correctly.\u0022\u003C/p\u003E\u003Cp\u003ESomething like ; If you experience an error please refresh your add-on menu you, may only need to update your add-on rather then create it all over again.\u003C/p\u003E\u003Cp\u003Eor ;\u003C/p\u003E\u003Cp\u003E due to the spaceports unfinished nature please be aware that add-on\u0027s that display error messages when uploading but don\u0027t highlight incomplete entry fields may not have a real error so refresh before re-submitting.\u003C/p\u003E\u003Cp\u003EOr better still If you find your self adding the same thing over and over please change all but 1 to private \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Eas the spaceport delete button is mostly for show and doesn\u0027t really work 100%\u003C/strong\u003E\u003C/span\u003E !!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T02:17:42Z\u0022 title=\u002202/23/2014 02:17  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by KandoKris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"stupid_chris","CreatedById":62017,"CreatedDateTime":"2014-02-23T03:02:15Z","Content":"\n\u003Cp\u003EI usually go around and clean it once in a while. But yes a lot of things are borken on the spaceport. The uploading is one of them.\u003C/p\u003E\n"},{"CreatedByName":"kotysoft","CreatedById":105380,"CreatedDateTime":"2014-03-19T23:17:54Z","Content":"\n\u003Cp\u003EMultiple uploads caused by broken upload page. It always says \u0022ERROR\u0022 when you push SUBMIT, but your mod are already been submitted.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-04-10T16:27:27Z","Content":"\n\u003Cp\u003EWasn\u0027t there a spaceport 2 in the works?\u003C/p\u003E\n"},{"CreatedByName":"FEichinger","CreatedById":58255,"CreatedDateTime":"2014-04-10T17:09:43Z","Content":"\n\u003Cp\u003ESpaceport 2 was N3X15\u0027s work. Since he left, it\u0027s more or less in limbo in a variety of ways.\u003C/p\u003E\n"}]}