{"TopicId":61999,"ForumId":46,"TopicTitle":"The ability to spoiler (hide) images and non essential information in your posts.","CreatedByName":"Torraqe","CreatedById":102011,"CreatedDateTime":"2014-02-03T00:47:38Z","PageNum":1,"Articles":[{"CreatedByName":"Torraqe","CreatedById":102011,"CreatedDateTime":"2014-02-03T00:47:38Z","Content":"\n\u003Cp\u003ENot sure if this have been suggested before, but a spoiler tag would be really useful.\u003C/p\u003E\u003Cp\u003EI have seen this on numerous forums, and it\u0027s just basically a hide function, where you can put stuff like large images into it, so only those people has to load to pictures or long text who want to see or read them.\u003C/p\u003E\u003Cp\u003EBasically:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022-image-\u0022 alt=\u0022-image-\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"FEichinger","CreatedById":58255,"CreatedDateTime":"2014-02-03T01:07:22Z","Content":"\n\u003Cp\u003EWe used to have it. It proved to be a security leak. It has since been disabled.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-02-03T01:51:44Z","Content":"\n\u003Cp\u003EI wonder if we could find a version to re-add that \u003Cem\u003Edoesn\u0027t \u003C/em\u003Ecause a security leak... I\u0027ll think on it.\u003C/p\u003E\n"},{"CreatedByName":"Torraqe","CreatedById":102011,"CreatedDateTime":"2014-02-03T02:04:26Z","Content":"\n\u003Cp\u003EWhat kind of security leak came from it? Spam?\u003C/p\u003E\u003Cp\u003EIf so then, there could be a simple rule, that only those who have been on the forum for more than a month can use it (spammers obviously wont last that long).\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-02-03T03:14:08Z","Content":"\n\u003Cp\u003EWell, the format for the spoiler tag used to be something like \u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003ECONTENT\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E. Where the title could go, I believe there was a certain way to insert code directly into the forum\u0027s PHP and have it run that without checking it first. It\u0027s not something that can be protected by making it only available to certain users, really. Someone proficient in PHP coding could patch the forum software to not run any code inserted that way, but unfortunately it wasn\u0027t deemed high enough of a priority to be properly fixed, and the tag was simply disabled.\u003C/p\u003E\n"},{"CreatedByName":"Torraqe","CreatedById":102011,"CreatedDateTime":"2014-02-03T16:52:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003EWell, the format for the spoiler tag used to be something like \u003C/div\u003E\u003Cblockquote\u003E\u003Cdiv\u003ECONTENT\u003C/div\u003E\u003C/blockquote\u003E\u003Cdiv\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStrange, the forums I have been on, never used title, only \u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E, you couldn\u0027t even put a title there even if you wanted to.\u003C/p\u003E\u003Cp\u003EI know a very helpful community that never had this problem, should I ask them for specifics on how they avoided this kind of attack?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-02-03T16:58:21Z","Content":"\n\u003Cp\u003EYou can if you want. That there is actually just my best guess -- I don\u0027t actually know for sure if that was the primary issue with the tag. If it was, a spoiler tag could conceivably be created without a title, from what I\u0027ve read up on how spoiler tags are usually implemented in vBulletin (it\u0027s not a stock-standard feature at all).\u003C/p\u003E\n"}]}