{"TopicId":89558,"ForumId":46,"TopicTitle":"Badges!?! We don\u0026#039;t need no crappy badges.","CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2014-11-06T07:44:28Z","PageNum":1,"Articles":[{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2014-11-06T07:44:28Z","Content":"\n\u003Cp\u003EThinking of listing the mods as a group of acronyms in my siggy. Maybe mod icons would look great instead. I started to build a crappy \u003Ca href=\u0022http://imgur.com/UtJX5xl\u0022 rel=\u0022external nofollow\u0022\u003Egroup\u003C/a\u003E of them and found out some mods did not have any icons. \u003C/p\u003E\u003Cp\u003EMod icons could also be used in the Mod Library and other websites. The Modders should also be part of the decision on the content to keep it uniform. \u003C/p\u003E\u003Cp\u003ENow how do we motivate the modder to make the icon which could be used in easily recognizing the mod to everyone?\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-11-06T09:11:55Z","Content":"\n\u003Cp\u003EAsk them. I sincerely doubt trying to manipulate them into doing something for you will end well. Just ask.\u003C/p\u003E\n"},{"CreatedByName":"Moesly_Armlis","CreatedById":112247,"CreatedDateTime":"2014-11-09T21:34:56Z","Content":"\n\u003Cp\u003EGreater than two thirds of modders use an in game mod icon. For mods that do not require an in game menu should still have an outlet to display their mod icon. Forward thinking because all mods will have some type of icon that enable universal recognition. By setting a standard sooner here in the forum then at least it is tidier work in the long run. Just adding my ideas to this mix and not looking for personal gain.\u003C/p\u003E\u003Cp\u003EManipulate is too harsh. Encourage.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-11-10T01:30:07Z","Content":"\n\u003Cp\u003EIf they already have an icon, then just contact them and ask if you can use it for this purpose.\u003C/p\u003E\u003Cp\u003EThey probably won\u0027t mind.\u003C/p\u003E\n"}]}