{"TopicId":92105,"ForumId":46,"TopicTitle":"Transfer purchase to steam?","CreatedByName":"datdenkikniet","CreatedById":85114,"CreatedDateTime":"2014-12-06T17:29:03Z","PageNum":1,"Articles":[{"CreatedByName":"datdenkikniet","CreatedById":85114,"CreatedDateTime":"2014-12-06T17:29:03Z","Content":"\n\u003Cp\u003ESo, I bought KSP on the site quite some time ago, and now I noticed it\u0027s on steam. Is there any way to \u0022transfer\u0022 it to my steam account?\u003C/p\u003E\u003Cp\u003E-Jona\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-06T17:49:03Z\u0022 title=\u002212/06/2014 05:49  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 6, 2014\u003C/time\u003E by datdenkikniet\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Waterlimon","CreatedById":16829,"CreatedDateTime":"2014-12-06T17:51:14Z","Content":"\n\u003Cp\u003EIf you bought it before some specific date, you could transfer it. If you bought it later, you cant. The info is on the ksp site (the FAQ section or whatever they decided to name it).\u003C/p\u003E\u003Cp\u003EThe date was sometime in 2013 so if you bought it this year dont bother.\u003C/p\u003E\n"},{"CreatedByName":"xub313","CreatedById":57408,"CreatedDateTime":"2014-12-06T17:55:03Z","Content":"\n\u003Cp\u003EIf you bought it before the steam version was available you\u0027ll be able to switch. Log in to the KSP store then go to My Account. There should be a transfer option right next to the download button.\u003C/p\u003E\n"},{"CreatedByName":"datdenkikniet","CreatedById":85114,"CreatedDateTime":"2014-12-06T17:58:10Z","Content":"\n\u003Cp\u003Ethanks guys!\u003C/p\u003E\u003Cp\u003Eedit: can\u0027t find that damn button.....\u003C/p\u003E\u003Cp\u003Ewaitt...... \u003C/p\u003E\u003Cp\u003Edammit, bought it when it was already on steam (for 5 months...)\u003C/p\u003E\u003Cp\u003Ewonder why they don\u0027t do that :\u0026lt;\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-06T18:06:12Z\u0022 title=\u002212/06/2014 06:06  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 6, 2014\u003C/time\u003E by datdenkikniet\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-12-06T18:37:08Z","Content":"\n\u003Cp\u003EBecause Steam can\u0027t make any money out of providing digital download support for game licenses they didn\u0027t sell. It\u0027s a bit like the deals car companies do when they collaborate to develop the same car but sell it under two different badges with two different names - you still can\u0027t take your Ford to a VW garage and expect them to carry out repairs under the Ford warranty, even if they sell the exact same car but call it something else. A good old UK example was the Ford Galaxy/VW Sharan/Seat Alhambra people carrier.\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t matter who actually owns the intellectual property of the game, it matters who you bought your copy from.\u003C/p\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2014-12-06T19:08:27Z","Content":"\n\u003Cp\u003Ethere is no notable difference between the Steam version of the game and the ordinary version purchased from kerbalspaceprogram.com. The only thing I found was the screenshot key is not what is listed in the wiki.\u003C/p\u003E\u003Cp\u003EIf you want to launch it through Steam, you can add your current install as \u0022Add a non-Steam game\u0022 and use Steam to launch it. That\u0027s how I access the 64-bit version when I want to try it. You won\u0027t have news and links associated with it, but that\u0027s pretty minor, especially if you get most of your fix from the forums. It won\u0027t have some of the meta-game functions available either. If you \u003Cem\u003Edo\u003C/em\u003E have a Steam copy and want to launch it independent of Steam, just make a shortcut to the ordinary launcher provided in the Steam/steamapps/common/Kerbal Space Program folder. It even has updater functionality. It makes no difference to the game.\u003C/p\u003E\n"},{"CreatedByName":"godefroi","CreatedById":101728,"CreatedDateTime":"2014-12-06T19:17:30Z","Content":"\n\u003Cp\u003EThere\u0027s no difference whatsoever. You can run your steam version without steam anytime you like. The only difference is that steam has more download bandwidth when updates come out...\u003C/p\u003E\n"},{"CreatedByName":"datdenkikniet","CreatedById":85114,"CreatedDateTime":"2014-12-06T19:53:13Z","Content":"\n\u003Cp\u003EI know there is no difference, I\u0027ve come that far. \u003C/p\u003E\u003Cp\u003EI just like having it in my steam library (feels better for some reason)\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-12-06T20:15:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022datdenkikniet\u0022 data-cite=\u0022datdenkikniet\u0022\u003E\u003Cdiv\u003EI know there is no difference, I\u0027ve come that far. \u003Cp\u003EI just like having it in my steam library (feels better for some reason)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust add it as a non-Steam game and it will show up and run just like you\u0027d bought it through steam. The only difference is it cant be updated through steam(have to do it the way you do now) and it wont link to the store page and news ticker like steam games do. You can still launch it from your library and get the steam overlay however.\u003C/p\u003E\n"}]}