{"TopicId":94558,"ForumId":46,"TopicTitle":"Could the character limit for signatures be increased?","CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-26T06:57:34Z","PageNum":1,"Articles":[{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-26T06:57:34Z","Content":"\n\u003Cp\u003EEither globally or per user?\u003C/p\u003E\u003Cp\u003EI like having a whole bunch of links mostly mod related in my signature for the benefit of others, and I keep having to compromise.\u003C/p\u003E\u003Cp\u003EIt\u0027s 1000 right now. Please increase it to 2000 at least. There\u0027s no harm is there? An overwhelming majority of users don\u0027t even bother reaching the limit. It\u0027s not really necessary.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-29T13:45:44Z","Content":"\n\u003Cp\u003ENot sure if you\u0027re using it already, but if they are forum links you can shorten the character count considerably by using the [noparse][thread] tag. This:\u003C/p\u003E\u003Cp\u003E[thread=104899]This thread.[/thread][/noparse]\u003C/p\u003E\u003Cp\u003Egives this:\u003C/p\u003E\u003Cp\u003E[thread=104899]This thread.[/thread]\u003C/p\u003E\u003Cp\u003ENot exactly a solution, but can help make the limit less painful.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-12-29T13:53:13Z","Content":"\n\u003Cp\u003ESimilarly, if you wish to link to a specific post, you can shorten it in the same fashion, although you\u0027ll need to be a little more careful about which number you take from the original link to put in th BBCode.\u003C/p\u003E\u003Cp\u003EAs an example, one of the links in your signature is:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/99521?p=[B]1567918[/B]\u0026amp;viewfull=1#post1567918\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve bolded the section you need to use for the post BBCode; it\u0027s quite similar to the thread BBCode:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E[noparse][post=1567918]Link text here[/post][/noparse]\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWhich yields: Link text here\u003C/p\u003E\u003Cp\u003EAs to actually increasing the limit, it\u0027s something only our administrators can decide and/or put into effect. They\u0027re all on brief Christmas leave, though, so it may be a couple more days until one of them drops by with an answer.\u003C/p\u003E\n"},{"CreatedByName":"CaptainKipard","CreatedById":70516,"CreatedDateTime":"2014-12-29T14:30:08Z","Content":"\n\u003Cp\u003EThanks I think those will do for now.\u003C/p\u003E\n"}]}