{"TopicId":97801,"ForumId":46,"TopicTitle":"Please move thread back to General Discussion","CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2015-01-25T20:09:45Z","PageNum":1,"Articles":[{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2015-01-25T20:09:45Z","Content":"\n\u003Cp\u003EThis thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108507-A-Magic-Carpet-Ride\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/108507-A-Magic-Carpet-Ride\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eneeds moved back to General Discussion, as the point of it is to open discussion in general to ask what kind of crafts should the default Gold 1.0 KSP roll out with - using my shuttle as an example a user-submitted craft for such purpose. It does not belong in Spacecraft Exchange as I already have a formal thread dedicated there to the STS-1 development: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108219-STS-1-Space-Shuttle-%28NASA-Replica-Easy-to-Load-Fly%29-Full-O-Y-Tanks-to-Orbit-VIDEO-CRAFT\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/108219-STS-1-Space-Shuttle-%28NASA-Replica-Easy-to-Load-Fly%29-Full-O-Y-Tanks-to-Orbit-VIDEO-CRAFT\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECan you please move \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108507-A-Magic-Carpet-Ride\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/108507-A-Magic-Carpet-Ride\u003C/a\u003E back to General Discussion for the General Discussion feedback on the topic of what crafts should be released for KSP 1.0, namely should Squad consider accepting user-submitted crafts for this purpose?\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-01-25T20:23:17Z","Content":"\n\u003Cp\u003EIf folks are sharing their ship designs, whatever the purpose, Spacecraft Exchange is the right place for the thread. If the thread is intended to be a discussion of including player ships in stock, it should have been posted in Suggestions. But since you posted a ship, others would want to post theirs as well, so it\u0027s going to end up in Exchange either way.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-25T20:26:43Z\u0022 title=\u002201/25/2015 08:26  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 25, 2015\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"inigma","CreatedById":69310,"CreatedDateTime":"2015-01-25T21:07:03Z","Content":"\n\u003Cp\u003EThis thread: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/108507-A-Magic-Carpet-Ride-%28Should-Squad-Accept-Comunity-Submitted-Crafts-for-KSP-1-0-%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/108507-A-Magic-Carpet-Ride-%28Should-Squad-Accept-Comunity-Submitted-Crafts-for-KSP-1-0-%29\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI want to open up discussion about the Stock craft files, to talk of what crafts should be included, and whether or not Squad should ask for community input on what crafts should be provided in Stock KSP 1.0. This is not a Spacecraft Exchange topic, and though it may ask people to posting craft ideas for Stock KSP, I don\u0027t think this kind of discussion belongs in Spacecraft Exchange which is a subforum intended to share crafts not in the game - whereas this topic concerns crafts that are in the game.\u003C/p\u003E\u003Cp\u003EI did not provide a craft file in this thread. Please don\u0027t put it in Spacecraft Exchange as I want this discussion opened in General Discussion. If you still decide General Discussion is NOT the best place to seek community wide feedback on stock KSP 1.0 craft, then please delete the thread in its entirety from Spacecraft Exchange, as I feel it is not the best forum for it.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-01-25T22:38:19Z","Content":"\n\u003Cp\u003Einigma, it\u0027s a really good craft with a cool vid, I think it\u0027d be a disservice to the community to remove it, and a craft file would be welcome.\u003C/p\u003E\u003Cp\u003EYou do invite us to fly it, after all:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022inigma\u0022 data-cite=\u0022inigma\u0022\u003E\u003Cdiv\u003EYou are invited to fly her. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI see you added a lot of text about community crafts to the post, maybe in the hope that it\u0027d help add weight to the argument to have the thread moved, regardless, it\u0027s a craft thread and it\u0027s best placed in the Exchange, but I do strongly suggest you open a thread in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/59-Suggestions-and-Development-Discussion\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003ESuggestions and Development Discussion\u003C/strong\u003E\u003C/a\u003E regarding your community craft submission idea and link your excellent shuttle to that new thread.\u003C/p\u003E\u003Cp\u003EGeneral Discussion is not the place for either thread however \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}