{"TopicId":100857,"ForumId":38,"TopicTitle":"What\u0027s the worst that could happen?","CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-02-27T14:36:02Z","PageNum":5,"Articles":[{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-06-06T04:51:54Z","Content":"The universe says no. I pitch a baseball at 90% of the speed of light. What\u0027s the worst that can happen?"},{"CreatedByName":"ChrisSpace","CreatedById":140622,"CreatedDateTime":"2015-06-06T10:03:24Z","Content":"The city gets Nuked. Well, not actually nuked, but it looks pretty much the same.\n\nI support the creation of Liberland, WTWTCH?"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2015-06-06T10:41:58Z","Content":"nukes\n\nI die"},{"CreatedByName":"Astrofox","CreatedById":135785,"CreatedDateTime":"2015-06-09T21:13:00Z","Content":"People will still think that you are still on the forums, but you are dead and your family mourns over you.\n\nI would actually be sad, and many would be too, but you aren\u0027t gonna die soon!\n\nI know, quite morbid, but hey - it\u0027s life I suppose.\n\nI build an unmanned spacecraft in KSP - what\u0027s the worst that could possibly happen?!"},{"CreatedByName":"livefree75","CreatedById":111756,"CreatedDateTime":"2015-06-12T22:59:23Z","Content":"It deorbits itself over your city. You see the explosion and go blind for life.\n\nI point engine toward space. WCPGW?"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-06-13T09:10:07Z","Content":"The engine expels lethal gases which cause a launchpad fire. A ton of fire brigades and trucks come to extinguish the flames. Carbon dioxide from the engines speed up Global Warming.\n\nTons of years later, the engine is in the Smithsonian Air and Space Museum. The climate change has gone so far that it closes down as evacuations start for the global flooding that will commence. The engine is lost in the flood.\n\nThanks. You just destroyed a legendary museum relic.\n\nI start building a KSP station - What\u0027s the worst that can happen?"},{"CreatedByName":"Astrofox","CreatedById":135785,"CreatedDateTime":"2015-06-14T00:53:34Z","Content":"It either collides with a re-fueling vessel or it de-orbits over the KSC and destroys every building with the remaining debris.\n\nI use WTWTCH instead of typing out What\u0027s the worst that could happen: What\u0027s the worst that could happen?!"},{"CreatedByName":"Mr_Brain","CreatedById":33487,"CreatedDateTime":"2015-06-14T01:50:03Z","Content":"You finish writing your post sooner than you would usually have, which allows you to go to the store to buy some food sooner.\n\nHowever, because of this, you are hit by a car that would have missed you otherwise. Several of your organs are damaged severely, but you can survive if you can just receive a new organ. And you\u0027re in luck: Not far from you, because of a rare genetic anomaly, a person has two of the required organ and is willing to donate the second one.\n\nHowever, that particular person reads your posts on this forum and hates how you abbreviate things like \u0022What\u0027s the worst that could happen?\u0022. Therefore, you don\u0027t get the organ and die.\n\nLater, that person regrets not having donated the organ and suffers from extreme guilt and depression. That person\u0027s entire family suffer as well, the family breaks apart, and the children, who had the potential to fulfill their dreams, instead end up in a dead-end job they hate because of their ruined childhood.\n\nAll because you couldn\u0027t be bothered to spend a few more seconds typing.\n\nI think of excessively unlikely scenarios. What\u0027s the worst that could happen?"},{"CreatedByName":"ExplodingRocketShips","CreatedById":85454,"CreatedDateTime":"2015-06-17T07:06:03Z","Content":"You think of a reason why we don\u0027t exist and the world implodes because it\u0027s true.\n\nI sided with the Master (Fallout), what could go wrong?"},{"CreatedByName":"WinkAllKerb\u0026#039;\u0026#039;","CreatedById":78047,"CreatedDateTime":"2015-07-01T02:11:47Z","Content":"I wrote this as something that could go wrong.\n\n\u003E \n\u003E It\u0027s kinda like a plane crash @12 , 3 car crash (without being the driver), 2 suicidal attempt, a slip from a high icy roof, (a few more or less others things of that kind), and 30 euthanasia asking for myself later to docs/medics ...\n\u003E \n\u003E wtwtch ... leaving in a coutnry with missile over head every day, my own family under menace i tend to be most of the time careless about my own than other\u0027s family but time to time like everyone i still care a little about (...), total slavery and by a tier direct body suffering ... etc ... the longer i stay alive the longer i feel the what i see all around suffering boring and that\u0027s all .... make it short ... i m just t i r e d\n\u003E \n\u003E seriously last car crash there were all trembling when i was just thinking during the event and after \u0022bad luck not for this time ... again\u0022 ...\n\u003E \n\u003E \n\nnext, what could happen better ?\n\n**Edited \u003Ctime datetime=\u00222015-07-01T02:24:04Z\u0022 title=\u002207/01/2015 02:24  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by WinkAllKerb\u0027\u0027**"},{"CreatedByName":"TrainEngie","CreatedById":138031,"CreatedDateTime":"2015-07-01T04:57:55Z","Content":"You get full support from whoever you\u0027re getting support from.\n\nI couldn\u0027t decide between trains, anime girls, and rockets. What\u0027s the worst that could happen?"},{"CreatedByName":"Laucivol","CreatedById":179229,"CreatedDateTime":"2017-06-26T17:17:19Z","Content":"A random online person creates a forum account specifically to necro this thread (against his better judgement), as the Master from Fallout - newly merged with the Vault Dweller that sided with him proceeds to march his Super Mutant army to the locally appearing Guardian of Forever, and seeds the multiverse with Super Mutants.  Your choices are now: Super Mutants, Super Mutant anime \u0027girls\u0027 (they\u0027re androgynous, so... then again it\u0027s anime, so there\u0027s almost certainly something feature that as it is....) or Kerbals (the relationship between them and Super Mutants seems akin to Wookies/Ewoks, now that I think of it.) \n\nThe Kerbals, recognizing the Master\u0027s army as long lost kin of sorts, turn their rocket technology into weapons of war, and stream in endless hoards through the newly opened dimensional gateway, subduing and subjugating the rest of the multiverse until...\n\nI, uncharacteristically, necro a thread - what\u0027s the worst that could happen?"},{"CreatedByName":"StupidAndy","CreatedById":171175,"CreatedDateTime":"2017-06-26T19:40:56Z","Content":"the moderators, unhappy with your necroing decide to ban you for life from the forums. this does not please you that much, so you decide to just make another account, but the moderators don\u0027t like you doing that, and you are banned again. this goes on for about a year, until the moderators decide to go to your house and destroy your computer, phone, TV, and internet provider. without these luxuries of modern life, you are very depressed. you decide to go outside and ***\u003Cu\u003Emake new friends. \u003C/u\u003E***you end up meeting someone, and you have a happy life for the rest of your life. but you don\u0027t have internet, so you are extremely depressed. you find in the library a book without a title, it has the picture of a happy face on it, you decide to take up reading. you read the book and go insane, you end up destroying the earth in your insanity. but that doesn\u0027t suit you, you want more, you end up going from planet to planet, destroying every piece of matter, slowly but surely you make a dent in the milky way, then the local group, then the local cluster, until finally, you destroy the entire universe.\n\nI watch a hockey game, what\u0027s the worst that can happen?"},{"CreatedByName":"Laucivol","CreatedById":179229,"CreatedDateTime":"2017-06-26T23:57:52Z","Content":"(FREE! FREE AT LAST... but... poor Kerbals... I\u0027ll never see that wiley Jeb get smashed against the the ground when he decides to hop outta the capsule for an EVA before the shoots have fully deployed \u003E.\u003E) \n\nSpeaking of Jeb, as you\u0027re watching the game your team\u0027s center drives through a hole in the defense, and pushes the advantage - it looks as though he\u0027s going to solidly score ... except erstwhile Jeb falls through the ceiling at supersonic speed, shattering not only the stick, but with a resounding crack the ice below sending jagged shards of ice throughout the entire arena.  As the ice settles, surprisingly no one appears to have struck fatally - though Jeb\u0027s no where to be seen. \n\nSuddenly a loud roar fills the stadium - following the same path as the little green creature came in, and all is fire.  Let\u0027s hope mission control was playing with respawns - obviously didn\u0027t have invuln buildings set.\n\nI just got a pizza oven! What could *possibly* go wrong!?"},{"CreatedByName":"Joseph Kerman","CreatedById":176176,"CreatedDateTime":"2017-06-27T01:10:01Z","Content":"I dunno... \n\nI rebuild an old KWWII jet from blueprints alone. WTWTCH?"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-06-27T06:02:18Z","Content":"First you have to draw these blueprints on a toilet paper with a burnt match."},{"CreatedByName":"0111narwhalz","CreatedById":110660,"CreatedDateTime":"2017-06-29T06:56:19Z","Content":"The matchstick snaps, tearing a hole through the last piece of toilet paper in existence. As you look at the shreds of paper held in your now-splinter-filled hand, you realize that you are cold and really have to take a dump...\n\nYou install a new graphics card."},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-06-29T07:44:11Z","Content":"... and suddenly realize that this is CGA/EGA graphics card with uncompatible connecter.\n\nBut you don\u0027t fall in despair. You take the cover from toilet cistern and using it as a hammer, after all install the new graphics card."},{"CreatedByName":"qzgy","CreatedById":160994,"CreatedDateTime":"2017-06-29T08:07:33Z","Content":"Error 404 - no situation found\n\nI have a notebook. What could possibly go wrong!"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-06-29T08:19:46Z","Content":"That new CGA/EGA graphics card... You\u0027ve installed it into this norebook.\n\nBut you are happily playing DOS games with 16 colors, all goes nice.\n\n**Edited \u003Ctime datetime=\u00222017-06-29T08:19:56Z\u0022 title=\u002206/29/2017 08:19  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 29, 2017\u003C/time\u003E by kerbiloid**"},{"CreatedByName":"Joseph Kerman","CreatedById":176176,"CreatedDateTime":"2017-06-29T14:19:40Z","Content":"I make a KSP mod. Wurst dat cud happenn?"},{"CreatedByName":"spacebrick3","CreatedById":158990,"CreatedDateTime":"2017-06-30T06:13:30Z","Content":"The mod becomes so popular that everywhere people call for it to become part of the base game. Take-Two notices this, and decides (for some reason) to shut down modding. Riots fill the streets, and KSP goes down in flames.\n\nI go to sleep. What\u0027s the worst that could happen?"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-06-30T06:34:44Z","Content":"You understand that you already were sleeping.\n\nYou wake up. It\u0027s a nice sunny morning. Can something be wrong?"},{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2017-07-01T02:20:08Z","Content":"You love the sun so much you stare at it and get blind.\n\nI\u0027m booting up my computer. Is it that simple?"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-07-01T06:02:40Z","Content":"You *Wanna Cry*.\n\nYou call a guru to repair your computer. What could go wrong?"}]}