{"TopicId":121688,"ForumId":38,"TopicTitle":"Make your own Conspiracy Theory!","CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2015-09-25T22:22:05Z","PageNum":1,"Articles":[{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2015-09-25T22:22:05Z","Content":"\n\u003Cp\u003EMake your own conspiracy theory! It can be based upon an actual one or not.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022example1\u0022 data-cite=\u0022example1\u0022\u003E\u003Cdiv\u003EThe Moon landings were faked, they actually happened on Mars.\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022example2\u0022 data-cite=\u0022example2\u0022\u003E\u003Cdiv\u003EMars randomly turned into Nibiru and will collide with the Earth on [insert random doomsday date here]!\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-09-25T22:23:48Z","Content":"\n\u003Cp\u003EJet fuel can\u0027t melt steel beams...\u003C/p\u003E\n"},{"CreatedByName":"wx7","CreatedById":151184,"CreatedDateTime":"2015-09-25T22:39:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gaarst\u0022 data-cite=\u0022Gaarst\u0022\u003E\u003Cdiv\u003EJet fuel can\u0027t melt steel beams...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESteel fuel can\u0027t melt jet beams.\u003C/p\u003E\n"},{"CreatedByName":"Bill Phil","CreatedById":127797,"CreatedDateTime":"2015-09-25T22:52:30Z","Content":"\n\u003Cp\u003EThe Earth is really a hologram.\u003C/p\u003E\n"},{"CreatedByName":"SpaceplaneAddict","CreatedById":149322,"CreatedDateTime":"2015-09-26T00:34:05Z","Content":"\n\u003Cp\u003EThe Sun is actually Kerbol in disguise.\u003C/p\u003E\n"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-09-26T00:37:51Z","Content":"\n\u003Cp\u003EDesignated meteorites are actually satellites designed to de-orbit themselves after a period of time, carrying terran samples and exposed to the vacuum of space.\u003C/p\u003E\u003Cp\u003EPlease don\u0027t take that seriously, or I will kindly ask you to not breath for 5 minutes.\u003C/p\u003E\n"},{"CreatedByName":"wx7","CreatedById":151184,"CreatedDateTime":"2015-09-26T00:43:20Z","Content":"\n\u003Cp\u003ERosetta didn\u0027t go to any comet.\u003C/p\u003E\u003Cp\u003EIt landed on Venus.\u003C/p\u003E\n"},{"CreatedByName":"vger","CreatedById":67603,"CreatedDateTime":"2015-09-26T00:47:47Z","Content":"\n\u003Cp\u003EHugh Hefner, inspired by Pavlovian conditioning, dressed Playboy girls in bunny suits to subliminally inject bestiality into an unsuspecting populace.\u003C/p\u003E\n"},{"CreatedByName":"TrainEngie","CreatedById":138031,"CreatedDateTime":"2015-09-26T01:53:45Z","Content":"\n\u003Cp\u003EIlluminati is run by Kerbals CONFIRMED\u003C/p\u003E\u003Cp\u003ENibiru is actually Minmus in disguise.\u003C/p\u003E\n"},{"CreatedByName":"Yukon0009","CreatedById":109376,"CreatedDateTime":"2015-09-26T01:58:32Z","Content":"\n\u003Cp\u003EWe live in the matrix\u003C/p\u003E\n"},{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-09-26T02:18:31Z","Content":"\n\u003Cp\u003EThe monoliths will eat jool, given the chance.\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2015-09-26T02:55:37Z","Content":"\n\u003Cp\u003EJet fuel can melt steel.\u003C/p\u003E\n"},{"CreatedByName":"Goodle...","CreatedById":93658,"CreatedDateTime":"2015-09-26T02:55:55Z","Content":"\n\u003Cp\u003Esomeone is rushing the number wars\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2015-09-26T03:03:28Z","Content":"\n\u003Cp\u003E1\u002B1=2. 2\u002B2=4. 2= the number of equations so far. 2\u002B4=6. 6/3 (number of equations before this)=3. Illuminati confirmed.\u003C/p\u003E\n"},{"CreatedByName":"Dark Junior","CreatedById":102999,"CreatedDateTime":"2015-09-26T03:06:10Z","Content":"\n\u003Cp\u003EThe monoltihs go on forever.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003Eand they\u0027re full of stars!\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"legoclone09","CreatedById":142607,"CreatedDateTime":"2015-09-26T03:22:17Z","Content":"\n\u003Cp\u003EGeorge W. Kerman passed K-12th grade.\u003C/p\u003E\n"},{"CreatedByName":"NuclearNut","CreatedById":143605,"CreatedDateTime":"2015-09-26T05:14:47Z","Content":"\n\u003Cp\u003EThe conspiracy theorists are really just nuclear powered blood sucking lizardpeople from the planet flax\u0027nar meant to distract us from the Illuminati masters who intend to use the alien space lasers from area 51 to activate HARPP thereby turning the chemtrails into zombification gas causing us all to be the perfect slaves for the reptilians!\u003C/p\u003E\n"},{"CreatedByName":"Flymetothemun","CreatedById":17689,"CreatedDateTime":"2015-09-26T06:39:21Z","Content":"\n\u003Cp\u003EKerbal Space Program is actually a government-alien conspiracy to train spacecraft builders and scientists. Just hear me out on this:\u003C/p\u003E\u003Cp\u003EJFK told everybody we would land on the moon in 10 years in \u002761. Apollo 11 landed on the moon in \u002769. It only took 8 years. This left 2 more years to go to the moon on the clock. In \u002771, the end of the time limit, Cigarette adverts were banned on American TV. Think about this, long things with fire and smoke coming out the end were banned. What does that sound like? This was the first action of the aliens.\u003C/p\u003E\u003Cp\u003EBut, you see, JFK was shot in \u002763, so as far as he knows we\u0027re still on Earth. But this has happened before. Assassinate the grand architect so that the corrupt overlords can take their place. It happened with Stalin killing Lenin, it happened with Brutus killing Caesar, and it happened with the second shooter on the grassy knoll killing JFK.\u003C/p\u003E\u003Cp\u003ESo, the long things with fire were banned and soon the plane with fire coming out the back and with a can full of fire attached to the underside came about. Those that are \u0022in the know\u0022 call it a \u0022Space Shuttle\u0022. The whole idea (that they tell us at least) was to reuse the shuttle. This is the second action of the aliens because how can you fit mind-control microbots onto a spacecraft if you don\u0027t know what you\u0027re working with? \u003C/p\u003E\u003Cp\u003ESo the mind control went on and on until 1994, when NASA decided to use the shuttle for RADAR mapping and NOAA used it for weather. This was the mind control actually working. The aliens needed to know what our planet looked like, they can\u0027t see it; they don\u0027t have eyes, so they need numbers so that they can hook their brains up to the mothership and have the mothership microwave the information into their brains. They also needed to know what conditions we would survive under, so that they could train us effectively.\u003C/p\u003E\u003Cp\u003E1994 was also the year of the OJ trial. This was the third tetris block to fall into place. They needed to see what we would do if someone we dearly loved was called into question. They didn\u0027t know we were actually primal beings covered in a veneer of philosophy and morals.\u003C/p\u003E\u003Cp\u003ESo, this happens and transpires, and in 2006 OJ makes a TV special. In 2006 Russia cut the natural gas flow to Ukraine over pricing concerns. This was because the aliens wanted to make sure the dirty russian red commies had enough fuel to get their little boomsticks up in the air. And this is where it all falls into place.\u003C/p\u003E\u003Cp\u003EFast forward to 2011: A Mexican working at an ad agency. He goes to his boss and says: I want to make a game. And so it happens. The mind control has shifted over the jet stream and landed on this little sheep\u0027s wool. Probably inspired by the Russian rockets (look at all the explosions), the game gets made and is filled with all kinds of indoctrinatory things; It teaches you how to fly spacecraft. Not only this, it also teaches you how to build spacecraft. And it also teaches you how to do science in space and how to support the lives of LITTLE GREEN MEN. And so proves my point. \u003C/p\u003E\u003Cp\u003EThe aliens have trained us, indoctrinated us. We are all slaves of their machine. And if you buy my book, support my foundation, donate to my kickstarter for my death ray to kill aliens, like my facebook page, share my myspace link, spread this message to your friends and family, and sign my online petition, you can help stop this menace to the multiverse. And if you act within the next 15 minutes you get a free tote bag with a small nuclear device embedded in the lining; If you see an alien, just pull the red cord and the bag takes care of the rest. Don\u0027t worry, It\u0027s TSA \u003Cstrong\u003E\u003Cem\u003Eand\u003C/em\u003E\u003C/strong\u003E IAEA approved!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#d3d3d3;\u0022\u003EIf you think I actually believe any of this, you\u0027re pretty stupid.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mikki","CreatedById":137508,"CreatedDateTime":"2015-09-26T11:46:10Z","Content":"\n\u003Cp\u003ETime is counterpart of gravitation\u003C/p\u003E\n"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-09-26T13:45:29Z","Content":"\n\u003Cp\u003EThe Earth is flat\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-09-26T22:44:47Z","Content":"\n\u003Cp\u003EWe are being controlled by people on computer screens...WE are KSP. It\u0027s the illuminati!!!!!!! I have evidence!!!!!!!!!!!! Why don\u0027t you open your eyes!!!!!!!!!!!!\u003C/p\u003E\u003Cp\u003EBy the way, SpaceX is just a bunch of renderings.\u003C/p\u003E\u003Cp\u003EThey faked the New Horizons Pluto flyby. It\u0027s just sitting in a warehouse.\u003C/p\u003E\u003Cp\u003EKerbals do exist\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/131789-For-Your-Eyes-Only-TOP-SECRET%21?highlight=eyes\u0022 rel=\u0022external nofollow\u0022\u003E\u003Csup\u003E1\u003C/sup\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-09-27T01:14:31Z","Content":"\n\u003Cp\u003EThe great spaggeti monster created us all\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2015-09-27T01:27:06Z","Content":"\n\u003Cp\u003EThere is a hidden multiplayer feature built into KSP\u003C/p\u003E\n"},{"CreatedByName":"EdusacconBR","CreatedById":135047,"CreatedDateTime":"2015-09-27T02:53:10Z","Content":"\n\u003Cp\u003EKSP is a Simple Rockets copy!1!1!!11\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2015-09-27T03:45:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EdusacconBR\u0022 data-cite=\u0022EdusacconBR\u0022\u003E\u003Cdiv\u003EKSP is a Simple Rockets copy!1!1!!11\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eno KSP is a Space Agency copy!!!111!\u003C/p\u003E\n"}]}