{"TopicId":81435,"ForumId":38,"TopicTitle":"Naval Battle Club","CreatedByName":"astecarmyman","CreatedById":65422,"CreatedDateTime":"2014-08-11T17:47:57Z","PageNum":176,"Articles":[{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-13T21:43:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EI tested that setup just now on Kerbin, Alpha, and it seems kinda efficient, I clipped the docking port into the engine and the engine immediately explodes the docking port on engine startup, removing dead weight.\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EOkay, the as-of-now untested (I might get around to it tomorrow unless someone else tests it (dunno what I\u0027ll test it against)) Ramdasia I carrier is built, but since it\u0027s untested it may be changed. It\u0027s rather simple really, just a simple unmanned craft with a big opening at the front that holds a Plum Fighter, and multiple Ibiza Torpedoes.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/CR9b5\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/CR9b5\u003C/a\u003E image 1-4: Ramdasia I, image 5: Plum fighter, image 6: Ibiza Missile.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalx.com/SharkmanBriton/Ramdasia-I.craft\u0022 rel=\u0022external nofollow\u0022\u003Edownload Ramdasia I\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot bad, but it dies to ibeams , and well, dont even try getting whacked by a Tripedo-M or popper-H in that thing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-11-13T21:51:07Z","Content":"\n\u003Cp\u003EThe idea is that it generally stays outside of battle like a normal carrier, but if it absolutely REQUIRES to (for example as a last ditch effort to save a defeated fleet) it can run into battle, guns blazing, kinda like a glass cannon.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-14T01:28:35Z","Content":"\n\u003Cp\u003EHey Zekes, look what i dug out of my old archives when doing more armor research (since all my current designs are dead). Its your legendary super-drek, from a time and age when your ships dominated every bloody thing on the battlefield! Not that your recent models are bad, but the kenji and jiji are cannon fodder compared to this thing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/mJgxvPE.png\u0022 alt=\u0022mJgxvPE.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is sofar (aside from zamo\u0027s basil), one of the best armored ships around, even to this day!\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2015-11-14T01:39:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EHey Zekes, look what i dug out of my old archives when doing more armor research (since all my current designs are dead). Its your legendary super-drek, from a time and age when your ships dominated every bloody thing on the battlefield! Not that your recent models are bad, but the kenji and jiji are cannon fodder compared to this thing:\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/mJgxvPE.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/mJgxvPE.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is sofar (aside from zamo\u0027s basil), one of the best armored ships around, even to this day!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you! I know some people split it easily though, so I shelved it. But if it\u0027s that good still I\u0027ll give it thought to update.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-14T01:51:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zekes\u0022 data-cite=\u0022zekes\u0022\u003E\u003Cdiv\u003EThank you! I know some people split it easily though, so I shelved it. But if it\u0027s that good still I\u0027ll give it thought to update.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts not OP or anything (and i myself have weapons that can split it, but sofar only excessively heavy and or powerful ones can do it with any reliability. But from my experience, its WAY better then the kenji and jiji in terms of raw armor (although it might be a little less practical from a weight/part count perspective. Actually, the drek-30 (the ion one from way back) wasnt half bad either armor wise, able to take some popper-Hs here and there, so you might look into that hull as well. Its just my experience that the 12P thing is decently armored (and basically immune to anything thats a ibeam\u002Bhowever many sepatrons you desire. Aside from part count, its a very good ship that to this day is capable of taking major amounts of damage.\u003C/p\u003E\u003Cp\u003EIve basically given up 100% trying to defend against anything better then popper-H, since you just cannot do it with any reliability. My ships are all roughly using the popper-H as a standard of armor. I consider being able to take 2-3 hits with popper-H to be more then adequate, and well, ofc the usual heavy resilience to ibeam weapons too.\u003C/p\u003E\u003Cp\u003EAlso, the keni and jiji both share a MAJOR weakness, and that is with your fuel system. Just a friendly word of advice (which ive learned the hard way many times), is to one, NEVER EVER clip fuel tanks into the spine/structural elements, and 2, avoid clipping em with each other. these fuel tanks are the sole reason the Tripedo-M has over 90% kill rate on these two vessels. I know the biggest issue is volume, but if you can find a way to have fuel not clip (perhaps place some externally for extra range), itll be a much better ship (since the internals look pretty good in my opinion minus the terrible fuel layout that is a death sentence to the ships.\u003C/p\u003E\u003Cp\u003ESUCCESS!\u003C/p\u003E\u003Cp\u003EBy using a similar external layout to the drek-12P, i have managed to create a vessel that is lowish on parts, INCREDIBLY RESILIENT, and well, preliminary tests seem to look good! I have only split it a few times out of around 50 or so attempts! Like every ship, it can and will die to bad luck, but its so much harder to kill then older versions, albeit much heavier and shorter range (its the first AKS ship that i think might NEED droptanks to be viable).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-14T02:26:26Z\u0022 title=\u002211/14/2015 02:26  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 14, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-14T04:25:18Z","Content":"\n\u003Cp\u003EWell, my new ibeam armor is a partial success, but it isnt quite up to my standards \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/MGe5S\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ENot really happy with it, but it isnt too bad either. Had the thing only lost an entire section once or twice, id be very happy, but it seems to be too weak for now. Apparently, RT-5s are actually quite effective which is surprising, and vs the popper its killable from some angles, especially directly behind it (although that is expected due to the 3 nukes packed really close together). In one test a salvo of 6 long ibeam\u002B4seps managed to destroy the entire front (i havent been able to replicate this since but that doesnt mean it cant be done again.\u003C/p\u003E\u003Cp\u003ENot a bad ship, but its a little on the heavy side, has subpar range, and its just not quite resilient enough to justify the shortish range of approx 2200dV. Agility is as most of my craft, fairly good but nothing exceptional, and its firepower is great, provided i dont get whacked before attacking since the weapons, especially teh side mounted ones, are extremely prone to being shot off! In my opinion, the biggest issue is that its not quite resilient enough for its part count, so its just not as efficient as some other designs that seem to have broken entirely in 1.0.5.\u003C/p\u003E\u003Cp\u003EIm gonna try Zamo\u0027s idea of a single core part and build outside from there. Ive never really made that design, and perhaps ill have better luck with it then the more conventional girder and or ibeam core that is surrounded by armor/stuff. One thing that never hurts is to try completely new ideas, and sooner or later something will work for you!\u003C/p\u003E\n"},{"CreatedByName":"Sharkman Briton","CreatedById":148040,"CreatedDateTime":"2015-11-14T09:08:01Z","Content":"\n\u003Cp\u003EPanzer, how high ARE your standards?! XD\u003C/p\u003E\n"},{"CreatedByName":"Zamovinar","CreatedById":127282,"CreatedDateTime":"2015-11-14T12:45:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EThis is sofar (aside from zamo\u0027s basil), one of the best armored ships around, even to this day!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll take that as a compliment \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The only thing I need to do the BASIL is to lower the part count and make a more compact design. \u003C/p\u003E\u003Cp\u003EI used to fear that dreaded Drek silhouette, it still puts me on my toes whenever I see it.\u003C/p\u003E\n"},{"CreatedByName":"PineCone","CreatedById":151931,"CreatedDateTime":"2015-11-14T13:17:35Z","Content":"\n\u003Cp\u003ECan I join?\u003C/p\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-11-14T13:24:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PineCone\u0022 data-cite=\u0022PineCone\u0022\u003E\u003Cdiv\u003ECan I join?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure man, all are welcome.\u003C/p\u003E\n"},{"CreatedByName":"PineCone","CreatedById":151931,"CreatedDateTime":"2015-11-14T14:19:31Z","Content":"\n\u003Cp\u003EThis is my first submission to this thread, and I don\u0027t think it\u0027s very good, but I\u0027m submitting it anyway, since some of you might like it.\u003C/p\u003E\u003Cp\u003EPresenting: The \u003Cem\u003ESU-1\u003C/em\u003E Scout Probe.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/DImjG\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-14T14:21:54Z\u0022 title=\u002211/14/2015 02:21  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 14, 2015\u003C/time\u003E by PineCone\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-14T17:12:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sharkman Briton\u0022 data-cite=\u0022Sharkman Briton\u0022\u003E\u003Cdiv\u003EPanzer, how high ARE your standards?! XD\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy current standard testing procedure involves 3 distinct weapons, ones that the vast majority of vessels use, the ibeam\u002B4seps (which represents your generic nothing special ibeam weapon), the RT-5 with 2 structural panels on the front of it (it seems to be a very popular choice overall), and the popper-H or similar weapons (represents your medium grade guided weapon thats rather popular on here). I feel this encompases the most popular and generic weapon choices used by many players, and thus i use these 3 as a test procedure for my craft.\u003C/p\u003E\u003Cp\u003EFor a craft to truly pass AKS standards, it can not have any major section of its hull shot apart with a single hit. Idealy i would have it impossible to 1 shot with any of these weapons, but i understand there is a luck factor there allowing everything to have a very small 1 shot KO chance, so i added the 10% fudge factor to account for that (and so i wouldnt go insane when a ship gets 1 shotted every once in a rare while as its unavoidable). Also, the testing involves different ammo amounts per trial for different weapons. I only use a single popper to test it, since that weapon is usually not stored in excessive quantities on anything that doesnt want to become lag city (and thus i wouldnt actually fight against in actual battle). I use 2-4 RT-5s for testing, this particular test used only 2, but sometimes i use 4 of them, fired one at a time, which represents a fairly popular choice that isnt really carried in excessive amounts, but very often a player would use multiple of them in a single attack. The ibeams i chose to use 6 of (as most of my ships have 6 ibeam weapons on front), and well, thsi represents the firepower of many heavier fighters/bombers, and some weaker capitals, or well, the secondary weapons aboard even some full size ships.\u003C/p\u003E\u003Cp\u003EWhat i idealy (never really happens) want is my hull to be impossible to 1 shot kill with either 1 popper, 2 RT-5s, or 6 ibeams. Accounting for back luck, if i can have the craft survive 90% of the time (as in still useable according to the 1st page rules about what was alive/dead), id be very happy with it. Ofc i ignore stuff like engines being shot off all in one shot, since my ship doesnt have the part count, to defend them at all properly, and well, i am forced to use nukes due to their ISP values, so that means i can use smaller engines that are actually protectable under normal circumstances.\u003C/p\u003E\u003Cp\u003EMaybee my standard are a little high, but this is what i would consider adequate for a SUPPORT SHIP (like the one i was testing was intended to be used for). For an actual direct COMBAT SHIP it would have to be capable of taking 4 times this much damage and survive 90% of the time reliably to pass AKS standards. The combat ship ofc im not even TRYING to build since it would mean going above my 200 part hull absolute cutoff (right now if hull goes above 200 parts ever i shelve it, or cut stuff off to get it below 200 parts), so yeah, i stick to purely making support ships in role.\u003C/p\u003E\u003Cp\u003EAlso, in other news, work on the zamo hull has failed. Apparently those style hulls require way too many parts to be practical, and its impossible to get very solid armor without going over 200 parts for the hull. Its a good design (and i might revisit it after U5), but it just doesnt work at all with lowish part counts!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-14T17:17:13Z\u0022 title=\u002211/14/2015 05:17  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 14, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zamovinar","CreatedById":127282,"CreatedDateTime":"2015-11-14T17:53:14Z","Content":"\n\u003Cp\u003EYour standards are way to high for a low part count ship, I\u0027m usually just happy to have a ship that could survive the first shot. Then it\u0027s all out firestorm from my ship towards the enemy ship. I\u0027ll just cross my fingers that it would survive until I can neutralize the enemy. It\u0027s not about winning, it\u0027s about enjoying the slugfest for me. Parts flying off a damaged ship is priceless.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-14T18:37:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zamovinar\u0022 data-cite=\u0022Zamovinar\u0022\u003E\u003Cdiv\u003EYour standards are way to high for a low part count ship, I\u0027m usually just happy to have a ship that could survive the first shot. Then it\u0027s all out firestorm from my ship towards the enemy ship. I\u0027ll just cross my fingers that it would survive until I can neutralize the enemy. It\u0027s not about winning, it\u0027s about enjoying the slugfest for me. Parts flying off a damaged ship is priceless.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EToo high? Well i had an amazing ship that WOULD pass this test before, but 1.0.5 killed it. Problem (at least with that one design) is that it used girders for the core, and those are (now that the stupid heating exhaust damnage exists), vulnerable to anything that clips in and is lucky enough to aim its thrust at those parts for even a split second. It actually still get over 80% survival rate from anything but rear hits (which will tear the back apart more often then mot since well, 3 clipped nukes are way to killable).\u003C/p\u003E\u003Cp\u003EIm actually continuing development of the same hull style, but now the A4 corvette uses a redesigned rear to help deal with the issues arising from nukes clipped into the bloody hull. Im not entirely unhappy with teh A3, but i guess it does have a very good survivability to part count ratio (hull is 150 parts, i also had a 130 part version which was a hair weaker but not too much weaker).\u003C/p\u003E\u003Cp\u003EOhh, and i found the fix to ibeam krakening out wobble problem. If you keep the radially attached parts below 4, it will never get whacked by the resonance kraken! This means i can use the short puny ibeams, and make a hull from those thingies without worrying about kraken since there are only 2 ibeams and a RTG touching the ibeam, the rest of the hull comes off from the 2 ibeams i attached to the main ibeam. This hull is also both flexible and strong, so it means the only way to tear it apart is through a very lucky phased shot to the central spine. Unlike many older models, this one is also not very prone to bending transfer, making a hit with a powerful weapon to the side very unlikely to do anything to the underlying hull. Then you get the passive befit of a reduced chance of anything with excessive sepatrons (say over 8) actyually phasing so that all those seps hit the core girder (ibeam is amaller and harder to aim at let alone hit).\u003C/p\u003E\u003Cp\u003EAnd why do you say my standards are too high? AKS ships need to be powerful or the 5-1 numerical advantage of B-Corp would wipe AKS out!\u003C/p\u003E\u003Cp\u003EIf you guys think the A3 has good armor for the part count, then i might release it and maybe even use it, but im still shooting for much better performance out of my warships!\u003C/p\u003E\u003Cp\u003EMore recent developments have created a tougher hull that is way resistant to the popper-H from behind (well it still gets engines shot off but you cant defend a nuke cluster). The culprit was determined to be ammunition storage, which was inadequate and created shrapnel clouds which would actually destroy the entire ship. New torpedoes are in the works that will be more lethal to enemies, and not act as makeshift shrapnel bombs when struck by enemy weapons!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/70PpD\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EHere is a 31 shot test run using the same exact weapon i tested the previous A3 with, this time each shot was done at a random angle of attack (so most attack vectors were tested). The best thing, is that there is no single angle that guarantees a killshot, and even if you do get a killshot, it seems that either the front or rear is left , meaning its not 100% useless. \u003C/p\u003E\u003Cp\u003EStats are the following:\u003C/p\u003E\u003Cp\u003EArmarment: 4 Tripedo-M or equivalent, 6 railguns or equivalent (forward firing)\u003C/p\u003E\u003Cp\u003EWeight: 70t (optimal), 85t (max fuel)\u003C/p\u003E\u003Cp\u003EdV: 3000 (optimal), 4350(max fuel)\u003C/p\u003E\u003Cp\u003EParts: 156 (hull), 260 (standard weapons load)\u003C/p\u003E\u003Cp\u003EOverall, it dies, just like my older model, but it has OVER an 80% chance to survive a high powered missile such as the popper-H in the first shot, and you need roughly 2-4 of them to reliably neutralize it, which i feel is adequate for a escort/support ship that was never really designed to take excessive fire from anything but very weak weapons like ant-torps, and oscar-48-7s torps, and its quite resilient to most railguns too. Im still not 100% happy with it, as ideally it would be immune to 1 shotting but i feel its better then the old one, and has alot more fuel capacity, internal space, and well everything else.\u003C/p\u003E\u003Cp\u003EAlso, its armor is insane if you can pick what angle enemy hits you at. It seems to be INCREDIBLY resilient from front/rear (not to mention hard to hit such a small profile), and it can broadside very effectively (despite having no weapons boradside). The top/bottom is also well armored, it just has issues (like every one of my ships) with stuff that comes in at an angle from above or below, but even then it is by no means guaranteed killshot.\u003C/p\u003E\u003Cp\u003EOnly thing i dont liek is that it uses a mod that lets me swap fuel types per fuel tank. Essentially runs on xenon tanks that have had their contents mod swapped to LF only. For me personally, this is not a cheat as the fuel tanks have the same exact fuel fraction as any other tank, but i guess some might consider this unfair. The reason i did this is cause there was not enough room to give it the amount of fuel i wanted withotu going clipping crazy and thus breaking the entire vessel. I might make a variant later though that has the regular LF tanks instead, provided i can figure a way to mount them without clipping.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-14T22:23:01Z\u0022 title=\u002211/14/2015 10:23  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 14, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Zamovinar","CreatedById":127282,"CreatedDateTime":"2015-11-15T04:34:10Z","Content":"\n\u003Cp\u003EThere is only one good use for clipping, and I\u0027m not going to say how to properly use it, for now I\u0027ll keep it a secret. It\u0027s just recently dawned on me, I have a revolutionary new idea for my ship. I\u0027m going to try and convince my parents to give me additional money for me to buy a new laptop. Just be ready for me, maybe it will take 1-2 months from now but until then I can\u0027t make any new ships as my rig can\u0027t run KSP 1.0.4 properly, but I already have 1.0.5 ready for installment \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo for now I\u0027m going to observe what happens here and take note of any new developments. Be wary of K.R.K.N. fleet.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-15T05:28:43Z","Content":"\n\u003Cp\u003EWell, i feel ive gotten the SK-CRV-A5 to the point im content with it. Given its still a support ship (and thus not intended to get shot at by most heavier ships), i think it gets 1 shotted rarely enough that its adequate for my needs. \u003C/p\u003E\u003Cp\u003EIm gonna take a break from competitive ship development and work some on my comic i started a while back, so its time to build more for fun warships, many of which are designed without super good protection since the faction or company that created the ship has limitations to tech and or cant use certain parts/building styles. Time to make more pirate vessels, in the good old fashioned macey dean style, fuel tank core, and some panels around it. Those arent actually all that bad against most of the weapons i use in my comic though, unless its AKS ones that is, all of which have some AP qualities.\u003C/p\u003E\u003Cp\u003ETime to also get working on ground vehicles, bunkers, and other emplacements for the upcoming 2nd battle of minmus, where AKS has to defend against their arch enemy, B-Corp.\u003C/p\u003E\u003Cp\u003EWhat do you guys think of the command center i made?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/V3iikxW.png\u0022 alt=\u0022V3iikxW.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-15T07:32:43Z\u0022 title=\u002211/15/2015 07:32  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 15, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlexanderTeaH","CreatedById":111209,"CreatedDateTime":"2015-11-15T15:25:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022panzer1b\u0022 data-cite=\u0022panzer1b\u0022\u003E\u003Cdiv\u003EWhat do you guys think of the command center i made?\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/V3iikxW.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/V3iikxW.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks pretty cool, reminds me of a time when I had a massive Minmus base back in ye old days of 0.16.\u003C/p\u003E\n"},{"CreatedByName":"Canberra Gaming","CreatedById":147308,"CreatedDateTime":"2015-11-15T21:54:56Z","Content":"\n\u003Cp\u003E\u003Cem\u003ECanberras\u0027 First operational orbital fleet, Canberra battlegroup De Gaulle, performing a salute to those that have fallen. Led by the CCS Paris which fired the symbolic shot, followed by the CCS Ardennes, and the CCS Calais.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ThRxlMR.png\u0022 alt=\u0022ThRxlMR.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZzWsgcd.png\u0022 alt=\u0022ZzWsgcd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe Orion Corvette is born.\u003C/em\u003E\u003C/p\u003E\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-11-15T21:57:26Z","Content":"\n\u003Cp\u003EWhat tonnage on those ships? I have a few apophis-class torpedo ships at 35 tons that would like to have a word with you. Or rather, their Theseus missiles would.\u003C/p\u003E\n"},{"CreatedByName":"Canberra Gaming","CreatedById":147308,"CreatedDateTime":"2015-11-15T22:18:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alphasus\u0022 data-cite=\u0022Alphasus\u0022\u003E\u003Cdiv\u003EWhat tonnage on those ships? I have a few apophis-class torpedo ships at 35 tons that would like to have a word with you. Or rather, their Theseus missiles would.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI made that post in honor of the 149 innocent French citizens that passed. Not to battle or advertise...\u003C/p\u003E\n"},{"CreatedByName":"Alphasus","CreatedById":147173,"CreatedDateTime":"2015-11-15T22:22:39Z","Content":"\n\u003Cp\u003EOh, I was confused. Sorry. The names didnt tip me off i guess.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-16T16:53:05Z","Content":"\nWell, now that ive started working on my comic again, im actually in need of ships, and i think ill start taking submissions people are willing to have used in my comic.\u003Cbr\u003E\n\u003Cbr\u003E\nI am currently looking for ships that will be used by B-Corp, as well as a few more pirate styled vessels. Since B-Corp doesnt really have any artistic or visual style, and many of their ships are sourced from the market or even stolen from enemies, their fleet is very varied, and they have almost everything from corvettes to heavy destroyers. Also, to be consistent with the universe, only the AKS Alliance has access to nuclear rockets, so any ships that are put on the global market should have LFO engines only. Some very good ships can use them, as small quantities of NTRs that have been scavenged from old battlefields or even outright stolen from the alliance have ended up on the black market for absurd prices, but in general, noone has access to large quantities of said engines, and thus most factions use LFO exclusively. Also, for weapons, i ask that you please refrain from attaching very powerful weapons to your ships that are designed to 1 shot other craft. Most of the battles i have involve multiple shots from multiple targets, and while the occasional 1 shot kill can happen, i kinda reserve those for dreadnoughts or some super powered vessels that it makes sense for a 1 shot kill to occur in terms of the story. I will accept any weapons, but if it is found to be overpowered in my eyes i will replace them with standard weapons used by the faction. Ohh, and along that thought, guided weapons are not extremely popular unless its AKS, so it is ideal if your ships have say the majority of the weapons be unguided and capable of firing directly at a target from closer ranges. Broadside mounted weapons are fine too (actually thatd make for some interesting scenarios), just make sure it is humanely possible to both stage and aim said weapons accurately without using the aim at target autoaim mode (its more fun and realistic when i do all combat 100% manually).\u003Cbr\u003E\n\u003Cbr\u003E\nA few more things, when making ships, each faction has a particular color scheme most of its ships use. AKS Alliance uses pure blue lighting, B-Corp uses orange (100% red, 50% green), and one prominent gang of pirates i have now uses light green. When making ships either go with a neutral white or warm white lighting, or pick some unique color scheme your ships will have (in terms of lights) so that they can be unique and stand out from the main faction tech. B-Corp and most major factions will buy from companies/manufacturers (assuming its not produced by that faction and thus made in their own factories), so please include some company info if you want to (at least give a name, if you want some of it to be added into comic add some bio or say background with your company).\u003Cbr\u003E\n\u003Cbr\u003E\nAs for pirate vessels, these are unique (no two pirate capital ships will ever be the same as each is custom made), and should look like they were made in the field. Common designs i have out now include alot of asymmetric craft, craft that are say a small vessel with armor plating bolted on in various funky directions, and generally avoid the new shiny spaceplane parts since they just dont look very good on something thats supposed to have been made from wreckage found in old battlefields. I seem to like assymetric craft, with as much as different engines pushing different parts of the craft, but even cleaner looking ships are fine for pirates (some of the pirate factions actually have some form of standards and dont make ships out of wreckage, but teh majority do).\u003Cbr\u003E\n\u003Cbr\u003E\nBtw, i only have one hard limitation for submissions. If you intend this vessel to actually be featured in any sort of combat scenario, then it cannot be above 300 parts total or my computer will melt when i bring it along with 1-3 other capitals and their fighter escort into physics range of each other. For purely cinematic ships, the part count can go up to 600, but these vessels will be used at most to take shots of say commanders talking about something, and will not be used in any combat scenarios until U5 (assuming it actually fixes the lagfest there is right now).\u003Cbr\u003E\n\u003Cbr\u003E\nThe thread to place subs is located here: [url]http://forum.kerbalspaceprogram.com/threads/132588-Operation-New-Beginning-the-story-of-AKS-and-B-Corp-two-factions-strugling-for-survival[/url]\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-16T17:04:32Z\u0022 title=\u002211/16/2015 05:04  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 16, 2015\u003C/time\u003E by panzer1b\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"iamonfire","CreatedById":91532,"CreatedDateTime":"2015-11-17T01:54:50Z","Content":"\n[IMG]http://www./convkey/9a2e/rgk2hkd9uf8d6vvzg.jpg[/IMG]\u003Cbr\u003E\nTime to bring the big guns.\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-11-17T06:08:45Z","Content":"\nFinally, after a while of testing and engineering ive managed to bring back my 0.23 relic of a starfighter!\u003Cbr\u003E\n\u003Cbr\u003E\nThe Tri-Fighter has returned in its former glory!\u003Cbr\u003E\n[img]http://imgur.com/Dfp8dEy.png[/img]\u003Cbr\u003E\n[img]http://imgur.com/QvN0LVZ.png[/img]\u003Cbr\u003E\n[img]http://imgur.com/fNn7LyE.png[/img]\u003Cbr\u003E\nThe new Tri-Fighter IV is a bit different then older models, but it is still the same basic principle, 3 rapiers, insane TWR/maneuverability, and all with a respectable firepower of 2 internal and 2 external drones, with optional wing cannons. Ofc, its not very practical as it has garbage operating range, and it is heavier/more complex then the more standard HK-101, but the HK-103 is one craft that i will make work regardless of how much squad butchers the aerodynamics!\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2015-11-17T06:14:36Z","Content":"\n[quote name=\u0027iamonfire\u0027][URL]http://www./convkey/9a2e/rgk2hkd9uf8d6vvzg.jpg[/URL]\u003Cbr\u003E\nTime to bring the big guns.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\nPlease. THIS brings in the big guns.\u003Cbr\u003E\n\u003Cbr\u003E\n[IMG]http://i.imgur.com/w3BGsbB.jpg[/IMG]\n"}]}