{"TopicId":100366,"ForumId":21,"TopicTitle":"Jak\u0027s failed bearings. The quest for the working coaxial...","CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2015-02-21T22:41:30Z","PageNum":1,"Articles":[{"CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2015-02-21T22:41:30Z","Content":"Just a listing of several bearing I\u0027ve made in an attempt to get a working coaxial bearing going. It\u0027s been quite the ride. So far, every try has led to failure. And it all started with this, the high tower:\n\n![bearingfail1_zps3aedf29d.jpg](http://i1346.photobucket.com/albums/p685/Jakalth/Failed%20Bearings/bearingfail1_zps3aedf29d.jpg)\n\nIt ended up being so bad as a bearing that I didn\u0027t even try improving it. Complete failure at everything related to what it was meant to be.\n\nFrom this BAD start, I went on to several versions. Branching out with wide bottom variants, several high tower variants, and a few one off unconventional versions. The full listing of these can be found here:\n\n[http://s1346.photobucket.com/user/Jakalth/Failed%20Bearings/story](http://s1346.photobucket.com/user/Jakalth/Failed%20Bearings/story)\n\nI\u0027ll keep trying, but I though you might get a kick out of looking at what I\u0027ve done wrong so far.\n\nI could just look at existing designs that work, but that takes some of the challenge out of trying to do it from scratch.\n\n**Edited \u003Ctime datetime=\u00222015-02-21T22:53:36Z\u0022 title=\u002202/21/2015 10:53  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 21, 2015\u003C/time\u003E by Jakalth**"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2015-02-22T11:23:04Z","Content":"Wow, that is a lot of attempts. Well played on the research aspect of it. I haven\u0027t attempted to make a co-axial yet and I\u0027m not sure if I want to!"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-02-22T14:20:15Z","Content":"The big problem is: you need a single hollow part for the fact you need the structural integrity for handling the large forces. Any tubular construction will have enormous strain on the joints, causing the structure to either compress or expand, in both cases leading to a change in drag with the landing gears, one side of the tube starts to compress, a different side starts to expand. On parts starts to turn slower, other side is still pushing and that leads to even more drag. All happening at the same time both inside and outside the tube.\n\nThe only hollow part we have to build such a construction with, is the MK3 cargo bay. That\u0027s why my coaxial designs use those. When I studied the problem over a year ago, we didn\u0027t have the MK3. Most of all, we didn\u0027t have the possibility to slide a separator inside a stucture and attach a hollow part to it. Without this trick, it would never have been possible."},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2015-02-22T17:39:46Z","Content":"you can also make gaps between two attached parts now (and they remain mysteriously attached ^^) that could help too ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) i\u0027ve added a howto onto the open source technics thread for soyuz style open latices, but it can work too for creating gaps between the bearings and the rotor for example ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)[http://forum.kerbalspaceprogram.com/threads/43086-Open-Source-Construction-Techniques-for-Craft-Aesthetics?p=1709894\u0026viewfull=1#post1709894](https://forum.kerbalspaceprogram.com/threads/43086-Open-Source-Construction-Techniques-for-Craft-Aesthetics?p=1709894\u0026viewfull=1#post1709894)\n\n**Edited \u003Ctime datetime=\u00222015-02-22T17:41:47Z\u0022 title=\u002202/22/2015 05:41  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 22, 2015\u003C/time\u003E by sgt\\_flyer**"}]}