{"TopicId":106865,"ForumId":21,"TopicTitle":"The \u0022Mosquito of Doom\u0022 Multi-Mission Synchropter: My first rotary-wing aircraft in KSP 1.0 / 1.02","CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-05-02T14:06:10Z","PageNum":1,"Articles":[{"CreatedByName":"Goddess Bhavani","CreatedById":14001,"CreatedDateTime":"2015-05-02T14:06:10Z","Content":"**Kerman KE-2 \u0022Mosquito\u0022 Multi-Mission Synchropter**\n\n**Built in KSP Version 1.0 / 1.02 with** [**Infernal Robotics Rework**](https://forum.kerbalspaceprogram.com/threads/65365-WIP-MSI-s-Infernal-Robotics-Model-Rework-%28Updated-28-04-2015%29) **and** [**TweakScale**](https://forum.kerbalspaceprogram.com/threads/112693)\n\n[**Craft file available at KerbalX.**](http://kerbalx.com/pandoraskitten/KE-2S-Mosquito-Synchropter)\n\n![sFQxcp6.jpg](http://i.imgur.com/sFQxcp6.jpg)\n\nThe sight of this hellish machine rising up from dusk\u0027s dying light had probably struck dread into the hearts of many a poor plane-spotter in the vicinity of the Space Center.\n\nIt\u0027s true purpose is however, much less sinister than it looks, as the KE-2 \u0022Mosquito\u0022 is meant to be a crew transportation helicopter with a secondary airdrop capability for sensor probes; its payload bay would in due course deploy dropsondes for research and dipping sensors for (imaginary) maritime operations. I think the machine has enough lift capacity for a ton or three of payload, as per the below flight demonstration video flown in \u0027clean\u0027 configuration was most eager to climb away with the slightest increase of collective. \n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/XJRCsaBjf9U?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nThe helicopter takes to the air by way of tandem intermeshing rotors, earning it the moniker of *synchropter* like the excellent Kaman K-MAX. This is my second synchropter design, the first being a much more primitive affair without rotor articulation and meant as an\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/yrgLMPRzuGA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n/parody.\nThe rotor control systems, namely the animated and functional collective pitch and cyclic controls bound to and supplemental to the WASD keys, are courtesy of [Infernal Robotics Rework components](https://forum.kerbalspaceprogram.com/threads/65365-WIP-MSI-s-Infernal-Robotics-Model-Rework-%28Updated-28-04-2015%29). \n\nThe craft is not difficult to fly, unlike my 0.90 ships. Gentle application of collective and cyclic prevents the craft from over-rotating, while the synchropter is fully capable of precision hover thanks to being able to adjust its velocity precisely, using jet thrust.\n\nBe wary to always ensure the fuel cell is turned ON, lest you lose power to the rotors when the batteries are depleted.\n\n![fOGwPJA.jpg](http://i.imgur.com/fOGwPJA.jpg)"}]}