{"TopicId":110704,"ForumId":21,"TopicTitle":"PLEA FOR ASSISTANCE: Transport vessel","CreatedByName":"-M-TheDoctor","CreatedById":141408,"CreatedDateTime":"2015-05-24T22:14:24Z","PageNum":1,"Articles":[{"CreatedByName":"-M-TheDoctor","CreatedById":141408,"CreatedDateTime":"2015-05-24T22:14:24Z","Content":"So I\u0027m trying to build a Carryall. An air-breathing cargo craft that can carry base components (i.e. mobile lab, drill rig, rover, fuel tanks) to any part of Kerbin. The idea is that I can build drilling bases, fuel depots, and science labs across Kerbin, using this craft to transport the components, then use another aircraft to transport the crews. I had made one design, but it was far too fragile, and it experienced a Random Unscheduled Dis-assembly event in a most spectacular fashion. ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif) Any help is greatly appreciated!"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2015-05-24T22:32:35Z","Content":"\u003E \n\u003E TheDoctor;1968672\u0027]So I\u0027m trying to build a Carryall. An air-breathing cargo craft that can carry base components (i.e. mobile lab\u0027 date=\u0027 drill rig, rover, fuel tanks) to any part of Kerbin. The idea is that I can build drilling bases, fuel depots, and science labs across Kerbin, using this craft to transport the components, then use another aircraft to transport the crews. I had made one design, but it was far too fragile, and it experienced a Random Unscheduled Dis-assembly event in a most spectacular fashion. ![:blush:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif) Any help is greatly appreciated![/quote\u0027]\n\u003E I\u0027m going to assume what happened to you was excessive drag forces causing structural failures. The Mk3 parts currently have questionably high drag. This can be circumvented with the use of Stock Bugfix Modules (the thread is stickied down in add-on releases).\n\u003E \n\u003E Next question. Which mods do you have or are willing to use? ALso what do some of these modules it needs to transport look like?"},{"CreatedByName":"-M-TheDoctor","CreatedById":141408,"CreatedDateTime":"2015-05-24T23:00:41Z","Content":"I use no mods at all. I might use a few, but I play on a laptop that is prone to overheating. The components are simple. Mobile science lab (with accessories[solar panels, legs etc.]) the orange fuel tank, a hitchhiker can with drill and large storage tank. nothing will be too large. Sorry I don\u0027t have pictures, I haven\u0027t built any of the components. I\u0027ve only made an attempt at building the carryall. I used a mk. 2(the sleek 2 seater) cockpit for my design. wish I had screenshots for you guys ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)"}]}