{"TopicId":11100,"ForumId":21,"TopicTitle":"P-38J \u0022Jet Lightning\u0022","CreatedByName":"khyron42","CreatedById":8551,"CreatedDateTime":"2012-05-21T04:22:18Z","PageNum":1,"Articles":[{"CreatedByName":"khyron42","CreatedById":8551,"CreatedDateTime":"2012-05-21T04:22:18Z","Content":"Inspired by the [Lockheed P-38 Lightning](https://en.wikipedia.org/wiki/Lockheed_P-38_Lightning) World War II fighter/bomber, I give you the P-38J Jet Lightning.\n\nLike the original, it features an unusual \u0027twin boom\u0027 fuselage (Jeb was very disappointed when he learned that no, this didn\\\u0027t mean two explosions happened every time it flew by.)\n\n![7Pgd0.jpg](http://i.imgur.com/7Pgd0.jpg)\n\n\u003E ![nAF56.jpg](http://i.imgur.com/nAF56.jpg)\n\u003E ![5RQyK.jpg](http://i.imgur.com/5RQyK.jpg)\n\nSome design changes happened to allow it to function as a supersonic high-altitude jet instead of a propeller plane; the wing shape changes are the main difference.\n\nSpeed: Full throttle at 15.5 km altitude, Approximately 550 m/s.\n\nTakeoff performance is different on the two versions due to the shift in center of mass:\n\n![K9Iw0.jpg](http://i.imgur.com/K9Iw0.jpg)\n\nAvionics Version: Pull back on the stick at 150 m/s. You\\\u0027ll lift off before the runway ends.\n\nASAS Version (pictured): Pull back GENTLY on the stick at 110 m/s. You\\\u0027ll be about halfway down the runway at that point.\n\nGlide performance:\n\n![AZjz6.jpg](http://i.imgur.com/AZjz6.jpg)\n\nAble to sustain a reasonable glide at speeds down to 50 m/s in thick air (below 1 km altitude.) However, control response is very poor at this speed, and fatal unrecoverable dives can happen with little warning especially if you attempt to maneuver during glide.\n\nLanding: unpowered landings preferred due to high glide performance. One advantage of the very low speed landing is that even a landing that comes in slightly short of the runway will often leave the crew alive.\n\n\u003E ![m2aLj.jpg](http://i.imgur.com/m2aLj.jpg)\n\nTwo models of the plane are attached, using two different SAS approaches. The first one uses C7\\\u0027s Aerospace\\\u0027s Avionics Package. The second one uses STEADLER Engineering Corps\\\u0027 Advanced S.A.S Module. both have room to attach a small payload in the area between the two booms, though payload space is reduced on the ASAS model."},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-05-21T04:53:59Z","Content":"This looks pretty nice. Do you think you could create something all-but-identical, with a rocket command pod attached to a rocket as the payload? Then we\\\u0027d have a Virgin Galactic kind of deal."},{"CreatedByName":"Vasili","CreatedById":22799,"CreatedDateTime":"2012-05-21T21:39:01Z","Content":"Gotta love unconventional-looking aircraft that still fly.\n\nUncontrollable dives are somewhat a trademark of the real P-38s anyway. (Although they happened at high speed, not low speed)"}]}