{"TopicId":118224,"ForumId":21,"TopicTitle":"Cowboy Bebop replica craft!","CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-11T18:50:03Z","PageNum":1,"Articles":[{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-11T18:50:03Z","Content":"That\u0027s right, folks. I\u0027ve been getting my nerd on in a serious way, and marathoned through Cowboy Bebop again with my friends. It\u0027s one of the best anime of all time, but I haven\u0027t seen many attempts to replicate some of its iconic spacecraft. So, here I am to fill in that gap.\n\n![NYmt8AB.png](http://i.imgur.com/NYmt8AB.png)\n\n**Spike Spiegel\u0027s Swordfish**\n\nI think I\u0027ve seen one other Swordfish replica on the forums before, but that was back in the souposphere, and even then it wasn\u0027t able to fly without hack gravity. This one can fly for real.\n\n![UJJi9q8.png](http://i.imgur.com/UJJi9q8.png)\n\nThanks to Logan.Darklighter\u0027s fantastic advice, I was able to tweak and refine the Swordfish, and now it performs better than ever. I\u0027ve added additional control surfaces and Vernor engines, tweaked the balance, and made a couple other small changes. The old version of the Swordfish could really only fly with the Vernors on, severely limiting speed and flight time. Now the Swordfish can take off, fly, and maneuver using only its aerodynamic control surfaces. The Vernor engines boost the Swordfish\u0027s maneuverability to an insane degree, allowing it to stop and reverse directing in midair. It also allows it to take off and hover vertically. However, the Vernor engines really chew through fuel, so flying in this mode means much shorter flights.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/pB3AE)\n\n[Stock Swordfish download!](http://kerbalx.com/The-Fantabulous-Toast/Swordfish-final-unpainted)\n\n[Swordfish donwload with Kerbpaint!](http://kerbalx.com/The-Fantabulous-Toast/Swordfish-Final-painted)\n\n**Faye Valentine\u0027s Red Tail**\n\nI didn\u0027t think this one would be possible, but after only a day of general tinkering, I got the Red Tail flying!\\*\n\n![44aWGUO.png](http://i.imgur.com/44aWGUO.png)\n\n\\*For about 2 minutes.\n\nThis craft has the same problem the original Swordfish did: it chews through fuel like a big chewy thing. Primary lift is provided by two basic jet engines, but it needs pulses from the Vernor engines to get up in the air, and even more pulses to keep it there. It flies on translation controls, so get ready to have both hands on the keyboard. Again, flight time is limited to a couple of minutes, so in this case only I recommend emptying some of the fuel out of it and flying with Infinite Fuel on. It\u0027s more fun that way.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/qBgJh)\n\nAlso, important note: The Red Tail has a probe core on it, which is designed to be its primary control. However, somehow it gets switched to the pod, which makes the ship unflyable. So, at the start of your flight don\u0027t forget to switch command from the pod to the probe core (which is hidden underneath the air intakes).\n\n[Stock Red Tail download!](http://kerbalx.com/The-Fantabulous-Toast/Red-Tail-final-1-unpainted)\n\n[Red Tail with Kerbpaint!](http://kerbalx.com/The-Fantabulous-Toast/Red-Tail-final-1-painted)\n\n**MONO Racer Swordfish**\n\nIn addition to that, I\u0027ve also made the original MONO racer design of the Swordfish. We really only see it once, in a photo during the episode Wild Horses. Fittingly for a racing plane, it\u0027s twitchy as hell. This version can be pretty unstable, but since it doesn\u0027t have the gun strapped to the bottom causing drag, it can actually push through the sound barrier. Otherwise, it can do everything the normal Swordfish can do.\n\n![X8wwGCk.jpg](http://i.imgur.com/X8wwGCk.jpg)\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/pneRy)\n\n[Stock MONO Racer version!](http://kerbalx.com/The-Fantabulous-Toast/SWORDFISH-2-MONORACER-VERSION)\n\n[MONO Racer version with Kerbpaint!](http://kerbalx.com/The-Fantabulous-Toast/SWORDFISH-2-MONORACER-VERSION-painted)\n\n**Wild Horses suborbital flight**\n\nThat\u0027s not all I did after my latest session with the show. For those of you who have seen it, you might remember the episode Wild Horses, where they drag this dusty old antique out to save Spike, who is plummeting into Earth\u0027s atmosphere.\n\n![cowboy_bebop_remastered_19h264-ac3niizk-mkv_snapshot_18-59_2012-01-01_17-50-21.jpg](https://ghostlightning.files.wordpress.com/2012/01/cowboy_bebop_remastered_19h264-ac3niizk-mkv_snapshot_18-59_2012-01-01_17-50-21.jpg)\n\nThey don\u0027t have the normal launch stack, so they send it up into a suborbital trajectory like this:\n\n![2jBeIim.png](http://i.imgur.com/2jBeIim.png)\n\nIt\u0027s one of my favorite sequences in the whole show, so I thought I\u0027d give it a shot, just to see how well it would work. Miracle of miracles, it actually works kinda well.\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/FAvQm)\n\nApo was in the low 70\u0027s, but that\u0027s enough for me. The Wild Horses ascent works, useless though it may be. It was a fun little experiment!\n\n**Edited \u003Ctime datetime=\u00222015-08-13T19:52:06Z\u0022 title=\u002208/13/2015 07:52  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 13, 2015\u003C/time\u003E by Red Dwarf**"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-08-11T19:02:59Z","Content":"I\u0027ve tried many times to get into the anime, but I just can\u0027t get hooked. The design of the vehicles is off putting to me. What\u0027s the deal with the large booms that stick out in front of the craft? Now I\u0027ve only watched random episodes on toonami so I\u0027m not too familiar. But another thing ii really didn\u0027t like is how everything is perfectly terraformed. ( not an anime, but that\u0027s the sole reason I hated Firefly as well ) \n\nInteresting use of a shuttle. I assume you fueled those engines with the tank in the payload bay? Is that how they did it in the show as well?\n\nAs far as space themed animes go I really liked Space Brothers ( quite possibly my favorite anime of all time ) and Planetes. So I might give this another go from the beginning. Nice work on the replicas.\n\n**Edited \u003Ctime datetime=\u00222015-08-11T19:17:17Z\u0022 title=\u002208/11/2015 07:17  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 11, 2015\u003C/time\u003E by Motokid600**"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-11T19:08:20Z","Content":"The large boom on the front is a gigantic plasma cannon. On the replica it\u0027s used to pull the center of mass way forward. There\u0027s no way I would be able to mount the wings so far up the fuselage otherwise.\n\nAlso, Spike isn\u0027t the dog, he\u0027s the bounty hunter XP"},{"CreatedByName":"Kagame","CreatedById":141304,"CreatedDateTime":"2015-08-11T19:24:15Z","Content":"Sir, you deserve all the rep. Just saying."},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-08-11T19:25:42Z","Content":"Lol I realized that after reading up on the anime and edited that sentence out \u003E.\u003C. Interesting plot. Think I will give it a go. My only problem is a good place to watch some if these shows. Crunchyrol has me spoiled."},{"CreatedByName":"HappilyStreet","CreatedById":53881,"CreatedDateTime":"2015-08-11T21:55:11Z","Content":"Can...can we have the craft files?"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-11T22:10:36Z","Content":"Sure thing! I don\u0027t really see a point in uploading the Wild Horse, since I just added booster rockets to a regular shuttle. You guys can do that for yourself. I\u0027ll update the OP with the link for the Swordfish though.\n\n**Edited \u003Ctime datetime=\u00222015-08-11T22:17:32Z\u0022 title=\u002208/11/2015 10:17  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 11, 2015\u003C/time\u003E by Red Dwarf**"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-08-11T22:21:46Z","Content":"\u003E \n\u003E Sure thing! I don\u0027t really see a point in uploading the Wild Horse, since I just added booster rockets to a regular shuttle. You guys can do that for yourself. I\u0027ll update the OP with the link for the Swordfish though.\n\nI\u0027d be interested in seeing the details on how you built it. Always looking for new ideas/techniques\n\n...See you around, space kerbal"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2015-08-11T22:44:00Z","Content":"I am a big fan of the anime. Lovely replica \u002B rep. \n\nKaubÃ…Âi Bibappu FTW."},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-11T22:58:20Z","Content":"\u003E \n\u003E I\u0027d be interested in seeing the details on how you built it. Always looking for new ideas/techniques\n\nI really think this craft shows how even though the aero-model is a lot better, it still isn\u0027t quite *there* yet. My Swordfish cheats a bit, and the tail ring, combined with the cannon on the nose, is the key to its success.\n\nSee, the Swordfish\u0027s wings are crazy far forward compared to where its center of mass would be. In order to make the craft flyable, I used the cannon to bring the center of mass forward. All that I had to do then was bring back the center of lift.\n\nTo do that, I angled the tail ring very slightly. I\u0027m pretty sure the wings in this game run on magic. Putting them at an angle to the wind causes seriously crazy amounts of lift and drag. Look how far the center of lift travels with only 4 degrees of rotation:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/kwD7l)\n\nReally, I could have pushed the wings even further forward, and still be able to compensate with the tail ring. I bet it\u0027d be possible to make even more improbable designs by doing that... hmmm... I\u0027m gonna go build a passenger jet with the wings on the nose and see if I can trick the system again..."},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2015-08-11T23:47:13Z","Content":"Hmmm, tried columbia and I\u0027m lucky to get 10k appo to say nothing of COM shift causing flips if I don\u0027t move fuel around...."},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-11T23:58:54Z","Content":"What\u0027s your shuttle look like? You have to remember that I put my shuttle together in 3 minutes. I didn\u0027t even put any monoprop in it. Also, the booster rockets aren\u0027t fully fueled. Make of that what you will.\n\nEdit: Also, I don\u0027t know if I made it clear that this configuration is only good for suborbital hops. I get a 70 km apoapsis, but after that it drops into the ocean. If you can get anything even remotely like this to orbit, I will give you a medal.\n\n**Edited \u003Ctime datetime=\u00222015-08-12T00:02:39Z\u0022 title=\u002208/12/2015 12:02  AM\u0022 data-short=\u00228 yr\u0022\u003EAugust 12, 2015\u003C/time\u003E by Red Dwarf**"},{"CreatedByName":"Dr Farnsworth","CreatedById":147177,"CreatedDateTime":"2015-08-12T00:03:37Z","Content":"I have not watched Cowboy Bebop in years but I can still recognize your craft that ya got there. Mighty nice lookin!"},{"CreatedByName":"HappilyStreet","CreatedById":53881,"CreatedDateTime":"2015-08-12T04:21:06Z","Content":"Thank you for Delivering"},{"CreatedByName":"obi_juan","CreatedById":89945,"CreatedDateTime":"2015-08-12T05:17:41Z","Content":"Thanks for sharing... I will fly it tonight."},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2015-08-12T17:30:41Z","Content":"Gotta say - this beast is a bit tricky to fly. Mainly on take-offs and landings,. The tail-dragger config wouldn\u0027t be as much of a problem if it weren\u0027t for the fact that the main gear is so angled! This craft really needs Bahamuto\u0027s Adjustable Landing Gear! (which should be STOCK, DANGIT!!!) \n\nOther than that, the balance, as you say, is legit, no matter how wonky it was to get there! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nIf anything, I\u0027d suggest trying to place the center of lift even closer to the center of mass if possible - this is a fighter craft, after all. And right now, though it flies pretty damn good (once you get it off the ground), I\u0027d say at least as much control authority comes from the vernier thrusters as from the wings and control surfaces. You really HAVE to have those operating to get the maneuverability. And they are REQUIRED to get off the runway without crashing! \n\nI did manage to land the thing mostly in one piece, but I lost the tip of the gun and the lower bits on the wings. Then again - it was a first landing, so I\u0027ll call it a win and if a guy like me - not the best pilot in the world - can get this thing down successfully, then I know it\u0027s more than possible to do it without any bits flying off on subsequent flights. \n\nNevertheless it\u0027s fun to fly around. Not much range on it, sadly, and it\u0027s certainly not going to space in it\u0027s current state. But as a flyable replica, it\u0027s first rate!\n\nEDIT: I have discovered some easily fixable problems that don\u0027t require even adding/removing parts from the craft. \n\nThis Swordfish was having problems even keeping it\u0027s nose up without resorting to the vernier jets, must less any actual maneuverability. And there was almost NO Roll control without them and very little pitch control. Yaw was also a problem. \n\nSo I messed around in flight and discovered some things. \n\nFirst off - the leading edge control surfaces on the front part of the wings were FIGHTING the ones on the back end. In other words, any pitch or roll you tried to input pretty much was negated by having the front leading edges almost entirely cancelling out whatever the trailing edges were doing. Once I turned off Pitch and Roll control on the leading edges, the Swordfish responded MUCH better than before. It could maneuver reliably without needing the vernier jets to be on all the time. They still come in VERY handy in short on/off bursts. But the craft no longer NEEDED them constantly on to fly true! \n\nSecond - I re-angled the rear \u0022circle tail\u0022 so that the center of mass and center of lift were DEAD ON each other. This REALLY helped! \n\nThird, I turned on the Yaw on the vertical stabilizers at the tips of the wings. \n\nNow - when the vernier jets are off, you have a pretty stable, yet maneuverable flying machine. \n\nWith the verniers ON, you get SUPER-MANEUVERABILITY on the order of an SU-27 Flanker! This thing can reverse itself in mid-air, STOP with its thrust and go the other way! \n\nEDIT EDIT: Oh - and those vernier thrusters really help out in take-offs and landings. This Swordfish isn\u0027t a VTOL. But it\u0027s most definitely an STOL extraordinaire! With upward thrust from the verniers, i can practically stand this thing on it\u0027s tailwheel 50 meters into take-off and lift off!! And in landing, you can get down to some ridiculously slow speeds for a nice soft touchdown. \n\nTherefore I retract my comment about the landing gear above. It\u0027s rather a moot point! Heh. \n\nHope these test-flight observations help out! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\n**Edited \u003Ctime datetime=\u00222015-08-12T20:14:12Z\u0022 title=\u002208/12/2015 08:14  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 12, 2015\u003C/time\u003E by Logan.Darklighter**"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-12T18:05:22Z","Content":"Yeah, range was never really a concern for me. When I make replicas, looks take the priority to functionality. I never expected it to be an SSTO like the real Swordfish, since that thing has a fusion reactor/aerospike engine that\u0027s almost as big as the rest of the ship. Just being able to do a few loops around the KSC is enough for me ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)"},{"CreatedByName":"Fearless Son","CreatedById":133397,"CreatedDateTime":"2015-08-12T20:37:31Z","Content":"\u003E \n\u003E I\u0027ve tried many times to get into the anime, but I just can\u0027t get hooked. The design of the vehicles is off putting to me. What\u0027s the deal with the large booms that stick out in front of the craft? Now I\u0027ve only watched random episodes on toonami so I\u0027m not too familiar. But another thing ii really didn\u0027t like is how everything is perfectly terraformed. ( not an anime, but that\u0027s the sole reason I hated Firefly as well )\n\nOne of the things I liked about it was that it was actually *not* perfectly terraformed. For example, most martian cities are built inside large craters, which in turn have tall airwalls built around their rims. They have atmospheric processing going on inside those craters that keeps the area breathable, and you can see the higher density air spilling over the tops of the walls, forming fog banks as it chills into the colder surrounding atmosphere. The cities in turn are connected by highways which are covered and pressurized. [Image here](http://vignette2.wikia.nocookie.net/cowboybebop/images/0/0c/2_Marscity.png/revision/latest?cb=20090805152549).\n\nOne of the recurring minor elements in the series are old pensioners who were some of the \u0022first in\u0022 colonists and who tend to bemoan how the younger generations do not realize how easy they have it these days, considering themselves something of a \u0022greatest generation\u0022 for how much terraforming they were able to accomplish.\n\n**Edited \u003Ctime datetime=\u00222015-08-12T20:40:34Z\u0022 title=\u002208/12/2015 08:40  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 12, 2015\u003C/time\u003E by Fearless Son**"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-12T21:37:53Z","Content":"\u003E Hope these test-flight observations help out! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nHoly cats! I tried out the changes you suggested, and now she flies fantastic. I made some more tweaks after I fixed those issues, and now she can take off without RCS, and performs well on control surfaces alone. Thanks to the COL tweaks the flight time has been extended from 3 minutes to 15, now that the RCS isn\u0027t required for level flight. I moved the vernor ports around, too, so that she can take off and even hover on RCS alone. Like you said, flying with RCS on makes this thing a *beast*. I\u0027ve been able to stop and reverse directions in midair, and have stable flight!\n\nFinally, I had noticed a bug where the landing gear would sometimes cause rapid unplanned disassembly, which is now fixed. I\u0027m working on releasing an updated version, as well as a version without the cannon, with all those new features. I\u0027m experimenting with Kerbpaint as well, so keep an eye out for that.\n\nThanks so much for the advice, dude! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-12T23:44:33Z","Content":"Updated the OP with tweaked and new craft!"},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2015-08-13T00:37:08Z","Content":"\u003E \n\u003E Holy cats! I tried out the changes you suggested, and now she flies fantastic. \n\u003E (snip)\n\u003E \n\u003E Thanks so much for the advice, dude! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nGlad to help out! \n\nAnd... \n\n\u0022Tell you what. Throw a little hotrod red in there.\u0022\n\n\u0022Yes, that should help you keep a low profile...\u0022\n\n![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-13T16:16:00Z","Content":"Today I took a shot at perhaps the most unlikely craft from the show: Faye\u0027s Red Tail.\n\n![cowboy_bebop___red_tail____2_by_tmc_deluxe.jpg](http://orig08.deviantart.net/183a/f/2008/060/4/1/cowboy_bebop___red_tail____2_by_tmc_deluxe.jpg)\n\nFaye\u0027s Red Tail is kind of mystifying. It can take off and land vertically, hover, and also somehow fly like a normal jet, all without any clearly visible down-facing engines. It also looks really really weird. \n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/yGlLF)\n\nFinal verdict: Promising. It worked a lot better than I expected it too, but that being said, it did not work particularly well. TWR is very low, the RCS systems aren\u0027t doing what I want, and it\u0027s hard to steer. However, that may be because of pilot inexperience. To do this right, I\u0027m probably going to need Cupcake levels of skill in terms of VTOL piloting and design. Time will tell how well this goes."},{"CreatedByName":"Logan.Darklighter","CreatedById":7375,"CreatedDateTime":"2015-08-13T16:44:39Z","Content":"\u003E \n\u003E Today I took a shot at perhaps the most unlikely craft from the show: Faye\u0027s Red Tail.\n\u003E [http://orig08.deviantart.net/183a/f/2008/060/4/1/cowboy_bebop___red_tail____2_by_tmc_deluxe.jpg](http://orig08.deviantart.net/183a/f/2008/060/4/1/cowboy_bebop___red_tail____2_by_tmc_deluxe.jpg)\n\u003E \n\u003E Faye\u0027s Red Tail is kind of mystifying. It can take off and land vertically, hover, and also somehow fly like a normal jet, all without any clearly visible down-facing engines. It also looks really really weird. \n\u003E \n\u003E [http://imgur.com/a/yGlLF](http://imgur.com/a/yGlLF)\n\u003E \n\u003E Final verdict: Promising. It worked a lot better than I expected it too, but that being said, it did not work particularly well. TWR is very low, the RCS systems aren\u0027t doing what I want, and it\u0027s hard to steer. However, that may be because of pilot inexperience. To do this right, I\u0027m probably going to need Cupcake levels of skill in terms of VTOL piloting and design. Time will tell how well this goes.\n\nActually, Faye\u0027s Red Tail is not that mystifying. You just have to watch in the show carefully and then take some notes from a source like the plan view above. \n\nThe main thing is that you are almost certainly NOT going to be able to do this properly in stock mode. You\u0027re going to need IR Robotics at bare minimum. I also recommend Bahamuto\u0027s parts pack - the ones with the pop-out engines and such. Lackluster Labs will also have some form shapes that\u0027ll help. Lastly - tweakscale, because you\u0027re going to have to adjust some things for closest result. \n\nTake a look at the \u0022arms\u0022. There are at least 3 large thrusters on the white \u0022shoulder\u0022 sections. The big thruster right behind the \u0022elbow\u0022 of the assembly is the main VTOL thruster. (**EDIT:** Right where you\u0027ve got the big landing gear, in fact) But there are stabilizing thrusters pointing forward and to the sides relative to that. Plus what appear to be Linear RCS Thruster ports towards the rear facing outwards, and at the very tip of the rear part of the shoulder facing backwards. \n\nIf it were me, I\u0027d build the arms first as an IR Robotics sub-assembly first if possible. You\u0027ll need a rototron at the main connecting point between the \u0022shoulder\u0022 and the main body. And a powered hinge (possibly also a small sliding piston) at the \u0022elbow\u0022. \n\nIn the show, when the Red Tail comes in to land, it bends the \u0022Elbows\u0022 up and folds the guns near vertical, and rotates the \u0022Shoulders\u0022 so that the main VTOL thruster is pointing down. The other thrusters probably gimble to provide stabilization. Plus the RCS is helping. \n\nBahamuto\u0027s parts pack would be invaluable, because it\u0027s got at least one rocket thruster that\u0027s a rectangular unit, that looks like a vent when not operating, but when active, pops out the bells of the rocket thrusters. It\u0027d make a good match for that VTOL vent above. (Rockets also make better VTOL thrusters than Jets anyway - more responsive.) \n\nAs for the other thrusters - well I think for the power you need and the response time, you\u0027ll need to use Vernor thrusters like you used with the Swordfish. They may have to be spaced differently because they\u0027ll be static rather than gimble mounts. But that\u0027s the sort of compromise you have to make when doing a recreation that\u0027s also intended to fly. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI\u0027m not sure HOW to really do the bubble cockpit justice. I can\u0027t recall a single \u0022pod\u0022 like that in all the mods I\u0027ve seen - except an Oblivion Mod from Wayland that is now sadly out of date and not compatible with 1.04. What you\u0027ve done in the screens above is about the best compromise possible for both size and functionality I\u0027d bet. \n\nLastly - if going the mod route, I think you should obviously use the GAU 30MM cannon from BD Armory, cause the lower arms are ALL GUN. Heh. (Actually in the show, she had missiles there too, but you can only do so much with the space restrictions! Maybe an unguided rocket pod would fit there as well?) \n\n(Which, BTW - reminds me of a little tinkering I attempted with the Swordfish. Unfortunately the Howitzer, despite being huge, is actually NOT LONG ENOUGH to make a credible replacement for the girders on the front in terms of appearance! ![:0.0:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif)\n\nI think it COULD be done, but you\u0027d have to fit it to something like a tailboom or some other long structural element. Even stuck on the end of one section of the girders, it looks kinda strange. On the other hand, the smaller guns that the Swordfish uses are good matches for the BD Armory fixed 20mm Vulcans.)\n\n**Edited \u003Ctime datetime=\u00222015-08-13T16:47:48Z\u0022 title=\u002208/13/2015 04:47  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 13, 2015\u003C/time\u003E by Logan.Darklighter**"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-13T17:59:25Z","Content":"My initial approach was to use the Vernor thrusters, just like I did in the swordfish, but for some reason it doesn\u0027t seem to work. Part of it is because the Red Tail is so much *heavier* than the Swordfish. It\u0027s almost all fuel tank, where-as the Swordfish was mostly wing. In addition to that, the RCS gets confused when placed on parts that have been rotated and twisted around weirdly like they have been here. Using the translation controls to thrust upward, only the ports on the front of the craft will work. the rest only fire during rotation.\n\nIt may be that there\u0027s issues with the root part (the pod), when it should really be one of the structural elements, like the main body of the craft. Time for some experimentation!\n\n- - - Updated - - -\n\nI figured it oooouuuut! The Red Tail will be ready for release soon!"},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-08-13T19:53:00Z","Content":"OP updated with Faye Valentine\u0027s Red Tail!"}]}