{"TopicId":119218,"ForumId":21,"TopicTitle":"Kiandre Transportation Enterprises","CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2015-08-24T03:36:55Z","PageNum":1,"Articles":[{"CreatedByName":"Spacetraindriver","CreatedById":149403,"CreatedDateTime":"2015-08-24T03:36:55Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FuaXMif.png\u0022 alt=\u0022FuaXMif.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWelcome to KTE, Kerbal Transportation Enterprises! For all your transportation needs! And coolness needs!\u003C/p\u003E\u003Cp\u003E(This will become a company in rocket builders soon but for now this is just the showroom) \u003C/p\u003E\u003Cp\u003EHere at KTE we take things into the kerbal universe! We started as a locomotive works for the KSC. As a reward for our one of a kind train services, they gave us knowledge for building many other craft. We specify in trains but work VERY well in everything else within Kerbin SOI and are developing interplanetary travel. What separates us from other companies is that we are developing Kerbin exploration ROVERS. Few in the Space Program community explore Kerbin via train.\u003C/p\u003E\u003Cp\u003EThis will be added to (duh).\u003C/p\u003E\u003Cp\u003EUnited Company Of Locomotive Works\u003C/p\u003E\u003Cp\u003EFormed up from previous locomotive manufacturers, we at the UCLW strive to bring trains back into the public eye.\u003C/p\u003E\u003Cp\u003EThe workhouse of the KSTP, Kerbal Space Train Program, the 4-8-8-4 Bigboy.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ueb3SAu.png?1\u0022 alt=\u0022ueb3SAu.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis gigantic locomotive used to only be in the Knion Kacific, But has been in everyone\u0027s mind. We bring it to space exploration for the rover \u0022Saturn V\u0022 work. \u003C/p\u003E\u003Cp\u003EThe unsung heroes of the railways are shunters. Without them haveing trains would be hard. We revive them and they can be used as low gravity main line engines.\u003C/p\u003E\u003Cp\u003EI present to you the E2!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E This is all I could get from the auto save. I HAD SO MUCH!!!!! What happened was that I had to log in after I press post new, but then it didn\u0027t work. So I popped up a new window to check it. But it did not show up. When I saw this restore auto save I got excited but this is all. I WORKED MRE THAN 3 HOURS, Can this please be fixed? As in haveing to log in after typeing a huge thread and then it not posting. I SWEAR, IT AUTO SAVED MUCH MORE THAN ONCE.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E;.; Sorry for this in spacecraft exchange. It was SUPPOSED to be perfectly related but this happened so yeah.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"}]}