{"TopicId":119773,"ForumId":21,"TopicTitle":"Sojourner LRSV Concept Vehicle","CreatedByName":"FastMINI42","CreatedById":76767,"CreatedDateTime":"2015-08-30T20:47:47Z","PageNum":1,"Articles":[{"CreatedByName":"FastMINI42","CreatedById":76767,"CreatedDateTime":"2015-08-30T20:47:47Z","Content":"\n\u003Cp\u003EThis is the Sojourner, a 47 ton Lander/Rover Science Vehicle. The idea for the design is to be able to land, suck up all the science possible, then drive off to the next biome and repeat. Thus only one vehicle would be needed to gather a whole bunch of science in several biomes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/irkmkuGl.png\u0022 alt=\u0022irkmkuGl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/664Ox1Xl.png\u0022 alt=\u0022664Ox1Xl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oJV6EVZl.png\u0022 alt=\u0022oJV6EVZl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a stock craft, with the exception of the MechJeb module. Here are the .craft Files (with and without MechJeb, and with the lifter):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/so7alxib2bc2h1g/Sojourner.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003ESojourner with MechJeb\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/bwxrbp3lqrwwgkh/Sojourner%20no%20MechJeb.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003ESojourner without MechJeb\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/92gv49m7s3w3dxn/Sojourner%20Lift%20Subassembly.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003ESojourner Lift Assembly\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUnfortunately it\u0027s got ... issues, which is why I\u0027m calling it a \u0022concept vehicle\u0022. I\u0027ve been tweaking and redesigning for a few days, and I\u0027m starting to think it\u0027s an impossible idea and unworkable beyond driving around the launchpad. For now I\u0027m taking a break and going back to my career save (it\u0027s getting frustrating). If anyone has any pointers, ideas, advice, etc., thank-you in advance.\u003C/p\u003E\u003Cp\u003EHere are the issues:\u003C/p\u003E\u003Cp\u003E1) The biggest is that the wheels create a lot of drag in atmosphere (for recovery on Kerbin and I was hoping to take it to Duna eventually) and it tumbles worse than a load of laundry at around 30km. I added the basic fins on the back to try and create some lift, which helps until the lift offsets the drag too much and it tumbles even worse at lower altitudes.\u003C/p\u003E\u003Cp\u003E2) I\u0027ve gotten it to the Mun a couple times, and it uses too much fuel on landing. That might be operator error, though. I think I slow down too early and waste too much fuel holding speed. I added drop tanks to try and decrease mass at landing, which helps some but not much. Although they will probably make landing at Duna harder.\u003C/p\u003E\u003Cp\u003E3) At 47 tons it\u0027s big and heavy, which necessitates an even bigger rocket to get it off the launch pad. I\u0027ve included the lifter I\u0027m using as a separate file, I\u0027ve found it\u0027s easier to edit the vehicle horizontal before putting it vertical and in the fairing.\u003C/p\u003E\u003Cp\u003EAction Groups:\u003C/p\u003E\u003Cp\u003E1. Do all the science!\u003C/p\u003E\u003Cp\u003E2. Delete all the science! (probably a bad idea for an AG, I should remove this one)\u003C/p\u003E\u003Cp\u003E3. Toggle lock on landing gear.\u003C/p\u003E\u003Cp\u003E4. Toggle 6 vertical lifting engines\u003C/p\u003E\u003Cp\u003E5. Toggle 4 horizontal thrust engines\u003C/p\u003E\u003Cp\u003E6. Toggle ladder\u003C/p\u003E\u003Cp\u003E7. Toggle low beams\u003C/p\u003E\u003Cp\u003E8. Toggle high beams\u003C/p\u003E\u003Cp\u003E9. Open/Close service bay\u003C/p\u003E\u003Cp\u003E0. Toggle solar panels\u003C/p\u003E\u003Cp\u003ESome Notes:\u003C/p\u003E\u003Cp\u003ETo land, control by the docking port and use the 6 lifting engines. \u003C/p\u003E\u003Cp\u003ETo take off, first use the 6 lifting engines to gain some altitude. Then switch from the lifting to the thrust engines, pitch up and go until orbit is attained.\u003C/p\u003E\u003Cp\u003EIf too many wheels are broken, the suspension gets squashed and the wheels are not repairable. Lower the landing gear and use AG3 to lift the vehicle and take the load off the suspension.\u003C/p\u003E\n"}]}