{"TopicId":120642,"ForumId":21,"TopicTitle":"Truck and Trailer turned SCUD Missile Launcher","CreatedByName":"AxleMC131","CreatedById":150186,"CreatedDateTime":"2015-09-11T10:32:45Z","PageNum":1,"Articles":[{"CreatedByName":"AxleMC131","CreatedById":150186,"CreatedDateTime":"2015-09-11T10:32:45Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ESo, today my project was building a stock semi-truck and flatbed trailer in KSP.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIt actually worked pretty well, and I\u0027m considering using it in future for something cinematic... Anyway, I realised that - having made it a flatbed to put something on - \u003Cstrong\u003EI didn\u0027t actually HAVE anything to put on it!\u003C/strong\u003E So, I hatched a cunning plan... To turn it into a \u003Cstrong\u003Emobile missile launch base!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ARVimGC.png\u0022 alt=\u0022ARVimGC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is where it becomes no longer stock, because the bright red-and-yellow, 0.313m rocket parts come from my mod \u0022Backyard Rocketry\u0022. The colour may be a little conspicuous for a missile launcher, but hey, I think they look damn cool!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/65GpjCH.png\u0022 alt=\u002265GpjCH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zl9pGr2.png\u0022 alt=\u0022zl9pGr2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TVzHxj7.png\u0022 alt=\u0022TVzHxj7.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9zbjK4o.png\u0022 alt=\u00229zbjK4o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe \u003Cstrong\u003Eflatbed carries two missiles\u003C/strong\u003E, each independently controllable. The missiles are two-stage, fully liquid fuelled rockets with a stupid amount of power. \u003C/p\u003E\u003Cp\u003EIf you want some stats, here are\u003Cstrong\u003E the launch events in terms of approximate time:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E00:00 -\u003C/strong\u003E Decoupler fires, first stage engine fires.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E00:25 \u003C/strong\u003E- Mach 1 achieved.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E00:48 \u003C/strong\u003E- First stage burnout.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E00:50 \u003C/strong\u003E- First stage separation. Second stage engine fires.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E00:57 -\u003C/strong\u003E Mach 3 achieved.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E01:12 \u003C/strong\u003E- Mach 4 achieved.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E01:43 -\u003C/strong\u003E Second stage burnout.\u003C/p\u003E\u003Cp\u003E(These are in real-world stopwatch time, rather than from the game\u0027s MET clock, because my KSP lags a lot, and the game clock runs slow.)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBoth engines are from my Backyard Rocketry mod;\u003C/strong\u003E the first stage (which looks like a tiny RAPIER) is the \u0027Hydra\u0027 Scale Engine Cluster, a 0.625m engine with about 85kN of thrust at launch; the second stage is the smaller \u0027Dragon\u0027 Scale LfOx Engine, a scaled-down LV-T30 with 25kN of thrust.\u003C/p\u003E\u003Cp\u003EBy the time the second stage runs out of fuel, the missile has reached an [orbital] velocity of \u003Cstrong\u003E2050m/s\u003C/strong\u003E, has almost broken out of the atmosphere and is heading for a \u003Cstrong\u003E300\u002B km Apoapsis.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6nue0G9.png\u0022 alt=\u00226nue0G9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith practise, you can probably hit any target on the ground from about 20km away or more - I practised a little by aiming for the Island Runway, and managed to hit the buildings half the time. Not sure how accurate this system would be against airborne targets, or even as an anti-orbital weapon, but you never know!\u003C/p\u003E\u003Cp\u003EAnyway, that\u0027s what I did today in KSP! If anyone wants to make me a target for my SCUD launcher, let me know, and I\u0027ll be sure to send a missile your way. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHappy Rocketeering!\u003C/strong\u003E\u003C/p\u003E\n"},{"CreatedByName":"stratocracy","CreatedById":150914,"CreatedDateTime":"2015-09-11T14:44:22Z","Content":"\n\u003Cp\u003ENice. I like the design and id recommend using smaller decouplers on the missiles to make it look nicer, but thats no big deal.\u003C/p\u003E\n"},{"CreatedByName":"AxleMC131","CreatedById":150186,"CreatedDateTime":"2015-09-12T00:13:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022stratocracy\u0022 data-cite=\u0022stratocracy\u0022\u003E\u003Cdiv\u003ENice. I like the design and id recommend using smaller decouplers on the missiles to make it look nicer, but thats no big deal.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I used the 1.25m decouplers for a reason I\u0027m afraid; I agree it would look far better with the smaller ones, but even with the first-stage engine\u0027s 85kN of thrust, from standstill the missiles don\u0027t get enough speed fast enough to clear the guide rail (as it was the rails were initially parallel with the missiles, but I lowered them to give them room).\u003C/p\u003E\u003Cp\u003EThe decouplers give the missiles a little extra kick on launch, with the 250 \u0022Decoupler Force\u0022 on the 1.25m model. The 0.625m ones only have 15 force, not quite enough to clear the guide rail, hence the choice of part.\u003C/p\u003E\n"}]}