{"TopicId":122839,"ForumId":21,"TopicTitle":"Jak-112 Lamp Post with download.","CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2015-10-12T03:11:28Z","PageNum":1,"Articles":[{"CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2015-10-12T03:11:28Z","Content":"\n\u003Cp\u003EWell, there is a good chance you\u0027ve seen my post of my mission to the Jool system. So I\u0027m sure you know what I\u0027ve been doing with this craft. I\u0027ve got enough info from flying the mission so far to feel confident about releasing the Jak-112 Lamp Post for use by you all. It\u0027s had a few small modifications from the one going on the mission, but they are improvements that I wish I had on my current mission craft. Things like better lighting specifically.\u003C/p\u003E\u003Cp\u003ESo without further a due... I Present the: \u003Ca href=\u0022http://www./download/czdnzdsrbp4ljns/Jak-112_Lamp_Postfixed.zip\u0022 rel=\u0022external nofollow\u0022\u003EJak-112 Lamp Post\u003C/a\u003E \u003Cspan style=\u0022font-size:8px;\u0022\u003E\u0026lt;-download link contains the drive unit and all the modules.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThe Lamp Post drive unit is equipped with 12 Nerv(nuke) rockets to propel it too its destination. It has 2 mining drills inside the umbrella of it\u0027s engines and 18 heavy landing legs for refueling missions on many worlds.(not recommended for atmospheric descent or landing on worlds with higher then 3 m/s2 gravity) Along with the refueling capability, it\u0027s on board IRSU means it can convert those ores strait into fuel. The 6 XL solar arrays help generate the power it needs for mining operations, and the 6 medium radiators help keep the craft from overheating during the long orbital transfer burns.(burns of over 10 minutes will still heat some parts up to near meltdown temp if you stay at full throttle) The Lamp post can connect with any combination of the included modules and is also compatible with other sr. docking port based equipment, like \u003C/span\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/130016-Base-In-A-Box-Expandable-modular-surface-base!\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003ERune\u0027s Base-In-A-Box\u003C/span\u003E\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E. She\u0027s not the most beautiful craft ever made, but she rugged, practical, and has a built in planetary scanner. Now contains proper landing lights.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/Joolomnimissionmodule_zpsurglwvez.jpg\u0022 alt=\u0022Joolomnimissionmodule_zpsurglwvez.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThe fuel module allows the lamp post to fly extended missions by adding what else? More fuel! This simple module has lots of fuel, 2 mono propellant tanks, a remote guidance unit, loads of SAS, power generation, and enough RCS to propel it around under its own steam(orbital maneuvers only folks).\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/Fuelmodule1_zpsfytuehof.jpg\u0022 alt=\u0022Fuelmodule1_zpsfytuehof.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EThe fuel module 0.5 is a half sized version of the fuel module. It carries half of everything, half the fuel, mono propellant, SAS, RCS, and power gen. For when the larger fuel module is more then you need. This module can easily push its self around in orbit as well with it\u0027s RCS and remote guidance unit.\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/fuelmodule2_zpsguaaj39a.jpg\u0022 alt=\u0022fuelmodule2_zpsguaaj39a.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe passanger module comes with all you need to bring 16 kerbins along in confined comfort. It has extra fuel and mono propellant, along with power generation and RCS to push it about. It\u0027s all controlled by its remote guidance unit. This module will keep your kerbins alive while you plan and execute your missions in far flung locations. Be sure to pack the snacks.(snacks not included)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/passengermodule1_zpsxeermrwf.jpg\u0022 alt=\u0022passengermodule1_zpsxeermrwf.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe minitug module. This module contains two minitugs and a central refueling tank. the mini tugs are RCS powered but still have quite a bit of grunt. They get their energy from radioisotope thermalelectric generators, so they have no solar panels to worry about. The central fuel tank has no guidance but does have enough mono propellant for 3 refills. The mini tugs are great for moving about those modules that don\u0027t have their own RCS or guidance units. They tugs are also equipped with both a sr. docking port and a standard docking port for greater versatility.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/minitugmodule1_zpsglxylbhk.jpg\u0022 alt=\u0022minitugmodule1_zpsglxylbhk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Tylo Lander module is a module containing a lander capable of landing and taking off again from worlds with pretty high gravity. It\u0027s descent stage has around 3,200m/s delta-V while it\u0027s ascent stage also has around 3,100m/s delta-V. It can bring down a single Kerbin to explore the surface of the world you land on and has ladders so the kerbin can once again ascend back up into the lander for their return trip. This lander can land on any world that requires no more then 3,000 delta-V to return to orbit. Or has a gravity of no more then 7.85m/s2. This lander is not tested for atmospheric landings. Note: the fore and aft sr. docking ports are to be jettisoned before descending to your world of choice.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/Tylolandermodule1_zpskprjdsrn.jpg\u0022 alt=\u0022Tylolandermodule1_zpskprjdsrn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Lathe plane module contains everything you need to perform a mission to the surface of lathe. The 2 Latheplanes can easily land and ascend from the surface of Lathe even with a water landing. The module will remain in orbit and wait for the return of the two planes when their Lathe mission is over. It is advised to have at least 1 mini tug in attendence to act as a refueling go between for the planes, or to help them get back to the module. The planes themselves are not the easiest to fly, the pontoons cause them to have quite a bit of uneven drag and can cause them to tumble during descent through the atmosphere. Don\u0027t panic though, they can be recovered by getting them to oscillate enough for the SAS to take over and bring them back into proper oriantation. Although, this will probably not happen until you are quite low in the atmosphere... The planes require a speed of below 60m/s for a safe(ish) landing in water. It is recommended to not use any fuel for the entire descent down to water(or land if your lucky). You\u0027ll also want to put the craft into a nose up position just before landing on water to keep it from nosing under on touchdown. For the liftoff, bring the plane up to 35\u002Bm/s on the water and jettison the pontoons, activating the sepratrons at the same time. This will hold the craft above the water and give it enough time to get up to speed to start it\u0027s ascent. Good flying. (skill level: advanced...) \u003Cstrong\u003EWARNING!!! The Lathe Planes on this module are a bust. They are unable to reach orbit again after landing on Lathe. I suggest using this module as a template for making your own Lathe Landers. Sorry about this... \u003C/strong\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003Cstrong\u003E \u003C/strong\u003EThe techniques used on these planes does work though. Pontoon separation still works, and they can still be used as surface exploration craft if needed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/latheplanemodule1_zpst1mezs7t.jpg\u0022 alt=\u0022latheplanemodule1_zpst1mezs7t.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe new Ion satellite module allows you to bring 4 ion powered satellites with you on your mission. These satellites are equipped with around 4k delta-V worth of Xenon for it\u0027s ion engine. They also come equipped with 2 RTG\u0027s, 2 xl solar arrays, and a narrow band scanner to augment the one on the Lamp post. These little guys are great support for your lamp post for finding good sites to land for mining. I only wish I had them for when I started my mission...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/ionsatalitemodule1_zpsfnrdeyrn.jpg\u0022 alt=\u0022ionsatalitemodule1_zpsfnrdeyrn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd finally, the Ion Surveyor module. This module holds a single Ion surveyor for doing independent planetary surveys far from the Lamp Post. It is equipped with both the planetary scanner and the narrow band scanner for a more detailed survey of the planet/moon. It\u0027s 4 Ion thrusters are connected to enough xenon to give the craft nearly 14K delta-V, and it has 4 RTG\u0027s and a pair of xl solar arrays for power along with 1,600 charge worth of batteries. The module isn\u0027t the easiest thing to disengadge from the craft, requiring the activation of the two radial decouplers and then twishing the craft to free it from the module\u0027s cage. The module is a single use module and will no longer be usable once the surveyor is deployed.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1346.photobucket.com/albums/p685/Jakalth/Kerbal%20Space%20Program/ionsurvayermodule1_zpswrl7qd7r.jpg\u0022 alt=\u0022ionsurvayermodule1_zpswrl7qd7r.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI hope you enjoy this craft and hope too see what you all come up with for using this craft.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-13T01:47:48Z\u0022 title=\u002210/13/2015 01:47  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 13, 2015\u003C/time\u003E by Jakalth\u003C/strong\u003E\n\u003Cbr\u003Efixed the download\n\u003C/span\u003E\n"},{"CreatedByName":"Azimech","CreatedById":50750,"CreatedDateTime":"2015-10-12T06:47:45Z","Content":"\n\u003Cp\u003EVery cool!\u003C/p\u003E\n"},{"CreatedByName":"Jakalth","CreatedById":136495,"CreatedDateTime":"2015-10-13T01:43:54Z","Content":"\n\u003Cp\u003EJust a note, the Latheplanes are a bust... They can make landing on Lathe, even though their flight profile is pretty bad, but they are unable to actually lift off and go orbital... My best suggestion is to use that module as a template for your own Lathe based lander/orbiter.\u003C/p\u003E\n"}]}