{"TopicId":123897,"ForumId":21,"TopicTitle":"Land Destroyer (and Frigate)","CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2015-10-28T00:35:54Z","PageNum":1,"Articles":[{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2015-10-28T00:35:54Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/M9rwe\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EA fine set of hardened mobile ground targets to practice ground attacking planes on or even ground to ground fights! \u003C/p\u003E\u003Cp\u003EMods Needed:\u003C/p\u003E\u003Cp\u003EMechjeb\u003C/p\u003E\u003Cp\u003EBDArmory\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EAll the rest is intentionally stock\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ELand AA Destroyer\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eparts: 352\u003C/p\u003E\u003Cp\u003Emass: 122.9 t\u003C/p\u003E\u003Cp\u003E36 x \u0022PAC-3\u0022 missiles, 8 x \u0022Oerlikon Millennium\u0022 Cannon\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ELand GGM Destroyer\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eparts: 460\u003C/p\u003E\u003Cp\u003Emass: 127.6 t\u003C/p\u003E\u003Cp\u003E12 x \u0022PAC-3\u0022 missiles, 8 x \u0022Oerlikon Millennium\u0022 Cannon, 8 x hand made ground to ground missiles (20 parts, 30 km max range if outer engines shut down after launch)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ELand ICBM Destroyer\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eparts: 360\u003C/p\u003E\u003Cp\u003Emass: 137.2 t\u003C/p\u003E\u003Cp\u003E12 x \u0022PAC-3\u0022 missiles, 8 x \u0022Oerlikon Millennium\u0022 Cannon, 2 x hand made ICBMs (can deliver 1.2 tons of warheads anywhere on kerbin)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ELand Frigate\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Eparts: 165\u003C/p\u003E\u003Cp\u003Emass: 56.3 t\u003C/p\u003E\u003Cp\u003E12 x \u0022PAC-3\u0022 missiles, 2 x \u0022Goalkeeper CIWS\u0022 Gatling Cannon\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/3t06i20omhihdd7/Land\u002BDestroyer\u002B%26\u002BFrigate.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/3t06i20omhihdd7/Land\u002BDestroyer\u002B%26\u002BFrigate.zip\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-28T00:38:31Z\u0022 title=\u002210/28/2015 12:38  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 28, 2015\u003C/time\u003E by RuBisCO\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Generalstarwars333","CreatedById":151938,"CreatedDateTime":"2015-10-28T20:25:04Z","Content":"\n\u003Cp\u003EThis sounds cool! How big are they, and what do you use for the wheels/tracks? (I\u0027m on my school computer, so I can\u0027t see anything to do with Imgur at all.) I made a landship of my own using BDArmory and Kerbal Foundries for the wheels and tracks. It\u0027s a mk3 cockpit with a few cargo bays for storage of ammo and batteries with a tail end, and framework built up for weapons. it has a nose battery of ten howitzers, a 15 howitzer broadside, a main armament of 2 super firing abrams turrets, a battery of five fifty cals in front of 4 chainguns below the main armament, two platforms off two the side with a goalkeeper CIWS on each, along with a chain gun facing fore and aft and I believe some fifties, plus two forwards facing vulcan turrets, and two fifties on top of the cockpit. aft of the main turrets are two superfiring oerlikon millennium cannons, and a wheesely jet engine on the tail since with the newer version the 4 large wheels and 2 mole hugeS tracks can only accelerate it at about one meter a second every five weeks. For power, aside from the massive amount of batteries, it has a pair of fuel cell arrays aft, along with some radiators and thermal systems for regenerating armor. I\u0027ve done some attack runs on them without trying to kill them, just seeing their AAA abilities, and they strangely only seem to use their goalkeepers, which have a tendency to fall off. They don\u0027t have missiles because I haven\u0027t used missiles that much, and there honestly isn\u0027t enough space for them. I have another, bigger one with multiple cargo bays that are separate from each other to prevent catastrophic magazine detonation. It\u0027s huge, but I find the prospect of putting ammo and batteries and maybe rtgs in each and every one soul crushing... plus now that I have the maritime pack I no longer have to make platforms on top of the mk3 fuselages. it does mean exposed magazines though...\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2015-10-28T22:43:55Z","Content":"\n\u003Cp\u003EWell the frigate uses 8 giant XL3 wheels and the destroyer uses 16: I tried to stay with as much stock parts are possible, and I had never really used the XL3 for anything before so why not. Top speed is 10-11 m/s on level terrain, climbing speed can get really slow. Use mechjeb to have it run waypoints, turn manually with caution when speed is low: to not blow out the back wheels. \u003C/p\u003E\u003Cp\u003EI recommend putting fuel cells and ammo inside a cargo bay, so that the code will actually protect them from blast via the cargo bay taking the heat, do the same for the probe pod. \u003C/p\u003E\u003Cp\u003EThe Destroyer can often take out 3-4 missiles coming for it at once, the Frigate only 1. Both were designed for AA primarily, the ICBM and GGM were side ideas and can only be fired manually.\u003C/p\u003E\n"},{"CreatedByName":"Generalstarwars333","CreatedById":151938,"CreatedDateTime":"2015-10-29T21:45:15Z","Content":"\n\u003Cp\u003EIf I were to remove the tracks from my landships and replace them with wheels they could probably go a lot faster; I\u0027ve had mobile labs with those wheels get up to 20-40 m/s. the problem is that the CIWS and a few chainguns and fifty cals are mounted on platforms sort of on the tracks. maybe I should just make a new version that is maybe hover or something... I tacked the fuel cells on to the back since they were sort of an afterthought since hey I\u0027ve got some liquid fuel and oxidizer in a part of it not being used and the wheels and tracks use electricity so might as well use those to generate some. the cargo bay was already full. I wish that there were cargo bays for the maritime pack. although the flat, ship hulls provide more room for guns and stuff, all ammo and batteries and stuff has to be placed on the exposed deck or on the sides or maybe underneath it. I used chainguns since they look sort of like a 20mm WWII single mount AA gun. I\u0027m now hyped to play ksp so I can make a better landship with better AA capacity and then do an attack run on it and see how all the guns fire. or maybe make a small, fast land corvette or land sloop with mk2 parts or something that has more AA and maybe some milleniums and goalkeepers. or a flying landship. also, what does GGM mean? (if I seem sort of scatter-brained it\u0027s because ADHD...)\u003C/p\u003E\n"},{"CreatedByName":"RuBisCO","CreatedById":59540,"CreatedDateTime":"2015-10-29T23:18:58Z","Content":"\n\u003Cp\u003EGGM = ground to ground missile.\u003C/p\u003E\n"}]}