{"TopicId":124258,"ForumId":21,"TopicTitle":"The Craft Test Thread","CreatedByName":"Bubbadevlin","CreatedById":136524,"CreatedDateTime":"2015-11-01T23:50:01Z","PageNum":1,"Articles":[{"CreatedByName":"Bubbadevlin","CreatedById":136524,"CreatedDateTime":"2015-11-01T23:50:01Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EOk, so the point of this thread is so that people who want to test craft can find them, and people who need crafts tested can find testers!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EBasically people will say they need this or that tested, and then provide a WIP download link for the craft that needs testing. They should also include needed mods if there are any. People can then test it, and tell them their results!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EI will start this off with a craft that I have needed testing for a long time, found \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0Bz8Cg6FNj53EYno4Z3Q1MTJBYXc/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EHere\u003C/span\u003E\u003C/span\u003E\u003C/a\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E \u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThis is a tank, which has a unique bearing designed to be only one craft, it hopefully will work \u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E (and works for me)\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EI am willing to test any stock craft people have to share!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-02T00:27:17Z\u0022 title=\u002211/02/2015 12:27  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 2, 2015\u003C/time\u003E by Bubbadevlin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Panel","CreatedById":147540,"CreatedDateTime":"2015-11-04T04:08:52Z","Content":"\n\u003Cp\u003EThe bearing works (through witchcraft, apparently) and I found that adding a 2.5m reaction wheel helped with the friction. How does that bearing work, really?\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2015-11-04T09:48:54Z","Content":"\n\u003Cp\u003EIs the tank fully stock? If so, I\u0027ll give it a try.\u003C/p\u003E\n"},{"CreatedByName":"Bubbadevlin","CreatedById":136524,"CreatedDateTime":"2015-11-04T11:39:36Z","Content":"\n\u003Cp\u003EThanks guys!, yes it is stock, and I will explain how it works later today\u003C/p\u003E\u003Cp\u003EAlso this is not just a download-my-craft thing, please feel free to share some of your own crafts for testing\u003C/p\u003E\u003Cp\u003EI promise to test them when I have a chance\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2015-11-04T18:53:53Z","Content":"\n\u003Cp\u003EMovable parts attached to the main craft? Deserves a thread of its own imo.\u003C/p\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-11-04T19:35:09Z","Content":"\n\u003Cp\u003EHere\u0027s a craft I made I\u0027d quite like someone else\u0027s opinion on:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalx.com/Blue_Canary/Fighter-Jet-Thing\u0022 rel=\u0022external nofollow\u0022\u003Ecraft file here\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/U6egdrW.jpg\u0022 alt=\u0022U6egdrW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dppm2Yn.png\u0022 alt=\u0022dppm2Yn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s very fast and maneuverable, although it will completely cease to be an airplane if you try and turn it hard at much above 350-400m/s. It has the range to circumnavigate Kerbin at high speeds and altitudes, but at low altitude drinks up fuel very fast - a by product of it not using any normal fuselage parts at all and so ending up with only 880 units of fuel. Two Mk1 fuselage drop tanks would almost double the fuel load, but I can\u0027t find anywhere to put them because of one of its other problems - very low ground clearance. It also tailstrikes if you\u0027re not careful on takeoff.\u003C/p\u003E\u003Cp\u003ESo, things I\u0027m particularly interested in finding out:\u003C/p\u003E\u003Cp\u003E- What do you think of the crafts flight characteristics? Those big elevons let it turn hard, but also make it a little twitchy IMO.\u003C/p\u003E\u003Cp\u003E- How much of a problem do you think its fuel consumption is?\u003C/p\u003E\u003Cp\u003E- How would you improve this craft? Particularly endurance and undercarriage-wise.\u003C/p\u003E\u003Cp\u003E- Although it\u0027s bone stock, it\u0027d be nice if someone with BDArmory could give me some feedback on its performance in combat. I\u0027ve tried it with BDArmory but I don\u0027t really have much frame of reference to compare it to. If it works well I was thinking it could be an entry for the Top Gun AI challenge, would that be a good idea?\u003C/p\u003E\u003Cp\u003ENotes for anyone who wants to test this: \u003C/p\u003E\u003Cp\u003E- Takeoff gently at at least 50m/s, otherwise a tailstrike is likely.\u003C/p\u003E\u003Cp\u003E- Overheating will blow you up at around 1200m/s at sea level\u003C/p\u003E\u003Cp\u003E- Full deflection turns at over mach 1 at low altitude are very risky.\u003C/p\u003E\u003Cp\u003E- There\u0027s an emergency parachute, you \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Emight\u003C/span\u003E will need it.\u003C/p\u003E\u003Cp\u003E- For long range flight so far all I\u0027ve tried is 21,000m and ~1400m/s at full throttle, at which it can do an eastward situation with a reasonable safety margin.\u003C/p\u003E\n"},{"CreatedByName":"Bubbadevlin","CreatedById":136524,"CreatedDateTime":"2015-11-04T22:29:59Z","Content":"\n\u003Cp\u003EOk I will try to explain this.. my bearing has a core made up of like 20 structural pylons, ya know those really flexy things, arranged in spiral. This means that they can turn quite like a spring, but has a limited rotation range. This part I had before, but because the top part was the same craft as the lower part, all the gear that i placed to stabilize things, they would clip through the craft. This did not happen with me, but with others it did, thats why I wanted people to test it. This new version decouples those gear, which are placed on a hollow ring, meaning that they are NOT the same craft, and DO NOT clip through. \u003C/p\u003E\u003Cp\u003EAnd I will test it immediately Blue Canary ! Just have to say, from first impressions it looks great!!\u003C/p\u003E\n"},{"CreatedByName":"Bubbadevlin","CreatedById":136524,"CreatedDateTime":"2015-11-04T23:13:05Z","Content":"\n\u003Cp\u003EOK so i am done testing and its a great craft!!! Love the turning circle and acceleration, but however I do think that it does not pack enough fuel. As for twitchy, it kinda is at high altitudes, but with fine control it works fine! \u003C/p\u003E\u003Cp\u003ESome of my suggestions are add small struts in the wings, which will help it from self-destructing, and add more fuel. I have examples of what I personally did to solve that in the album For the undercarriage, I just suggest moving it slightly back.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/0Snxq\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-11-04T23:32:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bubbadevlin\u0022 data-cite=\u0022Bubbadevlin\u0022\u003E\u003Cdiv\u003EOK so i am done testing and its a great craft!!! Love the turning circle and acceleration, but however I do think that it does not pack enough fuel. As for twitchy, it kinda is at high altitudes, but with fine control it works fine! \u003Cp\u003ESome of my suggestions are add small struts in the wings, which will help it from self-destructing, and add more fuel. I have examples of what I personally did to solve that in the album For the undercarriage, I just suggest moving it slightly back.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/0Snxq\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/0Snxq\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks, this is all very helpful feedback. What kind of speed can you safely turn at now with the struts?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso something I forgot to mention is the engines require careful management at high altitudes when not at really high speeds to keep them from losing intake air and flaming out assymetrically. Did you encounter this? Also, I notice you put on better intakes, did that help?\u003C/p\u003E\n"},{"CreatedByName":"Bubbadevlin","CreatedById":136524,"CreatedDateTime":"2015-11-04T23:51:16Z","Content":"\n\u003Cp\u003EWell, with the struts I could turn safely at about 500 m/s and with the RAM air intakes i never ran out of air. Did not encounter it with the structural intakes, but I didn\u0027t go above 20 km.\u003C/p\u003E\u003Cp\u003EIf you didnt see, those intakes were kinda put on there BECAUSE I added those fuel tanks, not the other way around \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SaturnianBlue","CreatedById":141267,"CreatedDateTime":"2015-11-05T01:53:54Z","Content":"\n\u003Cp\u003EOo! A nice thread! Here\u0027s one craft that needs testing, my modded space shuttle which uses KJR, proc. parts, tweakscale, IR, and kerbpaint. It is already fully released, but I recognize that there are likely several problems with the craft, which has flown only a few times. A thing to not is that around 7 kilometers there is a lot of pitch toward the ground force, and SAS can\u0027t fully account for this. I\u0027ve put some instructions and notes in the space shuttles dedicated thread \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/138276-SaturnianBlue-s-Space-Transportation-System-Space-Shuttle-%2870-Scale%29\u0022 rel=\u0022external nofollow\u0022\u003Ehere.\u003C/a\u003E \u003C/p\u003E\u003Cp\u003EThe KerbalX download is \u003Ca href=\u0022http://kerbalx.com/SaturnianBlue/STS-Space-Shuttle\u0022 rel=\u0022external nofollow\u0022\u003Ehere.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is an example launch album.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/8SF7d\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"BlueCanary","CreatedById":131301,"CreatedDateTime":"2015-11-06T21:51:20Z","Content":"\n\u003Cp\u003EIt\u0027d be great if someone could try working on some of the issues my new cargo SSTO has, it\u0027s based on the Fireflash from Thunderbirds and can lift 55 tonnes to LKO (so far just in spare fuel, but hopefully when I stick a cargo bay in there it should be able to haul the proverbial Big Red to space reliably).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/M5v774H.jpg\u0022 alt=\u0022M5v774H.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is my first SSTO since 0.90 so I\u0027m really not sure how to optimize it. I need help with finding the best ascent profile, optimizing resource loads, and fixing this massive list of glaring flaws:\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E- It needs new landing gear: \u003C/strong\u003Eright now it just has some U2 style outrigger things because I can\u0027t think of the best placement for the landing gear.\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E- It needs attitude control: \u003C/strong\u003Eright now there are no reaction wheels, only some vernors glued on that aren\u0027t really ideal at all. I need some advice on what would be the best solution.\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E- It needs to catch fire less: \u003C/strong\u003Eright now those canards disintegrate every time on ascent. I tried sticking radiators on them hidden in the front cargo/service bay, it didn\u0027t help.\u003C/p\u003E\u003Cp\u003E \u003Cstrong\u003E- It needs cargo space: \u003C/strong\u003Eright now, there\u0027s only one small cargo bay at the front, which will house the probe core, battery, solar panels etc. I\u0027m still contemplating what\u0027s the best way to put the main cargo bay(s) in.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENotes to potential testers:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETakeoff speed loaded: \u003C/strong\u003E100\u002Bm/s. I recommend going to around 130m/s.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAscent profile: \u003C/strong\u003Ewhat I\u0027ve been doing is staying at sea level to gain a little speed then climbing at 20-30 degrees before levelling to break Mach 1 at 5-6000m and then climbing again to level off and gain speed between 17000 and 25000m. When it started to lose speed I switched rapier modes and pitched up slightly, waiting until the apoapsis got out of the atmosphere. Then, circularize as normal. This is probably not the best ascent profile though - I\u0027ve only flown 2 SSTO flights since 1.0 happened, both today. I\u0027d really like some advice on how to do it better.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFuel loading:\u003C/strong\u003E fully loaded it\u0027s a little front heavy. I usually take some fuel out to get the CoM and CoL closer together, since this also greatly improves flight characteristics by weight reduction. You can fly fully loaded though, it\u0027s just not much fun at all.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFlight characteristics: \u003C/strong\u003EIt\u0027s a little sluggish fully loaded, but when you\u0027ve flown a long way (the non SSTO version can circumnavigate Kerbin easily) and it\u0027s down to about 2/3 to a half of its max fuel, it\u0027s actually quite pleasant to fly, with decent maneuverability and landing speeds around 65-70m/s. Other things you should be wary of are that it takes ages to slow down from high speed flight, which is made more of a problem by the fact it will disintegrate if you turn too hard at supersonic speeds.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAction groups: \u003C/strong\u003E 1: Toggle turbojets 2: Toggle RAPIERs 3: Toggle RAPIER mode 4: Jettison outriggers\u003C/p\u003E\u003Cp\u003EIt\u0027s 133-ish parts. That screenshot is of the non-SSTO version, the only real difference is the SSTO version has rapiers in the rear engine pods.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalx.com/Blue_Canary/Fireflash-SSTO-Prototype\u0022 rel=\u0022external nofollow\u0022\u003Ecraft file here\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"DiamondExcavater","CreatedById":72325,"CreatedDateTime":"2015-11-09T07:14:15Z","Content":"\n\u003Cp\u003EI have a craft named Blister 100 which is within the link in my signature (sorry i am too lazy to repost the link)\u003C/p\u003E\u003Cp\u003Eit is simply an Airbus sonic jet, but i have an issue with reentry where the nose cone over heats, i tried putting radiators, but i was wondering if anyone knew a better way to make the nose...\u003C/p\u003E\u003Cp\u003Elike maybe using a procedural faring or something, but that can be accidentally staged...\u003C/p\u003E\u003Cp\u003Elet me know of any other problems you face with my craft?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlueCanary\u0022 data-cite=\u0022BlueCanary\u0022\u003E\u003Cdiv\u003EIt\u0027d be great if someone could try working on some of the issues my new cargo SSTO\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry it seems the download isn\u0027t working for me, i do suggest if you haven\u0027t already, place some airbrakes, and with a craft i made, i wondered about heat and how nose cones are likely to over heat so you could use a faring, but they don\u0027t look too good and can stage by accident...\u003C/p\u003E\n"},{"CreatedByName":"skepticon","CreatedById":111470,"CreatedDateTime":"2015-11-09T17:37:17Z","Content":"\n\u003Cp\u003EFirst, great idea for a thread!\u003C/p\u003E\u003Cp\u003EI\u0027m working on an SSTO designed to be easy to fly for manual pilots (ie, no mechjeb). Its finished, and I\u0027ve tested it myself, but would like feedback from others on just a couple areas. I should also mention that many parts of this design owe their inspiration to Rune and other SSTO designers. Like the White Dart, this craft splits apart easily into thirds to change out your payload for various uses.\u003C/p\u003E\u003Cp\u003EWhat I want feedback on:\u003C/p\u003E\u003Cp\u003EHow is the positioning and orientation of the cargo bay \u0026amp; docking bay lights? Are they usable for orbital docking?\u003C/p\u003E\u003Cp\u003EHow is RCS performance when performing a docking maneuver?\u003C/p\u003E\u003Cp\u003EGeneral feedback on ease of use or problems encountered is also appreciated.\u003C/p\u003E\u003Cp\u003EFlight instructions:\u003C/p\u003E\u003Cp\u003E1. Press T, Z, Capslock, 1, 4.\u003C/p\u003E\u003Cp\u003E2. Press 4 again as you lift on the runway (flying empty this is about 70m/s). Press G to raise gear.\u003C/p\u003E\u003Cp\u003E3. Accelerate horizontally to 200m/s.\u003C/p\u003E\u003Cp\u003E4. Cycle 4 to raise your inclination to 25 degrees. I recommend very short cycles of about 5 degrees at a time.\u003C/p\u003E\u003Cp\u003E5. At 4,000m press 2. You may or may not drift up to 30 degrees inclination naturally. Its fine either way.\u003C/p\u003E\u003Cp\u003E6. At 25,000m press 3. Your apoapsis indicator should be reading ~60,000m now.\u003C/p\u003E\u003Cp\u003E7. When your apoapsis reaches 71,000m press 3 to kill thrust and set autopilot to Prograde to negate drag.\u003C/p\u003E\u003Cp\u003E8. When you reach apoapsis circularize orbit. 3 can be used in place of X to all thrust quickly.\u003C/p\u003E\u003Cp\u003EControl groups:\u003C/p\u003E\u003Cp\u003E1. Primary air breathers\u003C/p\u003E\u003Cp\u003E2. Secondary air breather/primary vacuum engines\u003C/p\u003E\u003Cp\u003E3. Change mode for 2\u003C/p\u003E\u003Cp\u003E4. Toggle lift control surfaces\u003C/p\u003E\u003Cp\u003E5. Cargo bay \u0026amp; light\u003C/p\u003E\u003Cp\u003E6. Docking bay \u0026amp; light\u003C/p\u003E\u003Cp\u003E7. Solar panel\u003C/p\u003E\u003Cp\u003E8. Start fuel cell\u003C/p\u003E\u003Cp\u003E9. Disembark group - Extend ladder, engage brakes, kill torque, stop fuel cell.\u003C/p\u003E\u003Cp\u003E0. Toggle air intakes\u003C/p\u003E\u003Cp\u003ECraft file: \u003Ca href=\u0022https://drive.google.com/file/d/0B_i9mp_pYiR0MWl4YVdfemVVNFE/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EX55 SSTO Candidate\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IljFW6oh.png\u0022 alt=\u0022IljFW6oh.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-09T17:38:52Z\u0022 title=\u002211/09/2015 05:38  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 9, 2015\u003C/time\u003E by skepticon\u003C/strong\u003E\n\u003Cbr\u003Eforgot the craft file!\n\u003C/span\u003E\n"}]}