{"TopicId":133137,"ForumId":21,"TopicTitle":"Advanced Kerbin Shuttle","CreatedByName":"nestor_d","CreatedById":138673,"CreatedDateTime":"2016-02-28T21:22:22Z","PageNum":1,"Articles":[{"CreatedByName":"nestor_d","CreatedById":138673,"CreatedDateTime":"2016-02-28T21:22:22Z","Content":"\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/h5yD8TT.png\u0022 alt=\u0022h5yD8TT.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EN5 Aerodynamics and Space is proud to introduce its new craft, the Advanced Kerbin Shuttle. This craft can haul 50 tons into orbit with ease (basically whatever you can fit into the cargo bay), and is capable of reaching Munar orbit with lighter cargo.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EKerbal egngineers based their initial designs on the blueprints of the STS and Buran, two shuttles from a far away place called Earth (no one is still sure where the blueprints came from). However, it was decided to add more streamlining to the spaceplane component of the shuttle and greater overall fuel capacity.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003ELike Earth\u0027s STS, the shuttle uses five gimbaling engines and is assisted on liftoff by two dettachable boosters. However, like Buran, it only uses liquid fuel and the main tank also serves as the main booster.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe gravity turn must start almost at launch and the shuttle should be facing up to avoid collisions with the dettachable boosters after separation.  Engines are te be cut off after a high enough apoapsis is reached, and simply let the flight computer follow the prograde vector into the apoapsis for circularisation. Because of its greater fuel load, the main booster and tank can provide thrust well into the flight so separation is only needed before rentry. For a balanced glide into the runway, the deorbit burn must be done while still attached and then all remaining fuel on the shuttle should be transfered to the main booster before separation.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EDownload: \u003Ca href=\u0022https://kerbalx.com/nestor_d/AKS-Reliant\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/nestor_d/AKS-Reliant\u003C/a\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/F60iC/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}