{"TopicId":154093,"ForumId":21,"TopicTitle":"Relay Kesslers","CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2016-12-27T21:42:44Z","PageNum":1,"Articles":[{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2016-12-27T21:42:44Z","Content":"\n\u003Cp\u003E\nEver since I watched Danny\u0027s video about playing around with the relay networks in his first time of 1.2, I have become obsessed with his design that shot off several probes in orbit of the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nI want to expand on this idea, something I like to call \u003Cem\u003ERelay Kesslers\u003C/em\u003E. My dream relay kessler would include about 12-18 probes that include their own reaction wheels, boosters, solar panels, and of course, the relays. This is heavy, RAM intensive, and somewhat impractical if the kessler itself had enough \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E to transport the relays. So far, I have gotten a stable design that only holds six of these probes. I added heat shields and parachutes to go to Eve. They would\u0027ve survived long-term if it weren\u0027t for the gravity smacking them hard enough on the ground to shatter their solar panels.\n\u003C/p\u003E\n\u003Cp\u003E\nSupposing the kessler has enough \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E and torque (for stability) to transfer simplistic relays (just a probe core, solar panels/RTGs, a relay, and possibly a battery just in case)about the Kerbol system would theoretically shave off a large amount of \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E to waste. \n\u003C/p\u003E\n\u003Cp\u003E\nThe biggest challenge I find myself encountering is the means to deploy said relays. Some designs have a structural element on top of the 2.5m probe core and the small girders to hold separators. My latest attempt has simplistic designs encased in stacked 2.5m service bays. These have to be much more simplistic and have huge trouble getting out of the bay, often breaking the solar panels, but it\u0027s lighter. I\u0027m thinking of deploying an empty mothership with several docking ports and launch several of the small probes to dock with it, but then what\u0027s the point of wasting all the time and effort when it can all be in one simple launch?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also been trying to find a career-friendly way to incorporate this \u003Cs\u003Emalicious military and government surveillance device\u003C/s\u003E wonderful way to cross together a DSN. Most importantly, I\u0027d like to stay fully stock.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat do you think of the relay kessler?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/82oTg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/82oTg\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"DrunkenKerbalnaut","CreatedById":169550,"CreatedDateTime":"2016-12-27T21:57:55Z","Content":"\n\u003Cp\u003E\nNot quite sure what you are trying to achieve here. Would you mind linking the video?\n\u003C/p\u003E\n\u003Cp\u003E\nAlso: friggin-A, Bill!\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2016-12-27T22:00:21Z","Content":"\n\u003Cp\u003E\nI assume this Kessler is not the syndrome one but I\u0027d love to learn more about the name.\n\u003C/p\u003E\n\u003Cp\u003E\nUse a core of girders and radially attach the probes to \u003Cem\u003Ethose.\u003C/em\u003E Release is easy and doesn\u0027t require nerve-wrecking building acrobatics either.\n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2016-12-27T23:07:41Z","Content":"\n\u003Cp\u003E\nThe Relay Kessler got its name because I originally intended for the spacecraft to deploy so many satellites that it almost acted like a kessler bomb, hence the boosters/reaction wheels. There\u0027s no video, unfortunately, but I can provide with plenty a picture.\n\u003C/p\u003E\n\u003Cp\u003E\n@Kerbart, I\u0027m pretty sure that\u0027s what my radial design is already doing, but I might be missing something. I should have made the pictures more clear so you could see the components haha!\n\u003C/p\u003E\n\u003Cp\u003E\nMy goal is to engineer a low-cost and lightweight vehicle that can scatter obscene numbers of relays. So far, it\u0027s been restricted to sandbox mode because there\u0027s no technical application to put scientific data on them if a live pilot can record the data and recover it on Kerbin for usually double the value. It\u0027s also quite expensive. I guess a valid use for them besides being little buggers that provide signal would be to map distant planets, but unless the game is modded, has no real use over a Kerbal who can do anything without a signal.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/Ki59g\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/Ki59g\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis album contains a better look at my designs.\n\u003C/p\u003E\n"},{"CreatedByName":"DrunkenKerbalnaut","CreatedById":169550,"CreatedDateTime":"2016-12-27T23:24:11Z","Content":"\n\u003Cp\u003E\nAre the heat shields for landing, or just aero braking? \n\u003C/p\u003E\n\u003Cp\u003E\nLose all the individual heat shields. They can aerobrake together, in a fairing or cargo bay.  Then deploy after you come out of the other side of the atmosphere. Your carrying a lot of extra mass to eve that you don\u0027t have to. \n\u003C/p\u003E\n\u003Cp\u003E\nUnless they are ground relays. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-27T23:24:34Z\u0022 title=\u002212/27/2016 11:24  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 27, 2016\u003C/time\u003E by DrunkenKerbalnaut\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2016-12-27T23:32:49Z","Content":"\n\u003Cp\u003E\nIt was mostly a test to see if they \u003Cem\u003Ecould\u003C/em\u003E make it to the surface of Eve.\n\u003C/p\u003E\n\u003Cp\u003E\nThe heat shields were necessary to protect the child units from the heat. No aerobraking was needed because my orbit before deorbiting was around 95km circular.\n\u003C/p\u003E\n\u003Cp\u003E\nI did try using fairings for each individual relay with RKEE VIII, but they ended up spinning wildly and blowing up.\n\u003C/p\u003E\n\u003Cp\u003E\nThe complex child units won\u0027t fit in a service bay(unless I make a larger version with more thrust to stuff in a fairing, but there\u0027s no way a practical relay should be able to take off from Eve)I\u0027ll , although I\u0027ll try the simple relays in service bays and see how they fare.\n\u003C/p\u003E\n"},{"CreatedByName":"DrunkenKerbalnaut","CreatedById":169550,"CreatedDateTime":"2016-12-27T23:43:39Z","Content":"\n\u003Cp\u003E\nI think I understand now. I did something similar at Duna, but as we both know re-entry heating is a much smaller issue to deal with there. \n\u003C/p\u003E\n\u003Cp\u003E\nSome small seperatrons can slow them down before they reach the hottest parts of the atmosphere, and they are relatively light. \n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2016-12-27T23:51:19Z","Content":"\n\u003Cp\u003E\nThere\u0027s the problem of where to put it, though. With the booster design, the child unit barely has room to spare with three radial chutes and landing gear along with those solar panels. In fact, the RKEE VII child relays\u0027 legs suffered overheating and explosions with the small 1.25m shield. There wouldn\u0027t even be room for the chutes if there weren\u0027t boosters. Perhaps I would replace the Oscar tanks with a small empty fuselage and a separatron underneath? It would be significantly lighter and it\u0027s not like they\u0027re going to take off from Eve with the small spark engines anyways.\n\u003C/p\u003E\n\u003Cp\u003E\nOr, would it be feasible to have the mothership deploy the relays at set intervals to cover more area on the surface(although if I ever get recording equippment it would be entertaining to watch several probes skitter through Eve\u0027s atmosphere at once)? That just gave me a (not so)good idea to deploy paratrooper-like micro rovers. That would be cool.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-27T23:55:04Z\u0022 title=\u002212/27/2016 11:55  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 27, 2016\u003C/time\u003E by Atubara\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DrunkenKerbalnaut","CreatedById":169550,"CreatedDateTime":"2016-12-28T00:54:13Z","Content":"\n\u003Cp\u003E\nI say just keep it simple. If you need them as relays, they would do best in space. But since you want them on the surface...\n\u003C/p\u003E\n\u003Cp\u003E\ndeorbit them at intervals from a mothership. Get just above atmo and launch those suckers retrograde with seperatrons. Really, if you focus on making the probes themselves as small as possible, and aerodynamically stable, all the other issues are the usual stuff (like how much fuel do you need to get there). \n\u003C/p\u003E\n\u003Cp\u003E\nI have a strong suspicion you can save a lot of mass by simply slowing them before re-entry. I\u0027ll test this myself in a few, and show you what I\u0027ve come up with. \n\u003C/p\u003E\n"},{"CreatedByName":"DoctorDavinci","CreatedById":150019,"CreatedDateTime":"2016-12-28T01:00:08Z","Content":"\n\u003Cp\u003E\n147 satellites from a single launch .... I\u0027ll just leave this here:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/w6u0sveGMJk?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"DrunkenKerbalnaut","CreatedById":169550,"CreatedDateTime":"2016-12-28T01:43:17Z","Content":"\n\u003Cp\u003E\nAll one image:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022c6wSJUt.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/c6wSJUt.jpg\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n1- the probe. 8 seperatrons clipped. They deorbit. After the fire is gone, pop the fairing open and deploy chutes. \n\u003C/p\u003E\n\u003Cp\u003E\n2- the mothership with 8 probes. Lots of weight to be saved here, but I just tossed it together. \n\u003C/p\u003E\n\u003Cp\u003E\n3- two radial drogues in action, just after I popped open the fairing. \n\u003C/p\u003E\n\u003Cp\u003E\n4- ready to transmit government secrets. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI call them Bullet Bill(s) \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222902702\u0022 data-ipsquote-contentid=\u0022154093\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482886808\u0022 data-ipsquote-userid=\u0022150019\u0022 data-ipsquote-username=\u0022DoctorDavinci\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n51 minutes ago, DoctorDavinci said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n147 satellites from a single launch .... I\u0027ll just leave this here:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/w6u0sveGMJk?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLike a boss. Good jams, Doc. \n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-01-02T17:34:08Z","Content":"\n\u003Cp\u003E\nThe separatrons work like a miracle on Eve! Still having a few problems with the parachutes because I can\u0027t switch crafts when in the air, so maybe two or three relays actually make it to the surface unharmed. Firing the small boosters lower in the thermosphere sounds ideal, but they usually don\u0027t make it that far before disintegrating.\n\u003C/p\u003E\n\u003Cp\u003E\nI spruced up my original relay kessler with the simplified child units and got my number up to 25 relays, 26 if you count the main core. I would add more but the FPS tanks. My computer runs at a \u003Cem\u003Esmooth 2 FPS \u003C/em\u003Ewhile launching it into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. I\u0027m trying to find a design that holds up to at least six relays that each have at least 3000 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E. The nuclear engines are extremely heavy and taxing on the \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E of the primary rocket that gets them into space. I\u0027ve gotten a stable design that holds six child relays with 200 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E, so I may use that to construct a Kerbin system network in science mode.\n\u003C/p\u003E\n\u003Cp\u003E\nI haven\u0027t found any practical way to use a relay kessler in career mode, especially on hard, but I found that a small relay that can decouple from a main rocket will work for a cheap connection in future missions. It wouldn\u0027t be worth the extra effort if you can\u0027t afford more than thirty parts or anything more than 20,000 funds, though.\n\u003C/p\u003E\n"},{"CreatedByName":"DrunkenKerbalnaut","CreatedById":169550,"CreatedDateTime":"2017-01-02T17:51:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222908133\u0022 data-ipsquote-contentid=\u0022154093\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221483378448\u0022 data-ipsquote-userid=\u0022166128\u0022 data-ipsquote-username=\u0022Atubara\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n10 minutes ago, Atubara said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe separatrons work like a miracle on Eve! \n\u003C/p\u003E\n\u003Cp\u003E\n-snip-\n\u003C/p\u003E\n\u003Cp\u003E\n ...at least 3000 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E. ...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWoohoo!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n5-10 oscar B tanks, or 3-5 toroidal tanks coupled with an \u0022Ant\u0022 or \u0022Spark\u0022 can yield some serious \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E, and relatively lightweight. Maybe not 3000, but I would give a try. if you don\u0027t mind the cost, of course there\u0027s IONs. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhy 3000, btw? That\u0027s a healthy budget for a probe that is -presumably- only doing station keeping and/or parachute landings. \n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-01-02T18:00:09Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to avoid really high-tech stuff like the ions. Really expensive too. if anything, the cheaper and lower tech the better.\n\u003C/p\u003E\n\u003Cp\u003E\nI recognise that it\u0027s a long shot to get 3000 m/s of \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E on a small craft, but it\u0027s just a challenge I\u0027m setting for myself so I can feasibly reach nearly every body in the game with one launch that isn\u0027t an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E or a miner. And plus, it seems like a really kerbal thing to do. No clue why, it seems like something Jeb would plan in his spare time. \n\u003C/p\u003E\n\u003Cp\u003E\nThe boosters could come in handy moving probes for contracts.\n\u003C/p\u003E\n\u003Cp\u003E\nThe more complex child units I used incorporated three oscar tanks and a spark engine. I might try five tanks and see where that goes, but it\u0027s a little bit big to try and fit in a bouquet position. \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/169550-drunkenkerbalnaut/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022169550\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/169550-drunkenkerbalnaut/\u0022 rel=\u0022\u0022\u003E@DrunkenKerbalnaut\u003C/a\u003E, you made an genius design that held eight of the simple probes, so I could feasibly hold four of the booster versions that would remain in space.\n\u003C/p\u003E\n"},{"CreatedByName":"DrunkenKerbalnaut","CreatedById":169550,"CreatedDateTime":"2017-01-02T18:03:02Z","Content":"\n\u003Cp\u003E\nYou could try a nuke \u0027tug\u0027 that only performs ejection burns for the motherships. It gets the package up to speed, then turns around and grabs the next one and some \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E. Lather, rinse, repeat. \n\u003C/p\u003E\n"},{"CreatedByName":"Atubara","CreatedById":166128,"CreatedDateTime":"2017-01-02T18:07:01Z","Content":"\n\u003Cp\u003E\nWould this be something already on the mothership, or might it be dockable? I could probably settle for an upper limit of 500 ms for a child unit (with the oscars and spark engine) if the mothership is refuelable via docking ports, but then that would refute the point of boosters besides moving contracts.\n\u003C/p\u003E\n"},{"CreatedByName":"DrunkenKerbalnaut","CreatedById":169550,"CreatedDateTime":"2017-01-02T18:13:15Z","Content":"\n\u003Cp\u003E\nI meant as a way of transmitting motherships from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E to Eve (or wherever) on the cheap. If you are sending a transfer stage each time, you are throwing away engines. If the same tug does the transfer, then slows back down to re-orbit in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E holding pattern, you are only spending fuel. Twice as much, of course. And added complexity and IRL time requirements, but we\u0027ve all done out math on what\u0027s acceptable in that regard. \n\u003C/p\u003E\n\u003Cp\u003E\nSimply send up a couple hundred liters of \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E on your Launchpad to \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E mothership lifter. When you do the handoff, the tug takes a swig and proceeds to send the package on it\u0027s way. This frees up part count limitations upon mothership arrival, less mass to slow down before entry, etc...\n\u003C/p\u003E\n"}]}