{"TopicId":15556,"ForumId":21,"TopicTitle":"Spec-1 Orbiter - Test Pilots Wanted","CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2012-07-29T09:48:03Z","PageNum":1,"Articles":[{"CreatedByName":"Dizzle","CreatedById":31588,"CreatedDateTime":"2012-07-29T09:48:03Z","Content":"\n\u003Cp\u003EHey guys. I don\\\u0027t usually upload creations, but in this case I need help with something that\\\u0027s sort of beyond my ability.\u003C/p\u003E\u003Cp\u003ESpec-1 is an orbiter designed to orbit basically anywhere but Kerbin (it can do that too, of course, but it would still have an extra stage attached). So far I\\\u0027ve had two successful trips to the Mun, with one going into an equatorial orbit, while the other did some maneuvers trying to establish a polar orbit before saying \u0027screw it\u0027 and returning, because I suck at changing orbital planes. More on that now.\u003C/p\u003E\u003Cp\u003EI want to see if this thing can make it into orbit around Minmus, with enough fuel left over to safely return. Preferably, it would be able to change its plane while on Minmus, doing whatever maneuvers are needed, and return. Since I learned on the Mun that I\\\u0027m not good at plane changes and therefore can\\\u0027t establish an encounter, I\\\u0027d like it if someone with more experience could try it out.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UqWGl.jpg\u0022 alt=\u0022UqWGl.jpg\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELAUNCH PROCEDURE\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EStep 1: Throttle up, SAS on. Launch.\u003C/p\u003E\u003Cp\u003EStep 2: Wait for SRBs to burn out, then stage. SRBs and radial tanks will fall.\u003C/p\u003E\u003Cp\u003EStep 3: Simply wait for the main engine to run out of fuel. In tests thus far, has always gone between 72 and 73 kilometers.\u003C/p\u003E\u003Cp\u003EStep 4: Stage, then immediately begin burning towards 90 until a PE of just above 70km is achieved.\u003C/p\u003E\u003Cp\u003EStep 5: [Mun - wait for Munrise, then burn towards 90 until encounter is achieved.]\u003C/p\u003E\u003Cp\u003EStep 5: [Minmus - Plane change maneuvers, I guess, maybe, then same procedure as Mun, but, uh, for Minmus encounter.]\u003C/p\u003E\u003Cp\u003EStep 5b: It\\\u0027s likely your radial engines will run out of fuel while injecting. Pay close attention and jettison as early as possible.\u003C/p\u003E\u003Cp\u003EStep 6: Standard orbiting procedure.\u003C/p\u003E\u003Cp\u003ESo not much, just want to see if it\\\u0027s capable of making it. It\\\u0027s still in the testing stages, but just be thankful you\\\u0027re not part of the \u003Cem\u003Eearly\u003C/em\u003E testing stages.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/V9MJQ.jpg\u0022 alt=\u0022V9MJQ.jpg\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}