{"TopicId":162230,"ForumId":21,"TopicTitle":"A little SU-27 semi-replica i made.","CreatedByName":"TronX33","CreatedById":109784,"CreatedDateTime":"2017-06-18T00:59:43Z","PageNum":1,"Articles":[{"CreatedByName":"TronX33","CreatedById":109784,"CreatedDateTime":"2017-06-18T00:59:43Z","Content":"\n\u003Cp\u003E\nSo after not playing KSP, I came back, and somehow got the motivation to actually make something. I\u0027ve always liked the sleek looks of the SU-27 and its maneuverability. Now, I call what I\u0027ve created a \u0022semi-replica\u0022 because I didn\u0027t go over measurements and scale them, and the wings are a bit off, the top slope thing is a bit long, the landing gear configuration is wrong, but I think it looks close enough to warrant having the same name. It, just like its real life counterpart, is highly maneuverable with thrust vectoring engines ( I may or may not have abused cubic octagonal struts to put two on each side). However, sharp turns under 90 m/s can stall the plane. Stall recovery is simply, simply don\u0027t touch the controls, turn on the afterburners, and you\u0027ll be good. As the root part is actually a probe core as the cockpit is slanted, crew will not be automatically assigned. To have a cockpit view of the front, your pilot will need to be placed in the second cockpit appearing on the list. If you have two kerbals in the place, click IVA on the second kerbal from the left in the bottom right corner of the screen.\n\u003C/p\u003E\n\u003Cp\u003E\nAction group 1 for the afterburners.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/a/0jQoT\u0022 style=\u0022height:494px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nDL: \u003Ca href=\u0022https://www.dropbox.com/s/ldduz6ydu02h9l8/Su-27.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/ldduz6ydu02h9l8/Su-27.craft?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-18T01:10:36Z\u0022 title=\u002206/18/2017 01:10  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 18, 2017\u003C/time\u003E by TronX33\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TronX33","CreatedById":109784,"CreatedDateTime":"2017-06-18T01:17:27Z","Content":"\n\u003Cp\u003E\nAlso, any constructive criticism is welcome.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are a few issues that I see myself, but I\u0027m unsure as to how to solve them. I would appreciate any insight that more experienced craft builders could offer.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst is the landing gear. I would prefer to have had the large landing gear for the rear, but that causes the plane to not take off, even when the center of lift and mass seemed to be in the correct location. Offsetting it into engine didn\u0027t seem to be enough, sometimes it showed through the top of the wing.\n\u003C/p\u003E\n\u003Cp\u003E\nSecondly, even though I rebuilt the front portion of the plane with structural fuselages instead of empty fuel tanks, its still so heavy that I needed to use cubic octagonal struts to clip another engine into the two existing ones.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother major problem is my method of blending the wing into the cockpit tail thing. As you can see from this picture of the SU-27, the wing and the fuselage blends together smoothly: \u003Cimg alt=\u0022Su27sk_b.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022https://i1.wp.com/su-27flanker.com/wp-content/uploads/2014/10/Su27sk_b.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMy implementation to meel feels sloppy, but the lengths involved were too small for two wing sections to be placed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd of course the wing shape is off and the cockpit hump is too long, but those I can just tinker with and solve. The previous issues are ones that I\u0027m not sure how to fix.\n\u003C/p\u003E\n"},{"CreatedByName":"Joseph Kerman","CreatedById":176176,"CreatedDateTime":"2017-06-19T05:25:12Z","Content":"\n\u003Cp\u003E\nI built an Su-35, not too far off from a 27. Just use a double B tail connector.\n\u003C/p\u003E\n"},{"CreatedByName":"qzgy","CreatedById":160994,"CreatedDateTime":"2017-06-19T15:21:45Z","Content":"\n\u003Cp\u003E\nOk, I took your craft out for a spin. Comments:\n\u003C/p\u003E\n\u003Cp\u003E\nFirst - You really don\u0027t need that  massive landing gear in front. I also moved the back landing gear forward, to help takeoff.\n\u003C/p\u003E\n\u003Cp\u003E\nI also flew it around a bit with F12 on. The front \u0022blending panel\u0022 seems to cause your plane to pitch down. That doesn\u0027t help.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a suggestion - don\u0027t use the giant swept wing panel, try angling the little wing panels. Much more control and less width. Of course, then its angled at the tip, but you can try and put another panel there to help.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, blending isn\u0027t really feasible on this scale in KSP. Best I could do is offset the cockpit slightly into the wings, but nothing really else. You could try radiator panels, but then it bulges out... So I can\u0027t really help you there.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIt does fly really nicely with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E though. Kudos to that.\n\u003C/p\u003E\n"}]}