{"TopicId":165553,"ForumId":21,"TopicTitle":"Battlestar Galactica Viper (Yes, another one)","CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2017-09-16T09:52:39Z","PageNum":1,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2017-09-16T09:52:39Z","Content":"\n\u003Cp\u003E\nThe Viper from Battlestar Galactica, in its many forms, seems to be a popular KSP project. Mine is inspired by the original, and it\u0027s ready to do battle. The only way I could get the wings and fin to look right was to use B9 Procedural Wings. Never have used them before. Still had to stick on some stock parts to properly position the guns. Ammo boxes are stuck to the back wall of the cockpit, inside the structural fuselage. Pop the nosecone off the back for access.\n\u003C/p\u003E\n\u003Cp\u003E\nFor atmosphere use only! Despite its takeoff weight, three Panthers have it in the air fast. Impressively maneuverable despite not using canards. Tends to be a bit fragile when hit by proximity missile detonations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://flic.kr/p/YLhUpv\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm5.staticflickr.com/4347/37257202915_10d6998fa9_z.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u002237257202915_10d6998fa9_z.jpg\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://flic.kr/p/YLhUpv\u0022 rel=\u0022external nofollow\u0022\u003Escreenshot14\u003C/a\u003E by \u003Ca href=\u0022https://www.flickr.com/photos/27748767@N08/\u0022 rel=\u0022external nofollow\u0022\u003Eg_alan_e\u003C/a\u003E, on Flickr\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Galane/Viperish\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Galane/Viperish\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2017-09-17T05:37:30Z","Content":"\n\u003Cp\u003E\nI tried to make a classic Cylon Raider to do battle with but failed miserably. \u003Ca href=\u0022https://pastebin.com/gZ44pCqu\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://pastebin.com/gZ44pCqu\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWeighs a heck of a lot but apparently prefers to try flying upside down. Climbs well but then flips over when reaching the starting point for battle. Pitch control would need cranked down so much it\u0027d likely have very poor maneuverability every way except in roll. Pretty much like the ones on the original TV show. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPerhaps someone more astute with B9 wings can make one for atmosphere only flight, sort of in scale with the Viper. Too bad B9 Wings don\u0027t have a half oval shape to select.\n\u003C/p\u003E\n"}]}