{"TopicId":172739,"ForumId":21,"TopicTitle":"Yes, i know i spelled \u0026quot;Brutus\u0026quot; wrong","CreatedByName":"Victor12","CreatedById":182167,"CreatedDateTime":"2018-03-20T21:58:07Z","PageNum":1,"Articles":[{"CreatedByName":"Victor12","CreatedById":182167,"CreatedDateTime":"2018-03-20T21:58:07Z","Content":"\n\u003Cp\u003E\nAs everyone knows, making history has some huge, new parts. and I\u0027ve been playing around with them, the end result was a rocket that crashed my game... three times (not really). unfortunately, I\u0027m no expert in huge rockets, and there are a stupid amount of wrinkles that have to be ironed out. if you have a strong computer and like a challenge, be my guest.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPS: no, seriously, this thing kills frames\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Victor/The-Brutuse\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Victor/The-Brutuse\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSorry, forgot\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022k1hKovS.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/k1hKovS.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022IwFws5I.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/IwFws5I.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-20T22:38:12Z\u0022 title=\u002203/20/2018 10:38  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 20, 2018\u003C/time\u003E by Victor12\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"He_162","CreatedById":152811,"CreatedDateTime":"2018-03-20T22:19:14Z","Content":"\n\u003Cp\u003E\nYou need screenshots or the common practice around here is to simply ignore the post and not download the craft. People just refuse to take a look unless you show them what they\u0027re getting first.\u003Cbr\u003E\nThat sounded kind of blunt, but I don\u0027t mean to sound harsh, I\u0027m just saying that you won\u0027t get many likes / downloads / comments, etc unless you add a screenshot of your rocket.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo do so follow the instructions below:\u003Cbr\u003E\n-Hit F1 when ingame to take a screenshot of the game (hit F2 before hand to turn off the heads up display for a cleaner screenshot)\u003Cbr\u003E\n-Go to \u003Ca href=\u0022https://imgur.com/\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/\u003C/a\u003E and upload a photo (you don\u0027t need an account for this but its nice to keep all of them under a profile if you upload a lot)\u003Cbr\u003E\n-Go to the photo in imgur, right click and open in new tab.\u003Cbr\u003E\n-Copy the URL\u003Cbr\u003E\n-Paste the URL like so:\u003Cbr\u003E\n\u0022\u003Ca href=\u0022https://i.imgur.com/f4tpHc4.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://i.imgur.com/f4tpHc4.png\u003C/a\u003E\u0022 \u0026lt;--- That link goes to a screenshot of mine, sorry for linking it but I wanted to show you what the link looks like\u003Cbr\u003E\u003Cbr\u003E\nIt should pop up as a screenshot in the editor menu before you even save, rather than a link. If you want it to be a link simply go to the bottom of the photo and hit the \u0022display as link instead\u0022 button.\n\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2018-03-21T01:56:49Z","Content":"\n\u003Cp\u003E\nDidn\u0027t have too much trouble with it.  Stayed about 9 -15 fps in atmo and up to 30 up in orbit with 163 parts left.\n\u003C/p\u003E\n\u003Cp\u003E\nStaging needs to be adjusted, the first set on the upper stack runs out before the center on the lower stack, so staging just separates the still burning lower center, which collides into the rest of it.\n\u003C/p\u003E\n\u003Cp\u003E\nSeems quite a bit overkill, though, especially since there\u0027s no payload.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, why don\u0027t the radial engines fire on the center upper part until the last stage?  By the time you use them, they\u0027re pretty pointless, and until then, they\u0027re just dead weight.\n\u003C/p\u003E\n"},{"CreatedByName":"Victor12","CreatedById":182167,"CreatedDateTime":"2018-03-21T19:17:05Z","Content":"\n\u003Cp\u003E\nIt\u0027s designed to handle a very large space station I\u0027ve been wanting to send into space for a while now, but thanks for the tips! maybe I should just forget about asparagus staging the thing and just make it two stages.\n\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2018-03-21T19:36:42Z","Content":"\n\u003Cp\u003E\nI think asparagus will be fine, just needs some tweaking.\n\u003C/p\u003E\n\u003Cp\u003E\nAlthough since there was no payload, there was \u003Cem\u003Ea lot\u003C/em\u003E of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E left over.  I burned retrograde to de-orbit it, but I just left them running.  About 25km into the atmosphere, it started to gain altitude, and ended up in a 220km x 80km retrograde orbit with enough \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to go to Minmus and back if I wanted.... and that was all with dumping the last stage early.\n\u003C/p\u003E\n\u003Cp\u003E\nFix the staging order, ditch the radial engines on the last stage, and it could be good for you.\n\u003C/p\u003E\n\u003Cp\u003E\nAlthough, since it\u0027s melting your computer as is, I\u0027m not sure how you\u0027re planning on doing it with a large, complex payload...\n\u003C/p\u003E\n"},{"CreatedByName":"Victor12","CreatedById":182167,"CreatedDateTime":"2018-03-23T14:49:50Z","Content":"\n\u003Cp\u003E\nit was melting the computer with the payload, it should get better once it\u0027s out of the atmosphere though.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-23T14:52:39Z\u0022 title=\u002203/23/2018 02:52  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 23, 2018\u003C/time\u003E by Victor12\u003C/strong\u003E\n\u003C/span\u003E\n"}]}