{"TopicId":17636,"ForumId":21,"TopicTitle":"Think Tank for Future KSP Ideas","CreatedByName":"sp_blazer","CreatedById":38958,"CreatedDateTime":"2012-08-23T23:43:56Z","PageNum":1,"Articles":[{"CreatedByName":"sp_blazer","CreatedById":38958,"CreatedDateTime":"2012-08-23T23:43:56Z","Content":"\n\u003Cp\u003EFrom what I have seen, it has been the general norm for fellow Kerbanauts to replicate the doings of the space administration, such as, first trying to get an orbit, then geostationary orbit, and mapping orbits, and space stations, followed by extraterrestrial travel to the Moon\u0027s of the home planet, and as I am very willing to guess, exploration of the rest of the Kerbol system with the release of version 0.17, which is all fine and dandy, but what I want to know is will the evolution of this game, and the way it\u0027s players interact with it affect actual space programs whether they are nationally funded or private companies. My guess is absolutely. With a slightly whimsical but very realistic space simulator it allows the general population of the world to venture into space and bring forth many new awesome ideas for space exploration. What I want to see on this thread is members of the community posting there new innovative ideas for the future of KSP, and maybe even the future of actual space travel.\u003C/p\u003E\u003Cp\u003EFor example, an idea of mine is a comet probe that locks into a comet and rides around the system, asteroidial colonies of Kerbinaughts that hop from asteroid to asteroid mining, and maybe even the establishment of planet busting by the means of erecting large engines on an asteroid, changing its orbit in order to cause it to collide with another planet. These are just a few very quickly thought out ideas, and I would love to see many more\u003C/p\u003E\n"},{"CreatedByName":"Czman007","CreatedById":22578,"CreatedDateTime":"2012-08-24T00:42:17Z","Content":"\n\u003Cp\u003EActually, there is a whole sub-forum for this found here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/forumdisplay.php/41-Suggestions\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/forumdisplay.php/41-Suggestions\u003C/a\u003E\u003C/p\u003E\n"}]}