{"TopicId":181368,"ForumId":21,"TopicTitle":"ADARP KS","CreatedByName":"Cybertron61","CreatedById":194749,"CreatedDateTime":"2019-01-14T00:27:42Z","PageNum":1,"Articles":[{"CreatedByName":"Cybertron61","CreatedById":194749,"CreatedDateTime":"2019-01-14T00:27:42Z","Content":"\n\u003Cp\u003E\nAcademic Developmental Advanced Research Projects Kerbal Space (ADARP KS).  This is a group I am working on building that will combine the wisdom from older retired engineers, pilots, and space scientist to assist the younger generation in testing and building new craft in Kerbal.  It is always fun to fly, and that is why we believe that building and flying designs through Kerbal is a great way to get the new generation of engineers, scientists, and pilots on the best track through a support network of aerospace veteran support.  My area is robotics, so I will assist in adding robotic modules to Kerbal where possible, and I will do my best to raise awareness of science simulation with the older crowd.  We can change the future, we can land on the moon, and we will make it to mars one day, yet; it will take a lot of science and ideas to take game strategy into the reality of planet exploration.  Please join up if you want to be a part of the new Kerbal Space Race.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2019-01-14T01:21:22Z","Content":"\n\u003Cp\u003E\nWelcome to the forum, Cybertron61. \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI do, however, have to remind you of a rule of our forum, which is that pretend companies and countries will not be allowed to get into feuds, cannot hire other players, or take on jobs for them. As odd as it may seem, such \u0022roleplaying\u0022 (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/guidelines/\u0022 rel=\u0022\u0022\u003E2.2.i\u003C/a\u003E) has a history of causing no end of trouble here. But as long as you observe those rules, you should be fine and good luck with your project. \u003C/span\u003E\n\u003C/p\u003E\n"}]}