{"TopicId":18255,"ForumId":21,"TopicTitle":"Corvus Heavy Bomber","CreatedByName":"Krackit","CreatedById":21101,"CreatedDateTime":"2012-08-31T04:32:27Z","PageNum":1,"Articles":[{"CreatedByName":"Krackit","CreatedById":21101,"CreatedDateTime":"2012-08-31T04:32:27Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003ECorvus Heavy Bomber\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI decided to build a fairly large aircraft that was still capable of flight, unlike oh so many failed creations of the past (let us have a moment of silence in remembrance of the dozens of brave test pilots who met their immanent demise..)\u003C/p\u003E\u003Cp\u003EWhat ensued was the usual slapping as many bits together as possible, adding as much power as possible, then refining it down into a (somewhat) practical, yet elegant thing of beauty.\u003C/p\u003E\u003Cp\u003EBehold the Corvus!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i826.photobucket.com/albums/zz185/AesusVaro/screenshot43.png\u0022 alt=\u0022screenshot43.png\u0022\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i826.photobucket.com/albums/zz185/AesusVaro/screenshot44.png\u0022 alt=\u0022screenshot44.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i826.photobucket.com/albums/zz185/AesusVaro/screenshot40-1.png\u0022 alt=\u0022screenshot40-1.png\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t attempted it yet, but I\u0027m fairly certain it can make it across the ocean. It is loaded with fuel and it can carry a decent payload underneath, provided it isn\u0027t placed too far forward. It is not overly maneuverable (for obvious reasons) however it is quite stable. It is front heavy though so it cannot climb steeply and the SAS doesn\u0027t keep it level for long. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003ENow even though it flew nicely, it took a pretty unique modification to get the nose up in the end..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i826.photobucket.com/albums/zz185/AesusVaro/screenshot42-1.png\u0022 alt=\u0022screenshot42-1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFour JellyCubes missiles were strapped on the front half to provide last minute thrust upwards.\u003C/p\u003E\u003Cp\u003ESteps are as such:\u003C/p\u003E\u003Cp\u003E1. Engage engines, brake on the runway for no more than 5 seconds (you\u0027ll know if you wait too long...)\u003C/p\u003E\u003Cp\u003E2. Keep it straight as it accelerates down the runway, hopefully reaching ~90m/s by the end.\u003C/p\u003E\u003Cp\u003E3. Just before it rolls off the end of the runway, engage the missiles (the next stage), and keep the nose slightly up.\u003C/p\u003E\u003Cp\u003E4. Watch that the tail doesn\u0027t make contact with the ground, once you are certain that you\u0027re clear, eject the missiles. (they will have reverse thrust to counter the upward thrust, making them fall off without a problem0\u003C/p\u003E\u003Cp\u003EThat\u0027s all there is to it!\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003ESteps are:\u003C/p\u003E\u003Cp\u003E1. Keep nose up, do NOT descend too quickly!\u003C/p\u003E\u003Cp\u003E2. Try to slow as much as possible without losing altitude.\u003C/p\u003E\u003Cp\u003E3. \u003Cstrong\u003EPray\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E4. If step 3 succeeds and you touch down without all the bright and shiny flashes (often followed closely with catastrophic unresponsiveness of craft), engage the parachute.\u003C/p\u003E\u003Cp\u003EEASY PEASY!*\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*note: author is not held responsible for any catastrophic failures during landing, nor for the fact that he has never successfully landed the craft himself yet still released it to the public\u003C/span\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i826.photobucket.com/albums/zz185/AesusVaro/screenshot59-1.png\u0022 alt=\u0022screenshot59-1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWowwie! What a nice guy, adding this free bonus picture without posting the craft file containing the bombs!*\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E*note: author will post craft file of carpet bomber upon request\u003C/span\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EThe Corvus Mk-II is ready to fly!\u003C/strong\u003E The only difference is that it is far lighter (swapped out rocket fuel for jet fuel as per suggestion) AND as a special bonus, you can LAND it! For real! Intact even! (all instructions for use still apply, although you are able to engage the lift rockets before hitting the end to take off without a problem!)\u003C/p\u003E\u003Cp\u003EThe only mod used is the \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/4542-JellyCubes-Advanced-Weapons-R-D-Weapons-and-Other-Miscellanea\u0022 rel=\u0022external nofollow\u0022\u003EJellyCubes Modular Missile pack\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThanks and enjoy!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-01T16:15:36Z\u0022 title=\u002209/01/2012 04:15  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 1, 2012\u003C/time\u003E by Krackit\u003C/strong\u003E\n\u003Cbr\u003EArmed version is up!\n\u003C/span\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-08-31T05:05:07Z","Content":"\n\u003Cp\u003EThis looks incredibly sexy. Why the standard rocket fuel containers though, opposed to aviation fuel?\u003C/p\u003E\n"},{"CreatedByName":"Krackit","CreatedById":21101,"CreatedDateTime":"2012-08-31T05:24:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cardgame\u0022 data-cite=\u0022cardgame\u0022\u003E\u003Cdiv\u003EThis looks incredibly sexy. Why the standard rocket fuel containers though, opposed to aviation fuel?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m glad you think so! The rocket fuel carries way more, although it is a bit heavier. It lets me fly to far away lands! (totally for exploratory purposes, not bombing or anything sinister like that...)\u003C/p\u003E\n"},{"CreatedByName":"monster727","CreatedById":17896,"CreatedDateTime":"2012-09-01T02:17:19Z","Content":"\n\u003Cp\u003Ebombs please and thankyou\u003C/p\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-09-01T03:21:55Z","Content":"\n\u003Cp\u003EWell if you want more top speed (from the get-go), cutting out the heavier rocket tanks should drop your weight by roughly 25% based on picture estimates.\u003C/p\u003E\n"},{"CreatedByName":"Yuri Kargarin","CreatedById":44758,"CreatedDateTime":"2012-09-01T03:52:42Z","Content":"\n\u003Cp\u003EHoly crap how did that even get off the ground? Oh, wait the instructions are here....\u003C/p\u003E\n"},{"CreatedByName":"Krackit","CreatedById":21101,"CreatedDateTime":"2012-09-01T14:52:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cardgame\u0022 data-cite=\u0022cardgame\u0022\u003E\u003Cdiv\u003EWell if you want more top speed (from the get-go), cutting out the heavier rocket tanks should drop your weight by roughly 25% based on picture estimates.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually they were originally there because I had it using aerospike engines, but a bit of careful tweaking here and there allowed me to switch to plain ole\u0027 atmospheric engines.. Ill give it a try!\u003C/p\u003E\u003Cp\u003EAs for the bombs... Coming right up!\u003C/p\u003E\u003Cp\u003EEdit: I just replaced all the rocket tanks in the middle with jet fuel and actually could complete a landing! I kept the wing tanks the same though because we don\u0027t want those losing fuel mid flight... no sir! But maybe ill try..\u003C/p\u003E\u003Cp\u003EEdit 2: I replaced all of them and it flies beautifully, plus i forgot the engines are super efficient so less fuel isn\u0027t that big of a sacrifice for speed and maneuverability! Ill upload the Mk-II.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-01T15:58:31Z\u0022 title=\u002209/01/2012 03:58  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 1, 2012\u003C/time\u003E by Krackit\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cardgame","CreatedById":12317,"CreatedDateTime":"2012-09-01T18:04:53Z","Content":"\n\u003Cp\u003EGlad my advice could be useful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECan you make an armed Mk. II as well? I\u0027ve always wanted a legitimate carpet-bomber.\u003C/p\u003E\n"},{"CreatedByName":"Krackit","CreatedById":21101,"CreatedDateTime":"2012-09-02T01:40:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cardgame\u0022 data-cite=\u0022cardgame\u0022\u003E\u003Cdiv\u003EGlad my advice could be useful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003ECan you make an armed Mk. II as well? I\u0027ve always wanted a legitimate carpet-bomber.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure thing, but I have zero leisure time for the next couple days, so it might take a bit. \u003C/p\u003E\u003Cp\u003EIf you want to do it yourself, just slap on tons of missile bodies with random fins on them (to allow the missiles fall randomly and spread out) down the very centre fuel tanks then clump them into one stage. Easy peasy! And it should take off nicely still because the payload wont come close to the weight of the Mk. I\u0027s fuel tanks! I would also try to avoid placing too many near the front because it is already a little unbalanced.\u003C/p\u003E\n"}]}