{"TopicId":182698,"ForumId":21,"TopicTitle":"Hypersonic electric propeller plane (Stock)","CreatedByName":"Tyr Anasazi","CreatedById":128051,"CreatedDateTime":"2019-03-07T11:26:30Z","PageNum":1,"Articles":[{"CreatedByName":"Tyr Anasazi","CreatedById":128051,"CreatedDateTime":"2019-03-07T11:26:30Z","Content":"\n\u003Cp\u003E\nHi all,\u003Cbr\u003E\u003Cbr\u003E\nI\u0027ve been away for a while - work, travel \u0026amp; life all conspired to keep me away from Kerbin. I have now returned, and decided to revisit my Spinner M2 craft.\u003Cbr\u003E\u003Cbr\u003E\nI am trying to better understand how these rotors function as speed increases. Aside from craft modifications, I used the console to tweak the lift/drag ratio setting.\u003Cbr\u003E\u003Cbr\u003E\u003Cstrong\u003EThe result is Spinner (pictured below) reaching a hypersonic speed of Mach 5. \u003C/strong\u003E\u003Cbr\u003E\u003Cbr\u003E\nWhile this is not strictly stock as the lift/drag ratio setting has been changed, it shows that there is room for improvement beyond the Mach 2.1 speed this craft achieved last year.\u003Cbr\u003E\u003Cbr\u003E\nWhile typing this post, Spinner continued to accelerate and is currently flying at Mach 5.4 at 17,500m. It\u0027s still climbing. I will leave it flying and see what happens. (Update: it exploded before reaching Mach 5.5)\u003Cbr\u003E\u003Cbr\u003E\nSome observations:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nSpinner achieves top speed with its rotors turning at approximately 470 RPM. Slower and it can\u0027t accelerate, faster and it explodes.\n\u003C/li\u003E\n\u003Cli\u003E\nThe RPM is modulated by changing the blade authority limiter in flight. To do this you have to switch to the props using [ ] and then left-click on the blades.\n\u003C/li\u003E\n\u003Cli\u003E\nAt speeds over Mach 5 the authority limiter of the blades is set to 0.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESpinner rushes into a new dawn approaching Mach 5\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wBAoQvA.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/wBAoQvA.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ESpinner accelerates past Mach 5 while still climbing.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022qIlRJTm.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/qIlRJTm.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"}]}