{"TopicId":186369,"ForumId":21,"TopicTitle":"6 Turning 4 Burning","CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2019-07-14T19:33:59Z","PageNum":1,"Articles":[{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2019-07-14T19:33:59Z","Content":"\n\u003Cp\u003E\nI wanted to build something similar to the Convair B-36 bomber, using stock KSP with the Breaking Ground Expansion.  I also use the Making History Expansion.  The B-36 was a heavy bomber, conceived when jet engines were borderline science-fiction.  The original version had 6 piston engines driving 6 propellers.  Later, when they decided jet engines might work for airplanes, they just tacked four jet engines onto the B-36, on twin-engine pylons towards the wingtips.  So the B-36 ended up having 6 radial piston engines with propellers, and 4 jet engines, hence the phrase \u0022Six Turning and Four Burning!\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a goofy concept, but apparently it actually worked fairly well.  Here\u0027s my attempt at making something similar in stock KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nThe actual B-36 used it\u0027s jet engines for takeoff (after they added them..), but my example is capable of taking off using the propeller engines only.  Each engine has 8 of the \u0022B\u0022 size propellers.  At 1,000M each engine only needs about 15% Torque to maintain max rpm (460).  Turning the torque down to 15% gives me a total Fuel Flow of about (0.25), and a cruise speed of about 125 m/s.  This next shot is at ~4,000M, so the speed is a little slower and the FF is a little lower.  In this shot, I\u0027m at 10% torque, still maintaining 460 rpm.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022pJjyEHgh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/pJjyEHgh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s a shot of \u0022Six Turning Four Burning\u0022.  Running the jet engines greatly improves takeoff performance, and helps zoom you up to altitude.  I have the torque tied to the main throttle, so I\u0027m wasting gas here by running the turboprops at 100% torque- 20% would be plenty to get full power.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00226iJxrcJh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/6iJxrcJh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s a side-view.  As anyone who has built long airliners in KSP can attest, the takeoff can be tricky.  If you rotate too much during takeoff, the tail of the plane hits the runway, usually leaving you with about half an airplane!  On this one, I have the gear mounted low enough I can rotate to about 15 degrees without hitting the tail.  Interestingly, this plane actually flies just fine even after losing everything aft of the wings!  I had some CG/CL issues, which I corrected by adding Canards to the front.  You can\u0027t see the canards because I rotated them into the fuselage, hiding them.  But, they still work (thanks to KSP\u0027s take on aerodynamics), and have enough authority to control the pitch of the plane even after I lose the entire tail during takeoff.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022h1qvtBDh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/h1qvtBDh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2019-07-14T19:50:32Z","Content":"\n\u003Cp\u003E\nHere\u0027s some shots of a MK3 version I built.  This was built earlier than the one shown in the original post.  I didn\u0027t like the look of this fuselage, although it worked fine.  I also had to do the canard trick to balance out CG/CL issues, and then hid them inside the nose.\n\u003C/p\u003E\n\u003Cp\u003E\nWith the trick of hiding the canards inside the nose, if you look close you can still see a little evidence of the canards poking outside the fuselage.  I do this on purpose, because if I hide them all the way, I tend to forget they are there, which causes problems when I\u0027m troubleshooting.  You can hide them all the way inside the fuselage, and they still work just fine.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth of these are tricky to land.  They are not very maneuverable.  Also, I originally used the really small Jet engines, the Juno, because they looked a little more appropriate.  However, the thrust from the Junos was not enough to make any difference, so I went with the next size up.  \n\u003C/p\u003E\n\u003Cp\u003E\nA couple of advantages to using the MK3 form, or I guess disadvantages to using the round form-\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, the MK3 cockpit hold 4 Kerbals, and more important has a useable cockpit view.  The round cockpit (MK1-3) only holds 3 Kerbals, and the view from that cockpit isn\u0027t really useable for flying.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, the MK3 cargo bay looks a little more realistic as a bomb bay.  The round fuselage really doesn\u0027t have anything as cool.  I used the SM-25 Service Module on the round plane in the original post, but it doesn\u0027t look the same.  Also, sometimes when I blow the Service Module\u0027s panels to open it up, my wings blow off too, so that\u0027s a potential problem.  Never had much interest in dropping things just to make explosions anyway.\n\u003C/p\u003E\n\u003Cp\u003E\nThen again, with the new seismic experiments, there\u0027s a legitimate reason for dropping stuff and making explosions.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JhEQPiUh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/JhEQPiUh.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223ucRTUnh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/3ucRTUnh.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2019-07-14T20:01:39Z","Content":"\n\u003Cp\u003E\nHere\u0027s what happens if you rotate too far during takeoff.  I\u0027m not saying it flies great this way (it doesn\u0027t), but it does indeed fly.  Landing is going to be painful, because the main landing gear is gone too.  Anyway, it flies, and actually looks like it\u0027s going to get a little more speed after getting rid of the back of the plane.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ljxsa7vh.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002262.50\u0022 height=\u0022640\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/ljxsa7vh.png\u0022\u003E\u003C/p\u003E\n"}]}