{"TopicId":186663,"ForumId":21,"TopicTitle":"Squid\u0026#039;s Ducted Fan Aircraft Emporium","CreatedByName":"RocketSquid","CreatedById":152665,"CreatedDateTime":"2019-07-24T00:13:24Z","PageNum":1,"Articles":[{"CreatedByName":"RocketSquid","CreatedById":152665,"CreatedDateTime":"2019-07-24T00:13:24Z","Content":"\n\u003Cp\u003E\nA while back, I realized that the structural tubes from Making History were the perfect size to serve as ducts for electric props. While this does not seem to confer the huge thrust increase it does in real life, it does provide a durability increase, as well as making propellers much easier to construct: slap one rotor onto the top internal node, another on the bottom internal node, add some blades, and you have an instant counter-rotating propeller which, as a bonus, can be easily mounted on a servo or have things mounted on it. I immediately made some standardized ones and went to work. I\u0027m going to list these by vehicle type, though some don\u0027t fit evenly.\n\u003C/p\u003E\n\u003Cp\u003E\nColeopters:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nA coleopter is propelled by a single ducted fan, which makes up a significant portion of the craft\u0027s body. In real life, most prototypes have had serious stability problems, but in KSP I\u0027ve found them to be fairly stable.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fT7D2nt.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/fT7D2nt.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nControl summary:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nStaging will toggle the rotor\u0027s torque. The rotors have fairly small motors in them, so if you want to use these on eve it might be a good idea to adjust that.\n\u003C/li\u003E\n\u003Cli\u003E\nThe RPM limit of the rotor is linked to the main throttle, but I\u0027ve found that it\u0027s best to just leave it at max.\n\u003C/li\u003E\n\u003Cli\u003E\nTranslate up/down (by default I/K) is linked to the blade pitch. \n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nFlight instructions:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nTo take off, activate the rotors, activate stability assist, and push the throttle all the way up. You can fiddle around with the blade pitch but both versions should be able to take off with the pitch at the default.\n\u003C/li\u003E\n\u003Cli\u003E\nTo fly, just point it in the direction you want to go. \n\u003C/li\u003E\n\u003Cli\u003E\nTo land, push the blade pitch all the way to 150 and point the craft retrograde. If the coleopter is pointed upwards and the blades are at max pitch, it will descend at a safe speed, and the solar panels will most likely generate more power than the rotors are using. Activating the brakes will halt the rotors and allow it into freefall.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nDownload links, with pictures:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/RocketSquid/Coleopter-mk2\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/RocketSquid/Coleopter-mk2\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/RocketSquid/Big-Coleopter\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/RocketSquid/Big-Coleopter\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nColeoplanes\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nWhile the coleopters proved easy to control, they were not very fast. I attempted to solve this by creating a hybrid between a coleopter and an airplane, which can take off and land like a coleopter and fly like a plane. The resulting vehicle was faster than a coleopter, and far easier to land than an airplane (and for that matter, a rocket), but had a few peculiarities. The most notable of these is that there\u0027s an odd gap where it\u0027s moving too slowly to fly as an airplane and too quickly to move into vertical configuration immediately, so it will go into a spin (or rarely a tumble) for a few seconds until it slows down enough for the reaction wheel torque to overpower the aerodynamic forces.\n\u003C/p\u003E\n\u003Cp\u003E\nNevertheless, I successfully flew it to the island airfield and back, and later flew it a few hundred kilometers overland on Eve. \n\u003C/p\u003E\n\u003Cp\u003E\nIsland: \u003Ca href=\u0022https://imgur.com/a/aiORxS0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/aiORxS0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEve: [coming when I can get the imgur album in the proper order]\n\u003C/p\u003E\n\u003Cp\u003E\nThe controls are the same as for the Coleopters: Stage toggles the rotor, Main throttle regulates RPM, and Translate up/down controls blade pitch. \n\u003C/p\u003E\n\u003Cp\u003E\nAt takeoff, a blade pitch of around 120 is ideal. At max speed, it should be in the 70-80 range. \n\u003C/p\u003E\n\u003Cp\u003E\nTo land, push the blade pitch to 150, and switch the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to retrograde. Depending on the craft\u0027s current speed, it may flip or spin, but will eventually right itself, and unless you are very close to the ground when you do this, it will always land safely.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile it does fly on eve, it is rather slower, and a bit harder to control. I\u0027m working on a second prototype that will work a bit better. Until then, my advice is to get to a high altitude in coleopter mode, and then level out.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/RocketSquid/Coleoplane\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/RocketSquid/Coleoplane\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTiltrotor Airplanes\n\u003C/p\u003E\n\u003Cp\u003E\n[Coming Soon]\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"BigFatStupidHead","CreatedById":44217,"CreatedDateTime":"2019-07-24T00:49:26Z","Content":"\n\u003Cp\u003E\nLooking good!\n\u003C/p\u003E\n"}]}