{"TopicId":190682,"ForumId":21,"TopicTitle":"[WIP/Stock] Skylon prototype SSTO","CreatedByName":"Kerburettor","CreatedById":194580,"CreatedDateTime":"2019-12-29T12:54:08Z","PageNum":1,"Articles":[{"CreatedByName":"Kerburettor","CreatedById":194580,"CreatedDateTime":"2019-12-29T12:54:08Z","Content":"\n\u003Cp\u003E\nHi all,\n\u003C/p\u003E\n\u003Cp\u003E\nI made this\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/OHU3O8TUwcE?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n_______________________________________________________\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EDescription\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a Skylon-like replica. I\u0027m not saying \u0022Skylon replica\u0022 because it doesn\u0027t have the same mass, size and ability to act as a cargo plane. It is merely an attempt at creating something that looks like the Skylon albeit in a twice-as-small version and with downscaled thrust.\n\u003C/p\u003E\n\u003Cp\u003E\nI have eyeballed the angle of the velocity vector - or trajectory - compared to the horizon (which is inappropriately named \u0022Trajectory-Prograde Angle (TPA)\u0022 in the vid - it\u0027s a mistake as prograde doesn\u0027t make much sense during atmospheric flight - but I still don\u0027t know how it is supposed to be named) and estimated it to be approximately 2 degrees at most during the initial ascent phase of a real-life Skylon prototype\u003Csup\u003E1\u003C/sup\u003E. This is ridiculously low and a KSP plane would have run out of fuel before reaching the Karman line if following the same ascent profile, but I guess the real SABRE engine has much more specific impulse than the RAPIER, which can\u0027t be helped. I rather pitch my airplane steeply at first to force a 25° angle and leave the densest part of the atmosphere as soon as possible before lowering the angle slightly to build up speed. I can only accelerate so much and reach a maximum of M\u003Csub\u003E\u003Cspan style=\u0022font-size:125%;line-height:1em;\u0022\u003E∞\u003C/span\u003E \u003C/sub\u003E~ 3.5 before the engines can\u0027t provide enough thrust anymore, then coast at 28~29 km at which point I engage the closed-cycle mode of my RAPIER modules. The oxydizer mass is tuned to be burned along with LH2 and not leave much residual after circularization, or just enough for the reentry burn if all goes well.\n\u003C/p\u003E\n\u003Cp\u003E\nIn order to improve roll stability, I had to give the wings a dihedral angle. But this was unsufficient as the center of mass is just too high and can\u0027t be lowered further due to a lack of room inside the airframe. I had to clip control surfaces inside the middle portion to move the center of pressure up. These control surfaces generate quite a bit of lift, but also significant drag during flight which is detrimental to performance in the ascent phase. I am looking forward to getting rid of them once I manage to lower the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E in later versions.\n\u003C/p\u003E\n\u003Cp\u003E\nAs stated in the video description, this is a first draft and I will improve this preliminary version upon unlocking the last remaining tiers of the tech tree. The fuselage should be wider and taller. It should also include a cargo bay to fulfill the main mission of the aircraft which is crew and payload transportation. With more volume, it can hopefully hold much more propellant and despite a lower T/W ratio (current is 1.09), it would still be greater than the forecasted thrust to weight ratio of its real-life counterpart : with a projected nominal take-off mass of 345 tons and a maximum gross air-breathing thrust of 2700 kN\u003Csup\u003E2\u003C/sup\u003E and assuming that these numbers don\u0027t change much during the air-breathing phase (which is a valid assumption as mass only decreases by at most 6.25% at the end of the A-B phase), the Skylon will at most have a T/W ratio of 0.8, which explains the very shallow ascent profile.\n\u003C/p\u003E\n\u003Cp\u003E\n_______________________________________________________\n\u003C/p\u003E\n\u003Cp\u003E\nIf anyone is interested, I will release a craft file in a near future once I correct a few things and tweak some stuff.\n\u003C/p\u003E\n\u003Cp\u003E\n_______________________________________________________\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EReplica specifications\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPart count: 135\n\u003C/p\u003E\n\u003Cp\u003E\nHeight: 5.0 m\n\u003C/p\u003E\n\u003Cp\u003E\nWidth: 11.8 m\n\u003C/p\u003E\n\u003Cp\u003E\nLength: 41.8 m\n\u003C/p\u003E\n\u003Cp\u003E\nMass: 78.438 tons\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003ESkylon specifications\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EPart count: N\\A\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EHeight: N\\A\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003EWidth (wingspan): 25.4 m\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003ELength: 83.3 m\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003ENominal take-off mass: 345 tons\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n_______________________________________________________\n\u003C/p\u003E\n\u003Cp\u003E\nReferences:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Csup\u003E1\u003C/sup\u003E \u0022Skylon users\u0027 manual\u0022 rev. 2.1 by Reaction Engines\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Csup\u003E2\u003C/sup\u003E \u0022Skylon users\u0027 manual\u0022 rev. 1 by Reaction Engines\n\u003C/p\u003E\n\u003Cp\u003E\nMehta et al. (2015). Skylon Aerodynamics and SABRE Plumes. 20th AIAA International Space Planes and Hypersonic Systems and Technologies Conference\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-29T12:54:28Z\u0022 title=\u002212/29/2019 12:54  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 29, 2019\u003C/time\u003E by Kerburettor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Legolover","CreatedById":202001,"CreatedDateTime":"2019-12-29T14:03:11Z","Content":"\n\u003Cp\u003E\nI like it! How long did it take to make?\n\u003C/p\u003E\n"},{"CreatedByName":"Kerburettor","CreatedById":194580,"CreatedDateTime":"2019-12-29T17:33:16Z","Content":"\n\u003Cp\u003E\nAll things considered, it took me more than a week.\n\u003C/p\u003E\n\u003Cp\u003E\nThe construction process is governed by a lot of trial and error and I wasn\u0027t really sure what I was trying to achieve at first. I knew that I wanted to build a replica of the SABRE engine, being inspired by \u003Ca href=\u0022https://kerbalx.com/Kronus_Aerospace/SABRE-Engine\u0022 rel=\u0022external nofollow\u0022\u003EKronus\u0027 model\u003C/a\u003E which is pretty spot on in my opinion. However, his model suffers from an unhealthy amount of part clipping and I\u0027ve already experienced fiery explosions from sticking a rocket engine on the mounting point of a RAPIER engine or on a grandparent part and moving the rocket around doesn\u0027t solve the conundrum. If I manage to fuse two RAPIER engines together without invoking the Kraken or logically overheating something, be sure that this will be found in the newest version of the Skylon replica.\n\u003C/p\u003E\n\u003Cp\u003E\nAs things went on, I thought the engine began to look the part. I decided to go for it and build the Skylon.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: I\u0027ve got to correct myself a bit. I did manage to stick rockets behind the RAPIERs. You\u0027ve got to place them, translate them backwards until they get inside the RAPIERs and then move them outwards so they don\u0027t aggregate near the center where heat fluxes are tremendous. But the only ones that fit are the Terrier and the Reliant. The Terrier is by far the more economical engine from a fuel consumption point of view, but it isn\u0027t necessarily the most efficient considering its low thrust in vacuum. The Skylon is a heavy beast and 8 times 60 kN is not gonna cut it, plus the fact that you have to carry their dead weight around until they\u0027re being used. It\u0027s not worth the hassle.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-29T17:42:27Z\u0022 title=\u002212/29/2019 05:42  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 29, 2019\u003C/time\u003E by Kerburettor\u003C/strong\u003E\n\u003C/span\u003E\n"}]}