{"TopicId":195538,"ForumId":21,"TopicTitle":"Aergia Space Agency Online Shop","CreatedByName":"Cattette","CreatedById":206142,"CreatedDateTime":"2020-07-11T10:35:08Z","PageNum":1,"Articles":[{"CreatedByName":"Cattette","CreatedById":206142,"CreatedDateTime":"2020-07-11T10:35:08Z","Content":"\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u00225an9plg.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022112.33\u0022 height=\u0022665\u0022 width=\u0022592\u0022 src=\u0022https://i.imgur.com/5an9plg.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EIntroduction\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nThe Aergia Space Agency is a leading international aeronatuics contractor to the Kerbal Space Program. Our mission is to supply the brave Kerbonauts with reliable vehicles to explore the stars with! Our catalogue includes everything from landers, crew capsules \u003Cem\u003E(coming soon)\u003C/em\u003E, launch vehicles \u003Cem\u003E(coming soon)\u003C/em\u003E, space planes \u003Cem\u003E(coming soon)\u003C/em\u003E and much more \u003Cem\u003E(coming soon)\u003C/em\u003E!\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u002231sfxrB.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022755\u0022 style=\u0022width:400px;height:auto;\u0022 width=\u0022755\u0022 src=\u0022https://i.imgur.com/31sfxrB.png\u0022\u003E                  \u003Cimg alt=\u0022SBjwGxY.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002280.40\u0022 height=\u0022964\u0022 style=\u0022width:500px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/SBjwGxY.png\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EVital Info\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAll our crafts so far require \u003Cspan\u003E\u003Cspan\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/182679-19x-restock-revamping-ksps-art-not-compatible-with-110/\u0022 rel=\u0022\u0022\u003EReStock\u002B\u003C/a\u003E.\u003C/span\u003E Though this may be abandoned in favor of fully stock crafts in the future. All our craft files are hosted to the tremendously useful \u003Ca href=\u0022https://kerbalx.com/\u0022 rel=\u0022external nofollow\u0022\u003EKerbalX\u003C/a\u003E website. No plans currently exist to upload these crafts to the Steam Workshop. Finished crafts are posted directly on this page, while work in progress reports can be found in the reply section.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EDesign Philosophy \u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve taken a lot of inspiration from the conceptual spacecrafts of the ESA and CNES. Few of the spacecrafts i build are particularly practical, as i lay most of my focus on aesthetics, but they all tend to be able to do their job at the very least. None of these crafts are made with career or science mode in mind. Any and all practical uses of the vehicles manufactured and designed by the Aergia Space Agency Group is purely coincidental.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:20px;\u0022\u003EThe Shop\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003ELanders:\u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022WfJzMwM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u00221200\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/WfJzMwM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAfter a debate gone violent over the specifications of a standardized lander for the moons of Kerbin went violent, the Aergia Space Agency (ASA) broke away from the National Aerospace Development Group (NADG). The issue at hand was whether an Apollo-style mission, with a separate lander and command and service module or a lander capable of both landing on the lunar surface and returning to the Kerbin surface safely, was the solution for the next generation of lunar landers.\n\u003C/p\u003E\n\u003Cp\u003E\nThe conflict between the two companies eventually escalated into an all-out space race to the Mun.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cq\u003ELECRU\u003C/q\u003E Lunar Crewed Return Unit was the ASA submission into the contest. The ASA subscribed to the belief that a lunar lander should not have to rely on a separate return capsule, but rather that the return capsule should be brought down to the lunar surface. While this lead to an increase in complexity for all the involved mechanisms to combat lunar dust, it did negate the need for a complex and heavy docking system to be hauled back and forth from the lunar surface - a fact that the ASA design completely ignored.\n\u003C/p\u003E\n\u003Cp\u003E\nThe final design has been described as an overly expensive and complex mess with minimal safety systems. The lander has more than enough fuel to land on both the Mun and Minimus and return to Kerbin - it is thusly recommended on the official specifications papers that a large portion of the fuel tanks should be left \u003Cq\u003Emore or less half empty\u003C/q\u003E, something which baffled aeronautic engineers, who never designed their extremely advanced space tech-fuel tanks to hold less than their full capacity worth of fuel on launch.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Cattette/LECRU-Lunar-Crewed-Return-Unit\u0022 rel=\u0022external nofollow\u0022\u003EKerbalX link\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:18px;\u0022\u003ELaunchers: \u003C/span\u003E\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022RUgZ9k5.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022147.63\u0022 height=\u00221200\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/RUgZ9k5.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe Phaidra 3A is a expendable launch vehicle designed by the Aergia Space Agency. After a particularly impressive launch test failure, the name “Phaidra”, meaning “bright”, was coined.\n\u003C/p\u003E\n\u003Cp\u003E\nConsisting of 3 main stages, this rocket can carry ca. 100 t of cargo into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. The upper two stages are designed for vaccum operation, while the first stage is designed for atmospheric operation. The main purpose of this confuguration is to allow long hauls of cargo into other planet systems. The Phaidra 3B launch vehicle is designed with two atmospheric stages, allowing it to launch over 100 t of cargo into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E, albeit it isn’t able to propel it much beyond \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://kerbalx.com/Cattette/Phaidra-LV-3A\u0022 rel=\u0022external nofollow\u0022\u003EKerbalX\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cstrong\u003EI\u0027d love to see what kind of adventures you people bring these crafts on. Feel free to share them!\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-12T20:12:48Z\u0022 title=\u002207/12/2020 08:12  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 12, 2020\u003C/time\u003E by Cattette\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cattette","CreatedById":206142,"CreatedDateTime":"2020-07-11T23:35:08Z","Content":"\n\u003Cp\u003E\nRight now i have a launcher, space station, Eve lander, and a Duna rover in progress. Shown here is an early draft of the Phaidra 3 Expendable Launch Vehicle.\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 data-ratio=\u0022147.63\u0022 height=\u00221200\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221200\u0022 alt=\u0022RtiQ2TO.png\u0022 src=\u0022https://i.imgur.com/RtiQ2TO.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 data-ratio=\u0022147.63\u0022 height=\u00221200\u0022 style=\u0022width:800px;height:auto;\u0022 width=\u00221200\u0022 alt=\u0022GEluSEK.png\u0022 src=\u0022https://i.imgur.com/GEluSEK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI still need to tweak the control system when the launcher is in the very upper atmosphere to aid in prograde burns. While this vehicle can safely carry 100t to low Kerbin orbit, more weight would lead to the lower stage depleting too quickly, which forces the second stage (which performs really badly in the atmosphere) to operate in the upper atmosphere - this more often than not leads to the launch vehicle to reach orbit. Though it more than excels at hauling lighter payloads to far away destinations. I\u0027m thinking a Phaidra 3B Expendable Launch Vehicle would be designed with another second stage engine which is adapted to atmospheric operation to allow for particularly heavy payloads (\u0026lt;100t) to reach \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. This design would obviously not be as efficient in long range voyages however.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-12T12:54:16Z\u0022 title=\u002207/12/2020 12:54  PM\u0022 data-short=\u00223 yr\u0022\u003EJuly 12, 2020\u003C/time\u003E by Cattette\u003C/strong\u003E\n\u003C/span\u003E\n"}]}