{"TopicId":197154,"ForumId":21,"TopicTitle":"[Replica] TMK-2 Akademik Korolev (TMK Landing Version)","CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2020-09-27T10:20:51Z","PageNum":1,"Articles":[{"CreatedByName":"SunlitZelkova","CreatedById":206402,"CreatedDateTime":"2020-09-27T10:20:51Z","Content":"\n\u003Cp\u003E\nTMK (Тяжелый Межпланетный Корабль - Tyazhely Mezhplanetny Korabl or Heavy Interplanetary Spacecraft) was a series of proposals for a crewed interplanetary spacecraft created in the Soviet Union in the late 1950s and the 1960s. The English language literature on the proposals is a little confusing, I have seen the Salyut like TMK-MAVR referred to as TMK-1, TMK-1 described as a different nuclear powered design, and a landing version of the TMK from 1964, despite the \u0022only\u0022 landing variant (according to the English language sources) having been designed in 1966. There is also the TMK-E, which would deliver a vehicle known as the \u0022Mars train\u0022 to the surface, which is sometimes described as having been the main landing proposal, but referred to simply as \u0022TMK\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nFormulation of the proposals took place mostly during the period of the space race before John F. Kennedy proposed the goal of landing a man on the Moon before the end of the 1960s. Sergei Korolev apparently had very strong enthusiasm for the whole undertaking during meetings regarding the design. The schedules produced during planning had the missions taking place in the 70s and 80s. Wikipedia states any landing mission would have launched in 1980, however as far as I know, there was no transfer window during that year, it was in 1981. If it had launched in 1981, it would have ended up taking place simultaneously with the NASA Integrated Program Plan manned mission to Mars proposed by Werner von Braun in 1969. The Mars landing would have been in 1982.\n\u003C/p\u003E\n\u003Cp\u003E\nThe TMK design I have decided to replicate is apparently from 1964, designed by Gleb Maksimov. I am unsure of the specific details of the design, so mine will have a little artistic license as I describe its components (it is not intended to ultra accurate in specifications per say, more for looks and the general configuration, only because of a lack of detailed information).\n\u003C/p\u003E\n\u003Cp\u003E\nThe core of the spacecraft is the docking hub. It connects five nuclear rockets with the crew section. The docking hub has unused docking ports on the sides to allow Soyuz (or for future expeditions, the Progress) spacecraft to visit it while it is in Earth orbit. In real life, all components would have been launched on an N-1 rocket, however, the docking hub was too wide, so I used a Saturn V. The nuclear rockets could in theory be used as nuclear shuttles to the Moon and back (I am actually unsure if it was propelled by nuclear rockets or not, but I have decided to use them). They were launched on N-1s (in the game that is). The crewed section consists, from front to back, the MK Mars lander, a habitation compartment, and the power compartment containing a ring of RTGs around a transfer tube, which leads to the work compartment, which contains facilities for science experiments to be conducted both in interplanetary space and in Mars orbit. Below the work compartment is the Earth return capsule, and below that is another nuclear rocket for Mars departure. Attempting to launch the crew section on an N-1 failed, so I put it on top of my Energia replica. The crew section does not have any engines for use in low Earth orbit, so following the docking of three of the nuclear rockets to the docking hub, the docking hub flew to the crew section and performed all docking maneuvers.\n\u003C/p\u003E\n\u003Cp\u003E\nThe ship carries a crew of six. Three cosmonauts will land, and three will remain in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nHere is what it is based on/supposed to be-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002232-33.jpg\u0022 data-ratio=\u002268.80\u0022 width=\u00221200\u0022 src=\u0022http://epizodsspace.airbase.ru/bibl/tm/2004/10/32-33.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Piwa\u0027s Content - Page 5 - Kerbal Space Program Forums\u0022 data-ratio=\u002259.84\u0022 width=\u0022640\u0022 src=\u0022https://images.vfl.ru/ii/1380953289/c73a35bc/3234282_m.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNuclear rocket docking with the docking hub, late 1980-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u00221dlmm6C.png\u0022 src=\u0022https://i.imgur.com/1dlmm6C.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nCompleted ship in Low \u003Cs\u003EEarth\u003C/s\u003E Kerbin Orbit-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022background-color:#2e3035;color:#ffffff;font-size:16px;\u0022\u003E\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022qmJKpvi.png\u0022 src=\u0022https://i.imgur.com/qmJKpvi.png\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nTMK-2 Akademik Korolev departing \u003Cs\u003EEarth\u003C/s\u003E Kerbin, 1981-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022zyLCFRM.png\u0022 src=\u0022https://i.imgur.com/zyLCFRM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ship in deep space en route to \u003Cs\u003EMars\u003C/s\u003E Duna-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022dpvXheI.png\u0022 src=\u0022https://i.imgur.com/dpvXheI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe ship in \u003Cs\u003EMars\u003C/s\u003E Duna orbit, 1982-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022WxqLi3d.png\u0022 src=\u0022https://i.imgur.com/WxqLi3d.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe MK, designated MK-1, descending towards \u003Cs\u003EMars\u003C/s\u003E Duna-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u00228L8n381.png\u0022 src=\u0022https://i.imgur.com/8L8n381.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMK-1 on the surface of \u003Cs\u003EMars\u003C/s\u003E Duna-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022YyAxiyI.png\u0022 src=\u0022https://i.imgur.com/YyAxiyI.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTMK-2 Akademik Korolev-MK-1 landing site, 1982-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022HFy9hDU.png\u0022 src=\u0022https://i.imgur.com/HFy9hDU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nTMK-2 in orbit around \u003Cs\u003EMars\u003C/s\u003E Duna, 1982. The MK-1 landing site is visible below-\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 alt=\u0022LpqoBsl.png\u0022 src=\u0022https://i.imgur.com/LpqoBsl.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe mission is still in progress and I plan to detail it in a different post in the mission report section.\n\u003C/p\u003E\n\u003Cp\u003E\nI have decided not to upload a craft file for now because it needs a little work. For example adding reaction wheels separate from the one built into the probe core on the nuclear rockets would make maneuvering for docking much easier. I will reply to this thread when it is ready to be uploaded. I will also include performance comments then.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003E\u003Cstrong\u003ESpecifications-\u003C/strong\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nPart count- 242 upon completion of assembly\n\u003C/p\u003E\n\u003Cp\u003E\nLength- 55.8 meters upon completion of assembly\n\u003C/p\u003E\n\u003Cp\u003E\nWidth- roughly 8.4 meters at widest point\n\u003C/p\u003E\n\u003Cp\u003E\nWeight- 208.375 tons upon completion of assembly and fully fueled, however, about half of the five \u003Cs\u003EEarth\u003C/s\u003E Kerbin departure nuclear rocket\u0027s fuel is spent during docking, so the weight is less upon actually completion of assembly. It varies by flight.\n\u003C/p\u003E\n\u003Cp\u003E\nSpecifications for individual components-\n\u003C/p\u003E\n\u003Cp\u003E\nTMK Docking Hub- Height- 6.9 meters, Mass- 13.766 tons, Parts- 30\n\u003C/p\u003E\n\u003Cp\u003E\nSoviet Nuclear Rocket- Height 20.5 meters, Mass- 28.665 tons, Parts- 21\n\u003C/p\u003E\n\u003Cp\u003E\nTMK Crew Section- Height- 28.4 meters, Mass- 51.284 tons, Parts- 107\n\u003C/p\u003E\n\u003Cp\u003E\nThank you for having a look!\n\u003C/p\u003E\n\u003Cp\u003E\nNote (moderator please remove if possible)- I got logged out of the forum after I clicked upload, so if this has appeared twice I entered it again in case it did not go up the last time.\n\u003C/p\u003E\n"}]}