{"TopicId":23041,"ForumId":21,"TopicTitle":"A moon rocket and moon trip walkthrough for newbies. (21.1)","CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-20T06:44:58Z","PageNum":1,"Articles":[{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-20T06:44:58Z","Content":"\n\u003Cp\u003EUpdated once again, to the G model, for 21.1. Some new features. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SWSlGJj.png\u0022 alt=\u0022SWSlGJj.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003ECraft file: \u003C/span\u003E *** OBSOLETE! *** For the new version, go to \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81257-Sandbox-moon-trainer-rocket-for-new-pilots\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E. \u003C/p\u003E\u003Cp\u003EAnd since there seems to be a demand for it, I\u0027ve decided to add a written walkthrough of moon flight. Yes, there are many video tutorials, but some people learn better from a written form, so here goes. First, I will show how to reach Mun, and then I will show that a small adjustment to that technique will allow you to reach Minmus. To keep things simple, I will not use manuever nodes in this explanation, and I will be assuming you already know how to establish Kerbin orbit. (If you do not, see my other ship/tutorial combo: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25008-How-to-reach-orbit-and-a-rocket-that-can-do-it-a-walkthrough-for-newbies\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25008-How-to-reach-orbit-and-a-rocket-that-can-do-it-a-walkthrough-for-newbies\u003C/a\u003E.) \u003C/p\u003E\u003Cp\u003EFrom the pad, set throttle to full and ignite the engines. The ship is balanced so that it will stay pretty close to optimal ascent speed, and you do not need to adjust the throttle again until you are establishing orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NUlHFtv.png\u0022 alt=\u0022NUlHFtv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe first set of boosters will run out and should be ejected, \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HSlyYD6.png\u0022 alt=\u0022HSlyYD6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethen begin your gravity turn at 10-13,000m, and while your exact orbital height is not critical, for complex reasons, lower is better. Let\u0027s use 80,000 for this example. On the way to orbit, the second set of boosters will run out and should be ejected. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/B2RpNg6.png\u0022 alt=\u0022B2RpNg6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6X4RwQp.png\u0022 alt=\u00226X4RwQp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis main stage should have enough fuel to circularize a stable orbit, and begin the transit burn. Now you are ready to depart for Mun. But how to reach it? Many new players make the mistake of aiming straight for Mun and burning the engine, but this neglects to take into account that Kerbin\u0027s gravity will draw the ship away from a straight line, so the following picture shows what happens if you try that. (Mun is at the top in this picture.) \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iKC4WhN.png\u0022 alt=\u0022iKC4WhN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn fact, *every* movement in this game will be a curve, because you are always being affected by the gravity of one body or another, so you need to learn how to make the curves work for you. If you look at that last picture, you will find that the greatest distance that burn was achieving was exactly on the opposite side of the planet from the burn point, so if the ship wants to do that anyway, let it do so instead of fighting it. Begin this burn when you are 180 degrees around Kerbin from the direction you really want to travel. However, if you aim for where Mun is right now while using this 180 correction, you will miss again, as illustrated in the picture below. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3e8msma.png\u0022 alt=\u00223e8msma.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s because it takes about 6 hours to reach Mun\u0027s height, and Mun will have been moving along its orbit in the meantime. I won\u0027t take the time to go into the math, but it turns out that in order guide your ship to where Mun *will* be, you need to aim about 60 degrees ahead of its current position, like this. (In this picture, you can see that I\u0027ve adjusted things so that Mun is about 60 degrees to the right, over by the 2 o\u0027clock position.) \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/voGarso.png\u0022 alt=\u0022voGarso.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI like to line this up as the opposite side from Mun plus 60 degrees, \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/X0ceHqs.png\u0022 alt=\u0022X0ceHqs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ebut it happens to work out that if you look ahead and begin the burn as soon as Mun rises above Kerbin\u0027s horizon, the angles will be just about the same, so many players like to do it that way. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Bcxn9Jn.png\u0022 alt=\u0022Bcxn9Jn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAt any rate, when the time is right, make sure your nose is pointed at the prograde marker and fire the engine at full throttle. The orange tank stage will run out of fuel during this burn, so be ready to eject it and immediately fire the transit stage. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Tv7FkOT.png\u0022 alt=\u0022Tv7FkOT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn map view, watch your apoapsis marker rise until you see this set of symbols appear. The blue circle that says \u0022Mun encounter\u0022 when you float the mouse over it indicates the place where you will leave Kerbin\u0027s influence and enter Mun\u0027s influence, so when you see that maker, turn the engines off, because you are going to Mun today! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5Qnle9N.png\u0022 alt=\u00225Qnle9N.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Don\u0027t worry about the other lines and markers for now. The gold curve indicates the path you will take through Mun\u0027s SOI and the purple path shows what your orbit would look like on the other side of the Mun encounter, if you did nothing during the encounter.) \u003C/p\u003E\u003Cp\u003EYou should now coast with the engines off and enjoy the scenery for a while, and/or fast forward to the good part. Once you enter Mun\u0027s sphere of influence, the map view will change to this display. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LyT4lXz.png\u0022 alt=\u0022LyT4lXz.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENotice that on this path, you will fly past Mun and be thrown out into Kerbin orbit again. Even though you are now under the affect of Mun\u0027s gravity, the speed it took to raise your ship to this altitude is too fast to orbit the Mun, and now that you\u0027ve arrived, you will need to slow down again to establish Mun orbit. For complex reasons we need not go into right now, the most fuel-efficient time to make this slowing manuever is when you reach Mun-periapsis, so wait until that moment, turn your nose toward the retrograde marker, and fire the engine once more. Watch on map view as your projected path line curves down toward Mun, then wraps around it in a closed curve orbit, but keep the engine running until your new periapsis is at the altitude you want to orbit Mun. The lower this orbit is, the less fuel you will use on landing, but also, the lower this orbit is, the faster things will happen and the harder it will be to fly a landing. Since you are new to this, let\u0027s take things easy and set the orbit to 20,000m, like this. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gDVXqKg.png\u0022 alt=\u0022gDVXqKg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhile you will be in a stable elliptical orbit at this point, your altitude will be constantly changing as you move around the ellipse. You can go straight to a landing from an eccentric orbit like this, but it will be easier to do if you circularize the orbit first, so wait until you reach that periapsis, point retrograde once more, and burn until the orbit is circular. It does not need to be an exact circle, though, and if you get the periapsis and apoapsis within a few kilometers of each other, that will be close enough. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oeRlNOU.png\u0022 alt=\u0022oeRlNOU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou are now in a stable orbit at an altitude from which you can see the Munar terrain. You can stay in this orbit as long as you like, enjoying the scenery, because Mun really is one of the more interesting worlds in the game. But as you circle Mun, keep an eye out for a piece of ground that looks pretty flat, and is pretty low (not hills), because those are the easier places to land. In this example you will be circling pretty close to Mun\u0027s equator, and while it is possible to land much farther north or south of that, for right now, let\u0027s keep things simple and try a landing near that equator. It is also possible to land at night, but that\u0027s difficult even for experienced pilots, so don\u0027t try that just yet. \u003C/p\u003E\u003Cp\u003EWhen you have picked out a likely landing spot on the day side and are ready to try a landing, save the game with F5, and if the landing attempt doesn\u0027t go well, load the game with F9. Some players may feel this is cheating, but landing is one of the harder aspects of this game, and while you are learning and practicing it, quickloads will avoid having to fly a whole new ship from Kerbin every time something goes wrong. Anyway, about 1/3rd of an orbit ahead of your chosen landing spot, quicksave, then extend the landing gear. (Note: there is an occasional glitch that causes extended landing legs to fall off of a ship when you load a save, so be sure to save the game first, THEN extend the landing legs.) \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mEFN2pl.png\u0022 alt=\u0022mEFN2pl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen point your nose retrograde and fire the engine, watching on map view as the line of your projected path curves down to intersect the surface, like this: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/P6hGwfs.png\u0022 alt=\u0022P6hGwfs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe most efficient thing to do from this point would be to wait until the last second, burn the engines as hard as possible, and shed all speed just before touching the surface. However, that\u0027s just about impossible to do without crashing, so let\u0027s not try that. Instead, let\u0027s shed half our speed at half our altitude. So at first you will be going around 500m/s at 20,000, so let\u0027s slow to 250m/s at 10,000m, then to 125m/s at 5,000m. There is nothing special or precise about these numbers; I intend them to only be a rough guide. However, you will notice that as you slow, the line of your projected path will curve down, and you won\u0027t be aimed at your intended landing spot anymore. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HIUHPrt.png\u0022 alt=\u0022HIUHPrt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo correct for that, when performing your deceleration burns, aim the nose of your ship a bit above the retrograde marker, like this: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Th6hUT3.png\u0022 alt=\u0022Th6hUT3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis will be applying part of the engine\u0027s thrust to upward motion, slowing your descent rate, and keeping your intended landing point from wandering very far. This is hard to do precisely, but hopefully it will prevent you from accidentally landing in a bad spot. \u003C/p\u003E\u003Cp\u003EAt some point during this descent, the transit stage of my example rocket should run out of fuel, but if it does not, eject it shortly before landing anyway, so that the lander stage will be free to come down on the landing legs. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jAPHmVl.png\u0022 alt=\u0022jAPHmVl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow comes the tricky part. Although you have an altitude meter on the game\u0027s main screen, it reads your height above some abstract \u0022sea level,\u0022 and the ground below your current location may be much higher than that. This is part of the reason you picked a landing spot on the daylit side of Mun; so you can see how close you are to the ground. This will be easier if you have gone to the game\u0027s graphics settings screen and turned on \u0022terrain scatter,\u0022 because that option places random rocks on the surface of Mun which you can watch as you descend. Another useful thing is to switch momentarily to IVA view, because there is a \u0022radar altimeter\u0022 dial on the control console which reads your height above the current ground level, but unfortunately, it only works within the last 3,000m. What I like to do is check that meter, go back to main view, and subtract that radar reading from the main altimeter to get an estimate of my real height above the ground. (Example: if the radar reads 1,500m but the main meter says 2,100m, you will touch Mun\u0027s local surface when the main meter reads 600m.) \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nrexr4n.png\u0022 alt=\u0022nrexr4n.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s time to both shed the last of your lateral speed so that you do not go rolling across the landscape, and to reduce your vertical speed to a rate that will not damage the lander. To do both of those things at once, point your nose directly at the retrograde marker and fire the engine, full thrust at first, and then adjusting throttle up and down as needed. It turns out that if you *keep* pointing at the retrograde marker, it will seem to slide underneath you so that you are coming down almost straight onto it. \u003C/p\u003E\u003Cp\u003EMany players like to turn on the ship\u0027s RCS thrusters to help achieve this alignment, while I and many other players prefer to keep continually steering with the main engine. Also to simplify this part of the flight, I always turn my ship and camera so that the navball is lined up with my main camera view. This way, right and left on the navball are also right and left on the screen, up on the navball is forward, and down on the navball is backward. This is an arbitrary choice that works for me, and I will use it in this tutorial, but you may find another method that works for you. \u003C/p\u003E\u003Cp\u003EBut however you do it, when you see the ground getting close, you should be coming straight down at a descent rate of 10m/s or less, as indicated by this meter. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wCCEhPf.png\u0022 alt=\u0022wCCEhPf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve tried to make this ship damage resistent and crashed it into the surface at 15m/s without harming it, but the slower you can go, the better off you will be. Just before touchdown, if you turn the RCS on and hit the H key, there are several thrusters on the bottom of this lander that will help with last-minute braking. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DE2cSPx.png\u0022 alt=\u0022DE2cSPx.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBy the way, another reason to land in daylight is that your shadow provides an excellent visual indication of your height above the ground. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RAK2LxI.png\u0022 alt=\u0022RAK2LxI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDuring this landing you will be continually steering toward the retrograde marker, watching how close the terrain is, making steering adjustments, watching the descent rate meter, and throttling up and down to keep this descent speed in the safe zone. This can be *extremely* tricky to do, so don\u0027t feel bad if you crash. And even if you do it right, bad luck can still bring you down on a slope or bump and you\u0027ll watch with horror as your ship flips over and explodes. (This is the reason the lander I have made has such a wide shape and landing leg arrangement; it is more stable this way and less likely to tumble.) I myself crashed continuously for 4 straight days when I was learning how to land on Mun, but if you\u0027re patient, keep loading saves, and keep trying, you will figure it out, and there is nothing to compare with the feeling of landing your ship intact on an alien world for the first time. Trust me, it will be worth the frustration. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zDntucS.png\u0022 alt=\u0022zDntucS.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce landed, there are lots fun things you can do. Extend the two ladders with action group 1, and have the guys get out and walk around, jump around, fly around on their RCS packs, and so on. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pOCIfMn.png\u0022 alt=\u0022pOCIfMn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5UV2DHM.png\u0022 alt=\u00225UV2DHM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ETo aid in your explorations, the lander I have made is provided with floodlights for night EVAs, \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/yIjFlXt.png\u0022 alt=\u0022yIjFlXt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand opposite the ladder you will find meters with which to measure the surface gravity and temperature of Mun. (Okay, so the game\u0027s thermometers don\u0027t really work yet, but you can pretend, okay?) \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sNTsbZL.png\u0022 alt=\u0022sNTsbZL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhen your highly trained astronauts have concluded their scientific inquiries (they\u0027re done jumping), it\u0027s time to bring the ship and crew home. (As before, it is advisable to quicksave while you are learning this phase of the mission.) It is always more efficient to take off to the east (as you learned in my orbital tutorial), but that is trickier to do on this launch, because you are not on a level launch pad, and may have landed at any old angle on Mun\u0027s terrain. When you are ready to take off, find east on the navball, throttle up the engine, and turn toward that eastern heading. The ship may heave around a bit and that can be disorienting, so steer by the navball, not by eye, and you should be okay. Now, back when you launched from Kerbin, you had to go straight up to get out of the atmosphere, so that it would not slow you down and waste your fuel. However, Mun does not have an atmosphere, so you can skip that step and start accelerating to the east for orbit right away. All you have to do is aim your nose up a bit to achieve a mimimum altitude of around 5000m so that you don\u0027t hit any hills, and you can go straight into orbit right then and there. Going higher doesn\u0027t hurt, though, so you might as well give yourself a bit of a safety margin in case of mistakes and misfortunes. In this example, let\u0027s aim for an altitude of 10,000m. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/50Z7Czp.png\u0022 alt=\u002250Z7Czp.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bX2l54m.png\u0022 alt=\u0022bX2l54m.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere\u0027s a bit of a trick to leaving Mun. If you chose the wrong direction, Mun might just scoop you up again, \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oYJvph9.png\u0022 alt=\u0022oYJvph9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eor you might find yourself zipping past Kerbin too far or too fast to get home. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/axlvK7D.png\u0022 alt=\u0022axlvK7D.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat you want to do is leave Mun going the opposite direction from the moon so that it can\u0027t grab you again, and shedding as much of its orbital speed as you can so that you fall more directly to Kerbin, but not heading so directly at Kerbin that you can\u0027t slow down in time. It turns out that the most advantageous angle for this departure is about 30 degrees inward from Mun\u0027s orbit, but how do you find that angle? Since Mun rotates on its axis at the same rate that it moves around Kerbin, the map view line of its orbital path always enters and exits the surface of the moon at the exact same spots, and this makes for a handy marker you can use. Zoom out until you see the white line of Mun\u0027s orbit, and when your ship is 30 degrees back from that point, once more aim your nose prograde and burn. Watch the line of your projected path rise and lengthen until it shows an exit of Mun\u0027s SOI. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iA2W2FF.png\u0022 alt=\u0022iA2W2FF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen once more fast forward and/or enjoy the view as your ship coasts for a while. Once you exit Mun\u0027s influence, you will see that your ship is moving on an ellipse that gets somewhat closer to the planet, but doesn\u0027t get very close and still rises back up to Mun\u0027s height. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7ldxjY9.png\u0022 alt=\u00227ldxjY9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou are going too fast to get close to the planet, so point your nose retrograde and fire the engine, as always, watching map view as your path gets close to Kerbin. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Jj8xDRW.png\u0022 alt=\u0022Jj8xDRW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou have a choice at this point. A) You may go straight for a splashdown. If you burn until your periapsis is within 69,000m, you will pass through Kerbin\u0027s atmosphere, and this \u0022aerobraking\u0022 will slow your ship through friction with the air. The effect is tiny at high altitudes and it would require many passes to slow to a landing, but if you set your periapsis to 31,000 or less, the aerobraking effect will be so strong that the ship will not emerge from the atmosphere at all. But passing through the atmosphere even a little bit will *eventually* slow your ship until it falls to a landing. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/J9xxDVU.png\u0022 alt=\u0022J9xxDVU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Note: currently, the map display does not take aerobraking into effect, so this ship on the path in the picture above WILL go straight to a splashdown, even though the map view shows a path continuing back into space.) \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E However, in this version of my moon rocket design, I have given you enough fuel to pause at Kerbin orbit, if you wish. In that case, you would want to set your Kerbin periapsis above the atmosphere (70,000m\u002B), and perform an orbital insertion brake once there. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KyChJcW.png\u0022 alt=\u0022KyChJcW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Note: Landing at higher lattitudes on Mun requires more fuel, and may not allow for a Kerbin orbit upon return. If so, just use the direct-to-aerobrake return path from Mun, since the ship should have enough fuel for that.) \u003C/p\u003E\u003Cp\u003EAt some point during the return leg of the journey, the outer 4 fuel tanks will be exhausted and should be ejected. The remaining core of the ship \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Ks2PPE2.png\u0022 alt=\u0022Ks2PPE2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ecan use any remaining RCS fuel as emergency propulsion. \u003C/p\u003E\u003Cp\u003EThe advantage to pausing at Kerbin orbit on the way home is that you can practice trying to bring the ship down at a specific location. This is another thing that is difficult even for experienced pilots, though, because, as I noted, the map does not show the effects of aerobraking. So if you want to practice this, it would be a good idea to once more quicksave before attempting the landing. The capsule will most likely be safe coming down even over mountains, but it is safer to aim for low plains or the sea. But when you are ready to try, point retrograde and fire the engine once more, being sure to aim some distance past your target landing spot to allow for aerobraking. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/k4Y1O65.png\u0022 alt=\u0022k4Y1O65.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(This is me, missing KSC by a big margin. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E ) \u003C/p\u003E\u003Cp\u003EOf course, when you are ready to land, you should eject the lander stage of the ship and ride the rest of the way on the capsule alone, since the capsule will fall more slowly and safely without this mass that it no longer needs. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jU6naPl.png\u0022 alt=\u0022jU6naPl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe parachute knows the proper altitudes at which to open, so that it is never too early in the descent to activate it. You may try to fine-tune your landing location by opening the chute earlier or later. However, it can be *too late* to open the chute, so I advise opening it at 3500m or higher, which should be good even over Kerbin\u0027s highest mountains. (Thrill seekers: over water you can activate the chute as low as 300m and it will still open in time. Probably.) \u003C/p\u003E\u003Cp\u003EAt any rate, once the ship has landed on water or ground, you have completed your first full and successful Mun mission. You can \u0022end flight\u0022 the capsule to celebrate and go on to greater exploits. Or just go to Mun again. It\u0027s a pretty cool place. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6s6Uoc6.png\u0022 alt=\u00226s6Uoc6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJust about any ship that can reach Mun can also reach Minmus. Use the same method outlined above to burn for a Minmus transit. However, there\u0027s a complication. Minmus is in an inclined orbit, meaning that it bobs first above and then below Kerbin\u0027s equator, as you can see from this zoomed out map view. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WAIx5NU.png\u0022 alt=\u0022WAIx5NU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESometimes Minmus will be close enough to the equator that you get an intercept anyway, but if your Minmus transit burn goes all the way to the orbital altitude of Minmus, but the intercept symbols have not appeared, stop the burn at that point and pan the camera around to see if your path is going to pass north or south of Minmus\u0027 orbit. If you are going to pass north of the moon (as I am in the following example pictures), wait until you are halfway there, point the nose of your ship due south and burn the engine (if you are going to pass north, burn south), watching to see if this brings your path up to a Minmus intercept. (It might not. Minmus is tricky.) In this example, my ship would pass to the north of Minmus if I did not make a correction burn. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OKAWGzu.png\u0022 alt=\u0022OKAWGzu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut after a correction burn, you can see that an intercept has been achieved. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vjZkppQ.png\u0022 alt=\u0022vjZkppQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe actual landing on Minmus is essentially the same as landing on Mun, though be careful! Minmus is so much smaller and its gravity is so much weaker that you can easily over-power manuevers and send the rocket zipping around like a meteor. Be patient and take things slowly, with burns at low throttle. One big advantage of landing on Minmus, though, is that its frozen seas are perfectly flat and exactly at sea level, so that the main altimeter will give you a proper height above ground reading. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/tWiQLI6.png\u0022 alt=\u0022tWiQLI6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EReturn from Minmus also requires the same method as returning from Mun, though you may end up approaching Kerbin at an incline. This is harmless. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fhZeH7t.png\u0022 alt=\u0022fhZeH7t.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn closing, this is the fourth version/improvement of my moon rocket designs, which have been extensively tested not only by myself, but through more than 3100 player downloads. I hope the ship and this walkthrough are helpful. \u003C/p\u003E\u003Cp\u003EADDENDUM: The G model has a flight abort system which should allow the crew to return home alive despite a launch mishap. Should something go wrong during the ascent to orbit, hit the abort button to shut down the main engines and launch the lander as its own vessel. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/iGl0QEA.png\u0022 alt=\u0022iGl0QEA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce the lander is safely away from the rest of the ship, hit action group 0 to eject the lander stages and free the capsule. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PsODATY.png\u0022 alt=\u0022PsODATY.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EDisclaimer: Nitpickers! Don\u0027t even start! I KNOW this isn\u0027t an efficient ship, and I KNOW these methods are not the most efficient. My ONLY priorities are that the ship be reliable and easy to fly, not run out of fuel while a newbie fumbles around a bit, and that the instructions be clear and sound.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-26T20:20:18Z\u0022 title=\u002205/26/2014 08:20  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 26, 2014\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Custard Donut (In Space)","CreatedById":58058,"CreatedDateTime":"2013-04-20T08:27:01Z","Content":"\n\u003Cp\u003EThis is great thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027ve gotten to the Mun and even Eve but in very haphazard and unprofessional ways, during stage transfer i sometimes lose bits and pieces i wasn\u0027t supposed to lose, find out i ejected my landing legs along with spent fuel tanks and having to land sideways, that kind of thing, i hope to learn more from inspecting this rocket.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T08:33:03Z\u0022 title=\u002204/20/2013 08:33  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by Custard Donut (In Space)\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Custard Donut (In Space)","CreatedById":58058,"CreatedDateTime":"2013-04-20T10:02:45Z","Content":"\n\u003Cp\u003EDeleted duplicate post.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T11:21:58Z\u0022 title=\u002204/20/2013 11:21  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by Custard Donut (In Space)\u003C/strong\u003E\n\u003Cbr\u003EDeleted duplicate post.\n\u003C/span\u003E\n"},{"CreatedByName":"Custard Donut (In Space)","CreatedById":58058,"CreatedDateTime":"2013-04-20T10:09:11Z","Content":"\n\u003Cp\u003EWell i got to the Mun safely enough, the arrangement of the landing gear was just phenomenal, i came in to land at an awful angle yet i remained magnificently upright, that\u0027s my favourite part of the ship.\u003C/p\u003E\u003Cp\u003EHaving said that, i\u0027m a bigger noob than most and i\u0027m afraid i burnt up more than even your generous allowance of fuel allowed, i ended up orbiting Kerbin with empty tanks, i think my poor navigation skills were also to blame as i landed on the farther side of the Mun where Kerbin is not visible, and i\u0027m guessing it forced me to use even more fuel on the return journey.\u003C/p\u003E\u003Cp\u003EOh i\u0027m also not used to having to watch my engine heat in case they blow up, that was a new one for me lol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAll in all i\u0027d say i was most impressed with the landing gear, i believe someone of normal levels of competence would have been able to get back to Kerbin just fine, i\u0027m just not very good yet.\u003C/p\u003E\u003Cp\u003ELanding on a not very interesting part of the Mun:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022\u0022 alt=\u0022p\u0026gt;\u0026lt;p\u0026gt;\u0026lt;img src=\u0022\u003E\u003C/p\u003E\u003Cp\u003EOrbiting Kerbin with empty tanks:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022\u0022 alt=\u0022\u0026lt;a  href=\u0022\u003E\u003Cimg src=\u0022%7Boption%7D\u0022 class=\u0022ipsImage\u0022 alt=\u0022%7Boption%7D\u0022\u003Ehttp://i1310.photobucket.com/albums/s656/Sancho545/Mun_zps72f55f42.png\u0027 alt=\u0027Mun_zps72f55f42.png\u0027\u0026gt;\u003C/p\u003E\u003Cp\u003EThank you for the rocket design it gave me some great ideas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-04-20T11:41:51Z\u0022 title=\u002204/20/2013 11:41  AM\u0022 data-short=\u002211 yr\u0022\u003EApril 20, 2013\u003C/time\u003E by Custard Donut (In Space)\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-21T03:17:30Z","Content":"\n\u003Cp\u003EI\u0027m very glad my ship was helpful to you. Its design is stable on landing because I was a very bad pilot when I was first learning the game, and I *HAD* to figure out how to keep the danged things from flipping over when I violently bashed them into some poor, unsuspecting moon. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EÃ£â‚¬â‚¬\u003C/p\u003E\u003Cp\u003EIncidentally, it doesn\u0027t take any more fuel to land on one side of the moon than the other. Keeping your fuel use within acceptable limits is just a matter of practice.\u003C/p\u003E\n"},{"CreatedByName":"Red Jester","CreatedById":59081,"CreatedDateTime":"2013-04-21T13:47:50Z","Content":"\n\u003Cp\u003EI can vouch for Vanamonde\u0027s design, as it got me out of some hot water a while back. I\u0027d post the link, but the Great Forum Wipe of \u002713 has eliminated the thread \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Custard Donut (In Space)","CreatedById":58058,"CreatedDateTime":"2013-04-21T22:08:25Z","Content":"\n\u003Cp\u003EI just noticed something very strange, you see the first screenshot of the rocket at the start of the thread? Where the smaller white fuel tanks are underneath the larger orange tanks? Well i am almost convinced that my download of the rocket had those smaller tanks on top of the orange ones, hence why i had to watch the overheating so much, as i know the reason for the smaller fuel tanks there is to lessen the effects of overheating.\u003C/p\u003E\u003Cp\u003EI may be wrong of course, it\u0027s been a long day, but i\u0027m almost certain the rocket i downloaded had the smaller tanks on top of the orange ones, if it\u0027s not like that i better go check i\u0027m not going insane lol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-22T00:03:59Z","Content":"\n\u003Cp\u003EOh, sorry. I am reconstructing threads lost in the forum implosion, so some of the screenshots may be of slightly earlier versions of the ship. I thought I had matched that pic up, but you\u0027re not crazy, it may be of a slightly earlier version of the design. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E However, it\u0027s a good idea to throttle back slightly so as not to lose any extra fuel fighting air resistence low in the atmosphere, so you lose nothing by throttling back slightly for the additional reason of preventing Mainsail overheats.\u003C/p\u003E\n"},{"CreatedByName":"Master_Cheez","CreatedById":60352,"CreatedDateTime":"2013-04-25T01:40:28Z","Content":"\n\u003Cp\u003EGreat design! I like the lander, and can\u0027t wait to download it.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-23T04:24:47Z","Content":"\n\u003Cp\u003ETested in .20, still works. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-26T09:21:56Z","Content":"\n\u003Cp\u003EI\u0027ve made a new version that flies better, and added a written walkthrough. I hope it is helpful.\u003C/p\u003E\n"},{"CreatedByName":"Therm4l","CreatedById":67776,"CreatedDateTime":"2013-05-31T21:52:30Z","Content":"\n\u003Cp\u003EAll that I can say, is thank you, not only did I got to go to the mÃƒÂ¼n is this great rocket, but teached me to make more succesful mÃƒÂ¼n rockets\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-01T03:32:49Z","Content":"\n\u003Cp\u003EI\u0027m glad it was helpful. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rainbowtrout","CreatedById":60253,"CreatedDateTime":"2013-06-01T16:25:14Z","Content":"\n\u003Cp\u003EA very useful rocket. Well done!\u003C/p\u003E\n"},{"CreatedByName":"Alryn","CreatedById":72021,"CreatedDateTime":"2013-06-23T14:49:32Z","Content":"\n\u003Cp\u003EThanks for the rocket, with it and your easy instructions I was able to get into orbit for the first time by myself, also to the moon but that was the easy bit as the in game tutorial makes it easy. I\u0027ve not tried landing yet, I want to see if I can get to minimus first and maybe land there. Thanks again, a great rocket for getting started and practising with.\u003C/p\u003E\n"},{"CreatedByName":"suzin.felipe","CreatedById":67820,"CreatedDateTime":"2013-06-24T04:01:28Z","Content":"\n\u003Cp\u003EI would like to thank you for the tutorial and the rocket design.\u003C/p\u003E\u003Cp\u003EWhen playing the demo I could go to the moon in tiny rockets as it is all you have. Then I got the full game and bigger parts. They came with wobble, overheating, increased mass and a new set of challenges.\u003C/p\u003E\u003Cp\u003ELooking at your tutorial and designs, I learn how to use struts, combine small parts that I was used to to bigger rockets, how to fly the thing in a more efficient way and to make your ships look cool. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo again mate, thank you. IF you ever come to New Zealand, beer is on me.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-24T05:12:09Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EI\u0027ve not tried landing yet, I want to see if I can get to minimus first and maybe land there. \u003C/span\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EReaching \u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EMinmus is harder, which is why I suggest going to Mun first, but you\u0027re right, once at the moon in question, Minmus is much easier to land upon. Let me know how it goes. \u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EÃ£â‚¬â‚¬\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EIF you ever come to New Zealand, beer is on me. \u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EInstead of waiting for me, I suggest you go ahead and sponge that off now. \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E But thank you for the kind words. It always makes me very happy to learn that I have helped somebody else enjoy this game that I like so much. \u003C/span\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Chloiber","CreatedById":72406,"CreatedDateTime":"2013-06-27T07:04:36Z","Content":"\n\u003Cp\u003EI haven\u0027t used your ship yet, but my main problem is getting to the moon. I somehow simply don\u0027t understand (despite your instructions) how to get to the SOI of the moon. If it works, I end up crashing right into the moon so I need to do a burn pointing past the moons surface, which is okay but uses a lot of fuel.\u003C/p\u003E\u003Cp\u003EWhen I did the mission according to your walkthrough, I probably burned too late so I missed the mun. Sped up the game and after around 5 passes I was lucky and mun caught me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Boldwyn","CreatedById":57170,"CreatedDateTime":"2013-06-27T10:33:04Z","Content":"\n\u003Cp\u003EAll the operations can be planned in advance with \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Maneuver_node\u0022 rel=\u0022external nofollow\u0022\u003EManeuver Nodes\u003C/a\u003E - you set the direction and duration of the burn in advance and see the expected course change with SOI change, apo/periapsis changes and so on. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=_aNlR4-1IrM\u0022 rel=\u0022external nofollow\u0022\u003EVideo tutorial\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHope that helps\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-27T17:03:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI end up crashing right into the moon \u003C/div\u003E\u003C/blockquote\u003EI think one of two things is happening. If you use the method I describe, your initial burn should drop you, moving quite slowly, just within the edge of Mun\u0027s SOI, then its gravity picks up and pulls you in. The first way you might be going wrong is arriving at Mun\u0027s SOI going too quickly, so that instead of falling slowly toward it on a near-miss, you are racing right at it on a collision course. That could be remedied by reducing thrust when your apoapsis gets close to Mun\u0027s orbital height and shutting down the instant you reach it, leaving you with less extra speed to deal with later. Alternately, it could be that you\u0027re having the bad luck of appearing in Mun\u0027s SOI at just about zero relative speed, so when you begin to fall toward it, you\u0027re coming straight down instead of swinging into a low periapsis pass. Try aiming your transit burn a little more to the right (on map view), so that you arrive slightly trailing Mun and will be swept around to loop it. In either case, watch on map view and see what the golden segment of your projected path is doing in Mun\u0027s SOI. You should be able to see right there if you are on a collision path far enough ahead of time to prevent hitting the surface. Can you post a picture of the path your ship is taking?\n"},{"CreatedByName":"Alryn","CreatedById":72021,"CreatedDateTime":"2013-06-28T12:55:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EReaching \u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EMinmus is harder, which is why I suggest going to Mun first, but you\u0027re right, once at the moon in question, Minmus is much easier to land upon. Let me know how it goes. \u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGetting to Minmus was not too difficult with plenty of fuel to spare. After a few orbits I realised I would need to change the inclination, I just took my time then and made as many orbits as needed until I was lined up with a good landing spot. I\u0027ve watched Scott Manley\u0027s 101 - Tutorial On Getting To \u0026amp; Landing On Moons on youtube, which I found great for advice on how to land on Minmus. It took me about 6 tries and mostly due to silly mistakes like forgetting to extend the landing struts lol. I managed to land with ease and felt a great accomplishment after only playing for a couple of weeks, thanks again for your great ship. Next stop the moon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EJebidiah looking happy I made it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/l781VJy.png\u0022 alt=\u0022l781VJy.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-28T15:27:04Z","Content":"\n\u003Cp\u003ECongratulations. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Landing on Mun is the same in theory, but things happen MUCH more quickly, and the consequences of mistakes are much more severe. Don\u0027t be discouraged if it takes quite a bit of practice even after you\u0027ve mastered landing on Minmus.\u003C/p\u003E\n"},{"CreatedByName":"SuperWeegee4000","CreatedById":71621,"CreatedDateTime":"2013-06-28T15:32:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EReaching \u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EMinmus is harder, which is why I suggest going to Mun first, but you\u0027re right, once at the moon in question, Minmus is much easier to land upon. Let me know how it goes.\u003C/span\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWrongsir. Minmus requires far less Delta-v to reach, and using a rocket designed for Minmus to fly to the Mun, I found I did not have even enough fuel to reach Mun orbit after touchdown.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-28T18:21:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWrongsir. Minmus requires far less Delta-v to reach \u003C/div\u003E\u003C/blockquote\u003EI\u0027m afraid you\u0027ve misunderstood my remark. This is a guide for new pilots, and Minmus is harder for new pilots to reach because it may require the complication of a plane change maneuver to deal with its orbital inclination, and because from a 100km orbit (and using rough numbers because the battery in my calculator died) the SOI of Mun subtends an arc of around 12 degrees while that of Minmus is a much smaller target to hit at just under 3 degrees.\n"},{"CreatedByName":"EmissionGeneration","CreatedById":71859,"CreatedDateTime":"2013-06-29T05:29:34Z","Content":"\n\u003Cp\u003EThis is a very good Tutorial. Although there are many Video\u0027s out there [none that I\u0027ve found that are step by step aimed at beginners]. As you said, alot of people enjoy Written Tutorials. Although I\u0027ve played KSP for probably a year now, on and off, mainly off with finding time, and during that time have only concentrated on Stations and Moon Bases. Have you ever thought about doing this for a Duna Tutorial aswell to help the people who want to go further? Or are there any out there that are step by step Guides instead of a bunch of Video\u0027s showing someone doing it and talking over the top about things some might not even understand? Would be much appreciated. =]\u003C/p\u003E\n"}]}