{"TopicId":24026,"ForumId":21,"TopicTitle":"Moriarty Industries Presents","CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2013-04-25T13:08:20Z","PageNum":1,"Articles":[{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2013-04-25T13:08:20Z","Content":"\n\u003Cp\u003EMoriarty Industries joined the Kerbal Space Race only a few days ago and is proud to announce today the successful end of development of their first set of airplanes for quick search and rescue operations on Kerbin.\u003C/p\u003E\u003Cp\u003EMain focus was to create airplanes that can fly at supersonic speeds to every point on Kerbin, land and take off again to retrieve crews stranded from our space program (unless they were unlucky enough to splash down in water). So after some initial tests and developments our airplaine division finally came up with the White Baron supersonic long range airplane program. Due to the fact that these airplanes often have to land and takeoff in rough terrain one development focus lies on a very sturdy setup, especially for the landing gear konfiguration to protect vital parts of the airplanes as much as possible from potential damage. Another design goal was to handle problems that come from tanks getting emptied one at a time and not balanced all at once. So all tanks are centered around CoG and fuel pipes determine how fuel is flown out. This ensures that the flight model stays fairly good throughout the mission.\u003C/p\u003E\u003Cp\u003EThe first developed airplaine in the series was the \u003Cstrong\u003EMI White Baron SS v1x\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ECrew: 1 pilot and a passenger cabin for up to 4 more Kerbals\u003C/p\u003E\u003Cp\u003EEngine: 3 x TurboJet Engine\u003C/p\u003E\u003Cp\u003EFuel: 12x150 = 1800 units\u003C/p\u003E\u003Cp\u003ECeiling: 22000m\u003C/p\u003E\u003Cp\u003ESpeed at Ceiling: ~1200m/s (~ Mach 3)\u003C/p\u003E\u003Cp\u003EMax Distance: 1800km at 1000-1200m/s\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSv1x_01.jpg\u0022 alt=\u0022f_MIWhiteBaronSSv1x_01.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSv1x_02.jpg\u0022 alt=\u0022f_MIWhiteBaronSSv1x_02.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSv1x_03.jpg\u0022 alt=\u0022f_MIWhiteBaronSSv1x_03.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe initial White Barons performance was found excellent for the purpose but since our crews can crash down anywhere on Kerbin we had to continue development to create a long range version of the plane. So we finally came up with the \u003Cstrong\u003EMI White Baron SS LR v2x\u003C/strong\u003E as a first shot at long range planes. Basically 6 asparagus staged fuel tanks were added to increase range and. These tanks can be jettisoned 2 at a time to reduce drag and weight. This staging concept also required thorough testing of the flight dynamics with all tank configurations to make sure that balance stays within safe limits. Other minor changes include 2 more wing elements and stronger main landing gear actually for faster breaking especially important in rough terrain.\u003C/p\u003E\u003Cp\u003ECrew: 1 pilot and a passenger cabin for up to 4 more Kerbals\u003C/p\u003E\u003Cp\u003EEngine: 3 x TurboJet Engine\u003C/p\u003E\u003Cp\u003EFuel: 24x150 = 3600 units, 3 asparagus stages\u003C/p\u003E\u003Cp\u003ECeiling: 26000m\u003C/p\u003E\u003Cp\u003ESpeed at Ceiling: ~1450m/s (~ Mach 3)\u003C/p\u003E\u003Cp\u003EMax Distance: 3400km at 1000-1200m/s\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSLRv2x_01.jpg\u0022 alt=\u0022f_MIWhiteBaronSSLRv2x_01.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSLRv2x_02.jpg\u0022 alt=\u0022f_MIWhiteBaronSSLRv2x_02.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSLRv2x_03.jpg\u0022 alt=\u0022f_MIWhiteBaronSSLRv2x_03.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESince landing and taking off takes a lot of fuel (\u0026gt;300 units to reach ceiling) this was still not enough to actually pick some crew up somewhere and safely make way back to KSC. So development continued to even improve range some more and lead to the flagship of the series, the \u003Cstrong\u003EMI White Baron SS LR v4x\u003C/strong\u003E. Since the configuration of the plane is actually getting at some limits the basic idea was to add range by adding more power, so another engine got added. That required some major changes though for the rear part and the wing configuration. The added benefit was some more speed and 4 more cans of fuel. Also some more air intakes were added since due to the staging some intakes are lost over time. More weight in the rear part also required modifications to the wing for more lift and a longer nose for balance. All in all this new version required a lot more testing and fine tuning than expected, maybe even more than all predecessors togther.\u003C/p\u003E\u003Cp\u003ECrew: 1 pilot and a passenger cabin for up to 4 more Kerbals\u003C/p\u003E\u003Cp\u003EEngine: 4 x TurboJet Engine\u003C/p\u003E\u003Cp\u003EFuel: 28x150 = 4200 units - 3 asparagus stages \u003C/p\u003E\u003Cp\u003ECeiling: 24999m\u003C/p\u003E\u003Cp\u003ESpeed at Ceiling: ~1350m/s\u003C/p\u003E\u003Cp\u003EMax Distance: 4400km at ~1200m/s\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSLRv4x_01.jpg\u0022 alt=\u0022f_MIWhiteBaronSSLRv4x_01.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSLRv4x_02.jpg\u0022 alt=\u0022f_MIWhiteBaronSSLRv4x_02.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/f_MIWhiteBaronSSLRv4x_03.jpg\u0022 alt=\u0022f_MIWhiteBaronSSLRv4x_03.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFirst Flight around Kerbin w/o stopover\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe following image shows the White Baron\u0027s reentry effects when descending for landing after it\u0027s first round trip around Kerbin. Obeny was obviously in a hurry ...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/MIWhiteBaronSSLRv4xReentryEffects.jpg\u0022 alt=\u0022MIWhiteBaronSSLRv4xReentryEffects.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe next image shows the White Baron landed on the runway after it\u0027s trip around Kerbin. Mission timer in left upper corner shows precisely 1 hour and 1 minute! And it still had 1000\u002B units of fuel left.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.docmoriarty.com/ksp/gfx/MIWhiteBaronSSLRv4xAfterRoundtrip.jpg\u0022 alt=\u0022MIWhiteBaronSSLRv4xAfterRoundtrip.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOperation Procedures:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThese airplanes are slow at low altitudes. They are designed to make distance at altitudes \u0026gt; 20000m. That said, it\u0027s best to climb fast to 20km\u002B and then level out and build maximum speed. Although they are partially manouverable at high altitudes it\u0027s best to set course immediately after takeoff and then just do minor corrections at best. \u003C/p\u003E\u003Cp\u003EAll planes of this series are very forgiving and well balanced but optimized to be flown with a joystick. That is they are a tiny little bit nose heavy which makes flying at high altitudes easier since you simply have to disengage and reengage ASAS shortly to lower it\u0027s nose to stay below it\u0027s ceiling (wish there were some autopilot for airplane type vehicles that can actually hold a given altitude and / or attitude).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDownloads:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EMI White Baron SS v1x (supersonic, normal range) \u003Ca href=\u0022http://www.docmoriarty.com/ksp/mods/MI\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.docmoriarty.com/ksp/mods/MI White Baron SS v1x.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMI White Baron SS LR v2x (supersonic, long range, 3 engine setup) \u003Ca href=\u0022http://www.docmoriarty.com/ksp/mods/MI\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.docmoriarty.com/ksp/mods/MI White Baron SS LR v2x.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMI White Baron SS LR v4x (supersonic, long range, 4 engine setup) \u003Ca href=\u0022http://www.docmoriarty.com/ksp/mods/MI\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.docmoriarty.com/ksp/mods/MI White Baron SS LR v2x.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAll models are built from stock parts (0.19.1) with the exception of chatterer that can be downloaded here \u003Ca href=\u0022http://kerbalspaceprogram.com/chatterer/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/chatterer/\u003C/a\u003E\u003C/p\u003E\n"}]}