{"TopicId":24083,"ForumId":21,"TopicTitle":"Rune\u0026#039;s Slightly Used Vehicles","CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-04-25T19:04:37Z","PageNum":16,"Articles":[{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-09-27T19:41:26Z","Content":"\n\u003Cp\u003ERune! Been thinking about improving my transfer infrastructure with some space stations - boring I know... I was thinking of getting your Von Braun station, but I thought I saw a smaller version of it in a post which I can\u0027t seem to locate now... any help for me there?\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-27T23:03:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hoddd9000\u0022 data-cite=\u0022Hoddd9000\u0022\u003E\u003Cdiv\u003EOH GOD THE LAG!!!\u003Cp\u003EI\u0027d download some of these, but I cant scroll past the first pic without lagging out. My keyboard has glitched and mixed around the symbols so that when I type a smiley it looks like this \u0026gt;\u0026amp;, so I have to google the symbol and then copy and paste.\u003C/p\u003E\u003Cp\u003ELife is hard *sad face*\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u0022Internet Explorer has stopped working\u0022\u003C/p\u003E\u003Cp\u003EWell then. Another ten minutes of loading and still nothing has changed. Checked AMD System Monitor and everything is running at \u0026lt;30%.\u003C/p\u003E\u003Cp\u003EI really want to look at the craft though, as I am inept at building/flying and couldnt do so to save my life. Looking for one with enough range for Minmus or Duna, otherwise i\u0027ll likely run out of fuel on the way to orbit due to my horrific flying skills. The few I saw look BEATIFUL btw.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do have a lot pics in there... and you should see what\u0027s under the spoilers (or rather, don\u0027t if you have lag). Still , I think your biggest problem is using IE... switch to the fox and you will soon not understand why anybody uses anything else! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E But if you just want to do a quick fix because yo9ur internet is limited or something, just hit the \u0022stop\u0022 button: the text will have already loaded, and the links are all text-based, so you can DL based on description, or maybe check out pics one by one by their links.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003ERune! Been thinking about improving my transfer infrastructure with some space stations - boring I know... I was thinking of getting your Von Braun station, but I thought I saw a smaller version of it in a post which I can\u0027t seem to locate now... any help for me there?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I used to have a smaller one a couple of versions ago, but since it used shorter structural pieces, it was about the same number of parts, and it didn\u0027t hold fuel... I discontinued it and called it an upgrade. Plus, the big ring looks really good all huge and slim. Might be in one of the spoiled repositories still if you want to upgrade it... but I wouldn\u0027t bother, a full sized VB ring might be a tad big and expensive, but it holds about four orange tanks of fuel, and is only a few parts over a hundred. But if you really want it, let me look around for a second... yup, third post in this thread, with the 0.25-0.90 VAB stuff. The lifter will likely not be optimized for aerodynamics then, and of course no radiators, but if you want to pick it up to modify on your own, feel free to do so! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOh, and depots might not seem anything to write home about, but once you get the hang of docking and rendezvousing, they are the things that allow all the good reusable stuff to happen... plus, running all the infrastructure really makes me feel like I am running a true space program. Outfitting expeditions around Mun is really cool to do at least once!\u003C/p\u003E\u003Cp\u003ERune. The LV might look daunting, but it flies much easier than it has any right to.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-27T23:07:33Z\u0022 title=\u002209/27/2015 11:07  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 27, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-09-28T00:44:59Z","Content":"\n\u003Cp\u003EWell, in the meantime, I went ahead and put your big ring on orbit! Lovely launch - flew like a dream right up to 120k x 6k before having to turn. got to 150k x 150k with 600 delta-V to spare! And wouldn\u0027t you know, that\u0027s about when I realized I was even using the OLD version and you have a new one with more goodies for 1.0!! Guess I have to put up a second one... and probably a third and fourth to follow soon after that!\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-09-28T03:07:37Z","Content":"\n\u003Cp\u003EYou rock, Rune!\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-28T11:56:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003EYou rock, Rune!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell thanks! I\u0027m glad it worked out for you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Wait until you start actually \u003Cem\u003Eusing\u003C/em\u003E them with ships coming and going... I usually put them facing north-south, so they always look the same during their orbit form afar, and you always have some 1.25m port facing you when you come in to dock.\u003C/p\u003E\u003Cp\u003ERune. And you know, I\u0027m always open to suggestions on what to do next...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-28T11:59:03Z\u0022 title=\u002209/28/2015 11:59  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 28, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"qm3ster","CreatedById":150338,"CreatedDateTime":"2015-09-28T12:59:51Z","Content":"\n\u003Cp\u003EProbably asked before, but.. how many of these survive FAR?\u003C/p\u003E\u003Cp\u003EHEINLEIN, it would make sense, should, unless it topples.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-28T13:12:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022qm3ster\u0022 data-cite=\u0022qm3ster\u0022\u003E\u003Cdiv\u003EProbably asked before, but.. how many of these survive FAR?\u003Cp\u003EHEINLEIN, it would make sense, should, unless it topples.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is a good question, actually. I wouldn\u0027t know, since I don\u0027t use it. They are built for stock, and they will continue to be, mostly because that\u0027s what I use, but also because that is the easies way they can work for the most people. But maybe you can test them and enlighten me?\u003C/p\u003E\u003Cp\u003ERune. I mean, they mostly look right, so they should fly right... right?\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-09-28T22:09:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EWell thanks! I\u0027m glad it worked out for you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Wait until you start actually \u003Cem\u003Eusing\u003C/em\u003E them with ships coming and going... I usually put them facing north-south, so they always look the same during their orbit form afar, and you always have some 1.25m port facing you when you come in to dock.\u003Cp\u003ERune. And you know, I\u0027m always open to suggestions on what to do next...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just launched my second one, which I am preparing for departure to Duna in 90d. I have been keeping mine with the Cupola pointed prograde. That way I have a normal day in the ring. Seems like pointed north would deprive the Kerbals in the ring of almost all Kerbol exposure, which might be an interesting science experiment on it\u0027s own... Anyhow, time to start delivering fuel... I gotta click on all those damned tanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-09-29T03:47:23Z","Content":"\n\u003Cp\u003EI do have a minor suggestion - kinda surprised you don\u0027t do it already... anytime you place a docking port Sr., you can place a standard docking port concentric to it. The way you do it is first surface attach the standard port, just off-center from the node where your docking port Sr. will attach. Then node attach to the node next to the std port. Then turn on angle snap and use the offset tool to move the standard port to the center. Way cool IMO... I do this every time I use a Sr.\u003C/p\u003E\u003Cp\u003EHere\u0027s another one... The ring configuration is awesome for a space station obviously, but why not a surface base? Why not build something like your VB ring that can be landed in one piece on the Mun or bodies with same or less gravity? Might be a cool layout. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-09-29T07:42:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003EI do have a minor suggestion - kinda surprised you don\u0027t do it already... anytime you place a docking port Sr., you can place a standard docking port concentric to it. The way you do it is first surface attach the standard port, just off-center from the node where your docking port Sr. will attach. Then node attach to the node next to the std port. Then turn on angle snap and use the offset tool to move the standard port to the center. Way cool IMO... I do this every time I use a Sr.\u003Cp\u003EHere\u0027s another one... The ring configuration is awesome for a space station obviously, but why not a surface base? Why not build something like your VB ring that can be landed in one piece on the Mun or bodies with same or less gravity? Might be a cool layout. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022Universal ports\u0022? Of course I use them! Not in that particular file, but my SSTOs usually have them in the payload bay, in order to grab stuff of all sizes. In fact, I have a quicker way of building them, thanks to editor extensions: place the Sr. port in its node, surface-attach the standard port in the centerline, either over or under the Sr. port, and then press \u0022h\u0022 while highlighting it so it moves to the center of the part it\u0027s stuck to, inside the Sr. port. Perfect alignment in three clicks!\u003C/p\u003E\u003Cp\u003ERune. Note that open ports are slightly more physics-intensive than your usual part.\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-09-29T13:23:28Z","Content":"\n\u003Cp\u003EI see then! Thanks for the tip!\u003C/p\u003E\u003Cp\u003EDanny\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-02T04:52:15Z","Content":"\n\u003Cp\u003EHey Rune - finally have Base in several boxes on it\u0027s merry way to minimus and thought I\u0027d give you some feedback.\u003C/p\u003E\u003Cp\u003E1 - The B3 file was delivered with the fuel tank inside the cargo bay full. This put the delta-V numbers are 1100, 1100, 1200, 700 (ish). I was like WTH?!?! How does he expect me to make LKO on less than 3500 delta-V and then Minimus transfer, capture, and landing on what\u0027s left of that 700?... When I dug around and emptied the fuel from the cargo bay, I had much better numbers (1200, 1200, 1600, 1200 ish). Looks like I\u0027ll make minimus orbit with about 600 delta-V left in all three boxes.\u003C/p\u003E\u003Cp\u003E2 - The other two boxes went up perfectly with one little glitch; while flying box 2, mid transfer of course, we run out of fuel in S4 and have to drop it and activate S2. S3 (payload fairing) should have already been deployed at this point. Trouble is, S2 has a different frame of reference than S4, so we have to turn around and ideally transfer control to a location in the correct orientation, like one of the multiple docking ports facing that way. It\u0027s very easy to forget, and if you have the throttle up because you\u0027re staging mid-burn like I was, it\u0027s very easy to just hit the space bar and suddenly reverse all the delta-V you just put in at least until you notice... So I would recommend that you separate the decoupling and the engine activations in S2 to two different stages, just to give people like me time to reconsider their lives... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Even better yet, if you could turn the C.R.A.D.L.E.S around so they are travelling the same direction as the launch vehicle, it would really dumb it down for me! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOverall, I found the packages to be extremely well balanced. The rockets flew straight and true. They launched directly into an 80km LKO with minimal input from me - which is probably for the best! I\u0027m looking forward to figuring out how to assemble them when they arrive on Minimus! Thanks again!\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-02T09:24:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003EHey Rune - finally have Base in several boxes on it\u0027s merry way to minimus and thought I\u0027d give you some feedback.\u003Cp\u003E1 - The B3 file was delivered with the fuel tank inside the cargo bay full. This put the delta-V numbers are 1100, 1100, 1200, 700 (ish). I was like WTH?!?! How does he expect me to make LKO on less than 3500 delta-V and then Minimus transfer, capture, and landing on what\u0027s left of that 700?... When I dug around and emptied the fuel from the cargo bay, I had much better numbers (1200, 1200, 1600, 1200 ish). Looks like I\u0027ll make minimus orbit with about 600 delta-V left in all three boxes.\u003C/p\u003E\u003Cp\u003E2 - The other two boxes went up perfectly with one little glitch; while flying box 2, mid transfer of course, we run out of fuel in S4 and have to drop it and activate S2. S3 (payload fairing) should have already been deployed at this point. Trouble is, S2 has a different frame of reference than S4, so we have to turn around and ideally transfer control to a location in the correct orientation, like one of the multiple docking ports facing that way. It\u0027s very easy to forget, and if you have the throttle up because you\u0027re staging mid-burn like I was, it\u0027s very easy to just hit the space bar and suddenly reverse all the delta-V you just put in at least until you notice... So I would recommend that you separate the decoupling and the engine activations in S2 to two different stages, just to give people like me time to reconsider their lives... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Even better yet, if you could turn the C.R.A.D.L.E.S around so they are travelling the same direction as the launch vehicle, it would really dumb it down for me! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOverall, I found the packages to be extremely well balanced. The rockets flew straight and true. They launched directly into an 80km LKO with minimal input from me - which is probably for the best! I\u0027m looking forward to figuring out how to assemble them when they arrive on Minimus! Thanks again!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey thanks! That\u0027s the best kind of feedback, the one with criticisms and questions. Although screenies wouldn\u0027t be bad either... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs to the B3 fuel situation, you just have to actually use the fuel in that tank! I could have put it empty as you say, but really, the LV is a bit OP for a relatively tiny upper stage, so just fill whatever tanks there are in the payload and use that, if you can... more fuel never hurt anyone. Alternatively, I could use the upper stage in the Base-In-A-Shroud pack, and they would greatly increase range... still, what you have should be more than enough to go to Minmus as is, with a minimal amount of sheanigans. The B2 staging, OTOH might be a bit confusing as you say. Unlike the Base-In-A-Shroud, there is really no reason not to ditch the fairing as soon as you can, I think. That is by far the heaviest module, but if you go all \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Echeaty\u003C/span\u003E smart on it, it is the longest ranged of them all... you can keep on filling the upper stage with the refinery, from the ore tanks! That would actually use something much closer to the full potential of the LV.\u003C/p\u003E\u003Cp\u003EBut yeah, I get your general point. Either I write a \u003Cem\u003Every\u003C/em\u003E good user manual, or I have another go at streamlining operation so people can make do without one. \u003C/p\u003E\u003Cp\u003ERune. I promise to take it into consideration!\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-02T13:23:54Z","Content":"\n\u003Cp\u003Ewell, with the cargo fully fueled in B3, I couldn\u0027t make LKO, but I also didn\u0027t try going to S2 before I was in LKO. With the tank empty I will arrive at minimus with about the same delta-V remaining as the other boxes. Sorry about the lack of screen shots... I promise I\u0027ll post something up soon... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-02T13:59:44Z","Content":"\n\u003Cp\u003EI just went looking for screenshots and I can\u0027t believe I didn\u0027t take a single shot of any of those three launches... how unlike me... \u003C/p\u003E\u003Cp\u003EI did, however, take a shot of me failing to SSTO in the Trident... Pick the gear up, Danny!\u003C/p\u003E\u003Cp\u003EI have not managed to SSTO this yet, but I think I\u0027m getting closer. My procedure has been climb quick as I can to 10km\u002B, then level out and speed up, looking for 1500 m/s. I either explode or top out around 1200 and run out of fuel. First couple tries I had full fuel in the cargo bay, which obviously did not help...\u003C/p\u003E\u003Cp\u003EAlso, noticed that when I hit G, I get both the wheels and the landing struts. I didn\u0027t notice an AG to toggle either element by itself - might be a nice addition for horizontal landings. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/644370215579858763/107FE287BB30AEE32A361E0EE0FF5C63A2ECE270/\u0022 alt=\u0022107FE287BB30AEE32A361E0EE0FF5C63A2ECE270\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"qm3ster","CreatedById":150338,"CreatedDateTime":"2015-10-02T14:02:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003ENote that open ports are slightly more physics-intensive than your usual part.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhat do you mean by open ports?\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-02T14:53:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022qm3ster\u0022 data-cite=\u0022qm3ster\u0022\u003E\u003Cdiv\u003EWhat do you mean by open ports?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnshielded ports, or shielded ports in the \u0027open\u0027 position. An \u0022active\u0022 or \u0022open\u0022 port, meaning one you can dock to as-is, is slightly more CPU-intensive than any other part, because they are checking all the time if another port is in range, in order to magnetize and dock.\u003C/p\u003E\u003Cp\u003E... If I know my KSP game engine basics right. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003EI just went looking for screenshots and I can\u0027t believe I didn\u0027t take a single shot of any of those three launches... how unlike me... \u003Cp\u003EI did, however, take a shot of me failing to SSTO in the Trident... Pick the gear up, Danny!\u003C/p\u003E\u003Cp\u003EI have not managed to SSTO this yet, but I think I\u0027m getting closer. My procedure has been climb quick as I can to 10km\u002B, then level out and speed up, looking for 1500 m/s. I either explode or top out around 1200 and run out of fuel. First couple tries I had full fuel in the cargo bay, which obviously did not help...\u003C/p\u003E\u003Cp\u003EAlso, noticed that when I hit G, I get both the wheels and the landing struts. I didn\u0027t notice an AG to toggle either element by itself - might be a nice addition for horizontal landings. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://images.akamai.steamusercontent.com/ugc/644370215579858763/107FE287BB30AEE32A361E0EE0FF5C63A2ECE270/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://images.akamai.steamusercontent.com/ugc/644370215579858763/107FE287BB30AEE32A361E0EE0FF5C63A2ECE270/\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, it could have used a special action group for the wheels... I recommend to add that, actually, but it is a very slight thing to alter in the file. In any case, thx for the feedback!\u003C/p\u003E\u003Cp\u003ENow, what you are doing wrong to SSTO: almost nothing. you already go supersonic (\u0026gt;340m/s), and that is the hardest thing. Once you have it at 340m/s and accelerating, however slowly, \u003Cem\u003Edon\u0027t touch anything\u003C/em\u003E. You vertical velocity will rise as you speed up, so you should get to ~20kms at ~1,200m/s. From then on, try to get as much vertical speed as you can on what is left of air, without pitching too aggresively (or at all, actually, if you are at 10-15Ã‚ÂºAoA, don\u0027t bother), and when the RAPIERS give out, switch them to rocket mode. You have plenty of vacuum dV and thrust, so don\u0027t bother much with top speed on airbreathers, it\u0027s quite draggy. As soon as you see the nosecone throw a temp gauge at you, you are going fast enough to go up instead of only sideways, more or less.\u003C/p\u003E\u003Cp\u003ESomething that I\u0027m finding out is that actually, climbing shallower on the lower atmo might be slightly more efficient. I\u0027m reconsidering my \u0022go to 10,000m to break Mach\u0022 policy, I just did a very nice flight on a big SSTO (a bit more aerodynamic than this one, though) by keeping it at ~10Ã‚ÂºAoA during the climb, it went supersonic on its own at about ~6,000m and I only touched the controls to level out a bit at around 15,000m to wait for the temp gauge to show up.\u003C/p\u003E\u003Cp\u003ERune. I end up switching modes at \u0026gt;22,000m, \u0026gt;1,300m/s surface speed, and \u0026gt;175m/s vertical speed, so you have a goal to reach. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-03T16:38:54Z","Content":"\n\u003Cp\u003Ewhat control point do you use? The cockpit has about a -12\u003Cspan style=\u0022color:#333333;\u0022\u003EÃ‚Âº incidence built in, which I think is throwing me off...\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-03T19:33:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003Ewhat control point do you use? The cockpit has about a -12\u003Cspan style=\u0022color:#333333;\u0022\u003EÃ‚Âº incidence built in, which I think is throwing me off...\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, 15Ã‚Âº actually IIRC, control form the probe core just behind the cockcpit, that is aligned the right way. Also, the upwards-facing docking port is aligned for using the VTOL systems. But take into account stuff resets to the cockpit when you go IVA!\u003C/p\u003E\u003Cp\u003ERune. BTW, we are talking about the Trident.\u003C/p\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-05T13:40:16Z","Content":"\n\u003Cp\u003Edouble-checked and it\u0027s -20... \u003C/p\u003E\u003Cp\u003EI suppose I should remove the MechJeb unit and try again just in case it\u0027s adding just enough drag to be a factor here... anyhow, I got some flight test data for you here (in the form of screen shots)... I was not able to SSTO the standard Trident yet. Keeping her level from take off also didn\u0027t work - she topped out at just over 255 m/s. Maybe I need some remedial flight training...\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/lNK2T\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter a few test flights like this, including some using the standard profile, I did manage to get it into space, but it was not exactly SSTO and you might consider this cheating... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/gAJ86\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI decided to strap some RATO packs to her wingtips and see what I needed to get her up there... First I tried two Thumpers. No luck - got higher, but I broke Mach too low and the drag pulled me back down when the Thumpers were spent. So we came back and I tried four Thumpers. Pretty much the same deal. I probably would have been fine if I had climbed to 20k before lighting them. Anyhow, I came back and attached a couple kickbacks to her. THAT did the trick!\u003C/p\u003E\n"},{"CreatedByName":"qm3ster","CreatedById":150338,"CreatedDateTime":"2015-10-06T17:44:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003Edouble-checked and it\u0027s -20... \u003Cp\u003EI suppose I should remove the MechJeb unit and try again just in case it\u0027s adding just enough drag to be a factor here... anyhow, I got some flight test data for you here (in the form of screen shots)... I was not able to SSTO the standard Trident yet. Keeping her level from take off also didn\u0027t work - she topped out at just over 255 m/s. Maybe I need some remedial flight training...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/lNK2T\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/lNK2T\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter a few test flights like this, including some using the standard profile, I did manage to get it into space, but it was not exactly SSTO and you might consider this cheating... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/gAJ86\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/gAJ86\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI decided to strap some RATO packs to her wingtips and see what I needed to get her up there... First I tried two Thumpers. No luck - got higher, but I broke Mach too low and the drag pulled me back down when the Thumpers were spent. So we came back and I tried four Thumpers. Pretty much the same deal. I probably would have been fine if I had climbed to 20k before lighting them. Anyhow, I came back and attached a couple kickbacks to her. THAT did the trick!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMaybe you should try limiting the Thumpers\u0027 thrust.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-07T10:59:37Z","Content":"\n\u003Cp\u003EOk, time for a SSTO \u0022masterclass\u0022. Here, ladies and gentlekerbs, is a Trident ascent, in a veritable crapton of pictures with all the instruments up: I tried to give one screenie every 1000m, plus a few more at the points where I actually give the critical inputs. But mostly, the trick is around 8,000-9,000m, as evidenced by the clock running for a looong time, and me staying at the same altitude with vertical speeds hovering between \u002B10m/s and -15m/s. As you can see in the pics, breaking the Mach barrier involves going over 9,000 \u003Cem\u003Etwice\u003C/em\u003E (LOL!), at quite different speeds. You could perhaps leave the transonic \u0022dive\u0022 for a bit later and save some liquid fuel, not my best ascent ever, but you can\u0027t let the speed stay much under 300m/s to keep those RAPIERS thrusting like they mean it at those altitudes, so you gotta build height slow. The numbers to look at in my HUD are acceleration, the navball speed indicator, and more importantly, vertical speed.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/e2Kbx\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ERune. Hope that helps everybody! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-07T11:02:58Z\u0022 title=\u002210/07/2015 11:02  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 7, 2015\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CrashTestDanny","CreatedById":151030,"CreatedDateTime":"2015-10-07T14:05:58Z","Content":"\n\u003Cp\u003Eis the tank in the cargo bay full or empty?\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2015-10-07T19:20:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022CrashTestDanny\u0022 data-cite=\u0022CrashTestDanny\u0022\u003E\u003Cdiv\u003Eis the tank in the cargo bay full or empty?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENeither, it\u0027s a refinery module with empty ore buffer tank, so a bit over 8mT of payload.\u003C/p\u003E\u003Cp\u003ERune. As in, the heaviest base module, unless you count full dumps.\u003C/p\u003E\n"},{"CreatedByName":"Alastronaut","CreatedById":149618,"CreatedDateTime":"2015-10-09T17:26:41Z","Content":"\n\u003Cp\u003EThis is some Apollo 13 level ingenuity, minus the life or death situation. Good job bro\u003C/p\u003E\n"}]}