{"TopicId":30872,"ForumId":21,"TopicTitle":"...going open source.","CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-02T08:47:26Z","PageNum":1,"Articles":[{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-02T08:47:26Z","Content":"\n\u003Cp\u003EHog Roast Fuel Dump - Coming soon!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=B-f8-5_AU7s\u0026amp;feature=player_detailpage\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=B-f8-5_AU7s\u0026amp;feature=player_detailpage\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/REYksDZ.jpg\u0022 alt=\u0022REYksDZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBuilt on the proven chassis of the Sherpa, the Cavalier is designed for hauling cargo and equipment down from orbit. It\u0027s powered by two nuke engines and has enough grunt to ferry another fully fueled Cavalier down to the Munar surface. It really is the Swiss Army Knife of the fleet and can be adapted to do just about anything from base building to search and rescue. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/XPRaMkl_eV0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EWith this release I\u0027d like to try something new and turn it into a little community project, that is I\u0027m inviting everyone from KSP to build and upload modules, upgrades, and launch vehicles for the Cavalier. That\u0027s right, all you probe mechanics, rover enthusiasts, launch vehicle engineers, Munar base architects and weapon developers, we need you! I\u0027ve realized for some time that while I can put together a half decent drop ship, my launch vehicles pale in comparison to some of the beautifully engineered works of art on the forum, the same goes for rovers, probes, bases, aircraft and well, most things in KSP really! If you\u0027d like to be involved, and I hope you will, I\u0027ll go into more detail after the instructions.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECRAFT FILE\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://snk.to/f-c7h9wi3u\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-c7h9wi3u\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECONTROLS\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1 - Toggle Nuke Engines\u003C/p\u003E\u003Cp\u003E3 - Wire Up Docking Port Lamp\u003C/p\u003E\u003Cp\u003E9 - Put Gear Box In D\u003C/p\u003E\u003Cp\u003E0 - Put Gear Box In R\u003C/p\u003E\u003Cp\u003EABORT - Drop cargo/Decouple\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EINSTRUCTIONS\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe Caviler is happiest hauling cargo down to the Munar surface (or equivalent gravity) from orbit. It\u0027ll give out 15 mins of burn time at full gas and has a very healthy T/W ratio that will let you haul some surprisingly big loads, if you\u0027ve got something stupidly big in theory (I\u0027ve never done it) you can dock two or more Cavaliers and use them in tandem. It comes with two vertical axis docking ports allowing you to flip cargo between them (see video). It also comes with plenty of RCS fuel for docking, although unfortunately the RCS operates in line with the cockpit not the docking ports, the only way round it is to re-map the controls I\u0027m afraid. The Cavalier can operate on Duna but the T/W ratio isn\u0027t great and the atmosphere kills the efficiency of the engines making it lose lose. \u003C/p\u003E\u003Cp\u003EFor anyone not familiar with my previous efforts the Cavalier has a horizontal cockpit for landings while the top docking port can be used for navigation, or, well, docking. Just make sure you swap command over before doing any maneuvers otherwise you might find yourself on Eve when you wanted to go to Minmus. I set a very bad example in the video when I landed the Cavalier back on Kerbin as it\u0027s defiantly \u003Cstrong\u003Enot\u003C/strong\u003E recommended, and should only be done in emergency\u0027s (plus landing with 15 units of fuel to spare is not good for ones blood pressure). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E If you do need to touch down on Kerbin you\u0027ll need to shed a lot of weight, if you are carrying any modules, ditch them and burn off most of your fuel until the tanks are about a 1/4 full. Unlike the Sherpa the Cavalier is not at home in the atmosphere, so make sure you\u0027ve got some RCS fuel left to help guide it onto the ground in one piece!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECOMMUNITY SECTION\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESo you\u0027re interested, brilliant, okay. Well you\u0027re free to design pretty much anything you want, the only requirements are that you set the abort key to decouple or disconnect your module and that if you\u0027re using action groups you only use the numbers 2 to 8 otherwise this will clash with the Cavalier\u0027s setup, you\u0027d also do well to tailor the file name to something other then Cavalier.craft, as it\u0027ll stop the original vessel being overwritten. I guess some pictures, or even better a video of your creation would be great, and of course a download link is a must! If you can post your creations on this thread that\u0027ll be fantastic, I\u0027ll then do little links to them in this post. To get the ball rolling we\u0027ve got a lovely launch vehicle courtesy of Rune and from myself; The Jet Mule that featured in the video.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELAUNCH VEHICLES\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELight LV - By Rune\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=416647#post416647\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=416647#post416647\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://snk.to/f-cdzc0jnx\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-cdzc0jnx\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EJET ASSIST\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe Jet Mule - By Cupcake\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=416670#post416670\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=416670#post416670\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://snk.to/f-cdksoas9\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-cdksoas9\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBASE MODULES\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ERosetta Stone - By Cupcake\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=427497#post427497\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=427497#post427497\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://snk.to/f-ch954kk7\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-ch954kk7\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EROVERS\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ECharabanc - By Sal_Vager\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=466576#post466576\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=466576#post466576\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThundersley Invacar - By Sal_Vager\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=466621#post466621\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/33564-going-open-source?p=466621#post466621\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWMDS\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPROBES\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMINI LANDERS\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPICNIC TABLES \u0026amp; BADMINTON SETS\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E-----\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEnjoy!\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-10T22:33:24Z\u0022 title=\u002207/10/2013 10:33  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 10, 2013\u003C/time\u003E by Cupcake...\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-02T09:34:22Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ELIGHT LV - By Rune\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFILE\u003C/strong\u003E \u003Ca href=\u0022http://snk.to/f-cdzc0jnx\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-cdzc0jnx\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA big big big thank you to Rune for putting this together for me and be sure to check out Rune\u0027s Slightly Used Vehicles (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/26106-Rocket-builder-Rune-s-Slightly-Used-Vehicles\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/26106-Rocket-builder-Rune-s-Slightly-Used-Vehicles\u003C/a\u003E) for all sorts of KSP goodness! As for the craft it\u0027s an easy to use, efficient and very elegant launch system with more then enough puff for those Munar excursions.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RVPO09B.jpg\u0022 alt=\u0022RVPO09B.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dGdLaxH.jpg\u0022 alt=\u0022dGdLaxH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat\u0027s really amazed me is that he\u0027s managed to put all this together with NO STRUTS, that\u0027s quite an achievement in itself! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-02T09:51:15Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EJET MULE - By Cupcake\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFILE:\u003C/strong\u003E \u003Ca href=\u0022http://snk.to/f-cdksoas9\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-cdksoas9\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHas everything you need to get your Cavalier into orbit, all in one convenient, portable package.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rgwZBSm.jpg\u0022 alt=\u0022rgwZBSm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUsing part Clipping like it\u0027s going out of fashion I\u0027ve stuffed 4 turbo jet engines between two jet fuel tanks both of which are mounted on a detachable wheeled base. The Jet Mule features a remote operations pod or if you fancy a more personal touch you can get one of your Kerbal\u0027s to drive it and pretend you work at Heathrow airport.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EINSTRUCTIONS\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ELoad up the Jet Mule and drive if off the runway to make room for the Cavalier. Once the Cavalier\u0027s on the runway select its bottom docking port and drive up to it. The docking itself is pretty easy but the unit\u0027s a bit on the wide side, so will probably need a bit of a shov to get it between the Cavalier\u0027s fuel tanks. Once docked, press space to dismantle the base unit and 2 to fire up the jets. From here the Cavalier operates like a standard SSTO, I usually take it up to 10,000 feet then pitch over on a 45\u0060angle until I\u0027ve cleared the atmosphere although the Jet Mule\u0027s got more then enough fuel if you want to try a bit of air hogging. Once the unit runs out of air press the abort key to ditch it. The Jet Mule will get the Cavalier to the Mun and (just about) back carrying a small payload. So yeah, it\u0027s pretty straight forward really but if you have any questions just ask. Oh, and most importantly, never, ever let Jebedia near the controls, this thing is not designed to fly on it\u0027s own!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PIXFqKV.jpg\u0022 alt=\u0022PIXFqKV.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-02T09:55:31Z\u0022 title=\u002206/02/2013 09:55  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 2, 2013\u003C/time\u003E by Cupcake...\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-06-02T12:00:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cupcake...\u0022 data-cite=\u0022Cupcake...\u0022\u003E\u003Cdiv\u003EA big big big thank you to Rune for putting this together... [snip] \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA big big big you are welcome then! It was fun, and I was inspired. I feel (even though it\u0027s pretty simple) that I should provide a bit of an explanation on the flight path/characteristics:\u003C/p\u003E\u003Cp\u003EIt\u0027s 100% throttle all the way, no need to pull back on account of air resistance, so SAS on, pedal to the metal, and up we go. The SRB\u0027s get you to a decent speed fast and drop soon, and the liquid fuel boosters are detached just after you get to 45Ã‚Âº when you go over 10,000m and start the gravity turn. After that, the core will let you at not quite orbital velocity, and the (probed) upper stage has a lowish T/W, so it\u0027ll take a while, but you\u0027ll get there easily. On your way, keep an eye out for a couple of drop tanks you should get rid off just before circularization. As you can see from the screenshot cupcake gave, you end up in a 100x100km orbit with about enough on the upper stage to do a munar transfer, and you can comply with the clean space act afterwards since the upper stage is probed and has an electric supply. In fact, if you substitute the decoupler with a docking port, you could refuel and reuse the upper stage. And of course flight engineer is only there to provide numerical results, the download is 100% stock.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cupcake...\u0022 data-cite=\u0022Cupcake...\u0022\u003E\u003Cdiv\u003EWhat\u0027s really amazed me is that he\u0027s managed to put all this together with NO STRUTS, that\u0027s quite an achievement in itself! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think that surprised me even more. I was about to do the stability test, to see which areas needed reinforcing (standard practice for me), and lo and behold, I got to orbit in the first try. The topmost decoupler is a bit springy, but the vehicle doesn\u0027t seem to mind.\u003C/p\u003E\u003Cp\u003ERune. Let\u0027s collaborate! I might try my hand at some payloads/a bigger launcher. Or perhaps a reusable SSTO launcher...\u003C/p\u003E\n"},{"CreatedByName":"Procyon","CreatedById":57510,"CreatedDateTime":"2013-06-02T12:12:45Z","Content":"\n\u003Cp\u003EReally nice looking systems. the orientation on the navball is offset 90 deg out?\u003C/p\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-03T08:38:27Z","Content":"\n\u003Cp\u003EWell, sort of. You\u0027ve got two options really, you can fly using the cockpit which sets the navball up like a plane, or if you want you can switch command over to the top docking port and fly the thing like a regular rocket. Personally I use a combination of the two, that is I use the cockpit orientation for take offs and landings, and the docking port for navigation. When you\u0027re navigating you have to use the docking port anyway as it\u0027s inline with the engines. Hope this helps...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Procyon\u0022 data-cite=\u0022Procyon\u0022\u003E\u003Cdiv\u003EReally nice looking systems. the orientation on the navball is offset 90 deg out?\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-05T10:32:21Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EROSETTA STONE - By Cupcake\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://snk.to/f-ch954kk7\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-ch954kk7\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt may not look like much...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/N52LYhc.jpg\u0022 alt=\u0022N52LYhc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E...but the Rosetta Stone is a vital part of the Cavalier\u0027s eco system. It will let you construct base modules that can then be hauled down to the Munar Surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gNLvWSO.jpg\u0022 alt=\u0022gNLvWSO.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only thing you really have to watch is that the weight distribution is evenly spaced either side of the docking port. The easiest way to do this is just to have both ends symmetrical, more advanced players may want to have a go at building unsymmetrical shapes and balancing them using part placement. Due to the Cavaliers modular nature I highly recommend using the Subassembly Saver \u003Ca href=\u0022http://kerbalspaceprogram.com/subassembly-saver-loader/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/subassembly-saver-loader/\u003C/a\u003E plugin and of course Undeadfish\u0027s fantastic 0.20 patch. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/30696-0-20-Subassembly-Loader-0-20-Compatibility-Patch?highlight=subassembly\u002B0.20\u002Bpatch\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/30696-0-20-Subassembly-Loader-0-20-Compatibility-Patch?highlight=subassembly\u002B0.20\u002Bpatch\u003C/a\u003E Apart from that work is progressing steadily on the Cavalier\u0027s fuel dumps, and Rune\u0027s hard at work creating a mother ship that can haul them into orbit. So yes, exciting times ahead. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\u003Cp\u003EHere\u0027s a little sneak peek of the fuel dumps, enjoy!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=B-f8-5_AU7s\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=B-f8-5_AU7s\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Francesco","CreatedById":58274,"CreatedDateTime":"2013-06-05T10:37:59Z","Content":"\n\u003Cp\u003Ewait, so what does the rosetta stone do, exactly? blow things up?\u003C/p\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-05T10:45:23Z","Content":"\n\u003Cp\u003EHopefully not! No, the Rosetta stone is kind of like the initial building block for creating modules. It has a docking port at the top for hooking up to a Cavalier drop ship, and a pylon at the bottom where you can mount a de-coupler and stack the module on top of your launch vehicle. The blowing up thing is the self destruct mechanism that I\u0027ve built into the fuel dumps, the idea being that you can destroy them once they\u0027re empty. It\u0027s something I first played around with, with the Sherpa, the drop ship that preceded this one. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29151-Every-Spaceport-should-have-one-of-these-does-yours\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/29151-Every-Spaceport-should-have-one-of-these-does-yours\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Francesco\u0022 data-cite=\u0022Francesco\u0022\u003E\u003Cdiv\u003Ewait, so what does the rosetta stone do, exactly? blow things up?\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T10:47:41Z\u0022 title=\u002206/05/2013 10:47  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by Cupcake...\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-20T15:19:03Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ECHARABANC ROVER\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFILE:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://snk.to/f-cdniquuv\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-cdniquuv\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECONTROLS:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E2 - Toggle Skippy Engines (Will let you turn the stage into a super long range drop tank.)\u003C/p\u003E\u003Cp\u003ELovingly crafted by the expert hands of Sal_Vager the Charabanc is the latest, must have accessory for the Cavalier. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/66rt9B2.jpg\u0022 alt=\u002266rt9B2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt can comfortably seat 8 Kerbals and a driver making it perfect for sightseeing tours, hen nights, or away matches at Anfield.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hoYAuhm.jpg\u0022 alt=\u0022hoYAuhm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESolidly built and impeccably balanced, the Charabanc can also act a wheeled base allowing you to drive your Cavalier along the dusty plains. Great for cutting down on those fuel bills, or as part of the Cavalier\u0027s comprehensive road side assistance program. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jtRQTKN.jpg\u0022 alt=\u0022jtRQTKN.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs part of Cupcake Landers commitment to the environment you can dock and un-dock the Charabanc to your hearts content, allowing it to be transported to new and exotic lands. A remote control unit on the Cavaler\u0027s top docking port will let you call the ship in from wherever you parked it..\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/a0tXyc6.jpg\u0022 alt=\u0022a0tXyc6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Charabanc also comes with a free Heavy LV, what fabulous value!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/hxiOCvW.jpg\u0022 alt=\u0022hxiOCvW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI would of course like to express my gratitude to Sal for his wonderful contributions and if anyone else would like to get involved just drop me a line... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-20T16:13:44Z\u0022 title=\u002206/20/2013 04:13  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 20, 2013\u003C/time\u003E by Cupcake...\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-06-20T15:39:53Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003ETHUNDERSLEY INVACAR\u003C/strong\u003E - Sal_Vager\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFILE:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://snk.to/f-ctis4jj1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://snk.to/f-ctis4jj1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECONTROLS:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E2 - Toggle Skippy Engines (Will let you turn the stage into a super long range drop tank.)\u003C/p\u003E\u003Cp\u003EIf you\u0027d rather not transport the more vile of your in-laws to/from auntie Val\u0027s Christmas lunch \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_angry.gif\u0022 alt=\u0022:mad:\u0022\u003E then perhaps you\u0027d like to invest in a Thundersley Invacar an adorable little one man rover created by our resident expert Sal-Vager. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9PW5Hk3.jpg\u0022 alt=\u00229PW5Hk3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EPowered by a 48cc two stroke motorbike engine the Invacar is surprisingly nippy with a top speed of 34 miles per hour. It also comes with an tape deck, air conditioning and fluffy dice as standard.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5HWZzwq.jpg\u0022 alt=\u00225HWZzwq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOperation is much the same as it\u0027s bigger cousin the Charabanc. Enjoy, and remember speeding while drive drinking kills stuff. Thankyous to Sal for creating this and I hope you have as much with it as I have. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-20T21:59:36Z\u0022 title=\u002206/20/2013 09:59  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 20, 2013\u003C/time\u003E by Cupcake...\u003C/strong\u003E\n\u003C/span\u003E\n"}]}