{"TopicId":3122,"ForumId":21,"TopicTitle":"My lifter","CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-10-22T00:16:15Z","PageNum":1,"Articles":[{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-10-22T00:16:15Z","Content":"\n\u003Cp\u003ESo. As time has gone on, I\\\u0027ve refined my \\\u0027I want to go to the freakin mun\\\u0027 ship design. This is my latest attempt to make something that does the job and is actually manageable.\u003C/p\u003E\u003Cp\u003EThis .craft was made for 0.11.1 - later versions of the game may not work so well.\u003C/p\u003E\u003Cp\u003EThis ship easily gets into orbit before running out of fuel in the ascent stages, and proper use of the last bit of fuel in the ascent stage and the solid booster rockets can quite literally rocket you past escape velocity. I still haven\\\u0027t yet figured out which sets of boosters to fire in what order will allow me to *avoid* escape velocity while still getting my orbit around 30,000,000m, which is where IIRC the mun is going to be. Even so, if you (like I have) screw up and hit escape velocity, you can still easily correct that and get into a circular orbit at 30,000,000m with what\\\u0027s left in the last stage - as well as, more importantly - return home. The three satellites in the last stage are only used to weigh the ship down; With luck, the lander - whatever that may be - won\\\u0027t be as heavy.\u003C/p\u003E\u003Cp\u003EThe only mod this uses is the commsat mod for the payload. Note that I opened the png and saved it in paint which fixes the red texture problem in the screenshots.\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-10-27T08:53:11Z","Content":"\n\u003Cp\u003EThis version of the ship is still for KSP 0.11.1\u003C/p\u003E\u003Cp\u003EAs time has gone on, I\\\u0027ve discovered a fairly nasty unfixed bug with the stock tricoupler. It appears that part causes the ship to drift off course constantly, meaning my ship is imbalanced not due to something I have done wrong, but due to the stock part being screwed up, as detailed in this thread:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=1551.0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=1551.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is demonstrated quite well by this new minor variant of the ship which instead of the stock tricoupler, instead uses the joyeuse tricoupler. Very little of the ship has been changed aside from this, however, notably there are far fewer steering problems. Unlike the original ship, I did not need to add winglets OR rcs thrusters to the lower stage to allow the asas to steer the ship properly. In fact, I should be able to ditch quite a lot of the RCS fuel from the topmost stage now that I don\\\u0027t need it for liftoff and midcourse correction as much.\u003C/p\u003E\u003Cp\u003ENot to say that the ship doesn\\\u0027t spin or drift - it still does, but it\\\u0027s far more easily managed and can even be steered to enter orbit without shutting down the engines first.\u003C/p\u003E\u003Cp\u003EAnyway, here are links to the mods I\\\u0027m using for this version:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.kerbalspacerepository.com/2011/07/17/stellarcom-communications-satellite/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalspacerepository.com/2011/07/17/stellarcom-communications-satellite/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.kerbalspacerepository.com/2011/07/21/joyeuse-industries-coupler/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.kerbalspacerepository.com/2011/07/21/joyeuse-industries-coupler/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-11-11T20:40:37Z","Content":"\n\u003Cp\u003ERequires .12x5 (probably will work with later versions)\u003C/p\u003E\u003Cp\u003EWoo! I managed to build a ship that gets to the mun!\u003C/p\u003E\u003Cp\u003EThis uses the lander leg from here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=977.msg7757#msg7757\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=977.msg7757#msg7757\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand the tricoupler from here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=143.msg665;topicseen#msg665\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=143.msg665;topicseen#msg665\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=143.msg45708#msg45708\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=143.msg45708#msg45708\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEDIT: It seems that somehow the original file got corrupted on the website, so I reuploaded my copy as a reply to the original thread.\u003C/p\u003E\u003Cp\u003Eall other parts are stock.\u003C/p\u003E\u003Cp\u003EThis ship is much improved over earlier variants due to the gimballed thrust available now. One of the nine LFE\\\u0027s on stage 2 gives directional control - enough for stability, not enough to throw the ship out of control with the asas on.\u003C/p\u003E\u003Cp\u003EBe aware that the gimballed engines produce less thrust but also use less fuel, so they last a little longer.\u003C/p\u003E\u003Cp\u003EThe lander stage is not terribly difficult to crash if not properly landed. It *will* flip over if you aren\\\u0027t careful, I successfully landed with a near flipover at \u0026lt;2m/s on a slope. Careful with that thing.\u003C/p\u003E\u003Cp\u003EI was able to land it with almost 1\u0026amp;3/4 tanks full fuel, and was able to get home with about 3/4 of one tank remaining. It barely needed any rcs input at all.\u003C/p\u003E\u003Cp\u003EHint: When taking off from the mun, throttle up *then* stage the legs. Otherwise you\\\u0027ll crash.\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-12-06T09:08:04Z","Content":"\n\u003Cp\u003ERequires .12.0\u003C/p\u003E\u003Cp\u003EThis uses the lander leg from here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=977.msg7757#msg7757\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=977.msg7757#msg7757\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand the tricoupler from here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=143.msg45708#msg45708\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=143.msg45708#msg45708\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAll other parts stock.\u003C/p\u003E\u003Cp\u003EMinor revision to my previous version of my mun launcher; this one uses fewer struts, has a more balanced approach with the rcs jets on the lander itself, and instead of firing an srb below the centerline engine on stage 9, it instead fires that engine, since having the added stability of the gimballing engine and the slightly lowered weight from it using up a tiny bit of fuel makes things work a bit better when we transition to dropping the srb\\\u0027s and firing the remaining lfe\\\u0027s.\u003C/p\u003E\u003Cp\u003EStrutswise, I got rid of all of them connecting the midstage tanks to the lander since they were unnecessary; in earlier versions of ksp without these struts the ship would snap in half on the landing pad, but it\\\u0027s sufficiently rigid now in 0.12 to not need them.\u003C/p\u003E\u003Cp\u003EThe biggest change with the struts is not something that you can see easily, instead of wrapping the outside of the ship with struts and then connecting to four of the outside lft\\\u0027s I instead directly connected the centerline lowest lft to the eight outer lft\\\u0027s by using four symetrical struts each. Less weight, less drag, and less roll since it\\\u0027s slightly more symmetrical.\u003C/p\u003E\u003Cp\u003EBy reducing the amount of struts used, fps tends to be much higher in certain points of flight.\u003C/p\u003E\u003Cp\u003EThis variant has successfully landed on the mun three times, twice in craters on the light side, and once in a valley near mountains on the dark side.\u003C/p\u003E\n"},{"CreatedByName":"millsw","CreatedById":4053,"CreatedDateTime":"2011-12-06T11:14:41Z","Content":"\n\u003Cp\u003EI love how people make huge rockets when there are tiny designs that can lift a sat easily.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2011-12-06T11:27:39Z","Content":"\n\u003Cp\u003ENice rockets.\u003C/p\u003E\u003Cp\u003EBut why all stock? Are you some sort of Purist or something? ???\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-12-07T05:41:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Flixxbeatz\u0022 data-cite=\u0022Flixxbeatz\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENice rockets.\u003C/p\u003E\u003Cp\u003EBut why all stock? Are you some sort of Purist or something? ???\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPurist? Nah. I just like what works. I\\\u0027ve been making rockets for a long, long time with the stock parts - so I pick and choose the things I need in addition carefully. For instance, I only use the joyuse tricoupler since it lets me make rockets that don\\\u0027t sway/tilt constantly when thrusting, and I only use the landing legs because I wanted to simplify mun landings a little.\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-12-19T05:24:33Z","Content":"\n\u003Cp\u003EThis version of the rocket requires 0.13.0\u003C/p\u003E\u003Cp\u003EThe only mod part this uses is the lander leg from here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=977.msg7757#msg7757\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=977.msg7757#msg7757\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBig redesign of the rocket, due to 0.13.0 enabling the ability to attach lft\\\u0027s to radial decouplers and fuel lines, I was able to finally rid myself of Ye Olde Hated tricoupler. (And there was much rejoicing!) In addition, the midstage used for orbital corrections and making the transit to the mun is no more since I was able to pack the fuel needed into radial decoupled tanks on the lander. Putting all the fuel needed on the lander enabled me to do a number of things, from reducing rcs fuel and jets required, reduce total weight by not having an extra engine or decoupler in the stack, and make the lander landing area wider and more tolerant of poorly aimed landings.\u003C/p\u003E\u003Cp\u003EThe radial liquid tanks on the lower stage allow me to decouple spent fuel and unneeded engines for each portion of the flight, which allows me to actually get into an orbit with less fuel to begin with and more fuel to orbit with - I haven\\\u0027t flown it perfectly yet, but I tend with my goofy flying to get into a too high orbit of ~100k ap with one and one half tank of fuel left over in the final lifting stage. My previous rocket had an extra eight tanks and two engines in its lifting stage, and required the use of the transit stage to actually get into an orbit.\u003C/p\u003E\u003Cp\u003EThe only part of this rocket I\\\u0027m not happy with yet is the solid booster rocket stage - it tends to twist a bit, and isn\\\u0027t producing the amount of thrust I\\\u0027d like - but it\\\u0027s difficult now in 0.13 to add tons of boosters since they tend to need winglets to dissipate heat or they go *boom* and detonate the rocket.\u003C/p\u003E\u003Cp\u003EOh, and before you ask? V3 and V4 of this design were... unusable. There\\\u0027s a reason you didn\\\u0027t see them. =P\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-12-20T06:40:25Z","Content":"\n\u003Cp\u003EThis version of the ship is a minor revision to V5 above, and thus requires the same mods and game version.\u003C/p\u003E\u003Cp\u003EUsually, when designing upgrades to a ship, I ignore Jeb. All Jeb ever seems to say from day in and day out is \\\u0027MOAR BOOST!\\\u0027 - in this case, I listened for once and told him that if he blew himself up, he could pay for his own clone this time. Strapping himself in, all I got was a ;P out of him.\u003C/p\u003E\u003Cp\u003EIn any case, to my surprise the launch was an unqualified success. Though this version of the rocket requires double the static winglets the previous one did, and \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EEIGHT\u003C/span\u003E TWELVE more struts to keep the srb\\\u0027s from blasting into the bottom of the rocket upon lighting them, it is in every important way an improvement - after dumping this stage, the liquid stage has to *slow down* from over 100m/s and in fact, I need to dethrottle almost immediately to keep my speed under 100m/s (We\\\u0027re less than 12k at this point!) for fuel efficiency. The previous build barely sustained velocity at 75m/s after that stage dropped - I haven\\\u0027t gotten it into an orbit yet, but I imagine this is going to save us a bit of liquid fuel.\u003C/p\u003E\u003Cp\u003EEDIT: Took it to orbit. Previous version of the ship had a little under a tank and a half in the ascent stage left over; this version has 3\u0026amp;1/2 tanks left over. Wow. For once, Jeb was right!\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2012-01-14T07:51:25Z","Content":"\n\u003Cp\u003EThis version of the rocket requires 0.13.1\u003C/p\u003E\u003Cp\u003EThe only mod part this uses is the lander leg from here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=977.msg7757#msg7757\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=977.msg7757#msg7757\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is a minor revision to V6 above; the srb stage had to be redone from scratch again, but it\\\u0027s just as powerful. In addition, the engineers were a mite bit confused by the direction of the fuel lines. It seems one day somebody painted the arrows on the lines backwards and so all of those had to be redone too. Functionally this is the same rocket, however.\u003C/p\u003E\u003Cp\u003EOne minor twitchy problem with this rocket I\\\u0027ve recently discovered shared with V5\u0026amp;V6 is due to the sheer width of the landing area, one of the lander stage\\\u0027s legs routinely collides with the second set of liquid fuel tanks when they are dropped. The collision itself is slow enough not to cause problems, however the rebound can cause the destruction of your craft if you\\\u0027re unlucky, have thrust on, and that particular part of the stage intersects your lfe\\\u0027s thrust plume. The best way to avoid problems is to shut off your engines before you jettison the stage, then power up slowly until it\\\u0027s clear. Given, at this point I\\\u0027m usually very close to making orbital velocity so I haven\\\u0027t really had a problem with making the adjustment midflight.\u003C/p\u003E\n"}]}