{"TopicId":33929,"ForumId":21,"TopicTitle":"Fairly large RCS powered probe","CreatedByName":"Dual_Boot","CreatedById":71534,"CreatedDateTime":"2013-06-20T08:56:40Z","PageNum":1,"Articles":[{"CreatedByName":"Dual_Boot","CreatedById":71534,"CreatedDateTime":"2013-06-20T08:56:40Z","Content":"\n\u003Cp\u003EHi, i\u0027m new to the forum. I just got done tweaking this bad boy and thought i\u0027d share. sorry if the pictures are a little dark, i wanted to demonstrate the lights i put on there.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7285/9089869459_6bf4570170_o.png\u0022 alt=\u00229089869459_6bf4570170_o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm3.staticflickr.com/2853/9092088700_1fb7bdb43d_o.png\u0022 alt=\u00229092088700_1fb7bdb43d_o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm3.staticflickr.com/2808/9089869501_db2d43f783_o.png\u0022 alt=\u00229089869501_db2d43f783_o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGot this little guy in orbit around the moon right now. once i figure out how to fix it\u0027s crooked orbit, i will try to bring it back to kerbin. it has a decent thrust to weight ratio outside of kerbin\u0027s gravity. i may even be able to land it on the mun and take off again. the only problem is it\u0027s a hassle to get it ready to launch. you have to disable each monopropellant tank one at a time. it has a clamp o tron jr. docking port as well. so when i actually figure out how to rendezvous and dock i can refuel this thing. i used a VERY big rocket to get it into orbit. probably isn\u0027t very efficient.\u003C/p\u003E\n"},{"CreatedByName":"jordanjay29","CreatedById":62787,"CreatedDateTime":"2013-06-20T10:46:30Z","Content":"\n\u003Cp\u003EAnd this is using just RCS? Yikes, you must have LOOOOOOOONG burn times for manuevers.\u003C/p\u003E\n"},{"CreatedByName":"Dual_Boot","CreatedById":71534,"CreatedDateTime":"2013-06-20T11:10:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jordanjay29\u0022 data-cite=\u0022jordanjay29\u0022\u003E\u003Cdiv\u003EAnd this is using just RCS? Yikes, you must have LOOOOOOOONG burn times for manuevers.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, the burn times aren\u0027t unbearable. much more tolerable than using an ion engine. and if i did the math right, it has at least about 2000 delta v, and a thrust to weight ratio of 0.22 on kerbin. i mostly made it for looks though.\u003C/p\u003E\n"},{"CreatedByName":"Dual_Boot","CreatedById":71534,"CreatedDateTime":"2013-06-20T12:19:43Z","Content":"\n\u003Cp\u003EActually, the burn times aren\u0027t bad at all. i had to cheat to get it back in orbit around kerbin. (i was looking at the wrong notes concerning the delta v). it worked exceptionally well. i am considering adding another docking port to the back to attach a booster module for larger transfers.\u003C/p\u003E\u003Cp\u003Ethis may be off topic, but if i post a picture of the delivery platform and provide a .craft file, could someone help me optimize it? sorry if this is the wrong place for that, like i said, i\u0027m new.\u003C/p\u003E\n"}]}