{"TopicId":34409,"ForumId":21,"TopicTitle":"Exo\u0026#039;s Rubberband and Duct Tape Emporium. SSTOS, Weird Space Ships, and more!","CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-06-23T10:47:02Z","PageNum":5,"Articles":[{"CreatedByName":"sopwerdna","CreatedById":78721,"CreatedDateTime":"2013-10-03T00:14:52Z","Content":"\n\u003Cp\u003ELove all these ships... I have to say, pa1983\u0027s SSTOs are awesome... but they don\u0027t look that great. These, on the other hand, look incredible. Great work! \u002Brep\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-10-03T03:38:00Z","Content":"\n\u003Cp\u003EThanks! Yeah. The aesthetic component comes easily to me, it\u0027s the technical stuff i feel I still have much room to improve on. Really, it\u0027s the technical capability of a design that gives it its staying power. When something looks really awesome I download it, fly it to see if it works, then tear it apart to hunt for good ideas. Usually that\u0027s it. But if it does something useful, then it actually gets used to play the game, and that\u0027s super cool. That\u0027s where the designs of people like pa1983 and Cupcake really shine. Most of my designs in the pipeline are very \u0027performance\u0027 oriented, so they take a while to iron the kinks out. Most future designs will have to actually DO something. Besides be really, really, ridiculously good looking! \u003C/p\u003E\u003Cp\u003EBut that said I just don\u0027t have it in my heart to play with something ugly, so my future releases will be pretty good looking too! ( I hope)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-03T03:41:28Z\u0022 title=\u002210/03/2013 03:41  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 3, 2013\u003C/time\u003E by Exothermos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRFirefox","CreatedById":67434,"CreatedDateTime":"2013-10-06T03:49:51Z","Content":"\n\u003Cp\u003EThe Argo spacebus is a pretty awesome craft. I\u0027ve gotten it into orbit a couple times, but I have a few critiques for it. Most importantly, the intakes that cannot be shut are causing serious drag problems when the nukes are engaged. This wouldn\u0027t be a problem if it could get up to 2000m/s on the jets alone, but I\u0027ve only managed around 1600m/s on jets before the last two flamed out. I have been unsuccessful at pulling it apart to re-allocate the action groups to close those intakes. I\u0027m also having issues with fuel displacement and trying to see through the clipped tanks to transfer it around. I\u0027ll get back to you if I can \u0027fix\u0027 any of those problems.\u003C/p\u003E\u003Cp\u003EThat said, can\u0027t beat putting sixteen intrepid astronauts in orbit at one time!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-06T04:36:17Z\u0022 title=\u002210/06/2013 04:36  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 6, 2013\u003C/time\u003E by SRFirefox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-10-06T07:57:31Z","Content":"\n\u003Cp\u003EGreat, glad you like it! Thanks for your feedback! \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/hck88yrltyy2vrp/Argo%20Space%20Bus%20SSTO.craft\u0022 rel=\u0022external nofollow\u0022\u003EI\u0027ve modified the .craft file\u003C/a\u003E with many more of the intakes selected on the [5] action group. This should help your insertion maneuver. During testing I found I never really needed to close so many, but that\u0027s why I like feedback: turns out it is definitely a little better with more intakes closed. Remember, you have that aerospike at your disposal too, which isn\u0027t the most efficient, of course, but is enough thrust to get you a good apoapsis quickly. You can leave the circularization to the nukes. \u003C/p\u003E\u003Cp\u003EAs far as the fuel balancing is concerned, I never really needed to balance the shuttle during ascent. I only needed to balance for docking maneuvers. For this, moving fuel between the three x200 \u0022pancake\u0022 tanks [green] seems adequate.\u003C/p\u003E\u003Cp\u003EYou can access the clipped tanks my clicking on either side of the red higlighted tank.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lmAX21d.png\u0022 alt=\u0022lmAX21d.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAre you struggling with the ascent phase? \u003C/p\u003E\u003Cp\u003EI just ran a couple of test flights to create ascent profile instructions for the Argo:\u003C/p\u003E\u003Cp\u003E1) Hit action groups [1,2,5] and throttle up. The craft will lift off at 90kph.\u003C/p\u003E\u003Cp\u003E2) Climb at 50 degrees to 16k. Hit action group [5] again to reopen intakes. Begin slow leveling maneuver from 50 degrees to 15 degrees at 28k.\u003C/p\u003E\u003Cp\u003E3) Accelerate at 15 degrees pitch between 28k and 34k. You will need to juggle the jet engines and throttle. Keep your ascent rate above 10m/s. Hit [2] at 0.18 intake air (4 engines active). At 0.12 air, Hit [1] to shut 4 engines down, and hit [2] again to fire up the other 2 again. In other words your Number active engines goes 6-4-2.\u003C/p\u003E\u003Cp\u003E4) As your ascent rate and Airspeed gains start slowing, turn on the nukes [4] and rotate to 25 degrees.\u003C/p\u003E\u003Cp\u003E5) As your ascent rate and Airspeed gains start slowing again, the jets should be out of juice (around 34k and well over 2000 is attainable), and you will be at a low throttle setting. Turn them off [2], Hit [4] to fire up the aerospike, [5] to close the intakes and rotate to 50 degrees.\u003C/p\u003E\u003Cp\u003E6) Power to at least 74 apoapsis and shut everything down when that number is achieved.\u003C/p\u003E\u003Cp\u003E7) Coast to apoapsis and use NERVAs to circularize. \u003C/p\u003E\u003Cp\u003EThe Argo was my first large SSTO and as such, it is a little less than optimal, building finesse-wise. If I were to rebuild this craft (which I might) I would definitely fix the inherent fuel balancing problem.\u003C/p\u003E\u003Cp\u003EHow it is\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IUutDqw.png\u0022 alt=\u0022IUutDqw.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow it should be.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TdTPzAL.png\u0022 alt=\u0022TdTPzAL.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s amazing how well it works, considering. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BebBE8P.png\u0022 alt=\u0022BebBE8P.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T06:11:30Z\u0022 title=\u002210/08/2013 06:11  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by Exothermos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRFirefox","CreatedById":67434,"CreatedDateTime":"2013-10-06T23:42:45Z","Content":"\n\u003Cp\u003ESuccess! I made it to orbit with about half of the remaining oxidizer, and barely used the aerospike in the process. Using the aux thrust from the NERVAs, I was able to hold onto the last two jets until ~37k. This is where my flightplan differs significantly from yours. When above ~36k or so, atmospheric drag (especially with the intakes closed) becomes very small. With a short burn at about 25* with the aerospike, I pushed the apokee to T-2:30 and then used a few minutes worth of nuclear engine burn to push it to ~160k, the location of my future space station. It worked a charm, following the first four and a half steps of your plan worked brilliantly. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2013-10-09T18:00:24Z","Content":"\n\u003Cp\u003E*fewer than 500 parts. Parts are countable.\u003C/p\u003E\u003Cp\u003EAnyway, very cool plane.\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-10-09T19:39:19Z","Content":"\n\u003Cp\u003EIf you are referring to the Aeon, I was stating that as a goal I was trying (but failed) to meet. Actual part count is 555 on the craft file I believe. Add to that the part count of whatever tug design you go with. It\u0027s not what I wanted, but it is a compromise I had to make.\u003C/p\u003E\n"},{"CreatedByName":"HappilyStreet","CreatedById":53881,"CreatedDateTime":"2013-11-30T06:03:57Z","Content":"\n\u003Cp\u003EFrankly, I am not sure if Exo or anyone for that matter will see this, but heck I\u0027ll give this a whirl. Exo ever since I saw this thread one it first started I feel in love with Exo\u0027s crafts, I even took away some craft building techniques from them too. Sadly, due to severe depression and near suicide I fell away from KSP and the forums, but coming back to see what I\u0027ve see now is amazing. Time to start catching up! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-11-30T07:23:27Z","Content":"\n\u003Cp\u003EWoah, well I\u0027m glad you are back in the saddle! I don\u0027t necessarily want to take this thread on a tangent, but if building stuff is what makes you happy, DO IT. And share! That\u0027s, like, 80% of the fun for me. I build all sorts of stuff and do things in the game that I never share, but any victories that aren\u0027t worth sharing, are hollow ones for me.\u003C/p\u003E\u003Cp\u003EIf you need SSTO building tips, or need help with my craft in anyway, ask away! Besides me, there is some seriously talented builders that frequent this subforum and this thread, even. Heck, most of the cool building techniques I use in my craft are strait-up stolen from those folks! (you know who you are \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ) You should do the same. Slap stuff together and steal stuff from other people just to see how it works. You can even take apart ships and drag cool components over to the new subassembly tab to use on your own builds. Eventually you will figure out what you like, and what you don\u0027t. And that\u0027s where a style comes from. I hope my craft show a certain aesthetic style in that regard. \u003C/p\u003E\u003Cp\u003Eps, I\u0027ve got both big serious SSTOs and some fun little SSTOs in the pipeline (check out the SSTO showcase thread), as well as some other stuff so if you like my stuff, stay tuned!\u003C/p\u003E\n"},{"CreatedByName":"baberbot","CreatedById":94854,"CreatedDateTime":"2013-11-30T13:51:07Z","Content":"\n\u003Cp\u003EVery impressed never seen as many good SSTOs all at once \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E how are you so good?\u003C/p\u003E\n"},{"CreatedByName":"HappilyStreet","CreatedById":53881,"CreatedDateTime":"2013-11-30T18:15:05Z","Content":"\n\u003Cp\u003EWell, Thank you. I\u0027ll keep this quick and simple, don\u0027t want to take this down the route of that whole fuel issue early in the thread. And I browse the Forums a lot, and every time i see something I like, I take and cannibalize it and and it to my building techniques. Building is my favorite part of this game. Though I\u0027m not sure if any of it is worth sharing, but I have fun with them.\u003C/p\u003E\n"},{"CreatedByName":"Dvarx","CreatedById":85911,"CreatedDateTime":"2013-12-01T00:22:49Z","Content":"\n\u003Cp\u003EHey I just love Ardent, even thou I have to fight a spontaneous spin after reentry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But it always recover \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWanted to ask you what is a flight protocol with it, as I find it it a good shuttle for my Laythe base. If I like this plane my company would buy a five of them for this mission with some adaptations... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-12-01T02:29:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dvarx\u0022 data-cite=\u0022Dvarx\u0022\u003E\u003Cdiv\u003EHey I just love Ardent, even thou I have to fight a spontaneous spin after reentry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E But it always recover \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EWanted to ask you what is a flight protocol with it, as I find it it a good shuttle for my Laythe base\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGlad you like it! I must admit, I have experienced the reentry spin a time or two as well in the Ardent. I\u0027ve since realized that this is because the drag from the air intakes is so far forward, and the fuselage is very short, so that the plane wants to swap ends on reentry. The best way to avoid this on the current design is to keep your intakes closed until around 15,000 meters and keep your nose on your Navball pip. You won\u0027t need them anyway. Also, a steep reentry angle seems to exacerbate it. As my previous sentence alluded to, I am in the middle of optimizing all of my designs with little fixes that I have learned in the months since their original design. Currently the Accipiter and the Agilus are on the Table and are essentially complete. The Accipiter is getting more thrust, better fuel flow, and much lower part count, and the Agilus is getting an engine swap to decrease time-to-orbit, decrease weight, and increase DV when in space. I\u0027ll make the Ardent my next priority on that list. I\u0027ll fix that forward drag problem on the base variant, and see if I can make it a little more friendly for the rough landings on Laythe with a \u0022field\u0022 variant. This will likely mean more lift for slower rotation and stall speeds.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022baberbot\u0022 data-cite=\u0022baberbot\u0022\u003E\u003Cdiv\u003EVery impressed never seen as many good SSTOs all at once \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E how are you so good?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! It\u0027s probably due to an unhealthy obsession with the game, and with SSTOs in particular. I was late to work this morning because I was building SSTOs in my head while staring blankly at the shower wall.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-01T02:35:43Z\u0022 title=\u002212/01/2013 02:35  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 1, 2013\u003C/time\u003E by Exothermos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2013-12-01T15:47:35Z","Content":"\n\u003Cp\u003ECongrats on Spacecraft Exchange forum thread of the month of December Exothermos \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nephf","CreatedById":66354,"CreatedDateTime":"2013-12-01T19:02:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sal_vager\u0022 data-cite=\u0022sal_vager\u0022\u003E\u003Cdiv\u003ECongrats on Spacecraft Exchange forum thread of the month of December Exothermos \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECongratulations!\u003C/p\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-12-01T23:24:44Z","Content":"\n\u003Cp\u003ENice one! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2013-12-03T00:28:14Z","Content":"\n\u003Cp\u003EWell deserved I think..\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2013-12-03T09:07:52Z","Content":"\n\u003Cp\u003EOther than cupcake\u0027s designs, which I can barely even fathom on my best days, I would have to say these are the best SSTOs on the forum IMHO. Well done, and well deserved, Exothermos. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 alt=\u0022^_^\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-12-04T04:30:08Z","Content":"\n\u003Cp\u003EWoah! This is a surprise, Cool! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Thanks everybody! I will endevor to release some of the 5 or 6 SSTOs I am juggling \u0022while the iron is hot\u0022, so to speak.\u003C/p\u003E\n"},{"CreatedByName":"Chirality","CreatedById":72995,"CreatedDateTime":"2013-12-07T18:48:11Z","Content":"\n\u003Cp\u003EExothermos, do you still have that \u0022Egg\u0022 SSTO?\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-12-08T05:11:47Z","Content":"\n\u003Cp\u003EIt\u0027s coming! It\u0027s being released this weekend with a couple other smaller SSTOs. Basically, whenever I have time to write up the post and juggle all the file and picture editing/dumping.\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-12-09T06:08:38Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/37352-Exo-s-Rubberband-and-Duct-Tape-Emporium-SSTOS-Weird-Space-Ships-and-more%21?p=473777\u0026amp;viewfull=1#post473777\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cstrong\u003E4 NEW SSTOs Added to the Front Page OP!\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cstrong\u003EHere is the Aeon Post for safe keeping:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008080;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EAeon Cargo SSTO\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RaDVV0B.png\u0022 alt=\u0022RaDVV0B.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been working on this ship for quite a while, and it has finally come to fruition. Inspired by \u003Ca href=\u0022https://www.youtube.com/user/G4Virus\u0022 rel=\u0022external nofollow\u0022\u003Epa1983\u0027s awesome interplanetary SSTOs \u003C/a\u003E, I decided to try something similar. The goal was to deliver a big, heavy rover to my little Duna colony with an SSTO. Ideally, accomplishing this all in one stage: Plane takes off, goes to Duna, lands, drops cargo, achieves Duna orbit, transfers home. On top of this, for playability, I wanted to try for less than 500 parts. This ship achieves many of those performance goals, but not all. A Tug will be needed for the planetary transfer between Kerbin and Duna, and the partcount is around 600 with a tug in place. This keeps the part count down to a playable 550 on the SSTO section (At least it is playable on my computer; see Tips section for performance tweaks). Oh well, you can\u0027t have it all.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HAlTndC.png\u0022 alt=\u0022HAlTndC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhile I was at it, I decided to try a few new things on this design with landing and payload delivery. Landing on Duna in a spaceplane is incredibly difficult. The atmosphere is very thin, and the terrain is... \u0022duney\u0022, making normal glide slope landings all but impossible in a large SSTO like this. Parachutes to the rescue! One can land this ship like a conventional powered vertical lander, slowing with aerospikes, or go for a fuel-saving powered paragliding-style landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/J3rDdNZ.png\u0022 alt=\u0022J3rDdNZ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPersonally I like using all those lifting surfaces and do the paragliding. Just make sure to hit f5!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/qHtVL5J.png\u0022 alt=\u0022qHtVL5J.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce landed, putt-putt around until you find a reasonably flat area to deliver the payload.\u003C/p\u003E\u003Cp\u003Eextend your kickstands [7], kneel the plane down [8], uncouple the payload, extend the main legs [9].\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3GADKjh.png\u0022 alt=\u00223GADKjh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/WejUJM0.png\u0022 alt=\u0022WejUJM0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow you can drive your rover out!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vZ2nYhs.png\u0022 alt=\u0022vZ2nYhs.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor take-off, find a gentle downward slope, turn RCS on, and hit the main engines. You can use the vertical Aerospikes [0] to help lift-off. There is plenty of gas and power to get back to Low Duna orbit, and if you were thrifty with fuel (use your NERVAs as much as possible, not the aerospikes), you can then make the transfer back to Kerbin on one tank.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nRM3Bkt.png\u0022 alt=\u0022nRM3Bkt.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETips:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1) For a huge performance gain with almost no discernible side effects, turn the physics passes down in your settings. \u0022Max Physics Delta-Time per Frame\u0022 is the setting, slide it to the right as much as needed. You can further tweak it in the Config file if you want to.\u003C/p\u003E\u003Cp\u003E2) Ascent on Kerbin is standard Air Hogging fare. Turn Engines off as needed, and accelerate at 30k altitude.\u003C/p\u003E\u003Cp\u003E3) When landing on Duna, chose the lowest point possible for easiest landing.\u003C/p\u003E\u003Cp\u003E4) For Kerbin reentry, the plane handles best with full Fuselage tanks, if you have left over fuel pump it to these parts. Do not fly at high angles of attack on reentry.\u003C/p\u003E\u003Cp\u003E5) Rover particulars: Lock stearing on the rear wheels, and turn off the motors on the front most wheels for maximum stability. The rover will do over 25 m/s on duna, but that is... \u0022Not Advised\u0022. \u003C/p\u003E\u003Cp\u003E6) The ship will function manned or unmanned. \u003Cem\u003E\u003Cstrong\u003EIf you elect to have a kerbal (or 5) on board, click the docking port on the nose and hit \u0022Control from Here\u0022 to orient everything appropriately.\u003C/strong\u003E\u003C/em\u003E \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAction Groups:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E[1]Outboard Jet Engines\u003C/p\u003E\u003Cp\u003E[2]Jets\u003C/p\u003E\u003Cp\u003E[3]Jets\u003C/p\u003E\u003Cp\u003E[4]NERVAs\u003C/p\u003E\u003Cp\u003E[5]Aerospikes\u003C/p\u003E\u003Cp\u003E[6]Air Intakes\u003C/p\u003E\u003Cp\u003E[7]Kickstands\u003C/p\u003E\u003Cp\u003E[8]Gear\u003C/p\u003E\u003Cp\u003E[9]Main Legs\u003C/p\u003E\u003Cp\u003E[0]Vertical Aerospikes\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/islbi7K.jpg\u0022 alt=\u0022islbi7K.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo there you have it, a big rover-dropping SSTO truck. One could easily repurpose this design for LKO payload delivery by deleting all the heavy landing apparatus, and slapping your own payload in. If you don\u0027t have much experience landing spaceplanes on Duna, you are going to crash it at first. I did, a lot. And frankly now that I have this under my belt, I probably won\u0027t revisit the idea for Duna. Conventional rocket powered landers really make more sense there, but where is the adventure in that?! Landing on Laythe, on the other hand, is a cinch in comparison. But I\u0027ll leave the particulars for you to discover. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/xar39nb6zsvf7fj/Aeon%20Cargo%20SSTO.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EDOWNLOAD Aeon Cargo SSTO\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-09T06:14:16Z\u0022 title=\u002212/09/2013 06:14  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 9, 2013\u003C/time\u003E by Exothermos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KissSh0t","CreatedById":57142,"CreatedDateTime":"2013-12-12T20:26:08Z","Content":"\n\u003Cp\u003EAeon Cargo is just crazy... I could never get the one I tried building based on it to even get into orbit xD\u003C/p\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2013-12-12T22:27:51Z","Content":"\n\u003Cp\u003EYeah, I\u0027m pretty happy with that one in general. I\u0027m working on a cargo craft to deliver payloads to LKO based on the construction of the Aeon, but it is fighting me, surprisingly. It works, but I want it to be an easy and enjoyable experience to get to orbit. I\u0027m fighting to avoid the 25 degre, half-hour climb to orbit that crafts with high payload fractions seem to suffer from. That means increasing the TWR for a more authoritative climb, which means more engines, and thus parts, which is computer-wrecking \u0022no fun\u0022.\u003C/p\u003E\u003Cp\u003EIt\u0027s a challenge, but if it were easy it would be boring!\u003C/p\u003E\n"},{"CreatedByName":"DeliciousPi","CreatedById":66696,"CreatedDateTime":"2013-12-18T04:20:18Z","Content":"\n\u003Cp\u003ESo... I\u0027m sure I\u0027m not the first to wonder this, but... are you going to be doing anything wih the new R.A.I.P.E.R. engines? In my personal experience so far, they make building SSTOs really, really easy... on my first try, I threw together 2 jet fuel tanks, 2 FLT 800s, and 2 R.A.I.P.E.Rs... and got into a 250 km orbit on first launch. WIth the jets/rockets combination, everyhing has taken at least 6 or 7 launches to work out. However, I would say that they are just short of being OP. (One nice thing is the instant response to throttle change in airbreathing mode... so nice...) I still think, however, that Jet \u002B Rockets is still the better option... I mean, I sent one of my spaceplanes to a duna landing without refueling using two nukes... if that\u0027s possible with the new engines without boatloads of rocket fuel, then I\u0027ll eat my metaphorical hat. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Also, the efficacy of the of the nukes means that you need less rocket fuel, which translates to less jet fuel to lift the rocket fuel, which results in smaller, faster, sleeker craft.\u003C/p\u003E\u003Cp\u003ETL;DR: The new engines are just short of OP, but for me, Jet \u002B Nuke combos are stil superior. Will you be doing any designs with the R.A.P.I.E.Rs?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T04:22:08Z\u0022 title=\u002212/18/2013 04:22  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by DeliciousPi\u003C/strong\u003E\n\u003Cbr\u003EClarification on one point\n\u003C/span\u003E\n"}]}