{"TopicId":37890,"ForumId":21,"TopicTitle":"Large LKO refueler, and update on the state of Exkalibur interplanetary vessel.","CreatedByName":"Mrspoonman09","CreatedById":73488,"CreatedDateTime":"2013-07-20T16:18:38Z","PageNum":1,"Articles":[{"CreatedByName":"Mrspoonman09","CreatedById":73488,"CreatedDateTime":"2013-07-20T16:18:38Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EHello everyone. I\u0027ve been rather industrious the past few nights on KSP, and I have a lot of exciting news and a new craft file for whoever wants it. \u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uabPGXM.jpg\u0022 alt=\u0022uabPGXM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELarge low kerbin orbit refueler: \u003Ca href=\u0022http://kerbalspaceprogram.com/large-lko-refueler/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/large-lko-refueler/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter some tweaking and optimization, I\u0027ve completed an improved version of my Exkalibur prototype in LKO. The current design stays pretty close to the original. Most noticeably, the solar panels were removed to make room for outriggers which house another 12 LV-N\u0027s. (the new build now has 24 engines). The other major change was an overhaul of the ascent stage for the middle section, although this has no effect whatsoever on the craft once it is in space, this adjustment should make assembly of the craft much more user friendly once I release it to you guys.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QZJGlUl.png\u0022 alt=\u0022QZJGlUl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn that note, I am ALMOST ready to let you guys try this thing out. I refuse, however, to put anything on the spaceport that i haven\u0027t had the opportunity to quality test yet. With this in mind, I plan to test the Exkalibur sometime this week with a maiden voyage to one of Kerbin\u0027s neighbors. If that trip turns out to be successful, I don\u0027t see any reason why I shouldn\u0027t upload the craft files.\u003C/p\u003E\u003Cp\u003EHere is your chance to help me out. The current Exkalibur build sports a whopping 8.7k deltaV. which is plenty for a round trip with payload to either Eve or Duna. I have a couple of ideas for missions to either of these planets, so I think i\u0027ll let you guys decide where to go. Should the Exkaliburs maiden voyage be to Duna to drop rovers and landers on the planet and its moon IKE? Or should the destinations be Eve, for some satellite insertions and extreme EVAs on Gilly. Also, if there is enough interest, I would LOVE to stream the trip live on twitch, so let me know when would be a good time to do that this week. I promise the stream will be exciting, either because of a successful trip signaling the imminent release of some sweet craft files, or because of a spectacular 450 tonne fireball.\u003C/p\u003E\n"},{"CreatedByName":"Dynamo","CreatedById":16626,"CreatedDateTime":"2013-07-21T04:39:36Z","Content":"\n\u003Cp\u003EMy word.... I\u0027ve never seen anything of this size and elegance. You\u0027ve got a better TWR/Delta-V ratio than i\u0027ve seen with some modded craft on the forums, and i\u0027d like to see more stats on this behemoth. It\u0027s definetely inspiring enough to get me back into the interplanetary designs (they\u0027re quite difficult!), but i don\u0027t know if i could even use it, the part count would probably give me a CPU meltdown!\u003C/p\u003E\u003Cp\u003EAwesome job, and inspiring work. Any tips on interplanetary design are appreciated!\u003C/p\u003E\n"}]}