{"TopicId":43796,"ForumId":21,"TopicTitle":"TSC SP13-E Albatross: VTOL SSTO Light Transport","CreatedByName":"Togs8896","CreatedById":77518,"CreatedDateTime":"2013-08-25T05:31:09Z","PageNum":1,"Articles":[{"CreatedByName":"Togs8896","CreatedById":77518,"CreatedDateTime":"2013-08-25T05:31:09Z","Content":"\n\u003Cp\u003EI recently established a colony on Laythe, but needed some way to ferry personnel and supplies from space to the surface and vice versa. Most of my current space plane designs couldn\u0027t land on anything short of a flat runway and the ones that could were only able to carry a single pilot. To solve this, I set out to design a plane which would meet the following criteria:\u003C/p\u003E\u003Cp\u003E- Must be able to carry at least 2 passengers.\u003C/p\u003E\u003Cp\u003E- Must have some sort of STOL capability.\u003C/p\u003E\u003Cp\u003E- Must be able to, under it\u0027s own power, achieve an orbit of 100,000 m around Kerbin to dock with my flag ship, the TSC Hawthorne.\u003C/p\u003E\u003Cp\u003E- Must look relatively cool (lets be honest, who cares if it functions if it\u0027s an eyesore).\u003C/p\u003E\u003Cp\u003EThe solution to this was found in the form of the TSC SP13-E Albatross (most of my ships top out at -B or -C. The -E on this represents the hours put into making a working prototype...).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.bf2s.com/files/user/14407/SP13-1.jpg\u0022 alt=\u0022SP13-1.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Albatross is equipped with two rear-facing turbojet engines, as well as two downward-facing jets to achieve vertical flight. It is 100% capable of VTOL operations, making flight into rough terrain much more manageable. Additionally, it sports a single LV-T30 for flight out of atmosphere. The craft is equipped with two single seat landing cans behind the docking bay allowing for a total capacity of 3 Kerbals, including the pilot.\u003C/p\u003E\u003Cp\u003EBecause of the ship\u0027s ability to make it to orbit and dock with The Hawthorne, I was able to strap two down and transport them to Laythe.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.bf2s.com/files/user/14407/SP13-2.jpg\u0022 alt=\u0022SP13-2.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.bf2s.com/files/user/14407/SP13-3.jpg\u0022 alt=\u0022SP13-3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce in orbit around Laythe, the Hawthorne proceeded to serve as an orbital base/fuel station for the SP13s as they ferried crew to and from the surface\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.bf2s.com/files/user/14407/SP13-4.jpg\u0022 alt=\u0022SP13-4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.bf2s.com/files/user/14407/SP13-5.jpg\u0022 alt=\u0022SP13-5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThankfully, each Albatross is capable of leaving a 75,000 m Laythian orbit, landing at the colony, and returning back to the Hawthorne with ample fuel left over.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.bf2s.com/files/user/14407/SP13-6.jpg\u0022 alt=\u0022SP13-6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.bf2s.com/files/user/14407/SP13-7.jpg\u0022 alt=\u0022SP13-7.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://static.bf2s.com/files/user/14407/SP13-8.jpg\u0022 alt=\u0022SP13-8.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI am very pleased with these so far and am currently working on ways to refuel them on the ground on Laythe from my surface fuel silo.\u003C/p\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2013-08-25T08:52:37Z","Content":"\n\u003Cp\u003E...Wow.\u003C/p\u003E\u003Cp\u003EDo you have any tips for making SSTOs? I have only one design and it only gets up to 70Km with barely more than enough to deorbit.\u003C/p\u003E\n"},{"CreatedByName":"littlebattler","CreatedById":73508,"CreatedDateTime":"2013-08-25T10:38:51Z","Content":"\n\u003Cp\u003EOho\u003C/p\u003E\u003Cp\u003EGood job there, although Albatross is usually a name given to ships with huge wings.\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2013-08-25T13:11:17Z","Content":"\n\u003Cp\u003Ewas this made with or without part clipping enabled?\u003C/p\u003E\n"},{"CreatedByName":"shoveycat","CreatedById":71091,"CreatedDateTime":"2013-08-25T14:50:52Z","Content":"\n\u003Cp\u003EWouldn\u0027t happen to have a download link?\u003C/p\u003E\n"},{"CreatedByName":"Togs8896","CreatedById":77518,"CreatedDateTime":"2013-08-25T16:51:16Z","Content":"\n\u003Cp\u003EMy best tips that have helped me with my SSTOs are:\u003C/p\u003E\u003Cp\u003E- Less is more. Ive found more fuel and more engines generally just complicates things and makes it harder to fly. My first space plane munar landing was done with a craft that had 6 jets and 3 rockets. Now I do it with 2 jets and 1 rocket.\u003C/p\u003E\u003Cp\u003E- You need all the air intake you can get. The secret to SSTOs I\u0027ve found, is you need to get insanely high up on jet engines to reach high speeds for orbit and you can only do this with more intake air. Also, set only 1 or 2 intakes on one key and the rest on the other. This way, you can cut down drag by keeping the majority of the intakes closed until you need them.\u003C/p\u003E\u003Cp\u003E- Figure out the best method to climb. Depending how you climb to orbit will affect how much fuel you have to get there. Some planes i fly go at gentle slants, where as others like this one, I fly practically straight up.\u003C/p\u003E\u003Cp\u003E- Finally, weight shedding helps immensely. I was about to give up on this design because it couldn\u0027t even make orbit, but I ended up halving the RCS tanks and deleting a few small parachutes and RCS thrusters, and now It can make that 100,000 m orbit (barely haha).\u003C/p\u003E\u003Cp\u003EAs far as creating the ship goes, there are a few slightly clipped parts but it was all done in the standard SPH without parts clipping enabled. And, as with all my craft, this was created and flown entirely without mods.\u003C/p\u003E\u003Cp\u003ELink to the craft:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./?n7g5deahxc7ctrn\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./?n7g5deahxc7ctrn\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOPERATIONS MANUAL:\u003C/p\u003E\u003Cp\u003EKey Bindings:\u003C/p\u003E\u003Cp\u003ENOTE: Key bindings are set back to allow for mother ship key bindings in the 1-4 spots\u003C/p\u003E\u003Cp\u003E5: Toggle primary jet engines \u0026amp; toggle primary intakes\u003C/p\u003E\u003Cp\u003E6: Toggle VTOL jet engines\u003C/p\u003E\u003Cp\u003E7: Toggle rocket engine\u003C/p\u003E\u003Cp\u003E8: Toggle secondary intakes\u003C/p\u003E\u003Cp\u003E9: Toggle RCS thrusters (so not to interfere with mothership RCS)\u003C/p\u003E\u003Cp\u003EAbort: Shutdown all engines\u003C/p\u003E\u003Cp\u003ENOTE: Prior to takeoff, close secondary air intakes (8), and monitor air intake for flight. Be sure to initially start main jets with staging (space bar) to link primary intakes with engines.\u003C/p\u003E\u003Cp\u003EKerbin Ops:\u003C/p\u003E\u003Cp\u003ERated at a 100,000 m orbit for climb, orbit and re-entry.\u003C/p\u003E\u003Cp\u003E- Climb straight up, maintaining 66-68 m/s, open second intakes at \u0026lt;0.11 air intake\u003C/p\u003E\u003Cp\u003E- Pitch down to 3 degrees at air intake \u0026lt;.30 and gain speed while adjusting pitch to keep prograde vector between 2 and 5 degrees\u003C/p\u003E\u003Cp\u003E- At 1350 m/s, shutdown jets, close secondary intakes, engage rockets and climb at 50 degrees into orbit. NOTE: If having trouble gaining airspeed, gain altitude to reduce air resistance.\u003C/p\u003E\u003Cp\u003ELaythe Ops:\u003C/p\u003E\u003Cp\u003ERated to 75,000 m orbit (easily passable)\u003C/p\u003E\u003Cp\u003E- Climb up at 80 degrees, open second intakes at \u0026lt;0.11 air intake, and pitch down to 50 degrees.\u003C/p\u003E\u003Cp\u003E- Lead prograde vector down until about 10 degrees and maintain above 0.14 air intake.\u003C/p\u003E\u003Cp\u003E- At 1350 m/s, shutdown jets, close secondary intakes, engage rockets and climb at 50 degrees into orbit\u003C/p\u003E\u003Cp\u003EDISCLAIMERS:\u003C/p\u003E\u003Cp\u003E- This ship has a slight center of gravity problem in orbit, so firing the main rocket will require some manual course corrections.\u003C/p\u003E\u003Cp\u003E- I never really tried too hard to place the RCS thrusters. They work just fine, but are not perfectly aligned with center of mass.\u003C/p\u003E\u003Cp\u003E- When using only the VTOL engines, the secondary intakes may need to be opened to compensate for the closed primary intakes.\u003C/p\u003E\u003Cp\u003E- Also, the ship can make 100 km orbit (that\u0027s about it), but slight missteps on the ascent to orbit can drastically reduce fuel efficiency.\u003C/p\u003E\u003Cp\u003E- Finally, the rear passenger ladder is mostly for show. The Kerbals can\u0027t really fit their fat heads between the intakes and the forward horizontal stabilizers lol. \u003C/p\u003E\u003Cp\u003EEnjoy! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-25T20:38:26Z\u0022 title=\u002208/25/2013 08:38  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 25, 2013\u003C/time\u003E by Togs8896\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"meve12","CreatedById":65193,"CreatedDateTime":"2013-08-25T22:04:45Z","Content":"\n\u003Cp\u003EDecided to take \u0022less is more\u0022 to heart.\u003C/p\u003E\u003Cp\u003EI now have a singleseat SSTO capable of a 100kmx100km(ish) orbit and return(barely). Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Togs8896","CreatedById":77518,"CreatedDateTime":"2013-08-26T23:13:45Z","Content":"\n\u003Cp\u003EAwesome, congrats! Really glad I could help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"trebor1982","CreatedById":92487,"CreatedDateTime":"2014-04-17T21:40:11Z","Content":"\n\u003Cp\u003EWhat has happened to the pictures of the Albatross and the Hawthorne on this page, they have just disappeared\u003C/p\u003E\n"},{"CreatedByName":"Togs8896","CreatedById":77518,"CreatedDateTime":"2014-08-02T23:31:19Z","Content":"\n\u003Cp\u003EApparently the image host I used last year is dead now unfortunately. May get around to updating the links at some point.\u003C/p\u003E\n"}]}