{"TopicId":44870,"ForumId":21,"TopicTitle":"White Dart. Now updated to 0.23!","CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-03T23:09:37Z","PageNum":1,"Articles":[{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-03T23:09:37Z","Content":"\n\u003Cp\u003EHey guys! The White Dart SSTO is now mostly tested, and because the design went so well, the engineers at R-SUV went ahead and modified the prototype to create two different serial models to appeal to the discerning customer, a VTOL and a nuclear powered long-range scout. Not that the prototype is short range (flown right, there is enough for a KSO mission and return to runway), but it is equipped with landing gear to allow tail landings on airless moons. But, you know, the discerning customer, mostly wants something that looks good and fast. This achieves both objectives with a minimal part count and awesome performance. And I seriously don\u0027t really know how I got it to look so... well, \u003Cem\u003Eclean\u003C/em\u003E. I just love it. Ladies and gentlemen, the SSTO previously known as Mk XIX:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWHITE DART\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/ZvyRt0q\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ZvyRt0q.jpg\u0022 alt=\u0022ZvyRt0q.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWith the latest in Stabojet Technology to avoid flameout disasters, the whole family is an atmospheric airhogger that can get to terrifying speeds and altitudes thanks to the good T/W ratio on jets. As such, the main rocket propulsion should only be used to provide 200-400 m/s on the climb to orbit: Milk those turbojets as long as you can! The prototype also has amazing T/W on rocket power, so if you don\u0027t like tedious waits on the way to orbit, that is definitely your version. It also has somewhat cleaner lines, with less parts due to the missing subsystems. But if you are after efficiency or plain VTOL awesomeness, the other two versions get the added performance at the cost of a low T/W ratio outside of the atmosphere, so remember to make sure you keep your apoapsis in front of you during the climb to orbit with them.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EUpdate!\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ECelebrating 0.23 and the RAPIER engine, here\u0027s a complete rebuild of the White Dart. Look how SSTOrgeous it looks\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/zFHmi8S\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/zFHmi8S.png\u0022 alt=\u0022zFHmi8S.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI know, pretty much the same. But there are changes, and they are substantial! First, a single engine means way less T/W on jets. No more vertical climbs, but the reduced engine weight gives is much better mass ratio, and should give it more delta-v than the previous chemical version. Won\u0027t be able to hold a candle against the old nuke version, though, but it\u0027ll have much better T/W. Also, the reduced weight means better aerodynamic characteristics due to low wing loading, and I finally gave up and installed almost hidden frontal control surfaces, so maneuverability is truly spectacular.\u003C/p\u003E\u003Cp\u003EThe VTOL system is also new and shiny: a cluster of rockomax 48-7S\u0027s gives it enough T/W to lift on kerbin (though it eats fuel like there is no tomorrow) adding very little weight and instant response, allowing for controlled landings in airless bodies or bodies with a thin atmosphere.\u003C/p\u003E\u003Cp\u003EAlso, part count efficiency has increased dramatically: just 50 parts in total! Courtesy of editor tools (for the surface attachment option) and a simple layout, I guess. I didn\u0027t even had to clip the intakes...\u003C/p\u003E\u003Cp\u003EAnyhow, file added to the collection!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EImgur Album:\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/F8hBc\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EDownloads:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/d7je7j94hhkhhk5/White_Dart.craft\u0022 rel=\u0022external nofollow\u0022\u003EWhite Dart Prototype\u003C/a\u003E - Beginners and casual flights up to KSO.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/p633u09eqwqp8bx/White_Dart_Nuke.craft\u0022 rel=\u0022external nofollow\u0022\u003EMunar version\u003C/a\u003E - Nuke powered! Likely interplanetary in fact, but you know, cramped cockpits. Remember to airhog like there is no tomorrow.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/8wd8xmwoxydba7r/White_Dart_VTOL.craft\u0022 rel=\u0022external nofollow\u0022\u003EVOTL version\u003C/a\u003E - LKO only, advanced players. You could switch the jet engines with LV-909\u0027s to achieve low-gravity or Duna VTOL landings.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUpdate!\u003C/strong\u003E \u003Ca href=\u0022http://www./download/xka3x7lygo4rugx/White\u002BDart\u002B0_23.craft\u0022 rel=\u0022external nofollow\u0022\u003E0.23 rebuild\u003C/a\u003E - Now sporting a single RAPIER and optional rocket VTOL capabilities.\u003C/p\u003E\u003Cp\u003ERune. Beauty as well as brains.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-02T22:15:49Z\u0022 title=\u002201/02/2014 10:15  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 2, 2014\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cupcake...","CreatedById":62843,"CreatedDateTime":"2013-09-04T01:39:16Z","Content":"\n\u003Cp\u003ENow that\u0027s what I call a work of art, it\u0027s just beautiful! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECupcake...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-04T02:08:36Z\u0022 title=\u002209/04/2013 02:08  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 4, 2013\u003C/time\u003E by Cupcake...\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASI Director","CreatedById":64746,"CreatedDateTime":"2013-09-04T01:54:48Z","Content":"\n\u003Cp\u003EAgreed with Cupcake. \u003C/p\u003E\u003Cp\u003EAlso, stealing is such a harsh word on these forums. I prefer the term reverse-engineering.\u003C/p\u003E\n"},{"CreatedByName":"M.Wolfy","CreatedById":76904,"CreatedDateTime":"2013-09-04T06:25:11Z","Content":"\n\u003Cp\u003EGorgeous is an understatement rune \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Levelord","CreatedById":57711,"CreatedDateTime":"2013-09-04T07:39:58Z","Content":"\n\u003Cp\u003EVery sleek and streamlined. I even like how you\u0027ve hidden the intakes under the wings \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ep.s. Is it using Stabojet technology? I can\u0027t tell from the screenshots.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-04T08:30:09Z","Content":"\n\u003Cp\u003EThanks guys! I\u0027m glad you like it as much as I do, when I saw the prototype, I said to myself: now that is my new standard one-man SSTO.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Levelord\u0022 data-cite=\u0022Levelord\u0022\u003E\u003Cdiv\u003EVery sleek and streamlined. I even like how you\u0027ve hidden the intakes under the wings\u003Cp\u003Ep.s. Is it using Stabojet technology? I can\u0027t tell from the screenshots. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes it does. 10Ã‚Âº each engine, and it\u0027s not perfect, but that is why it\u0027ll only deviate a bit to the left before correcting itself on flameouts. Good to know wehn you should throttle down a bit, and it makes the intakes look awesome (the intake ratio is 6-1, BTW, and each has its own cubic strut to clip in and still, you hardly see them except as one big intake on each side). Plus, this way the aviation fuel is completely separate from the rocket fuel. Some confusion editing saw the second paragraph, with most of the interesting explanations, go away. I should post when I\u0027m more awake, I guess.\u003C/p\u003E\u003Cp\u003ERune. Now the other part comes: take it places! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-04T08:32:33Z\u0022 title=\u002209/04/2013 08:32  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 4, 2013\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-09-04T12:26:56Z","Content":"\n\u003Cp\u003Esomething looks familiar here lol\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-04T12:50:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003Esomething looks familiar here lol \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFamiliar to what? Someone else already said something, but I don\u0027t get it. Mind pointing me to a link so I get the reference?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-04T14:32:00Z\u0022 title=\u002209/04/2013 02:32  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 4, 2013\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thescientist","CreatedById":69046,"CreatedDateTime":"2013-09-04T13:11:57Z","Content":"\n\u003Cp\u003EGreat! It\u0027s one of the best SSTO that I\u0027ve ever seen!\u003C/p\u003E\u003Cp\u003EEdit: How do you balanced the VTOL version? Works very good and with a little of practise even a noob as me can fly her decently.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-05T09:10:31Z\u0022 title=\u002209/05/2013 09:10  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 5, 2013\u003C/time\u003E by thescientist\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Firenexus13","CreatedById":67143,"CreatedDateTime":"2013-09-04T15:02:45Z","Content":"\n\u003Cp\u003Ethis is a very good SSTO, i will test the nuke one soon\u003C/p\u003E\n"},{"CreatedByName":"Pogosi","CreatedById":81142,"CreatedDateTime":"2013-09-04T22:08:56Z","Content":"\n\u003Cp\u003ELove the wing design, flies well from my experience \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cinocal","CreatedById":54959,"CreatedDateTime":"2013-09-06T04:36:58Z","Content":"\n\u003Cp\u003ELove the look of it, but it didn\u0027t like FAR. CoL is too far forward in FAR. Sweet none the less!\u003C/p\u003E\n"},{"CreatedByName":"littlebattler","CreatedById":73508,"CreatedDateTime":"2013-09-06T06:22:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EFamiliar to what? Someone else already said something, but I don\u0027t get it. Mind pointing me to a link so I get the reference?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s probably just the wing arrangement. The small delta at the front, wide delta at the back is pretty commonly used. I use them on almost everything even since they look so good, although I don\u0027t like using them for the underside of the hull. Asymmetry is nice y\u0027know.\u003C/p\u003E\u003Cp\u003EStill, great plane as usual. If you can make a cargo version it would be perfect.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-06T08:29:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022littlebattler\u0022 data-cite=\u0022littlebattler\u0022\u003E\u003Cdiv\u003EIt\u0027s probably just the wing arrangement. The small delta at the front, wide delta at the back is pretty commonly used. I use them on almost everything even since they look so good, although I don\u0027t like using them for the underside of the hull. Asymmetry is nice y\u0027know.\u003Cp\u003EStill, great plane as usual. If you can make a cargo version it would be perfect. \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, Hoy already explained himself by PM and it was more about the depot with the two White Darts docked in the album, it reminded him of one of his stacks. The picture is there to show that they are pretty balanced even if you use different versions, and the whole arrangement is subtly different (i.e: despite appearances, that\u0027s a tractor design), but he is more or less right: bunching things around orange tanks to send them interplanetary in one big bunch is something we all do.\u003C/p\u003E\u003Cp\u003EThat double delta, though, sure looks gorgeous. I also try to put it everywhere, but this is the best I\u0027ve gone about it. I also seriously like the forward reverse sweep winglets: Totally useless, but they look cool.\u003C/p\u003E\u003Cp\u003EStill, I don\u0027t know about a cargo version. I\u0027m going to arm them with hardpoints at the wings, just where the delta angle switches (it\u0027s close to the CoM), so I guess you could say \u0022probe launcher\u0022 as well, but the whole build is not very resistant to stability changes so any serious payload would need adjusting the CoL with lifting surfaces, and I don\u0027t see how to integrate that without ruining the looks.\u003C/p\u003E\u003Cp\u003EIn the end, this does its job: a very high performing single seater, for those times that you just want to fly somewhere, and not go all complicated and smart about it.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ELove the look of it, but it didn\u0027t like FAR. CoL is too far forward in FAR. Sweet none the less! \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry then, you\u0027ll have to take those sexy winglets and replace then with much more reasonable canards to get more control authority. You\u0027ll ruin the looks, but it\u0027s like I said before: its on the verge of uncontrollability due to excessive stability, so not very forgiving with changes in design, but I had to compromise \u003Cem\u003Esomewhere\u003C/em\u003E to get those looks. In this case, the compromise is the plane only flies great with the CoM very tightly in check, and if not it flies very poorly (the VTOL development version without the reaction wheels, for example, turned out to become a very expensive lawn dart incapable of pulling up out of a dive, because the CoM was a tad more to the front of the CoL. Kod how I love our new magical reaction wheels). Yet the plane will never flip out on you as it is, and if you make it, it will recover on its own. So I\u0027m calling it \u0022sorry, it works for stock\u0022, and not messing up with it further. Chances are I would only screw things up anyway ^^\u0027.\u003C/p\u003E\u003Cp\u003ERune. There are, however, a couple more pics in the album... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-06T08:33:23Z\u0022 title=\u002209/06/2013 08:33  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 6, 2013\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"drewscriver","CreatedById":77979,"CreatedDateTime":"2013-09-08T03:26:43Z","Content":"\n\u003Cp\u003EWhat version are these? When I tried to test it, KSP complained they were a different version...\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-08T10:34:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022drewscriver\u0022 data-cite=\u0022drewscriver\u0022\u003E\u003Cdiv\u003EWhat version are these? When I tried to test it, KSP complained they were a different version...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWeird, because I have downloaded the game on a different computer yesterday (last version of course), downloloaded the files, and used them myself. In fact, I\u0027ve never seen that \u0022not from this version\u0022 message myself, though I download few things. Anyhow, it should be 0.21.1. Does it not let you fly it, or is it a non-problem like using a SPH ship on the VAB, for example?\u003C/p\u003E\u003Cp\u003ERune. The wonders of playing alpha.\u003C/p\u003E\n"},{"CreatedByName":"drewscriver","CreatedById":77979,"CreatedDateTime":"2013-09-08T14:32:44Z","Content":"\n\u003Cp\u003EHmm, I suppose it would help if I was more specific...\u003C/p\u003E\u003Cp\u003EI have 0.21.1.276 - according to the loading screen (steam version, so it should keep me current).\u003C/p\u003E\u003Cp\u003EI dropped the three files in the SPH folder (stock). I go to the SPH, and when I click the load button, a dialog box pops up: \u0022There are incompatible craft files in the folder. Would you like to delete them?\u0022 If I click \u0027Not Now\u0027, the ships are listed in the folder, but grayed out.\u003C/p\u003E\u003Cp\u003EI don\u0027t have any modded parts (only plugins are subassembly loader, alarm clock and RCS build aid) You mentioned the craft was stock, so I assumed it was a version issue.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-08T16:18:17Z","Content":"\n\u003Cp\u003EOk, now I am more puzzled still. I just did everything you should have done (download the files, put them in the stock folder, etc) with a windows 0.21.1.276 version I dowloaded yesterday from the store, and they work without issues. Not that the version that I run on my main desktop isn\u0027t up to date, and I built them there. What OS do you run, and why does KSP hate you so much? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ERune. Can someone help him?\u003C/p\u003E\n"},{"CreatedByName":"Tankbuster32","CreatedById":59371,"CreatedDateTime":"2013-09-08T18:29:28Z","Content":"\n\u003Cp\u003Ewhy does the forum not allow me to rep you, it doesn\u0027t even say anything! Also great craft! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"drewscriver","CreatedById":77979,"CreatedDateTime":"2013-09-08T22:47:03Z","Content":"\n\u003Cp\u003EI\u0027m running Windows 7, and usually KSP is pretty well behaved. I\u0027ve downloaded a number of other craft without issue - Cupcake\u0027s VTOLs, and G4Virus\u0027s SSTOs, to name a couple\u003C/p\u003E\n"},{"CreatedByName":"LiquidKameleon","CreatedById":59259,"CreatedDateTime":"2013-09-09T17:13:46Z","Content":"\n\u003Cp\u003ELooks amazing, I might try it out.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-10T19:38:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027m running Windows 7, and usually KSP is pretty well behaved. I\u0027ve downloaded a number of other craft without issue - Cupcake\u0027s VTOLs, and G4Virus\u0027s SSTOs, to name a couple\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDude, I\u0027m sorry I can\u0027t be more help. Is anybody else having the same issue? Might be worth reporting it as a bug, if only so someone with more knowledge of the inner workings of KSP explains to us what is going on. I just can\u0027t replicate the bug... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003ERune. I also run win 7 right now, it\u0027s really really weird.\u003C/p\u003E\n"},{"CreatedByName":"prysmatik","CreatedById":59964,"CreatedDateTime":"2013-09-11T13:24:27Z","Content":"\n\u003Cp\u003Edrewscriver,\u003C/p\u003E\u003Cp\u003E Try to download them again, incase there was a file corruption problem? The White Dart Nuke I DL\u0027d had an MD5 of AA6B722E868ABF568754931AF281349B.\u003C/p\u003E\u003Cp\u003EMaybe that\u0027s what has caused the problem?\u003C/p\u003E\n"},{"CreatedByName":"drewscriver","CreatedById":77979,"CreatedDateTime":"2013-09-11T14:35:09Z","Content":"\n\u003Cp\u003EI tried downloading it twice - got the same error both times. I\u0027ve also seen the error on one other download so far, the stabojet examples. I\u0027d suspect it was a mod issue, if I didn\u0027t know stabojet was just a part arrangement.\u003C/p\u003E\n"},{"CreatedByName":"Mokmo","CreatedById":62363,"CreatedDateTime":"2013-09-13T22:50:20Z","Content":"\n\u003Cp\u003ECongratulations, Mr Rune, your basic White Dart became the first Spaceplane i ever docked to a station.\u003C/p\u003E\n"}]}