{"TopicId":45390,"ForumId":21,"TopicTitle":"BluPlanet Release: Sirius I launcher","CreatedByName":"Kerbol Prime","CreatedById":57626,"CreatedDateTime":"2013-09-09T03:06:01Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbol Prime","CreatedById":57626,"CreatedDateTime":"2013-09-09T03:06:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SuperWeegee4000\u0022 data-cite=\u0022SuperWeegee4000\u0022\u003E\u003Cdiv\u003EWHAT\u0027S THIS?! SUPERWEEGEE4000 MADE A ROCKET?! YOU\u0027RE A ROVER ENGINEER! KNOW YOUR PLACE, MAGGOT!!\u003Cp\u003EOkay, okay, I am a \u003Cem\u003Erover\u003C/em\u003E engineer, but after witnessing this rocket\u0027s capabilities, I absolutely had to share it. I guess people will accept \u0022Honorary Rocket Engineer\u0022 as a secondary title, in addition to my entirely primary job of rover engineer. I doubt I\u0027ll be releasing any more rockets - but if you have a request for a rover, feel free to let me know.\u003C/p\u003E\u003Cp\u003EI present to you: The Sirius I Heavy Launch Vehicle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s22.postimg.org/t05c89ght/screenshot15357.png\u0022 alt=\u0022screenshot15357.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(I\u0027m just going to resize these images to 640x480 so Postimage will stop giving me the bird.)\u003C/p\u003E\u003Cp\u003EThe Sirius I is a massive lifter straight out of the Crazy Corner that is my brain. Every engine is a Mainsail for maximum lifting power - just keeping the throttle at one notch below max will keep them from overheating.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s16.postimg.org/hi2zgfbp1/screenshot15271.png\u0022 alt=\u0022screenshot15271.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhy is it that all my launches have to be at night? Rrrgh....\u003C/p\u003E\u003Cp\u003EAnyway, the Sirius I is capable of putting a Jumbo 64 into a 100 kilometer circular orbit with an incredible surplus of fuel to spare.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s10.postimg.org/goir4gegp/screenshot15276.png\u0022 alt=\u0022screenshot15276.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWith such a long, heavy payload, it gets a little wobbly during the climb inside the bulk of the atmosphere. However, its flight path isn\u0027t really affected.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s18.postimg.org/jfkh9g9ih/screenshot15282.png\u0022 alt=\u0022screenshot15282.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGravity turn at around 10,000 meters. Standard stuff.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s24.postimg.org/4q6st415h/screenshot15287.png\u0022 alt=\u0022screenshot15287.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt is recommended that you do NOT remove the reaction wheels if you want to turn the rocket 90 degrees within the next century.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s11.postimg.org/6bw4xhfqb/screenshot15296.png\u0022 alt=\u0022screenshot15296.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGet your apoapsis to about 100 kilometers and burn about 25 seconds beforehand. The second stage will run out of fuel at this point.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s23.postimg.org/iaar0atmj/screenshot15307.png\u0022 alt=\u0022screenshot15307.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow you\u0027re in orbit with half your third-stage fuel left. Congratulations.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s16.postimg.org/hfxci6t4l/screenshot15329.png\u0022 alt=\u0022screenshot15329.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou can even land it again. Below: All that survived. Oh, I can land. Just not without landing legs.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s14.postimg.org/cddg6zt01/screenshot15355.png\u0022 alt=\u0022screenshot15355.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Sirius I has not yet been weight-tested. If you possess a data readout modification such as Kerbal Engineer, feel free to take a look at its payload limit. Craft file comes with test payload (the probe core and above).\u003C/p\u003E\u003Cp\u003E.craft: \u003Ca href=\u0022http://www./download/f6zc2a182yjzgw3/Sirius_I.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/f6zc2a182yjzgw3/Sirius_I.craft\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECEO Note: Isn\u0027t it great when your employee makes a showcase for you instead of you having to type every...single...letter? It\u0027s the little things.\u003C/p\u003E\n"}]}