{"TopicId":45726,"ForumId":21,"TopicTitle":"Bat\u0026#039;leth SSTO VTOL Shuttlecraft. Live long and prosper!","CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-12T15:57:00Z","PageNum":1,"Articles":[{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-09-12T15:57:00Z","Content":"\n\u003Cp\u003ESo, with ample inspiration from the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/41898-Shuttlecraft-Systems-Inc-%28SSI%29-NOW-HIRING%21\u0022 rel=\u0022external nofollow\u0022\u003ESSI thread\u003C/a\u003E, I went about creating the kerbal equivalent of a shuttle from Star Trek. And if I may say so myself, the results were great! The test flight was from runway, to VAB, then 120 circular orbit, then back to VAB roof. Because of reasons. I must warn you all, it\u0027s a complicated and demanding ship, and it\u0027s still not perfectly balanced. The reaction wheels allow full control at all times, even ignoring assimetrical flameouts and unbalaced fuel loads, but the ship has a tendency to not stick to exactly where you are pointing. Lots of manual flying to be precise on burns. Also, although I added boost engines, the full potential of this craft on range is very dependant on a good climb to orbit. The way this works best for this craft, is to level at about 25kms, build speed more or less horizontal until 1,500m/s, then light the rockets (I did so at 27,000m, see the album for details) in a soft climb to build vertical speed with good T/W, and then hope you can reach 1,800m/s or thereabouts before flameouts force you to go under 50% thrust (at around 30kms). Then turn off the jets and throttle back up, this is where you might turn on the boost engines, but I had a good trajectory so I didn\u0027t bother in the test flight. BTW, the underside has slightly changed from the prototype I first showed:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/iMc6QJ6\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/iMc6QJ6.png\u0022 alt=\u0022iMc6QJ6.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGone are the bulky LV-909\u0027s, thanks to Claire and the 48-7S goodness. Also, as you can deduce from this picture, the jet fuel is surprisingly well measured. After the whole flight, I only had to dip into the rocket fuel tanks for two liters (I actually transfered more, just in case, then put it back). BTW, the two are separate, but that\u0027s because I am a bit OCD about having a good fuel/oxidizer ratio on my tanks.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/5legI3l\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/5legI3l.jpg\u0022 alt=\u00225legI3l.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhen coming back down, there was a hairy moment when I turned on the VTOL engines where the craft pitched up like a wild bronco. I got scared as hell, but apparently all it wanted to do was to bleed off horizontal speed, and \u003Cem\u003Efast\u003C/em\u003E. So since it is a decent glider, I would advise to transition back to VTOL at low speeds, and with a decent clearance to the ground. Don\u0027t worry, I made it to the VAB in the end without quickload, so you should be able to do so too, I\u0027m no piloting genius and I use a keyboard to play (and an unfamiliar keyboard this time). Without further due, the pics to prove my exploits, and the file I know you are waiting for. From pic 4 onwards on the album, that\u0027s the test flight, chronologically ordered, and without quickload used (but a jump to the SPH to fix a fuel line issue on the boost engines once on orbit). Oh, one final detail, I got around to pin a name on it. Putting my naming scheme next to obvious Start Trek inspiration yielded one equally obvious solution: ladies and gentelman, I am proud to present, the Bat\u0027leth Shuttlecraft. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIMGUR ALBUM:\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/DAjck\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EDOWNLOAD:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/n8mhj4upqk921j9/Batleth_Shuttlecraft.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/n8mhj4upqk921j9/Bat\u0027leth_Shuttlecraft.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERune. Forgot to add the usual \u0022funny\u0022 signature at the end. How could I! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-12T16:05:35Z\u0022 title=\u002209/12/2013 04:05  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 12, 2013\u003C/time\u003E by Rune\u003C/strong\u003E\n\u003C/span\u003E\n"}]}