{"TopicId":50067,"ForumId":21,"TopicTitle":"Odd rockets and ships","CreatedByName":"RSF77","CreatedById":88474,"CreatedDateTime":"2013-10-22T17:33:07Z","PageNum":1,"Articles":[{"CreatedByName":"RSF77","CreatedById":88474,"CreatedDateTime":"2013-10-22T17:33:07Z","Content":"\n\u003Cp\u003EI\u0027ve been playing around with extraplanetary launchpads lately and even though I have yet to set up a functioning launchpad on the mun, I did devise what I think to be an interesting method of getting a smelter there. For ocd reasons I couldn\u0027t allow myself to carry the smelter \u0022upright\u0022 as it is in the design hangar and it took some serious playing around and one massive subassembly but I finally did it!\u003C/p\u003E\u003Cp\u003EAbout the only way I could think of to carry it this way was with a rocket and lander pulling it to space instead of pushing it, kind of tricky since this disallows a main thruster right down the center of mass and thrust. Also, the smelter is very wide on one axis so that limits the boosters I can strap to it and when turned on its side it screws with the symmetry option in the vehicle hangar so a large subassembly was required.\u003C/p\u003E\u003Cp\u003EWhat I did is I made a simple smelter as it will sit on the mun with nothing much other than a huge battery from the near future mod and some attachment points, I figured a clamp-o-jr and a KAS fuel valve would do until I see if this works. After that I crafted the rest of the rocket and lander in its entirety as a subassembly to be attached to the top of the smelter, this was to make sure that I got everything symmetrical enough that hopefully I wouldn\u0027t run into \u003Cem\u003Etoo many\u003C/em\u003E stability issues. Well... what I got was this monstrosity:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4zB056l.jpg\u0022 alt=\u00224zB056l.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI plopped a large flat fuel tank on top of a lander that somewhat resembles a water spider then strapped two massive boosters to either side of it using KW Rocketry Griffon XX engines, some of the biggest engines in my part collection and combined I believe they are about on par with that ridiculously power engine from Novapunch. Overkill? Maybe.\u003C/p\u003E\u003Cp\u003EI also think I might have just invented a new kind of staging, not sure what you would call this. The large Griffon XX boosters feed from the heavy fuel tank on top first (yes, they are actually attached to that and its a little inefficient). From there the two auxiliary boosters feed from the large boosters, these two smaller boosters are meant to help with vectoring and the final burn for orbit as the two Griffon XX boosters can push the apoapsis all the way up to a good 90 km or so. Then the four atomic engines which i\u0027ve hidden inside fuel tanks feed from the aux boosters and also feed from the central fuel tank on the lander, though I usually disable fuel flow from the central lander tank until the final burn.\u003C/p\u003E\u003Cp\u003EThe large boosters eject, the large top tank ejects forward when coasting, the aux boosters eject and when it gets to orbit it looks like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BK3xRAv.png\u0022 alt=\u0022BK3xRAv.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA water spider with a smelter strapped to the back of it.\u003C/p\u003E\u003Cp\u003EWithout RCS help it maneuvers around like a cinderblock, but I did place some high power RCS thrusters on it to help and some tanks are on the bottom of the lander. I plan on using the top docking port to attach an assist module to it with more RCS fuel and liquid fuel to pull it to the mun, its got enough dv left to make it to the mun but im not so sure about the landing and definitely not the return.\u003C/p\u003E\u003Cp\u003EIt\u0027s completely reusable as well for lifting and carrying payloads of various heights:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cApZlSC.png\u0022 alt=\u0022cApZlSC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYay! Infernal Robotics. Maybe not as impressive as some of your crafts, but I can\u0027t believe I actually made this thing functional even if its not the most realistic.\u003C/p\u003E\u003Cp\u003EWhat are some of your odd rockets and ships that you\u0027ve made?\u003C/p\u003E\n"}]}