{"TopicId":55351,"ForumId":21,"TopicTitle":"Minmus Ion hovercraft","CreatedByName":"Ojimak","CreatedById":57539,"CreatedDateTime":"2013-12-06T05:17:50Z","PageNum":1,"Articles":[{"CreatedByName":"Ojimak","CreatedById":57539,"CreatedDateTime":"2013-12-06T05:17:50Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/5qTf1\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThis craft is basically an ion powered hovercraft for use on Minmus. The reaction wheel allows for fairly good control, the solar cells/batteries allow for flight when you\u0027re not in super-direct sunlight, and the landing gear allows for safe, although not recommended, landings of around 50 m/s. The current twr is high enough on Minmus that several more crew could possibly be added in seats, but then it\u0027d require a launch vehicle that could hold more crew. Alternatively, a several-seated version could be sent to be used as a Minmus taxi between already-crewed bases.\u003C/p\u003E\u003Cp\u003EThe launcher is just a basic asparagus-staged Minmus rocket. There is a large fuel excess in the NERVA transfer stage, but I guess that makes it n00b-friendly. The launcher should allow for the transport of a Kerbal/hovercraft to Minmus and the transport back of the Kerbal back to Kebin afterwards. (Honestly, the launcher was just a normal Minmus rocket onto the top of which the hovercraft was added; the hovercraft weighs next to nothing with all of its massless parts)\u003C/p\u003E\u003Cp\u003EAction Groups:\u003C/p\u003E\u003Cp\u003E1. toggle the solar cells and the decorative antenna\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/z8g3sgj53zaqyx0/ion\u002Bhovercraft\u002Blauncher.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003EDownload\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E-Ojimak\u003C/p\u003E\n"},{"CreatedByName":"TheGeoninja","CreatedById":92271,"CreatedDateTime":"2013-12-13T13:18:25Z","Content":"\n\u003Cp\u003EPretty cool. You could even use that as a crane.\u003C/p\u003E\n"}]}