{"TopicId":55915,"ForumId":21,"TopicTitle":"request for small to medium sized shuttle","CreatedByName":"tyrant264","CreatedById":44894,"CreatedDateTime":"2013-12-12T17:21:58Z","PageNum":1,"Articles":[{"CreatedByName":"tyrant264","CreatedById":44894,"CreatedDateTime":"2013-12-12T17:21:58Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003Cstrong\u003EHello fellow Spacecraft engineers!!!!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI have a problem... I am terrible at making shuttles! after days of different prototypes after school and work, I have come to the conclusion to outsource the project to you guys!\u003C/p\u003E\u003Cp\u003ESo anything with B9 or LLL is fine I don\u0027t use many mods besides that and KAS so if you guys have any ideas or crafts you want to submit please by all means go ahead!\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-12-12T20:29:09Z","Content":"\n\u003Cp\u003EWhat kind of specifications are you looking for? \u003C/p\u003E\u003Cp\u003EIs it a shuttle in the truest sense of the word? Attached to a rocket and launched into space. Or is it a SSTO space plane that can take off fly to orbit and return? How high does it need to go? Does it need to carry cargo, if so how much? Does it need to carry extra passengers, again how many?\u003C/p\u003E\n"},{"CreatedByName":"tyrant264","CreatedById":44894,"CreatedDateTime":"2013-12-13T03:14:31Z","Content":"\n\u003Cp\u003ELets see well I want a shuttle of ya know the original kind launched from a rocket strapped to its belly.\u003C/p\u003E\u003Cp\u003Eit needs to be able to reach about 250 km or so into orbit (my station is there)\u003C/p\u003E\u003Cp\u003ENot to much weight maybe 10 tons at the MOST it can carry\u003C/p\u003E\u003Cp\u003E no extra passengers\u003C/p\u003E\n"},{"CreatedByName":"Yalin Hawk","CreatedById":72640,"CreatedDateTime":"2013-12-13T03:43:02Z","Content":"\n\u003Cp\u003EIf you want a \u0022Traditional\u0022 shuttle, then I\u0027d suggest picking up the Shuttle Engines mod. Really nice for building vertical-launch offset-COM vehicles like a shuttle. Of course you could manually angle the SSME\u0027s with cubic struts, but that is 10x more difficult.\u003C/p\u003E\n"},{"CreatedByName":"razgriz86er","CreatedById":13111,"CreatedDateTime":"2013-12-13T07:44:00Z","Content":"\n\u003Cp\u003Enot sure exactly how close you wanted to get to the actual shuttle without a real set of gimbal engines~ but i got this to work despite the heavy restriction.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/gcXxH\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou will need to fly this using the velocity indicator instead of pointing the nose straight up.\u003C/p\u003E\u003Cp\u003Edrop the \u0022SRBs\u0022 at 10,000 *there really should be a longer lasting SRB* \u003C/p\u003E\u003Cp\u003Ethey wont burn out but no worries the fuel in those tanks have long been used up.\u003C/p\u003E\u003Cp\u003Ethen pitch the nose to around 60*\u003C/p\u003E\u003Cp\u003Ethe force the sas needs will eventually be greater than what it can produce\u003C/p\u003E\u003Cp\u003Ewhen this happens pulse #2 action group until that engine is no longer needed.\u003C/p\u003E\u003Cp\u003Eshortly after you will run out of fuel on the external tank. hit stage and action group #5 and 6 to open the cargo doors and remove the engine adapter.\u003C/p\u003E\u003Cp\u003Edecouple the nuke engine and dock it to the rear of the shuttle as quickly as possible.\u003C/p\u003E\u003Cp\u003Eonce docked you will need to stage the nuke to active. continue the burn while holding pitch at 0* until the nuke can finish the ascent without the secondary engine then hit #1 action group to turn off the secondary engines.\u003C/p\u003E\u003Cp\u003Edepending on how well you did you should be able to circularize with the nuke.. worst case scenario you will need to finish the orbit using RCS.\u003C/p\u003E\u003Cp\u003Eterribly sorry if this isn\u0027t what you\u0027re looking for, but its all I\u0027ve come up with. that said i hope this does suit your fancy and are able to enjoy the difficulty of this design.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/42pwvb2ei4snm7l/Shuttle%20Nuke%20Swapper.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/42pwvb2ei4snm7l/Shuttle%20Nuke%20Swapper.craft\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"tyrant264","CreatedById":44894,"CreatedDateTime":"2013-12-16T19:53:14Z","Content":"\n\u003Cp\u003EHey thanks bud if you want to use a modded gimbaled engine go ahead ill just add the mod\u003C/p\u003E\n"},{"CreatedByName":"tyrant264","CreatedById":44894,"CreatedDateTime":"2013-12-16T19:54:04Z","Content":"\n\u003Cp\u003Ealso its beautiful!\u003C/p\u003E\n"},{"CreatedByName":"Yalin Hawk","CreatedById":72640,"CreatedDateTime":"2013-12-16T22:19:17Z","Content":"\n\u003Cp\u003EI\u0027m going to take a crack at this. I had some nice shuttle designs with the shuttle engines mod before I uninstalled it, let me see if I can\u0027t conjure them back up.\u003C/p\u003E\n"},{"CreatedByName":"Codey737","CreatedById":76942,"CreatedDateTime":"2013-12-20T02:00:52Z","Content":"\n\u003Cp\u003EIf you are still looking for a shuttle....\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EEndurance\u003C/span\u003E\u003C/span\u003E\u003C/em\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/F6idr\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EMods Used:\u003C/p\u003E\u003Cp\u003EFAR,B9,KWRockettry\u003C/p\u003E\u003Cp\u003EIt has ~4,400 Delta-V worth of liquid fuel and ~400 Delta-V worth of RCS(which is plenty to get to orbit and back)\u003C/p\u003E\u003Cp\u003EIt can carry 1-3 tons of cargo with 2 crew aboard\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAction Groups:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1. Cuts the top main engine for stability after the booster seperation\u003C/p\u003E\u003Cp\u003E2. Cuts all of the engines\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHow to fly\u003C/strong\u003E:\u003C/p\u003E\u003Cp\u003E1. Before launch set throttle to ~60%-80% (depends on the payload)\u003C/p\u003E\u003Cp\u003E2. Once you clear the launch clamps turn pull back to get to a 75* angle\u003C/p\u003E\u003Cp\u003E3. Stay at 75* till the boosters run dry \u003C/p\u003E\u003Cp\u003E4. As the boosters stop stage them and press 1 to keep stable\u003C/p\u003E\u003Cp\u003E5. Slowly turn back to 45* and stay there till your AP is about 45km(if you have a hard time turning,throttle down a slight bit)\u003C/p\u003E\u003Cp\u003E6. Turn slowly to 0* once you reach 45km AP\u003C/p\u003E\u003Cp\u003E7. As the fuel drains the craft wants to flip forwards,thrust down a bit to counter-act this\u003C/p\u003E\u003Cp\u003E8. Before your PE reaches 70km(or the fuel runs out) ditch the fuel tank and use RCS thrust to boost your way to LKO\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/5kc15guzflwcbmf/Space%20Shuttle%20Endurance%28no%20guidance%29.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003EDownload\u003C/span\u003E\u003C/span\u003E\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\n"}]}