{"TopicId":56081,"ForumId":21,"TopicTitle":"Simple Space Stations","CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-12-14T00:28:17Z","PageNum":1,"Articles":[{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-12-14T00:28:17Z","Content":"\n\u003Cp\u003EI\u0027d like to ask anyone posting to either use a small amount of text to comment on stations, or add an image depicting your space station with a description of what makes yours easy and useful for a player to use without spending much time on it. Craft files optional.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EThis is the primary station style I use:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIt has 4 docking ports of each size, so easy docking and the placement works with most spacecraft. The fuel tanks sticking out to the sides are docked separately. I have tanks of all sizes because I like to fill some tanks partway to balance the fuel if anything doesn\u0027t get filled all the way. Lastly, the station has lots of RCS and Xenon fuel, and stores plenty of electricity which it generates rapidly with those XL photovoltaic panels.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EWhat I like most about this station:\u003C/span\u003E It has a low part count compared to what it can do. My meager computer can run this station along with a ship or two docked to it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECraft file:\u003C/strong\u003E \u003Ca href=\u0022https://www.dropbox.com/s/bckb8eo7lgsxjn6/SS%20Core%20S_M_L%201_0.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/bckb8eo7lgsxjn6/SS%20Core%20S_M_L%201_0.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is the base station. You can fly up extra fuel tanks at your leisure. The tanks you see on the sides of mine are very easy to dock.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LPGMut8.png\u0022 alt=\u0022LPGMut8.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-14T00:32:22Z\u0022 title=\u002212/14/2013 12:32  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 14, 2013\u003C/time\u003E by thereaverofdarkness\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"manskal","CreatedById":73159,"CreatedDateTime":"2013-12-17T05:24:03Z","Content":"\n\u003Cp\u003EI present : The \u003Cstrong\u003ES\u003C/strong\u003Epace \u003Cstrong\u003ES\u003C/strong\u003Etation - \u003Cstrong\u003EE\u003C/strong\u003Experimental II or SS-E II.\u003C/p\u003E\u003Cp\u003EI built this station just because it was cool and who doesn\u0027t want to build a cool station in KSP? Originally, the core module (with the Gigantor panels) was supposed to be an attempt at recreating Skylab, but then I added my mini-Salyut-like-thing already in orbit and a sciencey module just to make it look like it has a purpose (it\u0027s in sandbox btw). \u003C/p\u003E\u003Cp\u003EFits two Kerbals snugly, but the part count is quite high compared to it\u0027s size(too many unoptimized bits and bobs were added for aesthetics only). Still prety proud of it though.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XwOo96v.jpg\u0022 alt=\u0022XwOo96v.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Gemini is from the excellent FASA Gemini and Mercury pack. The rest of the station is stock, with the exception of a couple Kerbal Engineer chips.\u003C/p\u003E\n"}]}