{"TopicId":61365,"ForumId":21,"TopicTitle":"Take a Chance on Eve. A lander that gets you down, and back up!","CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-01-28T08:55:44Z","PageNum":1,"Articles":[{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-01-28T08:55:44Z","Content":"\n\u003Cp\u003EIt\u0027s been a long and crashy road for Alan Aerospace Recycling and Packaging, developing a manned lander capable of landing on Eve then returning part of it to orbit, with enough fuel left to do a rendevous with a return ship.\u003C/p\u003E\u003Cp\u003EHere a couple of pics of Chance, part of our \u0022Triple Play\u0022 that also includes the rovers Tinker (Kethane Drilling) and Evers (Kethane Converting) for refueling the lander on the surface of Eve.\u003C/p\u003E\u003Cp\u003ELanding configuration involves emptying the upper FL-T800 tanks on the side boosters. (Into the transfer ship\u0027s tanks, not into space!) It can land starting completely full but there\u0027s no need. Even dropping to 50% total fuel load before de-orbit is not a problem. MechJeb can take it down to the surface, even to sea level, completely hands off, but set the landing speed to 1 m/sec to ensure it doesn\u0027t go so slow the parachutes auto-cut. All landing tests have been conducted with TAC Fuel Balancer. Don\u0027t know if some engines might run out on the way down, very likely would doing landings without a full fuel load.\u003C/p\u003E\u003Cp\u003EGetting out of the lander can is a bit of an adventure. Go EVA and climb down the angled ladder. Grab the KAS winch cable, let go of the ladder and immediately hit \u0022I\u0022 to avoid smashing into the ground. Use \u0022K\u0022 to gently lower to the ground, then release the cable. Use the connectors and KAS winches on Evers to connect to Tinker and Chance in Docked mode. Drill for Kethane with Tinker and refuel Chance. Disconnect the cable from Chance then remove the connector and reinstall it on Evers - just in case you come back at a later time.\u003C/p\u003E\u003Cp\u003EGetting back aboard (after planting a flag, of course). Grab the winch cable and lift with \u0022I\u0022 until you can grab the ladder. Hopefully you\u0027ve found a flat spot to land or the hatch side is aimed up hill. Tweaking landing leg suspension and raising some on the high side to tilt the lander enough so the Kerbal swings close enough to the ladder to grab it is a tricky business. (In simulation it also required dumping fuel from the low side and transferring to the high side, so don\u0027t land on too steep of a slope.) Make sure to release the cable and repack the two radial chutes on the can before re-boarding! (Or repack before rappelling to the ground.)\u003C/p\u003E\u003Cp\u003ELiftoff procedure. Turn off fuel/oxidizer balancing! Edit the ascent profile to a 66% shape, leave the turn start on Auto. Stage once to jettison the six parachutes. (Ooooo! Pretty spiral-ish explosion!) Poke \u00220\u0022 to inflate the Hooligan Labs gas bags and up you go. At around 1,500 meters, stage again to jettison the landing gear, high enough they\u0027ll be destroyed so they won\u0027t need cleaned up later.\u003C/p\u003E\u003Cp\u003EAt 20,000 meters, engage the autopilot. You haven\u0027t reached peak gas bag altitude, but you want no less than 100 m/sec upward velocity when engaging the autopilot. At around 24,000, stage again to lose the gas bags then sit back and watch asparagus staging in action. (Further testing could home in on the ideal altitude to cut the bags loose as well as optimizing ascent profile.)\u003C/p\u003E\u003Cp\u003ENote: This design is going to get a bit more tweaking. On the latest, most successful flight, I dumped the lander can\u0027s mono and the contents of one of the cylindrified tanks, then balanced what was left. Will be switching those out for the smaller, lighter, roundified tanks. The stacked asparagus staging might get modified too since two stacks drop the lower half very soon after the upper half so there\u0027s likely little advantage. On the latest ascent, two lower halves ran dry an instant prior to the upper halves. Could need some (more) pipe re-routing. The first upper half pair to go is on top of the last lower half. If only there were fuel pipes that could cross decouplers and separators straight up or down!\u003C/p\u003E\u003Cp\u003EChance landed on Eve. The probes were dropped by an Evers rover.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7351/12186254786_269c7c1514_z.jpg\u0022 alt=\u002212186254786_269c7c1514_z.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat makes it back to orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7392/12186253136_f27a16f935_z.jpg\u0022 alt=\u002212186253136_f27a16f935_z.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMission landing procedure will be Evers first to locate a flat enough area within a Kethane deposit, deploy the beacons (a pair of OKTO2) then drive to a safe distance. Next down will be Tinker, then Chance. The rovers are equipped with landing legs but don\u0027t have parachutes. (A fact which has somewhat mollified our chief engineer and janitor, who keeps mumbling about \u0022flimsy pieces of cloth\u0022.) Before raising the legs it is essential to dump all remaining fuel then jettison the tanks and engines, which fly away so nicely on sepratrons then kaboom into the surface. Raising the legs before doing that has caused damaged wheels and breaking off the KAS winches and ports. Under no circumstances should the rovers be moved with deployed solar panels.\u003C/p\u003E\u003Cp\u003EEdit: Further note that the drilling and converting rovers haven\u0027t been given their names of Tinker and Evers, and that as the beacon probes are a very late addition to \u0022Evers\u0022, its tank jettison staging hasn\u0027t been changed to put the two tanks they\u0027re mounted on into a separate stage. They could be moved elsewhere to avoid adding yet another stage, but sticking them on the tanks was most convenient. Modify as you please.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T03:55:59Z\u0022 title=\u002201/29/2014 03:55  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Reapercore","CreatedById":12708,"CreatedDateTime":"2014-01-28T18:29:35Z","Content":"\n\u003Cp\u003ESooo craft files?\u003C/p\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-01-29T03:43:35Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://partsbyemc.com/pub/Eve-pack.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://partsbyemc.com/pub/Eve-pack.zip\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe lander is on a launcher, though as-is it\u0027ll need fuel balancer on after the big boost stage drops or it drops the four orange tank stage, which is intended to have four more stacks of two orange tanks docked, each with an engine. Included mainly to show how the lander mounts to a launcher. (And because I haven\u0027t had time to change the RCS tanks or anything else.)\u003C/p\u003E\u003Cp\u003EThe rovers are in ready to stack configuration, with ports ready to jettison. Launchers not included, adjust staging as needed. The drill rover should have the two Kethane scanning satellites and a small Kethane mining and converting rover for Gilly to refuel the return ship.\u003C/p\u003E\u003Cp\u003EThe intended mission plan is to first launch the lander, keeping it on the upper parts of the launcher to serve as the core ship. Next step is to launch then dock the Kethane converting rover on top of the lander, then the drilling rover on top of the converting rover. Finish up by docking four sidesaddle boosters to the core. Somewhere in among all that, tankers will be needed to top off all the tanks. (Wouldn\u0027t do to run out of fuel on the way to Eve.) Also, on the converting rover, ensure control is set to the RGU or the top docking port, never one of the two OKTO2 pods to be used for Eve landing beacons, it doesn\u0027t land too well on end...\u003C/p\u003E\u003Cp\u003EAlso included are cfg files for 2 and 3 way omni docking ports and AARP\u0027s mashup of the Rockomax Brand Decoupler, OKTO2 probe body systems and the standard Clampotron. That enables a Rockomax size part to be stacked on a launcher then come back and dock. It also provides the same control, reaction wheel torque and electric capacity as the OKTO2, enabling launcher stages to be deorbited - if you provide power or initiate the burn before those 10 measly units of power get used. (Just toss those three files anywhere under GameData.)\u003C/p\u003E\u003Cp\u003EThe Gilly lander is likely ridiculously tiny for refueling, goes down slow, pops back to orbit in a few seconds, can make several trips between refuelings. It\u0027s what I could fit into the space available. To get the lander and a satellite to Gilly will require either a rather high Eve orbit or good timing with an elliptical orbit. They can\u0027t get there from a 100KM circular orbit.\u003C/p\u003E\u003Cp\u003EMods needed by these include quantum struts, Hooligan Labs airship parts, KAS, ReStock, probably KSPX too. I don\u0027t think I used the Kommit Stockalike girder cube, that\u0027s a one part \u0022pack\u0022 which is just a cube version the same size as the two stock girders. I\u0027ve used that on other rovers, from whence came the girder and wheel arrangements for these rovers. Stretchy tanks/SRBs? Mayyyybe. Don\u0027t recall if I left those on the Gilly lander.\u003C/p\u003E\u003Cp\u003EKerbal Joint Reinforcement will most likely be required to keep that launcher together. It predates the first release of KJR but I did remove *some* of the strut spam when pulling it out of storage. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis download is provided without warranty or expression or admission or denial of its fitness for any purpose other than killing Kerbals. Not ready for sale to the public, but oh well. At the least it\u0027ll leave behind quite a collection of debris on the way to and around and on Eve.\u003C/p\u003E\u003Cp\u003EShould you somehow make it to Eve and back with this lot, AARP\u0027s engineering department would be happy to \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Esteal\u003C/span\u003E see your research results. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E (They already got a huge boost on the lander by working with someone else\u0027s design, then extensively modifying it to shed unneeded items and lift a 2-man can instead of a single command chair.) Will be safest to try out in a separate install of KSP in case I\u0027ve forgotten some mod part I used...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-29T03:47:20Z\u0022 title=\u002201/29/2014 03:47  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 29, 2014\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Galane","CreatedById":77949,"CreatedDateTime":"2014-02-01T08:46:45Z","Content":"\n\u003Cp\u003EThe core assembly, ready to dock some sidesaddle boosters. Dunno if my Duna ones will be right for going to Eve.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm4.staticflickr.com/3783/12247873946_a9a6d02af2_o.png\u0022 alt=\u002212247873946_a9a6d02af2_o.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI found out something about the quantum struts strut guns, when used during assembly, they won\u0027t automatically shut off on a decouple node event like they do with an undock. I decoupled the docking port mounting the drilling rover, Gilly mining lander, Kethane satellites assembly to its launcher and the strut guns yanked it back into dock. Since I used my three-way omni ports I then had to right click and undock three times (they don\u0027t always do that). By the time I got it separated from the launcher, the ship was cruising past and bumped into the launcher. No damage, whew!\u003C/p\u003E\u003Cp\u003EThen I had to get the ship turned around and chase it down (in reverse) to dock with it. If I\u0027d used the quantum struts they would have turned off.\u003C/p\u003E\u003Cp\u003EI\u0027m going to have to get 64bit Windows on my computer. Already got 6gig RAM in it (which XP can only use 3.25 of) and upgraded to a GeForce 9800GT card with a gig, so Win7 x64 should run decently and be able to give KSP more space. Just such a PITA changing OS versions when one has some years of stuff built up.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-01T08:56:56Z\u0022 title=\u002202/01/2014 08:56  AM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 1, 2014\u003C/time\u003E by Galane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JJayzX","CreatedById":100770,"CreatedDateTime":"2014-02-01T22:39:32Z","Content":"\n\u003Cp\u003EYour OS will be 64-bit and use that ram but KSP is 32-bit, so it will still be limited to under 4gigs usable. They are planning 64-bit one day and I can\u0027t wait for that.\u003C/p\u003E\n"}]}