{"TopicId":64103,"ForumId":21,"TopicTitle":"None of my Kerbals have ever come back home","CreatedByName":"psyper","CreatedById":90641,"CreatedDateTime":"2014-02-23T20:49:17Z","PageNum":1,"Articles":[{"CreatedByName":"psyper","CreatedById":90641,"CreatedDateTime":"2014-02-23T20:49:17Z","Content":"\n\u003Cp\u003EThis is more of a general ksp discussion thread but there are quite a few photos of spacecraft on here I felt its probably better off here.\u003C/p\u003E\u003Cp\u003EWarning screenshot intensive!\u003C/p\u003E\u003Cp\u003EApart from my first couple of forays to mun and back in the ksp demo before I brought the game none of my Kerbals have ever set foot back on Kerbal after they got in to orbit. I tend to \u0027cheat\u0027 by F5 and F7 any disasters and I started ksp before Career mode so when I upgraded I kept my \u0027sandbox\u0027 game from the previous versions so I have all the parts available. I also subscribe to the mantra that my Kerbals feel they belong in space. Money is no object and only the best achieve training to get to be astronauts (oh and then there\u0027s Jeb who is the crazy son of a millionaire so they brought his place in space with space funding). Once they are in space they always believe they are never ever coming back \u0027home\u0027 space is now their new home. I can however provide safe passage for any of my kerbals should they need to get back - family emergency or illness but none have ever had the desire to. So where are all my kerbals? Well lets take a look...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESS Foale (6 Kerbals)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5e4S0qV.png\u0022 alt=\u00225e4S0qV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn my SpaceStation in LKO I have onboard: Harmund, Hans, Tomler \u0026amp; Samlin. The station is a main transfer point for crew - they arrive from Kerbin and board here to wait for the latest mission so crew \u0027rotation\u0027 happens quite frequently.\u003C/p\u003E\u003Cp\u003ECurrently Docked with the station (bottom right) I have the emergency rescue ship which is always fuelled* an manned ready at a moments notice to retrieve any ships stranded in LKO - It has a KAS winch to recover debris and also one free space for an extra kerbal for EVA rescues. Manning the ship is Anski \u0026amp; Sidfrey.\u003C/p\u003E\u003Cp\u003E* As you may have noticed its not fully fuelled. This is because the last of the fuel was needed for the 7th ship to leave for Ike (see below) and we\u0027re currently waiting for a resupply soon.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESS Sharman II (1 Kerbal)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W88iwyo.png\u0022 alt=\u0022W88iwyo.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EGood old Jeb is the only person on this station and have been for sometime (read: totally insane). Sharman is a stopping off point between Minmus (note the hodgpodge of ships and fuel tanks docked) and a fuel depot located in 100km Kerbin orbit (which is unmanned .. unkerballed?). It has had a few Kerbal visitors but none have popped in to the habitation module aboard - so I think Jeb is due for a trip to the surface at some point...maybe\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMMC Minmus Kethane Mine II (4 Kerbals)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TxwOU3Q.png\u0022 alt=\u0022TxwOU3Q.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter exhausting the first mine the Moon Mining Corporation moved on to a new one - a modular design using KAS to connect each module up. We have a miner, two landing pads, a garage with a fuel tanker. In a small module with have Bob, Bill \u0026amp; Elbal. Driving the fuel tanker we have our only female (I think) Sherley. Image below has the tanker in the garage in the foreground and the habitation module in the background right out the way in case the Kethane ignites or the KAS Kraken comes knocking - I\u0027ve watched the whole complex blow up for 20 minutes spewing debris all over the site but left the hab intact when I connected a pipe wrong!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MZONfoc.png\u0022 alt=\u0022MZONfoc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMore of my Kethane Mine can be seen \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/67411-just-wanted-to-show-off-my-minmus-mining-base\u0022 rel=\u0022external nofollow\u0022\u003Ehere \u003C/a\u003Eif interested.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIke V - Ike Dropship (3 Kerbals)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/g577EnP.png\u0022 alt=\u0022g577EnP.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELeaving Kerbin\u0027s SOI is an armada of 7 ships bound for the Duna system. They will park in Low Ike Orbit and create a spacestation there. They will also need Kethane to refuel the ships for their return and to provide fuel needed for excusions between Ike and Duna. The crew of the Ike Dropship will ferry parts for the Kethane Mines (yes there will probably be two!) and will require a crew to use the KAS system. These are Hadgard, Nelbal and Obdon.\u003C/p\u003E\u003Cp\u003EMy armada:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AS0Z0RY.png\u0022 alt=\u0022AS0Z0RY.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThere are 6 in this pic as the 7th left late due to supply issues :/ (read: I forgot something)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EIke III - Duna Base (4 Kerbals)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FATSAQM.png\u0022 alt=\u0022FATSAQM.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA mission to Duna isn\u0027t complete without a base on the planets surface and this is the job for Willo, Fredzor, Chadnand and Seevan! They will meet up around Ike first of all and refuel for the trip to Duna where they will probably remain doing wheelies in their Dune Buggies (seewhatididthere!)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EJool Expedition I (3 Kerbals)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/D989FnN.png\u0022 alt=\u0022D989FnN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinally the furthest Kerbals in space (well for me that is), they can no longer see kerbal from their location. Bartbus, Mergas and Edmon will make up a far off outpost in the Jool system. They are the first step in colonising the Jool system and just comprises of two ships at the moment. I\u0027m hoping to have a Kethane mine set-up around one of the moons as well as a large base complete with an SSTO spaceplane on Laythe and maybe some outposts on the other moons but thats for the next window.\u003C/p\u003E\n"}]}