{"TopicId":6558,"ForumId":21,"TopicTitle":"Micro Mun Lander","CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-02-11T18:10:47Z","PageNum":1,"Articles":[{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-02-11T18:10:47Z","Content":"\n\u003Cp\u003EHello all \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI thought for my first post I\\\u0027d introduce myself with my latest vessel, I like to see what I can do with the fewest and smallest parts.\u003C/p\u003E\u003Cp\u003EHave fun with the Micro Mun Lander.\u003C/p\u003E\u003Cp\u003EEdit: Just in case you\\\u0027re thinking this is some overpowered cheat ship, it has a total thrust at launch of 201, 1 point more than a single standard main engine, and a total fuel payload of 1526, or just over 3 standard tanks, also the capsule has its own engine with a max thrust of 30.\u003C/p\u003E\u003Cp\u003EYou\\\u0027ll need the Down Under Aerospace and party supplies pack if you don\\\u0027t already have it as all the extra parts are from there.\u003C/p\u003E\u003Cp\u003EIt takes a fair bit of care with your flying to keep enough fuel for landing, and you\\\u0027ll want to drop the main part of the ship in the last few hundred meters, letting you touch down with the capsule on its own (no landing legs).\u003C/p\u003E\u003Cp\u003EPlease note, if you change this ship, it\\\u0027ll mess up the drop order of the boosters and it relies heavily on that setup in order to reach the Mun, or in fact even to reach orbit, In case you\\\u0027re curious, each pair of boosters feed into the next and then into the main tank, this lets you keep each \u0027stage\u0027 fully fueled and still use it\\\u0027s engine.\u003C/p\u003E\u003Cp\u003EI also have a fully stock ship that uses this system as well, and should get me to the Mun and home on 16 regular tanks, but I have yet to land it without busting my rocket, soon as I\\\u0027m sure it works I\\\u0027ll upload it as well.\u003C/p\u003E\u003Cp\u003EEdit: ( Don\\\u0027t read if you want to figure out how to fly this ship yourself \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E )\u003C/p\u003E\u003Cp\u003EHow I fly her.\u003C/p\u003E\u003Cp\u003ELaunch at full throttle, the supporting frame and tri-coupler are meant to remain behind.\u003C/p\u003E\u003Cp\u003EWatch for the first boosters engines to go dark, jettison.\u003C/p\u003E\u003Cp\u003EPitch to 45 degrees due east, just before the second boosters need to be dropped.\u003C/p\u003E\u003Cp\u003EWatch your Apoapsis, when it hits 60k, pitch to 90 degrees east, you\\\u0027ll still be around 45k at this point.\u003C/p\u003E\u003Cp\u003EDrop the last boosters, then kill the main drive when Apoapsis hits between 70k and 71k.\u003C/p\u003E\u003Cp\u003EWhen you are at about 65k, make another full burn to start raising your Periapsis, cut drive again the moment you get Periapsis out of atmosphere, don\\\u0027t worry about rounding your orbit, you can\\\u0027t waste the fuel.\u003C/p\u003E\u003Cp\u003EYou should have one and a half tanks left in the main craft, the Munshot itself is another full power burn and should leave you with almost a full tank remaining.\u003C/p\u003E\u003Cp\u003EOnce at the Mun, sort out your orbit using low throttle settings and short full bursts, you are looking to have around three quarters fuel left for the deorbit and landing.\u003C/p\u003E\u003Cp\u003EChoose your landing site, use mid to high throttle to stop your horizontal speed, descend engine first, low throttle openings are a must at this point.\u003C/p\u003E\u003Cp\u003EYou have no landing gear, and you cannot land on that pointy engine, you have to kill the drive and jettison the main ship just before landing, the capsule has it\\\u0027s own drive with about half the power, a few light bursts will see you safely down with almost all the capsules fuel intact.\u003C/p\u003E\u003Cp\u003ETake a few snapshots of the lovely scenery \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewhen you\\\u0027re done, throttle up and get into a Munar orbit, take it easy and don\\\u0027t waste fuel, you have very little and it has to last you.\u003C/p\u003E\u003Cp\u003EMake your TransKerbin burn, aim to just get captured by Kerbins gravity.\u003C/p\u003E\u003Cp\u003EDon\\\u0027t try to be fancy here, just correct your orbit to bring you down into the atmosphere for aerobraking, you don\\\u0027t have enough fuel for anything else.\u003C/p\u003E\u003Cp\u003EJettison the parachute cover while facing away from your course, or it\\\u0027ll smash your chute and can even destroy the capsule.\u003C/p\u003E\u003Cp\u003EPop your chute, use a bit of thrust to cushion your landing if you want (if you have the fuel), well done, you made it to the Mun and back in a ship that\\\u0027ll fit in your pocket \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"IsLeTan4iK","CreatedById":12699,"CreatedDateTime":"2012-02-13T12:54:12Z","Content":"\n\u003Cp\u003EHmmmm Good. I like it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"pauldbk99","CreatedById":102495,"CreatedDateTime":"2014-11-17T20:00:39Z","Content":"\n\u003Cp\u003E10000 posts later...\u003C/p\u003E\u003Cp\u003ECongrats on that milestone by the way!\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-11-17T20:05:36Z","Content":"\n\u003Cp\u003EThanks, that\u0027s very kind, but I think this thread also should go back to sleep...\u003C/p\u003E\n"}]}