{"TopicId":6976,"ForumId":21,"TopicTitle":"[stock] Jeb\u0026#039;s Idea 1: Launch Tower Lift","CreatedByName":"corinoco","CreatedById":13156,"CreatedDateTime":"2012-02-24T03:51:03Z","PageNum":1,"Articles":[{"CreatedByName":"corinoco","CreatedById":13156,"CreatedDateTime":"2012-02-24T03:51:03Z","Content":"\n\u003Cp\u003EIt is perhaps best to read this transcription of the KSP Occupational Health \u0026amp; Saftey, Security, Sanity, Structural Health \u0026amp; Intergrity Team (OHSSSHiT) radio logs. It may help explain this \u0027design\u0027.\u003C/p\u003E\u003Cp\u003EKSP Base Comms Channel: \u003C/p\u003E\u003Cp\u003E\u0027Has anyone seen Jeb lately? He\\\u0027s not on our CCTV.\u0027\u003C/p\u003E\u003Cp\u003E\u0027Nope.\u0027\u003C/p\u003E\u003Cp\u003E\u0027Me neither. His security escort is here though\u0027\u003C/p\u003E\u003Cp\u003E\u0027Have they seen him?\u0027\u003C/p\u003E\u003Cp\u003E\u0027Nah.\u0027\u003C/p\u003E\u003Cp\u003E\u0027Crap. OK, this is a base-wide security alert - Jeb is someone in the base, unescorted, repeat, unescorted. Please secure all computer terminals, lathes, escalators and candy machines.\u0027\u003C/p\u003E\u003Cp\u003E\u0027What.... he\\\u0027s where? The Design Team room? Well, he can\\\u0027t do any damage there can he?\u0027\u003C/p\u003E\u003Cp\u003E\u0027He what? Logged in? How?.... Accessed the design blueprint drives? Anything deleted? No? Oh, good.\u0027\u003C/p\u003E\u003Cp\u003E\u0027Something ADDED?\u0027\u003C/p\u003E\u003Cp\u003E\u0027Well, where is he now? ... the Fabrication facility? Doing? Making engines? HOW MANY? Well, I guess we need a few, have QA check \\\u0027em out...\u0027\u003C/p\u003E\u003Cp\u003E\u0027Now where? The VAB? What the hell? HE\\\u0027S WHAT??! WELL, STOP HIM!\u0027\u003C/p\u003E\u003Cp\u003E\u0027Whaddaya mean he\\\u0027s already ON THE PAD? WELL, get him OFF THE PAD!\u0027\u003C/p\u003E\u003Cp\u003E\u0027Bill? and Bob? Oh noooo.... Cut the power! Cut the power! HURRY!\u0027\u003C/p\u003E\u003Cp\u003E*sounds of SAS gyro spoolup and liquid stage pre-pressurisation*\u003C/p\u003E\u003Cp\u003E\u0027Arrrgh! Too Late!\u0027\u003C/p\u003E\u003Cp\u003E*sound of engine start, SRBs firing...*\u003C/p\u003E\u003Cp\u003E*sound of very large explosion, parts falling onto pad*\u003C/p\u003E\u003Cp\u003E\u0027sigh.... emergency crews... see if they survived... try to put out the fires.\u0027\u003C/p\u003E\u003Cp\u003E\u0027What, radio transmission? From where? The CAPSULE? Which direction? What do you mean \\\u0027UP\\\u0027?\u0027\u003C/p\u003E\u003Cp\u003E\u0027Where? The top of the tower? I\\\u0027ll be....\u0027\u003C/p\u003E\u003Cp\u003E* * * TRANSMISSION ENDS * * *\u003C/p\u003E\u003Cp\u003EHere is what the pad CCTV saw:\u003C/p\u003E\u003Cp\u003EBefore...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3OUuV.png\u0022 alt=\u00223OUuV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zXvGh.png\u0022 alt=\u0022zXvGh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFull gallery of images:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/x7COf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/x7COf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn Jeb\\\u0027s version of events, he describes his \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Erevoltushu\u003C/span\u003E \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Erevlotiif\u003C/span\u003E \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E revaret\u003C/span\u003E very clever idea for a faster Launch Tower Lift. The Jeb\\\u0027s Idea 1 saves 43.6 seconds on the usual long, boring lift ride to the top of the Launch Tower, and since time is money this will clearly save the KSP a mild amount of money if implemented immediately.\u003C/p\u003E\u003Cp\u003EHe also highlights the designs reliability, with a 100% success rate for delivering three Kerbonauts to the top of the Launch Tower safely and swiftly.\u003C/p\u003E\u003Cp\u003EHe also points out it provides plenty of training opportunities for the KSP Fire, Search \u0026amp; Rescue Teams.\u003C/p\u003E\u003Cp\u003EHe claims the rumour that his brother-in-law is the prime contractor for Liquid Fuel tanks and the red paint used on the Launch Tower is a complete coincidence.\u003C/p\u003E\u003Cp\u003EHowever the rumours he is working on an orbit-capable design are \u003Cem\u003Ecompletely true\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-02-24T10:54:45Z","Content":"\n\u003Cp\u003EThis is so Kerbal it hurts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"corinoco","CreatedById":13156,"CreatedDateTime":"2012-02-24T12:17:05Z","Content":"\n\u003Cp\u003ENot quite 100% Kerbal, as this is (as far as I can tell) a 100% reliable way of getting 3 Kerbonauts to the top of the Launch Tower. Every. Single. Time.\u003C/p\u003E\u003Cp\u003EI guess the massive explosion every it e makes it Kerbal. ;D\u003C/p\u003E\n"}]}