{"TopicId":72575,"ForumId":21,"TopicTitle":"Capital Ship ion Drive attempt....AKA how make nVidia CUDA cry.","CreatedByName":"corvustech","CreatedById":111036,"CreatedDateTime":"2014-05-17T00:49:00Z","PageNum":1,"Articles":[{"CreatedByName":"corvustech","CreatedById":111036,"CreatedDateTime":"2014-05-17T00:49:00Z","Content":"\n\u003Cp\u003ECorvustech....building better explosions.\u003C/p\u003E\u003Cp\u003EAfter experimenting with Ion drives to make a rudimentary TIE fighter (See the Ion Ship sticky) , I thought \u0022gee, maybe if I just put enough generators on a lander and a fuselage I can make a capital ship drive unit that can run 8 Ion drives cap stable!!!!\u0022\u003C/p\u003E\u003Cp\u003EThen I thought.....\u0022WAIT....I know.....if I put a metal case around it with panels, I can make it more durable and centralize its mass!\u0022\u003C/p\u003E\u003Cp\u003EFinally, I thought, \u0022Now I can test it by strapping it to a rocket. HOORAY!!!!!\u0022:cool:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1119.photobucket.com/albums/k625/CorvusTech/screenshot10.png\u0022 alt=\u0022screenshot10.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a good thing there are no cities on Kerbin yet, because the impact of 48 of those little generators, 6 batteries, 8 xenon cans, 8 ion engines, and a silly amount of metal plating would have made the news to say the least...and a crater. Funnily enough, when the boosters rammed into this thing on the way up, they bounced off it like it was made of rubber. Additionally, it\u0027s capacitance is stable when flying at 3/4 throttle. \u003C/p\u003E\u003Cp\u003EWhen at first you don\u0027t succeed, grab a bigger rocket and make worse decisions!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1119.photobucket.com/albums/k625/CorvusTech/screenshot11.png\u0022 alt=\u0022screenshot11.png\u0022\u003EThat\u0027s right. 4 of these enormous drive units with a massive amount of Xenon and power generation in each. That I was able to take off was honestly a surprise. This time, they were driving an orbiter model I use for extended trips in the Kerbin system. As you can see, the pilots wanted the normal engines back. \u003C/p\u003E\u003Cp\u003EThe weird configuration what makes this look like a mace bestowed upon the Kerbals by the great Kraken is because oddly, I can\u0027t connect anything to the top of the drive units in the hangar. I think part count could be a part of that problem; after all, you\u0027re looking at 32 ion engines and 192 generators without even counting the rest of the parts and the launch stage. No struts between the nacelles meant they started to wobble and my 760GTX SLI rig dropped to about 25FPS. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1119.photobucket.com/albums/k625/CorvusTech/screenshot12.png\u0022 alt=\u0022screenshot12.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe fuel over on the left is because I foolishly forgot to remove some thrusters and a fuel tank, but since they no longer shared fuel with hungry engines that were there before, I cut them off with hopes that when I disengaged the nacelles, I\u0027d be able to slow down before I hit Kerbin\u0027s atmosphere again. To speed things along, I hit the stage, and.... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1119.photobucket.com/albums/k625/CorvusTech/screenshot13.png\u0022 alt=\u0022screenshot13.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E:confused:Those two little things on the left side of the navball are the hopes and dreams of rescue that my little Kerbal krew had floating off rather poignantly together; one of the radial chutes and the docking port. The explosion itself was spectacular and as you can see pieces went EVERYWHERE. Worse, only some of the ion drives shut off; they had plenty of power and I had to wiggle the pod to break it free. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1119.photobucket.com/albums/k625/CorvusTech/screenshot15.png\u0022 alt=\u0022screenshot15.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eoh hey, look, there\u0027s that third radial chute I couldn\u0027t find before....and there\u0027s the engine series spiraling off into space with 24 of 32 engines still going strong. Guess who isn\u0027t going strong? Rodmore, Billy-Bobbas, and Matcott. Heroes all.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"}]}