{"TopicId":75495,"ForumId":21,"TopicTitle":"Project Orion: decouplers to orbit","CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2014-06-19T18:06:09Z","PageNum":1,"Articles":[{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2014-06-19T18:06:09Z","Content":"\n\u003Cp\u003EHere\u0027s a small product of fooling around I would like to show you all: A stock (except for Kerbal Engineer) spacecraft that gets to a stable orbit on nothing but decouplers. It takes advantage of the physics-insignificant large decoupler to provide about 120m/s of delta-V per pancake. If I doubled the size it would be able to reach the Mun and return (this thing is probably impossible to land though since it can\u0027t throttle down)\u003C/p\u003E\u003Cp\u003EIn the lower atmosphere:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VAlxnu5.png\u0022 alt=\u0022VAlxnu5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECircularizing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/or77z4p.png\u0022 alt=\u0022or77z4p.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHighest orbit achieved of 400km apoapsis:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9XgvSKG.png\u0022 alt=\u00229XgvSKG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENot very practical, as it takes far too many decouplers to move even a .04 ton ship. But someone could hypothetically make a modded decoupler with several hundred thousand ejection force to have \u0022build your own\u0022 Orion spacecraft.\u003C/p\u003E\n"},{"CreatedByName":"Overfloater","CreatedById":94031,"CreatedDateTime":"2014-06-19T18:24:14Z","Content":"\n\u003Cp\u003EBetter than nuclear bombs! I\u0027ve recently been wondering if it\u0027s possible to make a stock Orion... xD\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-20T05:13:17Z","Content":"\n\u003Cp\u003EI believe someone exploited decouplers in a way similar to this to get to the Mun in something like 13 seconds.\u003C/p\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2014-06-20T12:54:54Z","Content":"\n\u003Cp\u003EYes, I remember it was called Plaid. It used all the decouplers at once, though, to achieve ludicrous speed. More like a cannon than a rocket. Also depended on a zero-mass glitch (the entire ship was made of massless parts). Where as this one does have mass and is actually comparable in speed to a regular rocket.\u003C/p\u003E\n"}]}