{"TopicId":75614,"ForumId":21,"TopicTitle":"The Dove... A small six-seat SP\u002B SSTO","CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2014-06-21T03:03:00Z","PageNum":1,"Articles":[{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2014-06-21T03:03:00Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8DKqqqU.png\u0022 alt=\u00228DKqqqU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Dove is designed to operate as a personnel-carrier for local ground-to-orbit operations at Kerbin, in as small and efficient a vehicle as possible. Its normal missions are crew-taxi services for space-stations and interplanetary craft in parking orbits.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/nKB53\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EThe craft can attain an altitude of 32km and speed of 1575 m/sec on air-breathing jet-thrust without requiring careful throttle-management to optimize use of the available intake air \u003Cspan style=\u0022font-size:8px;\u0022\u003E(going higher and faster on the jet may be possible for pilots with more patience)\u003C/span\u003E. It arrives in a 100km circular orbit with approximately 300 m/sec of rocket delta-v remaining, with an additional 280 m/sec of RCS capability, making rendezvous with any destination in LKO feasible. After reentry, nearly half of its total jet-fuel is still available for atmospheric flight to a suitable runway.\u003C/p\u003E\u003Cp\u003EIf the Dove is flown to not exceed Mach 3 until approaching 25 km altitude, high-velocity thermal effects can be completely avoided during the ascent. Likewise, reentry heating can be kept to negligible levels (no visible effects) by maintaining a high angle of attack and flying a sequence of steeply banked S-turns to safely decelerate to well below orbital velocity in the upper atmosphere, before descending past 35 km.\u003C/p\u003E\u003Cp\u003EWhile the craft is positively stable, it is fairly close to neutral. This permits an extreme angle of attack to allow for aggressive braking maneuvers (flight-tested at up to 70 degrees off the velocity vector). The craft can be forced to depart controlled flight, but is not expected to do so without a deliberate attempt by the pilot. Recovery is possible from every tested spin mode. The craft is extremely maneuverable while subsonic and can even perform advanced aerobatic maneuvers such as the Pugachev Cobra. The Dove does exhibit noticeable Mach tuck, so do not plan to perform any significant pitch maneuvers around Mach 1.\u003C/p\u003E\u003Cp\u003EDuring the takeoff roll, accelerate to 80 m/sec before attempting to lift the nose. The nose wheel can be raised off the ground at 70 m/sec, but doing so may result in a tailstrike.\u003C/p\u003E\u003Cp\u003EDuring landing, the recommended approach speed is 100 m/sec. Cross the numbers at 80 m/sec and touch down at 70 m/sec.\u003C/p\u003E\u003Cp\u003EWet mass is 15 tons. Crew capacity is six. Unpiloted remote operation of the vehicle is included. A single rear-facing Size-0 docking port (with target illumination) is provided. RCS-balance is a little off (slight roll moment during lateral translation and slight pitch moment during vertical translation), but I got tired of fooling with it (and it\u0027s fuel-level sensitive, anyway). Turn on SAS while operating the RCS and let the reaction wheels compensate for you.\u003C/p\u003E\u003Cp\u003EWhile the only required mod parts are from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80796-0-23-5-Spaceplane-Plus-1-1\u0022 rel=\u0022external nofollow\u0022\u003ESpaceplane Plus\u003C/a\u003E, the craft is designed to operate in a FAR environment. It has not been tested in the stock KSP atmosphere. The Dove can also survive Deadly Reentry if properly flown. Putting the nose down and plowing into the lower atmospheric at hypersonic speeds voids the warranty.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECraft download\u003C/strong\u003E: \u003Ca href=\u0022https://www.dropbox.com/s/sml4fs4fqyhaopq/Dove.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/sml4fs4fqyhaopq/Dove.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAction Groups:\u003C/p\u003E\u003Cp\u003E1 - Start/Stop engine\u003C/p\u003E\u003Cp\u003E2 - Switch engine operating mode\u003C/p\u003E\u003Cp\u003E3 - Open/Close air intakes\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-21T03:45:13Z\u0022 title=\u002206/21/2014 03:45  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 21, 2014\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Exothermos","CreatedById":41827,"CreatedDateTime":"2014-06-21T03:45:09Z","Content":"\n\u003Cp\u003EI like it! Especially your intake placement.\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2014-06-21T04:20:52Z","Content":"\n\u003Cp\u003EBeautiful aircraft, and great writeup!\u003C/p\u003E\n"},{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2014-06-21T10:58:15Z","Content":"\n\u003Cp\u003EGIMME GIMME GIMME GIMME , \u003C/p\u003E\u003Cp\u003Eits so awesome looking, thank you for sharing\u003C/p\u003E\n"}]}