{"TopicId":81120,"ForumId":21,"TopicTitle":"Avatar - ISV Venture star (Stock \u002B DSM \u002B Interstellar)","CreatedByName":"kaboom1212","CreatedById":108158,"CreatedDateTime":"2014-08-08T04:59:53Z","PageNum":1,"Articles":[{"CreatedByName":"kaboom1212","CreatedById":108158,"CreatedDateTime":"2014-08-08T04:59:53Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/LqNct7p,d4O3Yhi\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/LqNct7p,d4O3Yhi\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/LqNct7p,d4O3Yhi#1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/LqNct7p,d4O3Yhi#1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo I made this pretty schweet looking ship aha. Spent quite a while working on it. It currently has over 640 parts so it Lags my PC quite a bit.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI had to send up the ship in two parts and use mech jeb to dock the two together since it was honestly extremely hard to control these things.\u003C/p\u003E\u003Cp\u003EMost of the parts are seriously just for looks. And if you look at the ship as a whole it looks pretty good. However if you REALLY look down into the ship you\u0027ll see that I\u0027m still just an amateur builder and this can easily be improved upon by anybody who wants to do so. (Just give meh credit for the base D:)\u003C/p\u003E\u003Cp\u003ESo the ship has 642 parts. the back end has 420 and the front end has 242 I guess if you want to test how fast KSP will run with a huge ship this is perfect \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E It is *Nearly fully functional. It has a VERY slow turn and not exactly the greatest amount of thrust. I actually added four engines onto the back of the thing. Plus some Ion thrusters from the Deep Space Mission pack. I wanted this to be at least somewhat usable. (and yes I know the ship actually does fly more or less backwards) \u003C/p\u003E\u003Cp\u003EFor those of you who wish to enjoy this glorious ship\u0027s...uh..... Essence? Just go to here. \u003C/p\u003E\u003Cp\u003ECrew Area - \u003Ca href=\u0022https://mega.co.nz/#!RR0G2QrT!PryjHMVKlTKhERPd3AtcvKPxo_a_h-a5quA8ECwlZ8g\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://mega.co.nz/#!RR0G2QrT!PryjHMVKlTKhERPd3AtcvKPxo_a_h-a5quA8ECwlZ8g\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThrust Section (type thing) - \u003Ca href=\u0022https://mega.co.nz/#!ZcMF0ARJ!PLhFIkyheK9DmvCIEPU-1koSFlNJ8RBGq44EVKrQv0U\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://mega.co.nz/#!ZcMF0ARJ!PLhFIkyheK9DmvCIEPU-1koSFlNJ8RBGq44EVKrQv0U\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMods I used - 1. DSM (Deep Space mission Pack) 2. InterStellar Mod pack (I would like to mention that even though many parts in version 0.24.2 don\u0027t work the parts I used still work just fine) 3. MechJeb for docking the two sections together 4. Hyperedit for getting the giant hulking beasts into space. - If I missed any mod packs please tell me! \u003C/p\u003E\u003Cp\u003EAnyways I hope you guys enjoy it.\u003C/p\u003E\u003Cp\u003ETake a look at this Cinematic I made for the ship \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Pretty cool eh? \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=UURGuyR6-yQPqxc-j05hRYUA\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAnyways now that we have all of the big details outta the way I\u0027ll talk about the ship itself. Once you\u0027ve downloaded the ship you\u0027ll notice many different parts\u003C/p\u003E\u003Cp\u003Ein a ton of different areas. First let\u0027s start with the back. I took a look at alot of pictures and I would recommend searching up benprocter.com he is the guy who came up with the design for the ship originally. (I would post a link but I forget if that is against forums rules or not) I started out with the base - The DSM mod packs Circular Cockpits. I took a look at a bunch of pictures however I didn\u0027t get a good look at what the space between the two tanks (DSM Cockpits) so I figured that I should improvise. Make it smooth and technology filled. So I put Batteries, structural pieces. and lots of Generators. (plus more than a few Reactors) You will notice that alot of parts merge together. Don\u0027t worry. As long as you don\u0027t fire anything at the ship it won\u0027t blow up for no apparent reason. After creating the back I set out on creating the frame for the trusses, and Crew area (connector). I didn\u0027t spend too long in this spot. It was easy enough placing each structural piece. After Finishing off on the central spot it was time to move on to the Antimatter engines on both sides. It was easy enough I stuck some fuel and a DSM nuclear reactor for power and I was all good. However I didn\u0027t know how to make the engines. I fidgeted the parts around for a while until I figured out that you can glitch some parts inside the DSM structural pieces. Problem solved! After that I stuck on a fuel tank added the engine put a generator in the middle and it looked great! I copied this on the other side. Now after doing this I went back and added alot more reactors and structural pieces to the Ship. I was looking at a diagram and I wanted the central part to be filled up like it was supposed to be. I added a few Aero parts as support and it was finally starting to come together. At the back of the ship it was easy enough to add on the Radiators they looked cool and all you had to do was deploy them. I moved on to the weird tail thingy at the back and strengthened everything up. great time for a quick launch! I launched it up and noticed it was pretty slow so I added some quick aero spike engines (and played around with fission reactors to make it look cool) and then moved on to the crew quarters. I just looked at a bunch of pictures to do this it went by fast so I don\u0027t remember the steps I took. While looking at the pictures I started to ask myself \u0022Why would the engines be facing backwards? And then figured it out. the ship isn\u0027t supposed to fly the way I had originally though it did. so great I had wasted a long time adding a bunch of random engines to the back when it really flew the other way. Anyways. I did some research and found out the tail thingy is actually a solar sail. so I added that. so the ship does have reversing capabilities! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EUGH That was way tool long. If you read all that props to you!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-11T02:45:32Z\u0022 title=\u002208/11/2014 02:45  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 11, 2014\u003C/time\u003E by kaboom1212\u003C/strong\u003E\n\u003Cbr\u003EPictures\n\u003C/span\u003E\n"},{"CreatedByName":"Fatal_Gam3er","CreatedById":115908,"CreatedDateTime":"2014-08-10T01:02:11Z","Content":"\n\u003Cp\u003EI think this is epic, great job dude.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mike9606","CreatedById":90275,"CreatedDateTime":"2014-08-10T02:22:44Z","Content":"\n\u003Cp\u003EThe image doesn\u0027t work for me. Also, don\u0027t use a file sharing site like MEGA for images. It is for sharing files, not hosting images. Imgur is free and seems to work fine nearly always.\u003C/p\u003E\n"}]}