{"TopicId":85072,"ForumId":21,"TopicTitle":"Kerb Grave - When you wanna give your kerbals a proper \u0026quot;burial\u0026quot;","CreatedByName":"KotDemopan","CreatedById":98561,"CreatedDateTime":"2014-09-20T19:51:29Z","PageNum":1,"Articles":[{"CreatedByName":"KotDemopan","CreatedById":98561,"CreatedDateTime":"2014-09-20T19:51:29Z","Content":"\n\u003Cp\u003EAlright, we at Patnydustries based this product on the fact, that kerbals die everyday.\u003C/p\u003E\u003Cp\u003EBe it rocket-related, plane-related, car-related, over-eating-related, or heart-related accidents.\u003C/p\u003E\u003Cp\u003ESo we made a grave based on Kerbin culture.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/g9d4rn5.png\u0022 alt=\u0022g9d4rn5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHow to use:\u003C/p\u003E\u003Cp\u003E1. Find a plane that can carry the grave.\u003C/p\u003E\u003Cp\u003E1,5.: Get a kerbal inside the grave via zooming in/out\u003C/p\u003E\u003Cp\u003E2. Get off the ground with the plane.\u003C/p\u003E\u003Cp\u003E3. Depending on where the cargo is positioned, flip the plane upside-down.\u003C/p\u003E\u003Cp\u003E4. Press spacebar after activating everything else necessary.\u003C/p\u003E\u003Cp\u003E5(if flying in atmosphere). Switch to the Grave.(otherwise it will disappear)\u003C/p\u003E\u003Cp\u003E6. Wait for it to hit the ground/water.\u003C/p\u003E\u003Cp\u003E7(optional). Decouple again after you hit said ground/water.\u003C/p\u003E\u003Cp\u003ENow you have a grave with the desired kerbal(probably) in it.\u003C/p\u003E\u003Cp\u003EDL: \u003Ca href=\u0022http://www./download/pfqdoj80bnyz04r/Kerb_Grave.zip\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/pfqdoj80bnyz04r/Kerb_Grave.zip\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"jmiki8","CreatedById":94688,"CreatedDateTime":"2014-09-20T21:30:26Z","Content":"\n\u003Cp\u003ECool! But didn\u0027t you mean coffin instead of grave?\u003C/p\u003E\n"},{"CreatedByName":"chunkblaster","CreatedById":44268,"CreatedDateTime":"2014-09-20T22:59:40Z","Content":"\n\u003Cp\u003EMorbid creation is morbid. I r sad now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SeventhArchitect","CreatedById":80982,"CreatedDateTime":"2014-09-21T06:17:00Z","Content":"\n\u003Cp\u003EI launch a massive colony ship in the name of a dead kerbal. Because none of my kerbals die. Ever. And if one does, I freak out, it becomes a big thing. then I feel sad and launch a massive colony ship. Which doesn\u0027t lose a single kerbal. The dead kerbal gets a supposed ghost pod. This ghost pod has no body, nor is it supposed to have one. It\u0027s a monument to the kerbal. Because the body of the dead kerbal is in a fiery crash somewhere in space.\u003C/p\u003E\u003Cp\u003EI\u0027d give you a picture...But I haven\u0027t had a single kerbal die for, like, three versions now.\u003C/p\u003E\n"}]}