{"TopicId":88510,"ForumId":21,"TopicTitle":"M-TSP VTOL - Sulker Bird Mk IV","CreatedByName":"MonaBabii","CreatedById":52027,"CreatedDateTime":"2014-10-25T23:07:03Z","PageNum":1,"Articles":[{"CreatedByName":"MonaBabii","CreatedById":52027,"CreatedDateTime":"2014-10-25T23:07:03Z","Content":"\n\u003Cp\u003EHello \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve been a fan of Kerbal Space Program since forever, and almost every time a new update hits, I need to go in and build something crazy (to me anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) -AND- a VTOL plane. For some reason I love making these things, not sure why.\u003C/p\u003E\u003Cp\u003EHere\u0027s my latest (and only since I\u0027ve upgraded my computer including HDs):\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/IzE7A\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003EVIDEO\u003C/strong\u003E:\u003C/p\u003E\u003Cp\u003E14 days until Twitch deletes it, but it\u0027s something I guess.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.twitch.tv/monababii/b/581857410\u0022 rel=\u0022external nofollow\u0022\u003ETwitch Link\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe plane was made entirely out of Stock/Vanilla parts, and no clipping hack/cheat was used to achieve it (not that it was necessary, it\u0027s fairly crappy and simple, but fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDownload\u003C/strong\u003E:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/8gpv1e2sr7sproo/M-TSP\u002BVTOL\u002B-\u002BSulker\u002BBird\u002BMk\u002BIV.7z\u0022 rel=\u0022external nofollow\u0022\u003ELink\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAction Groups\u003C/strong\u003E:\u003C/p\u003E\u003Cp\u003E(1): Toggle Ladder\u003C/p\u003E\u003Cp\u003E(2): Toggle Wing/Horizontal Engines.\u003C/p\u003E\u003Cp\u003E(3): Toggle Vertical Engine.\u003C/p\u003E\u003Cp\u003E(0): Toggle Vertical Engine\u0027s bay Doors and Lights.\u003C/p\u003E\u003Cp\u003E*(K): Thrust Upwards once RCS and the Vertical Engine are ON (and at nearly to full throttle).\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENotes\u003C/strong\u003E:\u003C/p\u003E\u003Cp\u003E- The way the plane works is by having a vertical engine bay on the center of the plane\u0027s body, which you can open by its default key (0), and also red lights should turn on as the doors reveal the engine. Once that\u0027s done, you press 3 to activate the vertical engine, toss the throttle all the way up, and once the engine is warmed up you tap/hold (K) for the thrusters to give the plane that little extra oomph it needs. It uses some of those \u0022RCS\u0022 thrusters that use fuel instead of monopropellant. What I really like about it (although some may actually find it\u0027s the part they *don\u0027t* like \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E) is that those thrusters add just enough power to actually lift the plane, or stop it from falling. So long you hold or tap that key you pretty much have full control as the plane seems to be decently balanced (seems so \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\u003Cp\u003E- Once you\u0027re in the air, or perhaps even down at the airstrip, if you want to move forward you activate the wing horizontal engines with (2).\u003C/p\u003E\u003Cp\u003E- If you want to bring down the cockpit ladder you simply tap (1).\u003C/p\u003E\u003Cp\u003E- \u003Cstrong\u003E*\u003C/strong\u003EYou will need to turn A.S.A.S. control, unless you want to trim the airplane\u0027s pitch and what not manually which I haven\u0027t \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cstrong\u003E*\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- \u003Cstrong\u003E*\u003C/strong\u003EIn order for the (K) key to work/the thrusters around the vertical engine to fire, you will need to activate RCS mode, despite them not using monopropellant. You will also need to tap that (3) key in order to actually turn the thrusters ON, otherwise they will not work. This was on purpose in case I ever wanted to add actual RCS thruster blocks to the plane, which in the end I didn\u0027t \u0026gt;_\u0026gt;\u003Cstrong\u003E*\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECheers and have fun!\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-25T23:11:53Z\u0022 title=\u002210/25/2014 11:11  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 25, 2014\u003C/time\u003E by MonaBabii\u003C/strong\u003E\n\u003C/span\u003E\n"}]}