{"TopicId":88716,"ForumId":21,"TopicTitle":"The Rover Without a Good Name, Rover 1A","CreatedByName":"KSCraft1771","CreatedById":115960,"CreatedDateTime":"2014-10-28T02:27:09Z","PageNum":1,"Articles":[{"CreatedByName":"KSCraft1771","CreatedById":115960,"CreatedDateTime":"2014-10-28T02:27:09Z","Content":"\n\u003Cp\u003ESo, after watching Das\u0027s stream today, I took inspritation from his rover, and started building a design quite like his. I took note of the mistakes he\u0027d made, and I made sure they didn\u0027t exist in the first model. The final product is this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IHkJO7E.png\u0022 alt=\u0022IHkJO7E.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI didn\u0027t really name it, it\u0027s kinda just Rover 1A... it has a top speed of around 20m/s, maybe 25, and turns pretty stable... unless you go past 15 M/S... then this happens:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kRCJHMD.png\u0022 alt=\u0022kRCJHMD.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E Other than that, it works pretty well. Das proceeded to place a MK. 2 cargo bay around his, but I figured, \u0022Who needs protection, when you look awesome riding!\u0022 (Yes, I know I\u0027ve just opened myself up to many \u0027that\u0027s what she/he said\u0027 comments).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DhbPeZ8.png\u0022 alt=\u0022DhbPeZ8.png\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Hx6oEfZ.png\u0022 alt=\u0022Hx6oEfZ.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-28T21:37:12Z\u0022 title=\u002210/28/2014 09:37  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 28, 2014\u003C/time\u003E by KSCraft1771\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DasValdez","CreatedById":112650,"CreatedDateTime":"2014-10-28T08:51:49Z","Content":"\n\u003Cp\u003ETook note of the mistakes he made??? We were watching the same stream? Mistakes. Harumph. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KSCraft1771","CreatedById":115960,"CreatedDateTime":"2014-10-28T13:59:07Z","Content":"\n\u003Cp\u003EBy mistakes I meant earlier on, when it had a few minor issues. I was mostly listening to the steam while building and testing this, so I might be wrong.\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2014-10-28T15:50:01Z","Content":"\n\u003Cp\u003EToo bad that cockpit still has no IVA view ... it would give a good ride experience ( that is why I like to use the Cupola on rovers ... it is fun to drive from the inside )\u003C/p\u003E\u003Cp\u003EAnyway, and as a fellow member of the academy ( I forgot to see it yesterday, though ... was playing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ), I can tell you those wheels are much more powerful than you need for a rover of that weight. Too much power is something you might not want in a rover, actually;) , because it can make the rover uncontrollable or to make backward flips during climbs. You actually would be be better with the RoveMax Model M1 ( the brown ones ). Less power, but far more controllable ... btw, wanting the cool look wheels is a major reason why people fail at make rovers, since those things are normally too powerful for rovers that use 1,25 parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs I\u0027m in a place where I don\u0027t have the game in hand, I must also give you the customary warnings about rovers : steering only in the front wheels, traction and brakes only in the back ( I can\u0027t check if you have done so already , but even if you done so, the warning is never wasted ). But it is a good looking rover , anyway \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-28T16:06:21Z\u0022 title=\u002210/28/2014 04:06  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 28, 2014\u003C/time\u003E by r_rolo1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KSCraft1771","CreatedById":115960,"CreatedDateTime":"2014-10-28T21:36:37Z","Content":"\n\u003Cp\u003EThanks R_rolo1. I had motors on for the front wheels, I guess my speed issue could be solved by turning it off, or I could switch out the wheels (Though I still think I could sacrifice safety of the kerbals for looks)\u003C/p\u003E\n"}]}