{"TopicId":88732,"ForumId":21,"TopicTitle":"SSTO Designs!","CreatedByName":"Magnus77","CreatedById":127539,"CreatedDateTime":"2014-10-28T05:02:38Z","PageNum":1,"Articles":[{"CreatedByName":"Magnus77","CreatedById":127539,"CreatedDateTime":"2014-10-28T05:02:38Z","Content":"\n\u003Cp\u003EHey everybody! I\u0027ve been playing KSP since .19, but this is my first time on the forum! I thought I would share some of my recent SSTO designs with you! I put these under Mod Craft Because they have MechJeb installed on them but everything else is just the new stock parts from .25.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ij0Xt5s.jpg\u0022 alt=\u0022ij0Xt5s.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis first one is the Delta Flyer Mrk III (first two were not that great). I wanted to make an SSTO that could go to Laythe on it\u0027s own power. I have a good network of space stations set up in the solar system at this point (one at the Mun, Eve, and Dres), and a great tug design that I really like, but because of the docking port not being at the center of mass on this design I could not push it to Laythe very simply. So I designed engine modules that are self contained and can dock (usually via MechJeb) with the engine ports on the back. This design can reach orbit around Kerbin under its own power, shed two of its R.A.P.I.E.R engines and replace them with atomic ones. After refueling it can then make the trip to Laythe. The tug can then bring the R.A.P.I.E.R modules along with extra fuel and the whole thing can then serve as a Laythe transport to and from the surface (planning to create another station there soon for exploring Jool\u0027s moons). From Kerbin\u0027s surface it can reach a decent orbit of about 100 km with a couple hundred delta-v to spare, and can do even better on Laythe. Here are some shots of the process.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KL3QLK5.jpg\u0022 alt=\u0022KL3QLK5.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mxfN6TI.jpg\u0022 alt=\u0022mxfN6TI.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RlGZFLn.jpg\u0022 alt=\u0022RlGZFLn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter that I really wanted to see if I could make a design that could take more kerbal\u0027s to and from the surface (via the new 4 seater crew module). I also wanted to make it smaller and lighter so the tug could pull it to Laythe. So I made the Mrk IV. I ditched the swappable engines and removed some of the fuel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VFPLMxG.jpg\u0022 alt=\u0022VFPLMxG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis design proved to be pretty great (a tad harder to land because of less lift). The cut down weight actually made it able to reach orbit around Kerbin and Laythe with similar leftover delta-v to the Mrk III (about 400m/s at Laythe). This design was actually light enough where my tug could take two of them to Laythe with fuel to spare.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4asrsnu.jpg\u0022 alt=\u00224asrsnu.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo there ya go my first successful SSTO designs! Hope you guys enjoy them! If you would like the craft files or anything just lemme know!\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-10-28T06:54:03Z","Content":"\n\u003Cp\u003EHey Magnus, Welcome to the KSP forum! Mods such as kerbal alarm clock, mechjeb, and kerbal engineer are allowed into the category of \u0027Stock Craft\u0027, as long as there isn\u0027t a download for the craft, because that would mean that the people who play 100% stock would have to download the mod to access and/or fly the craft.\u003C/p\u003E\u003Cp\u003ENice-looking SSTOs you got here! have your first bit of rep!\u003C/p\u003E\u003Cp\u003E(Rep is the bars of green (or one grey bar if you don\u0027t have any rep at all) that is given out by pressing the star on the bottom left of your post, next to the \u0027blog this post\u0027 button. Rep is given if someone likes something you made, said, did, ecetera.) \u003C/p\u003E\u003Cp\u003EI can\u0027t explain the whole system to you, but maybe someone else who passes by here will\u003C/p\u003E\u003Cp\u003EWelcome to the forum!\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2014-10-28T07:59:50Z","Content":"\n\u003Cp\u003EI made a ssto. It ran out of fuel in the kerb in de orbit burn\u003C/p\u003E\n"},{"CreatedByName":"LvL","CreatedById":109145,"CreatedDateTime":"2014-10-28T08:05:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022megatiger78\u0022 data-cite=\u0022megatiger78\u0022\u003E\u003Cdiv\u003EI made a ssto. It ran out of fuel in the kerb in de orbit burn\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne of the best quotes ever \u0027you can always get out and push!\u0027\u003C/p\u003E\n"},{"CreatedByName":"megatiger78","CreatedById":114940,"CreatedDateTime":"2014-10-29T17:01:53Z","Content":"\n\u003Cp\u003EI tried. it just almost lost a kerbal\u003C/p\u003E\n"}]}