{"TopicId":101595,"ForumId":16,"TopicTitle":"Wobbly Rockets","CreatedByName":"spacedoctor42","CreatedById":138696,"CreatedDateTime":"2015-03-09T04:29:12Z","PageNum":1,"Articles":[{"CreatedByName":"spacedoctor42","CreatedById":138696,"CreatedDateTime":"2015-03-09T04:29:12Z","Content":"I\u0027ve been having trouble building spacecraft with the 2.5m parts. Every time I try the rockets become extremely unstable, eventually tearing themselves apart.\n\nI also can\u0027t seem to do radial decoupling with the 2.5m parts. When I try to do this, the radial fuel tanks stick to the central one and just hang there adding to the wobble.\n\nWhat am I doing wrong."},{"CreatedByName":"Red Dwarf","CreatedById":67709,"CreatedDateTime":"2015-03-09T04:53:43Z","Content":"Welllll, it depends. Could be center of mass issues. Depending on how heavy your payload is in comparison to the rest of your rocket, things can get pretty squirrely once you start flying. If it\u0027s the actual structural linkage that\u0027s a problem, you should strut it to hell and back. Space tape fixes most problems."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-03-09T04:53:52Z","Content":"Can you provide a visual example? I can\u0027t really visualize this."},{"CreatedByName":"codefox","CreatedById":139153,"CreatedDateTime":"2015-03-09T05:00:52Z","Content":"It\u0027d be nice to see a picture of your rocket.\n\nGenerally, the following applies: moar struts!\n\nAlso, you might want to check out this mod: [http://forum.kerbalspaceprogram.com/threads/55657-0-90-Kerbal-Joint-Reinforcement-v3-1-1-1-15-15](https://forum.kerbalspaceprogram.com/threads/55657-0-90-Kerbal-Joint-Reinforcement-v3-1-1-1-15-15)"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2015-03-09T05:41:14Z","Content":"Regarding your radial decoupling problem, is it possible that you\u0027re accidentally attaching the tanks to the central stack, not to the decouplers?\n\nYou\u0027ll need to make sure that the mouse cursor is over the decoupler and that there is definite separation between the central and radial stacks."},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2015-03-09T16:12:18Z","Content":"Wobble is often magnified by having too many different sources of control authority as well. What I mean by that is a rocket with a reaction wheel, a cockpit, and gimballed engines has three sources of control and torque - The cockpit, the reaction wheel, and the rocket motors. If you add in asparagus stages with lots of rocket motors that also have gimbals on them you end up with situations where you have too many things trying to control your rocket.\n\nIf you use asparagus, it\u0027s usually a good idea to disable any gimbals on your radial boosters."},{"CreatedByName":"michaelhester07","CreatedById":96470,"CreatedDateTime":"2015-03-09T17:03:58Z","Content":"Do you use the rocomax stage decoupler (2.5m decoupler, not the stack separator one)? If so you\u0027ll need to strut around it as that\u0027s where the wobbly comes from.\n\nAs far as strutting. Remember that engineers love triangles, so setting up your struts in a triangular method (with a rocket part acting as one or two of the sides) is the strongest strut pattern."},{"CreatedByName":"Flixxbeatz","CreatedById":29991,"CreatedDateTime":"2015-03-09T17:18:21Z","Content":"One word: **STRUTS.**\n\nCan\u0027t stress that further.\n\nEDIT: Check out this thing:\n\n![UyADCYn.jpg](http://i.imgur.com/UyADCYn.jpg)\n\nThose are 3m parts, but there wasn\u0027t any wobble experienced. See those wires running here and there?\n\n**Edited \u003Ctime datetime=\u00222015-03-09T17:21:48Z\u0022 title=\u002203/09/2015 05:21  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 9, 2015\u003C/time\u003E by Flixxbeatz**"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2015-03-09T17:25:11Z","Content":"Wobble happens when the weight of the rocket is too much for the \u0022joints\u0022 to handle in a stable manner.\n\nThe hard way to fix this (and better way) is to rebalance your rocket so that all joints receive an equal amount of the load. This could be as \u0022simple\u0022 as redefining where the center of mass is.\n\nThe easy way to fix this is by reinforcing your joints with struts, thereby increasing the amount of load they can handle.\n\nOf course, wobble problems are best evaluated on a case-by-case basis, but without a visual, the above should cover most wobble woes."},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-03-09T20:51:24Z","Content":"One common tactic is to place cubic octagonal struts above and below a joint (docking port, decoupler, stack separator: docking ports are weak btw) in at least 4x symmetry, and strut across the joint between them. In 8x symmetry you can also \u0022cross-stitch\u0022 them for extra strength."},{"CreatedByName":"McPoisoned","CreatedById":138265,"CreatedDateTime":"2015-03-10T16:05:19Z","Content":"Best thing to do is to install kerbal joint reinforcement like codefox said and just spam struts if you don\u0027t want to install anything ![:rolleyes:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif)"}]}