{"TopicId":102834,"ForumId":16,"TopicTitle":"Mun stuff","CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2015-03-28T08:15:01Z","PageNum":1,"Articles":[{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2015-03-28T08:15:01Z","Content":"Woot. \n\nI just completed my first \u0027satellite to orbit the Mun\u0027 mission. On my own, without consulting any tutorials on it. It was probably the most inefficient thing I have done in the game, but it was glorious to do. Even when I came in with an AN angle of 155Ã‚Â° and had to practically turn my orbit around.\n\nOk, my question now, is...I have a contract to land on the Mun, and one to put another satellite in orbit. Is it possible to send both missions together? A manned lander with a satellite held on by a docking clamp, settle into lunar orbit, release the probe, land, put the probe in it\u0027s proper orbit, lift off the Mun and return the manned craft to Kerbin?\n\nAlso, when 1.0 is released, are we going to have to restart career mode?"},{"CreatedByName":"Columbia","CreatedById":135031,"CreatedDateTime":"2015-03-28T08:22:43Z","Content":"Actually, I think so. It\u0027s a technique used by the thriftiest of KSP Space agencies. It\u0027s even used in real life: [http://en.wikipedia.org/wiki/STS-51-A](https://en.wikipedia.org/wiki/STS-51-A) (Well, in deploying multiple satellites in one mission.)\n\nAnd.. According to Squad, yes. We have to, unfortunately. But 1.0 is far away from being released soon, so it\u0027s nothing to worry about now. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-03-28T08:27:59Z","Content":"As Columbia said it is indeed very possible to piggyback a satellite on your munar lander. Just make sure your satellite has a probe core. If it doesn\u0027t have a core it will be labelled debris and it will not complete the contract. (If you plan to fly the satellite ojn it\u0027s own make 100% sure it has fuel before you decouple it.)"},{"CreatedByName":"tsotha","CreatedById":120361,"CreatedDateTime":"2015-03-28T09:02:08Z","Content":"Yes, it\u0027s possible. It\u0027s also possible (and more efficient, I think) to send an unmanned lander that completes the satellite contract before or after the Mun landing."},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2015-03-28T09:05:41Z","Content":"\u003E \n\u003E Yes, it\u0027s possible. It\u0027s also possible (and more efficient, I think) to send an unmanned lander that completes the satellite contract before or after the Mun landing.\n\nI forgot to mention the \u0027Plant a flag\u0027 contract. Thus, Manned."},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-03-28T18:12:23Z","Content":"Often more important than fuel is power, make sure you have solar panels and a battery on your satellite probe too.\n\nWhen I did my first 0.90 career I designed all of my ships to carry a small satellite probe with a simple 2HOT thermometer so that I could leave it in orbit wherever I go and always be able to complete any \u0022science data from space around X\u0022 contracts that come up later - it\u0027s a handy way to make some extra funds during your career.\n\nEDIT: just make sure you leave the satellite \u0022in space near\u0022 instead of \u0022in space high above\u0022 if you plan to use the thermometer.\n\n**Edited \u003Ctime datetime=\u00222015-03-28T18:15:31Z\u0022 title=\u002203/28/2015 06:15  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 28, 2015\u003C/time\u003E by Kelderek**"},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2015-03-28T18:55:45Z","Content":"Depending on your orbital accuracy, it\u0027s usually easier to slap a probe core on your lander and fly into the sat orbit, correct, get that contract done, then finish landing. This will, of course, depend on lander size and available dV."},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2015-03-28T21:43:35Z","Content":"Hmm. I had not thought of that. It\u0027s a polar orbit that it\u0027s asking me to do...Wouldn\u0027t that have a high dV component, to push my lander weight into a polar orbit?"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-03-28T22:08:52Z","Content":"\u003E \n\u003E Hmm. I had not thought of that. It\u0027s a polar orbit that it\u0027s asking me to do...Wouldn\u0027t that have a high dV component, to push my lander weight into a polar orbit?\n\nIf your initial orbital insertion is polar or highly elliptical it shouldn\u0027t cost that much Delta v to do the polar orbit component first. From polar orbit the lander can drop close to the equator to make for a simple equatorial plane return."},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2015-03-28T22:11:04Z","Content":"Not really. Switching to a polar orbit is just a matter of adjusting your Munar approach to come in \u0027high\u0027 instead of \u0027around\u0027. It\u0027s usually easy to do as soon as you\u0027re about 400-500k up from Kerbin and on Munar approach with some normalization and radial adjustments.\n\nThe real trick is timing it so that you\u0027re coming in at a reasonable angle to your polar orbit. You\u0027ll typically arrive ~1-1.5 days after your departure burn from Kerbin, so you\u0027d want the polar orbit somewhere between perpendicular and about a 1/3 ahead of where you\u0027ll be when you actually come in. You\u0027ll have to learn to play with conics and focusing on foreign bodies. It\u0027ll also take some practice. Some things just aren\u0027t easily explained in a forum without a ton of pictures and examples."},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-03-28T22:36:00Z","Content":"As it happens, I just this morning took my standard shuttle/lander out to Minmus, carrying a satellite with zero propellant, dropped it off in a tundra orbit, then landed and had some mint ice cream ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif) It\u0027s not got enough fuel to do it on Mun, but there\u0027s no reason a larger lander can\u0027t do the job.\n\n\u003E \n\u003E ![9HqiLqh.jpg](http://i.imgur.com/9HqiLqh.jpg)\n\u003E \n\u003E \n\n\u003E \n\u003E ... Switching to a polar orbit is just a matter of adjusting your Munar approach to come in \u0027high\u0027 instead of \u0027around\u0027...\n\nThat ^^ \n\nDone about 1/3 the way out from Kerbin, it costs about 35-50dv to go from an equatorial Mun intercept to a polar one. Your challenge will be burning from Kerbin at the right time so\u0027s your polar orbit arrives in the correct *plane* of polar orbit, rather than being n degrees out of alignment ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2015-03-29T01:48:30Z","Content":"Well,\n\nI\u0027m in the Mun\u0027s SoI. I came in 110Ã‚Â° off of the plane of orbit, which is 40Ã‚Â° better than my first attempt, with a probe by itself. I planned for inefficient flying however. I\u0027m going to drain my 3rd rocket stage getting as close to my orbital plane as possible. My lander and my probe are both carrying small fuel tanks. the probe has about 1700 m/s delta V which will be plenty to get into my orbit. My lander, well. I am guestimating, but I think I have about 1000 m/s. Mechjeb won\u0027t show me the dV on that stage, probably because it doesn\u0027t understand how it\u0027s staged. I am pausing to write this just to keep myself from getting tense.\n\nUpdate: I just separated from my last rocket stage, and my probe and lander are connected and heading to peri. I realized an oversight as I was preparing to separate. I only put a mechjeb module on the lander. Luckily I haven\u0027t been relying on mechjeb to do my flying for me. I only use the autopilot for launching run of the mill equatorial launches, so being partially blind on the probe shouldn\u0027t bother me too much\n\nUpdate #2 Oops. It\u0027s my lander that is blind. I already had very little room for error on that.\n\n**Edited \u003Ctime datetime=\u00222015-03-29T02:28:05Z\u0022 title=\u002203/29/2015 02:28  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 29, 2015\u003C/time\u003E by Starchaser**"},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2015-03-30T02:31:47Z","Content":"\u003E \n\u003E Done about 1/3 the way out from Kerbin, it costs about 35-50dv to go from an equatorial Mun intercept to a polar one. Your challenge will be burning from Kerbin at the right time so\u0027s your polar orbit arrives in the correct *plane* of polar orbit, rather than being n degrees out of alignment ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nI relaunched my mission. The profile I had for the descent, I wasn\u0027t able to land with the fuel I had. On the second attempt I managed to do this. when I circularized, once inside the munar system, my orbit was 10Ã‚Â° off on AN...not bad for a first attempt shooting from Kerbin, I think. \n\nSo, my new problem. I still didn\u0027t manage to land and retain enough fuel to come back. \n\nAs I see it I have 3 options. A problem I have though is there is no docking clamp on the lander on the moon. \n\nSo I can send a new lander, pick up Jeb and come home, or I can launch the lander into orbit, rendezvous, then EVA Jeb over and come home. Ideally though, I\u0027d like to grab on to the lander and bring it and Jeb home. Is there a way to do this, via stock, or some mod that would allow me to grab onto it, that would survive a thrust towards Kerbin?"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-03-30T02:42:06Z","Content":"Build your new ship with a scoop on the front end made out of structural parts. If you design it right, then you should be able to at least partially swallow your original ship and push it home. There is also the advanced grabbing unit, but that is probably not available if you do not also have docking ports yet."},{"CreatedByName":"Starchaser","CreatedById":139724,"CreatedDateTime":"2015-03-30T03:08:34Z","Content":"I have docking ports. I just didn\u0027t put one onto the lander. In retrospect, I will do so moving forward.\n\nAdvanced grabbing unit. Ok. I\u0027m off to the wiki to find it, and what path I need to take to get it. I have about 2100 science banked. and almost everything 300 sci and below"}]}