{"TopicId":104933,"ForumId":16,"TopicTitle":"Orbit Stays Hyperbolic","CreatedByName":"Morzaniant","CreatedById":141071,"CreatedDateTime":"2015-04-25T15:31:12Z","PageNum":1,"Articles":[{"CreatedByName":"Morzaniant","CreatedById":141071,"CreatedDateTime":"2015-04-25T15:31:12Z","Content":"I need some help here guys, not sure whats going on.\n\nI captured an asteroid (class D) and I tried to put it into the orbit of the Mun. I arranged an encounter and then *this* happened.\n\n![VMnfkHI.jpg](http://i.imgur.com/VMnfkHI.jpg)\n\nAs you can see, the orbit it hyperbolic, as it should be. But its stayed this way for over two full Munar Cycles.\n\nHeres another picture\n\n![SDvhbhH.jpg](http://i.imgur.com/SDvhbhH.jpg)\n\nAny tips or suggestions for how to fix, or even what this is called?"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-04-25T15:42:31Z","Content":"It\u0027s because you have a Kepler orbit with an eccentricy more then 1, you must slow down yourself into an orbit, that is what means. You aren\u0027t in orbit.\n\n**Edited \u003Ctime datetime=\u00222015-04-25T15:44:59Z\u0022 title=\u002204/25/2015 03:44  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 25, 2015\u003C/time\u003E by HoloYolo**"},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-04-25T15:45:26Z","Content":"KSP uses a system of newtonian motion, with no regard for relativistic effects. This means that you cannot be captured simply by just encountering. You have to manually match orbits."},{"CreatedByName":"Morzaniant","CreatedById":141071,"CreatedDateTime":"2015-04-25T16:00:52Z","Content":"I get that I have to match orbits manually. What Im saying is that my spacecraft has not moved from this position for the game equivalent of two months; stayed right on the edge of this encounter, not moving toward the periapsis like it should. It gave me an estimated time of 14 minutes, but after two complete (time accelerated) lunar orbits, the craft has not moved."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-04-25T16:52:32Z","Content":"Really? Hmm... well I\u0027m assuming you\u0027ve already gone through the book to check to usual fixes. Have you considered editing yourself into munnar orbit? It\u0027s always possible to pull your fuel levels down to compensate."},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2015-04-25T17:00:00Z","Content":"Have you just discovered a kerbal L point?????"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2015-04-25T17:31:24Z","Content":"Can think of situations where this could be ... usefull ...\n\nBut seriously ... does it have a speed (orbit, surface, target) ? Does speed change when you start the engine(s) ?\n\nI would try to isolate one of the mods. Copy away the savefile and start with a clean install. If the ship moves in clean install it\u0027s one of the mods and the work begins.\n\nk"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-04-25T17:48:14Z","Content":"There is a bug I\u0027ve encountered before where your craft\u0027s velocity is zeroed out (and remains zeroed out) upon entering a SoI. I\u0027ve only encountered it in modded instances, so it\u0027s probably a mod issue. Never was able to pin down the cause or how to reproduce it reliably, but it\u0027s very rare anyway. I think the most I ever got it in the same save was twice."},{"CreatedByName":"Morzaniant","CreatedById":141071,"CreatedDateTime":"2015-04-25T18:20:36Z","Content":"After I looked up what an L Point was, I thought I was in one; but after the game was paused for a while and restarted, everything returned to normal. Thanks guys!"},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2015-04-25T19:03:28Z","Content":"\u003E \n\u003E After I looked up what an L Point was, I thought I was in one; but after the game was paused for a while and restarted, everything returned to normal. Thanks guys!\n\nIf you mean Lagrange point, i\u0027m sorry they don\u0027t exist in KSP, the concept of SOI stands against that. Spoken in pictures, you would have to be in two SOIs at the same time to meet the criteria of a Lagrange points.\n\nk"},{"CreatedByName":"jfull","CreatedById":61722,"CreatedDateTime":"2015-04-25T19:25:22Z","Content":"I\u0027ve seen this happen before, always involving asteroids.\n\nIts a pretty bad bug"},{"CreatedByName":"DoToH","CreatedById":68428,"CreatedDateTime":"2015-04-25T21:59:25Z","Content":"Claw bug, probably. Weird things happen when you stop timewarp (and leave on rails mode) with someting attached (asteroid or another ship)."},{"CreatedByName":"Ten Key","CreatedById":123319,"CreatedDateTime":"2015-04-25T23:10:12Z","Content":"I had this happen once with a Minmus probe, no claw involved. It hung fixed in place for several hours-- I was finally able to kick it loose with the engine."}]}