{"TopicId":105595,"ForumId":16,"TopicTitle":"Resource Mining - Impressions and Questions","CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2015-04-28T11:12:00Z","PageNum":4,"Articles":[{"CreatedByName":"Drillgorg","CreatedById":141670,"CreatedDateTime":"2015-04-29T12:48:23Z","Content":"@Roverdude Bravo.\n\nAs someone who hasn\u0027t played Kethane or Karbonite (or 1.0 yet, I\u0027m waiting for 1.0.1) I think that stock sounds great.\n\nThis is what I understand of the mission profile: send a probe to polar orbit with the global scanner to get a rough idea of where the good ore is. Then send down some ground scanner probes to where you think the good ore is, they\u0027ll give you good enough resolution to pick a landing site. Maybe a rover(dude) with the ground scanner would be even better. Finally, send your factory down with the narrow band scanner turned on, so you can land right on the best ore vein.\n\nI can definitely see myself sending out a factory ship with deployable probes for planetary and ground scanning. The factory ship would set up a fuel depot for future missions to use.\n\nQuick question: will the mining equipment overheat faster on say, Moho, and slower on say, Dres due to the ambient temperature difference?"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-29T12:51:55Z","Content":"@Drillgorg - ambient temperature would affect it. The overheat just adds additional heat into the system. tho right now I am doing some reviews of that system"},{"CreatedByName":"Drillgorg","CreatedById":141670,"CreatedDateTime":"2015-04-29T12:53:54Z","Content":"I bet the bottom of the Mohole is a 100% rich ore vein."},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2015-04-29T13:17:46Z","Content":"I gave a quick try in sandbox to see what a scan looked like. I, too was kind of turned off by the science-experiment one-timeyness of the global scan... Until i read a bit more here. Seems to make sense that it is just step 1 in determining the best spot for you to mine things. I like that more steps are required to follow through with a mining operation, especially if you want it to have a good and timely yield. \n\nCould someone post some pictures of how the map covering the planet changes once some higher-detail information on resources is found? What I saw after the first scan showed hotspots and such, so I am trying to visualize what \u0022better\u0022 information about ore abundance and terrian would look like."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-29T13:34:46Z","Content":"Here you go:\n\n(And best to view at full resolution due to the rescale of the image making a moire pattern that you would not see in game)\n\n![admxCDI.png](http://i.imgur.com/admxCDI.png)"},{"CreatedByName":"Drillgorg","CreatedById":141670,"CreatedDateTime":"2015-04-29T13:38:10Z","Content":"Can you show us ground scans too? \n\nAnd am I right in thinking that the narrow band data is only visible with the scanner turned on, it doesn\u0027t get permanently added to the planetary map?"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-29T13:39:50Z","Content":"Note that the map on the planet does not change. That\u0027s by design. The planet view gives you that very rough approximation, but you do the more detailed flybys and snap images that you then use for final planning (after of course you\u0027ve landed and ground truth\u0027d since you probably want some high accuracy data).\n\n- - - Updated - - -\n\n\u003E \n\u003E Can you show us ground scans too? \n\u003E And am I right in thinking that the narrow band data is only visible with the scanner turned on, it doesn\u0027t get permanently added to the planetary map?\n\nCorrect. So kinda like the SCANSat big map, but with much higher detail and terrain data, but limited to an 8 degree square. The pic does not update live - you do a flyby and snap one of the place you are interested in, then can cycle through the resource data, review the info, etc. as your ship continues to fly around (again, kinda like big map)."},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-04-29T13:45:48Z","Content":"\u003E \n\u003E I think you\u0027re kinda missing the point that at least I was trying to make. It\u0027s not about the survey itself, that\u0027s actually a great mechanic you built there. The process of orbital mapping is the issue, not how it relates to the resource system.\n\u003E Like you said yourself on the first page regarding scansat, it takes 10 seconds to timewarp through the mapping process. That really shouldn\u0027t be a problem for anyone since we constantly timewarp anyway. So we gain 10 seconds of timewarping but what we lose is (at least to me) interesting mechanics. And what happens if I mess up something and end up in 60 degree inclination with no dV left to get polar? Normally I should still be able to map out a sizeable portion of the planet. Now the scanner for whatever magical reason just doesn\u0027t even work. \n\u003E \n\u003E But anyways I don\u0027t mean to criticize the resource system as a whole, it looks great and I can understand your reason for the instascan even if that\u0027s not what I\u0027d personally prefer. I just feel this game has too much \u0022right click - press button - you\u0027re done\u0022 -mechanics as it is.\n\nI think everyone gets the point. The main issue is in the reverse. You are harping on the instant high level, low accuracy scan, which is frankly one small part of the entire process. It is akin to taking a quote out of context.\n\nWhen taken as a whole, the stock resource system is actually more complex than say Kethane. With Kethane, yes I must build a probe with the proper power requirements, go into a polar orbit and scan. But once I have done that I am done.\n\nWith stock, I need to build a probe that can first get a high level scan (which is instant yes) but this basically lets me know if ore is present. Now I still go into a polar orbit, because that makes it easier to get my ground probes to the various biomes. So no I don\u0027t need to build a probe that has the power requirements to scan from orbit. But I do need to make a probe that can land and do ground scans of any or all biomes I might want to get more detail on. This could be a multi biome hopping probe. A probe with multiple mini ground probes. A probe with mini muli biome hopping probes. So many design choices! Once I\u0027m done with that I still can use the narrow band scanner to get an ever better idea of the ultimate landing spot.\n\nHonestly I hadn\u0027t really even noticed the first step was an instant scan, because I was already gearing up for the follow up steps. The benefit here being that those steps are very active. Picking and landing probes etc rather than just put in orbit and wait for scan to complete.\n\nYou may still not like the instant aspect of the first step. But in all honesty when taken as a whole, it is a pretty minor aspect either way."},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-04-29T14:26:06Z","Content":"\u003E \n\u003E Overheat rates are already being looked at btw.\n\nThis is good. A few posts/pages back (this thread is hard to keep up with), you said the design is for only a 5\\* engineer to avoid overheating completely. That\u0027s actually a pretty tall order given how much gametime is required to grow your own 5\\* anything. Gettin that much KXP requires mulitple interplanetary round trips (flags on Mun, Minmus, Duna, Ike, and Gilly, plus orbiting Eve), or a round trip planting flags or orbiting on most of Jool\u0027s moons. Only after returning home from all that will you have a 5\\* you can then send out again to actually do the job you hired him for.\n\nThat\u0027s a huge amount of both playing time and gametime that goes by doing all this, complicated by the timing of launch windows. And if you want refueling bases on multiple planets, you have to create numerous 5\\* engineers this same way. And because they\u0027re such a bother to create, those you have become permanent exiles, slaving away in the mines for all eternity for the evil space empire ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif).\n\nSo it seems to me that while a 5\\* Kerbal might be totally worry-free, the 3\\* and 4\\* engineers should be largely worry-free as well. IOW, shape the curve of engineer benefit so that those with 0-2 stars are pretty hopelss but the mid-level ones make a big difference. You can\u0027t even make a 3\\* Kerbal within the Kerbin system. You need 16 KXP for that, and there\u0027s only 13.25 available between Kerbin, Mun, and Minmus. The only way to send a 3\\* out on your 1st trip to Duna is to escape Kerbin\u0027s SOI into solar orbit just briefly, return to Kerbin, THEN go to Duna.\n\nAnyway, something to think about."},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-04-29T16:20:40Z","Content":"Im really happy with whats been done to mining (i actually like the instant scan, although i could care less honestly how its done as timewarping isnt really too annoying imo). I also like the fact that unlike one of the other mining mods (dont recall which one i messed wit, back in like .23) the equipment is MASSIVE and actually hard to work with especially for some very small landers.\n\nNow to rebuild my tyllium refinery replica i made a long time ago so that it can actually mine fuel and refuel the ships i have around (actually a raider MIGHT be possible now with new aerodynamics as wing orientation doesnt make it so the craft has 0 lift)."},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2015-04-29T16:21:48Z","Content":"\u003E \n\u003E And it\u0027s a fairly big downside, especially if you are playing a game where you are trying to juggle mutliple launches and so forth multitasking your space missions.\n\nOK, but that has nothing to do with the fact you can\u0027t scan the whole planet at once which is the cornerstone of stock system mistake.\n\n\u003E \n\u003E And some of the Kethane Fanboi comes out. Maybe for one Kethane\u0027s author has been AWOL for 6\u002Bmonths. Additionally while Kethane is nice (I wouldn\u0027t call it the best) it is pretty closed. Roverdude, not only created Karbonite, but more importantly Regolith, which is a very open and highly moddable general resource engine. My guess in some ways is that Squad kept the stock resource system fairly simple, but built it to be very open to being moddable specifically so stock players looking for something relatively easy to use and understand while allowing the underlying engine to feed more advanced mods.\n\nI\u0027m not a Kethane fanboi. I\u0027ve tried the mod and I liked it, but I haven\u0027t used it for long because I had other missions to do.\n\nI\u0027m well aware of Kethane\u0027s constraints and I agree they are not a good thing. All I\u0027m ridiculing here is the fact an orbiting satellite scans the whole planetary surface in a few seconds. This is no better than reading a gravioli instrument. It\u0027s downright ridiculous. Save that for an albedo instrument or something. This way it dumbs down something that could\u0027ve been a gread KSP addon.\n\nIf Squad was gonna implement a resource system, then a scan method of Kethane, ScanSat and ISA MapSat should\u0027ve been used.\n\n![2497.jpg](http://ucanr.org/blogs/wat/blogfiles/2497.jpg)"},{"CreatedByName":"klesh","CreatedById":110814,"CreatedDateTime":"2015-04-29T16:25:14Z","Content":"\u003E \n\u003E Here you go:\n\nThank you! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n\u003E \n\u003E You must spread some Reputation around before giving it to RoverDude again."},{"CreatedByName":"goldenpsp","CreatedById":113874,"CreatedDateTime":"2015-04-29T16:37:13Z","Content":"\u003E \n\u003E OK, but that has nothing to do with the fact you can\u0027t scan the whole planet at once which is the cornerstone of stock system mistake.\n\u003E I\u0027m not a Kethane fanboi. I\u0027ve tried the mod and I liked it, but I haven\u0027t used it for long because I had other missions to do.\n\u003E \n\u003E I\u0027m well aware of Kethane\u0027s constraints and I agree they are not a good thing. All I\u0027m ridiculing here is the fact an orbiting satellite scans the whole planetary surface in a few seconds. This is no better than reading a gravioli instrument. It\u0027s downright ridiculous. Save that for an albedo instrument or something. This way it dumbs down something that could\u0027ve been a gread KSP addon.\n\u003E \n\u003E If Squad was gonna implement a resource system, then a scan method of Kethane, ScanSat and ISA MapSat should\u0027ve been used.\n\u003E \n\u003E [http://ucanr.org/blogs/wat/blogfiles/2497.jpg](http://ucanr.org/blogs/wat/blogfiles/2497.jpg)\n\nYou should probably then read and respond to my post #83 above as it is the most relevant. In essence you are picking on just one of the pieces to the scanning puzzle. As I said above, akin to taking a quote out of context. When viewing the entire process as a whole the first part instant scan really becomes a minor portion of the work needed. You may still not like it (your prerogative) but it really becomes a minor nitpick as part of the whole."},{"CreatedByName":"Drillgorg","CreatedById":141670,"CreatedDateTime":"2015-04-29T16:38:32Z","Content":"\u003E \n\u003E This way it dumbs down something that could\u0027ve been a gread KSP addon.\n\nI don\u0027t see the problem. Literally the only thing they omitted is the time warp. You still have to achieve a polar orbit to scan the whole planet. And forcing us to do it in real time without time warp would be awful.\n\nAnd even better, the planetary scan is vague and not suitable for mining. You still need the local scanners to actually get good concentrations of ore."},{"CreatedByName":"paelleon","CreatedById":97364,"CreatedDateTime":"2015-04-29T16:46:05Z","Content":"Well, I think SQUAD should **rename ORE in WATER**. After all the stuff can only be converted into fuel. This will help life support mods and free the name ORE for some more resource gathering (ELP....)."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-29T17:14:05Z","Content":"The name Ore actually makes perfect sense. It\u0027s simply dirt/rock from which it is economically viable to extract valuable stuff. full stop. Most ores are metals, but not all (Asbestos being one). And it is not a geological term, but an economic one. Keeping a very generic term like Ore also fits in with other KSP resource names, and leaves it\u0027s final composition not only open to interpretation, but also completely flexible. This is a good thing."},{"CreatedByName":"Pipcard","CreatedById":2541,"CreatedDateTime":"2015-04-29T17:19:45Z","Content":"Except liquid rocket propellants are usually compounds of non-metals like carbon, hydrogen, oxygen, and nitrogen.\n\n**Edited \u003Ctime datetime=\u00222015-04-29T17:23:40Z\u0022 title=\u002204/29/2015 05:23  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by Pipcard**"},{"CreatedByName":"m4inbrain","CreatedById":108770,"CreatedDateTime":"2015-04-29T17:20:22Z","Content":"Well, i would\u0027ve liked \u0022minerals\u0022 more than \u0022ore\u0022, but that\u0027s just me, in the end it really doesn\u0027t matter if it\u0027s called water, ore, kethane, or whatever. \u0022Stuff that makes rockets go\u0022, maybe. As a suggestion."},{"CreatedByName":"Matt516","CreatedById":133442,"CreatedDateTime":"2015-04-29T17:26:41Z","Content":"\u003E \n\u003E It\u0027s 1:1 mass-wise, the assumption is that some rudimentary sorting takes place during excavation. Yes, for realism there should be a loss factor. However had to compromise for gameplay reasons on this one (so in that regard, it\u0027s closer to Kethane (which is nearly lossless) than Karbonite (which is very lossy).\n\nDoesn\u0027t this present a problem in which it\u0027s actually better to store fuel as ore than in fuel tanks? Since the ore tanks have a better mass ratio than the fuel tanks?"},{"CreatedByName":"bitbucket","CreatedById":6676,"CreatedDateTime":"2015-04-29T17:33:30Z","Content":"With the size and diversity of the fanbase, there\u0027s no way possible to come up with something that satisfies everyone. I doubt anyone is 100% happy with the end result, but the stock systems are what they are, and for those who can\u0027t live with it, there are always mods to change it."},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2015-04-29T17:39:30Z","Content":"Ok RoverDude, since you think everything is just fine, explain to me why both of my drills go to 100% heat the second that I unfold them on the moon. I have Bill as the ship pilot, five star engineer. I have no less than 96 panels added to try to keep cool. I cannot remove a single ounce of ore resource from the moon. Not a single ounce! No matter the warp level, no matter how much heatsink I add, nothing works. Also, linear mode is not working with RCS anymore. I cannot translate unless I use the translation keys. The only mod I have installed is MechJeb. I uninstalled it and I get the same results. I don\u0027t think the resource system is working like you think it is. Something is very broken."},{"CreatedByName":"ComradeWolfe","CreatedById":142254,"CreatedDateTime":"2015-04-29T18:44:31Z","Content":"Hi all, first post ever here. Played since October 2013...\n\nFirst of all, thanks for the stock ISRU system RoverDude. I\u0027ve used Kethane, Karbonite, and SCANsat and can generally say that I\u0027m satisfied with the new system (caveat: I haven\u0027t had a whole lot of time to play yet).\n\nTo the detractors, please take a moment to remember that this is not Kethane or Karbonite -- it\u0027s a new system which you will have to LEARN in order to utilize (just like all of KSP was when you first started playing). When offering up any criticism, please also be sure it\u0027s productive. If all you\u0027re doing is saying \u0022it sucks\u0022 without any input as to how to fix it, you\u0027re only serving to make RoverDude feel sad... And sad devs write sad code. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nSo my observations:\n\nOverheats: Radiators are a good quick fix. Also, the bell-curve for 3\\* engineers seemed good. I didn\u0027t test yet, but would adding multiple low level engineers help thermals too (IE: a handful of novices = an intermediate engineer)?\n\nInstaScan: I\u0027d like for the wide scanned to do scan only what it has LOS to. This means 2-3 scans for a whole planet (this keeps simplicity for the player while removing the \u0022it\u0027s magic!\u0022 factor of instascan (with the side-effect of being tons of code, I suppose - sorry!)).\n\nOre conversion: I\u0027d like to see ore heavier or producing a lower amount of fuel/oxidizer mass. To me, ore should be noticably less convenient to move than \u0022processed\u0022 materials (it\u0027s got a lot of dirt mixed in).\n\nThanks again, and keep up the good work. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-29T18:48:53Z","Content":"\u003E \n\u003E Doesn\u0027t this present a problem in which it\u0027s actually better to store fuel as ore than in fuel tanks? Since the ore tanks have a better mass ratio than the fuel tanks?\n\nThis has already been looked at and tweaked.\n\n\u003E \n\u003E Ok RoverDude, since you think everything is just fine, explain to me why both of my drills go to 100% heat the second that I unfold them on the moon. I have Bill as the ship pilot, five star engineer. I have no less than 96 panels added to try to keep cool. I cannot remove a single ounce of ore resource from the moon. Not a single ounce! No matter the warp level, no matter how much heatsink I add, nothing works. Also, linear mode is not working with RCS anymore. I cannot translate unless I use the translation keys. The only mod I have installed is MechJeb. I uninstalled it and I get the same results. I don\u0027t think the resource system is working like you think it is. Something is very broken.\n\nI\u0027ve already noted on a couple of threads now that we\u0027re aware the ISRU/drill bits are a bit toasty right now. And your translation keys have as much to do with resources as ham does with hamsters ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Drillgorg","CreatedById":141670,"CreatedDateTime":"2015-04-29T18:59:07Z","Content":"So, anyone else planning to mine a class E near Kerbin asteroid, continually generating fuel to propel the asteroid? I want to attempt to push a very large asteroid into Kerbin orbit this way, then use it as a gas station. I think it will depend in how much ore the asteroids actually hold."},{"CreatedByName":"RoverDude","CreatedById":105198,"CreatedDateTime":"2015-04-29T19:16:06Z","Content":"\u003E \n\u003E Hi all, first post ever here. Played since October 2013...\n\u003E First of all, thanks for the stock ISRU system RoverDude. I\u0027ve used Kethane, Karbonite, and SCANsat and can generally say that I\u0027m satisfied with the new system (caveat: I haven\u0027t had a whole lot of time to play yet).\n\u003E \n\u003E To the detractors, please take a moment to remember that this is not Kethane or Karbonite -- it\u0027s a new system which you will have to LEARN in order to utilize (just like all of KSP was when you first started playing). When offering up any criticism, please also be sure it\u0027s productive. If all you\u0027re doing is saying \u0022it sucks\u0022 without any input as to how to fix it, you\u0027re only serving to make RoverDude feel sad... And sad devs write sad code. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\u003E \n\u003E So my observations:\n\u003E \n\u003E Overheats: Radiators are a good quick fix. Also, the bell-curve for 3\\* engineers seemed good. I didn\u0027t test yet, but would adding multiple low level engineers help thermals too (IE: a handful of novices = an intermediate engineer)?\n\u003E \n\u003E InstaScan: I\u0027d like for the wide scanned to do scan only what it has LOS to. This means 2-3 scans for a whole planet (this keeps simplicity for the player while removing the \u0022it\u0027s magic!\u0022 factor of instascan (with the side-effect of being tons of code, I suppose - sorry!)).\n\u003E \n\u003E Ore conversion: I\u0027d like to see ore heavier or producing a lower amount of fuel/oxidizer mass. To me, ore should be noticably less convenient to move than \u0022processed\u0022 materials (it\u0027s got a lot of dirt mixed in).\n\u003E \n\u003E Thanks again, and keep up the good work. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nOverheat fix is in the works. Insta-Scan is a design choice, totally get it\u0027s not everyone\u0027s bag. Some love it, some hate it, some hate it then love it after they realize that it\u0027s just a first step in the rest of the system. Since I can\u0027t please everyone, we\u0027ll leave it as-is.\n\nThe ore conversion - I personally prefer lossy reactions, but in this case there was a design issue where we had to make some choices, and we chose to remove the lossyness here to ensure we did not violate conservation of mass somewhere else."}]}