{"TopicId":105879,"ForumId":16,"TopicTitle":"Radial Mount Parachutes","CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-04-29T03:14:03Z","PageNum":1,"Articles":[{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-04-29T03:14:03Z","Content":"I had a very odd message pop up when I went to deploy Mk2-R Radial Mount Parachute(s)... \u0022Cannot deploy while stowed!\u0022. Even clicking on the deploy button in the right-click context menu would not work. I\u0027m not sure why this is happening. Any ideas?\n\n![hm19ClC.png](http://i.imgur.com/hm19ClC.png)\n\n**Edited \u003Ctime datetime=\u00222015-04-30T17:11:05Z\u0022 title=\u002204/30/2015 05:11  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 30, 2015\u003C/time\u003E by LordFerret**"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-29T03:16:56Z","Content":"It might think that they are in the service bay, try opening the service bay and deploying your chutes. Then submit a bug report."},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-04-29T03:41:44Z","Content":"\u003E \n\u003E It might think that they are in the service bay, try opening the service bay and deploying your chutes. Then submit a bug report.\n\nI\u0027ll test that out before changing the thread status. Thanks for the suggestion.\n\nEDIT\n\nOddly enough, after three attempts, I wasn\u0027t able to reproduce the problem. ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)\n\n**Edited \u003Ctime datetime=\u00222015-04-29T05:29:39Z\u0022 title=\u002204/29/2015 05:29  AM\u0022 data-short=\u00229 yr\u0022\u003EApril 29, 2015\u003C/time\u003E by LordFerret**\n  \ntesting results"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-04-30T02:11:48Z","Content":"Ok, well, after gaining more science and attaining more parts and experiments, I\u0027ve rebuilt my initial \u0022Progress-1\u0022 rocket using the same radial chute setup as before. Catastrophic failures on two tests (from other reasons - overpower \u0026 oversteering) had me testing the chutes again unexpectedly. Twice in a row, I got the same resulting problem ... only this time it was just one of the chutes which failed to deploy. I was even mindful this time to mount the chutes higher up on the Mk1 pod too.\n\nI exited out and prepared my screenshot and files for a bug report, but then remembered the suggestion of opening up the Service Bay and trying to deploy the chute then. So, I reentered the game to give it a go. Lo and behold, after three launch tests, all the chutes deployed without a problem. Exiting the game and then reentering it somehow magically solved the issue(?). I\u0027m still going to post it as a potential bug report. I\u0027ll also leave this thread as an unresolved issue (for now).\n\n![0UOtwdM.png](http://i.imgur.com/0UOtwdM.png)"},{"CreatedByName":"Melcom","CreatedById":89393,"CreatedDateTime":"2015-04-30T15:15:34Z","Content":"The problem are the cargoholds. the \u0022protected\u0022 area seems to be too big or is somehow calculated wrong. If you open the cargohold, the \u0022stowed\u0022 problem is gone. Not the best way to work around this. ^^"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-04-30T15:18:48Z","Content":"\u003E \n\u003E The problem are the cargoholds. the \u0022protected\u0022 area seems to be too big or is somehow calculated wrong. If you open the cargohold, the \u0022stowed\u0022 problem is gone. Not the best way to work around this. ^^\n\nI agree with this. I did a quick and dirty test last night and placing parachutes on the side of the cargo bay had the same issue."},{"CreatedByName":"Melcom","CreatedById":89393,"CreatedDateTime":"2015-04-30T15:23:57Z","Content":"the thing is, your items can be anywhere near the bay and have a failure. I attachend 2 tanks radialy and added the big chutes on the tanks. It failed."},{"CreatedByName":"Kaezan","CreatedById":108274,"CreatedDateTime":"2015-04-30T15:45:19Z","Content":"The ServiceBay uses a bubble to detect if a part is inside or outside.\n\nTaking the 1.25m as example, it has a \u0022lookupRadius = 0.9\u0022 . This means that this service bay will look for parts which may be inside in a bubble of 90% of its size. Rescaling to Kerbin size, the 1.25 meters Bay will look up in a bubble of 1.125 meters. \n\nNotice i said bubble. It will look up in every direction.\n\nMost parts have some of its model inside other models. Like the Radial Chutes and the MK1. the Chutes will have some of its size inside the MK1, otherwise it would look awful cause it would look like 2 separate parts bonded by magic.\n\nSo that tiny part of the radial chutes that touch the bubble will tell the game that they are inside the Bay when actually they are outside.\n\nAnd there is little you can do about it because:\n\n1) If the chute model gets thinner, it wont fit all other parts\n\n2) If the bubble gets smaller it wont cover the entire Bay\n\nI ask the modders to correct me if im wrong, but i believe this is the simplest way to have it implemented\n\n---- updated ----\n\nTested the ServiceBay with lookupradius of 0.9, 1 and 2. chutes still working. Will test orientation later\n\n**Edited \u003Ctime datetime=\u00222015-04-30T18:32:46Z\u0022 title=\u002204/30/2015 06:32  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 30, 2015\u003C/time\u003E by Kaezan**"},{"CreatedByName":"Jananton","CreatedById":83920,"CreatedDateTime":"2015-04-30T15:56:16Z","Content":"I had the same issue today, so I moved the chutes more up at the sides of the capsule the second try and then it worked. It has probably to do with the way a sphere collider works in Unity, what we would need is a cylinder collider here. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nGreets,\n\nJan"},{"CreatedByName":"Bundyfly","CreatedById":104482,"CreatedDateTime":"2015-04-30T16:35:52Z","Content":"I usually have a reaction wheel on the bottom of that capsule with the storage area under that...never seen that issue. I think it is a problem with the size of the \u0022bubble\u0022 of the storage unit."},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2015-04-30T17:10:27Z","Content":"I posted this in the Unmodded Installs Support section... seems the general consensus is the situation of the Service Bay and parts placement around it. At this point I don\u0027t think there can or will be a fix for it ... so the advice posted here by several *is* the way to go - **keep stuff (chutes, etc) clear of the Service Bay**.\n\nMarking thread as \u0022Answered\u0022."},{"CreatedByName":"LiquidFenrir","CreatedById":126359,"CreatedDateTime":"2015-04-30T17:35:10Z","Content":"I think you can fix this by turning the service bay. I always have the doors in the same direction as the pod door, and I never had this problem."},{"CreatedByName":"Melcom","CreatedById":89393,"CreatedDateTime":"2015-04-30T18:12:51Z","Content":"well, all this bubble-theory does not work for me. How can it be that while i attach 4 radial chutes on a pod, nearly 1m above the service bay, some chutes work, some don\u0027t? Does the bubble moves freely around the bay?\n\nThey need to fix this because it kind of ruins the experiance of free ship buidling."}]}