{"TopicId":106388,"ForumId":16,"TopicTitle":"Whats the meaning of Reputation","CreatedByName":"Kettlec","CreatedById":97587,"CreatedDateTime":"2015-04-30T21:11:47Z","PageNum":1,"Articles":[{"CreatedByName":"Kettlec","CreatedById":97587,"CreatedDateTime":"2015-04-30T21:11:47Z","Content":"I have been playing the Carrier-mode and got lots of Reputation for completing contracts and so on.\n\nNow I wonder what to do with it. The game same says nothing about this. I get more and more of it and never failed a contract, where I could lost some.\n\nThe exact number of Reputation is shown nowhere and I keep converting it to Funds and Science but I have no clue, why this resource is in the game. \n\nDoes anyone know it?\n\n**Edited \u003Ctime datetime=\u00222015-04-30T21:25:00Z\u0022 title=\u002204/30/2015 09:25  PM\u0022 data-short=\u00229 yr\u0022\u003EApril 30, 2015\u003C/time\u003E by Kettlec**"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2015-04-30T21:14:34Z","Content":"[http://wiki.kerbalspaceprogram.com/wiki/Reputation](http://wiki.kerbalspaceprogram.com/wiki/Reputation)\n\nKSP Wiki is your friend ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Aser","CreatedById":139420,"CreatedDateTime":"2015-04-30T21:15:32Z","Content":"Higher reputation will mean that you are granted more advanced contracts with better payout and new challenges.\n\nEdit: ninja ^"},{"CreatedByName":"Tery215","CreatedById":89094,"CreatedDateTime":"2015-04-30T21:16:16Z","Content":"I found the exact reputation in one of the administration building options, i think it was the reputation -\u003E science plan.\n\n\u003E \n\u003E It appears that the reputation changes the prestige of available contracts. Reputation (if positive) can be spent to activate certain Strategies in the Administration Facility. Also, a minimum reputation level is required for most of the other strategies with the amount increasing with commitment level."},{"CreatedByName":"Blu_C","CreatedById":39941,"CreatedDateTime":"2015-04-30T21:18:54Z","Content":"In the administration building you can also use various programs to get different effects. One really popular one is to get reduced reputation from successfully completing contracts in exchange for earning more money."}]}