{"TopicId":106534,"ForumId":16,"TopicTitle":"Cant activate engine while stowed","CreatedByName":"Kettlec","CreatedById":97587,"CreatedDateTime":"2015-05-01T11:08:44Z","PageNum":1,"Articles":[{"CreatedByName":"Kettlec","CreatedById":97587,"CreatedDateTime":"2015-05-01T11:08:44Z","Content":"I tryed to land a vessel on mun and everything works fine untill I wanted to activate my engines for breking.\n\nThe ship has 3 identical engines but only 2 started and the last one keeps telling me, that I can not activate it while ist stowed.\n\nI tryed several quickloads and all engines work in the space but near the surface one of them wont activate.\n\nWhat does it mean, that it is stowed up and why are the other 2 identical engines working then? Or is it just a bug?\n\n**Edited \u003Ctime datetime=\u00222015-05-01T19:31:19Z\u0022 title=\u002205/01/2015 07:31  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 1, 2015\u003C/time\u003E by Kettlec**"},{"CreatedByName":"Vectura","CreatedById":119212,"CreatedDateTime":"2015-05-01T12:02:13Z","Content":"Is it near a service bay? I have heard of many issues with them because of the way they decide if they contain a part or not."},{"CreatedByName":"Kettlec","CreatedById":97587,"CreatedDateTime":"2015-05-01T12:12:41Z","Content":"\u003E \n\u003E Is it near a service bay? I have heard of many issues with them because of the way they decide if they contain a part or not.\n\nNot really...\n\nThe vessel has a service bay on the top, but thats nearly 10 metres away from the engine. There is a material-study-part in the middle of my 3 engines, but the oter two are doing fine."},{"CreatedByName":"phunk","CreatedById":77377,"CreatedDateTime":"2015-05-01T14:44:09Z","Content":"I had a similar problem with a radial parachute, said it couldn\u0027t deploy while stowed, when the other one symetrical to it deployed fine. Was near the top of a command pod, nearest service bay was under the command pod."},{"CreatedByName":"Habalabam","CreatedById":132821,"CreatedDateTime":"2015-05-01T18:06:50Z","Content":"Exact same thing happened to me. Radial parachute would not deploy \u0022while stowed\u0022 whereas the symmetrically placed one opened fine."},{"CreatedByName":"Frozen_Heart","CreatedById":118627,"CreatedDateTime":"2015-05-02T20:09:09Z","Content":"I\u0027m having the problem with a fairing. Even when the interstage is jettisoned it still says the engine is stowed."}]}