{"TopicId":107454,"ForumId":16,"TopicTitle":"What happened to the atomic engine!?","CreatedByName":"nmorrish","CreatedById":143030,"CreatedDateTime":"2015-05-04T16:27:16Z","PageNum":1,"Articles":[{"CreatedByName":"nmorrish","CreatedById":143030,"CreatedDateTime":"2015-05-04T16:27:16Z","Content":"I have done a lot of playing around, and have noticed that the atomic engine in 1.0 seems to be way less efficient than it was in previous versions. Even though it no longer needs oxidiser, it produces less than half the delta v of the LV-909 engine (the next most efficient engine in the game). I have done all sorts of experiments and there is no doubt this is the case. This doesn\u0027t really make sense since it still has the highest Isp. What happened to it? Are there plans to rectify this issue? If not, what can be done to fix this?"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-04T16:43:31Z","Content":"Welcome aboard!\n\nHave a look at [this thread](https://forum.kerbalspaceprogram.com/threads/119135-LV-N-Delta-V-Is-this-right) discussing a similar topic, basically the greater mass of the LV-N means it doesn\u0027t produce more delta-V until propellant and payload masses are sufficiently large."},{"CreatedByName":"Radam","CreatedById":79910,"CreatedDateTime":"2015-05-04T16:45:43Z","Content":"Also if you are using KER to display dV, make sure you are using vacuum values."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-04T16:49:13Z","Content":"^^ Good point. Also make sure that you use liquid fuel-only tanks instead of liquid fuel/oxidizer tanks, LV-Ns don\u0027t use oxidizer so that is just extra mass."},{"CreatedByName":"nmorrish","CreatedById":143030,"CreatedDateTime":"2015-05-04T17:44:44Z","Content":"I see the problem now and kind of know how to fix it. I stacked two of the super jumbo tanks (drained of oxidizer) and got a much better delta v than what could be accomplished with the LV-909. But this is still a problem. Right now I am trying to build a good rocket to get to the Jool system and back. All my previous designs in .90 were very compact things with one or two LV-Ns. Huge rockets tend to be unstable in 4x time warp and I am not wanting to wait the 2 full hours it takes for a burn."},{"CreatedByName":"nmorrish","CreatedById":143030,"CreatedDateTime":"2015-05-04T17:59:50Z","Content":"Plus, any prolonged burn causes everything to overheat and explode."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-05-04T18:30:37Z","Content":"Heat management is a new mechanic, and I agree it is difficult with the LV-N. I\u0027ve found it best to attach your LV-Ns to large fuel tanks, and cover that large tank with wing parts to radiate away the heat."},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-04T18:34:34Z","Content":"\u003E \n\u003E Heat management is a new mechanic, and I agree it is difficult with the LV-N. I\u0027ve found it best to attach your LV-Ns to large fuel tanks, and cover that large tank with wing parts to radiate away the heat.\n\nOr just make your own ModuleManager cfg file to nerf the ridiculous heating mechanic. Seriously, the system is flawed because it makes more massive objects heat up faster than less massive ones, which is bass-ackwards compared to how heat really works. So until Squad fixes this, I refuse to deal with it."},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-04T21:46:12Z","Content":"Yes, when you attach an Oscar-B to an LV-N it *totally* heats up slower than a 2.5m tank attached to an LV-N.\n\nDon\u0027t confuse the fact that engine heatproduction is scaled by thermal mass (for mod backwards compatability, one assumes) with anything about the actual thermal system. Otherwise you just look silly. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"}]}