{"TopicId":107965,"ForumId":16,"TopicTitle":"Help with the 1.0.2 Aero","CreatedByName":"Gfurst","CreatedById":126201,"CreatedDateTime":"2015-05-06T21:01:18Z","PageNum":1,"Articles":[{"CreatedByName":"Gfurst","CreatedById":126201,"CreatedDateTime":"2015-05-06T21:01:18Z","Content":"So with 1.0 release and new aero it was simply kersmatic. Building a aero efficient rocket you could put them in orbit around ~3000dV or less. After the 1.0.2 update this simply is no more.\n\nNow I\u0027m needing around ~4000dV or more. Pretty rough getting through the lower layer of the atmosphere.\n\nNow I\u0027m experiencing some difficult with the sounding rockets mod, they\u0027re being really though to get sub-orbital, I\u0027m doing some balancing and test and reached pretty much the limit of balance.\n\nUpon testing I\u0027ve noticed the rockets having a incredible break due to drag alone, turning on the the aero info, I\u0027ve found that my in-line tank is the one getting most of the drag.\n\nSo first of all, it seem my global drag multiplier is 8, is it normal? Check out my physics file, haven\u0027t touched it.\n\n    dragMultiplier = 8.0dragCubeMultiplier = 0.1angularDragMultiplier = 2liftMultiplier = 0.055liftDragMultiplier = 0.025bodyLiftMultiplier = 10.7aeroFXStartThermalFX = 2aeroFXFullThermalFX = 3.5aeroFXExponent = 3thermalMaxIntegrationWarp = 100spaceTemperature = 4solarLuminosityAtHome = 1360solarInsolationAtHome = 0.15convectionDensityExponent = 1convectionVelocityExponent = 3convectionFactorSplashed = 300fullConvectionAreaMin = 0.2fullToCrossSectionLerpStart = 0.8fullToCrossSectionLerpEnd = 1.5machConvectionStart = 2machConvectionEnd = 4machConvectionExponent = 3partEmissivityExponent = 4radiationFactor = 1convectionFactor = 40newtonianConvectionFactorBase = 2newtonianConvectionFactorTotal = 3NewtonianVelocityExponent = 1.5conductionFactor = 10internalHeatProductionFactor = 0.03aerodynamicHeatProductionFactor = 1standardSpecificHeatCapacity = 800\n\nSecondly, a lot of parts still present the maximum/minimum drag values, isn\u0027t this deprecated or am I wrong?\n\nWhat about the angular drag, how would this work? Am I missing another important entry for drag?"},{"CreatedByName":"foxkill2342","CreatedById":120834,"CreatedDateTime":"2015-05-06T22:06:16Z","Content":"Change your numbers back to 1.0 values.\n\ndragMultiplier = 6.0\n\ndragCubeMultiplier = 0.06\n\nangularDragMultiplier = 2\n\nliftMultiplier = 0.038\n\nliftDragMultiplier = 0.03\n\nbodyLiftMultiplier = 8\n\n[Source](http://www.reddit.com/r/KerbalSpaceProgram/comments/34mkql/why_101102_atmosphere_changes_are_a_bit/)"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2015-05-07T01:23:32Z","Content":"And watch as you have half the drag of FAR."},{"CreatedByName":"Gfurst","CreatedById":126201,"CreatedDateTime":"2015-05-08T15:49:32Z","Content":"@foxkill2342, thanks, I do need to setup a reddit account to keep up with the good stuff. I\u0027ve actually set this and forgot to reply back.\n\n@NathanKell, actually I find it very differently. With FAR I always had a really difficult time slowing planes down for a landing, and also couldn\u0027t get proper stalls.\n\nTo me it seems that FAR works well trans-sonic and above, but drag doesn\u0027t scale up properly going sub-sonic, planes could glide for a really long time without loosing altitude...\n\nAnd yes, this was the behavior back in 0.25 when I used to play and is the same now with the latest dev branch.\n\nI\u0027m going to report it when they release or open another thread.\n\nOn another note, I do think the new stock system works reasonably well, we just have to account for incorrect cubes when they happen.\n\nWith that said, I\u0027m looking for a way to make the system a bit more realistic and challenging, harder stalls and more need for efficiency. Check [this out](https://forum.kerbalspaceprogram.com/threads/119108-Overhauls-for-1-0), in the last post I\u0027m asking on how to do that."}]}