{"TopicId":108611,"ForumId":16,"TopicTitle":"Contractee not satisfied, kerban lawyer needed!","CreatedByName":"jamarino","CreatedById":143645,"CreatedDateTime":"2015-05-10T17:05:15Z","PageNum":1,"Articles":[{"CreatedByName":"jamarino","CreatedById":143645,"CreatedDateTime":"2015-05-10T17:05:15Z","Content":"Lately I\u0027ve been burning a lot of fuel trying to complete a mission. I was contracted to build an 11-kerbal capacity space station, and place it in solar orbit along a class E asteroid.\n\nI went ahead and build my biggest space station yet, put it in the sky, did a low-orbit refuel and finally broke free from Kerbin.\n\nOnce I had synced up with my chosen asteroid, I realized something was off. All requirements for the contract were fulfilled, except for one. I needed to stick the station onto the asteroid, and I hadn\u0027t brought a claw..\n\nWhen I finally regained motivation, I build an unmanned claw capable of docking the station and sticking it to the asteroid. It went better than I had hoped for!\n\nHowever.. My contractee seems dissatisfied. They agree that I have now fulfilled the missing requirement, but at the same time they have revoked satisfaction on another requirement..\n\nSee for yourself:\n\n![ksp_plz2.png](http://s11.postimg.org/ezh2nj22b/ksp_plz2.png)\n\nI\u0027ve tried undocking the second half of the claw (the white tank \u002B engine facing the camera), thus leaving an open docking port. But still, they won\u0027t pay up ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\nAny tips or similar experiences?\n\nRegards,\n\nJonathan\n\n**Edited \u003Ctime datetime=\u00222015-05-10T21:25:24Z\u0022 title=\u002205/10/2015 09:25  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 10, 2015\u003C/time\u003E by jamarino**\n  \nChanged to answered"},{"CreatedByName":"vicwarrior","CreatedById":120410,"CreatedDateTime":"2015-05-10T17:40:58Z","Content":"The station has to be built after the contract has been accepted, an already existing station will not fullfill the contract requierements."},{"CreatedByName":"windows_x_seven","CreatedById":112926,"CreatedDateTime":"2015-05-10T17:47:53Z","Content":"\u003E \n\u003E The station has to be built after the contract has been accepted, an already existing station will not fullfill the contract requierements.\n\nThat ^\n\nOr just open the debug menu (ALT\u002BF12) and manually complete the contract."},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2015-05-10T17:57:50Z","Content":"I dunno. When it states a docking port, does it have to be an available, unoccupied docking port?"},{"CreatedByName":"jamarino","CreatedById":143645,"CreatedDateTime":"2015-05-10T21:12:05Z","Content":"\u003E \n\u003E The station has to be built after the contract has been accepted, an already existing station will not fullfill the contract requierements.\n\nThe station was build after the fact. When I first arrived at the asteroid, the requirement was fulfilled. It went back to being unfulfilled after I attached the claw module and connected with the asteroid :/\n\n\u003E \n\u003E ... just open the debug menu (ALT\u002BF12) and manually complete the contract.\n\nThanks for the tip ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"falloutaddict","CreatedById":140606,"CreatedDateTime":"2015-05-11T01:27:27Z","Content":"I have been having the same issue with some contracts not wanting to complete... Just like windows says, i just alt-f12 and complete through the debug menu."},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2015-05-11T01:31:40Z","Content":"If the asteroid existed before the contract, and after docking (clawing, same thing) with the asteroid, could the contract interpret it as \u0022it already existed before the contract was created?\u0022"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-05-11T12:37:49Z","Content":"It\u0027s either needing a FREE port, or the asteroid ... if it\u0027s the latter, you MIGHT be able to fix it by undocking the claw\u002Basteroid, then docking again with control on the claw side of things at the moment of contact."},{"CreatedByName":"Callmedave","CreatedById":62412,"CreatedDateTime":"2015-05-11T12:48:02Z","Content":"You sure that\u0027s a class E asteroid?"}]}