{"TopicId":109742,"ForumId":16,"TopicTitle":"What is the dotted texture in the ore survey?","CreatedByName":"MathmoRichard","CreatedById":113752,"CreatedDateTime":"2015-05-18T01:37:37Z","PageNum":1,"Articles":[{"CreatedByName":"MathmoRichard","CreatedById":113752,"CreatedDateTime":"2015-05-18T01:37:37Z","Content":"I\u0027m kinda new to the game and I just got an orbital survey done of the Mun. When clicking through the three \u0027styles\u0027 in the map/tracking station I find that the dotted one seems completely different to the other two. Can anyone explain this?\n\nI was going to upload images but Imgur keeps giving me errors, I will edit them in ASAP.\n\nThanks in advance.![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nEdit:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/UXiwf)\n\n**Edited \u003Ctime datetime=\u00222015-05-18T02:07:16Z\u0022 title=\u002205/18/2015 02:07  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 18, 2015\u003C/time\u003E by MathmoRichard**"},{"CreatedByName":"smjjames","CreatedById":134004,"CreatedDateTime":"2015-05-18T01:48:32Z","Content":"It\u0027s just a display style. I think Kethane had that dotted display style, which is what it might be based on."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-05-18T01:50:53Z","Content":"I\u0027d have to see the pictures, but I think MathmoRichard means that the dotted one\u0027s brighter spots are not in the same place as the lines or splotches. If that\u0027s the case, it\u0027s a bug, I think, though I\u0027ve never seen it myself."},{"CreatedByName":"MathmoRichard","CreatedById":113752,"CreatedDateTime":"2015-05-18T01:54:13Z","Content":"Precisely 5thHorseman, it appears to give a different map (overlay).\n\nGot the images up now! ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n**Edited \u003Ctime datetime=\u00222015-05-18T02:07:52Z\u0022 title=\u002205/18/2015 02:07  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 18, 2015\u003C/time\u003E by MathmoRichard**"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-05-18T02:15:01Z","Content":"I haven\u0027t played with resources much at all yet, but your dotted map definitely looks bugged in relation to the others. Particularly the area north-east of the central lander."},{"CreatedByName":"MathmoRichard","CreatedById":113752,"CreatedDateTime":"2015-05-20T20:50:01Z","Content":"Should I send this to Squad? I sent them another bug and they didn\u0027t really acknowledge, maybe I did it the wrong way?"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-05-20T22:22:07Z","Content":"I\u0027ve noticed it in my saves too. In fact, all 3 textures have differences and similarities. They should be exactly the same (brightness-wise) so any differences is a bug, unless they mean something other than what they\u0027ve told us they mean.\n\nSubmit it. They don\u0027t tend to acknowledge bugs and just (eventually) fix them so don\u0027t worry about that, so long as you\u0027re following the guidelines."},{"CreatedByName":"impyre","CreatedById":116031,"CreatedDateTime":"2015-05-20T22:28:16Z","Content":"I\u0027ve noticed this as well. I theorize that the dots are most accurate, and are representative of \u0022point samples\u0022... whereas the \u0022cloud\u0022-like displays are interpolations of the same point samples and thus prone to interpolation problems (especially on a spherical surface). I haven\u0027t tested this yet, but I plan on it.\n\nYou\u0027ll notice if you look closely that the dots near the poles seem smaller and closer together, which fits with samples taken at regular intervals of latitude and longitude.\n\n**Edited \u003Ctime datetime=\u00222015-05-20T22:30:33Z\u0022 title=\u002205/20/2015 10:30  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 20, 2015\u003C/time\u003E by impyre**"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-20T23:04:46Z","Content":"I confirm that the dotted display is significantly different from the others, but also has significant similarities.\n\nOn thing I had noticed is that it seems to be that the divergence is greater at higher lattitudes"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-20T23:09:36Z","Content":"The data that is used to generate the dots is the same as for the other overlay styles, but because the dots are interpolated in X and Y (the lines are only in Y, the solid overlay is only interpolated at the edges) they just aren\u0027t as bright.\n\nThis is very much known to Squad and isn\u0027t a bug, it\u0027s just how they turned out."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-05-20T23:17:11Z","Content":"\u003E \n\u003E The data that is used to generate the dots is the same as for the other overlay styles, but because the dots are interpolated in X and Y (the lines are only in Y, the solid overlay is only interpolated at the edges) they just aren\u0027t as bright.\n\u003E This is very much known to Squad and isn\u0027t a bug, it\u0027s just how they turned out.\n\nThat doesn\u0027t make sense. How could you possibly interpret the same data in 2 different - yet both logical and useful - ways and have vast areas that are dark in one view yet light in the other view, and have OTHER areas that are reversed? Look at images 2 and 3 above again and concentrate on the upper right quadrant. They don\u0027t look like \u0022This one is just dimmer\u0022 they look like different maps."},{"CreatedByName":"sarbian","CreatedById":57146,"CreatedDateTime":"2015-05-20T23:33:33Z","Content":"Because the robe was blue.\n\nAnd no, this is not a troll."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-20T23:37:00Z","Content":"You are expecting accuracy from an overlay that *is intentionally inaccurate*, it\u0027s a rough indication of resource location, if you want more accuracy you need to use the other scanners ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-20T23:40:51Z","Content":"\u003E \n\u003E You are expecting accuracy from an overlay that *is intentionally inaccurate*, it\u0027s a rough indication of resource location, if you want more accuracy you need to use the other scanners ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nA rather fair point."},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-05-21T09:36:46Z","Content":"I\u0027ve found the differences to be much less after using a surface scanner module.\n\nThe question I have is: Which display is most inaccurate?\n\nBoth before and after using a surface scan module?\n\nI have a feeling that the dots are the most accurate."},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-21T13:19:49Z","Content":"\u003E \n\u003E I\u0027ve found the differences to be much less after using a surface scanner module.\n\u003E The question I have is: Which display is most inaccurate?\n\u003E \n\u003E Both before and after using a surface scan module?\n\u003E \n\u003E I have a feeling that the dots are the most accurate.\n\nThe info is the same in all cases, it just looks different depending on a person\u0027s eyesight. I myself find it easier to read the display if I change it to solid colors instead of dots or lines, and use the multiple color option instead of all 1 color. That way, instead of trying to guess which dots are slightly bigger/brighter than other dots of the same color, and where the difference lies, I can easily tell where green turns to red (red being better than green in this case).\n\nNow, as to the accuracy of the orbital scan overly, remember the following points about how the whole Ore system works:\n\n\\* Ore concentration is defined per biome. It appears to be that every patch of biome with the same name will have the same concentration regardless of where it is on the planet.\n\n\\* The config file for Ore says there is zero Ore in Kerbol and Jool in total, and zero in the oceans of Eve, Kerbin, and Laythe.\n\n\\* The Ore config also says the max concentration everywhere else on all planets is 15 with a variance of 50. I\u0027m not sure what this means but observations so far suggest than the max concentration on any given planet cannot be higher than 22.5% nor less than 7.5%, with most falling somewhere in between.\n\n\\* Only the NBS appears to tell the truth. It shows exactly how much Ore is in each biome it can see from where it currently is, and multiple NBS agree with each other exactly. The NBS shows the exact same concentration of Ore throughout the extent of each biome, and in all non-contiguous patches of the same biome name.\n\n\\* The ground scanner only gives you a text reading of the concentration of the biome it is currently located in. This is pretty accurate, closely agreeing with the value reported for that biome by the NBS. However, it\u0027s usually a fraction different, and multiple ground scanners in the same biome can report slightly different values. Which isn\u0027t surprising given the ground scanner is lower tech than the NBS. However, once you do the NBS in an certain area, it appears that the ground scanners agree with it and each other in that area thereafter.\n\n\\* The orbital scanner is wildly inaccurate both as to location and concentration, especially if the planet is like Kerbin or Minmus, where many biomes with different concentrations are all jammed closely together. That really confuses it, as explained below.\n\nSo, how to interpret the orbital scanner overlay....\n\nFirst off, don\u0027t for a minute believe the \u0022cut-off\u0022 value directly correlates to Ore concentration because you can have it only show 80% or greater when you know that really the max concentration is about 15%, maybe less. What the orbital overly is really saying is that the large general region it shows with a ridiculously higher cut-off value than the rest of the planet just has more of the high-concentration biome(s) located in it. It does NOT tell you which biomes those are, nor what their real concentrations are. IOW, it\u0027s an invitation to investigate more thoroughly with the ground sensor and/or NBS, but that\u0027s all.\n\nAlso note that just because the orbital scanner shows a higher density of good biomes in a given region doesn\u0027t mean that\u0027s the best region to mine. What you\u0027re trying to do is figure out which BIOME has the best stuff, then find a patch of that biome in a convenient location for your operations (such as on/near the equator on a large expanse of flat ground), not necessarily in that region. Because all patches of the same biome have the same concentration, it doesn\u0027t matter where on the planet that patch of biome is.\n\nFor example, in the game I use for experimenting with this stuff, Kerbin\u0027s biomes are about like this (per the NBS):\n\nShore: 7.5%\n\nMountain: 6%\n\nDesert: 5%\n\nEverything else: 2-3%\n\nOcean: 0%\n\nThe orbital scan shows nearly nothing in anywhere near KSC because that area is all grass (very low concentration) with a few isolated mountains and a thin border of shore (high concentrations). However, the highest concentration anywhere on the planet is readily available just off the end of the runway. Small islands far out at sea show the highest concentrations on the orbital scan, like 90% cut-offs, but that\u0027s just because they\u0027re mostly shore (high concentration) surrounded by ocean (zero). The most tempting spot on the orbital scan is actually the desert and especially in mountains along the north edge of the desert, which shows up as a huge area of like 70-80% cut-off. But this is because there\u0027s lots of both desert and mountain biomes there, and those have relatively high concentrations (but not the highest).\n\nSo, when interpreting the orbital scan, remember that it\u0027s showing where large areas of good biomes are, nothing else. You really need to compare the orbital scan to the biome map (in the debug menu) to really understand what it\u0027s saying. This will help you deduce which biomes are more likely to be better than others, which will tell you where to send your ground scanner and/or NBS to confirm the actual biome values. Then you just find a patch of that biome in a convenient location."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-05-21T16:40:23Z","Content":"\u003E \n\u003E Now, as to the accuracy of the orbital scan overly, remember the following points about how the whole Ore system works:\n\nThank you for this. I don\u0027t always feel mentally dense but this whole thread has made me feel so. Your explanation was perfect to clear the fog."},{"CreatedByName":"MathmoRichard","CreatedById":113752,"CreatedDateTime":"2015-05-21T16:58:39Z","Content":"After a day\u0027s experiementing I have decided that the dots are actually most reliable.\n\nHowever assuming this I refute any suggestion that the others are deliberately inaccurate and should be as they are. Why should the other two have black where the dotted one is red or vice versa? A colour change averaging out other stuff is fine but not the polar opposite. If it is somehow Mathematically true and it was intentional then the other two need to be made at least a bit more accurate.\n\n\u003E \n\u003E \\* Ore concentration is defined per biome. It appears to be that every patch of biome with the same name will have the same concentration regardless of where it is on the planet.\n\nThanks for your fantastic reply. I don\u0027t understand this ^ though, on Minmus the concentrations seem to vary quite continuously except on the flats.\n\nI\u0027m getting the impression that these values are randomly generated rather than the same for everyone. Although if they change between game sessions I\u0027ll go mad because I\u0027ve been noting down precise co-ordinates of the best concentrations on Minmus all day."},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-05-21T17:01:29Z","Content":"The dots look total pants at the poles though."},{"CreatedByName":"MathmoRichard","CreatedById":113752,"CreatedDateTime":"2015-05-21T17:18:35Z","Content":"\u003E \n\u003E The dots look total pants at the poles though.\n\nI have found the polar dots to be most accurate (after narrow band)."},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-05-21T17:22:40Z","Content":"\u003E \n\u003E Thanks for your fantastic reply. I don\u0027t understand this ^ though, on Minmus the concentrations seem to vary quite continuously except on the flats.\n\n[Check out this thread on Minmus biomes.](https://forum.kerbalspaceprogram.com/threads/62699-Minmus-s-Biome-%28Spoiler%29) And in reality, these maps are at too low a resolution to really show the complexity.\n\nOn Minmus, each flat is a separate biome from any of the surrounding area. Because the concentration per biome is constant, flats have the same concentration all over their surfaces. The hillsides immediately surrounding the flats, however, are a horrible tangle of multiple biomes almost like the pattern of Damascus steel. You have small patches of highlands, midlands, and lowlands all separated by narrow strips of slope, so that\u0027s 4 separate biomes, each with its own Ore concentration. It\u0027s only once you get well away from the flats that you find large, contiguous areas of non-flat biomes.\n\n\u003E \n\u003E I\u0027m getting the impression that these values are randomly generated rather than the same for everyone. Although if they change between game sessions I\u0027ll go mad because I\u0027ve been noting down precise co-ordinates of the best concentrations on Minmus all day.\n\nThe values of ore per biome are random in each saved game, yes. No sense writing anything down for future reference because it\u0027ll be different when you start a new game. But within the same game, they don\u0027t change."},{"CreatedByName":"MathmoRichard","CreatedById":113752,"CreatedDateTime":"2015-05-21T23:24:34Z","Content":"Thanks again for your reply. I maintain that the values are varying continuously without any biome change showing on the narrow band.\n\nAlso, below is proof that the biomes are totally messed up:\n\nWhat you can\u0027t see is that my pointer is hovering over that green bit of the scanner. This is the north pole!!!!\n\n![yNBUNo2.jpg](http://i.imgur.com/yNBUNo2.jpg)\n\n**Edited \u003Ctime datetime=\u00222015-05-21T23:57:55Z\u0022 title=\u002205/21/2015 11:57  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 21, 2015\u003C/time\u003E by MathmoRichard**"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-05-21T23:41:54Z","Content":"I\u0027m not sure, since I have not tried this myself yet. Putting together what I\u0027ve read, I think you might have to use the surface scanner to unlock the higher resolution data, possibly even for each biome separately?"},{"CreatedByName":"MathmoRichard","CreatedById":113752,"CreatedDateTime":"2015-05-21T23:48:03Z","Content":"I seem to get a constant 0.558% anywhere on the Slopes, 7.238% for Flats, 4.199% for Greater Flats, 6.689% for Highlands, and 1.189% for Great Flats, but most other areas change dramatically and I\u0027m still puzzled by how this officially works.\n\n**Edited \u003Ctime datetime=\u00222015-05-22T00:17:50Z\u0022 title=\u002205/22/2015 12:17  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 22, 2015\u003C/time\u003E by MathmoRichard**"},{"CreatedByName":"Harry Rhodan","CreatedById":119953,"CreatedDateTime":"2015-05-21T23:52:17Z","Content":"\u003E \n\u003E why isn\u0027t my [imgur ]yNBUNo2[/ imgur] working? ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif)\n\nBecause that\u0027s a single picture and not an album. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif)\n\nUse [noparse]![%7Boption%7D](%7Boption%7D)[/noparse] instead."}]}