{"TopicId":110344,"ForumId":16,"TopicTitle":"How can i get from low Kerbin orbit into a highly elliptical orbit to place a satellite?","CreatedByName":"DCWarHound","CreatedById":135609,"CreatedDateTime":"2015-05-22T06:19:20Z","PageNum":1,"Articles":[{"CreatedByName":"DCWarHound","CreatedById":135609,"CreatedDateTime":"2015-05-22T06:19:20Z","Content":"First satellite mission where i have to get into an orbit that is very far away from the launch pad,i have tried it with heavier and heavier payloads but it just burns too much fuel and i can never get into the correct orbit.\n\nI\u0027ll post my Science tree,craft and the exact orbit later today.BTW for some reason i can\u0027t add the mission orbit as a target or activate navigation on it.\n\nEdit:Thx for the help everyone\n\n![KSP2_zpsbnxjlahm.jpg?t=1432289567](http://i1228.photobucket.com/albums/ee457/DCBloodHound/KSP2_zpsbnxjlahm.jpg?t=1432289567)\n\n**Edited \u003Ctime datetime=\u00222015-05-23T10:14:08Z\u0022 title=\u002205/23/2015 10:14  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 23, 2015\u003C/time\u003E by DCWarHound**\n  \nDid it :D"},{"CreatedByName":"kahlzun","CreatedById":39989,"CreatedDateTime":"2015-05-22T06:49:06Z","Content":"Essentially, try to burn from launch into the plane of the orbit.\n\nFailing that, burn to the eccentric orbit and then turn the orbit at apoapsis.\n\nIf you could share the specifics of the current orbit vs the planned one, that would help.\n\nRemember when building satellites, less gives more dV. A small engine can take you a LONG way if the craft is mostly fuel, and you don\u0027t need a powerful engine unless you are planning to land on somewhere."},{"CreatedByName":"stibbons","CreatedById":57865,"CreatedDateTime":"2015-05-22T07:29:28Z","Content":"Yeah, the easiest way is to wait on the launch pad until the orbit you need is approximately overhead, and then try to perform your gravity turn in the direction of the target orbit. You\u0027ll still need to do some correction, but hopefully only a few degrees."},{"CreatedByName":"Cebi","CreatedById":138242,"CreatedDateTime":"2015-05-22T10:02:47Z","Content":"OP mentioned eliptical orbit not inclined eliptical. First satelite missions rarely gives you inclined orbits. Also you cant click on desired orbit. It is there only for reference. You cant click on orbits of planets either.\n\nWe realy need those pictures to be able to help.\n\n**Edited \u003Ctime datetime=\u00222015-05-22T10:12:26Z\u0022 title=\u002205/22/2015 10:12  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 22, 2015\u003C/time\u003E by Cebi**"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-05-22T11:23:19Z","Content":"\u003E \n\u003E Also you cant click on desired orbit. It is there only for reference.\n\nYeah, that always struck me as kind of a UI hole; seems like the game should provide some way to target the orbit in that case.\n\n\u003E \n\u003E You cant click on orbits of planets either.\n\nTrue, but at least you can target a planet itself, which gives you all the useful visual references. In the case of contracts for putting a craft in a specific orbit, there\u0027s much less help.\n\n\u003E \n\u003E We realy need those pictures to be able to help.\n\nOr even better than pictures would be the numbers-- specifically, the periapsis, apoapsis, and inclination. These are listed in the contract description in Mission Control."},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2015-05-22T11:32:12Z","Content":"First make. Sure you have enough dv.\n\nThen you split up burns and burn at periapsis to take advantage of the oberth effect. \n\nOnce your apoapsis is at the desired height, change your inclination to what you desire while at apoapsis\n\nThen you raise your periapsis at apoapsis to the desired altitude. Bonus points for combining the last two steps in one burn"},{"CreatedByName":"One Wheeled Panda","CreatedById":108769,"CreatedDateTime":"2015-05-22T11:46:29Z","Content":"\u003E \n\u003E Yeah, the easiest way is to wait on the launch pad until the orbit you need is approximately overhead, and then try to perform your gravity turn in the direction of the target orbit. You\u0027ll still need to do some correction, but hopefully only a few degrees.\n\nIt\u0027s even easier when you rotate your craft in the VAB to turn in the correct direction when performing your usual launch profile."},{"CreatedByName":"aleis","CreatedById":62823,"CreatedDateTime":"2015-05-22T11:51:04Z","Content":"I think we as forum help are missing the point, he is have trouble figuring out how to get an orbit in Kerbin SOI and we are tossing out terms and such with out explaining what they mean. \n\nLet\u0027s back or up a little and start from the beginning. ......and I have to go to work now"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-05-22T13:58:41Z","Content":"[https://youtu.be/H2EvNQ7D9_U?t=1m50s](https://youtu.be/H2EvNQ7D9_U?t=1m50s)\n\nThat might help."},{"CreatedByName":"DCWarHound","CreatedById":135609,"CreatedDateTime":"2015-05-22T15:49:59Z","Content":"Here it is a screenshot of the orbit and my science tree,i\u0027ll post the objective since it became blurry.\n\n![KSP_zpsymltpxge.jpg?t=1432222881](http://i1228.photobucket.com/albums/ee457/DCBloodHound/KSP_zpsymltpxge.jpg?t=1432222881)\n\nApoapsis :5,663,786 meters\n\nPeriapsis :73,502 meters\n\nInclination :63.4 degrees\n\nLongitude of ascending node :191.1 degrees\n\nArgument of Periapsis :270 degrees \n\nLaunch an unmanned probe that has an antenna:\n\nReach the designated orbit around Kerbin with minimum deviation:\n\nHave a Mystery goo unit on the satellite:\n\nHave a material bay on the satellite:\n\nMaintain stability for ten seconds:"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2015-05-22T16:41:37Z","Content":"1) You\u0027ll need to launch when the target orbit is directly overhead. This happens two times per day. One time the northbound section of the orbit will pass overhead and the other time the southbound section will pass overhead.\n\n2) You need to launch to the correct inclination. If you launch when the northbound segment passes overhead (at its *ascending node*), you need to launch to a heading of 90Ã‚Â°-desired\\_inclination plus a couple of degrees to account for Kerbin\u0027s eastward rotation. In this case that equates to a heading of about 30Ã‚Â°. This means you should lean your rocket toward the 30Ã‚Â° mark on the horizon-line on the Navball as you ascend (not the 30Ã‚Â° mark that indicates pitch.) If you launch when the southbound segment passes overhead (at its *descending node*), you need to launch to a heading of 90Ã‚Â°\u002Bdesired\\_inclination minus a couple of degrees. (You always make the correction for Kerbin\u0027s rotation toward 90Ã‚Â°.) In your case, you\u0027d launch to a heading of about 150Ã‚Â°. \n\n2a) When you get skilled enough, you can switch to the map screen during the final minute or so of your ascent and nudge your rocket right or left to adjust your heading to make your suborbital arc parallel to the desired orbit, which should put you very close to the correct inclination.\n\n3) Raise your apoapsis to the periapsis of the desired orbit (73.5km) and circularize there. Your orbit should be parallel to the desired orbit, nestled inside it, touching just at the desired orbit\u0027s periapsis.\n\n3a) If you need to correct your inclination, you should do it now by burning either normal or anti-normal (the pink triangles on your Navball) at one of the two points where your orbit crosses the desired orbit. (The crossing points are the ascending and descending nodes.) Use a maneuver node to figure out which way to burn and how much. (For reference, you always burn anti-normal at the ascending node - AN at the AN.)\n\n4) Coast to the desired orbit\u0027s periapsis and burn prograde to raise your orbit\u0027s apoapsis to match the desired orbit\u0027s apoapsis.\n\nNote: Step 1 ensures you have the correct longitude of the ascending node (LAN), Step 2 ensures you have the correct inclination, Step 3 matches periapsis and Step 4 matches apoapsis and argument of periapsis.\n\n**Edited \u003Ctime datetime=\u00222015-05-22T16:54:34Z\u0022 title=\u002205/22/2015 04:54  PM\u0022 data-short=\u00229 yr\u0022\u003EMay 22, 2015\u003C/time\u003E by Mr Shifty**"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-05-22T16:56:20Z","Content":"\u003E \n\u003E Here it is a screenshot of the orbit and my science tree,i\u0027ll post the objective since it became blurry.\n\u003E [http://i1228.photobucket.com/albums/ee457/DCBloodHound/KSP_zpsymltpxge.jpg?t=1432222881](http://i1228.photobucket.com/albums/ee457/DCBloodHound/KSP_zpsymltpxge.jpg?t=1432222881)\n\u003E \n\u003E Apoapsis :5,663,786 meters\n\u003E \n\u003E Periapsis :73,502 meters\n\u003E \n\u003E Inclination :63.4 degrees\n\u003E \n\u003E Longitude of ascending node :191.1 degrees\n\u003E \n\u003E Argument of Periapsis :270 degrees \n\u003E \n\u003E Launch an unmanned probe that has an antenna:\n\u003E \n\u003E Reach the designated orbit around Kerbin with minimum deviation:\n\u003E \n\u003E Have a Mystery goo unit on the satellite:\n\u003E \n\u003E Have a material bay on the satellite:\n\u003E \n\u003E Maintain stability for ten seconds:\n\nDC WarHound,\n\n You\u0027ll have to launch into the plane of the target orbit as described above. If you try to launch east and then correct it afterwards, you\u0027re looking at 2300 m/sec DV to fix it. And of course... make sure you\u0027re going the right way. People often make the mistake of trying to orbit backwards.\n\n After you\u0027re lined up under the target Pe, burn prograde until you\u0027ve matched the target Ap. once at Ap, burn prograde to match Pe.\n\nBest,\n\n-Slashy"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2015-05-23T00:19:28Z","Content":"To pile onto the previous explanations:\n\nYou can get anywhere from anywhere given enough fuel. Efficiency is good to keep the fuel requirement manageable but oopsies and tweaks are fine. Some adjustments are cheap to make and others are expensive.\n\nSince KSC moves around the equator in time there are two times per rotation when KSC (and thus the rocket on the launch pad) passes through the plane of the target orbit. You don\u0027t have to launch at one of these two moments but it absolutely helps. If you can be in-plane from launch to final destination the whole time, life is easier and it takes less fuel overall. You can eyeball the situation by focusing on Kerbin and shifting the camera such that the target orbit collapses to a line. You\u0027re looking at the edge of the target orbit. Then you can warp ahead in time until KSC rotates under that line, either side is fine.\n\nSo these are the two launch times that are desired. The space craft leaves the pad co-planar to the target orbit. If the target orbit is inclined 60 degrees you want to launch on about a heading of 30 or 210. The idea is that launching east (90) is 0 degrees inclination increasing to the north (0) for 90 inclination. Going west (270) is 180 inclination and so on. In any case it should be clear to see that 60 degree inclination is a mixture of 2/3rd northward and 1/3rd eastward orbit. The whole confusion about heading and inclination is because the history of compasses is 000 is north increasing clockwise while in math/astronomy east is 000 and increases counterclockwise. Those jokers.\n\nThe caveat to the above is there are two sides to every orbit and if you\u0027re using the #2 launch location you\u0027d have to go heading 210 off to pad to keep in plane. It\u0027s pretty easy to tell them apart look at the dots\u0027 motion just above the launch site.\n\nIf you manage to get into a coplanar (\u002B-5 degrees) roughly circular 70x70km ideal around Kerbin you\u0027re 95% of the way there. Then the task is simply to burn prograde when you\u0027re on the opposite side of the \u0022Ap\u0022 of the target orbit. Prograde burning will inflate the opposite side of your orbit. Inflate your \u0022Ap\u0022 out to the target\u0027s \u0022Ap\u0022 and once out there inflate (or deflate) your \u0022Pe\u0022 to match the target orbit\u0027s.\n\nIf your circular orbit after launch isn\u0027t such a nice circle there are more adjustments. The only ideal would to have your \u0022Pe\u0022 post launch be exactly opposite of the target\u0027s \u0022Ap.\u0022 If it isn\u0027t some burning toward or away from Kerbin during your \u0022Ap inflation\u0022 will shift the resulting position of the \u0022Ap.\u0022 Any extra orbit size on the same side as that high target \u0022Ap\u0022 is absolutely fine because you\u0027re going to do that anyway. Extra orbit size on the \u0022Pe\u0022 side is a fuel inefficiency.\n\nCorrections to match orbits should always be done at where your orbit crosses the plane of the other orbit. Until you\u0027re on the same sheet of paper as the target orbit, you have a 3D problem. Once you get on his plane then it\u0027s a 2D problem solvable with only radial and pro/retro-grade. Once you get your Ap-Pe lines to match up it\u0027s a 1D problem solvable with only pro/retro-grade."},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2015-05-23T02:20:54Z","Content":"\u003E \n\u003E So these are the two launch times that are desired. The space craft leaves the pad co-planar to the target orbit. If the target orbit is inclined 60 degrees you want to launch on about a heading of 30 or 210.\n\nGreat explanation! Just a quick correction here, though. I\u0027m pretty sure I\u0027m correct and that you want to launch to 150Ã‚Â°, not 210Ã‚Â° in order to catch the orbit at the descending node. One way to see this is to imagine that KSC is stationary and that the desired orbit is rotating around Kerbin\u0027s center. Another is to recognize that no prograde orbit is going to require a retrograde launch to catch."},{"CreatedByName":"DCWarHound","CreatedById":135609,"CreatedDateTime":"2015-05-23T10:13:21Z","Content":"Thanks for the help guys,i did it.\n\n![KSP2_zpsbnxjlahm.jpg?t=1432289567](http://i1228.photobucket.com/albums/ee457/DCBloodHound/KSP2_zpsbnxjlahm.jpg?t=1432289567)\n\nIt was easier then i thought."},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2015-05-24T01:29:12Z","Content":"\u003E \n\u003E Great explanation! Just a quick correction here, though. I\u0027m pretty sure I\u0027m correct and that you want to launch to 150Ã‚Â°, not 210Ã‚Â° in order to catch the orbit at the descending node. One way to see this is to imagine that KSC is stationary and that the desired orbit is rotating around Kerbin\u0027s center. Another is to recognize that no prograde orbit is going to require a retrograde launch to catch.\n\nGood catch. I wasn\u0027t doing all the transforms in my head properly. 60 deg inclination is going up-right ascending (north east) and down-left descending. But when you rotate half way around Kerbin down-left becomes down-right so again south east."}]}