{"TopicId":110538,"ForumId":16,"TopicTitle":"How do I make a Kerbin rover?","CreatedByName":"Lekar","CreatedById":144750,"CreatedDateTime":"2015-05-23T20:24:47Z","PageNum":1,"Articles":[{"CreatedByName":"Lekar","CreatedById":144750,"CreatedDateTime":"2015-05-23T20:24:47Z","Content":"I\u0027m a bit of a noob to KSP, and this might seem really stupid, but I very much prefer ground travel over air travel since I have no idea at all on how to refuel or set up refueling stations. How can I make a rover for Kerbin? Whenever I try to the wheels clip into the ground and the vehicle doesn\u0027t move. I can sorta make it turn and thrash about by pressing A and D. \n\nWhat am I doing wrong?\n\nEDIT: Just realized the title says Kerban, smh.\n\n**Edited \u003Ctime datetime=\u00222015-05-24T04:46:54Z\u0022 title=\u002205/24/2015 04:46  AM\u0022 data-short=\u00229 yr\u0022\u003EMay 24, 2015\u003C/time\u003E by Lekar**"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-05-23T21:20:39Z","Content":"\u003E \n\u003E What am I doing wrong?\n\nIf you could post a picture, that would help us give you specific advice. Although I would say a very common starter problem is that often people use the ruggedized wheels, and those wheels are not (by default) oriented correctly in the SPH. If you look at the axle of the wheel, there is a wider side and a narrower side. The narrower side needs to point at the ground or the wheel will not work properly.\n\nYou can take pictures by pressing F1. That will dump a screenshot into the Screenshots directory, which you can upload to somewhere like [http://www.imgur.com/](http://www.imgur.com/) and link here by using [noparse]![Pic URL](Pic%20URL)[/noparse] tags.\n\n\u003E \n\u003E EDIT: Just realized the title says Kerban, smh.\n\nFixed it for you. You can change the title by editing the original post and clicking \u0022Go Advanced.\u0022\n\nWelcome to the forum! ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nCheers,\n\n~Claw"},{"CreatedByName":"Lekar","CreatedById":144750,"CreatedDateTime":"2015-05-23T21:42:54Z","Content":"Hey! Thanks for the reply, I kinda rushed this out and put it on the launching station.\n\n[http://i.imgur.com/51rJDLR.png](http://i.imgur.com/51rJDLR.png)\n\nI don\u0027t really see an issue here, maybe you do?"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-05-24T00:47:10Z","Content":"Yeah, it is hard to tell from that picture, but it looks like you have your wheels on incorrectly. You\u0027ll have to rotate them so the narrow part points downward. Since you\u0027re building in the VAB, you\u0027ll have to switch to mirror symmetry using \u0027R\u0027 when placing them, and make sure they are rotated.\n\nI\u0027ve attached some pictures to show what I mean. I replicated your rover. The first pic matches yours, and the second shows the wheels rotated incorrectly (the way it defaults in the editor). The third shows the correct orientation, and the fourth shows the result.\n\nCheers,\n\n~Claw\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/qCVM7)"},{"CreatedByName":"Lekar","CreatedById":144750,"CreatedDateTime":"2015-05-24T02:23:39Z","Content":"What a simple mistake! This had me racking my brain for so long, thank you so much, it finally works!\n\nIn honour of you, I\u0027ve named it the Claw Ground Vehicle MK. I."},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-05-24T05:06:38Z","Content":"Haha, awesome! I\u0027m glad it\u0027s all sorted out. And I feel honored. ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nCheers,\n\n~Claw"}]}