{"TopicId":111066,"ForumId":16,"TopicTitle":"Noob question on radial decouplers","CreatedByName":"dakkadakka","CreatedById":145100,"CreatedDateTime":"2015-05-27T22:49:14Z","PageNum":1,"Articles":[{"CreatedByName":"dakkadakka","CreatedById":145100,"CreatedDateTime":"2015-05-27T22:49:14Z","Content":"I have been trying to use the radial decouplers on my ship; however, I cannot get them to work. Every time I activate them in staging, the spent tanks won\u0027t separate from the main ship. I have moved them around to various places on the ship, with the same effect.\n\nWhat\u0027s the secret to installing these things correctly?"},{"CreatedByName":"match","CreatedById":91708,"CreatedDateTime":"2015-05-27T23:16:49Z","Content":"Just a guess, but are you attaching the tanks to the decoupler or to the main body? It\u0027s easy to miss the decoupler when placing the larger tank. To see if you have actually attached it to the decoupler, pick up the decoupler- the tank should come with it.\n\n... Next up, making straight attachments!\n\nTip- if you zoom in while placing the tank, it may be easier to see what you are doing."},{"CreatedByName":"quietghost","CreatedById":117566,"CreatedDateTime":"2015-05-27T23:22:42Z","Content":"With experience, I generally find that when placing a tank, the tank \u0022hiccups\u0022 when you mouse over the decoupler, because the decoupler is slightly closer to the camera than the tank, and so the placement jumps slightly. What match said is correct, it can be easy to miss the decoupler with large tanks, especially with the see-through on placement bug in the editor."},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-05-27T23:40:00Z","Content":"Another potential issue:\n\nUsing tweaks can clip part of the release mechanism or the stack may clip on a protrusion like RCS blocks. Such clipping can stubbornly resist separation.\n\nPictures of both stacks and/or stack cross-section (focused on separator) will aid troubleshooting."},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-05-28T01:22:36Z","Content":"A simple test:\n\nAttach a capsule to a launch clamp, then place a radial decoupler on the capsule. Arrange staging so the decoupler fires before the clamp. If the decoupler does not fire, you\u0027ve got yourself a bug. If it does, attempt to place a fuel tank and repeat. Follow the advice of those above, it *is* quite easy to miss the decoupler."},{"CreatedByName":"dakkadakka","CreatedById":145100,"CreatedDateTime":"2015-05-28T02:17:04Z","Content":"\u003E \n\u003E A simple test:\n\u003E Attach a capsule to a launch clamp, then place a radial decoupler on the capsule. Arrange staging so the decoupler fires before the clamp. If the decoupler does not fire, you\u0027ve got yourself a bug. If it does, attempt to place a fuel tank and repeat. Follow the advice of those above, it *is* quite easy to miss the decoupler.\n\nThats a great idea - it will save time if I can test the decouplers on the launch pad. As far as I know, I\u0027m attaching the tanks to the decouplers; however, it can be difficult to know exactly where the tanks are in relation to the decouplers.\n\nThanks to everyone for all the great advice. This is my first post on the forums, and it\u0027s great that there are so many folks out there who are willing to help us rookie space cadets!"}]}