{"TopicId":111906,"ForumId":16,"TopicTitle":"Dres Mission DeltaV?","CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-06-03T23:09:52Z","PageNum":1,"Articles":[{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-06-03T23:09:52Z","Content":"How much DeltaV would I need on a Dres transfer, circularize, and return stage? The lander decouples, gathers SCIENCE, and returns afterwards. I completely botched when I only brought ~3000---I forgot the enormous circularization requirements. Also, anyone have a link to a 1.0 DeltaV map?"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2015-06-04T00:37:58Z","Content":"\u003E \n\u003E How much DeltaV would I need on a Dres transfer, circularize, and return stage? The lander decouples, gathers SCIENCE, and returns afterwards. I completely botched when I only brought ~3000---I forgot the enormous circularization requirements. Also, anyone have a link to a 1.0 DeltaV map?\n\nThe only thing that\u0027s changed in 1.x is getting from ground to orbit on atmospheric worlds.\n\nMy favorite dV maps are those off Metaphor. [Here are his latest versions.](https://forum.kerbalspaceprogram.com/threads/120030-1-0-Delta-V-Maps-and-Atmospheric-Charts?p=1960225\u0026viewfull=1#post1960225)"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-04T02:52:29Z","Content":"IIUC, for you particular case you only want to know the dV for Kerbin-\u003EDres and Dres-\u003EKerbin. For that you could just compute 2 mid-course plane change transfers in [http://alexmoon.github.io/ksp/](http://alexmoon.github.io/ksp/). Leaving at the earliest possible window and arriving back at Kerbin in year 6 I get 4800 dv, which is 5300 dV with a 10% margin added.\n\nGenerally, I would also recommend learning a deltaV map for planning purposes. However you should realize the numbers deltaV maps are often fairly tight estimates and that things like the inclination changes amounts (green parenthesis is metaphors map above) are often important. For example, the dV map gives a minimum of 1290 x 2 \u002B 1560 = 4140 dV. However, the actual capture is 230 more dV and the inclination plane change is another 520 dV. Inclination plane changes will often run about a third to half of the amount listed, and here the inclination change takes 52% of the listed 1010. From the deltaV map I would have used something like 4140 \u002B 505 (half inclination) = 4645 with a larger 20% margin to give 5600 dV.\n\nCheers,\n\nCyberSoul"},{"CreatedByName":"waterlubber","CreatedById":119333,"CreatedDateTime":"2015-06-04T22:25:07Z","Content":"I put the IP transfer\u0027s worth of DeltaV, I knew that Dres is far smaller than Duna, my usual target, so I was extremely surprised by the enormous requirements to slow down."},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-05T04:41:29Z","Content":"Haha, wait for Moho, it\u0027s the planetary transfer version of a final exam -- especially that injection burn if your Hohmann transfer wasn\u0027t basically perfect."}]}