{"TopicId":112181,"ForumId":16,"TopicTitle":"Asparagus staging causing rocket to be *less* efficient help meh!","CreatedByName":"Laughing Man","CreatedById":67907,"CreatedDateTime":"2015-06-06T15:56:38Z","PageNum":1,"Articles":[{"CreatedByName":"Laughing Man","CreatedById":67907,"CreatedDateTime":"2015-06-06T15:56:38Z","Content":"Okay so this one has really got me buggered. I\u0027ve got a design that\u0027s intended for Direct Ascent landing on Minmus (I cba doing a lander/CM combo). It gets into orbit just fine but doesn\u0027t quite have the delta-v needed to allow the lander to make it back. I figured that instead of 2 oversized boosters I\u0027d asparagus the lot. Same number of engines, same mass, same fuel. The design **without** asparagus is more efficient, even using the same ascent profile. ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)\n\nWhen flying the non-asparagus version, the second stage (Skipper) has almost enough fuel for orbital insertion by itself with another 200 delta-v needed from the minmus insertion stage (Poodle). Naturally I wanted the Skipper to be able to do orbital insertion \u002B match Minmus\u0027 inclination before ditching so I could use the Poodle to perform Minmus insertion \u002B braking, hence why I converted to asparagus staging to give the first stage a little more oomph. The asparagus staging causes the whole thing to be less efficent however. With the asparagus version of this rocket, the Poodle runs out of fuel at 1600-1700 delta-v as oppossed to 2000-2100. ...?!\n\nI\u0027m figuring maybe the 8 asparagus boosters have more drag than the 2 oversized boosters or the thrust loss as each asparagus is being ditched is too great. Idk. Really need a pro to fly these two rockets for me and let me know what\u0027s going on. I will name my next cat/dog after whoever can help!\n\nCraft files:-\n\n[http://pastebin.com/13FT8xRT](http://pastebin.com/13FT8xRT) - Zenith 03 rocket (no asparagus)\n\n[http://pastebin.com/6S48dcxQ](http://pastebin.com/6S48dcxQ) - Zenith 03 Block 2 (asparagus)\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/DrIp1)\n\nEDIT - just realised this is the wrong section, sorry mods\n\n**Edited \u003Ctime datetime=\u00222015-06-06T16:55:11Z\u0022 title=\u002206/06/2015 04:55  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 6, 2015\u003C/time\u003E by Laughing Man**\n  \nwrong section"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-06-06T16:09:55Z","Content":"\u003E \n\u003E Okay so this one has really got me buggered. I\u0027ve got a design that\u0027s intended for Direct Ascent landing on Minmus (I cba doing a lander/CM combo). It gets into orbit just fine but doesn\u0027t quite have the delta-v needed to allow the lander to make it back. I figured that instead of 2 oversized boosters I\u0027d asparagus the lot. Same number of engines, same mass, same fuel. The design **without** asparagus is more efficient, even using the same ascent profile. ![:confused:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif)\n\u003E When flying the non-asparagus version, the second stage (Skipper) has almost enough fuel for orbital insertion by itself with another 200 delta-v needed from the minmus insertion stage (Poodle). Naturally I wanted the Skipper to be able to do orbital insertion \u002B match Minmus\u0027 inclination before ditching so I could use the Poodle to perform Minmus insertion \u002B braking, hence why I converted to asparagus staging to give the first stage a little more oomph. The asparagus staging causes the whole thing to be less efficent however. With the asparagus version of this rocket, the Poodle runs out of fuel at 1600-1700 delta-v as oppossed to 2000-2100. ...?!\n\u003E \n\u003E I\u0027m figuring maybe the 8 asparagus boosters have more drag than the 2 oversized boosters or the thrust loss as each asparagus is being ditched is too great. Idk. Really need a pro to fly these two rockets for me and let me know what\u0027s going on. I will name my next cat/dog after whoever can help!\n\nThe problem now is that the most efficient engines have terrible low altitude ISP. You using LV-30 which has reasonable take off ISP. But you would be better off with a SFRB like a \u002210\u0022 at the bottom to get you up before engaging those LV-30s. The problem is low ISP mean low thrust now, not just low efficiency and your time spent lumbering around over the launch pad is wasted delta-V. In your rocket design you should use disposable rockets to get you to 100 m/s as quickly as possible (2g if possible). LV-909 now cannot even get you off the launch pad with a pod and a small tank. \n\nLook at your thrust as your rocket is going up and your g-forces.\n\nOver powering a rocket is also bad particularly now since drag is based on profile. Speeds over 100 at sea level and 160 at 5000 meters is the optimal lift with a CoD of 0.2, if you streamline your tanks you can lower the CoD and raise the velocity making the launch more efficient. For example your T800 can be replaced with an aerodesign that also has fuel in the fusiform section. \n\nThese, admittedly are guesses. I will take a look at several designs to see which is that case. Theoretically asparagas is bad design for launch vehicle because of the transverse segmental flexibility and drag interactions. Of course you could use jets to lift the vessel to 20k m and launch from that altitude. That would be very efficient."},{"CreatedByName":"mrklaw","CreatedById":143639,"CreatedDateTime":"2015-06-06T16:16:21Z","Content":"My guess would be that your two 2.5m boosters would have way more fuel than the 8 1.25m boosters, so the main enter engine ca go higher before it needs to rely solely on its own tank, therefore lasts longer.\n\nedit: hmm - same amount of fuel? 4xX32 tanks or 16xT800. I assume the engines are the same on both boosters? \n\nIn in that case my guess would be the asparagus stages would lose you thrust more quickly because you\u0027d drop those first few tanks really fast so would be down to 4/6 T30 very quickly, whereas the larger boosters you have more thrust early on for longer?\n\n**Edited \u003Ctime datetime=\u00222015-06-06T16:21:32Z\u0022 title=\u002206/06/2015 04:21  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 6, 2015\u003C/time\u003E by mrklaw**"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-06T16:17:53Z","Content":"I think the asparagus versus not labels are backwards on the downloads. Given your staging, the 03B2 with the 2 side boosters won\u0027t even take off in 1.0.2. Looking at the KER displays it only has 0.79 TWR at sea level on Kerbin. Are you hacking gravity to launch these?\n\nEDIT: On the asparagus version, which does launch with your staging, you don\u0027t have enough control authority. So you are not going anywhere near where you (or MechJeb?) tells it to go.\n\n**Edited \u003Ctime datetime=\u00222015-06-06T16:32:41Z\u0022 title=\u002206/06/2015 04:32  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 6, 2015\u003C/time\u003E by cybersol**"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-06-06T16:24:51Z","Content":"If you run the numbers, the asparagus design should have more dV in either atmospheric conditions or vacuum. But that doesn\u0027t tell the whole story. \n\nDrag should be close to a wash, 8 1.25m boosters have exactly the same frontal area as 2 2.5m boosters (not sure about the relative drag of the different nosecones, though). Edit: If fuel lines are as draggy as struts that might be significant, the asparagus design has more of them.\n\nWhat I think is happening is that the higher peak TWR of the large booster version is getting it out of the thick atmosphere faster, so the engines get more efficient with the falling air pressure more quickly."},{"CreatedByName":"Laughing Man","CreatedById":67907,"CreatedDateTime":"2015-06-06T16:41:57Z","Content":"\u003E \n\u003E I think the asparagus versus not labels are backwards on the downloads. Given your staging, the 03B2 with the 2 side boosters won\u0027t even take off in 1.0.2. Looking at the KER displays it only has 0.79 TWR at sea level on Kerbin. Are you hacking gravity to launch these?\n\u003E EDIT: On the asparagus version, which does launch with your staging, you don\u0027t have enough control authority. So you are not going anywhere near where you (or MechJeb?) tells it to go.\n\nFixed the links there, thanks for point that out! The rockest take off fine and I run stock-only, no mods, no scripts, no editing of anything. Control authority is fine, it flies smoothly so long as it is pitched to 45 by around 12-15km.\n\n\u003E \n\u003E If you run the numbers, the asparagus design should have more dV in either atmospheric conditions or vacuum. But that doesn\u0027t tell the whole story. \n\u003E Drag should be close to a wash, 8 1.25m boosters have exactly the same frontal area as 2 2.5m boosters (not sure about the relative drag of the different nosecones, though). Edit: If fuel lines are as draggy as struts that might be significant, the asparagus design has more of them.\n\u003E \n\u003E What I think is happening is that the higher peak TWR of the large booster version is getting it out of the thick atmosphere faster, so the engines get more efficient with the falling air pressure more quickly.\n\n@Red - that was my thought as well. I\u0027ll probably convert this to use SRBs instead, but my mainsail will run out of fuel much quicker if I don\u0027t add droptanks. ![:(](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif) I don\u0027t want this thing to get any taller than it has to. Thanks for the replies!"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-06T16:48:41Z","Content":"How does the 2 side booster one take off with 0.79 TWR. Did you fix the staging and change the links?"},{"CreatedByName":"Laughing Man","CreatedById":67907,"CreatedDateTime":"2015-06-06T16:53:30Z","Content":"Apologies, the mainsail is part of the first stage, I\u0027ll update the craft file."},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-06T17:01:04Z","Content":"\u003E \n\u003E If you run the numbers, the asparagus design should have more dV in either atmospheric conditions or vacuum. But that doesn\u0027t tell the whole story. \n\u003E Drag should be close to a wash, 8 1.25m boosters have exactly the same frontal area as 2 2.5m boosters (not sure about the relative drag of the different nosecones, though). Edit: If fuel lines are as draggy as struts that might be significant, the asparagus design has more of them.\n\u003E \n\u003E What I think is happening is that the higher peak TWR of the large booster version is getting it out of the thick atmosphere faster, so the engines get more efficient with the falling air pressure more quickly.\n\nThis.\n\nEssentially on the asparagus the core is too big/boosters too small.\n\nRemoving one X200-32 tank from the core and adding an FLT-400 to each booster saw some improvement."},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-06T17:53:33Z","Content":"Thanks for the updated staging, it launches now. So you definitely have a heavy arrowhead on that rocket. I actually downloaded and launched both on identical MJ ascent profiles with only corrective steering (needed for your heavy nose), autostage, and autowarp set. Profile was 1km start at 50 m/s to 42km end with a final angle of 6\\* and a turn shape of 55%.\n\nFor the 2 side booster version it took 3651 m/s to get to 75x75 orbit with 1755 dv remaining in the Poodle stage.\n\nI added more control authority to get the asparagus version to fly more true to its MJ ascent profile by moving the wings to the bottom of the central core and changing the mainsail gimbal back to 100%. It then took 3749 dV to get to 75x75 orbit with 1720 dV remaining in the Poodle stage.\n\nSo under as indentical conditions as possible, the asparagus staging does slightly worse, likely for the reasons that Red and Rhomphaia mentioned. Or maybe its just the aero drag?\n\nChanging the nosecones to advanced A type and removing the 8 lower struts gives 3721 m/s to 75x75 orbit with 1754 dV remaining in the Poodle stage, which is basically equal to 2 side booster dv remaining. \n\nSo its really a combination of the extra drag of the asparagus staging (lines/struts/cones) with the fact that the stacks are pretty short and not worth that much extra drag. I think Red wins, plus he makes for a better pet names. A cat named CyberSoul would scare the crap out of me, especially at night with those intense eyes.\n\n**Edited \u003Ctime datetime=\u00222015-06-06T17:56:11Z\u0022 title=\u002206/06/2015 05:56  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 6, 2015\u003C/time\u003E by cybersol**"},{"CreatedByName":"Mr. Speed","CreatedById":72133,"CreatedDateTime":"2015-06-06T19:52:48Z","Content":"I\u0027m with Red on this one, but I also think the asparagus version needs a different ascent profile than the double booster version. I flew them both to orbit by hand and they seem pretty comparable to me, so I would go with the cheaper double booster version and shave off some weight for dV. I don\u0027t know how many landings you want to do on minmus(contracts and stuff) but you still have a good safety margin for at least one landing with your rocket.\n\nI bet you could do without the heat shield as the payload bay is pretty heat resistant itself and it will get you a good amount of extra dV in return."},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-06T20:33:17Z","Content":"Interesting case, had to actually test fly it several times before it finally made sense.\n\nYour problem are those ridiculous reinforcing scaffoldings you use to mount the struts.\n\nNo, seriously!\n\nThey add a LOT of drag(almost doubling the rockets drag, based on the aero drag display).\n\nYour 2-booster design can handle that, because it retains all its motors and thus has enough brute force to overcome the drag between 3000m-11000m, when it is at its worst.\n\nJust when you stage off your boosters, you will have exited the high drag zone, so you can afford the reduced thrust.\n\nOn the other hand, your Asparagus design loses engines, and thus thrust very early on. By the time drag on that scaffolding is max, you are down to 4 of the 8 starting booster engines.\n\nYour ship thus loafs around at low speed at low altitude, taking almost 35 seconds longer to get to 20km.\n\nThat is both 35 seconds more gravity loss (an even 350m/s loss) PLUS reduced efficiency due to airpressure-reduced ISP.\n\nTo fix it, you need to either retain your booster engines longer (bigger booster tanks,smaller core), or\n\n.\n\n.\n\n.\n\nLOSE THE SCAFFOLDING!\n\n.\n\nI redesigned your asparagus with just 2 changes.\n\n1) lose the steering fins, they are not needed, you have ample steering authority on the core engine\n\n2) replace your scaffolding with a cubic octagonal mini-scaffold. (or that miniature tiny fixed wing you get a tech 0, its just as good)\n\nSo just how much difference does this make?\n\nOn a pure vertical flight, your Apogee when dropping the mainsail is 27 km higher!\n\n**Edited \u003Ctime datetime=\u00222015-06-06T20:37:00Z\u0022 title=\u002206/06/2015 08:37  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 6, 2015\u003C/time\u003E by MarvinKitFox**"},{"CreatedByName":"cybersol","CreatedById":81136,"CreatedDateTime":"2015-06-07T03:21:23Z","Content":"I really wanted to remove the girders and struts as well, and now you made me try it. I removed all the girders, struts, and fins and relaunched using the above profile in MJ. Now the 2 booster version has 39 m/s left in the Skipper stage, while the asparagus version has 83 m/s left in the Skipper stage. The proper order of the universe is restored, as asparagus regains its rightful place."},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-06-07T07:02:51Z","Content":"Yep.\n\nYour asparagus efficiency is still suffering due to a bit low TWR in the early ascent stage, and the inherent increased drag from all that plumbing exposed to frontal drag, but at least it is looking a bit more like it should.\n\nThe more normal asparagus strategy requires the core and side boosters to be closer in performance.\n\n(Actually your initial design, but with 3 sets of boosters asparagus instead of the one pair you have, makes for a really solid heavy lifter)"},{"CreatedByName":"PB666","CreatedById":107380,"CreatedDateTime":"2015-06-07T13:37:39Z","Content":"\u003E \n\u003E If you run the numbers, the asparagus design should have more dV in either atmospheric conditions or vacuum. But that doesn\u0027t tell the whole story. \n\u003E Drag should be close to a wash, 8 1.25m boosters have exactly the same frontal area as 2 2.5m boosters (not sure about the relative drag of the different nosecones, though). Edit: If fuel lines are as draggy as struts that might be significant, the asparagus design has more of them.\n\u003E \n\u003E What I think is happening is that the higher peak TWR of the large booster version is getting it out of the thick atmosphere faster, so the engines get more efficient with the falling air pressure more quickly.\n\nHaving tested several designs this appears to be close to the mark. \n\nAsparagas works to improve delta-V but only with increases in fuel. In fact increasing side fuel tanks even without adding engines worked well if the launch engine had good take off ISP stats. \n\nAsparagas will work for you but you will need aerodynamic launch engines. It worked best for highly aerodynamic tanks with drag lowered.\n\nTherefore the critical problem is TWR (ISP of the engines in particular) and drag resistence. \n\n\\_ I had a poodle on a bigorange with a F2 pod and covered by a fairing.\n\n- three side F1 rockets LV-30 with left 2200 dV at orbit\n\n- 6 side side F1 rockets LV-30 (3-3 asparagas) 2600 dv at orbit \n\n- 8 side F1 rockets LV-30 (2-2-2-2 asparagas) 3400 dv at orbit \n\nAll of these required a large number of small boosters to get the craft up to 1000 meters or so, otherwise the super efficient poodle would not have enough momentum after the gravity turn to efficiently make orbit. \n\n- big orange on a F2 booster with high aerodynamic side fuel tanks 3400 dv\n\n-with Asparagas fuel tanks this produces 3500 dV in the orange tank at minimal orbit. {note the edit, the 5000 value appears to have been a glitch in MechJeb and could not be reproduced). I managed to get a third set of fuel tanks with a booster\n\n -Marginal utility of gain\n\n -Additional tanks cost about the same, but only deliver a few additional dV\n\n -large booster (w/tank) have overheating problem with long runs, you have to trottle them down or they overheat.\n\n![nhGh2ix.png](http://i.imgur.com/nhGh2ix.png)\n\nThe problem on asparagas is that the added weight of the engines, the engines need to pay for themselves during the launch, and all the drag parts needed to feul and stabilize. \n\nThe large booster has a cleaner design, I would push the weight of the side tanks as high as I practically could versus going to asparagas.\n\n**Edited \u003Ctime datetime=\u00222015-06-07T16:24:14Z\u0022 title=\u002206/07/2015 04:24  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 7, 2015\u003C/time\u003E by PB666**"}]}