{"TopicId":112947,"ForumId":16,"TopicTitle":"Decouple Inner-Stage First? and Stock Aerodynamics Tutorial?","CreatedByName":"wisnoskij","CreatedById":143705,"CreatedDateTime":"2015-06-14T16:26:40Z","PageNum":1,"Articles":[{"CreatedByName":"wisnoskij","CreatedById":143705,"CreatedDateTime":"2015-06-14T16:26:40Z","Content":"I am working with a very wide and light payload, and a very specific contract goal. And Just had a crazy idea.\n\nSetup:\n\nTrying to get an Dawn Engine Sat into a polar orbit.\n\nThe satellite fits in an extra wide KW-Rocketry fairing designed to stick on a Rockomax stack, but flairs out even more.\n\nSo for ascetic, stability, and I believe Aerodynamic reasons I want to stick a rockomax stack under it.\n\nBut I also have a contract for Test Swivel at 10KM.\n\nI tried a 3 stage system with two reliants and two swivels, but they were jettisoned too quickly. So was wondering about using the high powered rockomax to get me up to speed and then ditching it, the center stage first. I think it could be technically possible, but I am not sure if it would be hideously aerodynamic (Over the mach hump and hopefully past 10K by then anyways).\n\nI am probably overthinking this, and i should just put a quadcoupler and a bunch of swivels on the bottom, or has something like this design has been tried and is not all that terrible?\n\nAlso: Are there any good stock aerodynamic tutorials. I read like the release post or something and it was interesting but hard to conceptualize into practical data. For one Scott Mannly puts nose cones on the bottom of his craft\u0027s tanks. I am not sure why"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-06-14T17:32:17Z","Content":"You could just stick the swivel engine on top of your ion satellite, with an upside down decoupler (so it detaches with the engine instead of staying on the sat).\n\nYou don\u0027t actually have to have fuel with you to test. You just need to stage the engine. That can be done at the same time as decoupling the sat from the fairing base, for example."},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2015-06-14T18:53:53Z","Content":"I have actually done this, though mine was a 3m core with 4x2m boosters. It flew OK but it was difficult to ensure that the core didn\u0027t smash anything when I dropped it."}]}