{"TopicId":113099,"ForumId":16,"TopicTitle":"Switching Symmetry in SPH (or more, keeping it from switching)","CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-16T10:30:40Z","PageNum":1,"Articles":[{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-16T10:30:40Z","Content":"The symmetry tool in SPH drives me to tears, randomly switching between mirror symmetry and radial. Already had an extra set of wheels on top of my wings, my four engines placed on three pylons (one including two clipped over as symmetry tool decided to mirror the top pylons but apply axial to the bottom one, linking it with the top one on the other side), asymmetric engine placement (instead of (a)(b)o(![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png)(a) I got (a)(b)o(a)(![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) as the other bicoupler got copied but not mirrored), all kinds of woes.\n\nOh, and if I have two engines mounted as \u0022mirrored\u0022, I\u0027m supposed to attach an action group to them as a pair; I can\u0027t attach action groups to them individually. That would be fine, except it works only in SPH. During flight, I\u0027m finding the action group toggles engines on one side of the plane, the other half keeps running.\n\nIs there some method to get the symmetry tool in check and make it behave one way or another but not switch between them at will?\n\nOr should I give up and build everything from scratch without using the symmetry tool?\n\n**Edited \u003Ctime datetime=\u00222015-06-17T14:40:26Z\u0022 title=\u002206/17/2015 02:40  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 17, 2015\u003C/time\u003E by Sharpy**"},{"CreatedByName":"ElWanderer","CreatedById":114015,"CreatedDateTime":"2015-06-16T11:38:24Z","Content":"Yeah, as you mouse over placed parts it likes to pick up their symmetry. I understand the frustration.\n\nYou should be able to tame it by hitting the R key to toggle between radial and mirror symmetry just before placing the part. There\u0027s also F for switching between symmetry around vessel and symmetry around part, but I\u0027ve not got to work last time I tried. Lastly X and shift-X toggle through/back through the number of symmetry."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-16T12:40:01Z","Content":"I guess it may have been stray presses of \u0027r\u0027 when desperately hunting for the right axis of rotation with QWEASD"},{"CreatedByName":"B-STRK","CreatedById":126119,"CreatedDateTime":"2015-06-16T13:50:39Z","Content":"\u003E \n\u003E The symmetry tool in SPH drives me to tears, randomly switching between mirror symmetry and radial. Already had an extra set of wheels on top of my wings, my four engines placed on three pylons (one including two clipped over as symmetry tool decided to mirror the top pylons but apply axial to the bottom one, linking it with the top one on the other side), asymmetric engine placement (instead of (a)(b)o(![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png)(a) I got (a)(b)o(a)(![B)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png) as the other bicoupler got copied but not mirrored), all kinds of woes.\n\u003E Oh, and if I have two engines mounted as \u0022mirrored\u0022, I\u0027m supposed to attach an action group to them as a pair; I can\u0027t attach action groups to them individually. That would be fine, except it works only in SPH. During flight, I\u0027m finding the action group toggles engines on one side of the plane, the other half keeps running.\n\u003E \n\u003E Is there some method to get the symmetry tool in check and make it behave one way or another but not switch between them at will?\n\u003E \n\u003E Or should I give up and build everything from scratch without using the symmetry tool?\n\nTo add to ElWanderer: one thing I\u0027ve noticed when using symmetry is that, if you\u0027re attaching parts to parts already installed with a given symmetry (radial/mirror), then the new parts being attached will take *no symmetry but the symmetry of its parent part*--I\u0027ve tried forcing a different symmetry of a child of a child, trust me. It won\u0027t give. Maybe that\u0027s why you\u0027re getting the behavior you\u0027re getting. \n\nSo, for example, if I attach two tanks radially to a fuselage, then the fuel line attachments I try to feed from those tanks to the main fuselage will be radial, never mirror. (I haven\u0027t tried going the other way around; it might force the symmetry or keep the parent symmetry--or if the parent is the root, then take any symmetry...). \n\nAs for action group misbehaviors with symmetry, I believe I\u0027ve read somewhere (and it\u0027s kinda my experience with the game, too), *if after you\u0027ve placed an action group on a symmetrical part, you then try to move the symmetrical part*, it\u0027s advised to redo the action group for it. [thread=97285]There\u0027s a stock bugfix for it, but there\u0027s also a disclaimer about it causing a bit of misbehavior as well, so its caveat emptor whether to use it or not, really[/thread].\n\nBest tip I could probably offer so far: plan out the symmetry on the craft you\u0027re building so that each part \u0022branch\u0022 maintains only one symmetry. If you want to force a subbranch that\u0027s placed symmetrical to a different symmetry than its parent (s), you could try building it separately as a subassembly, OR by mounting it as a single part to a free node (make the connection point the point you plan to connect it by to its parent), build the subbranch there, then pick up the subassembly and remount it to its parent in the parent\u0027s symmetry; the subassembly is (hopefully!) mirrored/radialed as it is originally constructed. And, if you\u0027re not averse to mods, get StripSymmetry, in case you really need to tell the symmetry tool to behave. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-06-17T14:45:43Z","Content":"I found a way to strip symmetry without a mod. All you need is to set the symmetrical part as root. (then you can reset the root back to wherever it was). You may need to set the one directly attached to the non-symetric \u0022core\u0022 part, e.g. 4 sets of fuel tanks with nose cones and engines attached by radial decouplers to the main rocket - it\u0027s one (any) of the decouplers that needs to be set as root."}]}