{"TopicId":113653,"ForumId":16,"TopicTitle":"Help with recovering items in orbit","CreatedByName":"dingomedic","CreatedById":71311,"CreatedDateTime":"2015-06-22T00:14:08Z","PageNum":1,"Articles":[{"CreatedByName":"dingomedic","CreatedById":71311,"CreatedDateTime":"2015-06-22T00:14:08Z","Content":"Hey Guys, been awhile since I have been here. quick question. I have a contract to recover an item in kerbin orbit. How do I achieve this? specifically what part do I use? I tried the grappling arm for asteroids and it just bounced off. the converter has no docking port. I am stumped."},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-06-22T01:20:37Z","Content":"The Claw (advanced grab unit) is the part, which is the same part for grabbing asteroids.\n\nBounced off - you need to target some flat area and give a bigger impact speed."},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2015-06-22T13:17:13Z","Content":"Claw\u0027s how you do that in the stock game. If you\u0027re not adverse to mods, you can also grab a hold of the thing with parts from KIS/KAS.\n\nIf you haven\u0027t got the Claw...well, that\u0027s problematic, but not impossible. You\u0027d have to build a \u0022cage\u0022 for the item in question, say out of Modular Girder Segments or somesuch. Maybe use lander legs to keep the object from flying out once you\u0027ve got it in place. And the tricky bit there is that without a firm connection between the recovery craft and the part, you couldn\u0027t risk time-warping for fear of blowing something up."},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2015-06-22T13:20:32Z","Content":"Remember also to have the object targeted ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-06-22T14:15:53Z","Content":"I\u0027ve recenly did that in a quadrulpe recovery around Minmus (clockwise and anticlockwise orbits. low and high orbits, with and without inclination...) That was fun.\n\nFor Kerbin, it\u0027s easy. \n\nCheck your mission briefing, it tells you the size and weight of the part you have to grab.\n\nCreate a drone with\n\n- Claw,\n\n- LKO maneuverability capacity and deorbit (Terrier or smaller)\n\n- RCS for docking\n\n- Probe core and energy (few fixed solar and batteries)\n\n- Lights (optional)\n\n- Heat shield depending on the part size. 2.5m is nice\n\n- Chutes (go for 8 ; better too much than not enough...)\n\n- Fire under you target\n\n- Do the usual rendez-vous maneuvers\n\n- Arm the law and dock to the part. Try to get this part inline with your recovery ship , so it won\u0027t overheat on renetry.\n\n- Deorbit, slowdown with you manoeuver engine, burn all RCS left. Dump the maneuver stage when empty\n\n- Land with chutes\n\nThe parts I grabbed back were :2 Cupola, 1 plane cockpit MK1 and 1 MK3 medium fuel tank (empty)\n\nAnd if you\u0027ve those missions for Mun or Minmus : \n\n- Add a transfer stage without capture fuel\n\n- Add some fuel to the grabbers for kerbin return.\n\n- Detach grabbers around 2/3 of the trip to SOI\n\n- Adjust each grabbers to specific orbit in SOI as soon as possible."},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-06-22T19:14:58Z","Content":"LKO recovery doesn\u0027t need heat shields, just make sure your recovery drone is draggy.\n\nDon\u0027t worry overly much about inline capture. Once you are grappled, disable all reaction wheels on one side of the claw, unlock the pivot, and align target indicator with heading before relocking pivot.\n\nMy current on demand deorbiter is a 10 kfund 2 stage missile. The first 4 kfund stage is a disposable 2 km/s booster with a faring for the second stage. The second stage circularizes, captures, and deorbits. If I decide to keep the design, I can work on accurately mapping launch phase delay for launch to capture ability.\n\nMy problem is balancing between too little and too much gravity turn on such a small rocket, but mass is the key to keeping it cheap.\n\nFor small, sensitive parts, you can always recover with a space plane."},{"CreatedByName":"Xannari Ferrows","CreatedById":125369,"CreatedDateTime":"2015-06-22T19:20:23Z","Content":"RCS driven parachute tugs are the way I go. They\u0027re fairly effective if I do say so myself."},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-06-22T20:18:09Z","Content":"Ya, any RCS tank gives great dV for light capture tugs. A full, tiny, inline tank gives me 500 ms. I launch with my RCS tanks partially depleted.\n\nI just wish the RCS engine wasn\u0027t so big and powerful. KER does not give you a lot of the readings I rely on if you use RCS thrusters in place of a main engine. 20 kN (actually 40 kN because it\u0027s radial) is overkill for probes that eschew LFO."},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-06-23T05:37:21Z","Content":"Did you \u0022arm\u0022 the claw before attempting to grab the target? How fast were you going at contact?"}]}