{"TopicId":114027,"ForumId":16,"TopicTitle":"Recovery Contract","CreatedByName":"locustgate","CreatedById":81277,"CreatedDateTime":"2015-06-24T19:06:53Z","PageNum":1,"Articles":[{"CreatedByName":"locustgate","CreatedById":81277,"CreatedDateTime":"2015-06-24T19:06:53Z","Content":"I\u0027ve been trying to recover a part, so far I\u0027ve used the claw, but it always bounces off."},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-06-24T19:38:54Z","Content":"Forgive the possibly stupid question, but just to be clear: you did arm the claw first, yes? (i.e. it\u0027s in its \u0022deployed\u0022 state, not the furled-up-in-its-casing state)\n\nIf you\u0027re new to using the claw, be aware that it\u0027s notorious kraken-bait; very, very buggy. Even simple usage has a propensity to destroy the universe, and/or your ship, and/or put the game in a bugged state where nothing works right until you exit the game completely and re-start.\n\nIt\u0027s so bad (and has been that way since forever) that I\u0027ve taken to just completely avoiding the claw for any usage whatsoever. It\u0027s just not worth the hassle to me. When \u0022recover a part\u0022 contracts come up, I just pass on by.\n\nThat\u0027s not to say that using it can\u0027t be fun, if you\u0027re fortunate and manage to dodge the bugs. It\u0027s not worth the hassle to me, but maybe it is worth it to you. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) Just be aware that the bugs are there, and quicksave frequently if you\u0027re using it."},{"CreatedByName":"locustgate","CreatedById":81277,"CreatedDateTime":"2015-06-24T19:42:35Z","Content":"\u003E \n\u003E Forgive the possibly stupid question, but just to be clear: you did arm the claw first, yes? (i.e. it\u0027s in its \u0022deployed\u0022 state, not the furled-up-in-its-casing state)\n\u003E If you\u0027re new to using the claw, be aware that it\u0027s notorious kraken-bait; very, very buggy. Even simple usage has a propensity to destroy the universe, and/or your ship, and/or put the game in a bugged state where nothing works right until you exit the game completely and re-start.\n\u003E \n\u003E It\u0027s so bad (and has been that way since forever) that I\u0027ve taken to just completely avoiding the claw for any usage whatsoever. It\u0027s just not worth the hassle to me. When \u0022recover a part\u0022 contracts come up, I just pass on by.\n\u003E \n\u003E That\u0027s not to say that using it can\u0027t be fun, if you\u0027re fortunate and manage to dodge the bugs. It\u0027s not worth the hassle to me, but maybe it is worth it to you. ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif) Just be aware that the bugs are there, and quicksave frequently if you\u0027re using it.\n\nI\u0027ve tried both, and opening while it was hitting."},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-06-24T20:30:31Z","Content":"The way to use the claw is to open it first, before it makes contact with the target.\n\nWhat\u0027s supposed to happen is, when it hits the target, the two then merge into a single ship (like with docking). If that\u0027s not happening and it\u0027s bouncing off, check your angle of approach-- make sure that the axis of the claw is reasonably close to perpendicular to the surface it\u0027s grabbing onto. If there\u0027s too much of an angle, it\u0027s prone to bouncing off. Your best bet is to find a reasonably broad, flat surface on your target and then move directly towards it.\n\n(I base the above statement on my shenanigans with asteroids, until I finally got so fed up with the claw\u0027s game-destroying bugs that I just swore off it forever-or-until-they-fix-it. Haven\u0027t played around with it on parts, except just once when I tried it yesterday and got a horrible bug the very first time. So yeah, I\u0027m still avoiding the claw.)"}]}