{"TopicId":114536,"ForumId":16,"TopicTitle":"Building Space Station?","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-06-29T13:42:30Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2015-06-29T13:42:30Z","Content":"I have contracts, one is about constructing outpost on Kerbin Orbit the other is about Space Station. \n\nI wonder does it i need fulfill all requestment at once, or i can built space station in phases like in real life?"},{"CreatedByName":"Frank_G","CreatedById":100000,"CreatedDateTime":"2015-06-29T13:56:46Z","Content":"So far i had no problems with adding parts to meet the requirements, as long as the root part is launched after the contract was accepted. Its also fun to launch the whole station as a construction kit in a single launch. I especially like station kits, when it comes to interplanetary station contracts, as you can make lots of money.\n\n**Edited \u003Ctime datetime=\u00222015-06-29T13:59:06Z\u0022 title=\u002206/29/2015 01:59  PM\u0022 data-short=\u00229 yr\u0022\u003EJune 29, 2015\u003C/time\u003E by Frank\\_G**"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-06-29T14:27:55Z","Content":"I wouldn\u0027t say that space stations contracts provide lots of money. Many even don\u0027t cover the expenses...\n\nBTW : one space station can fit 2 (or more) contracts : you could do a Kerbin, Kerbol and Duna with only one space station."},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-06-29T20:52:28Z","Content":"\u003E \n\u003E I wouldn\u0027t say that space stations contracts provide lots of money. Many even don\u0027t cover the expenses...\n\nYeah, it really depends on the contract. In particular, I find the \u0022put a station around *\u003Canything other=\u0022\u0022 than=\u0022\u0022 kerbin=\u0022\u0022 mun=\u0022\u0022 minmus=\u0022\u0022\u003E\u003C/anything\u003E*\u0022 to just not be worth the bother; the rewards don\u0027t seem commensurate with the effort or expense.\n\nI find that the sweet spot for station contracts is \u0022on a solar orbit\u0022. These give a lot of bang for the buck: pretty cheap to construct, they pay a lot (anywhere from $500K to nearly a million), and they require minimum play-time to put in place (basically, just make a ship with a lot of dV; take off straight up; punch it until you\u0027re out of fuel; then wait a day or two until you leave Kerbin\u0027s SoI).\n\nEasy money. ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-06-30T07:45:49Z","Content":"I should mention that I like those contracts because I use space stations to explore bodies. Usually I send a \u0022space station\u0022 flight (core station and fuel) and a \u0022mission\u0022 (return ship, landers, crew, satellites). I do multiple lnding (with or without hops) from the space station.\n\nSo I usually try to get those when visiting. \n\nWhat I like to do is convert a \u0022build a new space station\u0022 to a \u0022upgrade your space station\u0022 by changing the \u0022LaunchID\u0022 of the mission requirement. It\u0027s more RP. But I only choose missions where I really have to add parts."},{"CreatedByName":"Old Foxboy","CreatedById":141736,"CreatedDateTime":"2015-06-30T08:24:36Z","Content":"When building interplanetary stations, i send a refueller lander (ore miner) with them to refill the booster modules. I have a refueller module and an ore miner always at hand in minimus orbit (well, currently they are parked at Ike, but you get the idea). You can launch a new station, refuel, and just add a new core module to fulfill the \u0022new craft build after...\u0022 parts.\n\nIf you completely build a new station for each contract, you may not get paid like you should."}]}