{"TopicId":114765,"ForumId":16,"TopicTitle":"how to make stuff firmly stick inline inside a Mk3 cargo?","CreatedByName":"scavenger","CreatedById":111989,"CreatedDateTime":"2015-07-01T14:49:57Z","PageNum":1,"Articles":[{"CreatedByName":"scavenger","CreatedById":111989,"CreatedDateTime":"2015-07-01T14:49:57Z","Content":"hi\n\nquestions seems obvious but I just can\u0027t make stuff fit inside the Mk3 cargo, inline. One side is attached with 2 clamp-o-tron, this is easy part.\n\n[![915nrqs.png](http://i.imgur.com/915nrqs.png)](http://imgur.com/915nrqs)\n\nthe other end gives me headaches. Do I just miss some attachment parts?\n\n**Edited \u003Ctime datetime=\u00222015-07-01T16:38:34Z\u0022 title=\u002207/01/2015 04:38  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by scavenger**"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-07-01T15:01:11Z","Content":"What exactly are you trying to do at the other end? Are you trying to attach the other end to cargo bay nodes as well?"},{"CreatedByName":"scavenger","CreatedById":111989,"CreatedDateTime":"2015-07-01T15:14:48Z","Content":"yes i am trying to avoid this\n\n[![GIIc8Mp.png](http://i.imgur.com/GIIc8Mp.png)](http://imgur.com/GIIc8Mp)\n\nwhat do I put at the other end so it can be sticky but detached?"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2015-07-01T15:21:30Z","Content":"You should strut it. At the very least you would have to strut the other end. (Strut from your payload to the cargo bay). The struts will detach when you undock tour payload\n\nI\u0027m not sure how you could pick up cargo and have it picked firmly in place, except for maybe some tricks with docking nodes and a tight fit, but that should rarely if ever occur"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-01T15:21:58Z","Content":"Struts."},{"CreatedByName":"scavenger","CreatedById":111989,"CreatedDateTime":"2015-07-01T15:26:59Z","Content":"OH\n\nI tried struts but for some reasons I cannot control the prodobodyne attached on the tanks so I thought it was because of that...\n\nSo struts ok, it works with struts you are right lol\n\nthank you\n\n**Edited \u003Ctime datetime=\u00222015-07-01T16:38:15Z\u0022 title=\u002207/01/2015 04:38  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 1, 2015\u003C/time\u003E by scavenger**"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-02T07:16:43Z","Content":"If you want e.g. to attach it while in orbit, I guess a second port at the bottom of the bay would do the trick, although aligning them right would be a chore and docking even more so.\n\n(put a beam from the opposite wall as the initial port, place a docking port perpendicularly on it, and another on the side of the tank, at a matching distance.)"},{"CreatedByName":"UnusualAttitude","CreatedById":129962,"CreatedDateTime":"2015-07-02T13:07:48Z","Content":"Just a personal preference, but I prefer to strut from the cargo bay to the payload. This avoids leaving the strut ends on the payload after release. I\u0027m a very part count challenged player...![:wink:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-07-02T17:18:33Z","Content":"One helpful thing I noticed fellow kerbonauts:\n\nWhen taking off, your cargo needs struts in order to stay all nice inside the cargo bays. But if your cargo is another ship that is intended to return to the parent craft in order to land, now what? Well....if it fits snugly on the cargo bay, no problem. It wont clip through after undocking and docking again, which is nice since you can land without the cargo wobbling around, even without struts.\n\nMakes sense if you think about how the engine works. You can clip parts when building, and as the cargo is still considered part of the craft when taking off, it is allowed to clip through objects of this same craft. After it undocks, it becomes another entity, which collides with others."},{"CreatedByName":"mikeb30165","CreatedById":60789,"CreatedDateTime":"2015-07-02T17:20:46Z","Content":"Easy. Struts. Don\u0027t use too many though \u0027cos they cause drag, even placed inside the bay."},{"CreatedByName":"Technical Ben","CreatedById":10512,"CreatedDateTime":"2015-07-02T17:38:33Z","Content":"I use carefully aligned docking ports (but have to get the right order of placement, place one top, one bottom, but only connect the top to the payload, the bottom them \u0022docks\u0022 once launched/active). However heavy payloads often need struts as well."},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-07-02T18:23:40Z","Content":"For reattaching struts, try Quantum Struts mod. When you redock your payload, the struts will reattach to the payload.\n\n\u003E \n\u003E Easy. Struts. Don\u0027t use too many though \u0027cos they cause drag, even placed inside the bay.\n\nParts in a cargo bay are occluded from drag."}]}