{"TopicId":115634,"ForumId":16,"TopicTitle":"How to use a \u0022Space Shuttle Style\u0022 launch stage?","CreatedByName":"lugge","CreatedById":143343,"CreatedDateTime":"2015-07-11T13:15:26Z","PageNum":1,"Articles":[{"CreatedByName":"lugge","CreatedById":143343,"CreatedDateTime":"2015-07-11T13:15:26Z","Content":"Hi guys,\n\nthe problem is as follows:\n\nI have to get my transport stage for my Duna mission up to orbit. It got about 45t.\n\nMy approaches till now were: add more stages. Use asparagus on the bottom stage.\n\nThis way, I had a realy large, thin rocket. This works fine till i start my gravity turn. My rocket starts wobbling, and the more i try to control it the more it wobbles.\n\nOK, now i changed my approach. Instead of place my payload on top of my launch stage I tried it more space shuttle style.\n\nPlace my final stage on the side of an orange tank. Add more tanks and engines to this tank. Call this tank-based vehicle \u0022launch stage\u0022.\n\nYou know, like the space shuttle \u0022rides\u0022 its tank/booster stage.\n\nThis way, the whole craft is only half as high as my first approach.\n\nHowever, now it got even worse. As soon as i launch, the craft tipps over to the \u0022payload side\u0022.\n\nOk, seems legit, i guess.\n\nHow do i counter this?\n\nI would like to post some screenshots, but im not allowed to add attachements. (Why?)\n\nCan anyone recommend me a picture hosting page?\n\nGreetings!"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T13:23:09Z","Content":"The thrust is not aligned with the mass. If the thrust and mass are too far apart the craft will tip towards the mass and crash. There are two options to counter this. 1. Align your thrust with your mass, or 2. Make a different launch stage.\n\nAlso, imgur.com is a great place to share images."},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2015-07-11T13:45:11Z","Content":"Instead of doing a space shuttle style launch, it\u0027s usually a better idea to build the rocket around the payload.\n\n![transfer_stage_1.jpeg](http://jltsiren.kapsi.fi/ksp/1.0/transfer_stage_1.jpeg)\n\nThis way the rocket is symmetric, it can be made rigid with a few struts, and the center of mass is in a convenient place."},{"CreatedByName":"lugge","CreatedById":143343,"CreatedDateTime":"2015-07-11T13:45:59Z","Content":"Hello Kaboom (yes, that was the sound my craft made 30s after launch), thanks for your reply.\n\nFirst, some pics of the craft:\n\n![58K22BP.jpg](http://i.imgur.com/58K22BP.jpg)\n\n![VNPOwMN.jpg](http://i.imgur.com/VNPOwMN.jpg)\n\n![ax7nbJz.jpg](http://i.imgur.com/ax7nbJz.jpg)\n\nYes, i guess it\u0027s some center-of-thrust/center-of-weight problem.\n\nHowever, since i never did airplanes and all my rockets were \u0022needle\u0022-style, I\u0027m new to this concepts.\n\n\u003E \n\u003E 1. Align your thrust with your mass\n\nThis would be needle-style, right? Otherwise, as the tank gets empty, the centers will become unaligned.\n\n\u003E \n\u003E Make a different launch stage\n\nI guess this will be the solution. Any ideas?\n\nIs my design totally broken or is there a way to get this thing flying?"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T13:52:24Z","Content":"\u003E \n\u003E Hello Kaboom (yes, that was the sound my craft made 30s after launch), thanks for your reply.\n\u003E First, some pics of the craft:\n\u003E \n\u003E [http://i.imgur.com/58K22BP.jpg](http://i.imgur.com/58K22BP.jpg)\n\u003E \n\u003E [http://i.imgur.com/VNPOwMN.jpg](http://i.imgur.com/VNPOwMN.jpg)\n\u003E \n\u003E [http://i.imgur.com/ax7nbJz.jpg](http://i.imgur.com/ax7nbJz.jpg)\n\u003E \n\u003E Yes, i guess it\u0027s some center-of-thrust/center-of-weight problem.\n\u003E \n\u003E However, since i never did airplanes and all my rockets were \u0022needle\u0022-style, I\u0027m new to this concepts.\n\u003E \n\u003E This would be needle-style, right? Otherwise, as the tank gets empty, the centers will become unaligned.\n\u003E \n\u003E I guess this will be the solution. Any ideas?\n\u003E \n\u003E Is my design totally broken or is there a way to get this thing flying?\n\nJouni is kinda right, if you put your payload in the center and not on the side, it\u0027s easier. But if you really want a space shuttle type rocket, redesign the rocket, and angle the engines, and vernor ports to keep stability, and try again."},{"CreatedByName":"Chiron0224","CreatedById":147812,"CreatedDateTime":"2015-07-11T14:18:03Z","Content":"It\u0027s worth noting that Kaboom\u0027s suggestion of angling the thrusters is the way it was done with the actual space shuttle [https://upload.wikimedia.org/wikipedia/commons/f/fd/Space_Shuttle_Endeavour_Tail_Section_(1_of_2)_-_Flickr_-_FastLizard4.jpg](https://upload.wikimedia.org/wikipedia/commons/f/fd/Space_Shuttle_Endeavour_Tail_Section_%281_of_2%29_-_Flickr_-_FastLizard4.jpg)\n\nalso, note that with the actual space shuttle the payload itself (the space shuttle) is what does a lot of the thrusting. So the shuttle thrusted evenly with the SRBs and and the thrusters at launch and then once the SRBs were dumped the angled thrusters helped counter balance the weight of the orange tank.\n\nHere\u0027s a possible way to make your design workable. Ad a fuel line to the payload and let it be part of the thrust from the get go. Notice how the center of thrust calculation in the VAB takes the payload\u0027s engine into account and it looks about right.\n\nEDIT:\n\nI looked at your pics and you do in fact have it the way I described so nm. You do still have more thrusters on one side than the other so angling the thruster on your payload might help (although I can see how that would make it difficult once it gets out of atmo)."},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T14:27:18Z","Content":"\u003E \n\u003E It\u0027s worth noting that Kaboom\u0027s suggestion of angling the thrusters is the way it was done with the actual space shuttle [https://upload.wikimedia.org/wikipedia/commons/f/fd/Space_Shuttle_Endeavour_Tail_Section_(1_of_2)_-_Flickr_-_FastLizard4.jpg](https://upload.wikimedia.org/wikipedia/commons/f/fd/Space_Shuttle_Endeavour_Tail_Section_%281_of_2%29_-_Flickr_-_FastLizard4.jpg)\n\u003E also, note that with the actual space shuttle the payload itself (the space shuttle) is what does a lot of the thrusting. So the shuttle thrusted evenly with the SRBs and and the thrusters at launch and then once the SRBs were dumped the angled thrusters helped counter balance the weight of the orange tank.\n\u003E \n\u003E Here\u0027s a possible way to make your design workable. Ad a fuel line to the payload and let it be part of the thrust from the get go. Notice how the center of thrust calculation in the VAB takes the payload\u0027s engine into account and it looks about right.\n\u003E \n\u003E EDIT:\n\u003E \n\u003E I looked at your pics and you do in fact have it the way I described so nm. You do still have more thrusters on one side than the other so angling the thruster on your payload might help (although I can see how that would make it difficult once it gets out of atmo).\n\nThanks for calling my suggestion useless. That\u0027s totally not a rude or jerk move at ALL..."},{"CreatedByName":"Chiron0224","CreatedById":147812,"CreatedDateTime":"2015-07-11T14:39:17Z","Content":"What? I said that your method is the one used on the real space shuttle. I just also considered whether or not it would work in his case depending on whether he plans to stage that thruster off. Actually, now there\u0027s an idea. Have a small stage with an angled thruster that you can then stage off so the payload\u0027s thruster is pointed straight upon achieving orbit."},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-11T14:40:02Z","Content":"\u003E \n\u003E What? I said that your method is the one used on the real space shuttle. I just also considered whether or not it would work in his case depending on whether he plans to stage that thruster off. Actually, now there\u0027s an idea. Have a small stage with an angled thruster that you can then stage off so the payload\u0027s thruster is pointed straight upon achieving orbit.\n\nI need better eyes! Sorry! That\u0027s a good idea."},{"CreatedByName":"lugge","CreatedById":143343,"CreatedDateTime":"2015-07-11T15:52:00Z","Content":"Hi folks,\n\nJouni\u0027s idea totally worked for me.\n\nSeems that was so simple that I missed this solution.\n\nGetting in space was easy this way, and i\u0027m already coupled with the Duna landing stage which was already parked in LKO.\n\nNow on the way to Duna :-)\n\nI will Kaboom\u0027s idea a try on my next mission. Sooner or later, i think, i will have to get into the more complex stuff :-)"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-11T16:07:18Z","Content":"lugge,\n\n As the others have said, your design isn\u0027t busted. You just have to balance the thrust levels and directions so that you are pushing through the center of mass. This gets complicated because the center of mass is always moving during the flight.\n\n![Contender1_zpszjroh8nu.jpg](http://i52.photobucket.com/albums/g13/GoSlash27/KSP/shuttle%20konstitution/Kontender/Contender1_zpszjroh8nu.jpg)\n\n![Contender2_zpsolu2wroj.jpg](http://i52.photobucket.com/albums/g13/GoSlash27/KSP/shuttle%20konstitution/Kontender/Contender2_zpsolu2wroj.jpg)\n\n See how all the flames are fanned out around the center of mass?\n\nAsymmetrical lifters are a lot of fun to play with, but they\u0027re also a skill- level 4 project. \n\n If it becomes too difficult to pull off, you can always go for a symmetrical lifter or break up the payload into smaller chunks and assemble it in orbit.\n\nBest,\n\n-Slashy\n\n**Edited \u003Ctime datetime=\u00222015-07-11T16:11:55Z\u0022 title=\u002207/11/2015 04:11  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 11, 2015\u003C/time\u003E by GoSlash27**"},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-07-11T20:04:07Z","Content":"The thing about the space shuttle style ascent stage is that it really was only appropriate for getting something like the shuttle into space. Using it for something else isn\u0027t really efficient because you can do the same with a bigger, simpler, rocket. \n\nHeck, even when they were considering creating an expendable cargo variant of the Space Shuttle (Without the crew support or wings, but still using the basic launch configuration), it was only really because it\u0027d be cheaper than designing or leasing out a similarly powerful rocket to do it in the conventional way, not because it would have been the ideal method for cargo delivery."},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-07-11T21:57:12Z","Content":"Even the shuttle itself wasn\u0027t ideal. It didn\u0027t quite go as planned and didn\u0027t really save much if anything over a conventional rocket like they originally thought it would. That is why they have reverted to rocket launches now, because shuttle missions really weren\u0027t cost effective. Still, it was an amazing vehicle."},{"CreatedByName":"Juicy","CreatedById":142505,"CreatedDateTime":"2015-07-11T22:00:38Z","Content":"The simpleton option, ofcourse, would be to stick two shuttles against eachother, one a dummy that you\u0027d ditch after you left the atmosphere, when drag is no longer an issue and a gimballed engine can keep you flying in a somewhat straight line."},{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2015-07-11T22:04:21Z","Content":"Indeed, though the shuttle as it was was pretty far away from the original concept. While a non DOD influenced shuttle wouldn\u0027t have quite been as effective as they had hoped, it certainly would\u0027ve proven far better than the Shuttle as we knew it.\n\nThe biggest problem with the shuttle was that most of what it could do it wasn\u0027t ever used for, which in turn was at least partly NASA\u0027s fault during Challenger (NASA\u0027s administration has always been its biggest problem post Apollo), as that accident was ultimately what resulted in the DOD moving to their own launchers, which in turn drove the costs of the Shuttle way up for NASA.\n\nIts still a Catch-22 though. The DOD had a lot to do with why the Shuttle wasn\u0027t as effective as it could have been, but they also had a lot to do with it getting funding in the first place."},{"CreatedByName":"ygarl","CreatedById":147699,"CreatedDateTime":"2015-07-13T13:10:24Z","Content":"\u003E \n\u003E The simpleton option, ofcourse, would be to stick two shuttles against eachother, one a dummy that you\u0027d ditch after you left the atmosphere, when drag is no longer an issue and a gimballed engine can keep you flying in a somewhat straight line.\n\n(Or to launch two REAL shuttles - one full of your main payload, one full of cubesats/probes to Duna/extra fuel tanks for another mission/new section of your (nonexistent as yet) space station)\n\n- - - Updated - - -\n\nThe shuttle was an immensely over-priced program with devastated manned space exploration.\n\nIf they\u0027d not built the STS, and instead done what Space-X is doing now (i.e. further developing using the S-1 Apollo engine - increasing its efficiency, reliability and so on) we\u0027d be getting news broadcasts from Mars right now, and and the exploration of Jupiter and Saturn might well have been manned...\n\nHumanity has not had the capability to leave earth orbit for 45 years. That\u0027s appalling."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-13T14:16:35Z","Content":"Heh... or like Russians with Buran - place the main engine on the launch stage."}]}