{"TopicId":116099,"ForumId":16,"TopicTitle":"Could someone test if those spaceplane designs still work on 1.0?","CreatedByName":"42dustman","CreatedById":119224,"CreatedDateTime":"2015-07-16T20:36:36Z","PageNum":1,"Articles":[{"CreatedByName":"42dustman","CreatedById":119224,"CreatedDateTime":"2015-07-16T20:36:36Z","Content":"I haven\u0027t updated to 1.0 yet because I\u0027m afraid those spaceplane designs wont be able to orbit by themselves anymore. Could someone test them and confirm for me?\n\n**Spaceplane 1:**\n\n[https://drive.google.com/file/d/0B3soSlW5noXxaG9NSlNLSDNjUnM/view?usp=sharing](https://drive.google.com/file/d/0B3soSlW5noXxaG9NSlNLSDNjUnM/view?usp=sharing)\n\n**Spaceplane 2:**\n\n[https://drive.google.com/file/d/0B3soSlW5noXxTy0tWXFtS21rd1E/view?usp=sharing](https://drive.google.com/file/d/0B3soSlW5noXxTy0tWXFtS21rd1E/view?usp=sharing)\n\n**Spaceplane 3:**\n\n[https://drive.google.com/file/d/0B3soSlW5noXxZUlCZ1RrblR5RlU/view?usp=sharing](https://drive.google.com/file/d/0B3soSlW5noXxZUlCZ1RrblR5RlU/view?usp=sharing)\n\n**Spaceplane 4** (activate RCS at end of runaway to get nose pointed upwards and maintain vertical ascent up to ~14.000km, then toggle off RCS to reopen air intakes):\n\n[https://drive.google.com/file/d/0B3soSlW5noXxWFE5R0o2cEZzUUU/view?usp=sharing](https://drive.google.com/file/d/0B3soSlW5noXxWFE5R0o2cEZzUUU/view?usp=sharing)\n\n**Edited \u003Ctime datetime=\u00222015-07-16T23:51:51Z\u0022 title=\u002207/16/2015 11:51  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 16, 2015\u003C/time\u003E by 42dustman**"},{"CreatedByName":"xtoro","CreatedById":79015,"CreatedDateTime":"2015-07-16T21:09:19Z","Content":"Why not install a new copy of 1.x and try yourself? If you\u0027re on steam, copy the game folder somewhere else then upgrade so you still have the old version."},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-07-16T21:15:07Z","Content":"Wish there were screenshots. Anyways, no. 4 sounds interesting, gonna try now.\n\nThough I\u0027m a bad pilot, so a negative result will be unreliable from me."},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-07-16T21:57:40Z","Content":"Got no. 4 to orbit on the second try. I had to remove 1500 oxidizer before launch - that was the remaining amount on my first go. I also used up the payload\u0027s tank - I guess that\u0027s intended as you didn\u0027t close it off. That organ made of radial intakes felt like an overkill. Maybe the wings too, though it wouldn\u0027t feel right to tweak someone else\u0027s construction, so I didn\u0027t. Neither I tried landing, but I\u0027m pretty sure that if you can lift the nose just a bit, than the drag from all those wings will make you laugh at 1.0.4\u0027s reentry heat.\n\nMaybe I didn\u0027t use it as intended - not sure what did you mean by \u0027reopening intakes\u0027, those were open until like 24k when I had to switch to rocket mode.\n\nBTW that part count made me upgrade my career SPH and nearly broke my potato computer. Also I heard that rapiers ignore crossfeed rules, so I think fuel lines weren\u0027t needed.\n\nI think I leave the other three for others to test, so they can have their fun too.\n\nEDIT: just re-read your post - did you specifically want 1.0 testing? Current version is 1.0.4. I thought those were 1.0 planes. These days air-hogging doesn\u0027t work anymore, 4 radial intakes should be enough. Also I think you could also do well with like 1/3 wing area too.\n\nBottom line is - I think your planes will work on the newest version too, though I\u0027d certainly optimize them for the current setup. Damn, building these is half the fun if not more..\n\n**Edited \u003Ctime datetime=\u00222015-07-16T22:14:27Z\u0022 title=\u002207/16/2015 10:14  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 16, 2015\u003C/time\u003E by Evanitis**"},{"CreatedByName":"42dustman","CreatedById":119224,"CreatedDateTime":"2015-07-17T00:01:13Z","Content":"Thanks for info Evanitis. Those are 0.9 planes, yeah. The \u002710 air intakes per engine\u0027 thing is for getting the plane to 30k meters with a 1500m/s speed on air breathing stage, so the craft can get orbital with only ~850 delta-V of closed cycle burn (which is just slightly less than it can achieve without wasting the payload fuel.)."},{"CreatedByName":"Evanitis","CreatedById":145424,"CreatedDateTime":"2015-07-17T08:10:21Z","Content":"I\u0027m far from being an SSTO expert - I built [my first one](https://forum.kerbalspaceprogram.com/threads/11214-The-K-Prize-100-reusable-spaceplane-to-orbit-and-back?p=2018193\u0026viewfull=1#post2018193) in 1.0.2, and still struggling to finish one that can reliably get some payload to orbit. So I hope someone will correct me if I\u0027m wrong.\n\nI heard that air-hogging (as in adding more intakes to reach 30k) doesn\u0027t work since 1.0. My test flight shown the same: while no. 4 was breathing more than happily on 24-26K, it stopped accelerating at that height with a 10 degree pitch. It didn\u0027t even reach 1100 m/s before rocket mode. In my experience, an optimalized rapier SSTO can reach even 1400 on 25k with one shock-cone or two radials / engine. Since 1.0.4, atmosphere is so light that I don\u0027t even need to level out for acceleration with high TTW spaceplanes. My rescue craft\u0027s user\u0027s manual: takeoff, point nose to 30 degrees, circularize at 75k. ![:P](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif) Too easy, but fits someone who prefers perfect engineering to perfect piloting."}]}