{"TopicId":116217,"ForumId":16,"TopicTitle":"A little question","CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-07-18T01:22:57Z","PageNum":1,"Articles":[{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2015-07-18T01:22:57Z","Content":"I haven\u0027t been playing ksp since beta than ever 0.90 and i see that they added new heat system and resource gathering on planets and asteroids.\n\nI still haven\u0027t tried it out but i think i\u0027m gonna love it!\n\nMy question is, is it better to play with real solar system and realism overhaul mods or just use the stock version?\n\nI like the game to be as realistic as possible but i\u0027ve never used these mods and i\u0027m a little bit worried if it\u0027s gonna be much harder or something i don\u0027t know what do you guys think?\n\nWhat i accomplished in the stock version is landing on asteroids and putting them in orbit around Kerbin, went to mun, minimus, duna, ike, dres, pol, bop, tylo and returned safely back to kerbin, though those were separate missions of course.\n\nAccording to my skills what should i do, get thos mods or not?\n\nThanks in advance!"},{"CreatedByName":"HoloYolo","CreatedById":138353,"CreatedDateTime":"2015-07-18T01:32:43Z","Content":"Stock I find is for a more casual player who just plays for fun and that\u0027s all.\n\nRealism Overhaul is for the player that strives for realism and harder gameplay. You choose."},{"CreatedByName":"Wolfox","CreatedById":59958,"CreatedDateTime":"2015-07-18T03:11:31Z","Content":"With mods like RO (Realism Overhaul), you must be prepared for vastly increased difficulty, and be prepared to forget many things you were used to. Not only numbers (like Delta-V, distances, atmosphere levels) are completely different, but also things like antennas with mods for realism (RemoteTech2 or more forgiving Antenna Range) have completely different meaning to the gameplay. Be prepared for a real challenge. For complete realism, install CKAN and get RO and all of its dependencies, for best experience get custom tech tree (RP-0 is great one) for RO and point that rocket with correct end to the space!\n\nBut there is also a middle way you can take, like resize mods (64K), which enlarge the system considerably, comparable to our own, while retaining original feeling and art style of the game. I highly recommend, in this case, putting into shopping cart also brilliant Near Future pack (Propulsion, Electrical, Solar, Construction) for cool looking, but very realistic ships with great capabilities, but they will cost you a lot of money and research. Also adding Life-Support mod is in my opinion a must for realism or Role-Play lovers, most used are TACLS, USI-LS or Snacks, each with own plus and cons. Add some fancy tech tree (CT) with one of many possible configs (I personally use SETI Balance mod) and youÃ‚Â´re good to go!\n\nModability is one of the best thing in this game, and with incredible community like this, its a blessing."}]}