{"TopicId":116940,"ForumId":16,"TopicTitle":"Rocket design suggestion when payload is dry fuel tank?","CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-27T02:28:40Z","PageNum":1,"Articles":[{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-27T02:28:40Z","Content":"e.g. a vessel to transfer fuel from base to orbit, or a vessel of just fuel storage. It doesn\u0027t need to carry fuel at all when arriving at destination, but it doesn\u0027t have to be empty to launch as well. In that case, what is a good launch rocket?\n\nTo clarify what I mean, this is an example ship. Everything above the middle docking port is payload except for the fuel:\n\n![GBJZ9jX.jpg](http://i.imgur.com/GBJZ9jX.jpg)\n\nIgnore what KER shows. This is capable of landing at Mun/Minmus (a lot dV left). The launch profile goes like this: All fuel tanks are full, twin-boar brings the thing high enough, then cut engnine, move fuel up, decouple docking port, then use the Poodle for the vaccum thrust. With the Twin-boar consuming the S3-14400 amount of LFO, I can get ~3km/s on LKO.\n\nNow, this above thing is mainly just randomly sticking pieces together (one evidence that I\u0027m having fuels a lot more than I needed). So I\u0027m seeking advices how other people do this kind of stuff. Specifically, you can answer these questions if you prefer specific questions (but general advice still welcome!)\n\n1. How to design the stages better? I understand it\u0027s more like making the lower-stage tank dry mass into payload, but how it affects rocket design?\n\n2. How to design so that it launches more easily? My current ship involves a bunch of non-stagable/actionable operations (move fuel, decouple docking port), and I\u0027m afraid a couple of days later when I want to launch again I\u0027ll just totally forget how to launch it."},{"CreatedByName":"Jimbimbibble","CreatedById":77859,"CreatedDateTime":"2015-07-27T03:19:18Z","Content":"I would design it so that the first stage (plus any boosters) will almost get you to LKO. That will allow you to send up almost full tanks with minimal effort during launch."},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-07-27T15:38:35Z","Content":"If you have anything special about \u0022how to fly this rocket\u0022, why not add them as notes in the little window under the ship name? That way, whenever you\u0027re launching another one you can just refer to the notes.\n\nAlso, you\u0027ve got a really blunt, flat front end, which is horrible for aerodynamics. For cases like that, I like to put on a disposable nosecone. Nosecone up top, with a decoupler underneath it (make the decoupler upside-down, so that it\u0027s discarded with the nosecone rather than sticking to the rocket). Move the decoupler fairly high up in the staging sequence. I then go to \u0022Action Groups\u0022 and tie that decoupler to the \u0022Abort\u0022 action, which I never use for anything else.\n\nThat way, as I\u0027m launching, whenever I get to the place where I judge that the nosecone is no longer paying for itself (i.e. the cost of the extra nosecone mass outweighs the diminishing benefit from aerodynamics), usually around 25-30km, then I just pop the nosecone off.\n\n\u003E \n\u003E The launch profile goes like this: All fuel tanks are full, twin-boar brings the thing high enough, then cut engnine, move fuel up, decouple docking port, then use the Poodle for the vaccum thrust. With the Twin-boar consuming the S3-14400 amount of LFO, I can get ~3km/s on LKO.\n\nThis part confuses me. It sounds like you have a straightforward two-stage-to-orbit design. Why do you need to move fuel? Why not design it so that the twin-boar uses its *own* fuel, then when it\u0027s empty, you discard it you just use the poodle with its own (still-full) fuel to complete the orbital insertion?\n\n**Edited \u003Ctime datetime=\u00222015-07-27T15:42:12Z\u0022 title=\u002207/27/2015 03:42  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by Snark**"},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-27T16:09:00Z","Content":"\u003E This part confuses me. It sounds like you have a straightforward two-stage-to-orbit design. Why do you need to move fuel? Why not design it so that the twin-boar uses its *own* fuel, then when it\u0027s empty, you discard it you just use the poodle with its own (still-full) fuel to complete the orbital insertion?\n\nBecause Boar will use more than it can store but less than the payload can store; instead of adding another tank you just drain fuel from the \u0022payload\u0022 one, except you can\u0027t force engines to drain in bottom-first order - make the Boar first drain its own supply and only then start depleting the payload. It will drain payload all the way and when it\u0027s to be decoupled, fuel left in it needs to be moved up."},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-27T16:41:41Z","Content":"If my objective is to simply have an empty fuel tank in orbit, I\u0027d design it to hold the fuel required to get it there. Put a disposable nose cone on top and a detachable engine unit underneath with a small reserve tank for deorbit.\n\nBest,\n\n-Slashy"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-07-27T17:01:37Z","Content":"I agree with slashy. If the goal is to get an empty tank to orbit, then use that fuel if at all possible, and reduce tankage elsewhere. An SLS tank with a Rhino on it can SSTO even with other parts added on. Then you can jettison the engine section on orbit. I would build the engine section to contain all the extra stuff not needed by the tank so you can minimize debris. (Maybe even include a small amount of fuel or monopro to deorbit.)\n\nIf you are asking in the general \u0022did I over design this rocket\u0022 sort of way, it really depends on the follow on goals. I can\u0027t tell if that\u0027s what you are asking though, but there are certainly a lot of tips in that area too.\n\nCheers,\n\n-Claw"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-27T17:53:16Z","Content":"Thanks all. The goal is mainly to get empty tank to orbit/surface of Mun. Poodle is for the purpose of circularizing LKO and arriving at destination. That part isn\u0027t that interesting, but more interesting is the lifter part.\n\nI guess given that the lower stage dry tank becomes payload, you don\u0027t get too much benefit from having too many stages (because in perfect world you can only throw away engine mass, not tank mass). I guess my question is more specifically in this case is it better to do more stages than my current two-stage design?\n\n\u003E \n\u003E Also, you\u0027ve got a really blunt, flat front end, which is horrible for aerodynamics. For cases like that, I like to put on a disposable nosecone. Nosecone up top, with a decoupler underneath it (make the decoupler upside-down, so that it\u0027s discarded with the nosecone rather than sticking to the rocket). Move the decoupler fairly high up in the staging sequence. I then go to \u0022Action Groups\u0022 and tie that decoupler to the \u0022Abort\u0022 action, which I never use for anything else.\n\nI do use decoupler-nosecone trick when dealing with 2.5m rocket. But for this one - I just can\u0027t even get close to terminal velocity no matter how I launch, so I don\u0027t even bother. I guess it\u0027s just so heavy and Twin-boar is just so powerful, and aero is no longer proportional to mass.\n\n- - - Updated - - -\n\n\u003E \n\u003E This part confuses me. It sounds like you have a straightforward two-stage-to-orbit design. Why do you need to move fuel? Why not design it so that the twin-boar uses its *own* fuel, then when it\u0027s empty, you discard it you just use the poodle with its own (still-full) fuel to complete the orbital insertion?\n\nSharpy was right. The usage of docking port for decoupler is to allow fuel crossfeed down, and I won\u0027t need to move fuel up if Twin-boar can drain from bottom tank first. If Twin-boar uses its fuel all the way, then there will be unused fuel tank and will be less efficient - I\u0027m literally saving the fuel tank mass of Twin-boar\u0027s own fuel with this design. If I really carry full fuel for Poodle for its own use - that\u0027s way too overkill and will result in a even worse lifter.\n\nJust to compare. I did have an earlier version which payload only carries Poodle\u002Bits own fuel (not full, but giving similar albeit fewer dV than my above design on LKO), and it was ~40t heavier.\n\n**Edited \u003Ctime datetime=\u00222015-07-27T18:25:37Z\u0022 title=\u002207/27/2015 06:25  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by FancyMouse**"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-27T19:35:45Z","Content":"Well darn it...\n\n I knocked together a design to illustrate the concept. Then I found out I had the wrong concept...\n\n![OT07_zps9txxwpb3.jpg](http://i52.photobucket.com/albums/g13/GoSlash27/KSP/OrbitalTank/OT07_zps9txxwpb3.jpg)\n\n[http://s52.photobucket.com/user/GoSlash27/slideshow/KSP/OrbitalTank](http://s52.photobucket.com/user/GoSlash27/slideshow/KSP/OrbitalTank)\n\nI suppose this could make lunar orbit or even the lunar surface. It has plenty of DV remaining. But of course you wouldn\u0027t make a recoverable lift stage to do that...\n\nI\u0027ll check and see.\n\n\\*edit\\* yeah, it\u0027s got plenty of DV to reach Munar orbit, or the surface. Over 2km/sec. No need to 2-stage it since the Rhino has excellent Isp in vacuum. If it\u0027s going to the munar surface, does it really \\*need\\* a detachable booster?\n\n Best,\n\n-Slashy\n\n**Edited \u003Ctime datetime=\u00222015-07-27T20:17:18Z\u0022 title=\u002207/27/2015 08:17  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 27, 2015\u003C/time\u003E by GoSlash27**"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2015-07-27T19:35:52Z","Content":"The fins you have seem a bit large for your rocket, have you tried using smaller ones for some minor savings? Based on what you said about aerodynamics, the draggynes of your flat top isn\u0027t enough to flip you. \n\nAnother thought, do you need the twin boar engine? You might be able to just use a mainsail with no fuel tank. Add a decoupler to the bottom of your poodle and the mainsail underneath that and use fuel lines to direct the fuel into the mainsail. \n\nYou could probably also save dv by not even stopping to circulize in lko and just go straight up to the mun, but that would require some good positioning of the mun before you did that. You would only need like 2k dv to get out of the atmosphere and then be able to use your high ISP poodle for space"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-27T20:29:52Z","Content":"\u003E \n\u003E \\*edit\\* yeah, it\u0027s got plenty of DV to reach Munar orbit, or the surface. Over 2km/sec. No need to 2-stage it since the Rhino has excellent Isp in vacuum. If it\u0027s going to the munar surface, does it really \\*need\\* a detachable booster?\n\u003E \n\u003E Best,\n\u003E \n\u003E -Slashy\n\nUm interesting question. I guess you\u0027re able to do that because you have two S3-14400\u0027s, where you could fill in enough fuel. (Not at home computer now) I remember yesterday when I was trying single stage it was giving something like ~4.5km/s dV, enough for LKO but a little short to land on Mun. But I wasn\u0027t trying optimal engine and just randomly sticked one, so maybe Rhino would work - I\u0027ll check later today.\n\nThe main reason I do two stages is that I want the payload to be able to take off from Mun by itself when refueled, but engine is not big enough to have design problems on landing. Poodle is the excellent option for this purpose. Other 2.5m engines or Rhino - I would imagine I need to spend some time placing the landing legs.\n\n\u003E \n\u003E The fins you have seem a bit large for your rocket, have you tried using smaller ones for some minor savings? Based on what you said about aerodynamics, the draggynes of your flat top isn\u0027t enough to flip you. \n\u003E Another thought, do you need the twin boar engine? You might be able to just use a mainsail with no fuel tank. Add a decoupler to the bottom of your poodle and the mainsail underneath that and use fuel lines to direct the fuel into the mainsail. \n\u003E \n\u003E You could probably also save dv by not even stopping to circulize in lko and just go straight up to the mun, but that would require some good positioning of the mun before you did that. You would only need like 2k dv to get out of the atmosphere and then be able to use your high ISP poodle for space\n\nWell, my earlier rocket is kind of done on purpose for every piece.\n\nFins - their mass is ignorable for this heavy ship, so I just put them for safety.\n\nEngine - I need its TWR. I can\u0027t stick Mainsail in such a way that it gives ~1.5 TWR. I also don\u0027t want to stick fuel lines if possible, as my base is getting slow now and fuel line sticking that way will remain on payload.\n\nTrajectory - this topic is by itself debatable, and I prefer not to do that even if it\u0027s slightly more efficient because I don\u0027t want to (read: I\u0027m bad at) launch at the right spot."},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-07-27T21:31:24Z","Content":"\u003E \n\u003E Um interesting question. I guess you\u0027re able to do that because you have two S3-14400\u0027s, where you could fill in enough fuel. (Not at home computer now) I remember yesterday when I was trying single stage it was giving something like ~4.5km/s dV, enough for LKO but a little short to land on Mun. But I wasn\u0027t trying optimal engine and just randomly sticked one, so maybe Rhino would work - I\u0027ll check later today.\n\u003E The main reason I do two stages is that I want the payload to be able to take off from Mun by itself when refueled, but engine is not big enough to have design problems on landing. Poodle is the excellent option for this purpose. Other 2.5m engines or Rhino - I would imagine I need to spend some time placing the landing legs.\n\nFancyMouse,\n\n Really, it\u0027s just a case of KER not giving an accurate DV estimate in the VAB. Not that I blame them; it\u0027s a difficult estimate to pull off.\n\n I didn\u0027t fill the tanks completely on this example. I put in enough for it to hold it\u0027s speed immediately after dumping the SRBs. I just designed it to put a big ol\u0027 tank in orbit with no debris and any extra fuel I had leftover was a bonus.\n\n The landing legs for munar surface use adds another wrinkle, as does keeping the engine to return to Munar orbit. Neither obstacle is insurmountable with this approach, but now you\u0027re not talking about a \u0022tank\u0022 as payload, but rather a \u0022tanker\u0022. That makes this a different problem; a vehicle as payload rather than a tank. \n\n The Rhino nearly matches the Poodle for efficiency and is capable of lifting a whole lot more mass, so I\u0027d probably stick with it as a single stage. Why incur the waste and complexity of staging just to save 10s of Isp when you already have something that works in a single stage from the pad? How you plan to get the fuel \\*into\\* the tanker.... I dunno.\n\n I\u0027d think about setting it down sideways with tiny lift rockets. More capacity, less headaches.\n\n\\*edit\\* I tried my example design as a sideways munar lander. Close, but no cigar. The addition of lift rockets suitable to lift it when fully-loaded cost just enough DV to where a zero descent rate munar approach was required. I\u0027m assuming that if you want a tanker to bring fuel from the munar surface to orbit, you want to set it down in a precise spot. The ZDR approach is terrible for that.\n\n It could probably be tweaked to do that job (it\u0027s only the first landing where this would be a problem), but if it were me I\u0027d leave it as a munar orbital depot and have smaller dedicated tankers to fuel it from the surface.\n\nBest,\n\n-Slashy\n\n**Edited \u003Ctime datetime=\u00222015-07-28T01:10:46Z\u0022 title=\u002207/28/2015 01:10  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 28, 2015\u003C/time\u003E by GoSlash27**"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-07-28T02:45:41Z","Content":"The initial vessel is indeed my \u0022tanker\u0022 to transport fuels from surface to orbit. The fuel storage (which lands and sits there forever) is another one which is supposed to be even bigger (but not yet designed - I want to figure this out first since it\u0027s smaller). Both need to land, though.\n\nI just checked. I actually remembered the wrong number - single stage on the initial vessel is giving ~5km/s (whether using Mainsail or Rhino, just \u003C100m/s difference), which is probably still going to be a few hundred less than needed, but close. And just to clarify - KER has no problem dealing with this number for single-stage dV. The 4.5km/s I claim in that reply wasn\u0027t from the same picture. I do know some bug in KER, but I don\u0027t want to over-blame KER that is in fact not true. Even for the picture I posted, I understand KER can\u0027t show the right number in that case because it can\u0027t possibly know I launch in that awkward way.\n\nI saw your SRBs - that fills the gap (both dV and TWR) for the single-stage approach, but - it\u0027s not single stage any more, I suppose?\n\nAnyway, still appreciate your ideas, especially let me think more about the possibility of single stage designs."},{"CreatedByName":"Wolf Baginski","CreatedById":138549,"CreatedDateTime":"2015-07-28T09:44:40Z","Content":"Some of the half-stage options might be useful, such as SRBs. They won\u0027t get into orbit, so there\u0027ll be some debris down-range, and maybe you can do things with a small probe core and parachutes to get actual recovery. With the acceleration-limiter in MechJeb the core stage can be running at low throttle for most of the SRB burn. Attach some fins to the SRBs as the engine gimbaling of the core stage will be less useful at low throttle.\n\nYou don\u0027t want to greatly increase the flight speed with the SRBs as things are in the high-drag phase at low altitude. Effectively the launch pad is being jacked up a few km. You\u0027re also jettisoning some hot objects before they can transfer a lot of heat to the fuel tankage."}]}