{"TopicId":117246,"ForumId":16,"TopicTitle":"Laythe in one Mission","CreatedByName":"KingPhantom","CreatedById":110881,"CreatedDateTime":"2015-07-30T08:57:03Z","PageNum":1,"Articles":[{"CreatedByName":"KingPhantom","CreatedById":110881,"CreatedDateTime":"2015-07-30T08:57:03Z","Content":"Orbit Laythe\n\nSend data from surface of Laythe\n\nPlant a flag on Laythe\n\nThose 3 contracts i would like to do in one single mission. It should be possible to get ALL science (science jr, mistery goo, seismic, temperature, nano-thing, pressure \u0026 atmospheric).\n\nI\u0027m thinking about that since days... in my 500h KSP i never hat that problems to plan a thing like that. the target to do it in one single flight is extremly hard. but i don\u0027t want to refuel on any point of the mission. it should be able to do it in one flight. its a heck of a challenge ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\ni worked on a only-once-usable lander for laythe. it was simular to the apollo programm. left everything behind and returned just the command module to low laythe orbit where the command module waited (the only difference to the apollo progamm is, that i use parachutes for descending.\n\ni dont get enough thrust and deltaV for a normal sized lander. its not possible to leave laythe that easy. the problem on a heavy lander is, that the weight of the command module (later on that) and the lander is too much to push it to jool...\n\nthe lander should fit 2 kerbals.\n\nthe command module is simple. it is a ion powered mk3 pod with only 2000m/s. should be enough for a well done and exaclty return with direct kerbin-atmospheric entry for landing.\n\nthe command module should fit 3 kerbals.\n\nmy calculations:\n\ncomand module: need 2000 - 2500m/s for a save return. has rcs for redocking\n\nlander: needs ~2600m/s for ascending and low laythe orbit... and some deltaV for the descending (~250m/s).\n\ntransfer stage: will probably give the descending deltaV for the lander and crash on laythe. for a jool-transfer out of the window it needs 5685m/s (935m/s to leave kerbin - 2700-2750m/s hohman to jool - 1000-2000m/s for laythe capture and orbit without aerobreaking...\n\nthats very heavy to get... \n\ndo anyone have an idea or a craft to show?\n\ni tested some spaceplanes too but i failed really hard. i dont understand spaceplanes and i think they are only in LKO very usable (without refuel)\n\ni also tested a shuttle system... this is really difficult and needs many understandings in spaceplanes...\n\nso the apollo way should be the correct one..."},{"CreatedByName":"KingPhantom","CreatedById":110881,"CreatedDateTime":"2015-07-30T11:19:46Z","Content":"it sucks really hard that hardcore aerobraking on laythe and jool after an interplanetary travel is absolutly impossible... i explode miliseconds after atmospheric entry. is that a bug?"},{"CreatedByName":"X-SR71","CreatedById":108775,"CreatedDateTime":"2015-07-30T11:48:47Z","Content":"Don\u0027t count on aerobraking straight from interplanetary.\n\nFor a lander, I\u0027d make a small plane that could land on chutes/air brakes, and then get back into orbit on its own. Jets are very useful in Laythe! A lander that\u0027s actually a plane is super fun to make too.\n\nYou\u0027d just need an interplanetary tug with an LV-N to push that plane into Laythe and then come back. Don\u0027t forget to factor in injection burns (braking from interplanetary).\n\nThe biggest challenge here is making sure your small plane can make it back into Laythe\u0027s orbit. \n\nAlso, I\u0027d leave the ions idea behind. They don\u0027t work well up there in Jool\u0027s orbit.."},{"CreatedByName":"MadChris48","CreatedById":112853,"CreatedDateTime":"2015-07-30T12:10:23Z","Content":"Totally possible in one launch.\n\nThis thread should get you well on your way. [SSTO to Laythe and beyond](https://forum.kerbalspaceprogram.com/threads/117415-SSTO-to-laythe-and-beyond)\n\nGood luck!"},{"CreatedByName":"KingPhantom","CreatedById":110881,"CreatedDateTime":"2015-07-30T12:20:33Z","Content":"**Don\u0027t forget to factor in injection burns (braking from interplanetary).**\n\ni have calculated 1000-2000m/s. but i think thats to low.\n\ni have no idea to build a plane... and also with all that science. is it possible to build a lander thug with jet engines and aerospikes?"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-30T13:59:26Z","Content":"Laythe has biomes now, you\u0027ll have a hard time getting \\*all\\* the science, though carrying enough jet fuel should let you fly around the place a lot.\n\n\u0022for a jool-transfer out of the window it needs 5685m/s (935m/s to leave kerbin - 2700-2750m/s hohman to jool - 1000-2000m/s for laythe capture and orbit without aerobreaking...\u0022\n\nIt doesn\u0027t need anywhere near that much.\n\nYou don\u0027t leave kerbins SOI, and then do a hohmen to jool, you do a hohman to jool from LKO, and it only takes 1990 m/s...\n\nThat is already 1,600 m/s less than what you planned on using.\n\nThen for small burns (like really tiny RCS puffs), a gravity assist from tylo can get you captured around Jool (I don\u0027t know if a diret laythe capture is feasible or not... make sure ot come from behind and not head on). From there you can aerocapture at laythe and then gradually bring your apoapsis down (or you can leave your return transfer stage in a highly eliptical orbit for a cheaper return, and just continue to aerobrake your lander).\n\nYou don\u0027t need to make a plane to make use of the airbreathing engines, they work even better on laythe since the TWR is higher, and orbital velocity is lower.\n\nWith some airbreathers, its really easy to get back to orbit.\n\nAirbreathers aren\u0027t as ridiculously OP as before, but they are still so efficient, that practically you only need about 500m/s of rocket dV on your lander to make orbit again."},{"CreatedByName":"KingPhantom","CreatedById":110881,"CreatedDateTime":"2015-07-30T14:36:12Z","Content":"1990m/s is in the window. but i dont want to wait or warpt to that. so i have to leave kerbin first because i wont wait 1y in LKO with 10x warp.... i often use that way. it makes it harder but not impossible\n\ni have no idea about spaceflight. all laythe missions are spaceplanes... argh. i have to learn that... i\u0027m not able to do a efficient orbit from the runway without loosing control oder wasting fuel with ....ty flightpaths"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-07-30T14:47:34Z","Content":"\u0022because i wont wait 1y in LKO with 10x warp\u0022\n\nYou can warp at maximum speed from the tracking station.\n\nThe only way to get to the window faster is to move to a lower orbit, which if you\u0027re tryng to to a bi-elliptic transfer, won\u0027t be so bad on fuel (but for the ratio of orbits, the standard hohman is better than the bi-elliptic one)\n\n\u0022all laythe missions are spaceplanes.\u0022\n\nNot true.\n\nAs I said, you can just use the jet engines, but no wings, just fly it like a rocket.\n\nYou can use an aerospike for the liftoff, and then as you pitch over into the gravity turn, shut it off as soon as your jet engines are supplying sufficient thrust.\n\nThen when your jets cut out, use the aerospike again to get into orbit."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-07-30T15:04:39Z","Content":"Beware that new aero is nearly the same as kerbin. Your lander could flip.\n\nI\u0027ve experienced that on Duna which has a much lower atmo. I modified my generic lander and add chutes. It went very well, but around 10km, the lander wanted to flip.\n\nThis lander is note capable of taking off Laythe (it\u0027s fitted with a Terrier), but I can imagine that it\u0027s design would make it flip in atmo.\n\nBest way is to test your lander at Kerbin."},{"CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-07-30T15:09:01Z","Content":"\u003E \n\u003E it sucks really hard that hardcore aerobraking on laythe and jool after an interplanetary travel is absolutly impossible... i explode miliseconds after atmospheric entry. is that a bug?\n\nI understand it\u0027s not technically a bug but a consequence of the way aero heating was modeled for the current version. They wanted to make reentry at Kerbin difficult, which had the side effect of making interplanetary aerobraking very, very difficult. Not impossible though."},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-07-30T15:13:06Z","Content":"This is how you should approach Laythe in order to aerobrake at it\n\n[![19527483716_90343f3f77_o.png](https://farm1.staticflickr.com/361/19527483716_90343f3f77_o.png)](https://flic.kr/p/vKzszJ)[laythe approach](https://flic.kr/p/vKzszJ) by [cantab314](https://www.flickr.com/photos/52548818@N05/), on Flickr"},{"CreatedByName":"X-SR71","CreatedById":108775,"CreatedDateTime":"2015-07-30T16:09:45Z","Content":"Thank you for that highly technical, elaborate, visual explanation. ![:rolleyes:](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_rolleyes.gif)"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-07-30T16:46:57Z","Content":"I made a shuttle-style vessel capable of completing this mission in one launch without refueling or docking. Two crew, all the science equipment and an antenna, nuclear engine for orbital stuff and Rapiers for the Laythe ascent. Includes rocket boosters for lift into LKO, can put the spaceplane there fully fueled. \n\n\u003E ![screenshot819.png](https://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot819.png)\n\u003E ![screenshot820.png](https://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot820.png)\n\u003E \n\u003E ![screenshot822.png](https://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/screenshot822.png)\n\n[Craft file](https://dl.dropboxusercontent.com/u/61004449/ksp/1.0.4/LaytheScience.craft) if you\u0027d like to try it. Trickiest part will probably be the Jool transfer burn, the TWR in LKO is pretty low."},{"CreatedByName":"KingPhantom","CreatedById":110881,"CreatedDateTime":"2015-07-31T12:09:20Z","Content":"thx for all your help. i will try that again. to hit laythe like cantab shows is very difficult..."},{"CreatedByName":"jkool702","CreatedById":146465,"CreatedDateTime":"2015-07-31T14:13:27Z","Content":"When you say you dont want to refuel in the mission does that also mean you would be against having an ISRU on the lander and topping off the lander on Laythe?\n\nIn 1.0.2 I built a huge lander with 8x rockomax 64 tanks (the orange ones) and 32 aerospikes (4 on each tank) specifically for a laythe landing that is capable of doing what you are asking and more. Since it can top off on the ground it can visit multiple biomes, and it has the TWR and deltaV to get a VERY large payload off the ground and back into laythe orbit."},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-07-31T14:50:16Z","Content":"\u003E \n\u003E thx for all your help. i will try that again. to hit laythe like cantab shows is very difficult...\n\nMy approach is to set up a course correction, just after you enter Jool\u0027s SOI is good. Then you can trade pro/retrograde and radial/antiradial burns so that your Jool periapsis stays level with Laythe\u0027s orbit but the *time* you reach that periapsis at changes. It takes a bit of fiddling but you should eventually get a Laythe encounter."}]}