{"TopicId":117303,"ForumId":16,"TopicTitle":"Problem with manned re-usable launch vehicle","CreatedByName":"tent405","CreatedById":107426,"CreatedDateTime":"2015-07-31T05:24:58Z","PageNum":1,"Articles":[{"CreatedByName":"tent405","CreatedById":107426,"CreatedDateTime":"2015-07-31T05:24:58Z","Content":"This is my first time posting here for a problem I\u0027ve been having with KSP, so excuse me for lack of conciseness.\n\nI have developed a craft which uses twin ram-jets launched from the VAB, to deposit a satellite into orbit. To save money. To save DV on polar/reverse orbits.Because rockets are wasteful. , etc. \n\nThe **problem** I\u0027m having is that, despite the existence of *somewhat unreliable* autopilot mechanisms *which I don\u0027t fully know how to use* it is still very dangerous to launch this craft to APO, burn to orbit, and return to fly the launch vehicle back down to solid land. \n\n**Manned craft on a re-entry trajectory randomly get killed**. This happens when I\u0027m doing an initial orbital insertion burn flying a probe. After the launch vehicle detaches. Usually within two minutes. The re-entering manned vehicle is still well above 50k, but it\u0027s either not there in map view, not there in center, dead or bugged stuck still. \n\nSo I have three questions, all of which can be answered by someone more experienced with these types of problems:\n\n- How can I reliably instruct a probe to execute a maneuver and return to control my launch vehicle back down to the groundd\n- In what ways is it possible to control two vehicles at once autonomously per program (need to wait for unity upgrade/engine problems?)\n- How can I tell the engine not to kill craft on a re-entry trajectory if they contain Kerbals?\n\n[Here\u0027s a craft file link](http://kerbalx.com/crafts/4086/)\n\nay\n\nAnd an image of the problem before I burn the probe for insert and lose the craft\n\n![ZnT9lfX.png](http://i.imgur.com/ZnT9lfX.png)\n\n**Edited \u003Ctime datetime=\u00222015-07-31T15:43:16Z\u0022 title=\u002207/31/2015 03:43  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 31, 2015\u003C/time\u003E by tent405**"},{"CreatedByName":"Logris","CreatedById":99103,"CreatedDateTime":"2015-07-31T06:04:26Z","Content":"You can only control one vessel at a time, all other vessels outside the physics range of the active vessel (25km I think) are put \u0022on rails\u0022.\n\nThis means that their trajectory is fixed on a pre-calculated orbit.\n\nThere are no physics calculations done on them, therefore they can\u0027t execute a burn at some future time.\n\nIf a vessel is outside the physics range, and inside the atmosphere, it is assumed to crash or burn up and is destroyed.\n\nThis will be what you are experiencing, while you\u0027re controlling the satellite the launcher gets \u003E25km away and enters the atmosphere (70km).\n\nMaybe what you can do is raise the Ap of the satellite to say 150km to give you time to fly the launch vehicle all the way back to land, and then switch back to the satellite in time to circularize it."},{"CreatedByName":"steve_v","CreatedById":69272,"CreatedDateTime":"2015-07-31T06:31:28Z","Content":"Yeah, you\u0027ll need a [mod](https://forum.kerbalspaceprogram.com/threads/80292-1-0-2-Flight-Manager-for-Reusable-Stages-%28FMRS-v1-0-00%29) for that ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"Lelitu","CreatedById":146287,"CreatedDateTime":"2015-07-31T06:59:53Z","Content":"Logris has the cause right.\n\nEasiest solution here is to not undock the satellite until the whole thing is in a stable orbit. If the spaceplane is in a stable orbit (above 70km) then it will still be there, no matter how much later you choose to come back to it."},{"CreatedByName":"Sharpy","CreatedById":145504,"CreatedDateTime":"2015-07-31T07:56:14Z","Content":"\u003E \n\u003E You can only control one vessel at a time, all other vessels outside the physics range of the active vessel (25km I think) are put \u0022on rails\u0022.\n\u003E [snip]\n\u003E \n\u003E This will be what you are experiencing, while you\u0027re controlling the satellite the launcher gets \u003E25km away and enters the atmosphere (70km).\n\nAbout 2.5km. 2.2 is the entering range, around 2.5 is the departing range.\n\nJust skimming the atmosphere doesn\u0027t do anything to a vehicle \u0022on rails\u0022. You need some percentage of the pressure - on Kerbin that\u0027s altitude of about 23km where the craft \u0022on rails\u0022 is destroyed. (if you have a craft without power, with too low periapsis, say, in range of 40km, to save it from falling switch away to KSC or other craft before it enters the atmosphere, and it will circle Kerbin as if there was no atmosphere there)."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-07-31T09:32:34Z","Content":"Can you tweak your launcher to do the insertion burn on its own THEN release the payload ? That way, the launch stage would be on a stable orbit and you could deorbit it when ever you want.\n\nI\u0027m using this technique with my [SSTO launcher series](https://forum.kerbalspaceprogram.com/threads/123195)\n\nThe other advantage of this solution is the payback value : you can tweak your landing zone to get 96%-98% of the dry cost, instead of 20%-50% if you keep on a suborbital trajectory (you\u0027ll end far from KSC). My average return value is 97,5% of dry cost (less than 100km of KSC). KSC landing is 98%. Launchpad is 100%. \n\nRocket SSTO launchers are very cheap and easy to design. They are scalable. \n\nTo get the launch cost to LKO\n\n - detach payload : that gives you \u0022stage wet price\u0022\n\n - remove fuel from all tanks : that gives you \u0022stage dry price\u0022 \n\n - LKO price = Stage wet price - 97% \\* stage dry price\u0022 (not including payload cost)"},{"CreatedByName":"tent405","CreatedById":107426,"CreatedDateTime":"2015-07-31T15:42:24Z","Content":"The launcher is just a very light, very fast jet that doesn\u0027t work in space (still waiting on R.A.P.I.E.R.\u0027s ).\n\nI will either adjust my mission parameters to compensate or use the FMRS plugin\n\nThank you for the help answering my question about the physics engine."},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2015-07-31T19:30:56Z","Content":"\u003E \n\u003E The launcher is just a very light, very fast jet that doesn\u0027t work in space (still waiting on R.A.P.I.E.R.\u0027s ).\n\u003E I will either adjust my mission parameters to compensate or use the FMRS plugin\n\u003E \n\u003E Thank you for the help answering my question about the physics engine.\n\nTry to add rocket engines on your assembly. Don\u0027t use any decoupler (except for the payload when in orbit). You should get a more expensive launcher, but at 97% (of dry cost) free. It\u0027s better than a cheaper launcher you get 20% or 0% back.\n\nBut then, as you use if for launching satellite, the return value might not be worth the effort. I usually don\u0027t use SSTO rocket for payloads under 30tons.\n\nFew minutes ago, I just sent to LKO a 100T payload ready to depart for Dres (space station, lander, return vehicle and refueller)"}]}