{"TopicId":117959,"ForumId":16,"TopicTitle":"Interplanetary Transfer","CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-08T15:44:29Z","PageNum":1,"Articles":[{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-08T15:44:29Z","Content":"Not sure where to ask this as it is a question about how to best do transfers but also about if certain mods are displaying the right info.\n\nBackstory, playing a New Horizon planet pack game. Kerbin is a moon around a gas giant with 3 other moons. Thus starting from the beginning you gotta use good transfer windows or end up wasting a lot of fuel.\n\nGiven that I have Transfer Window Planner (TWP), Kerbal Engineer (KER) and Precise node (PN). But it seems like I\u0027m either doing something wrong or that one of these mods doesn\u0027t really support what I\u0027m trying to do.\n\nSo I setup a secondary test game with the bare minimum mods in order to test everything out and throw mechjeb in for testing.\n\nThe following image is of the transfer I get from TWP. As you can see from the PN window i put the UT in, the Prograde and the Normal as per the transfer info. But the ejection orbit is way out of whack. Am I using TWP wrong? Or do I have the node created incorrectly?\n\n![ve5vqwj.png](http://i.imgur.com/ve5vqwj.png)\n\nOne other thing to note is that the KER Rendezvous window shows a Phase Angle of -302. This can\u0027t be the Planet Phase Angle can it? It never goes into positive numbers.\n\nPrecise Node has Ejection Angle, but that doesn\u0027t seem to match up with TWP\u0027s angle. I\u0027m thinking it might be because PN splits it into 180 degree prograde/retrograde.\n\nIs there a way to see Ejection Heading?\n\nI feel like a lot of these are basic questions I should know. I have successfully completed transfer to Duna, Eve, Moho and others before, but it has been a while. I\u0027ve also tried following several of the transfer tutorials here but to no avail.\n\nAny help or pointers would be appreciated.\n\n~Edit - Wanted to add that I tried MechJeb transfer node creation and it was hit or miss on it working right. Though it was better than my previous attempts.\n\n**Edited \u003Ctime datetime=\u00222015-08-09T18:46:30Z\u0022 title=\u002208/09/2015 06:46  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 9, 2015\u003C/time\u003E by Nori**"},{"CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2015-08-08T16:14:26Z","Content":"I use the protractor mod.....this is brilliant imo and below is a link to the video where I learnt how to use it. Hope it helps you ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\n[https://youtu.be/byiCYbFBx20](https://youtu.be/byiCYbFBx20)"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-08-08T16:42:16Z","Content":"\u003E \n\u003E As you can see from the PN window i put the UT in, the Prograde and the Normal as per the transfer info. But the ejection orbit is way out of whack.\n\nThis is where you are going wrong. Having the node at the correct ejection angle is much more important than hitting the transfer time at the exact second. Given that a low Kerbin orbit has a period of about 30 minutes, the best place for the node might be \u002B/- 15 minutes from the ideal transfer time (and much more if the orbit is higher, like in your screenshot it would be \u002B/-32 minutes). Don\u0027t worry about being off the time by a bit, the ejection angle is what you are trying to hit."},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-08T16:56:50Z","Content":"Hmm, ok. If I follow that advice I get this:\n\n![9GNqOvg.png](http://i.imgur.com/9GNqOvg.png)\n\nAs far as I can tell I\u0027m following TWP as close as possible. The angle is 0.05 degrees from prograde, the phase angle for the planet it pretty close too.\n\nDecided to see what MechJeb came up with:\n\n![ZICp0NH.png](http://i.imgur.com/ZICp0NH.png)\n\nWhat it created doesn\u0027t even seem close to what TWP was trying. 44 degree ejection angle and a extra 100 deltav.\n\nSuper frustrating.\n\n@ maceemiller - Thanks for the advice. I will try it out, though I would prefer to attempt this via maneuver nodes.\n\n**Edited \u003Ctime datetime=\u00222015-08-08T16:59:00Z\u0022 title=\u002208/08/2015 04:59  PM\u0022 data-short=\u00228 yr\u0022\u003EAugust 8, 2015\u003C/time\u003E by Nori**"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-08-08T17:03:42Z","Content":"Your TWP attempt restricts your departure time to that day, is that intended? That\u0027s likely about as good a transfer as is possible with that constraint. If you make the departure restrictions broader it should give you a more efficient transfer.\n\nI can\u0027t really tell what is happening in the MJ screenshot, sorry."},{"CreatedByName":"maceemiller","CreatedById":130574,"CreatedDateTime":"2015-08-08T17:08:47Z","Content":"No worries mate, just hope you get it sorted ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-08T17:12:28Z","Content":"I did intend to restrict it. Considering how close the Mun in this pack actually is, there is reasonable transfer pretty much every day.\n\nJust tried it again with a 3 day window and getting similar results.\n\nThe mechjeb screenshot is pretty busy since I have all these mods I\u0027m trying to collaborate info on. But the gist of it is I did a MechJeb porkchop and had it create a maneuver node at nearly the exact same time as TWP recommended, but it comes up with a node that ejects at 43.99 degrees and 825 deltav, vs the TWP\u0027s 0 degree angle and 713 deltav. The MechJeb node works and gets a nearly perfect encounter, but no matter how I tweak the UT on TWP it never even gets close.\n\nI guess it is just seeming to me like TWP isn\u0027t giving me the right information. I\u0027m going to try it on a transfer from Sonnah to another planet and see what happens."},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-08-08T17:24:13Z","Content":"Sorry, was looking at the screenshots the wrong way, I thought the outer planet was the target (not really used to planet packs). \n\nAFAIK both TWP and MJ use alexmoon\u0027s algorithm to determine transfers, but it definitely looks like there\u0027s a difference in the implementation."},{"CreatedByName":"Weywot8","CreatedById":146603,"CreatedDateTime":"2015-08-08T17:41:33Z","Content":"Maybe one of the reasons MechJeb is giving a different answer is because it just gives lowest delta-V to arrive and ignores insertion costs. And it typically aims you directly at the center of the target.\n\nAlso, did you click on Lowest deltaV instead of ASAP? From the MJ pockchop plot, the lowest deltaV window seems to be one Mun-Kerbin orbital period in the future based on intense blueness to the right vs the \u0022leave anytime now\u0022, steep trajectory and short transit time based on the screenshot.\n\nThe MJ plot is \u0027wonky\u0027 because there is a relative inclination difference. In these circumstances, the lowest burn to get somewhere for a given departure date and transit time can be highly inclined - especially as MJ ignore insertion costs. Some of those points on the porkchop probably sends you out of plane, arcing at high latitudes over the gas giant to get to the Mun while it\u0027s somewhere on the other side."},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-08T17:46:34Z","Content":"Yeah it would seem that way. Rather confusing.\n\nFor testing I figured I would try a more \u0022standard\u0022 transfer. Going from a 55000km Sonnah orbit to Laythe, which in this pack is the planet right next to it.\n\nI setup TWP with a year window and 600 day travel time. It came up with a transfer that happened to be rather soon. I put the info in and it had the ejection angle going to outer planets, not the next closest inner planet. \n\nSo as you suggested I changed the departure time to make sure the angle was closer. Precise node is reading 174.54 from retrograde which I guess is a wee bit off. Anyway, changing that made it a lot closer, but the orbit is still funking. The inclination is all screwed up. \n\n![d0xCDM2.png](http://i.imgur.com/d0xCDM2.png)\n\nI then deleted that and setup a ASAP node with Mechjeb and it got a encounter right away.\n\nCan\u0027t say that I really want to use MechJeb as I\u0027d prefer to get into from TWP and make the nodes myself. But I just can\u0027t seem to get the info from TWP to plug in right.\n\n~edit:\n\n\u003E \n\u003E Maybe one of the reasons MechJeb is giving a different answer is because it just gives lowest delta-V to arrive and ignores insertion costs. And it typically aims you directly at the center of the target.\n\u003E Also, did you click on Lowest deltaV instead of ASAP? From the MJ pockchop plot, the lowest deltaV window seems to be one Mun-Kerbin orbital period in the future based on intense blueness to the right vs the \u0022leave anytime now\u0022, steep trajectory and short transit time based on the screenshot.\n\u003E \n\u003E The MJ plot is \u0027wonky\u0027 because there is a relative inclination difference. In these circumstances, the lowest burn to get somewhere for a given departure date and transit time can be highly inclined - especially as MJ ignore insertion costs. Some of those points on the porkchop probably sends you out of plane, arcing at high latitudes over the gas giant to get to the Mun while it\u0027s somewhere on the other side.\n\nHmm, that definitely could play a part in it. The mechjeb node does look like it would take a lot of deltav to circularize."},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2015-08-08T19:23:05Z","Content":"Do you know that you can set a kac-alarm directly from twp and copy the figures from the alarm details into precise node via cut\u0026paste. Usually needs a few corrections as well ...\n\nk"},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-08T20:53:30Z","Content":"Hmm, not seeing that option."},{"CreatedByName":"Green Baron","CreatedById":107381,"CreatedDateTime":"2015-08-08T23:20:24Z","Content":"In TWP click \u0022Add KAC Alarm\u0022. In KAC then click on the alarm to view the details (Message), there is everything."},{"CreatedByName":"Nori","CreatedById":41334,"CreatedDateTime":"2015-08-09T17:36:31Z","Content":"I see, no that was what I was doing.\n\nSo after much experimenting and searching I ran across this: [http://imgur.com/a/ttW9p#0](http://imgur.com/a/ttW9p#0)\n\nUsing that method I\u0027ve been able to get encounters fairly easy now.\n\nI also discovered that the Kerbal Alarm Clock transfer alarm seems to give me a good ballpark making the TWP uneeded."}]}