{"TopicId":120529,"ForumId":16,"TopicTitle":"Resource Scanning","CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-09T19:16:36Z","PageNum":1,"Articles":[{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-09T19:16:36Z","Content":"\n\u003Cp\u003ELooking for guidance on scanning. I had a satellite in Munar orbit with an M700 scanner. The first one exploded while establishing a polar orbit. The second attempt worked fine. I picked a spot with 80% resources according to the long range scanner. Marked the spot with a scout probe. HyperEdited my Mun Base nearby on a flat spot. My first ever HyperEdit. I know its cheating to many of you. I have built orbiting stations one part at a time. I can. I chose not to, this time. Anyway - HyperEdit isn\u0027t as easy as I thought it would be. My base was fine in orbit but upside down at the surface. Had to use RCS thrusters to rotate it before it touched down. None of the controls seemed to work as expected but I managed after several attempts. \u003C/p\u003E\u003Cp\u003EMy scout ship had rover wheels and a surface scanner so I tried to figure out how to use it. I still don\u0027t get it. It only seems to read what I\u0027m sitting on top of at the moment. I might be only a few meters from a rich vein but I couldn\u0027t tell. Am I missing something? \u003C/p\u003E\u003Cp\u003EWhile messing with the surface scanner, my in orbit satellite exploded, again. Cool fireball, but seriously? Since I had to launch another anyway, I added the narrow scanner. Back to polar orbit. Surface scan now shows only 50% resources at the spot I chose. sigh. Tried to use the narrow scanner - it does not seem to work anywhere near as I thought it should. Apparently I have to be directly over the area to scan. I don\u0027t have the fuel to change inclination again.\u003C/p\u003E\u003Cp\u003EI don\u0027t mean to complain but I guess I am. It seems to me if the scanner can see an area (meaning it is on the correct side of the moon) I should be able to mouse over and direct it to scan the point I select. Maybe that is too simplistic? As it stands, it appears the narrow band scanner needs its own satellite as the polar orbit will take forever to hit the right spot and I will have to stay with it while it scans as there is no way to save a location scan area. If I could give it a target area and move on to something else while waiting that would work for me. I\u0027m really not seeing how to make this practical. Tell me, is there an easier way? I am pretty sure I have read where some of you mount the narrow band and the surface scanner on a rover. Does that work?\u003C/p\u003E\u003Cp\u003EAs soon as I narrow down where to drill I will launch a few drilling platforms and a refuel hauler.\u003C/p\u003E\u003Cp\u003EIn the meantime here is a picture of Jeb, Bill, and Bob outside Mun Base Alpha. Yeah, I know its cliche, but I bet I\u0027m not the only one to give this name to their first base. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/R3bV0rT.jpg\u0022 alt=\u0022R3bV0rT.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T21:32:38Z\u0022 title=\u002209/09/2015 09:32  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by Red Shirt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-09-09T19:44:54Z","Content":"\n\u003Cp\u003EThere are a handful of tutorials that cover stock scanning, I made \u003Ca href=\u0022https://github.com/S-C-A-N/SCANsat/wiki/Stock-Resource-Scanning\u0022 rel=\u0022external nofollow\u0022\u003Eone here as part of SCANsat\u0027s documentation\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EIt basically works as you\u0027ve described, the M700 gives a sort of gross overview of resource distribution on a planet, but it\u0027s not very accurate. The narrow band scanner gives an accurate picture of the resource distribution, but only over a very limited area, and only for your current location. \u003C/p\u003E\u003Cp\u003EThe only point to add is about the surface scanner; it is meant to improve the accuracy of the other scans. Before scanning a biome from the surface the other resource displays will only show you the average resource concentration for that biome. After surface scanning it will show you the real value, which can differ by quite a bit. You don\u0027t really have to scan every biome to find the best space to drill, the initial scan from the M700 should give a decent idea of where the highest concentrations are.\u003C/p\u003E\u003Cp\u003EBut really, if you want more accurate resource scanning you should use SCANsat. There are several options to control how resource scanning works. At the default settings there is no need for any additional scanning for resources, it just provides better tools for how to see what you have already scanned.\u003C/p\u003E\n"},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-09T20:15:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DMagic\u0022 data-cite=\u0022DMagic\u0022\u003E\u003Cdiv\u003EThere are a handful of tutorials that cover stock scanning, I made \u003Ca href=\u0022https://github.com/S-C-A-N/SCANsat/wiki/Stock-Resource-Scanning\u0022 rel=\u0022external nofollow\u0022\u003Eone here as part of SCANsat\u0027s documentation\u003C/a\u003E.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you. That was the clearest tutorial I have seen on the subject. I learned I did not need to relaunch the exploded satellite! \u003C/p\u003E\u003Cp\u003ECouple questions: \u003C/p\u003E\u003Cp\u003EThe result from the surface scanner is a more accurate average reading of the entire biome resource and not literally the exact spot of the probe? \u003C/p\u003E\u003Cp\u003EI noticed you have the surface scanner and the narrow band scanner on the same probe. Will the narrow band read on the surface or do I need to launch over the biome to read? Simplified - what is the minimum/maximum altitude for the narrow band scanner.\u003C/p\u003E\n"},{"CreatedByName":"Goomblah","CreatedById":143441,"CreatedDateTime":"2015-09-09T20:28:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Shirt\u0022 data-cite=\u0022Red Shirt\u0022\u003E\u003Cdiv\u003EThank you. That was the clearest tutorial I have seen on the subject. I learned I did not need to relaunch the exploded satellite! \u003Cp\u003ECouple questions: \u003C/p\u003E\u003Cp\u003EThe result from the surface scanner is a more accurate average reading of the entire biome resource and not literally the exact spot of the probe? \u003C/p\u003E\u003Cp\u003EI noticed you have the surface scanner and the narrow band scanner on the same probe. Will the narrow band read on the surface or do I need to launch over the biome to read? Simplified - what is the minimum/maximum altitude for the narrow band scanner.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe the surface scanner gives the ore readings for the area directly under the probe, and also improves NBS accuracy for that biome. The NBS has no minimum (maximum of 500km) altitude, and I don\u0027t think the scan area changes size or resolution based on altitude. I generally use the NBS in an equatorial orbit, since it covers a wide enough band that I generally wouldn\u0027t consider building a mining base outside of that band (since plane changes are gross). I then timewarp until the satellite is over the biome and general zone I want to land at, and then I use the scanner to identify the highest nearby ore concentration. I then write down those coordinates, then either use MechJeb\u0027s landing/rover autopilot or, for stock-only, a rover with the surface scanning module to drive to those coordinates, and mark it with either a flag or the rover itself. I then have a target I can set for landing, right on top of the ideal spot.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T20:31:41Z\u0022 title=\u002209/09/2015 08:31  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by Goomblah\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2015-09-09T20:31:02Z","Content":"\n\u003Cp\u003EThe surface scanner will give the accurate resource concentration for your current location as long as you are below 1000m. If you haven\u0027t scanned that biome it will say (x% avg.), but the value it shows is accurate, whereas the narrow band scanner will truly show the average value for that biome until you do the surface scan. It\u0027s kind of confusing because of the way it still says avg., but you can test it by putting both on the same vessel.\u003C/p\u003E\u003Cp\u003EThere is no minimum altitude, if you are landed the resource scanners will always work. The maximum altitude might be shown in the VAB info panel, or you might have to look at the config file. I think the narrow band scanner\u0027s max altitude is 500km, the surface scanner\u0027s is 1km. Some resource scanners from other mods have a max value of 1m, which basically means it only works while landed. The narrow band scanner\u0027s map also works on the surface, it can be helpful if you have a rover and want to find the absolute best location.\u003C/p\u003E\n"},{"CreatedByName":"Ripper2900","CreatedById":146418,"CreatedDateTime":"2015-09-09T21:28:55Z","Content":"\n\u003Cp\u003EOnce you\u0027ve done the broadband scan, you have some rough ideas as to where to look. \u003C/p\u003E\u003Cp\u003EThen bring a narrow-band scanner to these places and while watching, look for biomes with high average concentration. Now land there and do a surface scan. You can then go to the narrow-band ui and see the actual concentrations for that biome. \u003C/p\u003E\u003Cp\u003EI restrict my searches to very near the equator if possible, because i\u0027m on refuel missions or my mothership which is on a grand tour of the kerbolar-system. Changing planes with that behemoth or with the miner full of ore is too expensive. If I can find spots of more than 5-6% I\u0027m happy. \u003C/p\u003E\u003Cp\u003EI still don\u0027t know what the cutoff percentage in the map overlay actually represents, but I think that it might be the: \u0022biome-average concentration relative to the max concentration of any spot on that planet\u0022\u003C/p\u003E\n"},{"CreatedByName":"Red Shirt","CreatedById":147465,"CreatedDateTime":"2015-09-09T21:31:38Z","Content":"\n\u003Cp\u003EThanks all of you. I think I get it now. If not, I\u0027ll be back.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-09T21:36:37Z\u0022 title=\u002209/09/2015 09:36  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 9, 2015\u003C/time\u003E by Red Shirt\u003C/strong\u003E\n\u003C/span\u003E\n"}]}