{"TopicId":121210,"ForumId":16,"TopicTitle":"Cannot Auto-Warp So Far","CreatedByName":"dresoccer4","CreatedById":141944,"CreatedDateTime":"2015-09-19T01:49:41Z","PageNum":1,"Articles":[{"CreatedByName":"dresoccer4","CreatedById":141944,"CreatedDateTime":"2015-09-19T01:49:41Z","Content":"\n\u003Cp\u003EI tried searching for this but turned up squat. However it may be because i\u0027m a bad searcher \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy question is: when i have an intercept course laid into a distant planet, i cannot auto-warp (it says \u0022Cannot Auto-Warp So Far\u0022), however I am not trying to warp very far. Even if i try to auto-warp just a little bit in front of me it won\u0027t work. \u003C/p\u003E\u003Cp\u003ESo I know what\u0027s happening, after my course intercepts the planet, the course after it \u003Cem\u003Eleave\u003C/em\u003E the planet is slightly altered. So on the map view there are actually 2 courses side by side. When I try to auto-warp, it always selected the 2nd course (which is incredibly far away after orbiting Kerbol).\u003C/p\u003E\u003Cp\u003EAny tip or key-combo that will help select your \u003Cem\u003Ecurrent \u003C/em\u003Ecourse?? This is also an issue when trying to select two ships that are close together, maybe the solution will hit two birds with one stone!\u003C/p\u003E\u003Cp\u003EMuch obliged, folks!\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-09-19T01:57:56Z","Content":"\n\u003Cp\u003EIt\u0027s done this for me when you\u0027re changing SOIs between where you are and where you\u0027re trying to warp to. The auto-warp can\u0027t warp through an SOI boundary for some reason (probably because it needs to do some physics calculations when you enter or leave an SOI - notice the slight lag when this happens and the navball switches?), so it just says no.\u003C/p\u003E\u003Cp\u003ETry warping up to the edge of your current SOI, then manually warp/real-time it just past it, then auto-warp again.\u003C/p\u003E\u003Cp\u003EEdit: So I should have read the whole OP instead of trying to be too smart. I\u0027ve had the same trouble with close/parallel courses and slightly altered projected courses. I\u0027d be interested in a solution if anyone has one, but I\u0027m afraid I don\u0027t. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit edit: Well actually... the parallel courses one, if you go to Map view, bring up the navball (for some reason it\u0027s finicky if you dont do this) and deselect the ship type that\u0027s on the parallel course from the pulldown menu at the top (as long as it\u0027s different from your own ship) that should help u select your own path. The only issue here is u won\u0027t be able to see the other ship anymore, which could be a problem if you\u0027re trying to rendezvous with it - u\u0027ll have to keep switching on and off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-19T02:02:34Z\u0022 title=\u002209/19/2015 02:02  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 19, 2015\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dresoccer4","CreatedById":141944,"CreatedDateTime":"2015-09-19T04:36:54Z","Content":"\n\u003Cp\u003Ethanks for the quick response. in regards to your answer about the parallel trajectories, the ships are usually the same type, but that\u0027s a good idea anyway. i hope someone has an answer to this mystery!\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2015-09-19T14:31:39Z","Content":"\n\u003Cp\u003EYou could try zooming way in to see if you can select the blue orbit line instead of the purple line. I don\u0027t know if this will work, but it sure is frustrating when the game interface will not let you click on the thing you\u0027re trying to click on.\u003C/p\u003E\u003Cp\u003EI\u0027m really hoping this is one of the things that gets resolved in the UI rewrite.\u003C/p\u003E\u003Cp\u003EHappy landings!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-19T14:35:16Z\u0022 title=\u002209/19/2015 02:35  PM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 19, 2015\u003C/time\u003E by Starhawk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dresoccer4","CreatedById":141944,"CreatedDateTime":"2015-09-19T15:39:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Starhawk\u0022 data-cite=\u0022Starhawk\u0022\u003E\u003Cdiv\u003EYou could try zooming way in to see if you can select the blue orbit line instead of the purple line. I don\u0027t know if this will work, but it sure is frustrating when the game interface will not let you click on the thing you\u0027re trying to click on.\u003Cp\u003EI\u0027m really hoping this is one of the things that gets resolved in the UI rewrite.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problem is that once you zoom in far enough to be able to click the blue line, you\u0027re not gonna get to warp very far. kinda defeats the purpose of warp. keep the ideas comin\u0027! i wonder how the devs overcome this problem..?\u003C/p\u003E\n"},{"CreatedByName":"More Boosters","CreatedById":147303,"CreatedDateTime":"2015-09-19T16:10:15Z","Content":"\n\u003Cp\u003EYou can auto warp to a second SoI, but you can\u0027t autowarp to a third SoI. That\u0027s what so far means.\u003C/p\u003E\n"},{"CreatedByName":"dresoccer4","CreatedById":141944,"CreatedDateTime":"2015-09-19T16:21:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022More Boosters\u0022 data-cite=\u0022More Boosters\u0022\u003E\u003Cdiv\u003EYou can auto warp to a second SoI, but you can\u0027t autowarp to a third SoI. That\u0027s what so far means.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ei just want to warp further along my \u003Cem\u003Ecurrent\u003C/em\u003E SOI! but the 2nd orbit trajectory is so close to my current trajectory that the game defaults to selecting \u003Cem\u003Eit\u003C/em\u003E instead of you current trajectory. which doesn\u0027t make a lick of sense in my book.\u003C/p\u003E\u003Cp\u003Ei\u0027ll try and post a pic to clarify what i\u0027m talking about in a few minutes when I can set it up in KSP.\u003C/p\u003E\n"},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2015-09-19T19:57:28Z","Content":"\n\u003Cp\u003EIt\u0027s something I have trouble with too. Especially, as mentioned above when it\u0027s hard to select the blue orbit line rather than your predicted orbit after the maneuvere node. My two methods of solving the issue are;\u003C/p\u003E\u003Cp\u003E- keep the focus on your ship and try to zoom and move the view so the maneuvere node is just on screen near the middle. Then move the cursor in from the side nearest your current (blue) trajectory. That way its much easier to see when the icon changes to a blue dot, showing you have the right point selected. It can be fiddley sometimes.\u003C/p\u003E\u003Cp\u003E- I\u0027ve also only just discovered that changing focus to your destination shows your path through that bodies SOI (I\u0027ve played 2 and a bit months before finding that out!!??!!). From that view it can sometimes be easier to try the above.\u003C/p\u003E\u003Cp\u003E- When all else fails, I time warp manually. Always worth a save before doing that as I\u0027ve ruined a couple of promising missions by hitting \u0026gt; instead of \u0026lt;, panicking and hitting the wrong key repeatedly before realising my mistake. (Much more common when you forget to save - see Sods Law)\u003C/p\u003E\n"},{"CreatedByName":"Tarheel1999","CreatedById":123965,"CreatedDateTime":"2015-09-19T21:25:30Z","Content":"\n\u003Cp\u003E\u0022Focus view\u0022 on a planet/moon ahead of your ship (like the target celestial body) by clicking on it. Zoom in on your orbit and click on the blue line. This should allow you to zoom in enough to separate the orbits and be far enough in front of your vessel to be worth it.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2015-09-19T22:14:01Z","Content":"\n\u003Cp\u003EA workaround instead of actually fixing it, but maybe use Kerbal Alarm Clock?\u003C/p\u003E\n"}]}