{"TopicId":121874,"ForumId":16,"TopicTitle":"science science science","CreatedByName":"f.pelosa","CreatedById":151653,"CreatedDateTime":"2015-09-28T06:34:17Z","PageNum":1,"Articles":[{"CreatedByName":"f.pelosa","CreatedById":151653,"CreatedDateTime":"2015-09-28T06:34:17Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003EI\u0027m playing in science mode and I\u0027m stuck as I don\u0027t know how to make more science points. Any suggestion?\u003C/p\u003E\u003Cp\u003EThese my achievements:\u003C/p\u003E\u003Cp\u003E- explored several biomes on Kerbin (i.e. all places I reentered with my vessel, including water and exotic places (e.g. poles)\u003C/p\u003E\u003Cp\u003E- low and high orbit\u003C/p\u003E\u003Cp\u003EMun, a couple of times in different landing sites.\u003C/p\u003E\u003Cp\u003EIn these locations I examined goo, temperature, did EVAs and used the barometer.\u003C/p\u003E\u003Cp\u003EHow can I earn some more science?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003Cp\u003EF\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-14T18:10:32Z\u0022 title=\u002210/14/2015 06:10  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 14, 2015\u003C/time\u003E by f.pelosa\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-09-28T07:25:18Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOff the top of my head, here are some of the things you did not mention doing (some of these require tech unlocks or even building upgrades):\u003C/p\u003E\u003Cp\u003E- Crew reports (all situations, biome specific while landed)\u003C/p\u003E\u003Cp\u003E- Seismometer (landed only, but biome specific and decently high payout)\u003C/p\u003E\u003Cp\u003E- Gravioli detector (all situations except flying in atmosphere, high payout and biome specific \u003Cem\u003Eeverywhere\u003C/em\u003E)\u003C/p\u003E\u003Cp\u003E- \u0022Science Jr.\u0022 materials bay (all situations, biome specific while landed, bulky but very high payout)\u003C/p\u003E\u003Cp\u003E- Surface samples (landed only, but biome specific and very high payout)\u003C/p\u003E\u003Cp\u003EAlso verify that for the experiments you did do, you covered all the possible situations for that experiment. Not all experiments are available everywhere, and different experiments may be biome specific in different situations. You can often discern whether or not an experiment is biome specific by looking at the science report it generates (either while doing science or later-on in the science archives). A crew report taken in low Kerbin orbit report might say \u0022Crew report in space above Kerbin\u0022, while an EVA report in the same location might say \u0022EVA report in space above Kerbin\u0027s Grasslands\u0022. This indicates that crew reports are not biome specific in the \u0022low orbit\u0022 situation (but they might be in others), while EVA reports are (but they might not be in others).\u003C/p\u003E\u003Cp\u003EFinally, did you get the full payout for your experiments? Most of them only give a partial payout if you transmit them with an antenna. You only get the full payout by landing a vessel containing the performed experiment safely back on Kerbin and recovering it. Tip: You can repeat an experiment you already transmitted, and carry it back to Kerbin, where recovering it will give you the science you missed out on by transmitting. (A few experiments even give additional payout for repeatedly recovering them, but it\u0027s generally not worth to bother when you could be going to fresh locations instead.)\u003C/p\u003E\u003Cp\u003EBeyond that - you can get more science by visiting more locations. The Mun has 15 different biomes to visit. You haven\u0027t been to Minmus at all, which has 9 different biomes. You can also briefly dip a ship outside Kerbin\u0027s SoI to get high solar orbit science and then return; and after that, there are five other planets with seven moons to explore, each with multiple biomes of their own.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-28T07:35:34Z\u0022 title=\u002209/28/2015 07:35  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 28, 2015\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Guillotine","CreatedById":151209,"CreatedDateTime":"2015-09-28T07:26:05Z","Content":"\n\u003Cp\u003EYou should go to minmus and get all the sience you can out from it, its also easyer to land and get back than mun.\u003C/p\u003E\u003Cp\u003EIf you have acces to mobile prosessing lab id recommend using that to some degree ( all thou it requires tons of electrical charge ).\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-09-28T07:28:06Z","Content":"\n\u003Cp\u003EThere\u0027s also easy access to minimus and Kerbol.\u003C/p\u003E\u003Cp\u003EYou can also set up research bases and stations with the mobile research lab which converts data into science over time.\u003C/p\u003E\n"},{"CreatedByName":"Steelsunoa","CreatedById":135938,"CreatedDateTime":"2015-09-28T07:38:44Z","Content":"\n\u003Cp\u003EWell, if you can achieve a Mun landing and return you should be able to use the same, or similar, craft to go to Minums. Perhaps with your design you can get 2-3 biomes on Minmus in the same flight and still return. I assume you are doing crew reports, observing the science lab, and taking soil samples, despite not listing them. You should be getting plenty of science within your Kerbin/Mun/Minmus expeditions. You can use some biome maps found online or use an add-on, I prefer Kerbal Engineer Redux, to see the biome you are currently in/over to determine where you should target your next landing. Also, if you EVA in low orbit above the biomes you get science for each of those as well (not sure if you were already doing that). Keep exploring and bringing the data into the capsule, reset scientific tests that can be reset, and take more data.\u003C/p\u003E\u003Cp\u003EThis is an older video, but it may help.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/4prZNg0DAjM?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-28T08:03:43Z","Content":"\n\u003Cp\u003EYou shouldn\u0027t be having all that much trouble with science. \u003C/p\u003E\u003Cp\u003EPut yourself in a polar orbit of Kerbin and grab the EVA report as you travel over each of the 9 biomes (polar because the planet will turn underneath you allowing you to eventually get them all). The Mun has 15 biomes and you can do the same. This trick only works for the EVA Report and Gravity scans, those two are the only per-Biome science you can do in space. For a full breakdown, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Science\u0022 rel=\u0022external nofollow\u0022\u003Esee here\u003C/a\u003E and scroll down to the \u0027Activities\u0027 section.\u003C/p\u003E\u003Cp\u003EYou can complete tier 5 without going anywhere but the Mun and without even landing on it. I just did it this morning in fact and I still have 200 science left over.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-09-28T08:11:28Z\u0022 title=\u002209/28/2015 08:11  AM\u0022 data-short=\u00228 yr\u0022\u003ESeptember 28, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-09-28T15:47:51Z","Content":"\n\u003Cp\u003EBelow is a check list that I use for collecting science in the Kerbin system. I find it helpful because I can use it to keep track of what science I\u0027ve already collected and what new areas I should target. There are actually more biomes around KSC than what I\u0027ve got listed - each building is now its own biome.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.braeunig.us/pics/KSP/ScienceCheckList.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.braeunig.us/pics/KSP/ScienceCheckList.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn case you are unfamiliar with the \u0022low\u0022 and \u0022high\u0022 definitions, on Kerbin \u0022flying low\u0022 is below 18 km, \u0022flying high\u0022 is between 18 km and 70 km, \u0022in space low\u0022 is between 70 km and 250 km, and \u0022in space high\u0022 is between 250 km and the SOI. On Mun, the border between \u0022in space low\u0022 and \u0022in space high\u0022 is 60 km, and on Minmus the border is 30 km. The \u0022flying\u0022 definition is not applicable to Mun and Minmus because they don\u0027t have atmospheres. For the borders of other planets and moons, consult the Wiki.\u003C/p\u003E\u003Cp\u003EI also recommend that as you collect enough science to unlock a new technology, you should consider unlocking a technology that gives you a new science experiment.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2015-09-28T15:55:48Z","Content":"\n\u003Cp\u003EAny ship that can get to the Mun and back can get to Minmus and back. Lots of science over there. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-09-28T18:55:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E(some of these require tech unlocks or even \u003Cstrong\u003Ebuilding upgrades\u003C/strong\u003E)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENote that in science mode building upgrades are not applicable. Science mode beings with all the buildings at level 3. Building upgrades are required in career mode only.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-09-29T00:13:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OhioBob\u0022 data-cite=\u0022OhioBob\u0022\u003E\u003Cdiv\u003EBelow is a check list that I use for collecting science in the Kerbin system. I find it helpful because I can use it to keep track of what science I\u0027ve already collected and what new areas I should target. There are actually more biomes around KSC than what I\u0027ve got listed - each building is now its own biome.\u003Cp\u003E\u003Ca href=\u0022http://www.braeunig.us/pics/KSP/ScienceCheckList.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.braeunig.us/pics/KSP/ScienceCheckList.pdf\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIn case you are unfamiliar with the \u0022low\u0022 and \u0022high\u0022 definitions, on Kerbin \u0022flying low\u0022 is below 18 km, \u0022flying high\u0022 is between 18 km and 70 km, \u0022in space low\u0022 is between 70 km and 250 km, and \u0022in space high\u0022 is between 250 km and the SOI. On Mun, the border between \u0022in space low\u0022 and \u0022in space high\u0022 is 60 km, and on Minmus the border is 30 km. The \u0022flying\u0022 definition is not applicable to Mun and Minmus because they don\u0027t have atmospheres. For the borders of other planets and moons, consult the Wiki.\u003C/p\u003E\u003Cp\u003EI also recommend that as you collect enough science to unlock a new technology, you should consider unlocking a technology that gives you a new science experiment.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are missing some. There is a Surface: Landed and a Surface: Splashed condition. With lakes, rivers, shorelines, and islands, it is possible to get science for both conditions in all biomes (except KSC biomes of course). Also there are a lot more KSC biomes than that now.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-09-29T00:26:37Z","Content":"\n\u003Cp\u003EThere\u0027s no shortage of ways to earn science points, so really it depends what \u003Cem\u003Eyou\u003C/em\u003E like doing. You can exploit the Mun and Minmus for all the science they\u0027re worth if you like. Or you can be happy with a few landings there and head off to the other planets with either probes or Kerbals as you like. Or you can set up a station or base with the mobile processing lab, once it\u0027s operating and stocked with results you can get a couple of thousand bonus science out of that. Or, once you have wheels, you can spend your time driving round all the buildings at the space centre.\u003C/p\u003E\u003Cp\u003E(An idea for starting interplanetary: if you have a good Mun ship you can probably take it to Ike, the overall delta-V requirement is very similar.)\u003C/p\u003E\n"},{"CreatedByName":"f.pelosa","CreatedById":151653,"CreatedDateTime":"2015-09-29T10:09:32Z","Content":"\n\u003Cp\u003Ehi guys, thanks for the help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI figure I am probably missing something on the usage of the mobile lab.\u003C/p\u003E\u003Cp\u003EWhat I do is, I attach thermometers and goo bays to it, I analyse them and then I click on the yellow icon (shaped as a \u0027bottle\u0027). Few seconds later I get the results from the lab. I click on the green icon (the notepad) and that\u0027s it.. I go back home with the ship. How do I get it to produce results over time?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Guillotine","CreatedById":151209,"CreatedDateTime":"2015-09-29T10:59:52Z","Content":"\n\u003Cp\u003ETransfer data to the sience lab and then you right click the lab and press start research. It will prosess the data and produce x ammount sience per day. Then you can transmit that researched data back to KSP.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-09-29T11:29:57Z","Content":"\n\u003Cp\u003EThat only works if the mobile lab has one or more scientist kerbals in it. The more scientist ranks, the faster it runs.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-09-29T11:37:22Z","Content":"\n\u003Cp\u003EIt\u0027s kind of complicated and one of the \u0022game mechanic\u0022 aspects of KSP, by which I mean it\u0027s not obviously based on real physics. For a high level overview, results from experiments are converted into data in the lab by reviewing the experimental result and choosing to process data, a quick process. Data in the lab is then converted into science points in the lab by right-clicking it and choosing start research, this is a slow ongoing process. Science points in the lab can be collected by right-clicking it and choosing transmit science, and will only then be available to unlock tech tree nodes with.\u003C/p\u003E\u003Cp\u003EThere\u0027s a tutorial that taught me how to use it, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/119620\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/119620\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou want a scientist in the lab throughout, and you also need a method of controlling the ship, so either a command pod with another Kerbal in it or else a probe core - the lab isn\u0027t a command module and it cannot control the ship.\u003C/p\u003E\n"},{"CreatedByName":"dangerhamster","CreatedById":146944,"CreatedDateTime":"2015-10-05T18:38:14Z","Content":"\n\u003Cp\u003EOne little trick early on is to not save/transmit the raw science but simply process in the lab and then discard the experiment. You can then put another lab in position, run the same experiments and just process the data again. Rinse and repeat as needed.\u003C/p\u003E\n"},{"CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2015-10-05T19:25:48Z","Content":"\n\u003Cp\u003EIf you can get to Mun and Minmus, you should also be able to nip just out of Kerbin\u0027s SOI to do \u0027in orbit high over the Sun\u0027 science experiments. Then turn about and head back for Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2015-10-05T19:52:03Z","Content":"\n\u003Cp\u003EEvery large crater you see from orbit on the Mun is a different biome and all worth visiting for the Science Points. There is also the polar region, highlands, lowlands and the canyons that lead off two large craters (they count as one).\u003C/p\u003E\u003Cp\u003EAn un-crewed probe sent out of Kerbins SOI also gets more science, although you do loose some points for transmitting rather than returning the data.\u003C/p\u003E\u003Cp\u003EMinmus also has plenty of different locations (most are nice and flat and at 0m altitude) for yet more points. It\u0027s possible (with the use of a couple of Mobile Labs) to unlock the whole tech tree without visiting other planets SOI.\u003C/p\u003E\u003Cp\u003EMost places give reduced points the second time you conduct experiments there. I found this especially useful for keeping the orbiting Labs full of data.\u003C/p\u003E\n"},{"CreatedByName":"f.pelosa","CreatedById":151653,"CreatedDateTime":"2015-10-05T20:30:00Z","Content":"\n\u003Cp\u003Ehi all again.\u003C/p\u003E\u003Cp\u003EReading around, I found that a button called \u0022start research\u0022 should be present in the menu for the mobile lab.\u003C/p\u003E\u003Cp\u003EWhat I find in my menu is just \u0022process data\u0022. After some 10-15 seconds you press it, you can collect science points (or send them via radio) and that\u0027s it.\u003C/p\u003E\u003Cp\u003EI find no way to start a long-term reseach..\u003C/p\u003E\u003Cp\u003EWhat am I missing?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003Cp\u003EAC\u003C/p\u003E\n"},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2015-10-05T21:16:22Z","Content":"\n\u003Cp\u003EOnce you have processed the data, it should be available for the lab to use in its research. As long as you have processed some data you should see the \u0022start research\u0022 button when you right click the Lab.\u003C/p\u003E\n"},{"CreatedByName":"Sampak","CreatedById":150646,"CreatedDateTime":"2015-10-05T22:37:58Z","Content":"\n\u003Cp\u003ETo add to what others have already mentioned, I too was in a lull as far as needing more science in Science mode, in order to unlock stuff. So I decided to revisit the Mun and Minmus, this time by complete chance with a 2.5M lander with about 2,000-3,000 m/s extra dV and used it (with my \u0027skills\u0027 it took me a whole night of crashing and reloading) to hop over several different biomes on the Mun, and Minmus, and ended up netting probably 1500-2000 science points, which I promptly spent on science experiments (Graviolli detector, etc.), and other \u0027fun\u0027 bits (3.5m rocket parts and power gen).\u003C/p\u003E\u003Cp\u003EStart \u0027hopping\u0027 biomes on Minmus because it\u0027s much \u0027cheaper\u0027 with delta V and piloting mistakes, and once you\u0027ve had your fill, recover that craft on Kerbin, and head out to the Mun and try the same. I went against my usual habits and on these high payout trips went into Polar orbits, just to force myself to land and get science from previously \u0027virgin\u0027 biomes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"eric bloedow","CreatedById":151553,"CreatedDateTime":"2015-10-07T00:04:36Z","Content":"\n\u003Cp\u003Eone final trick i figured out...quite tricky: have another ship land on Mun or Minmus, do experiments, then dock with a station that has a lab! that will give you more data to analyze. it also helps to have 2 scientists in the lab-but having 2 labs on one station doesn\u0027t help.\u003C/p\u003E\u003Cp\u003Ei currently have TWO stations with labs, one orbiting Mun and one orbiting Minmus!\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-10-07T00:36:42Z","Content":"\n\u003Cp\u003EHmm...\u003C/p\u003E\u003Cp\u003E Nobody\u0027s mentioned all the biomes on KSC itself, including the rooftops. There\u0027s lots of freebie science there.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2015-10-07T14:37:12Z","Content":"\n\u003Cp\u003EAs Slashy mentions there are quite a few science point to be had at KSC. Personally I waited until I had some basic rover parts before trekking round getting them all. With the use of the Mobile Lab, I unlocked all the tech tree in the Kerbin/Mun/Minmus SOI, apart from a flyby of Moho and a Moho impactor. Looking back, I\u0027m sure you can unlock all the stock parts without venturing past Minmus\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-10-07T16:48:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EHmm...\u003Cp\u003E Nobody\u0027s mentioned all the biomes on KSC itself, including the rooftops. There\u0027s lots of freebie science there.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eerf? rooftops? \u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022font-family:\u0027Comic Sans MS\u0027;\u0022\u003E\u003Cem\u003EROOFTOPS???\u003C/em\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003Egwarsh!\u003C/p\u003E\n"}]}