{"TopicId":123245,"ForumId":16,"TopicTitle":"What is the Skipper useful for in Career Mode?","CreatedByName":"Destroyer713","CreatedById":136956,"CreatedDateTime":"2015-10-17T18:21:29Z","PageNum":1,"Articles":[{"CreatedByName":"Destroyer713","CreatedById":136956,"CreatedDateTime":"2015-10-17T18:21:29Z","Content":"\n\u003Cp\u003EI honestly can\u0027t seem to figure out how to make good use of the Skipper. Before unlocking the Mainsail, I\u0027ve tried pairing it with SRBs to make a decent lifter. But the amount of fuel you have to use to effectively pair it with some Kickbacks causes the TWR to drop too low once the SRBs run out. Heck, I\u0027ve even found it cheaper to just use the Kickbacks with a Swivel to get a Mun lander into orbit.\u003C/p\u003E\u003Cp\u003EAnd then, of course, once the Mainsail gets unlocked, the Skipper gets completely outclassed.\u003C/p\u003E\u003Cp\u003EIs there any effective use for this engine at all?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-17T23:44:38Z\u0022 title=\u002210/17/2015 11:44  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 17, 2015\u003C/time\u003E by Destroyer713\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-10-17T18:39:30Z","Content":"\n\u003Cp\u003EOf course there is, but not if you just throw fuel and thrust at a problem.\u003C/p\u003E\u003Cp\u003EYou can lift quite a bit of mass with Skippers in asparagus staging and they are significantly cheaper than the mainsail. Give me some time, I\u0027ll get you some examples.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHere you go, Same Delta V, same Payload Mass, Skippers are cheaper, and I can promise the Skipper rocket will be easier to fly, especially given the TWR of the mainsail rocket. EDIT: Just realized I forgot to add back the 4 launch clamps, that brings the skipper cost to 40,025, just for the sake of equivalency. Unless my payload mass just completely outclasses the Skipper in a reasonable amount of stage, I\u0027ve found the Mainsail rockets are always the less desirable option.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IpxRAO4.png\u0022 alt=\u0022IpxRAO4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/l2b8xl2.png\u0022 alt=\u0022l2b8xl2.png\u0022\u003E\u003C/p\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-17T18:53:27Z\u0022 title=\u002210/17/2015 06:53  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 17, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sanic","CreatedById":149920,"CreatedDateTime":"2015-10-17T20:03:03Z","Content":"\n\u003Cp\u003EI find the max fuel load for a Skipper engine is 1 Jumbo-64 tank and 1 X-16 tank, but that\u0027s with a somewhat small payload.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-10-17T20:15:11Z","Content":"\n\u003Cp\u003EMk3 Pod \u002B 1 Jumbo \u002B 1 Skipper = 3 part SSTO.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-10-17T20:16:08Z","Content":"\n\u003Cp\u003EThe Skipper is a good upper stage orbital insertion engine. What\u0027s your launch TWR with the Kickbacks? It might be an issue of too much launch thrust coupled with poor piloting. Just because you have a low TWR doesn\u0027t mean you aren\u0027t going to make it to orbit. Pics of your craft (preferably with a dV/TWR readout) would be greatly appreciated, as would some shots of your ascent.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-10-17T22:11:43Z","Content":"\n\u003Cp\u003EThe Skipper is an all-rounder, a engine that is not-terrible in atmo and good in vacuum. I use it on the core stage of many of my rockets, as I rarely build big enough to need 3.75m parts and often build small enough that the core stage can do ejection, too.\u003C/p\u003E\u003Cp\u003ESample:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/61004449/KSP/1.0.4/DayTripper/screenshot645.png\u0022 alt=\u0022screenshot645.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EPayload is a Mun lander, this arrives in orbit with enough fuel remaining to do the transfer without touching the lander\u0027s fuel.\u003C/p\u003E\n"},{"CreatedByName":"Nothalogh","CreatedById":139345,"CreatedDateTime":"2015-10-17T23:02:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Destroyer713\u0022 data-cite=\u0022Destroyer713\u0022\u003E\u003Cdiv\u003EI honestly can\u0027t seem to figure out how to make good use of the Skipper. Before unlocking the Mainsail, I\u0027ve tried pairing it with SRBs to make a decent lifter. But the amount of fuel you have to use to effectively pair it with some Kickbacks causes the TWR to drop too low once the SRBs run out. Heck, I\u0027ve even found it cheaper to just use the Kickbacks with a Swivel to get a Mun lander into orbit.\u003Cp\u003EAnd then, of course, once the Mainsail gets unlocked, the Skipper gets completely outclassed.\u003C/p\u003E\u003Cp\u003EIs there any effective use for this engine at all?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI combined the Skipper with a pile of Thuds to make an early game high TWR booster, also the high gimbal on the thuds make steering easy\u003C/p\u003E\n"},{"CreatedByName":"Norcalplanner","CreatedById":112223,"CreatedDateTime":"2015-10-17T23:18:39Z","Content":"\n\u003Cp\u003EI made this Skipper-powered craft for a discussion in a different thread, but it\u0027s still meaningful for this discussion as well. Skipper plus two thrust-limited kickbacks equals 18.9 tons to LKO for 1,089 funds/ton.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/0FR4x\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EP.S. Red Iron Crown, love the pic - I just wish those mods didn\u0027t slow my system down so much.\u003C/p\u003E\n"},{"CreatedByName":"Captain Vlad","CreatedById":106306,"CreatedDateTime":"2015-10-17T23:21:59Z","Content":"\n\u003Cp\u003EI use the hell out of the Skipper, especially for middle stages. A lot of my rockets use SRBs to boost themselves up to 10K\u002B and I finish the orbit with the Skipper under one large fuel tank. A probe core, some RCS thrusters, monoprop and parachutes and I can even recover it, saving even more $$$.\u003C/p\u003E\n"},{"CreatedByName":"Tatonf","CreatedById":146283,"CreatedDateTime":"2015-10-17T23:34:03Z","Content":"\n\u003Cp\u003ESkipper is a less heavy engine than the Mainsail, so whenever it can provides the desired thrust, it should probably be used rather than an overkill Mainsail.\u003C/p\u003E\u003Cp\u003EKSP Optimal Rocket Calculator often proposed me rockets with a Mainsail for the first stage and a Skipper for the second one (for mass optimization).\u003C/p\u003E\u003Cp\u003EJust for information, the Skipper\u0027s Isp overcome the Mainsail\u0027s one at 2400m on Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Destroyer713","CreatedById":136956,"CreatedDateTime":"2015-10-17T23:44:00Z","Content":"\n\u003Cp\u003ESo from the looks of it, my huge problem was I was overbuilding with a Skipper.\u003C/p\u003E\u003Cp\u003EI was so hell bent on using Kickbacks that I would stick way too much fuel above a Skipper just to get that part of the rocket about as tall as a Kickback. This effectively made the rocket overbuilt, and it was way more expensive than it should be. I took a two-stage Mun lander of mine (including a Science Jr. and a Service Bay), stuck it on top of a Skipper, an orange tank, and a structural adapter (this was something I made for early career, so no fuel tank adapters for me), and even without a pair of Thumpers I was able to get it out of the atmosphere and still have fuel to help circularize.\u003C/p\u003E\u003Cp\u003ESo yeah, thanks for all the helpful tips, everyone!\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-10-17T23:45:18Z","Content":"\n\u003Cp\u003EThe Skipper is an excellent first stage for early career. If your upper stage and payload is between 6 and 16 tonnes, there\u0027s nothing lighter and only SRBs are cheaper... if you\u0027ve unlocked the good ones.\u003C/p\u003E\u003Cp\u003E For payloads 18- 45 tonnes later in the game, it\u0027s unbeatable as an upper stage to orbit.\u003C/p\u003E\u003Cp\u003EA very good all- around workhorse engine. I probably use it more often than any other single LF\u0026amp;O engine.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-18T01:31:27Z","Content":"\n\u003Cp\u003EFor medium-sized ships, the Skipper makes a great first-stage lifter; pairs well with radially attached Thumpers. My go-to medium booster is a Skipper with a 16-ton tank and eight radial Thumpers in two sets of 4. One set of Thumpers is at 100% thrust, the other is at a lower setting, adjusted to give a TWR of 1.5 at takeoff. Takeoff is on all 8 Thumpers. First stage separation is the 100% ones, second is the next four while simultaneously activating the Skipper.\u003C/p\u003E\u003Cp\u003EIt also makes a good second-stage engine for larger ships, sitting on top of a Mainsail. Handy config: Mainsail on a 32-ton orange tank, ringed by eight radial Kickbacks. Skipper on a 16-ton tank sits on top of the orange one. Third stage varies but is often a Poodle.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-10-18T06:11:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Destroyer713\u0022 data-cite=\u0022Destroyer713\u0022\u003E\u003Cdiv\u003E.... that I would stick way too much fuel above a Skipper just to get that part of the rocket about as tall as ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EChanging the engine choice or stack dimensions simply to make it look more like a rocket, is *the worst* criteria for design you could possibly use.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2015-10-18T10:35:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EChanging the engine choice or stack dimensions simply to make it look more like a rocket, is *the worst* criteria for design you could possibly use.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDisagree. Building replicas that look right *and* work is the most satisfying fun I\u0027ve had in KSP. Sure, I had to bodge a few things, but it wasn\u0027t \u0027bad criteria\u0027 - it gave me a kick.\u003C/p\u003E\u003Cp\u003EAlso, rockets are an excellent example of form following function. Tube with fire out of the bottom = stable aerodynamic ascent vehicle. If it doesn\u0027t work and doesn\u0027t look like a rocket, maybe making it look like a rocket will make it work. This isn\u0027t bad criteria either, it\u0027s just working from established design precedents/conventions.\u003C/p\u003E\u003Cp\u003EAnyhow, with properly thrust-limited Kickbacks a Skipper with 2 Jumbos can certainly reach orbit with a bigger payload than the same with one Jumbo.\u003C/p\u003E\n"},{"CreatedByName":"Acet","CreatedById":123646,"CreatedDateTime":"2015-10-19T11:03:42Z","Content":"\n\u003Cp\u003EIn career my mid-size payload (10t - 30t) launch stages tend to be based on a Skipper or a Mainsail with an orange tank on top, surrounded by either solid boosters or a ring of liquid boosters in asparagus configuration. \u003C/p\u003E\u003Cp\u003EWhat I\u0027ve found is that for lower payloads the Skipper, being cheaper and half the weight of the Mainsail, will give me more dV at a lower cost, all else being the same. However if the resulting TWR is too low, the ascension takes longer and the dV spent to get to orbit goes up thus eliminating the dV gain. So as a rule of thumb in this setup I\u0027ll use Skippers for payloads were the TWR with it of the last launch stage (after all boosters dropped) is 1.3 or more, and for larger payloads I\u0027ll use the Mainsail.\u003C/p\u003E\u003Cp\u003EAlso another thing to keep in mind is that the ISP of an engine gets pretty close to its vacuum ISP at about 10k high, so in some case it\u0027s actually cheaper and more effective to use a Poodle (really!) as long as you can use boosters only to get you up to that height (for example for 10t loads).\u003C/p\u003E\n"}]}