{"TopicId":123759,"ForumId":16,"TopicTitle":"Boosting FPS, even with a low-end computer: Is it possible?","CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-10-25T21:18:25Z","PageNum":1,"Articles":[{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-10-25T21:18:25Z","Content":"\n\u003Cp\u003ESome of you may have seen me commenting about getting a new computer for KSP. Sadly, I\u0027ll probably only get it around December or January, and while I got a couple games to distract me, I\u0027m really feeling the lust to construct bases and space stations with this game. Unfortunately, with my current computer\u0027s measly 1.4 GHz, I get as low as 4 FPS whenever I\u0027m in a simple base like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/8yXBMpG.png\u0022 alt=\u00228yXBMpG.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(do note however that there is an unseen rocket which is just like the one with solar panels seen \u003Ca href=\u0022http://i.imgur.com/XhRvxDa.png\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003EIs there a way to increase my FPS to something bearable even with my horrible CPU? I don\u0027t mean increasing it to 60, years of dealing with awful computers made me used to \u0022low\u0022 framerates like 18-30. I\u0027m aware of ActiveTextureManagement, but I tried it and it doesn\u0027t seem to make much effect; it\u0027s more targeted at RAM improvements than FPS improvement, and RAM is not a problem for now.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-10-25T21:38:08Z","Content":"\n\u003Cp\u003ETry turning up the \u0022Max Physics Delta\u0022 in the settings, this will trade some simulation accuracy for better performance.\u003C/p\u003E\n"},{"CreatedByName":"Commissioner Tadpole","CreatedById":91993,"CreatedDateTime":"2015-10-25T21:44:40Z","Content":"\n\u003Cp\u003EWhat exactly do you mean by simulation accuracy? You mean it has the possibility of some parts accidentally clipping into each other and exploding, or making everything run fast but \u0027freezy\u0027?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-10-25T21:58:47Z","Content":"\n\u003Cp\u003EIt sets the maximum amount of game time that can pass between physics steps. If the CPU cannot complete the frame fast enough, the game engine will wait to update, causing slowdowns (this is what the yellow MET timer indicates). Turning up this variable means the engine is less likely to wait to update, but the bigger steps between frames means that some fast events like collisions may be less predictable.\u003C/p\u003E\n"}]}