{"TopicId":123761,"ForumId":16,"TopicTitle":"Recovering \u0026quot;hulks\u0026quot; from Mun","CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-10-25T21:53:27Z","PageNum":1,"Articles":[{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-10-25T21:53:27Z","Content":"\n\u003Cp\u003EI\u0027ve taken up a contract without reading it thoroughly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E It involves not only picking up a kerbal from Mun, but the pod as well. I was thinking of using a sky crane with a claw and transferring to something better in orbit, but maybe there is a simpler solution? I do have KAS and KIS installed but never used them.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-26T22:14:53Z\u0022 title=\u002210/26/2015 10:14  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 26, 2015\u003C/time\u003E by Waxing_Kibbous\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SmashingKirby148","CreatedById":130193,"CreatedDateTime":"2015-10-25T21:59:08Z","Content":"\n\u003Cp\u003EThe pod awell!? Hmmm... well, maybe just make a normal lander (that can land on the Mun and back) but have one of those asteroid claws in place of an engine, and attach engines radially?\u003C/p\u003E\u003Cp\u003EAnother important question, do you know what the actual \u0022hulk\u0022 looks like?\u003C/p\u003E\n"},{"CreatedByName":"Sheppard","CreatedById":93282,"CreatedDateTime":"2015-10-25T22:02:35Z","Content":"\n\u003Cp\u003EPut some wheels on the ship that\u0027s supposed to pick up the hulk. Have a claw at one end. Take off. Profit.\u003C/p\u003E\u003Cp\u003EIt\u0027s pretty hard to come from above with the claw and pick it up. I\u0027ve once wasted half an hour trying to dock from above on the surface of the Mun; got there after many, many, many, failed attempts.\u003C/p\u003E\n"},{"CreatedByName":"JTpopcorn","CreatedById":130311,"CreatedDateTime":"2015-10-25T22:34:11Z","Content":"\n\u003Cp\u003EIf you can figure out how to fly it, a symetrical spacecrane with a claw on the bottom(mounted on a long strut) will work wonders. I used this to refuel my minmus science craft from a science base.\u003C/p\u003E\u003Cp\u003ERemeber, going slow is much easier than rushing it.\u003C/p\u003E\u003Cp\u003E-JT\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-10-25T22:59:55Z","Content":"\n\u003Cp\u003EYou get the weight of the craft in the contract, in this case 2.5t, but that\u0027s it. I can probably figure out what it is in the VAB now that I think of it.. I am considering planning this out more, maybe this will be my first complex mission involving an orbiter and multiple craft- I did a space junk recovery and the reentry seems iffy, I think I\u0027ll try taking the Kerbal in a separate safer craft. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf you can figure out how to fly it, a symetrical spacecrane with a claw on the bottom(mounted on a long strut) will work wonders. I used this to refuel my minmus science craft from a science base.\u003Cp\u003ERemeber, going slow is much easier than rushing it.\u003C/p\u003E\u003Cp\u003E-JT\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, this is a game that will teach you patience that\u0027s for sure!\u003C/p\u003E\n"},{"CreatedByName":"SlithyTove","CreatedById":151140,"CreatedDateTime":"2015-10-26T01:30:45Z","Content":"\n\u003Cp\u003EI tried a skycrane on my first of these. Problem was, the thing I was asked to grab was too big for all my rockets to get around so I couldn\u0027t fly straight. I guess if you build a big enough skycrane that could do it, but you have to think large to manage all contingencies.\u003C/p\u003E\u003Cp\u003EMy much easier solution was to put some wheels on a rocket with an over-abundance of reaction wheels and a couple stragically placed vernors. Then I can just drive up to the debris, raise the front end as I latch to grab it in the center. Then unlock the claws movement, and lift the back end off the ground to get things centered vs the COM and re-lock the claw. \u003C/p\u003E\u003Cp\u003EThen the excess of reaction wheels \u002B strategic vernors kick in to flip vertical and voila.\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-10-26T02:36:15Z","Content":"\n\u003Cp\u003E2.5t is just the right mass for a Hitchhiker Storage Container, so that\u0027s probably what you\u0027re dealing with. Several of the above solutions would work. I think SlithyTove\u0027s is particularly brillig, that\u0027s pretty close to what I\u0027d try (though I would detach my rocket from the rover to get to munar orbit, rather that trying to gyre and gimble the whole thing all over the place).\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-10-26T02:58:40Z","Content":"\n\u003Cp\u003EI think with my limited precision flying skills the rover/rocket hybrid may be a good place to start. It\u0027s going to be one ugly vehicle, some Road Warrior stuff happening there\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-26T05:22:50Z","Content":"\n\u003Cp\u003EWhat exactly is a skycrane? I can understand the concept (I think), but how does one go about building that? Does anyone have any pictures?\u003C/p\u003E\n"},{"CreatedByName":"TheXRuler","CreatedById":125517,"CreatedDateTime":"2015-10-26T10:15:09Z","Content":"\n\u003Cp\u003EFirst off, a real \u003Ca href=\u0022http://www.cranestodaymagazine.com/uploads/newsarticle/774255/images/198248/large/1.jpg\u0022 rel=\u0022external nofollow\u0022\u003ESkycrane\u003C/a\u003E look something like this. This is a slighly more insane version that I built some time ago \u003Cimg src=\u0022http://images.akamai.steamusercontent.com/ugc/3316082135199299463/C4C785F1EEE4399295421D6D061B7C3F37354A04/\u0022 alt=\u0022C4C785F1EEE4399295421D6D061B7C3F37354A04\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow to the OP, remember that KAS/KIS has winches and connector plugs, so you don\u0027t need to neccessarily touch it, you could land a few meters away and then connect it via a cable. For landing near a surface target, try keeping the target retrograde marker glued to the retro target marker.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-10-26T11:10:49Z","Content":"\n\u003Cp\u003EAs suggested, the easiest way is probably a rover with a Klaw on the nose (stick some extra landing gear under the nose to allow you to adjust connection height). Like a scaled-down version of this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9GUeq0e.jpg\u0022 alt=\u00229GUeq0e.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EGive the rover plenty of torque/RCS/gimbal to allow it to control the unbalanced load.\u003C/p\u003E\u003Cp\u003EMk2 spaceplane parts make good rover bodies.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-26T11:14:58Z\u0022 title=\u002210/26/2015 11:14  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 26, 2015\u003C/time\u003E by Wanderfound\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Racescort666","CreatedById":137852,"CreatedDateTime":"2015-10-26T14:51:37Z","Content":"\n\u003Cp\u003EI can\u0027t remember if surface kerbals are automatically on Eva for their recovery or not but you can look in the astronaut complex and it will tell you what module the Kerbal is in before attempting recovery. If they are just on EVA, this method won\u0027t work for obvious reasons.\u003C/p\u003E\u003Cp\u003EThat being said, I would recommend a \u0022rover\u0022 that uses the aircraft retractable landing gear rather than the rover wheels and RCS for propulsion. I\u0027m at work now but I can throw something together tonight if you\u0027d like to see what I\u0027m talking about. You have a rover with the klaw on the bottom and you can slowly roll over and align above the debris, then retract the landing gear to drop down on top of it.\u003C/p\u003E\n"},{"CreatedByName":"Acet","CreatedById":123646,"CreatedDateTime":"2015-10-26T15:44:25Z","Content":"\n\u003Cp\u003EIf you\u0027re using KIS/KAS and are up to trying something slightly insane you can bring some solar panels, small probe core, small SAS, battery, mono prop tanks and mono prop engines and turn it into a ship capable of getting into orbit. Just place the parts around it and link to your own ship for refuelling.\u003C/p\u003E\u003Cp\u003ENot necessarily the simplest way, but likely to be fun trying.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-26T15:44:51Z\u0022 title=\u002210/26/2015 03:44  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 26, 2015\u003C/time\u003E by Acet\u003C/strong\u003E\n\u003Cbr\u003ERemoved double posting (duh!)\n\u003C/span\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-10-26T15:55:54Z","Content":"\n\u003Cp\u003EToo bad it\u0027s not on Minmus, you could just fling it into orbit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ag8bF5Wyhe4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"fireblade274","CreatedById":134571,"CreatedDateTime":"2015-10-26T21:58:04Z","Content":"\n\u003Cp\u003EI laughed out loud\u003C/p\u003E\u003Cp\u003EYou must have a lot of spare time on your hands\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-10-26T22:14:24Z","Content":"\n\u003Cp\u003EI\u0027m getting some good ideas here, thanks team! Since I know it\u0027s most likely the 4 kerbal can I will do some tests on Kerbin like a proper scientist/engineer.\u003C/p\u003E\u003Cp\u003EThat flinger this is awesome\u003C/p\u003E\n"},{"CreatedByName":"Racescort666","CreatedById":137852,"CreatedDateTime":"2015-10-26T22:41:33Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i782.photobucket.com/albums/yy108/The_PDE/Kerbal%20Space%20Program%2010_26_2015%206_34_52%20PM_zpswu5btivg.png\u0022 alt=\u0022Kerbal%20Space%20Program%2010_26_2015%206_34_52%20PM_zpswu5btivg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIronically, I got pretty much the same contract so this is the working version of my lander/recovery rover. I\u0027m not sure what I want to do with it exactly this is the idea behind what I was talking about.\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-10-27T00:07:59Z","Content":"\n\u003Cp\u003EHere is my poor man\u0027s version- I have the big can there for dV purposes, unladen it has about 3,350m/s (I\u0027m thinking 1500m/s is very comfortable to get back to Kerbin). Seems cheap and effective- only question is, with the can gone and the claw in it\u0027s place how the heck to I get it into space?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/EF134O0.jpg\u0022 alt=\u0022EF134O0.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-10-27T00:26:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fireblade274\u0022 data-cite=\u0022fireblade274\u0022\u003E\u003Cdiv\u003EYou must have a lot of spare time on your hands\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf by that you meant to compliment me for using my time to create something awesome for your enjoyment, thank you.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Waxing_Kibbous\u0022 data-cite=\u0022Waxing_Kibbous\u0022\u003E\u003Cdiv\u003EHere is my poor man\u0027s version- I have the big can there for dV purposes, unladen it has about 3,350m/s (I\u0027m thinking 1500m/s is very comfortable to get back to Kerbin). Seems cheap and effective- only question is, with the can gone and the claw in it\u0027s place how the heck to I get it into space?\u003Cp\u003E\u003Ca href=\u0022https://i.imgur.com/EF134O0.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://i.imgur.com/EF134O0.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d put some radial decouplers on the fuel tank, attach some more fuel tanks to the decouplers, and build down from there. Then tie your boosters together with struts. This is my go-to configuration whenever I need to launch something that doesn\u0027t have an attachment node in the center, for example the \u003Cem\u003EAtmospherikdipperkraft \u003C/em\u003Ewith its aerospike engine:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9OjzTxo.png\u0022 alt=\u00229OjzTxo.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2015-10-27T00:47:15Z","Content":"\n\u003Cp\u003EWow, I just made a truly KSP rocket haha, if I decide to launch it I\u0027ll post the mission recap. At this point it\u0027s a matter of pride- currently my next Kerbal hire is 200,000, rescuing the Kerbal only gets me 33,000. My rescue unit is 10,900, the trainwreck that is supposed to get to to Mun is 76,000 in total. I\u0027m still ahead if I just get the Kerbal then forfeit the contract. But really, what fun is that? Fun Fact: Jeb saw this and it wiped the smile off his face:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://i.imgur.com/Qtm5CEw.jpg\u0022 alt=\u0022Qtm5CEw.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt looks like a wonderful sky castle\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-27T00:49:22Z\u0022 title=\u002210/27/2015 12:49  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 27, 2015\u003C/time\u003E by Waxing_Kibbous\u003C/strong\u003E\n\u003C/span\u003E\n"}]}