{"TopicId":123816,"ForumId":16,"TopicTitle":"Making it (and back!) to Duna","CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-26T21:44:17Z","PageNum":1,"Articles":[{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-26T21:44:17Z","Content":"\n\u003Cp\u003ESo, I\u0027ve been turning my sights lately on Duna as the next step in my KSP voyage, particularly one which will help me gain a lot of experience in terms of flying stuff since this will be my first interplanetary voyage. Would love to get some feedback from you lovely Kerballers if you\u0027re willing to answer questions, and I\u0027m not sure how accurate the Wiki is lately on planetary data. Primarily curious if this ship seems capable of doing it:\u003C/p\u003E\u003Cp\u003ERocket:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://oi62.tinypic.com/o5onjm.jpg\u0022 alt=\u0022o5onjm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELander:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://oi57.tinypic.com/32zhys3.jpg\u0022 alt=\u002232zhys3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst of all, is that overkill/not enough? I\u0027m trying to leave room for mess-ups since I\u0027m still highly inexperienced at interplanetary movement. In addition, I was also considering trying to take down a rover with me to explore a bit, and curious if I would be able to fit that somewhere on my current lander if there\u0027s wiggle room in the DeltaV (However... that would also require me figuring out \u003Cem\u003Ehow\u003C/em\u003E to put a rover on a ship such that I can use it while there, then leave with it when I go as well... something I haven\u0027t figured out how to do yet), or if I should just assemble it with KIS/bring it on a separate trip. Also, I feel doubtful, but is that lander enough to get back to Kerbin? Or, at the very least, Dunian orbit so I can send a rescue.\u003C/p\u003E\u003Cp\u003EIn addition, are heatshields necessary for aerobraking in Duna\u0027s atmosphere? What is a proper aerobrake altitude anyway for Duna?\u003C/p\u003E\u003Cp\u003EIs there anything else important to know about Duna? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EP.S. I am aware that it\u0027s possible to go straight from an SOI intercept into a very elliptical orbit that has its periapsis below the atmosphere for aerobraking. I\u0027ve been unable to do that thus far while tinkering with maneuver nodes from LKO, and all my intercepts have required an additional 1000\u002Bm/s dV burn once in Duna SOI to get into said elliptical orbit. Do I need to wait for an opening period or is there something I should know about doing my entire burn at once from LKO? Or any other tips in general on that matter.\u003C/p\u003E\u003Cp\u003EThanks for the help, everyone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-28T22:55:46Z\u0022 title=\u002210/28/2015 10:55  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 28, 2015\u003C/time\u003E by mabarry3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-10-26T21:54:27Z","Content":"\n\u003Cp\u003EJust eyeing the rocket, lander, and dV stats I\u0027d say it\u0027s got a pretty darn good shot, however you seem to have the staging wrong on the lander. Are you tossing the side boosters before igniting everything? I\u0027d expect, with decouplers like that, to have 2dV readings. You should consider running fuel lines from them inward to the central core so when you toss them, the central core is still full. You don\u0027t need heat shields for aerobraking at KERBIN, so no, you don\u0027t need them for Duna \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EDon\u0027t bother with the rover. Assuming you don\u0027t break it deploying it, it\u0027ll flip in the first 5 minutes of using it. Also, it\u0027ll add even more mass to your vessel, requiring an even larger... everything.\u003C/p\u003E\u003Cp\u003EThe Lander is enough to get to Duna orbit, and probably home with the suggestion above. I see it has a docking port and no parachutes on the final stage, though, so I don\u0027t know what you\u0027ll do when you arrive back at Kerbin. Also, with that docking port I\u0027d suggest leaving some fuel in orbit so you can, once you lift off and come back to space, you can top off the tanks for the journey home.\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-26T22:18:17Z","Content":"\n\u003Cp\u003EI can repack four of the chutes (the four that aren\u0027t discarded via being attached to the four Terriers on the side) once I use them the first time around, for use back on Kerbin. In all likelihood, I don\u0027t think I\u0027ll need nearly that many chutes but hey, I had them on my last (return-to-Kerbin) stage before just moving them to my Duna lander stage as well, since I could just repack after use. I do need to adjust the staging though, you\u0027re right - there\u0027s supposed to be the four Terrier decouplers on a separate stage from the Poodle in the middle. And I\u0027ll set those up with fuel lines now that you mention it.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-26T22:30:58Z","Content":"\n\u003Cp\u003ESome observations:\u003C/p\u003E\u003Cp\u003EComing back home to Kerbin, you\u0027ll probably need a heatshield.\u003C/p\u003E\u003Cp\u003EI\u0027d say you can probably get by with just 4 legs on the lander; that will save you almost half a ton.\u003C/p\u003E\u003Cp\u003EBe aware that it\u0027s hard to slow down enough for a safe landing on Duna using only parachutes, unless you pack on so many that their mass gets expensive. I usually aim t add just a few chutes, and use a burst of engine thrust just before landing to soften the impact to tolerable levels. Translation: consider ditching the four chutes above the Terriers. It will save you 1.2 tons, and you can make up for it with much less than that much fuel.\u003C/p\u003E\u003Cp\u003EYou may want to add a couple of the little radial drogue chutes for landing. Duna\u0027s atmosphere is thin enough that it can be tricky to slow down to safe speeds for activating parachutes. Drogues are safe to activate at double the speed, and can slow you down to where you can pop the main chutes.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-10-26T23:06:14Z","Content":"\n\u003Cp\u003EAha. I thought those four side tanks were going to be tossed when they ran out of fuel on the ascent from Duna.\u003C/p\u003E\u003Cp\u003EIf you\u0027re careful on the way home you don\u0027t need a heat shield. Just aerobrake enough to get captured, then again enough to get your periapsis down between Mun and Minmus, and then a final one to actually get captured. This won\u0027t work of course if your relative speed to Kerbin is something crazy but if you do a good Hohmann transfer you should only have to bleed off a few hundred m/s to ensure a capture. Quicksave before aerobraking and try some altitudes, but I expect 45 will get you captured without blowing up your ship.\u003C/p\u003E\u003Cp\u003ERegarding how to get there most efficiently, I highly recommend both the PreciseNode and Transfer Planner mods. For aerobraking/capture I also highly recommend Trajectories. It\u0027s extremely hard to describe in general terms how to correctly perform the burns. I suggest you look up some \u0022how to perform an interplanetary transfer\u0022 videos on YouTube.\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-26T23:15:37Z","Content":"\n\u003Cp\u003EI have a heatshield on what would be coming back to Kerbin (Heat shield, cargo bay, command pod, docking port from bottom to top), but I may apparently need to take it in low Duna orbit rather than planning a full return trip and send over a rescue tug behind it to sit in Duna orbit until the lander is ready to go.\u003C/p\u003E\u003Cp\u003EI had heard Drogue chutes were practically useless in Duna due to the low drag, are they definitely worth it in terms of dV savings?\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-10-26T23:23:25Z","Content":"\n\u003Cp\u003EUse airbrakes for aerobreak. They are immensely effective and weigh very little.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-26T23:33:47Z","Content":"\n\u003Cp\u003ESome more thoughts:\u003C/p\u003E\u003Cp\u003E- You could probably not just reduce from 8 to 4 legs, but go down to the next-smaller legs. That\u0027ll save another couple of hundred kilograms.\u003C/p\u003E\u003Cp\u003E- Suggest rearranging your struts. The most stress you\u0027ll have to deal with is the impact of landing, and if you think about it, that will be shock that\u0027s directed \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Eupward\u003C/em\u003E\u003C/span\u003E. Your existing struts won\u0027t help much with that. Suggest getting rid of the 8 horizontal struts that you now have, and replace with 4 \u0022radial\u0022 struts, each of which goes from one of the outrigger fuel tanks up to near the apex of the command module. This will save you another 200 kg (four struts instead of eight), and will likely do a better job of impact resistance.\u003C/p\u003E\u003Cp\u003E- Is there a particular reason you\u0027re using the radial decouplers that hold the outriggers way out from the central body? I think you ought to be stable enough-- you\u0027ve got plenty of mass down below, and you have the legs mounted on the radial tanks. You could use the \u0022standard\u0022 radial decouplers instead, will save another 100 kg, and be mechanically stronger (less breaking torque from shock transmitted up the legs on landing, due to shorter lever arm). Doing this will also reduce the angular moment of your craft, which means it will be more nimble rotating on its reaction wheels.\u003C/p\u003E\u003Cp\u003E- If you\u0027re putting heat shields on, consider adjusting the amount of ablator in them (say, down to 50%). Will save a fair amount of mass, and in my experience I almost never need more than half of a load.\u003C/p\u003E\u003Cp\u003E- Per 5thHorseman\u0027s suggestion, add fuel lines leading inwards. However, I\u0027d suggest doing \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Asparagus_staging\u0022 rel=\u0022external nofollow\u0022\u003Easparagus staging\u003C/a\u003E for takeoff. See the wiki article I just linked for details, but basically this will involve doing two things: 1. setting the fuel lines appropriately, and 2. tinkering with the staging UI so that the external tanks are dropped in two pairs instead of all four at once. This will allow your ship to launch on all 5 engines, use up all the fuel in 2 of the tanks, drop those two (with their engines), use up all the fuel in the next 2 tanks, drop those two (with their engines), then continue on with the last (central) engine.\u003C/p\u003E\u003Cp\u003EOne more comment about Duna: be aware that it has both lowlands (near zero elevation), and extensive areas of highlands (large plateaus at elevations over 5000 m). This makes a \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ehuge\u003C/span\u003E\u003C/em\u003E difference to the landing experience, particularly if you\u0027re relying on parachutes, since Duna\u0027s atmosphere drops off more rapidly with altitude than Kerbin\u0027s does. I\u0027m not telling you this in order to advocate for one or the the other (they both have their advantages and disadvantages), just be aware of the difference. If you get to Duna, and try to land, and are having a hard time and keep failing, try landing somewhere at a different elevation to see if you have better luck with that.\u003C/p\u003E\u003Cp\u003EBy the way, if your goal is to maximize science, then landing in multiple biomes can boost your returns. For example, if you can leave enough fuel orbiting in the big orange tank when you go down to land, you could land, take off, dock, refill, and repeat. Not sure if you have enough fuel for that.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EI had heard Drogue chutes were practically useless in Duna due to the low drag, are they definitely worth it in terms of dV savings?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the contrary, I would contend that Duna is the \u003Cem\u003Eposter child\u003C/em\u003E for drogue chutes. It\u0027s just about the only place I use them.\u003C/p\u003E\u003Cp\u003EWithout drogues, you\u0027ll probably have to burn up lots of fuel trying to get down to a low enough speed that you can safely pop your main chutes. A couple of the little radial chutes will have a mass of only 0.15 tons, well worth the investment IMHO. Just to run some rough numbers: I don\u0027t know how much mass you have squirreled away in that service bay, but I\u0027d put your lander mass at 25\u002B tons with full tanks, even with the previously-suggested optimizations. Drogue chutes will save you ~250 m/s of dV, and with Terrier engines that would translate to around 2 tons of fuel for a 25-ton ship. Pretty good return on investment, I\u0027d say.\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-27T00:13:07Z","Content":"\n\u003Cp\u003EStruts: I didn\u0027t think of it like that. I just typically kept two attachment points per radial fuel tank, one on the top and bottom of the fuel tank, attached to the item in the center of the stack. The strut image in that picture was a bit of a test but I\u0027ll stick with what you\u0027ve said then.\u003C/p\u003E\u003Cp\u003ERadial decouplers: I actually already switched those. I thought I had the normal ones when I posted this but noticed it shortly thereafter.\u003C/p\u003E\u003Cp\u003EThe main rocket already is asparagus staged, but I\u0027ll have to see how much fuel I have left once I get there. I may try to drop down into multiple biomes. In my cargo bay is basically 3 of every science-gaining unit with the exception of having a \u0022mere\u0022 1 Science Jr. in the middle of it.\u003C/p\u003E\u003Cp\u003EAs far as mass/deltaV savings... Hmm, not bad. Didn\u0027t think drogue parachutes did much anywhere, especially not in thin atmospheres. That\u0027s significantly better than I thought.\u003C/p\u003E\u003Cp\u003EWhile we\u0027re on the topic of saving mass, what about Rockomax Brand Decouplers? I\u0027ve had some stability issues in the past in using parts that don\u0027t \u0022fit\u0022 the stack below them but I don\u0027t know if that warrants the extra .35t per switch from a normal to a Rockomax. I have two on the rocket which could be another potential .7.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-27T00:42:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EStruts: I didn\u0027t think of it like that. I just typically kept two attachment points per radial fuel tank, one on the top and bottom of the fuel tank, attached to the item in the center of the stack. The strut image in that picture was a bit of a test but I\u0027ll stick with what you\u0027ve said then.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne thing to be aware of with struts: their mass is always attached to the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Efirst\u003C/em\u003E\u003C/span\u003E node you lay down when you place them. Therefore, any time you\u0027re attaching a strut between a radial booster and the central body of the rocket, always start the struts from the outside booster, not from the central body. That way you\u0027ll drop the strut\u0027s mass when you drop the booster, instead of having it stick around.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EThe main rocket already is asparagus staged, but I\u0027ll have to see how much fuel I have left once I get there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut it\u0027s still worth asparagus-staging the lander itself. dV is dV.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EIn my cargo bay is basically 3 of every science-gaining unit with the exception of having a \u0022mere\u0022 1 Science Jr. in the middle of it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd some batteries, right? You\u0027ll want a lot more electricity storage than the command pod holds, if you want to be able to transmit science. (Yes, it\u0027s better to bring it back than to transmit. But you can transmit, and \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Ethen\u003C/em\u003E\u003C/span\u003E do another science grab to bring back with you. That way you can get a decent chunk of the tech benefit back home, before you actually bring your ship back.)\u003C/p\u003E\u003Cp\u003EAlso: Reason for having 3 of every science experiment? That sounds kinda expensive. You\u0027re aware that you can re-use them, right? After you get science from them, send an EVA kerbal out to take the science out of the instrument, and then go back to the command pod (which stores the science result in the pod). This leaves the instrument empty and available to take another science reading. Make sure that you have a scientist along, since they\u0027re the only ones who can reset the Science Jr. and the goo canister to let them be used multiple times.\u003C/p\u003E\u003Cp\u003EYou\u0027re familiar with the ability of science instruments to get different readings for different situations, yes? e.g. the thermometer gets one reading for \u0022space high over\u0022, one for \u0022space near\u0022, one for \u0022upper atmosphere\u0022, one for \u0022flying\u0022 (per biome!), one for landed (per biome). Different science instruments get per-biome results for different situations, so it\u0027s good to be familiar with that so you can squeeze out every last drop of science from your visit.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003E As far as mass/deltaV savings... Hmm, not bad. Didn\u0027t think drogue parachutes did much anywhere, especially not in thin atmospheres. That\u0027s significantly better than I thought.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s the deal. \u0022Regular\u0022 chutes can\u0027t be opened until you\u0027re down around 250 m/s; if you\u0027re much faster than that, they get ripped off. Drogues\u0027 safe deployment speed is about double.\u003C/p\u003E\u003Cp\u003EOn Kerbin, that\u0027s usually not an issue-- most ships have terminal velocity under 250 m/s, so they slow down naturally to safe parachute speeds as they approach the ground. (Unless they\u0027re big and heavy, or very streamlined... but then you can use airbrakes to help.)\u003C/p\u003E\u003Cp\u003EHowever, on Duna, the air is so thin that there\u0027s an excellent chance you\u0027ll still be going \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Ewell\u003C/em\u003E\u003C/span\u003E over 250 m/s when you hit the ground, which means you never have an opportunity to open your parachutes at all.\u003C/p\u003E\u003Cp\u003EOf course, you can fire your engines to slow down enough to use your parachutes... but that costs a lot of fuel. Let\u0027s say you get to the point where you\u0027re going 500 m/s and getting dangerously close to the ground. At this point, you have two choices: 1. Fire your engines to reduce your speed by ~250 m/s so you can pop your main chutes, or 2. Open your drogue chutes and let \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Ethem\u003C/em\u003E\u003C/span\u003E slow you down by 250 m/s so you can pop your main chutes.\u003C/p\u003E\u003Cp\u003E#2 gets my vote, but of course that only works if you \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Ehave\u003C/em\u003E\u003C/span\u003E drogue chutes. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EBy the way: the other thing you should do, before launch, is adjust the fully-open altitude of your chutes from the defaults-- e.g. boost your main chutes from their default 1000-meter altitude up to at least 2000 meters, and similar increase for any drogues. Chutes take a longer time to slow you down in Duna\u0027s thin atmosphere, you want to give them more time to work.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EWhile we\u0027re on the topic of saving mass, what about Rockomax Brand Decouplers? I\u0027ve had some stability issues in the past in using parts that don\u0027t \u0022fit\u0022 the stack below them but I don\u0027t know if that warrants the extra .35t per switch from a normal to a Rockomax. I have two on the rocket which could be another potential .7.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs long as they\u0027re on the main rocket and not the lander itself, I wouldn\u0027t worry about it. The rocket\u0027s so massive that the decouplers are a pretty small fraction of it, so you\u0027re not losing much. If you tried to hack it with a smaller decoupler, you\u0027d end up with something so floppy that you\u0027d need struts to make up for it, which would largely cancel out the mass benefit of using the smaller decouplers.\u003C/p\u003E\n"},{"CreatedByName":"Zophos","CreatedById":151234,"CreatedDateTime":"2015-10-27T02:15:11Z","Content":"\n\u003Cp\u003EI\u0027ll second the recommendation for airbrakes - they\u0027re lower mass even than drogues, and you can deploy them in space and use them all the way down. I have a small science lander on my current Duna mission, with two airbrakes and four radial parachutes. Uses no fuel to land other than a deorbit burn to put periapsis in the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Vegvisir","CreatedById":148279,"CreatedDateTime":"2015-10-27T02:49:00Z","Content":"\n\u003Cp\u003EI\u0027m setting sights on Duna and/or Eve for my next unmanned mission in Career. This thread is helpful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-27T13:48:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Doslidnyk\u0022 data-cite=\u0022Doslidnyk\u0022\u003E\u003Cdiv\u003EI\u0027m setting sights on Duna and/or Eve for my next unmanned mission in Career. This thread is helpful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs long as you\u0027re not planning on landing on Eve any time soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E but yes, this has been very helpful. Thanks again to everyone!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zophos\u0022 data-cite=\u0022Zophos\u0022\u003E\u003Cdiv\u003EI\u0027ll second the recommendation for airbrakes - they\u0027re lower mass even than drogues, and you can deploy them in space and use them all the way down. I have a small science lander on my current Duna mission, with two airbrakes and four radial parachutes. Uses no fuel to land other than a deorbit burn to put periapsis in the atmosphere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI added two airbrakes, so currently using 2 airbrakes, 2 drogue chutes, 2 normal chutes.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003EOne thing to be aware of with struts: their mass is always attached to the \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Efirst\u003C/em\u003E\u003C/span\u003E node you lay down when you place them. Therefore, any time you\u0027re attaching a strut between a radial booster and the central body of the rocket, always start the struts from the outside booster, not from the central body. That way you\u0027ll drop the strut\u0027s mass when you drop the booster, instead of having it stick around.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice. I switched the location around on the struts - had no clue.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003EAnd some batteries, right? You\u0027ll want a lot more electricity storage than the command pod holds, if you want to be able to transmit science. (Yes, it\u0027s better to bring it back than to transmit. But you can transmit, and \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Ethen\u003C/em\u003E\u003C/span\u003E do another science grab to bring back with you. That way you can get a decent chunk of the tech benefit back home, before you actually bring your ship back.)\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I have two 400-charge batteries, which is also plenty to run the torque wheel on the way there.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlso: Reason for having 3 of every science experiment? That sounds kinda expensive. You\u0027re aware that you can re-use them, right? After you get science from them, send an EVA kerbal out to take the science out of the instrument, and then go back to the command pod (which stores the science result in the pod). This leaves the instrument empty and available to take another science reading. Make sure that you have a scientist along, since they\u0027re the only ones who can reset the Science Jr. and the goo canister to let them be used multiple times.\u003C/p\u003E\u003Cp\u003EYou\u0027re familiar with the ability of science instruments to get different readings for different situations, yes? e.g. the thermometer gets one reading for \u0022space high over\u0022, one for \u0022space near\u0022, one for \u0022upper atmosphere\u0022, one for \u0022flying\u0022 (per biome!), one for landed (per biome). Different science instruments get per-biome results for different situations, so it\u0027s good to be familiar with that so you can squeeze out every last drop of science from your visit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour second paragraph was the primary reason I had 3 of each. The reason was so I could capture as many as possible while de-orbiting/re-orbiting. It\u0027s somewhat difficult to EVA from \u0022flying over Midlands\u0022 or \u0022In Duna\u0027s upper atmosphere\u0022 (though I \u003Cem\u003Emight\u003C/em\u003E be able to pull off an upper atmosphere grab) and collect science modules, and impossible to EVA during a flight to collect it. So, if I went over multiple biomes on the way down or up, and I wasn\u0027t too focusing on not getting blown up, I could open up the bay real quick and have options to choose from regarding what was still an unused module. But, I dropped the module number to 2 because I just now realized I could set an action group to log one group\u0027s data over one biome/situation, and a second action group to log the other group\u0027s data over a biome/situation, which saves me valuable time in trying to collect as much as possible. So I could probably pull off an \u0022upper atmosphere\u0022 grab which allows me to drop it down to 2 in hopes that I can collect two different biomes while \u0022in flight\u0022 above them.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Snark\u0022 data-cite=\u0022Snark\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAs long as they\u0027re on the main rocket and not the lander itself, I wouldn\u0027t worry about it. The rocket\u0027s so massive that the decouplers are a pretty small fraction of it, so you\u0027re not losing much. If you tried to hack it with a smaller decoupler, you\u0027d end up with something so floppy that you\u0027d need struts to make up for it, which would largely cancel out the mass benefit of using the smaller decouplers.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, I\u0027ll keep that in mind. I was on the fence about using it or not using it, but was noticing some stability issues arising from smaller decouplers, and had assumed the weight increase was worth the part about not having my rocket spinning around its decoupler.\u003C/p\u003E\u003Cp\u003ESide question about transmitters: I was going to use the Communotron 16 because of the 0.05 weight, but does that work outside of Kerbin\u0027s SOI or at another planet? I could use the 88-88 but no reason to if that\u0027s unnecessary extra weight.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-27T13:53:53Z\u0022 title=\u002210/27/2015 01:53  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 27, 2015\u003C/time\u003E by mabarry3\u003C/strong\u003E\n\u003Cbr\u003ERemoving accidental additional code\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-27T15:34:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EAs long as you\u0027re not planning on landing on Eve any time soon \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Elanding\u003C/em\u003E\u003C/span\u003E on Eve is trivially easy. It\u0027s easier than Duna, probably the easiest place in the solar system outside of Kerbin\u0027s moons.\u003C/p\u003E\u003Cp\u003EIt\u0027s taking off again that\u0027s the hard part. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EI added two airbrakes, so currently using 2 airbrakes, 2 drogue chutes, 2 normal chutes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBe aware that the airbrakes and drogue chutes will be useless for slowing your speed below several dozen meters per second. May be worth going up to 4 normal chutes (by which I mean the radially-attached ones), like you had on the command pod to begin with.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EYour second paragraph was the primary reason I had 3 of each. The reason was so I could capture as many as possible while de-orbiting/re-orbiting. It\u0027s somewhat difficult to EVA from \u0022flying over Midlands\u0022 or \u0022In Duna\u0027s upper atmosphere\u0022 (though I \u003Cem\u003Emight\u003C/em\u003E be able to pull off an upper atmosphere grab) and collect science modules, and impossible to EVA during a flight to collect it. So, if I went over multiple biomes on the way down or up, and I wasn\u0027t too focusing on not getting blown up, I could open up the bay real quick and have options to choose from regarding what was still an unused module. But, I dropped the module number to 2 because I just now realized I could set an action group to log one group\u0027s data over one biome/situation, and a second action group to log the other group\u0027s data over a biome/situation, which saves me valuable time in trying to collect as much as possible. So I could probably pull off an \u0022upper atmosphere\u0022 grab which allows me to drop it down to 2 in hopes that I can collect two different biomes while \u0022in flight\u0022 above them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMakes sense. I generally don\u0027t bother with that on Duna, since its \u0022in flight\u0022 altitude is very low, and the atmosphere is so thin that by the time I get down to \u0022flying\u0022 altitude instead of \u0022upper atmosphere\u0022, I\u0027m generally descending at a fairly steep angle (unless I\u0027m landing a spaceplane).\u003C/p\u003E\u003Cp\u003EThis means that the horizontal distance traveled while \u0022flying\u0022 is quite short, so it\u0027s pretty rare for me to touch two biomes via \u0022flying\u0022 on one landing.\u003C/p\u003E\u003Cp\u003EGoing EVA to recover science from instruments is quite easy in \u0022upper atmosphere\u0022, as long as you\u0027re holding on to a ladder the whole time (want to be careful about letting go and flying, since your kerbal is much draggier than the ship and you can get swept away easily). It\u0027s especially easy if the instruments are mounted just outside the command pod door, so the kerbal can hop out, grab science, and hop back in again in just a couple of seconds.\u003C/p\u003E\u003Cp\u003EMy usual pattern for science recovery (to minimize the number of copies of instruments I need to carry):\u003C/p\u003E\u003Cp\u003E1. Gather everything in space, before entering atmosphere to land the ship.\u003C/p\u003E\u003Cp\u003E2. In upper atmosphere, hop out briefly to grab the science.\u003C/p\u003E\u003Cp\u003E3. Acquire science while \u0022flying\u0022, but don\u0027t try to recover from the instruments.\u003C/p\u003E\u003Cp\u003E4. Land. Recover the \u0022flying\u0022 science. Do \u0022landed\u0022 measurements and retrieve those.\u003C/p\u003E\u003Cp\u003E5. If by some chance I \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Edid\u003C/em\u003E\u003C/span\u003E cross biome boundaries while \u0022flying\u0022, I got at most two. One of them I got during the descent, and retrieved the science from the instruments after landing. The other I can acquire during ascent, and retrieve from the instruments after achieving orbit.\u003C/p\u003E\u003Cp\u003EThat pattern only requires one of each instrument (though in practice I generally have two goo canisters, to balance the mass).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-30T02:19:00Z\u0022 title=\u002210/30/2015 02:19  AM\u0022 data-short=\u00228 yr\u0022\u003EOctober 30, 2015\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-27T16:00:47Z","Content":"\n\u003Cp\u003ESo, is drogue vs. airbrakes mostly a personal preference where you choose one to get you below chute deployment speed but there\u0027s no point in packing both drogue and airbrakes?\u003C/p\u003E\u003Cp\u003EAs far as science goes... I guess I like having a little wiggle-room right now in case I mess something up. Extra dV, extra science modules for if I miss something or can\u0027t make it down to recover, etc. I may (most likely) change that once I get into a better pattern (since this would be my first attempt at actually recovering a significant amount of things and all that), but for this first attempt I\u0027ll try to keep it down to a set of two just so if I mess up and don\u0027t capture everything I need to, I have a second set that can do the job. Your pattern seems to be better than mine and makes more sense though for sure.\u003C/p\u003E\u003Cp\u003EAlso Snark, it appears you had a bit of a code malfunction at the end of your last message, you may want to double check the end there.\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-28T22:48:16Z","Content":"\n\u003Cp\u003EAnd my ships are on their way to Duna!\u003C/p\u003E\u003Cp\u003EI decided to send a second one behind it for safety and bonus science reasons, creatively called the \u0022Floating Fuel Tank\u0022, which should get to low Duna orbit with something around 2500-3000 units of liquid fuel left, meaning I should have enough fuel available to add to the lander to visit a few different biomes and possibly even Ike, or I may go straight from Duna to Ike and ignore other biomes for now, trying to sneak some more science in where there\u0027s no atmosphere and lower gravity.\u003C/p\u003E\u003Cp\u003EDo you guys know where screenshots from the F1 function are stored? I can do shift \u002B Prt Sc but that causes my engines to fire, making it annoying because I have to F5, screenshot, F9 to not mess anything up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll let you guys know how it\u0027s going \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks (massively) for all the help! First interplanetary launch, check... now I just need to not get myself blown up!\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/1aGrC\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022http://imgur.com/a/1aGrC\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003C/blockquote\u003E\u003Ca href=\u0022http://imgur.com/a/1aGrC\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-10-28T23:14:16Z\u0022 title=\u002210/28/2015 11:14  PM\u0022 data-short=\u00228 yr\u0022\u003EOctober 28, 2015\u003C/time\u003E by mabarry3\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"technion","CreatedById":85380,"CreatedDateTime":"2015-10-29T09:55:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDo you guys know where screenshots from the F1 function are stored? I can do shift \u002B Prt Sc but that causes my engines to fire, making it annoying because I have to F5, screenshot, F9 to not mess anything up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECheck C:\\Program Files (x86)\\Steam\\steamapps\\common\\Kerbal Space Program\\Screenshots.\u003C/p\u003E\n"},{"CreatedByName":"The Optimist","CreatedById":151904,"CreatedDateTime":"2015-10-29T22:51:42Z","Content":"\n\u003Cp\u003Eyour rocket is too damn big\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-10-30T02:07:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The Optimist\u0022 data-cite=\u0022The Optimist\u0022\u003E\u003Cdiv\u003Eyour rocket is too damn big\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI never said I didn\u0027t overbuild. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-10-30T02:39:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003ESo, is drogue vs. airbrakes mostly a personal preference where you choose one to get you below chute deployment speed but there\u0027s no point in packing both drogue and airbrakes?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey\u0027re not quite the same. Compared with drogues, airbrakes can be used at much higher speeds, but are less effective at slowing you down a lot in the under-500m/s range.\u003C/p\u003E\u003Cp\u003EFor example, you can use airbrakes as a reentry aid; depending on circumstances, they can even be an alternative to using a heatshield.\u003C/p\u003E\u003Cp\u003EDrogues are pretty specialized. The only thing they\u0027re good for is getting you from 500 m/s down to 250 m/s. Faster than 500, you can\u0027t deploy them. Slower than 250, you don\u0027t need them because regular chutes work much better. But within that range, they work really well; much better, kilogram for kilogram, than airbrakes.\u003C/p\u003E\u003Cp\u003EOn Kerbin, this rarely comes up. Lots of craft have a terminal velocity under 250 m/s and get along just fine with regular chutes and nothing else. And for craft that do fall faster than 250, it\u0027s usually not much more, and airbrakes are good enough to get the speed down to 250 before you go splat.\u003C/p\u003E\u003Cp\u003EHowever, there\u0027s one place where drogues become useful, and that\u0027s Duna. The air is thin enough that you can easily be going around 500 m/s when you get low, and you likely don\u0027t have much time to slow down. Airbrakes may have trouble keeping up with that, particularly if the craft is a bit massy. Drogues can come in really handy there.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EAnd my ships are on their way to Duna!\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EDo you guys know where screenshots from the F1 function are stored? I can do shift \u002B Prt Sc but that causes my engines to fire, making it annoying because I have to F5, screenshot, F9 to not mess anything up \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll let you guys know how it\u0027s going:)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECongratulations! Bon voyage.\u003C/p\u003E\u003Cp\u003EScreenshots are where technion said. FYI, in case you don\u0027t already know, you can hit F2 to toggle all of the UI on/off, which can be useful for removing clutter when taking a screenshot.\u003C/p\u003E\n"}]}