{"TopicId":124253,"ForumId":16,"TopicTitle":"Test \u0026quot;Thumper\u0026quot; Mission 90-100km","CreatedByName":"Daviator","CreatedById":153009,"CreatedDateTime":"2015-11-01T22:32:11Z","PageNum":1,"Articles":[{"CreatedByName":"Daviator","CreatedById":153009,"CreatedDateTime":"2015-11-01T22:32:11Z","Content":"\n\u003Cp\u003EHey there,\u003C/p\u003E\u003Cp\u003EI\u0027m trying to complet the mission above, but I\u0027m totally lost. How can I get the SRB in a stable orbit and fire it? Any ideas how this can be solved? I\u0027ve seen some postings to this mission, but most refere to altitudes between 15-20km.\u003C/p\u003E\u003Cp\u003EThank you!\u003C/p\u003E\u003Cp\u003EDaviator\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-01T23:53:32Z","Content":"\n\u003Cp\u003EOne sneaky way to make it easier: take all the fuel out of it in the VAB. Then it\u0027s pretty light, easy to get up to altitude. The game doesn\u0027t care if it goes WHOOSH when you click the staging button. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe main challenge will be to keep the thing stable, but you could probably work something out with some radially-attached liquid boosters as far forward as possible.\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-11-02T00:02:10Z","Content":"\n\u003Cp\u003EI have a separate, related question about this. Sometimes I see contracts to have me lug things to ludicrous places (I think I had one to go to low Eve orbit then fire), and they don\u0027t complete if the part is already activated there, so do you really need to lug (empty or not) the thing all the way there then activate it? I was thinking of one workaround (primarily for LFO engines) being to get there using the item, deactivate it move it right there farther along the staging sequence (move it up a stage or something), and then activate normal staging sequence which should activate the engine. Would that work to complete the contract? If not, I see no reason to lug heavy stuff around somewhere and not be able to use it \u0027til I get there.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-02T00:08:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EI have a separate, related question about this. Sometimes I see contracts to have me lug things to ludicrous places (I think I had one to go to low Eve orbit then fire), and they don\u0027t complete if the part is already activated there, so do you really need to lug (empty or not) the thing all the way there then activate it? I was thinking of one workaround (primarily for LFO engines) being to get there using the item, deactivate it move it right there farther along the staging sequence (move it up a stage or something), and then activate normal staging sequence which should activate the engine. Would that work to complete the contract? If not, I see no reason to lug heavy stuff around somewhere and not be able to use it \u0027til I get there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYah, that works. Another way to make it work is to put it in the place in the staging sequence where you need to run the test, but manually activate it earlier (e.g. by right-clicking on it and clicking the \u0022Activate Engine\u0022 button.\u003C/p\u003E\u003Cp\u003EThat said: These days, such contracts generally also include a \u0022Run Test\u0022 button on the item. I\u0027ve found that even if the contract \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Esays\u003C/span\u003E\u003C/em\u003E \u0022activate through the staging sequence,\u0022 I can just ignore that, stage it the way I like to, and then when I get to the place, just click the \u0022Run Test\u0022 button. Works just fine. (Before you take my word for that, though, would be good to verify that you \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ehave\u003C/span\u003E\u003C/em\u003E a Run Test button, for example while still sitting on the launch pad.)\u003C/p\u003E\n"},{"CreatedByName":"pincushionman","CreatedById":98495,"CreatedDateTime":"2015-11-02T00:52:22Z","Content":"\n\u003Cp\u003EPart testing will also be overhauled in the next versions, so don\u0027t get too worked up about the minutae right now.\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-11-02T02:19:01Z","Content":"\n\u003Cp\u003EI you do want to haul a full 8t booster into orbit you can mount the booster upside down on top of a stack fairly easily with a small liquid fuel engine and tank underneath it and a probe core and battery. If you\u0027re pointing prograde the booster test will de orbit the test vehicle. Back when parts test were the only type of contract I hauled those things all over the place for testing.\u003C/p\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-11-02T02:23:06Z","Content":"\n\u003Cp\u003EExcept that Thumper is SRB so you can\u0027t deactivate then activate. For SRBs, make sure you dump solid fuels so your payload isn\u0027t too heavy.\u003C/p\u003E\n"},{"CreatedByName":"Daviator","CreatedById":153009,"CreatedDateTime":"2015-11-02T11:22:45Z","Content":"\n\u003Cp\u003EThanks for you answers!\u003C/p\u003E\u003Cp\u003ECan you maybe give me a configuration which fulfills the profile?\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-11-02T12:24:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Daviator\u0022 data-cite=\u0022Daviator\u0022\u003E\u003Cdiv\u003EThanks for you answers!\u003Cp\u003ECan you maybe give me a configuration which fulfills the profile?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne easy way could be, from top to bottom:\u003C/p\u003E\u003Cp\u003EBattery/chute/probe core, stack decoupler, (empty) Thumper SRB, two radially attached Thumper SRBs attached via radial decouplers OR attached to a stack decoupler on the bottom of the original Thumper. Maybe (probably) some fins. Launch, get up to target altitude, and then activate the engine through staging to complete the contract. Decouple it, come down, use parachute, profit.\u003C/p\u003E\n"},{"CreatedByName":"Daviator","CreatedById":153009,"CreatedDateTime":"2015-11-02T13:12:03Z","Content":"\n\u003Cp\u003EI need a stable orbit in 90-100 km, this is actually the most difficult part \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-11-02T13:56:45Z","Content":"\n\u003Cp\u003EA little trickier, but still doable; this should work:\u003C/p\u003E\u003Cp\u003EPod/chute/battery, stack decoupler, empty Thumper, LT800 fuel tank (I think that\u0027s the name), LV-909 Terrier engine, and then 2-4 radially attached Thumpers on the side of the Terrier or surface attached to a stack decoupler beneath the terrier. You may need to tone down the thumpers a bit so they don\u0027t go to fast too soon, so try to knock down the thrust limiter until you have a thrust:weight ratio of 1.2-1.5 on the launchpad.\u003C/p\u003E\u003Cp\u003EGet as high as possible on the thumpers, turn on the terrier and try to make orbit. Run the thumper once you get to orbit (that terrier fuel tank should be plenty to get you there).\u003C/p\u003E\u003Cp\u003Eif that doesn\u0027t work, let me know, I could attempt til I see what works to make orbit once I\u0027m free.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-02T16:43:30Z","Content":"\n\u003Cp\u003EYeah, just make it empty or nearly so and treat it as payload. An empty Thumper isn\u0027t too heavy, though it\u0027s kind of long. Put it atop a nice stable launcher, and if you like add/enlarge the fins on the bottom of the launcher.\u003C/p\u003E\n"},{"CreatedByName":"Stoney3K","CreatedById":139954,"CreatedDateTime":"2015-11-02T19:54:21Z","Content":"\n\u003Cp\u003EYou can also put the launcher on the sides of the Thumper instead of on the bottom by using decouplers or just by surface attaching it.\u003C/p\u003E\u003Cp\u003EThree LV-T45\u0027s should be more than the thrust you would *ever* need to get that empty can to orbit.\u003C/p\u003E\n"}]}