{"TopicId":124557,"ForumId":16,"TopicTitle":"Getting from the pole to an equatorial orbit","CreatedByName":"ineon","CreatedById":152379,"CreatedDateTime":"2015-11-06T06:58:47Z","PageNum":1,"Articles":[{"CreatedByName":"ineon","CreatedById":152379,"CreatedDateTime":"2015-11-06T06:58:47Z","Content":"\n\u003Cp\u003EMy situation: I am currently at Minmus north pole (landed) getting science and my orbiter is in a equatorial orbit. What is the most efficient way of meeting back up to dock? \u003C/p\u003E\u003Cp\u003EI don\u0027t think that doing a polar orbit and doing a plane change seems efficient. Going straight south (suborbital) and then attempting to match orbit gets me a giant apoapse. Or do I just accept that it will take some significant dv?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-09T08:47:06Z\u0022 title=\u002211/09/2015 08:47  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 9, 2015\u003C/time\u003E by ineon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2015-11-06T07:05:29Z","Content":"\n\u003Cp\u003EHow much dV do you have? Minmus often requires less fuel than you thought and sometimes it\u0027s just enough to do it directly.\u003C/p\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2015-11-06T07:11:12Z","Content":"\n\u003Cp\u003EAditionally, perform the maneuver with the craft that has the fuel to spare. If that would be the one in an equatorial orbit, give that the polar orbit.\u003C/p\u003E\u003Cp\u003EOr vice versa.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-06T07:29:53Z","Content":"\n\u003Cp\u003EGiven the low gravity, simply landing near the equator and taking off again may be an easier way. I\u0027m not sure whether it would cost less to land or to put your Ap very high and do it far from the planet (which is more efficient than close to the planet).\u003C/p\u003E\n"},{"CreatedByName":"ineon","CreatedById":152379,"CreatedDateTime":"2015-11-06T07:32:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FancyMouse\u0022 data-cite=\u0022FancyMouse\u0022\u003E\u003Cdiv\u003EHow much dV do you have?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPlenty. I can easily get back, I was just interested in doing it efficiently.\u003C/p\u003E\u003Cp\u003Edv that I don\u0027t use now is dv for later missions.\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-11-06T08:44:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ineon\u0022 data-cite=\u0022ineon\u0022\u003E\u003Cdiv\u003EPlenty. I can easily get back, I was just interested in doing it efficiently.\u003Cp\u003Edv that I don\u0027t use now is dv for later missions.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo a short burst that gets your apo over the equator and at the height you desire, then do a circulation and correctional burst simultaneously. That ought to be the most efficient way of doing it.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-11-06T10:44:05Z","Content":"\n\u003Cp\u003E^--- This. Always try to combine plane changes with other burns.\u003C/p\u003E\u003Cp\u003EBut put your apoapsis a little higher than you need. Not only does that reduce your speed at apoapsis (and thus makes your plane change require less dV), but you\u0027ll also lose some altitude while turning your orbit 90 degrees sideways. And after you have turned your orbit, having a higher apoapsis than your target will let you phase to a rendezvous.\u003C/p\u003E\n"}]}