{"TopicId":124502,"ForumId":16,"TopicTitle":"I want to get orbit the Mun and get back to Kerbin more efficiently","CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-05T17:05:46Z","PageNum":1,"Articles":[{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-05T17:05:46Z","Content":"\n\u003Cp\u003ENine times out of ten, once I\u0027ve gotten into orbit around Mun (if I get that far!), I don\u0027t have sufficient fuel left to get back to Kerbin. I\u0027ve tried adding fuel to the bottom stage, but that hasn\u0027t helped. I\u0027ve tried adding to the top (last stage) but with same results. I \u003Cem\u003Ehave \u003C/em\u003Edone it, but only about twice, I think. I\u0027m doing something wrong but I don\u0027t know what.\u003C/p\u003E\u003Cp\u003EMy purpose is to do more science around the Mun. I\u0027m not ready to try a landing yet. I\u0027d like to get this whole business down pat first.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-12T22:16:21Z\u0022 title=\u002211/12/2015 10:16  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 12, 2015\u003C/time\u003E by JackBush\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-11-05T17:09:25Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://lmgtfy.com/?q=mun\u002Btutorial\u0022 rel=\u0022external nofollow\u0022\u003EPlenty of good tutorials\u003C/a\u003E out there if you know where to look. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/cmAMGJm-bwU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2015-11-05T17:24:52Z","Content":"\n\u003Cp\u003EPlease post a picture of the whole craft at launch, so people can see where extra efficiencies might be gained.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-05T17:45:04Z","Content":"\n\u003Cp\u003E\u002B1 to posting pics of the rocket.\u003C/p\u003E\u003Cp\u003EA Mun mission requires the following dV:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EGet into LKO, around 3000-3400 m/s depending on ship design\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETransfer from LKO to Mun, around 800 m/s\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEnter munar orbit, around 300 m/s\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELand on the munar surface, around 800 m/s with an efficient suicide burn\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETake off from the mun, 800 m/s with an efficient ascent profile\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EHead home to Kerbin, around 300 m/s\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EReentry and landing, 0 m/s.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EPossible problems you may be having:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cstrong\u003EYou just don\u0027t have enough dV. \u003C/strong\u003EIf you know accurately how much dV you have in each stage of the rocket, that takes a lot of trial-and-error guesswork out of it. The \u003Ca href=\u0022https://en.wikipedia.org/wiki/Tsiolkovsky_rocket_equation\u0022 rel=\u0022external nofollow\u0022\u003ETsiolkovsky rocket equation\u003C/a\u003E helps with this. In KSP terms, to find the dV of a stage: divide the starting mass by the ending mass, take the natural logarithm, multiply by engine Isp, multiply by 9.81, and that\u0027s your dV in m/s for the stage.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EInefficient munar capture.\u003C/strong\u003E Make sure you\u0027re approaching the Mun with a low Pe when you depart from Kerbin, so that you can make your Mun capture burn at a low altitude to take maximum advantage of \u003Ca href=\u0022https://en.wikipedia.org/wiki/Oberth_effect\u0022 rel=\u0022external nofollow\u0022\u003EOberth effect\u003C/a\u003E.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EInefficient landing\u003C/strong\u003E. This is step 4 above. Search for \u0022suicide burn\u0022 in the tutorials and learn how to do a good one.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cstrong\u003EInefficient munar takeoff\u003C/strong\u003E. Make sure your ascent profile is reasonable. Basically, crank your ship over to practically horizontal immediately upon liftoff, then punch the throttle to 100% and get yourself into as low a circular orbit as you can.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThose are the biggest pitfalls to a munar mission. It\u0027s also possible to get fancy with an Apollo-style mission, where you leave an orbiter around the Mun and descend to the surface with just a lander, which comes up and docks before heading home. This has the advantage that you don\u0027t have to transport the fuel for step #6 down to the surface and back again, but it\u0027s a more challenging design and if you\u0027re new to munar landings, may be better to stick with a simple land-and-return.\u003C/p\u003E\u003Cp\u003EAlso, one last \u0022emergency cord\u0022 that you can pull: If it turns out that you have \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cem\u003Ealmost\u003C/em\u003E\u003C/span\u003E enough fuel but not quite to get home from Kerbin-- i.e. if you can get into Munar orbit again after landing, but then can\u0027t get home because you don\u0027t have that last 300 m/s or so-- then there\u0027s one measure you can do in extremis: send your pilot home without a ship. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Kerbal EVA packs are ridiculously overpowered and have around 300 m/s of dV in them, which is enough to send you home from orbit around the Mun. And kerbals are surprisingly tough: they can reenter Kerbin\u0027s atmosphere, fall out the sky, and land on the surface (sea or land, doesn\u0027t matter) unharmed.\u003C/p\u003E\u003Cp\u003ESo if it comes to that, then once you get into munar orbit, you just go EVA, take the science out of your instruments and/or command pod, and go home. For a \u0022naked\u0022 kerbal, you want to set your re-entry periapsis much higher than you would for a ship, since kerbals are both draggier and less heat-resistant than ships are. A good Pe for an EVA kerbal is up around 45 km (or a smidgeon higher), as opposed to around 30km for a ship.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-05T17:58:30Z\u0022 title=\u002211/05/2015 05:58  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 5, 2015\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FlyingPete","CreatedById":127384,"CreatedDateTime":"2015-11-05T18:23:30Z","Content":"\n\u003Cp\u003EThere\u0027s also the somewhat amusing method of \u0027get out and push\u0027 if you\u0027re just a few m/s short of getting a re-entry trajectory. Point the ship prograde, then EVA a Kerbal, get behind and use the EVA pack to thrust forward. Theoretically this gives you infinite dV (since the EVA pack is refuelled when you return to the ship) but it\u0027s not really practical for anything more than those last few m/s. Once the Pe is inside the atmosphere, you\u0027ll go back to Kerbin eventually even if it takes a few passes.\u003C/p\u003E\n"},{"CreatedByName":"Tatonf","CreatedById":146283,"CreatedDateTime":"2015-11-05T18:29:58Z","Content":"\n\u003Cp\u003EFor beginners I would recommend a 6500-7000 m/s delta-V budget.\u003C/p\u003E\n"},{"CreatedByName":"Highguard","CreatedById":150696,"CreatedDateTime":"2015-11-05T18:34:24Z","Content":"\n\u003Cp\u003ESection 3 of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/79658-Exploring-The-System-A-design-tutorial-campaign-0-90-Final?p=1183116\u0026amp;viewfull=1#post1183116\u0022 rel=\u0022external nofollow\u0022\u003Ethis post by Pecan\u003C/a\u003E is a really good explanation of how to design a vehicle for Kerbin lunar missions. Those are for landings, but the principles will help your missions too.\u003C/p\u003E\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-11-05T18:41:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JackBush\u0022 data-cite=\u0022JackBush\u0022\u003E\u003Cdiv\u003ENine times out of ten, once I\u0027ve gotten into orbit around Mun (if I get that far!), I don\u0027t have sufficient fuel left to get back to Kerbin. I\u0027ve tried adding fuel to the bottom stage, but that hasn\u0027t helped. I\u0027ve tried adding to the top (last stage) but with same results. I \u003Cem\u003Ehave \u003C/em\u003Edone it, but only about twice, I think. I\u0027m doing something wrong but I don\u0027t know what.\u003Cp\u003EMy purpose is to do more science around the Mun. I\u0027m not ready to try a landing yet. I\u0027d like to get this whole business down pat first.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf redesigning the lander is something you\u0027re willing to do, start small. I have experimentally verified the following myself: a lander with nothing but the basic 90-unit fuel tank, a single Spark engine, the black one-seat command capsule, and the basic nosecone parachute can take off from the Mun, reorbit, make it back to Kerbin, and land safely with fuel to spare.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027ve tried adding fuel to the bottom stage, but that hasn\u0027t helped.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou added \u003Cstrong\u003Efuel\u003C/strong\u003E......did you also add \u003Cstrong\u003Eengines?\u003C/strong\u003E Just adding fuel will allow your ship to fly longer, but it will also fly slower, and as you pile on more fuel tanks, each additional unit of fuel will do less and less for you. The basic rule is that you want to get out of Kerbin\u0027s atmosphere and into orbit as quickly as possible. So, when adding oomph to the liftoff stage, put on an addtional engine or two.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027ve tried adding to the top (last stage) but with same results.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAdding weight on the top is usually counterproductive. As a general rule with the rockets I build, the launchpad weight is five to ten times the weight of the final payload that makes it into Kerbin orbit. Add one pound at the top, and you need ten pounds at the bottom to lift it. So focus on taking weight off your lander. Get a lander design you like, then work on putting enough muscle on the liftoff and transfer stack. If your liftoff comes up just a tad short, grab a few solid rocket boosters and radial-mount them to the first stage.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-11-05T20:23:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://lmgtfy.com/?q=mun\u002Btutorial\u0022 rel=\u0022external nofollow\u0022\u003EPlenty of good tutorials\u003C/a\u003E out there if you know where to look. \u003Cp\u003E( embedded video )\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAttention: that video is from summer 2013 and will not necessarily represent a working solution for the current state of the game. Should have googled a little harder perhaps? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe real treasure trove of up-to-date tutorials can be found here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/28352\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/28352\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-05T20:44:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Oafman\u0022 data-cite=\u0022Oafman\u0022\u003E\u003Cdiv\u003EPlease post a picture of the whole craft at launch, so people can see where extra efficiencies might be gained.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the craft I\u0027ve been using, with and without additions to try to make life easier once I have the orbit on the Mun. As I said, at this point I\u0027m not ready to try a landing, just collect science and get home.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imgur.com/NiI2MhB\u0022 alt=\u0022NiI2MhB\u0022\u003E\u003Ca href=\u0022http://imgur.com/NiI2MhB\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/NiI2MhB\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2015-11-05T20:50:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EAttention: that video is from summer 2013 and will not necessarily represent a working solution for the current state of the game. Should have googled a little harder perhaps? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003Cp\u003EThe real treasure trove of up-to-date tutorials can be found here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/28352\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/28352\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, some things have changed. Most notably the aerodynamics and a some engine tweaking here and there. But the basic theory is still the same.\u003C/p\u003E\u003Cp\u003EThe most important thing that has not been changed is the sheer amount of very useful tutorials that can be very easily found if you actually bother to look for them.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-05T21:00:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JackBush\u0022 data-cite=\u0022JackBush\u0022\u003E\u003Cdiv\u003EThis is the craft I\u0027ve been using, with and without additions to try to make life easier once I have the orbit on the Mun. As I said, at this point I\u0027m not ready to try a landing, just collect science and get home.\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/NiI2MhB\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/NiI2MhB\u003C/a\u003E \u003Ca href=\u0022http://imgur.com/NiI2MhB\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/NiI2MhB\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour swivel is a bit under-utilized. It can handle a much higher load than that without the SRBs. You can make it cheaper. Here is a full lander at only 20k funds.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7l0BLZX.png\u0022 alt=\u00227l0BLZX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOP, I don\u0027t have a landing tutorial, but to get the most out of your launches, watch this. The more you can save on launch, the more you get to use going to the Mun.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/n6EQjFeo3nw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-05T21:04:58Z\u0022 title=\u002211/05/2015 09:04  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 5, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"manaiaK","CreatedById":129599,"CreatedDateTime":"2015-11-06T04:11:06Z","Content":"\n\u003Cp\u003EJack,\u003C/p\u003E\u003Cp\u003Econgrats on learning how to post a picture! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs Alshain said, you want most of the fuel in the lower stage. Move one of the 400s down below the decoupler, and maybe add another 200 down there too. Note that in Alshain\u0027s craft the liquid-fuel engine fires at the same time as the boosters (see \u0022more minor\u0022 tip below).\u003C/p\u003E\u003Cp\u003EA few small things: \u003C/p\u003E\u003Cp\u003EThe Mk1 Cockpit is heavy compared to the Mk1 Command Pod, so use that instead. With the pod, you\u0027ll only need one round Mk16 parachute on top, for an additional mass saving of one less parachute.\u003C/p\u003E\u003Cp\u003EMore minor: if you put the next-stage engine into the same stage as the decoupler below it, you get an instant start-up so you don\u0027t lose any speed from atmospheric drag. This applies to the engine in stage 4 and the decouplers in stage 5. Click on the engine symbol and drag it down into stage 5. Or use Alshain\u0027s method -- drag the engine down to stage 6, in which case add even more fuel for the engine.\u003C/p\u003E\u003Cp\u003EThe Science Junior can be brought back with the service bay and pod if you put the heat shield and decoupler underneath it. You should still only need the one parachute, I think. If you discard it you will need your Kerbal to EVA to it and collect the science from it before returning to Kerbin.\u003C/p\u003E\u003Cp\u003EIf you can get to the Mun OK and get into orbit, then the problem might be how you\u0027re trying to get back. This is a two-stage process. First burn so you *just* escape the Mun (as shown in Map view). This should only take 200 m/s of delta-vee (not very much fuel.) \u003C/p\u003E\u003Cp\u003EOnce you are back in orbit around Kerbin, burn retrograde until your Pe drops into the atmosphere of Kerbin. (In map view hover your mouse over the Pe while you\u0027re burning; do it slowly using the Shift key rather than Z.)\u003C/p\u003E\u003Cp\u003E(This requires a variable amount up to say 500 m/s depending on the previous maneuver and where you do it.) This second burn is most cheaply done at Ap, but anywhere within 30 degrees of it will be fine.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-06T16:40:07Z","Content":"\n\u003Cp\u003E\u002B1 to manaiaK\u0027s excellent advice on saving mass by using the Mk1 pod with a single chute.\u003C/p\u003E\u003Cp\u003EPrevious posters give good advice about moving fuel downward from the 3rd stage to the 2nd. A word as to \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ewhy\u003C/span\u003E\u003C/em\u003E that\u0027s a good idea:\u003C/p\u003E\u003Cp\u003EAn efficient multi-stage rocket should exponentially shrink with each successive stage. That is, you want each stage to be a fraction of the last one. (Exactly what the fraction should be depends on your design, but in general it should be no more than half). You\u0027re packing 9 tons of LFO, but you\u0027ve got 4 tons in the 2nd stage and 5 tons in the 3rd, which is backwards. If you rearrange that to a better exponential pattern (i.e. the 3rd stage has half the fuel of the 2nd), you\u0027ll get more bang for your buck. So move some fuel downward, so that you have 6 tons in your 2nd stage and 3 tons in your 3rd stage.\u003C/p\u003E\u003Cp\u003EAlso: How do you have the thrust on your SRBs configured?\u003C/p\u003E\u003Cp\u003EOne feature that a lot of folks who are new to KSP don\u0027t realize: even though you can\u0027t throttle SRBs while they\u0027re burning, you \u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ecan\u003C/span\u003E\u003C/em\u003E decide their thrust level at design time in the VAB (right click on them and choose a thrust percentage; they\u0027re 100% by default).\u003C/p\u003E\u003Cp\u003EHere\u0027s why it\u0027s important: Just eyeballing your photo, I\u0027d estimate your launchpad mass at around 37 tons. Thumpers get 250 kN thrust at sea level, so that would put your TWR at about (250 * 3) / (37 * 9.8) = 2.07. That\u0027s pretty high-- you\u0027ll end up going too fast too low, and wasting a lot of your fuel fighting aerodynamic drag. (You\u0027re getting a lot of extreme Mach effects when you launch, amirite?)\u003C/p\u003E\u003Cp\u003ETo avoid that, it\u0027s best to have a launchpad TWR of no more than 1.5. To get that, you\u0027d need to set your SRB thrust level at around (37 * 9.8 * 1.5) / (250 * 3) = 72.5% (adjust as needed if I\u0027ve guessed your mass wrong at 37 tons). Doing this will give you a longer, gentler ride: you\u0027ll be going slower when you\u0027re lower down (so not so much wasted fuel fighting drag), and by running at lower thrust level, your SRBs will burn longer.\u003C/p\u003E\u003Cp\u003EIn fact, you could even pack some more SRBs on there. Even if you\u0027re bumping up against part-count limits, dropping down to 1 parachute from 4 will save you three parts, so you can spare 1 more SRB with nosecone and decoupler, right?\u003C/p\u003E\u003Cp\u003ESo you could go from 3 Thumpers to 4. If you do that, you\u0027d need to lower the thrust even further-- your mass would go up to around 45 tons, so to maintain a 1.5 TWR, you\u0027d want the SRBs to be at (45 * 9.8 * 1.5) / (250 * 4) = 66%.\u003C/p\u003E\u003Cp\u003EEven better, you can stretch your SRB burn time even farther if you take those four SRBs and give them different thrust levels. Instead of adding one group of 4, you can add two groups of 2. Give one of them a thrust higher than 66%, and the other a thrust lower than 66% by the same amount-- for example, you could run pair A at 80% and pair B at 52%. All four of of them would be activated together at launch, but pair A will burn out (and be jettisoned) first, giving you additional burn time on pair B until it burns out and you activate the Swivel.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2015-11-06T18:16:05Z","Content":"\n\u003Cp\u003EWell, nobody is going to mention a free return trajectory? if he just wants science from around the Mun, then a Munar flyby should be fine, no?\u003C/p\u003E\u003Cp\u003EOr does he want to orbit and take EVA reports from above all the biomes possible?\u003C/p\u003E\n"},{"CreatedByName":"the_pazter","CreatedById":153052,"CreatedDateTime":"2015-11-06T19:28:31Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003ETry using Asparagus staging and using three stages,\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E1- Launch\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E2- Orbit insertion and transfer\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E3- Capture and Free Return\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003ELet me know how it goes\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:arial;\u0022\u003E- the_pazter\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-06T19:33:11Z","Content":"\n\u003Cp\u003ENo Asparagus. Asparagus \u002B KSP 1.0 = BAD. LFO engines cost way too much to be using them for boosters. Use a 2 stage center stack with SRB boosters.\u003C/p\u003E\n"},{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-07T14:57:42Z","Content":"\n\u003Cp\u003EExcellent stuff. Thanks.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis is great. Thanks. Where do I find out what my TWR is? I\u0027ve just added KER, by the way, but I\u0027m not sure what all it\u0027s telling me.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EHow do you do a Munar flyby?\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-07T16:07:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JackBush\u0022 data-cite=\u0022JackBush\u0022\u003E\u003Cdiv\u003EWhere do I find out what my TWR is? I\u0027ve just added KER, by the way, but I\u0027m not sure what all it\u0027s telling me.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t use KER myself, so someone else could help you with that. But TWR is straightforward enough that you can get it without resort to KER.\u003C/p\u003E\u003Cp\u003EIt\u0027s just your total engine thrust divided by your weight. So if you want to know your launchpad TWR, just add up the kN thrust of all the engines you fire at takeoff (you can get that number off the parts list in the VAB, be sure to use the ASL value and not the vacuum value), then divide by the total mass of your ship (it\u0027s available in the engineer\u0027s report at bottom right), then divide by 9.81 m/s2 (Kerbin gravity), and there you are.\u003C/p\u003E\u003Cp\u003EI hear KER is very informative, I expect it probably just tells this number somewhere. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JackBush\u0022 data-cite=\u0022JackBush\u0022\u003E\u003Cdiv\u003E How do you do a Munar flyby?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis just refers to flying past the Mun (i.e. entering its SoI) without necessarily entering orbit or landing. It\u0027s cheaper in terms of dV than orbit, since you don\u0027t have to spend any fuel once you get there-- just go flying past. If you arrange it right, you can get a \u0022free return\u0022 and come back to Kerbin afterwards without spending fuel, so the only fuel it takes beyond getting to low Kerbin orbit is the roughly 800 m/s burn to boost out to the Mun.\u003C/p\u003E\u003Cp\u003EThere are lots of good tutorials out there about how to go to the Mun, since that\u0027s generally the first thing players want to do after getting to Kerbin orbit. The TL;DR here is: get into low Kerbin orbit, wait until you see the Mun peeking over the eastern horizon, then burn prograde until your raise your apoapsis up enough to get a Mun encounter (it will take around 800 m/s). There\u0027s a lot more detail around that if you care about more details (such as whether you want to come back home again, whether or not you have maneuver nodes unlocked in the tracking station, etc.) but that\u0027s the gist of it.\u003C/p\u003E\n"},{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-09T13:27:01Z","Content":"\n\u003Cp\u003EThanks for your help, Snark.\u003C/p\u003E\n"}]}