{"TopicId":124691,"ForumId":16,"TopicTitle":"Need some help. I\u0026#039;m new to KSP","CreatedByName":"Synergy25","CreatedById":150994,"CreatedDateTime":"2015-11-08T03:04:11Z","PageNum":1,"Articles":[{"CreatedByName":"Synergy25","CreatedById":150994,"CreatedDateTime":"2015-11-08T03:04:11Z","Content":"\n\u003Cp\u003EI just started KSP about a week ago. I\u0027m having trouble completing contracts. I\u0027ve done just about all the basic ones except for 2500 speed and 100k away. I can reach 2500 speed and 100k away but I explode upon reentry. I never had this problem before with the other easier contracts. Does anyone have any tips on how to not explode? I only have the first tech trees unlocked so I have limited parts and controls for my rockets. Thanks to all that reply.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-11-08T03:11:14Z","Content":"\n\u003Cp\u003ESynergy25,\u003C/p\u003E\u003Cp\u003E Welcome to KSP!\u003C/p\u003E\u003Cp\u003E First off, this question should really be in the gameplay questions and tutorials section.\u003C/p\u003E\u003Cp\u003E In your case, the problem is that you\u0027re launching too steeply vertical, and so you\u0027re reentering too steeply vertical as a result. \u003C/p\u003E\u003Cp\u003E This means the thinner atmosphere at high altitude doesn\u0027t have the time to slow you down before you smack into denser air at crazy- high speed and overheat like a meteor.\u003C/p\u003E\u003Cp\u003E Try gently curving your flight path horizontal during launch.\u003C/p\u003E\u003Cp\u003E Best,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Enorats","CreatedById":141841,"CreatedDateTime":"2015-11-08T03:51:15Z","Content":"\n\u003Cp\u003EYou\u0027re most likely trying to launch straight up.. which means you\u0027re coming straight down as well, and smacking back into the rotating atmosphere at extreme speed. Suborbital flights can be pretty dangerous because it\u0027s possible to reenter crazy fast like that.\u003C/p\u003E\u003Cp\u003EWhen launching, try to turn the rocket a bit as early as possible (turn it like 10-15 degrees down the 90 degree line, so you\u0027re shooting out at an angle over the sea). Also, keep in mind that unmanned craft don\u0027t always need to be recovered - depending on the mission. \u003C/p\u003E\u003Cp\u003ESince you\u0027re new, also be aware that mods can really make or break this game. The stock game is pretty basic in terms of info and controls, which seems more user friendly at first.. but in my opinion you\u0027re better off using things like Mechjeb (an autopilot mod) as a beginner. It\u0027ll teach you a lot of what you need to know to fly a ship if you watch what it does. For a lot of things mods like that are just downright required, there\u0027s a reason NASA doesn\u0027t eyeball orbital maneuvers and instead lets the computer calculate things exactly. Extreme precision is required for many tasks.\u003C/p\u003E\u003Cp\u003EFinally, keep in mind that the \u0022world first\u0022 contracts are generally just completed in the course of playing the game. Grab other contracts as well and let the world firsts just complete as they will. The goal at first is generally getting to orbit, then either Mun (the game WANTS to send you there first normally), or Minmus (easier of the two, as it\u0027s far easier to land on).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-08T03:55:11Z\u0022 title=\u002211/08/2015 03:55  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 8, 2015\u003C/time\u003E by Enorats\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Coyote27","CreatedById":141964,"CreatedDateTime":"2015-11-08T06:34:57Z","Content":"\n\u003Cp\u003EYeah, to echo and expound on what others have said, generally try to aim your rocket in a gentle curve, say, 5 degrees as soon as you leave the pad, a 45 degree inclination at around 15km and approaching horizontal at around 35-40km. This will put your ship into orbit efficiently as long as you have enough delta-V to get there and not too much drag. \u003C/p\u003E\u003Cp\u003E(If your ship is unstreamlined and you can\u0027t do very much about that, then you\u0027ll want to go more vertically for longer and level off later so you get through more atmosphere before building up speed.) \u003C/p\u003E\u003Cp\u003EYou might want to try playing with the throttle a bit too if you are using liquid engines, because going too fast too low will also slow you down a lot with drag. Try not to get any orange flames from drag friction until you\u0027re leveled off at the 35-40km level, where the air is thin enough that it won\u0027t matter very much.\u003C/p\u003E\u003Cp\u003EFinally, to keep your ships controllable and pointed the right direction, it helps to put fins on the tail and to not make them too tall and skinny, or else they might flip around. Once you unlock gimballed engines, RCS thrusters or especially Vernors, you can start to make much more controllable and maneuverable rockets.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-08T06:43:26Z\u0022 title=\u002211/08/2015 06:43  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 8, 2015\u003C/time\u003E by Coyote27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"uglyduckling81","CreatedById":129740,"CreatedDateTime":"2015-11-08T07:04:00Z","Content":"\n\u003Cp\u003EBasically everything these guys have suggested is wrong.\u003C/p\u003E\u003Cp\u003EDon\u0027t listen to any of these non-Kerbal suggestions.\u003C/p\u003E\u003Cp\u003EWhat you actually need to do is put MOAR BOOSTERS on.\u003C/p\u003E\u003Cp\u003EWhat ever fly\u0027s straight up under power must also return straight down under power.\u003C/p\u003E\u003Cp\u003EIncrease the size of the rocket. Put MOAR stages in. Full throttle up. Controlled throttle on the way down. No chutes for a powered landing. Lots of reaction wheels FTW.\u003C/p\u003E\u003Cp\u003E(I would make a demo video for you but I\u0027m moving tomorrow and the gaming rig is already packed)\u003C/p\u003E\n"},{"CreatedByName":"RocketPropelledGiraffe","CreatedById":143863,"CreatedDateTime":"2015-11-08T07:39:16Z","Content":"\n\u003Cp\u003E@duckling: Well, if the rocket falls apart and explodes the answer is not MOAR BOOSTERS. The answer is MOAR STRUTS, of course!\u003C/p\u003E\u003Cp\u003EOn a more seroius note:\u003C/p\u003E\u003Cp\u003ESynergy, you got some good hints already. \u003C/p\u003E\u003Cp\u003EDo you already know how to get into orbit? The trick is to aim for the 2500 m/s speed horizontally - Going straight up very fast will only make you fall to the ground harder. That\u0027s why you want to pitch your rocket sideways at the start, as the other\u0027s mentioned.\u003C/p\u003E\u003Cp\u003ELet me just post two very instructive images for this from \u003Ca href=\u0022https://what-if.xkcd.com/58/\u0022 rel=\u0022external nofollow\u0022\u003ERandall Munroe\u003C/a\u003E:\u003C/p\u003E\u003Cp\u003E\u0022Space is not like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://what-if.xkcd.com/imgs/a/58/orbit_tall.png\u0022 alt=\u0022orbit_tall.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESpace is like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://what-if.xkcd.com/imgs/a/58/orbit_wide.png\u0022 alt=\u0022orbit_wide.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u0022\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2015-11-08T21:58:52Z","Content":"\n\u003Cp\u003EHow-to question moved to the how-to subforum.\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-11-08T22:37:55Z","Content":"\n\u003Cp\u003EWhile I agree with the suggestions here for the most part, I would disagree with the recommendation to get an autopilot mod. If, early on, you get used to mechjeb flying everything for you, then you\u0027ve taken out an entire portion of the game (design/plan/fly reduced to design/plan/Mechjeb). While Mechjeb surely is useful, I would say to at least not until you can fly difficult missions \u0022seat-of-your-pants\u0022 before considering something that plays the game for you.\u003C/p\u003E\n"},{"CreatedByName":"nekogod","CreatedById":103186,"CreatedDateTime":"2015-11-09T13:51:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EWhile I agree with the suggestions here for the most part, I would disagree with the recommendation to get an autopilot mod. If, early on, you get used to mechjeb flying everything for you, then you\u0027ve taken out an entire portion of the game (design/plan/fly reduced to design/plan/Mechjeb). While Mechjeb surely is useful, I would say to at least not until you can fly difficult missions \u0022seat-of-your-pants\u0022 before considering something that plays the game for you.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan\u0027t second this enough. Mechjeb is great for tasks that can be boring and monotonous once you\u0027ve nailed them like flying to orbit, but used to early it can really hamper your learning curve. A friend of mine used it from the first day he played and then after one patch or another whilst waiting for it to be updated he basically couldn\u0027t play the game cause he didn\u0027t know how to do anything manually.\u003C/p\u003E\n"}]}