{"TopicId":125114,"ForumId":16,"TopicTitle":"Drill and ISRU heating","CreatedByName":"Rematog","CreatedById":134130,"CreatedDateTime":"2015-11-11T19:23:35Z","PageNum":1,"Articles":[{"CreatedByName":"Rematog","CreatedById":134130,"CreatedDateTime":"2015-11-11T19:23:35Z","Content":"\n\u003Cp\u003ESquaded again! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I\u0027ve got a mining ship on Ike set up for refueling my Duna lander and one at Kerbin to re-fuel missions in LKO before heading out, plus an asteroid catcher and an now unused old one on Mun. NOW, the mining takes forever with hot drill and I have to turn the ISRU on and off. Why does Squad think we want to be HVAC designers in a rocket game!!! So my question is, what can be done to my existing ships, or do I need to trash all four of my existing mining ships and build new ones and launch them to the planet systems they serve...... I\u0027m thinking the \u0022solution\u0022 is to limp along with what I\u0027ve got in place, finish one last planned Duna landing, then quit playing.... I really hate having to re-do a whole bunch of work because I didn\u0027t put radiators on things when I launched them three months ago (real life time). \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Chr\u003EThis is not the firstime the game I was in was messed up by update changes. I restarted Career mode from scratch when Beta came out. Jeb was on way back from Jool in atomic rocket, midflight 55% of fuel un-usable (can\u0027t use Oxy in atomic rocket motor anymore) and it\u0027s just not worth efforts, plus all science on ship lost even if I rescue him from way big orbit he could make with 45% fuel left (and mass of all that Oxy to boot!). Not to mention that half my science gone.\u003Chr\u003E PS, the lines are because I don\u0027t seem to be able to get Paragraph (return) to work in this forum.\u003Chr\u003EIf I do build new mining ships, any suggestions what radiators are needed on drill and full size ISRU?\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-12T18:05:17Z\u0022 title=\u002211/12/2015 06:05  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 12, 2015\u003C/time\u003E by Rematog\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sardia","CreatedById":149922,"CreatedDateTime":"2015-11-11T19:51:33Z","Content":"\n\u003Cp\u003EYou could use kis and kas mod to attach radiators to your ship. Hope it helps\u003C/p\u003E\n"},{"CreatedByName":"SlashTen","CreatedById":150607,"CreatedDateTime":"2015-11-11T23:44:53Z","Content":"\n\u003Cp\u003EDo your mining ships have a docking port? You could dock a little probe with some radiators. The new radiators draw heat from everywhere on the ship. Put a docking port on both sides of the probe, and you will still be able to dock to other ships.\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2015-11-12T08:19:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rematog\u0022 data-cite=\u0022Rematog\u0022\u003E\u003Cdiv\u003EIf I do build new mining ships, any suggestions what radiators are needed on drill and full size ISRU?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been testing this today. Full size ISRU, fed by six drills, on an 9% ore patch on Minmus, with Level 4 engineer (don\u0027t have Level 5 in career yet). Six Gigantor solar panels with their passive radiators didn\u0027t do squat. One medium-size Thermal Control System was close - the ISRU starts cold and low efficiency, gets to 100% efficient at 1000K, then overheated to around 1100K and 65-73% efficiency (nighttime and daytime, IIRC). So I\u0027m guessing two of those medium TCS will be enough to stay on 100%, for part count of 2 and 0.5T mass. Maybe one medium and 2-3 smalls, for part count 3-4 and mass 0.35-0.4T.\u003C/p\u003E\u003Cp\u003EOne thing that surprised me - I\u0027m used to solar panels clipping through each other and cargo bays without problems - the extending TCS radiator caused some hellacious explosions when intersecting with both solar panels and cargo bay doors. Use caution in placement and test on the launchpad.\u003C/p\u003E\u003Cp\u003EDidn\u0027t look at drill temps. Is that a thing now?\u003C/p\u003E\n"},{"CreatedByName":"mabarry3","CreatedById":152371,"CreatedDateTime":"2015-11-12T13:56:15Z","Content":"\n\u003Cp\u003EIf you add too many thermal control systems, is it possible to keep a drill or ISRU always lower than full capacity since it can\u0027t heat up to optimal temperature?\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-11-12T14:09:45Z","Content":"\n\u003Cp\u003EYou could just not update to 1.0.5.\u003C/p\u003E\n"},{"CreatedByName":"Rematog","CreatedById":134130,"CreatedDateTime":"2015-11-12T15:20:15Z","Content":"\n\u003Cp\u003Efourfa, thank you. I remember the drill having a very high temp and if memory serves, it\u0027s eff. went down too. If I keep playing and replace my mining ships, I\u0027ll try the med with a small. Has anyone done this yet. By the way, anyone know why I can\u0027t use return to create a new paragraph in this forum anymore???\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-11-12T16:58:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mabarry3\u0022 data-cite=\u0022mabarry3\u0022\u003E\u003Cdiv\u003EIf you add too many thermal control systems, is it possible to keep a drill or ISRU always lower than full capacity since it can\u0027t heat up to optimal temperature?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt will always be able to heat to at least it\u0027s target temp. The current temp and target temp is annotated in the right click menu. (For example: 500K / 500K)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rematog\u0022 data-cite=\u0022Rematog\u0022\u003E\u003Cdiv\u003EIf I keep playing and replace my mining ships, I\u0027ll try the med with a small. Has anyone done this yet. By the way, anyone know why I can\u0027t use return to create a new paragraph in this forum anymore???\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s supposed to be about two small radiators for a drill, and maybe four for the miniISRU. Though I\u0027ve noticed that if you have lots of hot parts, you can get away with fewer radiators than if you added each individually. i.e. 6 drills don\u0027t seem to require 12 small radiators.\u003C/p\u003E\u003Cp\u003EAbout the enter key, must be something with your browser. Did you change or update recently?\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-12T17:01:28Z\u0022 title=\u002211/12/2015 05:01  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 12, 2015\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rematog","CreatedById":134130,"CreatedDateTime":"2015-11-12T18:02:43Z","Content":"\n\u003Cp\u003EClaw; Still using Internet Explorer 10. Work computer, IT doesn\u0027t upgrade much. THANKS for the drill cooling info. Still wonder why Squad things we all want to work on this. The cooling should be part of the drill/IRSU design.....\u003C/p\u003E\n"},{"CreatedByName":"tseitsei","CreatedById":139058,"CreatedDateTime":"2015-11-12T18:26:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rematog\u0022 data-cite=\u0022Rematog\u0022\u003E\u003Cdiv\u003E Still wonder why Squad things we all want to work on this. The cooling should be part of the drill/IRSU design.....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy would you want to work on designing any spaceship? You can just use stock crafts and download other peoples crafts from this forum.\u003C/p\u003E\u003Cp\u003EThe game gives us tools and parts to build working effective crafts BUT the game doesnt do it for us. Designing working crafts is big part of the gameplay.\u003C/p\u003E\n"},{"CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-11-12T19:08:46Z","Content":"\n\u003Cp\u003EI sent a ship to Mun last night that needs to drill and refuel to get back to Kerbin. It used the new mini Convertotron and mini drill. I had absolutely no issue having to \u0022stop\u0022 the converter or anything overheating. I must be missing something, which will no doubt come to bite me in the backside at the least convenient moment.\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2015-11-12T19:23:56Z","Content":"\n\u003Cp\u003ENone of it is a problem if you\u0027re willing to use warp. I agree it\u0027s an interesting and semi-realistic design challenge, balancing complexity against efficiency and part count\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2015-11-13T00:46:21Z","Content":"\n\u003Cp\u003EFurther testing: Radiator Panel (large) looks like the one to use. One per full-size ISRU, one per pair of drills (maybe a little less - one near four drills overheated slowly). Very light (0.05T), no extending deploy, very reasonable EC consumption (just be aware that it\u0027s always on, and plan accordingly). Now that I\u0027m reading the tech notes on the parts, this seems like the intended solution.\u003C/p\u003E\u003Cp\u003EFYI: I\u0027ve had some Kraken attacks when coming out of time warp while running the ISRU and drills.\u003C/p\u003E\n"},{"CreatedByName":"CorBlimey","CreatedById":134058,"CreatedDateTime":"2015-12-12T00:35:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222275046\u0022 data-ipsquote-contentid=\u0022125114\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221447375581\u0022 data-ipsquote-userid=\u0022151713\u0022 data-ipsquote-username=\u0022fourfa\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 13/11/2015, 00:46:21, fourfa said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFurther testing: Radiator Panel (large) looks like the one to use. One per full-size ISRU, one per pair of drills (maybe a little less - one near four drills overheated slowly). Very light (0.05T), no extending deploy, very reasonable EC consumption (just be aware that it\u0027s always on, and plan accordingly). Now that I\u0027m reading the tech notes on the parts, this seems like the intended solution.\n\u003C/p\u003E\n\u003Cp\u003E\nFYI: I\u0027ve had some Kraken attacks when coming out of time warp while running the ISRU and drills.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\ndo you have any comments on radiator panels vs. TCS?\n\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2015-12-12T01:56:25Z","Content":"\n\u003Cp\u003E\nyeah, the medium TCS is 5x the mass, for 1.25x the \u0027Core Heat xFer\u0027 and 5.3x \u0027Max Cooling.\u0027  It\u0027s not yet clear to me the difference between \u0027Core Heat xFer\u0027 and \u0027Max Cooling,\u0027 but if you match the mining equipment \u0027Required Cooling\u0027 with the \u0027Core Heat xFer\u0027 everything seems happy.  To do that for the large ISRU and two drills with two medium radiator panels costs 0.1t of mass and 0.05 EC/sec (note the tool tips show this in EC/min).  With the 2x medium / 1x large TCS it will cost 0.5 / 1.0t, and 0.25 / 0.5EC/sec.  \n\u003C/p\u003E\n\u003Cp\u003E\nEither way is handily covered by the 0.75EC/sec of a single RTG (which I almost always have on board for various reasons), and is dwarfed by the 60EC/sec of 1xISRU \u002B 2x large drills.  So I don\u0027t consider the electrical side to be a big deal either way, unless you forgot an RTG and found yourself in the dark, out of fuel and unable to start your fuel cells, and stuck.\n\u003C/p\u003E\n\u003Cp\u003E\nThe static radiator panels seem to pull that heat from great distances on the ship, no matter where they\u0027re placed.  I keep reading about only them pulling heat from two components away; I can only say that on the long timescale of mining, it just doesn\u0027t seem to matter in practice.  Day, night, warm planet, icy vacuum, also doesn\u0027t seem to make a difference.  Re-entry, engine burns, spaceplane ascent etc may be a different matter.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also noticed that extendable solar panels will happily clip through cargo bay doors, tanks, or components all day long, over and over.  This looks dumb and unrealistic, but it often happens that you get your cargo bay door deploy limit wrong, hit the wrong action group button, accidentally do something out of order, put deploy cargo bay doors and panels on the same action group, etc.  Do that with solar panels, no problem.  Do that with TCS panels, they will break.  They\u0027ll safely clip sometimes, then the next they will detonate your entire ship  (try it and see for yourself).  That can be a mission-ending catastrophe, from doing something routine like hitting the wrong action group.  Just beware, for me those panels seem to be Kraken bait.\n\u003C/p\u003E\n\u003Cp\u003E\nI tend to have a lot of kerbals flying around the ship in close proximity, moving science data from place to place, repacking chutes, etc.  I guess I\u0027m not a very good pilot, and I\u0027ve suffered a lot of broken solar panels and TCS panels from surprisingly slow-moving EVAs bumping the panels.  I no longer put them anywhere near crew hatches or science parts.  But for my own sanity I\u0027ve almost entirely stopped putting extending panels of any kind on my ships.  Fuel cells arrays have almost the same EC/kg as Gigantors but never break or burn up in atmo and never stop working in shadow or far from Kerbol, and the fuel use in practice is honestly negligible.  Run the numbers and see - if your mission is so close to the margin that fuel cells stealing a couple m/s of delta-V breaks the mission, you might want to revisit the design.\n\u003C/p\u003E\n\u003Cp\u003E\nI think that\u0027s all the comments I have!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-12T01:59:51Z\u0022 title=\u002212/12/2015 01:59  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 12, 2015\u003C/time\u003E by fourfa\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2015-12-12T02:05:44Z","Content":"\n\u003Cp\u003E\nAnd right after I wrote that, I read about this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/6009\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bugs.kerbalspaceprogram.com/issues/6009\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nWhich could explain my observations about the radiator distance from heat sources.  Though I still think that on the days-long timescale of mining, this doesn\u0027t rise to the level of \u0027bug\u0027\n\u003C/p\u003E\n"},{"CreatedByName":"CorBlimey","CreatedById":134058,"CreatedDateTime":"2015-12-12T09:18:55Z","Content":"\n\u003Cp\u003E\nthanks. The radiator panel sounds fine then - and fits nicely above/below the ISRU on the ore holding tank.\n\u003C/p\u003E\n\u003Cp\u003E\nI am still putting my stock ore mining operations into practice, having used other resource mods in the past instead.\n\u003C/p\u003E\n"}]}