{"TopicId":125338,"ForumId":16,"TopicTitle":"This ship goes screwy in flight and it shouldn\u0026#039;t","CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-13T21:46:56Z","PageNum":1,"Articles":[{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-13T21:46:56Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/UfwIr7u\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/UfwIr7u\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis excellent ship comes from Spheniscine\u0027s excellent How-to series and I\u0027ve already used it once to get to Minmus and (almost) back. (I ran out of gas!). But \u003Cem\u003E\u003Cstrong\u003Enow\u003C/strong\u003E\u003C/em\u003E once I\u0027ve released the SRBs, the ship goes out of control. The \u003Cem\u003Eonly\u003C/em\u003E change I made from the one that got there was to add two Mystery Goo units, which I\u0027d forgotten the first time.\u003C/p\u003E\u003Cp\u003ESpheniscine\u0027s article is here: \u003Ca href=\u0022http://www.lets-play-sphen.com/?p=449\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.lets-play-sphen.com/?p=449\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI am seriously concerned about this, and hope someone can offer some good advice. Thanks in advance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-15T15:48:32Z\u0022 title=\u002211/15/2015 03:48  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 15, 2015\u003C/time\u003E by JackBush\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-11-13T21:54:18Z","Content":"\n\u003Cp\u003EWell... I wouldn\u0027t call it an \u003Cem\u003Eexcellent\u003C/em\u003E ship per say. Its an okay ship that gets the job done. It looks like an aerodynamic nightmare to me. Im guessing it flips over after srb jettison? That\u0027s because afterward the rockets becomes much shorter and with those science jr\u0027s on that upper stage its acting like a giant sail that rips the rocket around. \u003C/p\u003E\u003Cp\u003EYou say this worked before in the past? How far in the past? If it worked 1.0\u002B then... I don\u0027t know maybe you\u0027ve just gotten lucky. There\u0027s no way that ship should fly easily. First things first. Are those engines the swivels or the fixed variant? Consider some aero fins they will help a lot. However. If you do you must put a pair on the SRB\u0027s as well. A larger pair followed by a smaller pair on the second stage.\u003C/p\u003E\u003Cp\u003EAnd upon further inspection... is that a reaction wheel in between those tanks? Loose that its doing nothing where its at its just making your structure weak. You may have to reconsider your fuel lines as well. Im guessing your feeding fuel to the outer tanks from that upper one. That\u0027s not good because as that upper tank drains before anything else making your CoM move farther down the rocket which will make handling even worse. So that\u0027s not helping. All in all its just a general lack of control authority. You need fins and if you don\u0027t have engines that gimbal yet you needs fins that can control the rocket.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-13T22:03:40Z\u0022 title=\u002211/13/2015 10:03  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 13, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2015-11-13T21:59:25Z","Content":"\n\u003Cp\u003EThe tutorial that the OP links is for 0.25, so yeah, this ship was not designed for the 1.0.x atmo. I\u0027m betting in too much drag in the top part of the rocket as the culprit for the flip as well ...\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-11-13T22:00:31Z","Content":"\n\u003Cp\u003EThat design is for an old version of KSP (v0.25). Nowadays you have much better options.\u003C/p\u003E\u003Cp\u003E1.) Remove the four radial science jr\u0027s\u003C/p\u003E\u003Cp\u003E2.) Add a single inline science jr\u003C/p\u003E\u003Cp\u003E3.) Add a mk1 crew cabin inline, between the pod and the heatshield. Yes, you must add a heatshield below anything you want to return to Kerbin. This is not optional.\u003C/p\u003E\u003Cp\u003E4.) Bring a scientist along who can reset the science jr and goo canister in flight, allowing you to reuse them over and over \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E (Remember to take the science out first)\u003C/p\u003E\u003Cp\u003EYour ship will have less drag, meaning it won\u0027t flip as easily, and it will also consume less fuel during launch.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-13T22:03:06Z\u0022 title=\u002211/13/2015 10:03  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 13, 2015\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-13T22:39:39Z","Content":"\n\u003Cp\u003EFirst off, thanks so much. I\u0027m still a noob, obviously. Yesterday is when that ship managed to make the trip so I guess I can say i\u0027m lucky. I shall begin rebuilding right away. BTW, I only said it was \u0022excellent\u0022 because it did make it and I was very excited. Thanks again. Much appreciated.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003E(Remember to take the science out first)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStreetwind, what did you mean by this?\u003C/p\u003E\n"},{"CreatedByName":"ElWanderer","CreatedById":114015,"CreatedDateTime":"2015-11-13T23:44:21Z","Content":"\n\u003Cp\u003EEVA the scientist, Right-click on the science junior or goo pod and choose \u0022take data\u0022. There will be a warning to click through that this expends the experiment (i.e. it can\u0027t be used again). That\u0027s okay as the scientist lets you clean-out/replenish the experiment - another Right-click option. Then you can use the experiment again. The EVAing scientist can then place the data they\u0027ve taken into a command pod to be recovered later. The scientist can also refresh experiments whose science data has been transmitted.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t \u0022take data\u0022 you can still reset the experiments, but that throws away the data they contain.\u003C/p\u003E\u003Cp\u003EOn that rocket: it\u0027s a pity I\u0027m not at my computer with the delta-v calculator. In v1.0 they made everything less efficient (lower ISP) to make up for changes in the atmosphere. Craft designs from before then can usually get to orbit fairly similarly, but tend to have less fuel range once in space.\u003C/p\u003E\n"},{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-14T00:14:42Z","Content":"\n\u003Cp\u003EThat\u0027s great ElWanderer. Never quite understood how that worked. I\u0027m trying to create a decent ship now.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-11-14T10:56:01Z","Content":"\n\u003Cp\u003EThere\u0027s one thing you should be aware of...\u003C/p\u003E\u003Cp\u003EThe Mk1 Crew Cabin doesn\u0027t really have a door. If you EVA your scientist directly from it, it may get stuck somewhere inside your ship, and even if he doesn\u0027t... well, he cannot get back in.\u003C/p\u003E\u003Cp\u003EIt\u0027s a better idea to use the crew transfer functionality to shuffle your pilot into the crew cabin and your scientist into the command pod. Then the scienist can EVA from the pod and re-enter it again. And you can shuffle your pilot back afterwards if you want to fly with SAS functionality.\u003C/p\u003E\n"},{"CreatedByName":"BoilingOil","CreatedById":153076,"CreatedDateTime":"2015-11-14T12:17:01Z","Content":"\n\u003Cp\u003EIn the center column, I see a small ring between the FL-T400 (?) tank and the FL-T800. just around where those fuel lines attach the side tanks. What is that? And why *is* that stage connected with fuel that hangs below it? Perhaps, removing those fuel lines and removing (or at least moving) that ring, might do some good to stability. Although, not much, from the looks of it.\u003C/p\u003E\u003Cp\u003EI\u0027m also quite worried about the change of symmetry. I\u0027d prefer keeping symmetry on my rockets the same from top to bottom. Not two-ways at the bottom and then three-ways at the top, because that spells disaster. But that\u0027s just *my* opinion.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2015-11-14T12:20:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JackBush\u0022 data-cite=\u0022JackBush\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003EThe \u003C/a\u003E\u003Cem\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003Eonly\u003C/a\u003E\u003C/em\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003E change I made from the one that got there was to add two Mystery Goo units, which I\u0027d forgotten the first time.\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003EThe \u003C/a\u003E\u003Cem\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003Eonly \u003C/a\u003E\u003C/em\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003Echange?\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022%7Boption%7D\u0022\u003EYou also changed from KSP beta 0.25 to Kerbal Space Program 1.0.x, which in terms of aerodynamics is as big a change as going from Wright Brothers Flier to Spitfire, and expecting similar flight behaviour.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-14T16:13:34Z","Content":"\n\u003Cp\u003EOkay, so what does everyone think of this ship, based on much of the above and a couple of things I found elsewhere: \u003Ca href=\u0022http://imgur.com/pvfwyd6\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/pvfwyd6\u003C/a\u003E \u003C/p\u003E\u003Cp\u003ETWR is 1.55, and Delta-V is 4377.66, according to MechJeb readings. The D-V is less than the minimum 4500 someone recommended but I don\u0027t know how to get it up any higher without wrecking the TWR.\u003C/p\u003E\n"},{"CreatedByName":"Shark4558","CreatedById":147537,"CreatedDateTime":"2015-11-14T16:28:57Z","Content":"\n\u003Cp\u003Ehello,a tip that you can use to your ship is adding a few solid fuel boosters,to lift-off the entire rocket,so when the rocket engines start,it starts per example at 2000 Meters of altitude,if that doesnt help,add a dedicated lifting stage \u002B the solid fuel boosters,and start both at the same time,just be careful to prevent exceeding the terminal speed,or drag goes too high.\u003C/p\u003E\u003Cp\u003Eif you have problems with the lifting stage\u002BSRB,just cut the throtlle of the liquid fuel rocket/s and that should help controlling the speed.\u003C/p\u003E\n"},{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-14T16:35:37Z","Content":"\n\u003Cp\u003EThanks, Shark. Two questions: what is a dedicated lifting stage? And how do you make sure different engines begin at the same time?\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-14T16:41:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JackBush\u0022 data-cite=\u0022JackBush\u0022\u003E\u003Cdiv\u003EOkay, so what does everyone think of this ship, based on much of the above and a couple of things I found elsewhere: \u003Ca href=\u0022http://imgur.com/pvfwyd6\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/pvfwyd6\u003C/a\u003E \u003Cp\u003ETWR is 1.55, and Delta-V is 4377.66, according to MechJeb readings. The D-V is less than the minimum 4500 someone recommended but I don\u0027t know how to get it up any higher without wrecking the TWR.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMuch improved!\u003C/p\u003E\u003Cp\u003EA few comments:\u003C/p\u003E\u003Cp\u003EFirst, beware of stacked fuel tanks, at least while you\u0027re in atmosphere. The engine at bottom will drain the stack from the top down, which is very bad for your aerodynamic stability because it lowers your CoM. Anywhere you can replace a stack of little tanks with one big one is a win.\u003C/p\u003E\u003Cp\u003EYou can add some aero stability by adding one of the really cheap Basic Fins down at the bottom of each of the radial boosters. The very low position gives the fin a nice lever arm to work with by putting it far below the CoM.\u003C/p\u003E\u003Cp\u003EDo you have fuel lines unlocked yet? If so, recommend adding a fuel line from the top of each of your radial boosters into the central stack. This lets your center engine drain the radial tanks, so that when it is time to jettison the boosters, your center stack still has a full load of fuel.\u003C/p\u003E\u003Cp\u003EHave you unlocked the Swivel yet? Can replace your center engine with one. The gimbal will help your stability.\u003C/p\u003E\u003Cp\u003EIf you want more dV, get rid of the three big fins on the center stack (you can move them down to the boosters), add three radial decouplers, and attach three Thumper SRBs. You first stage will be SRB-only. That way you don\u0027t start using your liquid fuel until you already have a fair bit of altitude and speed.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JackBush\u0022 data-cite=\u0022JackBush\u0022\u003E\u003Cdiv\u003EAnd how do you make sure different engines begin at the same time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe orange staging icons down at bottom right show how your stages will work. You can edit that by dragging them around. So to fire multiple engines at the same time, just drag their icons into the same stage.\u003C/p\u003E\n"},{"CreatedByName":"Shark4558","CreatedById":147537,"CreatedDateTime":"2015-11-14T16:44:10Z","Content":"\n\u003Cp\u003Ea dedicated lifting stage is normally a powerfull rocket engine (low eficiency-high thrust) that pushes every thing it as above it,it gives everything speed to start the ascent. \u003C/p\u003E\u003Cp\u003Eto ignite two engines at the same time,modify the staging sequence,in a example,you have the rocket engines in stage 1,and the solid fuel rockets on stage 2,you just move the SRB to the stage 1 and when you execute that stage,both engines start because they are in the same stage...\u003C/p\u003E\u003Cp\u003E(to move a engine in the staging sequence,left click the desired engine and then drag it to the desired stage,then release the left click and there is.)\u003C/p\u003E\n"},{"CreatedByName":"JackBush","CreatedById":149535,"CreatedDateTime":"2015-11-14T17:29:54Z","Content":"\n\u003Cp\u003EGreat stuff, guys! Thanks so much.\u003C/p\u003E\n"},{"CreatedByName":"BoilingOil","CreatedById":153076,"CreatedDateTime":"2015-11-14T18:42:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JackBush\u0022 data-cite=\u0022JackBush\u0022\u003E\u003Cdiv\u003EOkay, so what does everyone think of this ship, based on much of the above and a couple of things I found elsewhere: \u003Ca href=\u0022http://imgur.com/pvfwyd6\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/pvfwyd6\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat does indeed look a lot better. I see that some have already suggested you add some SRBs. I would go so far as to suggest that you replace the triple rockets at the bottom with those SRBs - Thumpers, most likely, if they are available to you.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-11-14T19:36:01Z","Content":"\n\u003Cp\u003EHonestly, if the liquid fuel boosters work, then stick with the old adage \u0022never change a running system\u0022. I mean sure, you save about 5,000 funds, but the entire first stage also loses a full third of its dV. Maybe his flight profile needs that dV.\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2015-11-14T20:21:42Z","Content":"\n\u003Cp\u003EStep 1: watch Scott Manley\u0027s video on gravity turn 1.0\u002B (everything older isn\u0027t just irrelevant but damaging)\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/_q_8TO4Ag0E?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EStep 2: keep calm and only use 1 of every science experiment. The probes are better than pilots at everything and scientists can reuse science parts. You literally only need 1 of every type of science part.\u003C/p\u003E\u003Cp\u003EStep 3: at stage 3 of your rocket it seems like a Spark rocket is firing directly into a Fl-800 fuel tank, which is full of compressed fuel. Which causes explosions from my personal experience.\u003C/p\u003E\u003Cp\u003EStep 4: ???\u003C/p\u003E\u003Cp\u003EStep 5: stealing people\u0027s underpants do not in fact yield money\u003C/p\u003E\n"},{"CreatedByName":"BoilingOil","CreatedById":153076,"CreatedDateTime":"2015-11-15T03:14:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EHonestly, if the liquid fuel boosters work, then stick with the old adage \u0022never change a running system\u0022. I mean sure, you save about 5,000 funds, but the entire first stage also loses a full third of its dV. Maybe his flight profile needs that dV.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf it works, yeah... Otherwise, use the 5,000 in saved funds to double the number of Thumpers. Have six in stead of three! Suddenly, there\u0027s dV to spare \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2015-11-15T10:06:20Z","Content":"\n\u003Cp\u003EAnd your rocket is overweight for the launchpad! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BoilingOil","CreatedById":153076,"CreatedDateTime":"2015-11-15T15:28:23Z","Content":"\n\u003Cp\u003EHehehehe, yeah, *that* could indeed happen! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"}]}