{"TopicId":125339,"ForumId":16,"TopicTitle":"New 1.05 Career and Parachute Question... HELP!!!","CreatedByName":"Soul","CreatedById":76895,"CreatedDateTime":"2015-11-13T22:00:07Z","PageNum":1,"Articles":[{"CreatedByName":"Soul","CreatedById":76895,"CreatedDateTime":"2015-11-13T22:00:07Z","Content":"\n\u003Cp\u003EHello everyone. I feel like a total noob and I\u0027ve been playing KSP since 0.24.\u003C/p\u003E\u003Cp\u003EI started a new career and like my second mission I\u0027m shooting Jeb up out of the atmo to about 70-80k. Coming straight back down I\u0027ve killed that poor ....... like 10 times today. The craft won\u0027t slow down enough for me to deploy my chutes. They just get burned up or ripped off because the standard Mk1 Command Pod \u002B Parachute \u002B Heat Shield won\u0027t slow down under 300km/s before slamming into the ground. How the hell am I supposed to fix this? I tried throwing a small solid rocket booster underneath to slow it down but that seems ........ to have to do. Am I missing something?\u003C/p\u003E\n"},{"CreatedByName":"Wolfos31","CreatedById":61724,"CreatedDateTime":"2015-11-13T22:04:53Z","Content":"\n\u003Cp\u003EYou\u0027re going almost straight up? That\u0027s your problem right there. Try to arc your trajectory more so that you spend more time in atmo which will slow you down better.\u003C/p\u003E\n"},{"CreatedByName":"Soul","CreatedById":76895,"CreatedDateTime":"2015-11-13T22:09:30Z","Content":"\n\u003Cp\u003EThank Wolfos... totally worked. I feel like a moron now. I mean, in the earlier versions I was able to get away with being lazy on the first few launches and just go straight up, lol. Cheers man, thanks!\u003C/p\u003E\n"},{"CreatedByName":"627","CreatedById":114918,"CreatedDateTime":"2015-11-13T22:55:03Z","Content":"\n\u003Cp\u003Ei have the same right now, a command pod, a mk1 crew pod, a fuel tank and a... terrier? not surehow the little thing is called. So even with the most shallow entry vector i won\u0027t slow down enough to open the chutes, i smash down with 500 m/s even at sea level.\u003C/p\u003E\u003Cp\u003ENot sure how to get more than a command pod down right now actually...\u003C/p\u003E\n"},{"CreatedByName":"Norpo","CreatedById":113342,"CreatedDateTime":"2015-11-13T23:14:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022627\u0022 data-cite=\u0022627\u0022\u003E\u003Cdiv\u003ENot sure how to get more than a command pod down right now actually...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve had success with landing with a cargo bay with a heat shield under it, and the mk1 command pod. The cargo bay is enough for some mystery goos (and later on a temp sensor), but when I tried to do a science jr. module as well the whole thing went nose down, which, of course, is not good.\u003C/p\u003E\u003Cp\u003EThank goodness you can remove science from modules and put them in the command pod while on EVA \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYeah, going up and straight down higher than ~60km is guaranteed death right now; an arc is absolutely necessary. Learnt that the hard way. No more simple suborbital hops!\u003C/p\u003E\n"},{"CreatedByName":"Vegetal","CreatedById":147251,"CreatedDateTime":"2015-11-14T04:16:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022627\u0022 data-cite=\u0022627\u0022\u003E\u003Cdiv\u003Ei have the same right now, a command pod, a mk1 crew pod, a fuel tank and a... terrier? not surehow the little thing is called. So even with the most shallow entry vector i won\u0027t slow down enough to open the chutes, i smash down with 500 m/s even at sea level.\u003Cp\u003ENot sure how to get more than a command pod down right now actually...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, with all that stuff you are going in nose first, ain\u0027t you?\u003C/p\u003E\u003Cp\u003EFlying like a missile won\u0027t stop you on reentry, the pod alone manages this because it goes flat side first, so it has a LOT of drag.\u003C/p\u003E\n"},{"CreatedByName":"Mahnarch","CreatedById":114432,"CreatedDateTime":"2015-11-14T04:40:55Z","Content":"\n\u003Cp\u003EWait at tick...\u003C/p\u003E\u003Cp\u003ESoul w/ question @ 17:00\u003C/p\u003E\u003Cp\u003EWolfos31 w/ answer @ 17:04\u003C/p\u003E\u003Cp\u003ESoul w/ praise @ 17:09?\u003C/p\u003E\u003Cp\u003EQuick question. Quick answer. Quick solution.\u003C/p\u003E\u003Cp\u003ENear identical reg dates.\u003C/p\u003E\u003Cp\u003EBoth quite handsome and well to do with the ladies?\u003C/p\u003E\u003Cp\u003EI think; A) Soul and Wolfos are the same person, or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E They are room mates sitting in the same room.\u003C/p\u003E\u003Cp\u003EWith the time difference - giving time to sign off and sign on - I\u0027d say \u0027Same person\u0027.\u003C/p\u003E\u003Cp\u003E*I\u0027m not besmirching anyone. I\u0027m just observing and having fun with that observation.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E...also, I\u0027m both of them!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E....not really.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"crash087","CreatedById":151606,"CreatedDateTime":"2015-11-14T09:31:43Z","Content":"\n\u003Cp\u003Esame person, or clones? and if they are clones, are they still considered the same person?\u003C/p\u003E\n"},{"CreatedByName":"Moh1336","CreatedById":146789,"CreatedDateTime":"2015-11-14T11:18:28Z","Content":"\n\u003Cp\u003EOnce a clone has free will it is its own person and can make its own choices. If it has cloned memories it may still use the originals history to make decisions but those decisions may not be the same clone to clone. \u003C/p\u003E\u003Cp\u003ESincerely Kerbal Bioengineer Department.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-11-14T14:45:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022627\u0022 data-cite=\u0022627\u0022\u003E\u003Cdiv\u003Ei have the same right now, a command pod, a mk1 crew pod, a fuel tank and a... terrier? not surehow the little thing is called. So even with the most shallow entry vector i won\u0027t slow down enough to open the chutes, i smash down with 500 m/s even at sea level.\u003Cp\u003ENot sure how to get more than a command pod down right now actually...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDrag.\u003C/p\u003E\u003Cp\u003ECome in flat side first; build the ship so that the reentry portion is aerodynamically stable flying in its highest-drag orientation. The heavier it is, the more drag you\u0027ll need.\u003C/p\u003E\u003Cp\u003EIf you\u0027ve got the tech, drogues and airbrakes work; so does retrothrust if you time it right. Control surfaces set as opposed flaps will do in a pinch, too.\u003C/p\u003E\n"},{"CreatedByName":"tranenturm","CreatedById":143304,"CreatedDateTime":"2015-11-14T15:55:51Z","Content":"\n\u003Cp\u003EAfter you clear the burn phase (and even during if you\u0027re careful) you can wiggle your capsule to slow down. Also, I set my reentry periapsis to between 20k and 30k and drag is enough to land me roughly where the periapsis point is.\u003C/p\u003E\n"},{"CreatedByName":"Mahnarch","CreatedById":114432,"CreatedDateTime":"2015-11-15T01:55:18Z","Content":"\n\u003Cp\u003EThanks for pooping on our party... party poopers.\u003C/p\u003E\u003Cp\u003EAlso, notice how you never see \u0027Soul\u0027 and \u0027Wolfos\u0027 in the same room at the same time?!\u003C/p\u003E\n"},{"CreatedByName":"Soul","CreatedById":76895,"CreatedDateTime":"2015-11-15T07:23:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mahnarch\u0022 data-cite=\u0022Mahnarch\u0022\u003E\u003Cdiv\u003EWait at tick...\u003Cp\u003ESoul w/ question @ 17:00\u003C/p\u003E\u003Cp\u003EWolfos31 w/ answer @ 17:04\u003C/p\u003E\u003Cp\u003ESoul w/ praise @ 17:09?\u003C/p\u003E\u003Cp\u003EQuick question. Quick answer. Quick solution.\u003C/p\u003E\u003Cp\u003ENear identical reg dates.\u003C/p\u003E\u003Cp\u003EBoth quite handsome and well to do with the ladies?\u003C/p\u003E\u003Cp\u003EI think; A) Soul and Wolfos are the same person, or \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E They are room mates sitting in the same room.\u003C/p\u003E\u003Cp\u003EWith the time difference - giving time to sign off and sign on - I\u0027d say \u0027Same person\u0027.\u003C/p\u003E\u003Cp\u003E*I\u0027m not besmirching anyone. I\u0027m just observing and having fun with that observation.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E...also, I\u0027m both of them!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E....not really.\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHahaha, this made me laugh. Believe it or not, we aren\u0027t the same person and don\u0027t even know each other. Just an awesome community here on the KSP forums!\u003C/p\u003E\n"},{"CreatedByName":"627","CreatedById":114918,"CreatedDateTime":"2015-11-15T08:49:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vegetal\u0022 data-cite=\u0022Vegetal\u0022\u003E\u003Cdiv\u003ESo, with all that stuff you are going in nose first, ain\u0027t you?\u003Cp\u003EFlying like a missile won\u0027t stop you on reentry, the pod alone manages this because it goes flat side first, so it has a LOT of drag.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eno, engine first, i have fuel left i use to brake, too. but even that is not enough. sometimes the rocket flips to nose first (mostly when fuel is empty) sometimes not and even with the most shalow angle I end up with 500 m/s on impact, no chance to drop the chute.\u003C/p\u003E\u003Cp\u003EI\u0027m early in career, so only 30 parts, no airbrakes or droques... kinda challenging now to rescue 3 kerbals from space instead of only one. next time i send a probe, lol.\u003C/p\u003E\n"},{"CreatedByName":"diggzakk","CreatedById":116618,"CreatedDateTime":"2015-11-15T09:37:56Z","Content":"\n\u003Cp\u003Eif you have more than one or two capsules on reentry from your rescue mission, this one is much to heavy and makes not enough drag, it doesnt help that much to brake with your fuel left because you make the angle more worst.. the only way to handle this is, to bring a full tank with you on reentry, make the angle flattest as you can like apoapsis/periapsis 70 and lower the periapsis maybe to 50, as soon you see the effects at 50km start burning slowly just that much that speed decrease, the trick is that you dont burn to much fuel to fast or the ship flips over and you have the nose down and mostly nomore chance to bring the nose up.. if this happens your last chance is to drop the tank immediatly, maybe if youre deep enough and slow enough it could be possible to survive with the tank and ÃƒÂ©ngine as this bigger machine has more drag if you are able to wobble the whole thing\u003C/p\u003E\u003Cp\u003Ei make a lot of tourist missions right now to get money, you know build a 12k credits rocket and bring home 40k credits etc.. so in the beginning i put up to 5 capsule for 4 tourists and it is hard to bring it down not crashing the surface, even only three capsules is difficult and better to choose a water landing, one time i put 6 capsules with a huge tank to slow it down, so it is possible but not that easy\u003C/p\u003E\u003Cp\u003Ethe most of the time i reach the magic 270m/s to open parachute is under 1000m, to less in the mountains \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-15T09:51:07Z\u0022 title=\u002211/15/2015 09:51  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 15, 2015\u003C/time\u003E by diggzakk\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2015-11-15T10:20:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Wanderfound\u0022 data-cite=\u0022Wanderfound\u0022\u003E\u003Cdiv\u003EDrag.\u003Cp\u003ECome in flat side first; build the ship so that the reentry portion is aerodynamically stable flying in its highest-drag orientation. The heavier it is, the more drag you\u0027ll need.\u003C/p\u003E\u003Cp\u003EIf you\u0027ve got the tech, drogues and airbrakes work; so does retrothrust if you time it right. Control surfaces set as opposed flaps will do in a pinch, too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis.\u003C/p\u003E\u003Cp\u003EI\u0027ve had plenty of successes with straight up-straight down missions. In fact, I\u0027ve come to the conclusion that such missions are practically encouraged by the lack of SAS in probes, active wings and vectoring engines in the early game. It\u0027s just easier than finessing a decent trajectory and the speeds aren\u0027t that massive.\u003C/p\u003E\u003Cp\u003EThe trick is ensuring your CoM is closer to the engine/heat shield than it is the capsule. Come in blunt-end first and you\u0027ll shed a lot of speed in the last 5km. I\u0027ve had a few missions where I flipped in the lower atmosphere, came in pointy-end first and smashed into the ground.\u003C/p\u003E\n"},{"CreatedByName":"627","CreatedById":114918,"CreatedDateTime":"2015-11-15T12:55:21Z","Content":"\n\u003Cp\u003Eso, this did the trick:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://picload.org/image/pclacgo/orbiter.jpg\u0022 alt=\u0022orbiter.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow it is quite easy, I can open the chute around 8-6km.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2015-11-15T13:49:34Z","Content":"\n\u003Cp\u003EThis is better in Gameplay Questions, so I\u0027ve moved it.\u003C/p\u003E\u003Cp\u003EAlso, in my early career games I surface attach a structural girder on top of my pod, then put a chute (or test payload with chute underneath) on that.\u003C/p\u003E\u003Cp\u003EThe extra drag really helps slow my descent after a flight.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-11-15T19:02:46Z","Content":"\n\u003Cp\u003EAnother thing to bear in mind, you can get a surprisingly large amount of help from body lift.\u003C/p\u003E\u003Cp\u003EFor example, let\u0027s say you have a Mk1 command pod, sitting on top of the 2t LFO tank, with a Terrier underneath. If you launch on a reasonably shallow trajectory, (i.e. you\u0027re not going straight up and down), then when you\u0027re reentering, do it butt-first, but don\u0027t hold perfectly retrograde: fly \u0022tipped\u0022, so that you\u0027re leading with the engine and the command pod is pointed about 35 degrees below retrograde.\u003C/p\u003E\u003Cp\u003EThe aero force against the side of the fuel tank generates a surprisingly large amount of lift, which will keep your ascent shallow and you\u0027ll slow down a \u003Cem\u003Elot. \u003C/em\u003EI\u0027ve done reentry from orbit this way, with a craft like that, and it\u0027s not hard to get the speed down to 200 m/s or so when still several kilometers above the surface.\u003C/p\u003E\n"},{"CreatedByName":"ForScience6686","CreatedById":144187,"CreatedDateTime":"2015-11-15T19:45:17Z","Content":"\n\u003Cp\u003EI\u0027ve been employing a similar trick. I have started turning off SAS and allowing the pod, cargo bay, and science jr, and heat shield to wobble on re entry. The added landing legs begin to overheat and I add roll into the equation. This with the wobble has increased my altitude above 6km where I can safely deploy regular chutes. IHave not ran into issues with the craft flipping to prograde. Flying at retrograde as not been very successful, usually end up with very tight margin of deployment.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-11-15T20:53:14Z","Content":"\n\u003Cp\u003EEven if you screw up and end up going in head-first with a small chute, pod, 2t fuel tank, and terrier, you can survive!\u003C/p\u003E\u003Cp\u003EPitch and yaw as hard as you can, so that you\u0027re pointing up from prograde and to one side or the other. Below about 20km, you\u0027ll be unable to pull the nose up as much as you might like, but it\u0027s still just enough to slow you down to 250 m/s at about 1500 m altitude. Just remember: you need to point *UP* -- point down and body lift just pulls you down faster. The sideways trajectory makes you spiral a bit, which bleeds a tiny bit extra speed. With this trick you can even survive a grassland landing spot if you time it just right!\u003C/p\u003E\u003Cp\u003E(Not that I would have frequent personal experience with this...)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAnother dumb trick in case you can\u0027t slow down enough because your reaction wheels can\u0027t stop your from pointing face-first: just before you enter the atmosphere, pitch up 30 degrees. Then stabilize there, and as you enter, hold the yaw key so you\u0027re in a flat spin, pitched up 30-40 degrees. As the atmosphere thickens, you\u0027re spin-stabilized to have a whole bunch of drag and upward body lift. This reduces your risk of overheating.\u003C/p\u003E\u003Cp\u003EMake sure you keep enough electric charge to implement my previous stupid trick, because you\u0027ll need it.\u003C/p\u003E\n"}]}