{"TopicId":125749,"ForumId":16,"TopicTitle":"Physics Question","CreatedByName":"MajorGosnell","CreatedById":152388,"CreatedDateTime":"2015-11-17T20:39:11Z","PageNum":1,"Articles":[{"CreatedByName":"MajorGosnell","CreatedById":152388,"CreatedDateTime":"2015-11-17T20:39:11Z","Content":"\n[URL]https://youtu.be/7XERvNss6Xw[/URL] I created a Speedracer for a challenge,while launching she went onto her side and kept going full speed.\u003Cbr\u003E\nQuestion is:How the hell didnt she blow up.\u003Cbr\u003E\nI ran the launch with no input 4 times same result each time.\u003Cbr\u003E\nOnce spectacularly hittiing the floodlight at the end of the runway.\n"},{"CreatedByName":"Venusgate","CreatedById":125730,"CreatedDateTime":"2015-11-17T21:31:57Z","Content":"\nMaybe its the side effect of the bouyancy upgrade. angle of impact is now computed more accurately. Makes me wonder if you can ditch a plane on land at a angle of \u0026lt;1 degree :P\n"},{"CreatedByName":"GeneralVeers","CreatedById":148918,"CreatedDateTime":"2015-11-17T22:01:29Z","Content":"\nWow! I failed to see a problem with your racer, Major. When that thing dropped on its side it was really stable and launched like a boss!\u003Cbr\u003E\n\u003Cbr\u003E\n:D\u003Cbr\u003E\n\u003Cbr\u003E\nYeah, I know--not helping. Anyway: with a lot of space planes, I\u0026#39;ve observed a tendency for the plane to drift to one side of the runway or the other at takeoff--and your racer has a very narrow wheel base. So it wouldn\u0026#39;t take much for the thing to tip over.\u003Cbr\u003E\n\u003Cbr\u003E\nAs to why it didn\u0026#39;t go explodies, I noticed just before takeoff that the racer seemed to be hovering a tiny bit above the ground (though that might have been you pulling full left on the figurative stick). I do know the cockpit you used does generate some lift, and that lift might have been causing your racer to not be \u0022hitting\u0022 the ground as hard as it would have.\n"},{"CreatedByName":"Right","CreatedById":80269,"CreatedDateTime":"2015-11-17T23:07:24Z","Content":"\nTheres a lot going on there, but I believe it comes down to two things: 1. the size and method of mounting lend to the booster being very stable (It sleds instead of catching on the ground), 2. impact tolerance is an upper limit to acceleration caused by a collision - since the ground wasn\u0026#39;t causing any acceleration (or very little anyways) the booster was safe.\n"}]}