{"TopicId":125764,"ForumId":16,"TopicTitle":"Satellite Placement Contracts - Not completed","CreatedByName":"ChrisD","CreatedById":144851,"CreatedDateTime":"2015-11-18T00:21:17Z","PageNum":1,"Articles":[{"CreatedByName":"ChrisD","CreatedById":144851,"CreatedDateTime":"2015-11-18T00:21:17Z","Content":"\nApologies if this belongs in the Support/Bug section but I\u0026#39;m having issues with completing some (but not all) \u0022Place a satellite containing x in a specific orbit around y\u0022 contracts.\u003Cbr\u003E\n\u003Cbr\u003E\nThe parameter that is failing to complete is the requirement for it to be a \u0026#39;new unmanned probe\u0026#39;.\u003Cbr\u003E\n\u003Cbr\u003E\nI can think of two possible causes for this:\u003Cbr\u003E\n\u003Cbr\u003E\n[LIST=1]\u003Cbr\u003E\n[*]The \u0026#39;new probe\u0026#39; is a subassembly core satellite with a few add ons to satisfy the contract requirements like a thermometer etc - could the fact that the probe is an old design be what is failing to trigger the parameter? \u003Cbr\u003E\n[*]The probe was launched attached to a manned vessel and deployed into orbit around its target (Mun) then maneuvered into its correct orbit - would the manned launch aspect be causing the system not to recognise that it is unmanned once deployed? \u003Cbr\u003E\n[/LIST]\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;ll try building a new satellite from the ground up and/or launching it solo on the next contract.\u003Cbr\u003E\n\u003Cbr\u003E\nThis is the craft file for the current launch - [URL]https://www.dropbox.com/s/wnlq8kf3t8vek9q/Mun%203%20%28Sat%29.craft?dl=0[/URL]\u003Cbr\u003E\n\u003Cbr\u003E\nFor info I have MechJeb, KER and ScienceAlert running on the Mac 1.0.5.1028 version\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nEdit: After saving the game and exiting to the front screen to check the version, reloading and returning to the probe - the condition is ticked and the contract is complete. Changed to answered but it is still odd.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-18T00:24:33Z\u0022 title=\u002211/18/2015 12:24  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 18, 2015\u003C/time\u003E by ChrisD\u003C/strong\u003E\n\u003Cbr\u003EAs per edit\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2015-11-18T00:23:35Z","Content":"\nIt is very possible that the fact that it is initially launched from a manned ship is causing the contract to not complete. Typically what I do for those types of contracts is to launch them unmanned. The \u0022New Satellite\u0022 portion means that it must be constructed and launched from the VAB, not be a satellite already in orbit, and then change its orbit. I believe this has changed in 1.0.5, but i have not had the chance to test this yet.\n"}]}