{"TopicId":125997,"ForumId":16,"TopicTitle":"Question on Making Wing(s) in 1.0.5","CreatedByName":"Turk_WLF","CreatedById":115580,"CreatedDateTime":"2015-11-20T19:04:18Z","PageNum":1,"Articles":[{"CreatedByName":"Turk_WLF","CreatedById":115580,"CreatedDateTime":"2015-11-20T19:04:18Z","Content":"\n\u003Cp\u003E\nWhat is the best way to make larger wings out of the default parts (Similar to those on the stock Stearwing A300 in 1.0.5)? I\u0027m not sure where to start on the leading edge or on the trailing edge of the wing and how to keep them from breaking apart on the “load\u0022 bounce when the plane drops to the runway when it first loads.\u003Cbr\u003E\u003Cbr\u003E\nThanks,\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-30T17:25:12Z\u0022 title=\u002211/30/2015 05:25  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by Turk_WLF\u003C/strong\u003E\n\u003Cbr\u003EBecause it was needed\n\u003C/span\u003E\n"},{"CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-11-20T19:10:57Z","Content":"\nI\u0026#39;m not familiar with the Stearwing, but in general you want to attach a \u0022root\u0022 part and build the rest of the wing from there. That way you can adjust the position of whole wing by just moving the root part instead of having to reassemble the whole thing. As far as I know, it doesn\u0026#39;t make any difference if you start with the leading or trailing edge. To stop them from braking apart, use struts or install the Kerbal Joint Reinforcement mod.\u003Cbr\u003E\n\u003Cbr\u003E\nHaving said this, I would recommend you use the large wing parts instead of trying to make your own with smaller parts. Advantages of doing this: lower part count, better structural integrity, no fiddling around with the pieces to get them to fit together just right, you can fill the large wing parts with fuel. This is just a matter of preference, but in my opinion these advantages outweigh the limiting factor in terms of aesthetics.\n"},{"CreatedByName":"GDJ","CreatedById":58462,"CreatedDateTime":"2015-11-20T19:11:52Z","Content":"\nIf I understand what you\u0026#39;re asking correctly....\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\nI did my own wingset from the FAT-455 set in the Squad Folder.\u003Cbr\u003E\n\u003Cbr\u003E\nI just did a copy of the files, rescaled them up 85%, increased the fuel capacity and empty mass the same, and adjusted the lift in relation to the surface area, increased drag 15% (due to size) then called them the FAT-1000 wing set. Also the tail fins I added a 150 unit fuel capacity.\u003Cbr\u003E\n\u003Cbr\u003E\nThey work great. They can accommodate 3 Goliath engines easily, 4 if you space them tight.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-20T19:15:08Z\u0022 title=\u002211/20/2015 07:15  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 20, 2015\u003C/time\u003E by GDJ\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Turk_WLF","CreatedById":115580,"CreatedDateTime":"2015-11-21T06:58:38Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EA_Name\u003C/strong\u003E: I understand what you\u0027re saying about the part count but building larger wings out of smaller parts are just a stop-gap measure until the Mods with the larger single piece wings comes out for 1.0.5.\u003Cbr\u003E\nI just downloaded the Kerbal Joint Reinforcement Mod.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EGDJ\u003C/strong\u003E: I like the way you think but I never have done any modding like you did to make the FAT-1000 Wing Set.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-30T16:27:55Z\u0022 title=\u002211/30/2015 04:27  PM\u0022 data-short=\u00228 yr\u0022\u003ENovember 30, 2015\u003C/time\u003E by Turk_WLF\u003C/strong\u003E\n\u003Cbr\u003EFormat Correction\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-11-21T08:06:08Z","Content":"\nIf you want mods, you could just use Tweakscale on the existing modular wings.\n"},{"CreatedByName":"A_name","CreatedById":134040,"CreatedDateTime":"2015-11-23T19:52:51Z","Content":"\n[quote name=\u0027Alshain\u0027]If you want mods, you could just use Tweakscale on the existing modular wings.[/QUOTE]\u003Cbr\u003E\n\u003Cbr\u003E\n[URL=\u0022http://imgur.com/a/pTnBY\u0022] Seconded.[/URL]\n"}]}