{"TopicId":126378,"ForumId":16,"TopicTitle":"Wave drag in FAR... what should i be aiming at?","CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2015-11-24T21:41:32Z","PageNum":1,"Articles":[{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2015-11-24T21:41:32Z","Content":"\nSo I finally bit the bullet and downloaded FAR. Went to put my first design together, and got hung up iterating the thing over and over trying to get my drag down. Spent about 3 hours, forgot to fit more than one engine, any payload electrical power etc.\u003Cbr\u003E\n\u003Cbr\u003E\nIs this a good or bad result? I ended up putting Jeb inside a Mercury capsule, inside the cargo bay, to cut down on drag. And the engine pre-coolers, fortunately pre-cool air even when there\u0026#39;s no air to cool because of a lack of intakes, when the fuel is kerosene not LH2, and when the cargo bay doors are shut.\u003Cbr\u003E\n\u003Cbr\u003E\n[URL=\u0022http://s1144.photobucket.com/user/narostel/media/2015-11-24_00011_zpsc7sahjpd.jpg.html\u0022][IMG]http://i1144.photobucket.com/albums/o492/narostel/2015-11-24_00011_zpsc7sahjpd.jpg[/IMG][/URL]\u003Cbr\u003E\n\u003Cbr\u003E\nIt did actually make orbit which surprised me, because the L/D ratios i was getting from flight data looked really poor - 10 subsonic and something like 2 or 3 above 20km. Also, at high altitude it handles like a drunk on roller skates, need to sort that out.\u003Cbr\u003E\n\u003Cbr\u003E\nStill , that\u0026#39;s 30 tons lifted by a single rapier. Have i got to shoot for this wave-drag-area number every time i design something?\n"},{"CreatedByName":"Agost","CreatedById":126710,"CreatedDateTime":"2015-11-24T23:00:02Z","Content":"\nYou\u0026#39;ve got a lot of wings bro\u003Cbr\u003E\n\u003Cbr\u003E\nTry a more streamlined design and look at the stability derivatives\u003Cbr\u003E\n\u003Cbr\u003E\nI\u0026#39;d advise you to try out a procedural wings mod\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-11-24T23:00:14Z","Content":"\nYou don\u0026#39;t have to go to those extremes. But you are on the right path. Most of my SSTOs run about 1.5-.5 wave drag. Mostly you want it low and the line as smooth as possible.\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2015-11-25T01:27:54Z","Content":"\nThat wave drag area is fine. If any of the wing parts are clipping other wing parts - looks possible - that isn\u0026#39;t fine.\u003Cbr\u003E\n\u003Cbr\u003E\nCheck the cD in the static derivatives tab at likely critical altitudes/speeds \u0026 optimise all types of drag rather than just looking at wave drag. I can tell you you\u0026#39;ll want a rather larger tail, though. Also if you have insufficient intakes your wave drag will be higher than it need be.\u003Cbr\u003E\n\u003Cbr\u003E\nAnd to answer your main question - no you don\u0026#39;t. Anything Mk3 based I\u0026#39;ve done so far usually ends up at about 5m^2. Just use plane parts, build something sane \u0026 tweak positioning at the end. You can clip body parts to smooth the overall shape just fine with the voxel FAR.\u003Cbr\u003E\n\u003Cbr\u003E\n[url=https://flic.kr/p/BtZeA6][img]https://farm6.staticflickr.com/5692/23289199365_7e531eca43_c.jpg[/img][/url]\u003Cbr\u003E\n\u003Cbr\u003E\nThe only real area ruling I did was to extend the inner trailing edge back so it smoothly met the end of the engine, which made a vast difference.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-11-25T01:43:52Z\u0022 title=\u002211/25/2015 01:43  AM\u0022 data-short=\u00228 yr\u0022\u003ENovember 25, 2015\u003C/time\u003E by Van Disaster\u003C/strong\u003E\n\u003C/span\u003E\n"}]}