{"TopicId":127843,"ForumId":16,"TopicTitle":"Massive asteroid belt","CreatedByName":"TheDog","CreatedById":137239,"CreatedDateTime":"2015-12-14T15:51:10Z","PageNum":1,"Articles":[{"CreatedByName":"TheDog","CreatedById":137239,"CreatedDateTime":"2015-12-14T15:51:10Z","Content":"\n\u003Cp\u003E\nDid anyone ever have such a massive asteroid belt?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/gLgwYR6\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/gLgwYR6\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAnd where does it come from? This density I have never seen on stock KSP...\n\u003C/p\u003E\n\u003Cp\u003E\nI installed a couple of mods recently (adding to my already quite long list), such as CactEye Telescope, and Kopernicus with Outer Planets Mod. Does any of these influence asteroid spawning? From their descriptions I wouldn\u0027t guess so...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"TheDog","CreatedById":137239,"CreatedDateTime":"2015-12-14T19:44:29Z","Content":"\n\u003Cp\u003E\nDogged!\n\u003C/p\u003E\n\u003Cp\u003E\nI found the creator of all these asteroids: it\u0027s Squad\u0027s Asteroid Day mod.\n\u003C/p\u003E\n\u003Cp\u003E\nI verified with a clean save: with AD mod present, loads and loads of asteroids get spawned. Within one year around Kerbol, I had hundrets of asteroids between me and Duna. Worse, my frame rate degraded severly (from 45 fps down to 25 fps in the tracking station view).\n\u003C/p\u003E\n\u003Cp\u003E\nI removed AD and repeated the experiment, now very few asteroids are spawned (or already in the game from the start?), no fps degradation.\n\u003C/p\u003E\n\u003Cp\u003E\nI just cleaned up my main save by eliminating manually most asteroids from the persistence file (they are VESSEL{...} objects). Now the main save looks less interesting, but the \u0022spawn of death\u0022 is stopped, and I have 40\u002B fps again in the tracking station.\n\u003C/p\u003E\n\u003Cp\u003E\n=\u0026gt; I can highly recommend this if you are using Asteroid Day, and find you have way too much garbage in your system...\n\u003C/p\u003E\n"}]}