{"TopicId":128350,"ForumId":16,"TopicTitle":"Engine to weak ?","CreatedByName":"moritz31","CreatedById":155617,"CreatedDateTime":"2015-12-21T18:56:27Z","PageNum":1,"Articles":[{"CreatedByName":"moritz31","CreatedById":155617,"CreatedDateTime":"2015-12-21T18:56:27Z","Content":"\n\u003Cp\u003E\nHey guys, \u003Cbr\u003E\u003Cbr\u003E\ni\u0027m new at the forum, so i hope im at the right section.\u003Cbr\u003E\u003Cbr\u003E\nIm playing kerbal since Version 1 and stopped playing in late summer because of university. Now i started playing again, and my goal is to get an SSTO in Orbit.\u003Cbr\u003E\nI\u0027m at the moment at a very low tech level (Science Mode). I only got the first to engines, but want to build the SSTO now. It should be only a small thing to make a kind of experience in that area. What my idea was is to get with the engines at an altitude about ~25km over Kerbin and than fire a LV 909 to get into space. Thats the theory, but in praxis i never reach 10km with the normal engines because they get very weak as soon as i lift off. I already added some more air intake to probably solve the problem, but that wasn\u0027t a real solution.\u003Cbr\u003E\u003Cbr\u003E\nCan you guys give me maybe some advice how to get into orbit. I guess it should be possible with that tech available, but if it\u0027s not than i have to make some mun missions bevor i can build the ssto.\u003Cbr\u003E\u003Cbr\u003E\nCheers\u003Cbr\u003E\nMoritz\n\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-12-21T20:56:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222331475\u0022 data-ipsquote-contentid=\u0022128350\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221450724187\u0022 data-ipsquote-userid=\u0022155617\u0022 data-ipsquote-username=\u0022moritz31\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, moritz31 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n I only got the first to engines, but want to build the SSTO now. It should be only a small thing to make a kind of experience in that area. What my idea was is to get with the engines at an altitude about ~25km over Kerbin and than fire a LV 909 to get into space. Thats the theory, but in praxis i never reach 10km with the normal engines because they get very weak as soon as i lift off. I already added some more air intake to probably solve the problem, but that wasn\u0027t a real solution.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWelcome to the forums.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first two engines are the reliant and the swivel.  You can easily build a SSTO rocket with those, but neither is air-breathing so I don\u0027t understand why you are having a problem reaching 10km (or a lot more) or why you think adding air intakes would solve it.\u003Cbr\u003E\u003Cbr\u003E\nMk1 command pod with mk16 parachute on top and decoupler below.  Right at the bottom a swivel engine with all the fuel tanks it can lift between it and the decoupler.  SSTO rocket.\n\u003C/p\u003E\n"},{"CreatedByName":"ninjacat","CreatedById":155668,"CreatedDateTime":"2015-12-21T20:57:07Z","Content":"\n\u003Cp\u003E\nwhat engines are you using?\n\u003C/p\u003E\n"},{"CreatedByName":"moritz31","CreatedById":155617,"CreatedDateTime":"2015-12-21T21:30:00Z","Content":"\n\u003Cp\u003E\nohhh sorry if it was miss understanding, with Rockets i have no problems, wanted to build a Space Plane (which i erroneously called ssto, sorry for that :dump:)\u003Cbr\u003E\nSo i have the two basic jet engines (can unlock the afterburner engine if needed) and all rocket engines up to mainsnail.\n\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2015-12-21T23:32:46Z","Content":"\n\u003Cp\u003E\nSpaceplane can be purely rocket powered too. I even have ones capable of horizontal take off from the runway and then reach orbit all on rocket power in a single stage. The same plane could have taken off vertically and save some delta-V but meh.\u003Cbr\u003E\u003Cbr\u003E\nThe reason I say this is because jet engines don\u0027t become worthwhile for SSTO spaceplane purpose until Whiplash, or at best Panther on afterburning mode. The turbofan engines loses thrust at too low of an airspeed that the little bit of delta-V they contribute is offset by the disadvantage of then having to lug them all the way to space on rocket power.\n\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-12-22T02:19:07Z","Content":"\n\u003Cp\u003E\nKSP now puts a hard(ish) cap on the altitude a jet engine can run at, and I think for the Juno and Wheesley it\u0027s pretty low. It\u0027s not like the old days when you could get up high with loads of air intakes.\n\u003C/p\u003E\n\u003Cp\u003E\nA spaceplane with them should still be *possible*, but you\u0027re going to need a lot of rocket delta-V.\n\u003C/p\u003E\n"},{"CreatedByName":"moritz31","CreatedById":155617,"CreatedDateTime":"2015-12-22T08:04:51Z","Content":"\n\u003Cp\u003E\nThanks for your info cantab, thats what i thought about too, have now unlocked the Panther Afterburner and with two of these and two LV-909 i reached about 70km, whats nice, next step would be to reach orbit.\u003Cbr\u003E\nWould it be better to get up slowly or to gain speed and then get up rapidly what i done was to aim for 30° with afterburner and as soon as the afterburner loose thrust i fire up the rocket engines, and when the air is cut i closed the intakes.\u003Cbr\u003E\u003Cbr\u003E\nCheers\u003Cbr\u003E\nMoritz\n\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2015-12-22T11:30:15Z","Content":"\n\u003Cp\u003E\nPanther-based SSTO spaceplanes are certainly possible, but the payload and fuel margins are very thin. Spaceplanes become much more practical once you have the Whiplash engines.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPanther:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/OEmJC/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhiplash:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/fq87d/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThose are both built for FAR, but the basic principles in stock aero are fairly similar these days.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-22T11:33:44Z\u0022 title=\u002212/22/2015 11:33  AM\u0022 data-short=\u00228 yr\u0022\u003EDecember 22, 2015\u003C/time\u003E by Wanderfound\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"moritz31","CreatedById":155617,"CreatedDateTime":"2015-12-23T08:45:02Z","Content":"\n\u003Cp\u003E\nThank you for that much information. You helped me a lot, i now try to get Whiplash and than will share my result.\n\u003C/p\u003E\n"},{"CreatedByName":"Edax","CreatedById":147162,"CreatedDateTime":"2015-12-23T17:52:22Z","Content":"\n\u003Cp\u003E\nThe only use for the early tech air breathing engine for an SSTO is reentry to safely land it without parachute, but to get to space, it\u0027ll have to do it purely with rocket power.  The J-33 Wheesley do grant you the ability to fire your rocket engines in close to vacuum, thus allowing you better efficiency, but I\u0027ve never really found it justified the extra weight and drag of an air breathing engine at early tech.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-12-23T17:55:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222334295\u0022 data-ipsquote-contentid=\u0022128350\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221450893142\u0022 data-ipsquote-userid=\u0022147162\u0022 data-ipsquote-username=\u0022Edax\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Edax said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe only use for the early tech air breathing engine for an SSTO is reentry to safely land it without parachute, but to get to space, it\u0027ll have to do it purely with rocket power.  The J-33 Wheesley do grant you the ability to fire your rocket engines in close to vacuum, thus allowing you better efficiency, but I\u0027ve never really found it justified the extra weight and drag of an air breathing engine at early tech.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJunos are handy for that.  You can fly up to 10km or so with Junos, and they don\u0027t weigh very much at all.  And 10km is a great place to start with a rocket-- for example, it\u0027s high enough that even a Terrier is reasonably efficient.\n\u003C/p\u003E\n\u003Cp\u003E\nBut yeah, in general I agree with you-- it\u0027s not hard to get to orbit with purely rocket-powered vehicles in early tech.  Where I find the early-tech air-breathing engines to be the most handy are for suborbital hops, particularly for contracts of the \u0022go to \u003Cem\u003E\u0026lt;place near KSC\u0026gt;\u003C/em\u003E and \u003Cem\u003E\u0026lt;do thing\u0026gt;\u003C/em\u003E at \u003Cem\u003E\u0026lt;20ish km altitude\u0026gt;\u003C/em\u003E.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s high enough that early-tech air-breathing engines have trouble getting to it, but rockets aren\u0027t a great answer either:  either you try the \u0022efficient\u0022 approach (a single parabolic launch from KSC to the target), which is a difficult navigation challenge, or else the \u0022inefficient\u0022 approach (try to fly the rocket like an airplane and guide it into the target), which is hard to have enough fuel for.  A simple suborbital spaceplane, powered by Junos and a Terrier, works great for that.  The Junos fly you to the site and get you up to 10km or so, then the Terrier pops you up to the needed altitude to complete the contract.  Then the Junos can fly you back home.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-12-23T17:59:50Z\u0022 title=\u002212/23/2015 05:59  PM\u0022 data-short=\u00228 yr\u0022\u003EDecember 23, 2015\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"moritz31","CreatedById":155617,"CreatedDateTime":"2015-12-24T10:55:28Z","Content":"\n\u003Cp\u003E\nsome christmas report from me \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\nI now got the Whiplash Engine and made my tour to orbit with an combination of two Whiplash and 1 Rocket engine (the small 45 one)\u003Cbr\u003E\nNow tinkering around with different combinations of Whiplash and Rocket engines to build a small crew transport ship to my space station\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0022\u003E@Snark\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\ni don\u0027t play career i only play science, so it doesn\u0027t matter if it is more efficient or not, but i don\u0027t like rockets that much i\u0027m more the plane type, so i\u0027ll improve my spaceplane building skills \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}