{"TopicId":129034,"ForumId":16,"TopicTitle":"Help me answer some questions regarding gamepads","CreatedByName":"Denco","CreatedById":111224,"CreatedDateTime":"2016-01-01T12:20:32Z","PageNum":1,"Articles":[{"CreatedByName":"Denco","CreatedById":111224,"CreatedDateTime":"2016-01-01T12:20:32Z","Content":"\n\u003Cp\u003E\nSo today I\u0027ve tried my 360 controller with ksp.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEverything works great except two things.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFirst with rockets. Is it possible to map a button to my joystick that would switch between staging mode and docking mode? I\u0027m asking this because I want to map the camera controls to my right stick but if I do that I loose my translation controls.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: I\u0027ve mapped my translation controls so that they are the same as the rotation ones. Is this the correct way of doing this. I\u0027ve done this since I found a key that switched between rotation/translation in docking mode. My next question is how to bind a key for a docking mode.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI cant for the likes of me have kerbal turn left or right on EVA? There are some analogue mappings there but they don\u0027t seem to be working.\n\u003C/p\u003E\n\u003Cp\u003E\nHow do you guys have your gamepads mapped. Any tips are welcome.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-01T13:58:55Z\u0022 title=\u002201/01/2016 01:58  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 1, 2016\u003C/time\u003E by Denco\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2016-01-27T11:44:37Z","Content":"\n\u003Cp\u003E\nThe analog mappings for kerbals on EVA are only for the backpack.\u003Cbr\u003E\nThese could also be used for analog walking in an older version. Sadly, that\u0027s gone now.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve also tried to map the camera to the right stick, though it annoys me that it\u0027s relative movement and not absolute.\u003Cbr\u003E\nSo now, when you let go of the stick, the camera stays where you put it, where in absolute mode it would return to the center.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is my preferred mapping of the Xbox controller (non-rocket):\n\u003C/p\u003E\n\u003Cp\u003E\nLeft stick: Throttle (incremental) and Yaw (also yaw rover), everything 1/3 deadzone\u003Cbr\u003E\nRight stick: Roll and Pitch, both 1/4 deadzone\u003Cbr\u003E\nLeft trigger: Throttle rover (reverse)\u003Cbr\u003E\nRight trigger: Throttle rover\u003Cbr\u003E\nLeft stick button: Zero Throttle\u003Cbr\u003E\nRight stick button: Gear\u003Cbr\u003E\nPOV: Camera!\u003Cbr\u003E\u003Cbr\u003E\nLeft bumper: Brake\u003Cbr\u003E\nRight bumber: Action group (mostly abort since that\u0027s available sooner than the rest in career)\u003Cbr\u003E\nA: Stage\u003Cbr\u003E\nB: SAS toggle\u003Cbr\u003E\nX: RCS toggle\u003Cbr\u003E\nY: Optional function (mostly action group 1 or 2)\u003Cbr\u003E\nSelect: Map\u003Cbr\u003E\nStart: Pauze\n\u003C/p\u003E\n\u003Cp\u003E\nHope this\u0027ll help you out!\n\u003C/p\u003E\n"}]}