{"TopicId":129209,"ForumId":16,"TopicTitle":"Retrieving science from Mun mission?","CreatedByName":"spaceboi","CreatedById":156429,"CreatedDateTime":"2016-01-04T04:49:36Z","PageNum":1,"Articles":[{"CreatedByName":"spaceboi","CreatedById":156429,"CreatedDateTime":"2016-01-04T04:49:36Z","Content":"\n\u003Cp\u003E\nHi! I\u0027m pretty new to KSP and just made my first Mun landing. I\u0027m afraid, however, that I may have made a bit of a mistake here. I\u0027m playing career mode and have been really starved for science points. My lander module was equipped with a lot of instruments and I took readings when I landed. I have a good deal of science stored however transmitting it only offers me 25-30% of its potential value. \n\u003C/p\u003E\n\u003Cp\u003E\nThe lander itself is not designed for reentry to Kerbin. I sent it to the moon and am taking it back on a payload, which is just a large engine with a lot of fuel tanks with which I dock. This is not designed for reentry either. However the payload does have additional docking ports, and I planned to launch an escape pod module to dock with the payload and bring my crew back home. From what I\u0027ve read, however, I won\u0027t be able to transmit all this scientific data to the escape pod. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nSo I have ~200 science worth of points sitting on the lander module and no way to get anything from it without transmitting and surrendering 150 of those points. \n\u003C/p\u003E\n\u003Cp\u003E\nIs there a way for me to retrieve these science points? I looked into the mobile processing lab but I\u0027m not 100% sure if it will do what I\u0027d like here. I can however launch one and dock with the lander/payload module if that would help.\n\u003C/p\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2016-01-04T05:43:20Z","Content":"\n\u003Cp\u003E\nDo you have kerbal space EVA capability? If you do then it\u0027s easy - just EVA your kerbal close to the scientific instruments and you will get a \u0022Collect Data\u0022 option where he/she takes the data out of the instrument and on their person. You can collect all the data from different instruments in one go and return to your capsule and all the experiment data will then be stored in your (heat shielded) capsule. You don\u0027t even need to dock the two vessels to do this, Just park them in close range next to each other in orbit and perform your EVA.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-04T12:01:56Z","Content":"\n\u003Cp\u003E\nI second the EVA solution - and if you have the means (maybe a difficult contract?) to upgrade the astronaut complex then it opens up huge possibilities for getting more science per mission.\n\u003C/p\u003E\n\u003Cp\u003E\nIf that is still out of the question, could you design an oversized heatshield \u002B docking port (with a little fuel \u002B probe core underneath it, maybe simply docked one-way to the underside of the heatshield) just to give your lander something to dock with and therefore a way back home?\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nNo idea if this will be stable enough on re-entry. I reduced ablator because you don\u0027t need much, but not too much to try to keep some weight down below. MOD-F5 would be a must if ever you try such a contraption.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022g2v97bK.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/g2v97bK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nFWIW, I built a larger version of this once because my Duna ship, sitting in LKO, needed more parachutes. The docking port held fine for a Duna landing, but I honestly couldn\u0027t say whether it will hold under the higher Kerbin g-forces when the parachutes open.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nedit: the mobile processing lab will let you convert the science data (i.e. reports) into data points which then give you science points which you can send home - after a wait and plenty of electricity. It doesn\u0027t destroy the original science data / report at all. However your 200 points-worth-of-science-reports will still be sitting in the lander pod that you connected to the MPL to start with.\n\u003C/p\u003E\n\u003Cp\u003E\nSo yes, if you have a scientist free then putting an MPL in orbit (without forgetting power generation, plenty of batteries, antenna and RCS) is a good way to help a science-starved career, IMO. Other more veteranish people might disagree and tell you that spending the same money sending the same scientist on expeditions will get you science much more quickly.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-04T12:14:33Z\u0022 title=\u002201/04/2016 12:14  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 4, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-04T16:31:04Z","Content":"\n\u003Cp\u003E\n\u002B1 to the EVA-kerbal-takes-the-science solution.\n\u003C/p\u003E\n\u003Cp\u003E\nJust to be clear, the way you do this is to get your EVA kerbal right next to the instrument that has science, and then \u003Cstrong\u003Eright-click the instrument\u003C/strong\u003E.  That will bring up a little menu that includes a \u0022take result\u0022 button; clicking that button will remove the science and store it on the kerbal.  When the kerbal then enters a command pod, the science will be stored in the command pod.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that the Science Jr. and mystery goo canisters will give you a scary warning \u0022this will disable the instrument\u0022 when you try to take the data out of it.  Ignore the warning, just go ahead and do it.  Yes, it will render the instrument inoperable (unless you have a scientist to reset it), but that\u0027s fine-- you\u0027re done with the instrument anyway, you just need the science it contains.\n\u003C/p\u003E\n"},{"CreatedByName":"spaceboi","CreatedById":156429,"CreatedDateTime":"2016-01-04T19:00:05Z","Content":"\n\u003Cp\u003E\nPerfect, thank you!\n\u003C/p\u003E\n\u003Cp\u003E\nAs a followup, what would then be the point of the mobile processing lab? Missions where there is no return capability planned?\n\u003C/p\u003E\n"},{"CreatedByName":"MagicFireCaster","CreatedById":149926,"CreatedDateTime":"2016-01-04T19:24:23Z","Content":"\n\u003Cp\u003E\nAlso next time you can use a cargo bay to protect you instruments during a re-entry to kerbin, or just put them in a place where they\u0027re not going to be affected by the atmospheric friction, like the upper part of your pod, also sometimes you collect so much data you just can\u0027t store it in a single pod (around 5 experiments max), so bringing back the experiments is the best option in those cases. \n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-04T20:08:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222348354\u0022 data-ipsquote-contentid=\u0022129209\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451934005\u0022 data-ipsquote-userid=\u0022156429\u0022 data-ipsquote-username=\u0022spaceboi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, spaceboi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPerfect, thank you!\n\u003C/p\u003E\n\u003Cp\u003E\nAs a followup, what would then be the point of the mobile processing lab? Missions where there is no return capability planned?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, you get good contracts for putting mobile labs in orbit around or down on the Mun and Minmus. Once they\u0027re there, you can use them as the basis for a space station with a lander, so that rather than sending a whole lander assembly from Kerbin, you just send a shuttle and leave it in orbit while you use a lander to pick up science.\n\u003C/p\u003E\n\u003Cp\u003E\nSince a Mun lander with science stuff on it cannot really be designed any better than to be capable of doing \u0026lt; down from orbit - short suborbital hop - up to orbit \u0026gt; (unless you use the LV-N) then to get all the science from all the biomes you will need several trips. Rather than grind it all at once, you can do a few biomes, bring the reports back up to orbit, then leave the scientist in the MPL churning out science points while you send the reports back home.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-04T20:08:42Z\u0022 title=\u002201/04/2016 08:08  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 4, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Temstar","CreatedById":24430,"CreatedDateTime":"2016-01-04T21:43:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222348383\u0022 data-ipsquote-contentid=\u0022129209\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451935463\u0022 data-ipsquote-userid=\u0022149926\u0022 data-ipsquote-username=\u0022MagicFireCaster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, MagicFireCaster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nyou collect so much data you just can\u0027t store it in a single pod (around 5 experiments max)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo it\u0027s not true, your pod can hold an infinite amount of data, as long as each piece of data is unique. Eg no two surface samples from the same biome.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-04T23:04:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222348354\u0022 data-ipsquote-contentid=\u0022129209\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221451934005\u0022 data-ipsquote-userid=\u0022156429\u0022 data-ipsquote-username=\u0022spaceboi\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, spaceboi said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs a followup, what would then be the point of the mobile processing lab? Missions where there is no return capability planned?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAdvantages of MPL:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nGenerates a lot more science points from the same amount of experimental input.  Done properly, you can get essentially unlimited science for free.\n\u003C/li\u003E\n\u003Cli\u003E\nProvides the science without the need to return data physically.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nDisadvantages of MPL:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBig and clunky; you need to have a major mission to use one\n\u003C/li\u003E\n\u003Cli\u003E\nHave to have it staffed with high-level scientists, or it takes for-frickin\u0027-ever\n\u003C/li\u003E\n\u003Cli\u003E\nTakes a super long time even if you do have high-level scientists\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nPersonally, I never bother with it myself.  In a career game, I can max out the tech tree by stripping the Mun and Minmus of science, and get that done before an MPL would even barely be getting started.\n\u003C/p\u003E\n"}]}