{"TopicId":129695,"ForumId":16,"TopicTitle":"How to hack chutes to open at ~3000mps","CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2016-01-11T08:44:45Z","PageNum":1,"Articles":[{"CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2016-01-11T08:44:45Z","Content":"\n\u003Cp\u003E\nCant slow down on Mars. Found out I need to jettison heatshield in the middle of 7 minutes of terror just to fire emergency retro engines (inside rover capsule) to slow me down. This is not acceptable. Is there a way to edit the config of the chutes to have them open at very high velocities. Keep in mind we are talking about Mars and the atmoshpere is so thin that the chutes should not be complaining about opening them. The game takes the meters per second rule a bit too literally and disreguards the pressure factor.\n\u003C/p\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2016-01-11T08:51:33Z","Content":"\n\u003Cp\u003E\nYou might want this mod: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/52931-105wenkel-corporation-realchute-parachute-systems-v1326-21215/\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/topic/52931-105wenkel-corporation-realchute-parachute-systems-v1326-21215/\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Enceos","CreatedById":110725,"CreatedDateTime":"2016-01-11T08:56:05Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/52931-105wenkel-corporation-realchute-parachute-systems-v1326-21215/\u0022\u003ERealchute\u003C/a\u003E\u003C/strong\u003E mod is your friend. It allows you to configure your chute in-editor and in-flight. It calculates aerodynamic stress on the chutes letting you deploy them at higher altitudes before thermal heating kicks in. It also correctly displays if it\u0027s risky or not to deploy your parachute at the moment. Drogue chute configuration before the main chute is your savior, cause often the weight and the geometry of a craft is not enough to slow down before the main chute deployment.  Also you can take a look into the\u003Cstrong\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/121162-105-inline-ballutes-ib-v123-9122015/\u0022\u003EInline Ballutes\u003C/a\u003E\u003C/strong\u003E option.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-11T09:00:55Z\u0022 title=\u002201/11/2016 09:00  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 11, 2016\u003C/time\u003E by Enceos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-11T10:23:32Z","Content":"\n\u003Cp\u003E\nWell, given that NASA has recently failed to make a parachute capable of opening at supersonic speeds for Mars, even in the high and thin atmosphere, it might be a bit much to say that this is \u0022not acceptable\u0022. The density may be much lower, but supersonic is still supersonic and the forces involved are significant and destructive.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-11T10:24:30Z\u0022 title=\u002201/11/2016 10:24  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 11, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-01-11T10:45:47Z","Content":"\n\u003Cp\u003E\nThe problem of chuites on Duna has be identified by Sqquad as a bug.\n\u003C/p\u003E\n\u003Cp\u003E\nOn Duna, in 1.0.4 regular chutes could open at 500 or 600m/s, in 1.0.5; speed has bee reduces ti 220m/s where you can open them at 250 on Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nIn any cas, I find it unlogical than same speed is lower on Duna thant Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nFYI, safe speed on Eve is 200m/s\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-11T11:09:14Z","Content":"\n\u003Cp\u003E\nSpeed of sound on Mars is lower than on Earth. Therefore 250m/s is higher than the speed of sound.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not an expert on parachutes so I don\u0027t know what the effect of breaking the sound barrier is on parachutes, exactly, but I would imagine it is not good for a large chute no matter what the density is since the pressure at points along the surface of the canopy will far exceed local air density.\n\u003C/p\u003E\n\u003Cp\u003E\nConversely on Eve, the speed of sound is much higher but it is the sheer density of the air which causes a problem for parachutes since the direct forces on the canopy as a whole will be that much greater.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not saying stock shouldn\u0027t be changed somehow, but I am sayng that people tend to underestimate the significance of the problem for Mars, and for Duna.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nedit: did a bit of digging in the RealChutes thread. Since the mod creator seems to know a bit about parachutes, I\u0027ll take his word for it: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/52931-105wenkel-corporation-realchute-parachute-systems-v1326-21215/\u0026amp;do=findComment\u0026amp;comment=2221989\u0022\u003Ehttp://forum.kerbalspaceprogram.com/index.php?/topic/52931-105wenkel-corporation-realchute-parachute-systems-v1326-21215/\u0026amp;do=findComment\u0026amp;comment=2221989\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, current technology allows us to open a parachute at over Mach 2 on Mars, but this is still considered risky. That means that KSP drogue chutes on Duna are tuned to real life experience for main chutes. More or less.\n\u003C/p\u003E\n\u003Cp\u003E\nSo I absolutely accept that these limits should be increased for Duna, it\u0027s just the \u0022not acceptable\u0022 comment which I feel doesn\u0027t do justice to the riskiness of opening parachutes at high speed. It is a foreseeable problem with landing on Duna.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-11T11:26:54Z\u0022 title=\u002201/11/2016 11:26  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 11, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Landge","CreatedById":57671,"CreatedDateTime":"2016-01-11T12:10:22Z","Content":"\n\u003Cp\u003E\nWith Duna\u0027s almost non existent atmosphere, use retro fire to slow down to a safe enough speed before opening drogues. Then continue to use retros as needed until touchdown. If you have fuel to spare you could even make landing without using chutes at all.\n\u003C/p\u003E\n"},{"CreatedByName":"Tatonf","CreatedById":146283,"CreatedDateTime":"2016-01-11T12:21:31Z","Content":"\n\u003Cp\u003E\nI managed to land on Duna using only A.I.R.B.R.A.K.E.S ; drogue chute and normal chute in 1.0.5. The retro were only use at the very end to kill the velocity that my chutes couldn\u0027t take care of (about 30 m/s).\n\u003C/p\u003E\n\u003Cp\u003E\nBut the landing occured at 700 meters and I\u0027m sure that I would have crashed if it (not) occured at 2000m.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-11T12:21:58Z\u0022 title=\u002201/11/2016 12:21  PM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 11, 2016\u003C/time\u003E by Tatonf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nefrums","CreatedById":145422,"CreatedDateTime":"2016-01-11T12:22:31Z","Content":"\n\u003Cp\u003E\nI have found that airbrakes are better than drogue chutes at slowing you down enough for the main chutes to be deployed safely.\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-01-11T18:08:56Z","Content":"\n\u003Cp\u003E\nYou will almost always need rocket assist for a Mars landing. I would recommend putting a heatshield the next size up beneath your craft (2.5m on a 1.25m, or 4m on a 2m probe) and remove all but ~10 ablator. This gives you a quite light but large drag surface which will slow you down more. You can then ditch the heatshield after opening your drogue chute. \n\u003C/p\u003E\n\u003Cp\u003E\nYou could also put airbrakes along the edge of the heatshield to make the diameter even larger. You can\u0027t easily do it for Earth/Venus entry (too much heat) but for a LMO reentry you can get away with a lot, as you are going only ~4 km/s as opposed to ~7.8.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-01-11T19:22:22Z","Content":"\n\u003Cp\u003E\nThe sad story is that areobraking/capture is very hard now, so, we mostly don\u0027t do it and pack more fuel. I remembered my mission to Jool in beta 0.9, I did a lot of aero capture, that was fun and spectacular. Now I just use rocket, just as any other moon/planet. (Ok, I use gravity assist, but even then, it\u0027s not spectacular).\n\u003C/p\u003E\n\u003Cp\u003E\nUsing engines on Duna turn this planet to any other planet.\n\u003C/p\u003E\n\u003Cp\u003E\nEven it\u0027s more realistic, it reduces gameplay. That how I feel this issue. But even though, Squad seems to look into it as a bug.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-11T20:59:55Z","Content":"\n\u003Cp\u003E\nAerobraking works just fine on Duna... up to a point.  The main thing is, you can\u0027t arrive going super-fast; the combination of low surface pressure, plus limited atmosphere height, plus small planetary radius, means that there\u0027s only so much dV you can squeeze out of it.  So the first thing is to make sure you arrive with a reasonable transfer window, so that you\u0027re not screaming along at 6000 m/s or more of speed.\n\u003C/p\u003E\n\u003Cp\u003E\nAssuming you\u0027re not coming in super-fast, it\u0027s pretty straightforward.  Set up a periapsis that\u0027s low enough to kill your escape velocity and get through the hot part of reentry.  Just put a heatshield on the ship and set a reasonably low periapsis and you\u0027re fine.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce that happens, let drag slow you to under 500 m/s, then pop a couple of drogue chutes to get you down to safe deploy speed for regular chutes.  Pop the regular chutes, descend, fire a brief blip of retro-thrust just before touchdown to soften the impact.  Done.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re having the problem that you\u0027re plowing into the ground while still going so fast that you\u0027re spewing flames everywhere, you\u0027re entering too steeply.\n\u003C/p\u003E\n\u003Cp\u003E\nMoral of the story:  Your real problem is not \u0022the chutes don\u0027t work right\u0022, it\u0027s that the ship design and/or flight profile needs tweaking.  If you\u0027d like more specific advice than that, a few extra bits of information would be helpful:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhat\u0027s your surface-relative speed when you arrive at the top of Duna\u0027s atmosphere?\n\u003C/li\u003E\n\u003Cli\u003E\nWhat periapsis have you set before entering Duna\u0027s atmosphere?\n\u003C/li\u003E\n\u003Cli\u003E\nWhat\u0027s your ship mass?\n\u003C/li\u003E\n\u003Cli\u003E\nWhat\u0027s the diameter of your heat shield?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nDepending on the answers to the above questions, the answer will likely be one of \u0022arrive slower,\u0022 \u0022use a higher/lower periapis\u0022, \u0022your ship\u0027s too heavy\u0022, or \u0022you need a wider heatshield\u0022.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Also, airbrakes can be useful in certain circumstances, though I rarely use them for Duna reentry myself-- I find that I get better results with drogues.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd a screenshot of your ship could be handy, too.  Depending on ship design, an appropriate entry attitude can give a significant amount of body lift, which can really help entry.\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-01-11T22:36:31Z","Content":"\n\u003Cp\u003E\nMechjeb has a fairly reliable aerobraking prediction system, although it did not seem to work for Mars. I know it works in stock KSP however. \n\u003C/p\u003E\n\u003Cp\u003E\nIt is very difficult to do an Aerocapture simply because the margin of error is so slight. If you are losing 1000\u002B m/s during the maneuver, a PE change of 1 KM could add or subtract a hundred m/s or even more. A craft orientation change could have a similar effect. I would usually set the PE a good bit higher than the Aerocapture altitude (but still inside atmosphere) and burn at PE until I close an orbit. Then, you can bleed energy over multiple high passes where the margin of error is higher. \n\u003C/p\u003E\n\u003Cp\u003E\nFor Kerbin this altitude would be around 55km, for Earth near 100km. I am not sure about Jool.\n\u003C/p\u003E\n"},{"CreatedByName":"lextacy","CreatedById":107955,"CreatedDateTime":"2016-01-12T02:13:24Z","Content":"\n\u003Cp\u003E\nforgot to tell you guys im using RSS and its MARS , not Duna. Anyhow I did once use REALCHUTE last year when I was doing stock Kerbin. Ill give this a try , I hope it lets me edit min pressure to open value. The only weird thing im not going to get around is that the chutes will then deploy during the flames and fire of re-entry. But Mr. Rover needs to slow down somehow haha.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222357571\u0022 data-ipsquote-contentid=\u0022129695\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452545995\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\nWhat\u0027s your surface-relative speed when you arrive at the top of Duna\u0027s atmosphere?\n\u003C/li\u003E\n\u003Cli\u003E\nWhat periapsis have you set before entering Duna\u0027s atmosphere?\n\u003C/li\u003E\n\u003Cli\u003E\nWhat\u0027s your ship mass?\n\u003C/li\u003E\n\u003Cli\u003E\nWhat\u0027s the diameter of your heat shield?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAnd a screenshot of your ship could be handy, too. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n1. around 3,300 mps\n\u003C/p\u003E\n\u003Cp\u003E\n2. 65,000 meters X 65,000 meters  (MARS not duna)\n\u003C/p\u003E\n\u003Cp\u003E\n3. inconsistent data\n\u003C/p\u003E\n\u003Cp\u003E\n4. around 2.65 meters\n\u003C/p\u003E\n\u003Cp\u003E\nIts the exact replica of Lionheads Curiosuty rover. I dont have a screen shot handy right now , but you can check out that mod and take a look at what the craft looks like.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-12T02:20:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222358023\u0022 data-ipsquote-contentid=\u0022129695\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221452564804\u0022 data-ipsquote-userid=\u0022107955\u0022 data-ipsquote-username=\u0022lextacy\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 minutes ago, lextacy said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nforgot to tell you guys im using RSS and its MARS , not Duna. Anyhow I did once use REALCHUTE last year when I was doing stock Kerbin. Ill give this a try , I hope it lets me edit min pressure to open value. The only weird thing im not going to get around is that the chutes will then deploy during the flames and fire of re-entry. But Mr. Rover needs to slow down somehow haha.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, sorry then.  That makes it pretty much impossible for anyone who\u0027s not familiar with Mars in RSS to give specific advice on speed, periapsis, etc.; this is really an RSS-specific question, rather than KSP in general.  I never play RSS, so can\u0027t help you there.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t get someone with useful specific answers here, perhaps go ask on the RSS thread?  I expect there are plenty of folks there who can help you.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}