{"TopicId":130421,"ForumId":16,"TopicTitle":"Service bay overheats - possible fixes?","CreatedByName":"Jason_25","CreatedById":55730,"CreatedDateTime":"2016-01-21T12:26:02Z","PageNum":1,"Articles":[{"CreatedByName":"Jason_25","CreatedById":55730,"CreatedDateTime":"2016-01-21T12:26:02Z","Content":"\n\u003Cp\u003E\nMy service bays explode in less than a fraction of a second when running the tiny rocket engines I have placed inside them.  Exhaust is directed downward through the open holes.  It is unrealistic in this environment for aluminum / carbon to \u0022explode\u0022, even a paper mache service bay would last longer.  I could expect a poorly designed service bay to fail after several minutes of this kind of stress though.  I plan on using them to house VTOL engines so I only need them to deal with any heat for a few seconds.  \u003Cstrong\u003ERelocating the VTOL engines to the outside of the spacecraft would create unacceptable drag and is not an option.  I also no longer wish to utilize \u0022clipping\u0022 to add VTOL engines.\u003C/strong\u003E  Finally, I noticed that adding radiators to the overheating part has no effect, which is a thermodynamics bug - the radiator should quickly get red hot with the rest of the part.  I have to say I am disappointed to have to start modding the game right off the bat after returning from a break.  What is the best approach here?\n\u003C/p\u003E\n\u003Cp\u003E\n1.  Edit the configuration file for the part, removing / fixing the heating aspect?\n\u003C/p\u003E\n\u003Cp\u003E\n2.  Download a mod to fix the problem?\n\u003C/p\u003E\n\u003Cp\u003E\n3.  Report a bug and abandon the project entirely, knowing it will never be fixed in a reasonable timeframe?\n\u003C/p\u003E\n"},{"CreatedByName":"sebi.zzr","CreatedById":81294,"CreatedDateTime":"2016-01-21T12:32:18Z","Content":"\n\u003Cp\u003E\nMaybe you can post some screenshots of the setup,to better understand what is actually happening.\n\u003C/p\u003E\n"},{"CreatedByName":"Jason_25","CreatedById":55730,"CreatedDateTime":"2016-01-21T13:27:32Z","Content":"\n\u003Cp\u003E\nActually this is almost entirely my fault.  Engines\u003Cstrong\u003E will \u003C/strong\u003Erun in a service bay without problems.  The mirrored twin service bay doors were interfering with the rocket exhaust on the opposing side.  Still, I will give some tips on what KSP can do better to prevent this from happening.\n\u003C/p\u003E\n\u003Cp\u003E\n1.  Remove arbitrary camera limits.  I could not swing the camera under the ship to see what was happening.\n\u003C/p\u003E\n\u003Cp\u003E\n2.  Include part/engine interference in the engineer\u0027s report.\n\u003C/p\u003E\n\u003Cp\u003E\n3.  Change damage to melting/structural failure rather than explosion for some types of problems\n\u003C/p\u003E\n\u003Cp\u003E\n4.  Add a fire suppression system part\n\u003C/p\u003E\n\u003Cp\u003E\n5.  Add auto engine shutdown when overheating for the small rockets\n\u003C/p\u003E\n"},{"CreatedByName":"ineon","CreatedById":152379,"CreatedDateTime":"2016-01-21T14:10:59Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure that I agree with your suggestions:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nI\u0027m not sure what you mean. I can move the camera under vehicles both in the VAB/SPH, and in flight/landed. While it is landed it isn\u0027t the best view, but I still can. Do you have a specific example?\n\u003C/li\u003E\n\u003Cli\u003E\nWhat is \u0022 \u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003Einterference\u003C/span\u003E\u0022? You need a \u003Cstrong\u003Ereally\u003C/strong\u003E rigorous definition if you want to programatically decide if one part interferes with another.\n\u003C/li\u003E\n\u003Cli\u003E\nHow would structural failure be different from an explosion? If you melt a cargo hold then it is going to be as functionally useful as an exploded cargo hold.\n\u003C/li\u003E\n\u003Cli\u003E\nWouldn\u0027t this just be an OP radiator?\n\u003C/li\u003E\n\u003Cli\u003E\nI often have parts exploding due to rocket exhaust, e.g. when I have a stack decoupler attached directly under an engine and both are set on the same stage then the stack decoupler often explodes but that is fine. I would be really annoyed if the engine automatically shutdown because something exploded. \n\u003C/li\u003E\n\u003C/ol\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-01-21T14:13:39Z","Content":"\n\u003Cp\u003E\nI remember having my heat parameter messed up with mods. I had NO mods that changed the heat mecanics, but heat convection wasn\u0027t calculated. As a result, nothing overheated into atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nSome mod (but which one I can\u0027t say) had messed with game engine. I reinstalled KSP, readded the mods and save games. Everything came back to normal.\n\u003C/p\u003E\n\u003Cp\u003E\nI suggestion you try an alternative installation, readd you mods and your saves. Then retry.\n\u003C/p\u003E\n"}]}