{"TopicId":130537,"ForumId":16,"TopicTitle":"Landing on Eeloo with seriously underpowered lander","CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-23T11:46:32Z","PageNum":1,"Articles":[{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-23T11:46:32Z","Content":"\n\u003Cp\u003E\nI have an ion-driven probe in low orbit around Eeloo. I\u0027ve got almost all the orbit science, but I would really like to land it. It has about 2000 m/s left in fuel, so there is no future job it could do other than visit Jool (no need) or crash into Duna (idem).\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is: power.\n\u003C/p\u003E\n\u003Cp\u003E\nThe probe has an orbital scanner, a few experiments, a Hex core and eight 6x1 solar panels. And a 1k battery. With nothing switched on, the battery charges at 0.4 units per second. At full power, the ion engine (TWR approx 1.16 on Eeloo, apparently) causes negative charge of around 8.5 units per second. SAS would increase that a bit.\n\u003C/p\u003E\n\u003Cp\u003E\nThis means that from a fully charged battery, I can get about 250 m/s out of the thing at full thrust. Or I can run the ion engine indefinitely at about 5% thrust, but only in full sunlight.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the question is: is there any possible way to land on Eeloo? A constant-altitude burn would help, and I can get the last 200 m/s with a TWR of 1.16, but is it actually possible to start one with a TWR of 0.06?\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-23T17:14:11Z","Content":"\n\u003Cp\u003E\nYah, you\u0027re basically hosed.\n\u003C/p\u003E\n\u003Cp\u003E\nYou only get one load of power.  If you\u0027re charging at 0.4/sec in the best case, that means it takes over 40 minutes of zero usage to recharge.  So, you\u0027ve got 250 m/s and that\u0027s that.  Orbital velocity on Eeloo is around 500 m/s; you simply have no way to kill that.\n\u003C/p\u003E\n\u003Cp\u003E\nPut another way:  Eeloo\u0027s surface gravity is 1.69 m/s\u003Csup\u003E2\u003C/sup\u003E.  Let\u0027s imagine you don\u0027t have any horizontal component at all to worry about, and are descending straight down, and that you\u0027re making a perfect suicide burn that puts you at 0 m/s at the moment you touch the surface.  You\u0027ve mentioned a TWR of 1.16 on Eeloo, so your deceleration while descending would be 1.69 * (1.16-1) = 0.27 m/s\u003Csup\u003E2\u003C/sup\u003E.  You have a maximum thrust time of 1000 / 8.5 = 118 seconds.  Combine that with your deceleration and we get 31.8 m/s.  Height at that point would be 118 * 31.8 / 2 = 1877 m.\n\u003C/p\u003E\n\u003Cp\u003E\nSo:  \u003Cstrong\u003EIf you start, \u003Cem\u003E\u003Cu\u003Efully charged\u003C/u\u003E\u003C/em\u003E, at an altitude of 1877 m while descending at 31.8 m/s, then you have just barely enough juice to land.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nYou simply can\u0027t do any better than that.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the question is:  Given that you\u0027re orbiting at 500 m/s, is there some way to put you less than 2 km above the surface while traveling only 32 m/s, and have a full charge at that point?  I\u0027d say the answer is a resounding \u0022no.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nSorry, dude.  \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBTW, for future reference:  if you\u0027re going out to Jool and beyond, solar panels really don\u0027t pull their weight-- you\u0027d get more power-per-kilogram with an RTG.  Of course, that\u0027s only an option if you\u0027ve \u003Cu\u003E\u003Cem\u003Eunlocked\u003C/em\u003E\u003C/u\u003E the RTG, which is way the heck at the top of the tech tree, but it\u0027s worth bearing in mind.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-23T18:27:38Z","Content":"\n\u003Cp\u003E\nYeah, what I send to the Jool system generally has an RTG, but for my standard orbital scanner design I didn\u0027t see a good place to fit one and maintain balance, it would have vastly increased the cost and significantly increased weight, and I figured that waits between burns would be manageable - which it has been so far.\u003Cbr\u003E\nEeloo approach had to be done in stages but it was satisfying.\n\u003C/p\u003E\n\u003Cp\u003E\nI suppose I was hoping some odd strategy might let me turn a slightly eliptic orbital trajectory into a suborbital trajectory, but those numbers don\u0027t seem to leave any possibility whatsoever. With 10x the solar panels it might have been doable ; )\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-23T20:00:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222375897\u0022 data-ipsquote-contentid=\u0022130537\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221453573658\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI suppose I was hoping some odd strategy might let me turn a slightly eliptic orbital trajectory into a suborbital trajectory, but those numbers don\u0027t seem to leave any possibility whatsoever. With 10x the solar panels it might have been doable ; )\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nExcept that then your TWR would be lower than 1.16.  That\u0027s really your problem there-- the gravity losses are just \u003Cem\u003E\u003Cu\u003Ekilling\u003C/u\u003E\u003C/em\u003E you.  For example, in that example where I went through the numbers:  you\u0027re spending 250 m/s of dV just to kill 32 m/s of vertical velocity.  Hideously inefficient.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027d probably do better just increasing the battery capacity, and making up for it by having \u003Cem\u003E\u003Cu\u003Efewer\u003C/u\u003E\u003C/em\u003E solar panels to save mass... though not sure if that would be enough.  The 1x6 panels are 17.5 kg or 25 kg apiece, depending on whether you have the retractable ones; whereas an additional 1000EC battery is 50 kg.  So you could triple your battery storage and make up for the mass by losing 4-6 of the solar panels.\n\u003C/p\u003E\n\u003Cp\u003E\nIn any case, moral of the story:  ion drives \u003Cem\u003E\u003Cu\u003Ereally\u003C/u\u003E\u003C/em\u003E don\u0027t have much muscle  at Eeloo. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}