{"TopicId":130608,"ForumId":16,"TopicTitle":"Engineers do anything for mining? (Got two on a ship - and I can\u0026#039;t tell what benefit they\u0026#039;re providing)","CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2016-01-24T07:22:10Z","PageNum":1,"Articles":[{"CreatedByName":"JoeSchmuckatelli","CreatedById":154477,"CreatedDateTime":"2016-01-24T07:22:10Z","Content":"\n\u003Cp\u003E\nI\u0027ve read that they do - but I cannot tell.  Going to assume the problem is on my end, so here\u0027s where I\u0027m at:\n\u003C/p\u003E\n\u003Cp\u003E\nI bought a new, base level engineer and flew him in a mining craft to the Mun (yeah I know) - and landed the craft next to another engineer I\u0027d landed there previously.  Started up the mining craft with the base level guy and checked the numbers.  Then I brought over the other Engineer - thinking two on board would improve things.  Didn\u0027t happen.  The new engineer didn\u0027t change the numbers (either on the drill or the convertotron).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo - is mining only dependent upon one engineer?  Does stacking them do nothing?  Both of them are in the ship - do I need them to be out?  (And does the fact that I have a probe core controlling the ship affect anything?)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe whole reason I took the ship to the Mun in the first place was to pick up the second engineer to make a Minimus mining mission more efficient... but that doesn\u0027t seem like a good idea now.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhat am I missing? \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGame is mostly vanilla (except for Alarm Clock and Real Burn Time mods)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nFor what it\u0027s worth - Thermal efficiency is 100%, Batteries are full, three XL solar collectors active and sun at high noon.  There\u0027s no problem with the ship - it\u0027s merely that I don\u0027t see any change from the mining or refining with one Engineer or two.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-01-24T07:25:57Z\u0022 title=\u002201/24/2016 07:25  AM\u0022 data-short=\u00228 yr\u0022\u003EJanuary 24, 2016\u003C/time\u003E by JoeSchmuckatelli\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tantalus","CreatedById":118982,"CreatedDateTime":"2016-01-24T11:21:37Z","Content":"\n\u003Cp\u003E\nI\u0027m not sure if the base levels give any bonus at all. You can try get them to lvl 2 or even 3 (requires leaving kerbin soi) and check again. The engineers must be aboard the same vessel than the drills / ISRU. \n\u003C/p\u003E\n\u003Cp\u003E\nRegards\n\u003C/p\u003E\n\u003Cp\u003E\nTantalus\n\u003C/p\u003E\n"},{"CreatedByName":"dangerhamster","CreatedById":146944,"CreatedDateTime":"2016-01-24T12:02:54Z","Content":"\n\u003Cp\u003E\nI think the skills aren\u0027t stacked but averaged, by adding a \u0022no star\u0022 you actually reduced the effect. Someone more familiar with the actual mechanics of this should be along with a more definitive answer.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-01-24T14:30:59Z","Content":"\n\u003Cp\u003E\nPretty sure they don\u0027t stack. I think (though am not sure) that it just uses whichever engineer is highest.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-01-24T15:21:05Z","Content":"\n\u003Cp\u003E\nAlso pretty sure it is the higher-level engineer which gives the bonus. As for the other questions, no a probe core will not change anything, and yes the engineer needs to be actually on board.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, the ISRU doesn\u0027t actually benefit from having an engineer on board. It is just the drill.\n\u003C/p\u003E\n\u003Cp\u003E\nWith different engineer levels, you should have seen a difference in the ore extraction rate on the drill. Send one at a time and then both out on EVA and compare the numbers when you right-click the drill part. If there is really no difference, then something is wrong.\n\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2016-01-24T16:03:58Z","Content":"\n\u003Cp\u003E\nYou get the bonus of the best engineer in the area to the drilling and conversion efficiency, but no they don\u0027t stack (they don\u0027t subtract either) \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}