{"TopicId":131550,"ForumId":16,"TopicTitle":"Satellite Contracts- Do Orbit Colors Denote Difficulty?","CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-02-07T01:42:19Z","PageNum":1,"Articles":[{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-02-07T01:42:19Z","Content":"\n\u003Cp\u003E\nI generally avoid Satellite contracts, but I had a polar Mun one that was pretty close to the ScanSat ideal placement so I went for it. I got it to the point where the guide orbit and my orbit were so close they were z-fighting, it still didn\u0027t complete. The previous Sat contract I did was really sloppy, and not too close at all and it passed. The hard one was red, the other wasn\u0027t (Blue maybe?). Is color a factor for the precision needed to complete?\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-07T04:19:18Z","Content":"\n\u003Cp\u003E\nNo, I think the colors are just random so you can tell them apart.\n\u003C/p\u003E\n\u003Cp\u003E\nBy any chance were you orbiting in the wrong direction? Watch the little sparkles racing around the target orbit, you have to be going the same direction as them. It\u0027s a common mistake, the UI isn\u0027t super obvious. (Soany people get bitten by this that they\u0027re redoing the UI in 1.1 to make it more obvious which way you\u0027re supposed to go.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-07T04:19:46Z\u0022 title=\u002202/07/2016 04:19  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 7, 2016\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-02-07T04:37:11Z","Content":"\n\u003Cp\u003E\nAh crap I probably was going in the wrong direction- I\u0027ve done this before with rescues before as well. Lets hope the new UI helps!\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-02-07T04:51:45Z","Content":"\n\u003Cp\u003E\nI\u0027ve seen the screenshots they posted a while back-- really looks nice. Prettier, and much clearer.\n\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2016-02-07T17:22:54Z","Content":"\n\u003Cp\u003E\nThe new 1.1 orbit graphics seem to have a fading colour to them like in Universe Sandbox 2, so it should be easier to tell the direction of orbit.\n\u003C/p\u003E\n"}]}