{"TopicId":132688,"ForumId":16,"TopicTitle":"What Are Some Good Techniques For Building Maneuverable Planes That Don\u0026#039;t Lose Too Much Speed?","CreatedByName":"KidWithTheHands","CreatedById":159086,"CreatedDateTime":"2016-02-22T00:48:47Z","PageNum":1,"Articles":[{"CreatedByName":"KidWithTheHands","CreatedById":159086,"CreatedDateTime":"2016-02-22T00:48:47Z","Content":"\n\u003Cp\u003E\nI have tried many ideas for fighter aircraft but most of them are junk and lose speed in turns. Anyway I can fix that with the right flaps?\n\u003C/p\u003E\n"},{"CreatedByName":"Fueniker S.","CreatedById":89507,"CreatedDateTime":"2016-02-22T03:59:19Z","Content":"\n\u003Cp\u003E\nHello, glad for you to join us on the forum! To answer your question visit this link : \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/47818-basic-aircraft-design-explained-simply-with-pictures/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nI\u0027ve used this post multiple times when creating my atmospheric vehicles, one of my most maneuverable planes was born not long after reading through it (pulled a constant 80g, made another that got ~300g from pulling out of a nose dive). Hope it helps! \n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-02-22T15:32:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222423456\u0022 data-ipsquote-contentid=\u0022132688\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456102127\u0022 data-ipsquote-userid=\u0022159086\u0022 data-ipsquote-username=\u0022KidWithTheHands\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, KidWithTheHands said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have tried many ideas for fighter aircraft but most of them are junk and lose speed in turns. Anyway I can fix that with the right flaps?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#FF0000;\u0022\u003EEdit:  WHOOPS, I misspoke something....  Fixing it now.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFor a more thorough dissertation on the principles below, see Robert Shaw\u0027s \u003Cem\u003EFighter Combat:  Tactics and Maneuvering,\u003C/em\u003E which is THE BIBLE of air combat amongst real-life fighter pilots.  Shaw was a Top Gun instructor.  I\u0027m lucky enough to have an autographed copy \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E.  Anyway....\n\u003C/p\u003E\n\u003Cp\u003E\nAll planes lose speed in turns.  it\u0027s unavoidable, because the turning process necessary increases drag while it\u0027s happening due to increasing AoA, yaw, and control surface deflection, all of which increase the plane\u0027s effective frontal area.  And the change in AoA and/or yaw also points the engine off the direction of travel so you have less thrust than before going to maintaining your previous speed.  Thus, you\u0027re going to lose speed during a turn and all you can do is try to minimize this.  To minimize the speed loss during turns, you need to fly the thing so as to minimize the AoA and/or yaw relative to your current direction of travel, which essentially means not turning so hard.  But the faster you\u0027re going, the wider the turn radius, and the less hard you turn, the larget the turn radius, which goes against maneuverability.  So what do you do?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EEDIT (added):\u003C/strong\u003E\u003C/span\u003E  \u003Cspan style=\u0022color:#008000;\u0022\u003EFirst off, you need to define maneuverability.  There are 2 things about turning that are important:  turn RADIUS (how tight the turn is) and turn RATE (how fast the turn is in degrees/second).  Turn RADIUS is pretty much entirely a function of speed.  The faster you\u0027re going, the wider you turn due basically to the vector addition nature of the process.  Turn RATE, OTOH, varies.  It is highest at \u0022corner velocity\u0022, which is a function of the plane\u0027s design, and is usually not much above the plane\u0027s accelerated stall speed (like in a hard turn), which is considerably higher than the plane\u0027s normal, level, low-speed stall speed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#008000;\u0022\u003ETurn RATE is generally more important for the opening and mid-game stages of the fight because it\u0027s what lets you change directions quickly to gain the advantage.  Turn RADIUS, OTOH, is usually only important in the final stages of the fight when you\u0027re going for or trying to avoid the kill shot.  By this point, at least one of the planes will have bled energy through repeated maneuvering to be below its corner speed.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:#008000;\u0022\u003EAnyway, to get good turn rates and radii, there are 2 pretty much mutually exclusive approaches.\u003C/span\u003E  One is to make the plane a \u0022turn-fighter\u0022, the other is to make it an \u0022energy-fighter\u0022 (or E-fighter).  The difference between them is plane in which they turn.  Turn-fighters work mostly in the horizontal plane, E-fighters turn in the vertical plane.  Thus, they need rather different design characteristics.  I\u0027ll discuss turn-fighters first because they\u0027re more intuitive.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen doing ANY turn (horizontal or vertical),, the main turning force comes not from the control surfaces (or engine gimbal) but the lift vector of the wing.  You roll the plane to point the lift vector in the direction you want to turn, then use the elevator to increase the AoA of the wing so that it makes more lift, which pulls the plane around in the desired direction. \u003Cspan style=\u0022color:#008000;\u0022\u003E And for the best sustained turn, you want to be doing this while maintaining a specific speed called \u0022corner velocity\u0022, which is the speed at which the plane has the highest turn rate and a reasonably small turn radius.  At higher speeds, you have a bigger turn radius due to momentum and reaching G limits, and a lower turn rate due to not being able to pull so hard around.  At lower speeds, you have to ease off on the turning to prevent stalling but have a smaller turn radius due to lower speed.  \u003C/span\u003ETo maintain corner velocity through a series of turns, such as doing a horizontal scissors with the enemy, you have to be in a slight dive, so that the speed gained from falling counters the speed lost by turning.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, for a turn-fighter, wing area is more important than thrust.  The more wing area for the plane\u0027s weight (IOW, the lower its wing loading), the lower its corner velocity.  The lower its corner velocity, the tighter its best turn radius will be, and the less altitude it has to lose to maintain speed through the turn.  In WW2, the early Zeros, Spitfires, and Bf-109s were like this.  Problem is, more wing area means more drag which means lower top speed.  And the lower the corner velocity, the lower top speed you want so you\u0027re always close to your corner velocity when you need it.  All of this limits the plane\u0027s performance in the vertical.  To try to work around this, you can use flaps very sparingly.  The purpose of these flaps is to increase wing area slightly without adding much drag, so you can have a higher top speed between turns.  The WW2 P-51, P-38, and N1K1 (among others) had such flaps.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd then there\u0027s the E-fighter.  This plane\u0027s turns are done in the vertical plane so it needs high TWR and high speed, which means less wing area and higher wing loading.  The F-104 is the quintessential E-fighter.  Such planes can\u0027t turn very well at all in the horizontal plane but can zoom vertically quite well.  As they go up, they slow down.  At the top of their zooms, they\u0027re going slow enough that they can flip over like in a tight loop and start back down.  As they dive back down, they regain most of the speed they lost during the zoom.  They also roll while pointing vertically downward to align their lift vectors with the target\u0027s future position, then pull out to intercept it.  The whole vertical maneuver has a very large turn radius in the vertical plane, but the projection of the maneuver into the horizontal plane has a very tight turn radius.  It\u0027s therefore possible for an E-fighter to have an effectively tighter or at least equal turn radius in the horizontal plane than a turn-fighter.  However, the E-fighter is still losing speed each turn so can only do this a few times before losing so much speed that it can no longer zoom effectively.  And when that happens, the turn-fighter will be all over it.\n\u003C/p\u003E\n\u003Cp\u003E\nI personally prefer E-fighters because they\u0027re inherently faster and fly higher than turn-fighters.  This enables them to dictate the terms of the fight or whether it happens at all.  Then, if they don\u0027t win after a few passes, they\u0027re still moving faster than the turn-fighter so can disengage at will, go off somewhere safe, regain their energy, and come back for a rematch \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E,\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-22T18:56:41Z\u0022 title=\u002202/22/2016 06:56  PM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 22, 2016\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-02-22T18:57:31Z","Content":"\n\u003Cp\u003E\nEdited my last.  It\u0027s been a while since I did any serious dogfighting so I forgot the distinction between turn RATE and turn RADIUS, and misdefined corner velocity as a result.  So I went back up and fixed that.\n\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2016-02-23T10:18:15Z","Content":"\n\u003Cp\u003E\nCracking writeup \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022\u003E@Geschosskopf\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing you don\u0027t really mention much there, which is relatively new, is thrust vectoring and post stall manouvering.  Not sure if any KSP mods give you full 2D thrust vectoring but it potentially allows an aircraft to temporarily face in a drastically different direction to it\u0027s velocity vector in order to lock weapons to a target, but at the cost of a lot of momentum.  With modern targeting systems and all aspect missiles I\u0027m not entirely convinced how useful that is, but it looks good and in KSP where you don\u0027t have fancy radars and capable missiles it could be of more use.\n\u003C/p\u003E\n\u003Cp\u003E\nThe obvious examples being the Cobra and Kulbit manoeuvres \u003Ca href=\u0022https://www.youtube.com/watch?v=dZg0jZfI6Cg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=dZg0jZfI6Cg\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-02-23T10:18:55Z\u0022 title=\u002202/23/2016 10:18  AM\u0022 data-short=\u00228 yr\u0022\u003EFebruary 23, 2016\u003C/time\u003E by RizzoTheRat\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Val","CreatedById":126227,"CreatedDateTime":"2016-02-23T10:55:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222425557\u0022 data-ipsquote-contentid=\u0022132688\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456222695\u0022 data-ipsquote-userid=\u0022123362\u0022 data-ipsquote-username=\u0022RizzoTheRat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n34 minutes ago, RizzoTheRat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe obvious examples being the Cobra and Kulbit manoeuvres \u003Ca href=\u0022https://www.youtube.com/watch?v=dZg0jZfI6Cg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=dZg0jZfI6Cg\u003C/a\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGreat clip and there\u0027s an awesome comment: \u0022Screw your western physics\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:9px;\u0022\u003EThough I would have phrased it: \u0022Screw your western aerodynamics\u0022\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2016-02-23T11:34:28Z","Content":"\n\u003Cp\u003E\nI saw him do it practice week for the Farnborough Airshow that year.  A whole bunch of aero engineers standing in the carpark open mouthed asking each other if it had just done what we thought it had. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOur car park was also right under where the Mig 29 always did his tail slide.  That always looked impressive from underneath until you remembered Paris \u002789...\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-02-23T11:59:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222425557\u0022 data-ipsquote-contentid=\u0022132688\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456222695\u0022 data-ipsquote-userid=\u0022123362\u0022 data-ipsquote-username=\u0022RizzoTheRat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, RizzoTheRat said:\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022\u003Ef\u003C/a\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOne thing you don\u0027t really mention much there, which is relatively new, is thrust vectoring and post stall manouvering. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI didn\u0027t mention this because they have no practical value outside airshows.  The main thing to avoid in air combat is running out of airspeed, altitude, and ideas all at once, which is exactly the situation you\u0027re in if you\u0027re doing a Cobra or some such thing.  If you\u0027re slow enough for such moves, you\u0027re a sitting duck for every incoming weapon.\n\u003C/p\u003E\n\u003Cp\u003E\nWhere thrust-vectoring has proven to be useful was to tighten conventional dogfighting turns.  This was shown back in the Falklands War by the Harrier, which has hardly any wing so isn\u0027t built like a turn-fighter, yet it was turning inside A-4s, which were so maneuverable the Blue Angles kept using them long after they were obsolete on the front line.\n\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2016-02-23T12:13:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222425620\u0022 data-ipsquote-contentid=\u0022132688\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456228775\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthey have no practical value outside airshows\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s my view as well, but I can\u0027t help thinking if so many people are spending so much money on supermanouvrability that they must know something I don\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nInterestingly I don\u0027t recall any mention of \u0022VIFFing\u0022 (which again would result in losing a lot of speed) in \u0022Sharkey\u0022 Wards book on the Falklands, despite it often being mentioned as a capability of the Harrier, so I wonder if that was another manoeuvre which sounded good on paper but never really had any use in combat.  Mind you it was a long time ago I read it.  I\u0027d not heard of using a small amount of vectoring to tighten the turn though, that makes a fair bit more sense.\n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-02-23T13:50:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222425630\u0022 data-ipsquote-contentid=\u0022132688\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456229583\u0022 data-ipsquote-userid=\u0022123362\u0022 data-ipsquote-username=\u0022RizzoTheRat\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, RizzoTheRat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s my view as well, but I can\u0027t help thinking if so many people are spending so much money on supermanouvrability that they must know something I don\u0027t.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFrom what I understand, the main use of this isn\u0027t for sustained use in dogfighting but for quick sidesteps to avoid a weapon or get off a snapshot.  But dodging gun runs and incoming missiles isn\u0027t done by sitting essentially in 1 place and rotating.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, RizzoTheRat said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nInterestingly I don\u0027t recall any mention of \u0022VIFFing\u0022 (which again would result in losing a lot of speed) in \u0022Sharkey\u0022 Wards book on the Falklands, despite it often being mentioned as a capability of the Harrier, so I wonder if that was another manoeuvre which sounded good on paper but never really had any use in combat.  Mind you it was a long time ago I read it.  I\u0027d not heard of using a small amount of vectoring to tighten the turn though, that makes a fair bit more sense.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell, in truth, there really wasn\u0027t a whole lot of dogfighting going on in the Falklands.  The Brit fleet was right at the extreme range of the Argentine attack planes so the latter didn\u0027t have enough few to divert much from the straight run there and back.  But I do recall it being mentioned a lot at the time (i was in the process of deploying to the war so was paying lots of attention to events \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E).  What wasn\u0027t mentioned so much, but which was definitely a major factor, was that this was the 1st major use of all-aspect IR missiles, and defensive tactics hadn\u0027t caught up with that yet.\n\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2016-02-23T18:16:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222423456\u0022 data-ipsquote-contentid=\u0022132688\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456102127\u0022 data-ipsquote-userid=\u0022159086\u0022 data-ipsquote-username=\u0022KidWithTheHands\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/22/2016 at 7:48 PM, KidWithTheHands said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have tried many ideas for fighter aircraft but most of them are junk and lose speed in turns. Anyway I can fix that with the right flaps?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs Geschosskopf said, all fighters lose speed or energy when turning.  In a short version everything works on math, even cars.  If you want to turn you have to devote energy to that, energy = speed.   How hard you turn will depend on how much energy you are willing to spend to do it.  Now this is in the simplest terms.  \u003Cstrong\u003E \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI think it went something like Altitude = Energy = Speed = Altitude.   This is why Dicta boelcke still holds true to this day.\n\u003C/p\u003E\n\u003Cp\u003E\nAltitude: From the advantage of flying above his opponent, a pilot had more control over how and where the fight takes place. He could dive upon his opponent, gaining a sizable speed advantage for a hit and run attack. Or, if the enemy had too many advantages- numbers for instance- a pilot could fly away with a good head start. At best, World War I aircraft climbed very slowly compared with later types.\u003Cstrong\u003E Altitude was a hard earned \u0027potential energy\u0027 store not to be given away capriciously\u003C/strong\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"Nothalogh","CreatedById":139345,"CreatedDateTime":"2016-02-26T00:41:34Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222423456\u0022 data-ipsquote-contentid=\u0022132688\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221456102127\u0022 data-ipsquote-userid=\u0022159086\u0022 data-ipsquote-username=\u0022KidWithTheHands\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2/22/2016 at 7:48 PM, KidWithTheHands said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cspan style=\u0022color:rgb(0,0,0);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:31.2px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003EWhat Are Some Good Techniques For Building Maneuverable Planes That Don\u0027t Lose Too Much Speed?\u003C/span\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHigher TWR\n\u003C/p\u003E\n"}]}