{"TopicId":134055,"ForumId":16,"TopicTitle":"Removing debris efficiently \u0026amp; easily","CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-03-12T19:39:10Z","PageNum":1,"Articles":[{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-03-12T19:39:10Z","Content":"\n\u003Cp\u003E\nI like to play KSP with a fairly realistic approach in mind, and because of this, I don\u0027t prefer to just \u0027cheat\u0027 or set max debris to zero, or other such methods of removing debris. So with that said, and with the serious lack of updated (as of at least 1.0) threads on this topic, would anyone care to share their methods for removing debris and sending it down to the body it\u0027s orbiting (efficiently, and without much difficulty)? I\u0027m playing career by the way. I also would greatly prefer to be able to recover the funds associated with these pieces of debris.\n\u003C/p\u003E\n\u003Cp\u003E\nI have the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/78226-105-stagerecovery-recover-funds-from-dropped-stages-v163-022116\u0022\u003EStageRecovery\u003C/a\u003E mod installed (and every single piece of debris is setup with chutes and could be recovered this way), which is awesome, but it doesn\u0027t ever seem able to save anything if it has to go through reentry. As a side question, does anyone know how to fix this? I can\u0027t put heat shields on all of this debris, and pretty much any stages that aren\u0027t jettisoned before orbit and must undergo reentry, always end up not being recovered. Everything usually burns up on reentry.\n\u003C/p\u003E\n\u003Cp\u003E\nEven if I\u0027m unable to recover any funds, I would like to start removing debris from orbit; I think it\u0027s starting to affect my computer\u0027s performance with all that extra stuff up there. As for suggestions, please keep in mind that all of the debris that I\u0027m trying to deorbit has no docking ports. I assume I will need to use the Klaw (creating a bay for capturing the debris inside my ship sounds much harder, more expensive and inefficient, and I don\u0027t think I even have the parts necessary w/o additional parts mods).\n\u003C/p\u003E\n\u003Cp\u003E\nThanks KSP community! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: Forgot to add, I found \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/122602-deorbiting-spent-stages-in-early-career-mode\u0022\u003Ethis\u003C/a\u003E thread pretty useful and relevant, but I just don\u0027t understand how I can successfully recover these stages properly, for the funds and everything. Some of this debris has expensive engines I\u0027d like to recover, not just empty fuel tanks.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-12T19:53:01Z\u0022 title=\u002203/12/2016 07:53  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 12, 2016\u003C/time\u003E by KocLobster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-12T20:10:12Z","Content":"\n\u003Cp\u003E\nThe easiest way to clean up debris is not to create the debris in the first place.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThis is actually not too hard to do-- it\u0027s a matter of careful attention to ship design.\n\u003C/p\u003E\n\u003Cp\u003E\nThe biggest source of debris is the stuff you do repeatedly (like going from the surface to LKO, and maybe shuttling back and forth between Kerbin/Mun/Minmus).  So work out a set of designs for those procedures that leave no debris behind, and you\u0027re good.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, when launching to LKO:  Simply make sure that \u003Cem\u003Ethe only stage that achieves orbit is the final one\u003C/em\u003E.  As long as every stage prior to the final one is jettisoned while you\u0027re still on a suborbital trajectory, then it\u0027ll naturally fall back down and take care of itself.  For me, this is isn\u0027t hard to do because it\u0027s what my three-stage-to-orbit designs tend to end up doing naturally, even when I\u0027m not particularly trying to avoid debris.  My first stage is usually SRBs, the second stage gets my Ap up to about where I want it, and the third stage is orbital insertion.\n\u003C/p\u003E\n\u003Cp\u003E\nFor cases where your final stage \u003Cem\u003E\u003Cu\u003Ebecomes\u003C/u\u003E\u003C/em\u003E debris after it finishes its mission-- for example, a fuel-delivery tanker, after it has arrived at your orbiting depot and divested itself of its load-- all you need to do is keep a wee bit of fuel left over so they can deorbit themselves.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a lot easier to do if your primary staging location is fairly low down, like 90-120 km.  Some people like to keep their space stations in higher orbits, but if you do that, you\u0027ll have  more issues with debris, because it takes more dV to deorbit from such altitudes, and \u0022accidental\u0022 orbits are easier.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re sending ships to the Mun or Minmus and need a disposable stage to go from LKO to your Mun/Minmus ejection:  just set it up so that it gets staged away when you\u0027re on a collision course with the target, then after you jettison you can do a minor course correction to fix up your path.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027ll also make your life simpler if you forget about trying to \u003Cu\u003E\u003Cem\u003Erecover\u003C/em\u003E\u003C/u\u003E the debris and just focus on getting rid of it.  That\u0027s what I do.  There\u0027s little economic incentive to recover it, and taking that constraint away makes life easier.  However, if you have your own reasons for wanting to recover the stuff, of course you can do that, but in that case I\u0027m probably not the right person to offer advice. \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-12T20:51:03Z\u0022 title=\u002203/12/2016 08:51  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 12, 2016\u003C/time\u003E by Snark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-03-12T22:09:48Z","Content":"\n\u003Cp\u003E\nThanks Snark, you always make the best posts. I will take to heart that it just simply isn\u0027t worth it to recover the debris for money, and instead should just dispose of it. I have certainly read before that it\u0027s a lot easier to just design things to not even produce debris in the first place, but I always end up doing so anyways,\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222454219\u0022 data-ipsquote-contentid=\u0022134055\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457813412\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you\u0027re sending ships to the Mun or Minmus and need a disposable stage to go from LKO to your Mun/Minmus ejection:  just set it up so that it gets staged away when you\u0027re on a collision course with the target, then after you jettison you can do a minor course correction to fix up your path.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI love this, I never thought of this, but seems it\u0027s a very easy way to ensure debris stops piling up around the Mun. \n\u003C/p\u003E\n\u003Cp\u003E\nWhat I don\u0027t understand is how exactly to design things to not create debris. I often end up with a stage that gets me in an LKO, but theres enough fuel left to not warrant throwing it away right before I achieve that LKO. Often, however, there is also not enough fuel to get it to crash into the Mun. There seems to be no middle ground, and I end up with debris that has very strange orbits around Kerbin. I guess I need to play with and tweak dV even more so than I already do now, to ensure stages are empty of fuel at the right time, so they can be detached before orbit or into a planet/moon?\n\u003C/p\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-03-12T22:19:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222454370\u0022 data-ipsquote-contentid=\u0022134055\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457820588\u0022 data-ipsquote-userid=\u0022159324\u0022 data-ipsquote-username=\u0022KocLobster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, KocLobster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhat I don\u0027t understand is how exactly to design things to not create debris.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI would suggest a combination of an informative mod (KER or MechJeb) with a \u0022subway map\u0022 style dV map. Then just design each stage to have just under or just over the dV required for the next step. \n\u003C/p\u003E\n\u003Cp\u003E\nFor instance, I usually make it so my first stage has ~1400 Dv, second has ~900 (so that those both are suborbital when I stage) and if I\u0027m going to Mun, third stage has ~900. This lets me, like Snark said, to have the Munar injection stage crash into the Mun, and the lander/return stage makes a minor course change to not crash. \n\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-03-12T22:22:03Z","Content":"\n\u003Cp\u003E\nI use both, as well as dV maps. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Thank you for the suggestion though; I will start doing this so I don\u0027t have any more debris created. I\u0027ll have to use the Klaw to get rid of the current debris I have.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-12T23:09:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222454370\u0022 data-ipsquote-contentid=\u0022134055\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457820588\u0022 data-ipsquote-userid=\u0022159324\u0022 data-ipsquote-username=\u0022KocLobster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n51 minutes ago, KocLobster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI often end up with a stage that gets me in an LKO, but theres enough fuel left to not warrant throwing it away right before I achieve that LKO. Often, however, there is also not enough fuel to get it to crash into the Mun. There seems to be no middle ground, and I end up with debris that has very strange orbits around Kerbin.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is doable, too.  Let\u0027s say you\u0027re in LKO and about to head to the Mun, which takes around 850 m/s of dV.  Suppose that the stage you currently have is around 500 m/s, i.e. if you stage it when you run out of fuel, it\u0027ll end up in an eccentric orbit with a high cis-munar Ap and a Pe that\u0027s down in LKO.\n\u003C/p\u003E\n\u003Cp\u003E\nOkay, so, when the time comes to stage it, just tweak your trajectory a little smidgeon radially outward, which will lower your Kerbin Pe (behind you) below, say, 20 km.  Then stage it.  It will coast up to Ap, then come back around and burn up in Kerbin\u0027s atmosphere.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother approach to avoid oddball debris in the Mun-Kerbin milk run is to use dedicated single-stage transfer ships.  These are craft that are designed to shuttle between LKO and low Munar orbit, without ever landing on either body.  So your trip to the Mun from Kerbin\u0027s surface would look like this:  launch from surface to your orbiting space station in LKO.  There you dock it to a tug (ideally, something nuclear-powered to give a good Isp).  The tug takes the ship to Mun orbit and undocks, then the ship can land itself.  You can have a station in low Mun orbit, and a fuel-mining setup to keep the station well supplied with fuel.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that if you keep a fuel station in LKO, that\u0027s a handy way to reduce debris, too-- when you get up to LKO, you dock to the station and either take on any needed fuel or dump extra fuel.  Helps to let you precisely tune your dV to what you want it to be, by onloading/offloading fuel without wasting any.\n\u003C/p\u003E\n"},{"CreatedByName":"Nich","CreatedById":145678,"CreatedDateTime":"2016-03-13T04:51:33Z","Content":"\n\u003Cp\u003E\nNO WAIT!!!!  Don\u0027t get rid of your debris I just started a challenge to use all this debris to make new stuff using KIS/KAS\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/134040-bill-and-jebs-excellent-adventure-kiskas/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-13T04:52:15Z\u0022 title=\u002203/13/2016 04:52  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 13, 2016\u003C/time\u003E by Nich\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-03-13T19:45:11Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/145678-nich/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022145678\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/145678-nich/\u0022\u003E@Nich\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nToo late.:/\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125662\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125662-snark/\u0022\u003E@Snark\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI just realized in the tracking center that the button to stop tracking a ship or debris actually terminates and destroys the craft....I thought it just stopped tracking it and it continued floating around in space. I wish I would of known that a while ago, haha...I would of deleted my debris much sooner. I now am easily building ships with correct dV values that I can ensure get recovered via chutes, crash into the Mun, or crash back into Kerbin. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E Thanks again for always helping me with my questions.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhy can I not provide reputation? Is my account too new, or I don\u0027t have enough posts?\n\u003C/p\u003E\n\u003Cp\u003E\nedit: I calculated that my reputation power is .658889 Being less than one, does this mean I don\u0027t have the option to give reputation yet? Or am I just being ignorant and don\u0027t know where the give reputation button is?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-13T19:55:10Z\u0022 title=\u002203/13/2016 07:55  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 13, 2016\u003C/time\u003E by KocLobster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Markush100","CreatedById":159964,"CreatedDateTime":"2016-03-13T20:08:18Z","Content":"\n\u003Cp\u003E\nSImple, get BD armory and play asteroids.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-13T20:10:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222455426\u0022 data-ipsquote-contentid=\u0022134055\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221457898311\u0022 data-ipsquote-userid=\u0022159324\u0022 data-ipsquote-username=\u0022KocLobster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, KocLobster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhy can I not provide reputation? Is my account too new, or I don\u0027t have enough posts?\n\u003C/p\u003E\n\u003Cp\u003E\nedit: I calculated that my reputation power is .658889 Being less than one, does this mean I don\u0027t have the option to give reputation yet? Or am I just being ignorant and don\u0027t know where the give reputation button is?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere is no \u0022reputation\u0022 or \u0022reputation power\u0022 anymore-- that was a feature of the old forums.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat we have now is \u0022likes\u0022, which you give by clicking the \u0022Like this\u0022 button.  You can see each person\u0027s \u0022like count\u0022 (i.e. how many times someone else has liked that person\u0027s stuff) next to the little green \u0022\u002B\u0022 icon under their name.  When you like someone\u0027s post, they get \u002B1 to this, regardless of who you are.\n\u003C/p\u003E\n\u003Cp\u003E\nThe system caps you to liking no more than 25 posts a day, to limit abuse of the system.\n\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-03-13T22:16:55Z","Content":"\n\u003Cp\u003E\nOhhh I see, cool. I guess the thread I read by a SQUAD staff member was totally outdated then. Thanks again\n\u003C/p\u003E\n"}]}