{"TopicId":134141,"ForumId":16,"TopicTitle":"RSS - RO - Mars Ferry and Fuel Station with ISRU","CreatedByName":"Lothaar","CreatedById":159753,"CreatedDateTime":"2016-03-14T02:13:57Z","PageNum":1,"Articles":[{"CreatedByName":"Lothaar","CreatedById":159753,"CreatedDateTime":"2016-03-14T02:13:57Z","Content":"\n\u003Cp\u003E\nFirst off I can not say enough to thank all the great folks making some amazing mods for this game.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/90151-105-realism-overhaul-v1095-mar-12/\u0022\u003ERO\u003C/a\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/50471-105-real-solar-system-v105-feb-27/\u0022\u003ERSS\u003C/a\u003E community and its leaders/founders are just doing an amazing job and are really inspiring other people to new levels of exploration and mission planning.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI recently came across stratochief66\u0027s thread \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/133005-rss-challenges-of-mars-missions/\u0022\u003E\u0022RSS - Challenges of Mars Missions\u0022\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt involves using \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/109771-real-isru-development-thread/\u0022\u003EISRU\u003C/a\u003E as a way to develop more feasible mission plans for Mars.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI am trying to develop and orbital fuel/production station and a ferry for travel between the station and surface and for suborbital hops. These type of station and craft would be employed well down the road from the initial interactions with Mars like stratocheif66 is working on.\n\u003C/p\u003E\n\u003Cp\u003E\nI will start with one main station design and two ferry designs; one for crew transport and one for cargo/materials.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUtilizing ISRU for production of additional fuel on the surface of the planet allows for much smaller craft with very reasonable round trip deltaV. Producing fuel in orbit also has its advantages that i will explore.\n\u003C/p\u003E\n\u003Cp\u003E\nRight now, I am working with a 70 tn prototype. It has about 4600 deltaV of fuel and can produce another 4600 deltV of fuel after landing over a period of 70 days. This is the crew variant and can support 3 persons for 210 days if needed. Crew, supplies, capsule come in about 7.5tn. So the cargo variant will have about the same capacity of 11% weight cargo for a 70 tn craft.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is a completely reusable craft, and will use a pure propulsion profile for ascent and decent. I may incorporate aero interactive devices of some sort to shave some deltaV requirements, but for now I am trying to keep it simple. I also do not want to use anything that I do not feel certain is modeled as closely as possible to a real life object.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe orbital fuel station prototype is fairly simple and, when full, can refuel/restock a ferry twice, and has tank space to take on resources for fuel production in orbit. It will develop more as the ferry design is refined and we get a better understanding of the frequency of the initial transit scheduled. Even as it stands now it could be mirrored on a central hub or expanded to any radial degree desired.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAll resources are in color/pattern coded tanks so that I can get used to the proportions of volume and weight of the various resource components as I develop designs and test things.\n\u003C/p\u003E\n\u003Cp\u003E\nI am working with the basic \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/90151-105-realism-overhaul-v1095-mar-12/\u0022\u003ERO\u003C/a\u003E \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/50471-105-real-solar-system-v105-feb-27/\u0022\u003ERSS\u003C/a\u003E install and I only use RO modified stock and procedural parts. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/109771-real-isru-development-thread/\u0022\u003EISRU\u003C/a\u003E and \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/115734-heat-pumps-for-real-fuels-v11-oct-31-2015/\u0022\u003EHeat Pumps\u003C/a\u003E are my two part pack additions for my current testing. I use all sorts of visual stuff and control/metrics mods. Ill paste screen below with full mod folder.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cimg alt=\u0022Capture.PNG\u0022 class=\u0022ipsImage\u0022 src=\u0022http://stalkr.co/252i3q3x3S2G/Capture.PNG\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nI have two videos of some of my initial flight tests. Ones is a decent from the orbital fuel station to the surface and the other is the ascent from the same location on the surface to the orbital fuel station after refueling with ISRU. Both trips had 500\u002B deltaV to spare so we are close to the set up that I will use. I would like to have 10% fuel reserve in the final design if possible.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cstrong\u003EMars Ferry Landing\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Ca href=\u0022https://thumb2016.s3.amazonaws.com/1616/test/Mars%20Ferry%20Landing.mp4\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://thumb2016.s3.amazonaws.com/1616/test/Mars Ferry Landing.mp4\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cstrong\u003EMars Ferry Takeoff\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Ca href=\u0022https://thumb2016.s3.amazonaws.com/1616/test/Mars%20Ferry%20Takeoff.mp4\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://thumb2016.s3.amazonaws.com/1616/test/Mars Ferry Takeoff.mp4\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Cstrong\u003Ecraft files for ferry and station as they are in these videos.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Ca href=\u0022https://thumb2016.s3.amazonaws.com/1616/test/Mars%20Ferry%20C1.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://thumb2016.s3.amazonaws.com/1616/test/Mars Ferry C1.craft\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n\u003Ca href=\u0022https://thumb2016.s3.amazonaws.com/1616/test/Mars%20Station%20F1.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://thumb2016.s3.amazonaws.com/1616/test/Mars Station F1.craft\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nI will  always post the craft in the video so that anyone can try the same thing. I will also in the future include flight profile information to better help you get similar results.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nI have an educational background in math and physics, but I am a total newb to this game, community and rocket science in general. However, it is all about solving small problems and I love to do that. I am open to suggestions and alternative methods for what I am doing\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\nMy next goal is to land two craft in close proximity. I will be installing \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/51073-pluginparts023-scansat-terrain-mapping/\u0022\u003Escansat\u003C/a\u003E and researching to choose a good place on the equator for my landing site. Let me know if you are aware of a good spot. Right now I would like to be able to land \u002Bor- 0.5 km from a given target.\n\u003C/p\u003E\n\u003Cp style=\u0022margin-bottom:0in;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-14T08:46:42Z\u0022 title=\u002203/14/2016 08:46  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 14, 2016\u003C/time\u003E by Lothaar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lothaar","CreatedById":159753,"CreatedDateTime":"2016-03-14T04:53:53Z","Content":"\n\u003Cp\u003E\nPast close proximity landing, I have two areas I would like to address as I develop my station and ferry.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOne\u003C/strong\u003E is to move away depending on the RTGs I am using for power. My current ferry prototype is using two of the largest chemical engines and will most likely be scaled back to one or two of the smaller units. This will increase the time on the surface and I will need to look at what my limits will be regarding that. In moving away from the RTGs, I need to develop a solar plan. At current, I am thinking solar panel systems that will be deployed/assembled by hand/robot once landed on the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile I could build a permanent large solar installation on the surface and use that to power the ferry\u0027s refueling process, I prefer to contain the solar harvesting potential in the ferry itself. Most all initial craft, I think, will need to be lifeboats, and all but stand alone systems. Relying only on permanent solar installations would also limit sub orbital hop range. Later these solar installations will be present, but for the initial ferries and surface infrastructure I want as much self sufficiency as possible.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ETwo\u003C/strong\u003E is to take another look at boil off and scaling for time and active craft in game. We have good hardware/mods to keep fuels at the right temp, but I would like to look at performance of cryo systems in martian atmosphere and power requirements. I know this will take a decent amount of power, and there may be limitations in direct exposure environments. Heat-sinking and other methods of local thermal stabilization may be needed, and long term, desired for efficiency.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"stratochief66","CreatedById":59541,"CreatedDateTime":"2016-03-14T05:16:47Z","Content":"\n\u003Cp\u003E\nVery cool! I\u0027m glad that someone is doing something with my recent RealISRU additions, and very glad it is something this cool \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003Cbr\u003E\u003Cbr\u003E\nBecause I am using aerobraking and lifting to bleed off my speed I am looking for the lowest points on Mars, so I don\u0027t know of any good locations to land near the equator.\n\u003C/p\u003E\n\u003Cp\u003E\nI can really see your having trouble with too high of a TWR. Perhaps if you place your engines in pairs, at the ground you could be down to just 2. That should get you to a low enough TWR to land more easily. I asked \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/75006-nathankell/\u0026amp;do=hovercard\u0022 data-mentionid=\u002275006\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/75006-nathankell/\u0022\u003E@NathanKell\u003C/a\u003E if there might be a way to reset ignitions by having an engineer astronaut interact with the engines, as after a few trips to the ground you would run out of relights.\n\u003C/p\u003E\n\u003Cp\u003E\nAre you still planning to ferry CO2 up to the station and perform the bulk of your ISRU up there? Any ideas for a feasible energy source to power your ground based resource harvesting \u0026amp; ISRU? I haven\u0027t yet found a source for a reasonable mass for a nuclear source capable of generating multiple kW.\n\u003C/p\u003E\n"},{"CreatedByName":"Lothaar","CreatedById":159753,"CreatedDateTime":"2016-03-14T05:46:18Z","Content":"\n\u003Cp\u003E\nYes, I have tried with two engines at the end, but if you switch to only two too soon, control is an issue. I need more testing in that area.\n\u003C/p\u003E\n\u003Cp\u003E\nThe station producing fuel in orbit will require the CO2 ferry and I have to really look at the fuel cost of bringing CO2 up. The savings in not bringing LqdHydrogen to the surface are small, but I think large solar solutions for processing will be easier in orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSO right now I\u0027m going to scale down fuel production on the ferry and see if I can get a deployed solar solution to power it on the surface. Then based on a flight schedule of two ferries, on their new fuel period, I will see how much CO2 I can run to the station. Then I will make a fuel production schedule for the station. Then I can make a LqdHydrogen delivery schedule from earth. Then I can look at the whole chain and see the rough potential of two craft and one station, with LqdHydrogen support from earth.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThen I can do a similar chain set up where all fuel is produced on the surface in a permanent surface installation. Fuel will be lifted via ferry to the station and LqdHydrogen brought to the surface via the same ferry. The station will still receive Hydrogen support from earth.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the end, I imagine, it will be a combination of the above that will take place for matters of convenience and complexity reduction as well as efficiency.\n\u003C/p\u003E\n\u003Cp\u003E\nWhile some of this can be explored by my rudimentary math, I find working models to really spell it out much better.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"NathanKell","CreatedById":75006,"CreatedDateTime":"2016-03-14T07:31:51Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/159753-lothaar/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022159753\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/159753-lothaar/\u0022\u003E@Lothaar\u003C/a\u003E awesome work!\n\u003C/p\u003E\n\u003Cp\u003E\nI highly recommend posting this to the Mission Reports subforum also, since you should get some good interest for this, err, mission report. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lothaar","CreatedById":159753,"CreatedDateTime":"2016-04-02T19:39:19Z","Content":"\n\u003Cp\u003E\nI will post any further updates in this thread. Landing update posted.\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/134158-rss-ro-mars-ferry-and-fuel-station-with-isru-mission-report/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}