{"TopicId":134394,"ForumId":16,"TopicTitle":"Rover design","CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-17T16:20:17Z","PageNum":1,"Articles":[{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-17T16:20:17Z","Content":"\n\u003Cp\u003E\nAs 1.1 approaches, I\u0027m starting to wonder on what to design in my next carreer game. On the previous one I sent a probe carrier around Eve with 8 dropable 2.5 science probes.\n\u003C/p\u003E\n\u003Cp\u003E\nFor my next career, I want to do better, I want to carry ROVERS, maybe 4 per trip.\n\u003C/p\u003E\n\u003Cp\u003E\nI was wondering about their design and especially electricity. The most efficient wheels seems to use 0.7e/s. As I like standard build, I want to do a PB-Nuke rover not a solar one (I had bad experience landing solar probe on Eve pole and getting no direct sun because of surrounding hills..).\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nDoes wheels use 0.7e/s per wheel ?\n\u003C/li\u003E\n\u003Cli\u003E\nIn that case should I build a 2 wheel rover helped by 2 additional landing gears ?\n\u003C/li\u003E\n\u003Cli\u003E\nIf I understand, top speed is around 23m/s and tire blow if I go over 60m/s (means I fall ?)\n\u003C/li\u003E\n\u003Cli\u003E\nI was wondering about structural fuselage and sticking equipment on it. Stack probe up front and stack battery at the back.\n\u003C/li\u003E\n\u003Cli\u003E\nFor vac bodies, I\u0027ll add a skycrane stage (and hope not to blow tires on landing)\n\u003C/li\u003E\n\u003Cli\u003E\nFor atmo bodies, I\u0027ll go with the heat shield and small deorbiting engine.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nDo you have some suggestions ? mistakes not to do ?\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-17T17:00:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461363\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458231617\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo you have some suggestions ? mistakes not to do ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRovers eat a lot of electricity.  Are you planning on doing long cross-country journeys where you go halfway around the planet, or just pootling around a few kilometers?  If it\u0027s the former, you need to make sure that you have enough electricity to run continuously at full power.  If it\u0027s the latter, you don\u0027t need so much electricity generating capacity, as long as you have a reasonable amount of battery storage.\n\u003C/p\u003E\n\u003Cp\u003E\nI usually power my rovers solar-only (unless I\u0027m out beyond Duna where solar = teh sucks). PB-NUK is fine, but you\u0027d need a lot of them to do continuous full-power rover exploring.\n\u003C/p\u003E\n\u003Cp\u003E\nMy usual rover designs for vac worlds have a few of the retractable 1x6 solar panels mounted in a V shape, tilted about 30 degrees above horizontal to keep them well clear of the ground for when I may tumble a bit.  For worlds with an atmosphere, I tend to use a fair number of OX-STAT panels on the back of the rover, so that I can keep generating some electricity even when in motion... but I still include a couple of the retractables, which I can extend when I stop in order to charge up more rapidly.\n\u003C/p\u003E\n\u003Cp\u003E\nYour main concern with breaking wheels is not going too fast as in \u0022I went over 60 m/s and they can\u0027t handle that much\u0022, but rather the \u003Cem\u003E\u003Cu\u003Ebumpiness\u003C/u\u003E\u003C/em\u003E of terrain:  hitting a sudden speed bump can break your wheels even if you\u0027re going fairly slow.  It matters a lot how smooth the terrain is, which varies a lot from planet to planet.  If you\u0027re on the Minmus flats, knock yourself out.  :-)  Otherwise terrain is a concern.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother wheel-breaking worry besides just how bumpy the terrain is, is how massive your rover is, i.e. how many tons per wheel.  More massive rover = more inertia = more strain on the wheels when you hit a bump = more likely to break.  If you have a very lightweight rover, wheel breakage is much less of an issue than with something massive.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022ruggedized\u0022 wheels you get at tech 550 are a \u003Cem\u003E\u003Cu\u003Elot\u003C/u\u003E\u003C/em\u003E more breakage-resistant than the simple ones you get at tech 300, so use those if you possibly can.  The fragile ones are certainly usable, but you have to baby them a lot more. In particular, your effective max speed over terrain will be lower for the low-tech wheels, because you\u0027ll have to go slower to avoid breaking them.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen placing wheels, make sure you give yourself plenty of ground clearance-- your rover body will \u0022sink\u0022 quite a bit when the suspention bottoms out as you go over rough terrain, and you don\u0027t want anything other than wheels to touch the terrain while you\u0027re zipping over it.  In other words, if you\u0027re using a cylindrical 1.25m rover body, don\u0027t mount the wheels directly on the left and right sides like a lizard\u0027s legs; you want them a bit underneath.  I usually mount my wheels radially about 45 degrees below the left and right sides, then use the rotator widget to adjust the wheels so that their axis is parallel to the ground.\n\u003C/p\u003E\n\u003Cp\u003E\nIncidentally:  All of the above advice is based on 1.0.  From what Squad has said in their devnotes, apparently wheel physics will be getting a major overhaul in 1.1 due to the Unity engine change, and I have no idea what the experience will be like in 1.1-- about the same?  more breakage-prone? less breakage-prone?  No clue.  So take all this advice with a grain of salt until 1.1 is out and there\u0027s more data on what the experience is like.\n\u003C/p\u003E\n\u003Cp\u003E\nOne absolute must have for a rover:  \u003Cem\u003E\u003Cu\u003Eput a headlight on it\u003C/u\u003E\u003C/em\u003E.  The long-range spotlight, not the short-range floodlight.  You need to be able to see where you\u0027re going, bumps can kill you.  Without a headlight, you basically have to sit around doing nothing any time the sun is lower than about 15 degrees above the horizon, \u0027coz you just can\u0027t see where you\u0027re going.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re roving on Eve, I suggest putting some stubby fixed wings on the left and right sides of the rover.  Doesn\u0027t need to be a lot.  You can glide suprisingly well-- enough to land with when descending from space, for example, and when you come to a steep downslope you can glide there, too.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461363\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458231617\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI was wondering about structural fuselage and sticking equipment on it. Stack probe up front and stack battery at the back.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat should work pretty well.  I\u0027m a big fan of the structural fuselage-- light, stiff, strong.  Gives you some wheelbase to make it less likely to tumble.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461363\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458231617\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf I understand, top speed is around 23m/s and tire blow if I go over 60m/s (means I fall ?)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTop speed is about that, yes.  Tires will \u003Cem\u003E\u003Cu\u003Edefinitely\u003C/u\u003E\u003C/em\u003E blow over 60 m/s, even if you\u0027re on perfectly level ground.  But in practice, if you\u0027re going over anything but Minmus flats, you\u0027re going to have to go way slower than that.  Bumps in the terrain smack hard.  In practice, I find going faster than 18 m/s is very risky unless I\u0027m watching the terrain like a hawk and ready to slow down any time there\u0027s an irregularity.  If you have heavy loading per wheel, the safe limit may be lower than that.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso:  it takes \u003Cem\u003E\u003Cu\u003Eforever\u003C/u\u003E\u003C/em\u003E to get anywhere in a rover, so you\u0027ll find yourself wanting to use physics warp to speed things up.  It does... but it also makes your rover more fragile and tires more likely to pop, so your safe speed limit will be somewhat lower in m/s if you\u0027re running with physics warp.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461363\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458231617\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nFor vac bodies, I\u0027ll add a skycrane stage (and hope not to blow tires on landing)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat works.  Actually, for small science rovers, what I like to do is not bother with a skycrane, and just put a little engine (like a Spark) on the rear of the rover, with a small fuel tank like an Oscar.  The small amount of weight doesn\u0027t bother the rover much, when it\u0027s landed.  The rover just lands itself, coming down tail-first to a soft landing, then rotates down to the horizontal.  Simple, easy, lightweight.  It also can be handy when you get into a region with steep hills and can use a bit of a rocket boost to go up.  Or if you\u0027re running around at high speed on a low-grav world and accidentally go flying off a hill crest, and fall a long way, and are plummeting wheel-breakingly fast towards the surface; you can use a rocket assist to slow down.\n\u003C/p\u003E\n\u003Cp\u003E\n(I actually like to put a taillight on my rovers like this, and then in the \u0022Action\u0022 tab of the VAB, I deliberately take the taillight \u003Cem\u003E\u003Cu\u003Eout\u003C/u\u003E\u003C/em\u003E of the \u0022Light\u0022 group and put the light into the \u0022Gear\u0022 group.  That way, the light serves as my \u0022landing gear\u0022 to provide a visual reference when landing, extremely helpful in gauging my distance from surface when I\u0027m on final approach.  And it toggles on/off separately from the headlight, which \u003Cem\u003E\u003Cu\u003Eis\u003C/u\u003E\u003C/em\u003E in the Light group.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-03-17T17:34:35Z","Content":"\n\u003Cul\u003E\u003Cli\u003E\nIf you intend to drive with WASD, remember to turn off any reaction wheels to avoid rotation while you\u0027re steering.\n\u003C/li\u003E\n\u003Cli\u003E\nThe farther apart your wheels are, the more stable your rover is. An I-beam sticking off the side may look foolish, but you\u0027ll have the last laugh when you\u0027re able to go a kilometer without a quickload.\n\u003C/li\u003E\n\u003Cli\u003E\nYou can toggle brakes per wheel. Disabling your forward brakes can prevent your rover from flipping when you try to stop it.\n\u003C/li\u003E\n\u003Cli\u003E\nBring a high level Engineer to repair your wheels.\n\u003C/li\u003E\n\u003Cli\u003E\nFuel cells and ISRU might be a viable alternative to solar or RTGs, if you\u0027re patient.\n\u003C/li\u003E\n\u003Cli\u003E\nThe surface prograde vector is bugged pre-1.1 (and I think they said it\u0027ll be fixed in 1.1); it looks like your surface velocity is applied twice, so don\u0027t completely trust the navball.\n\u003C/li\u003E\n\u003Cli\u003E\nIt really does take a very, very long time to get anywhere, and it doesn\u0027t help that you have to babysit your velocity with W, S, and B thanks to the lack of throttling for wheels.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nNot quite rover specific, but I only tend to forget it with rovers:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nYou need crew for optimum science collection (crew reports, EVA reports, and surface samples), and you \u003Cstrong\u003Ecan\u0027t\u003C/strong\u003E get crew reports from a command chair; it has to be an enclosed pod.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nIf you\u0027re OK with \u0022cheating\u0022:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nMinmus\u0027s solar occlusion model was a bit bugged at one point; if they haven\u0027t fixed it, consider solar panels on the bottom of the rover for nighttime operation on Minmus.\n\u003C/li\u003E\n\u003Cli\u003E\nJet engines have a center of mass outside the actual model, which some people have exploited to give rovers a very low center of mass for added stability.\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-17T17:58:14Z","Content":"\n\u003Cp\u003E\nThx for your answers.\n\u003C/p\u003E\n\u003Cp\u003E\nI was also thinking about retrofitting my usual lander with wheels. I\u0027ll test that too.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll do some Kerbin testing.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd BTW : do you design rovers in VAB or SPH ?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-17T17:58:43Z\u0022 title=\u002203/17/2016 05:58  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 17, 2016\u003C/time\u003E by Warzouz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-03-17T18:05:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461470\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458237494\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd BTW : do you design rovers in VAB or SPH ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSPH is marginally easier since it gets you a horizontal orientation and mirror symmetry by default, but I transfer to VAB to build the launcher.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-17T18:27:42Z","Content":"\n\u003Cp\u003E\nOK, here is my starting base.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nFront wheel : no motor, brake = 100, steering\n\u003C/li\u003E\n\u003Cli\u003E\nRear wheel : motor, no steering, brake = 600\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://tof.canardpc.com/view/b7905aa4-4849-4f95-b14b-77877712e68d.jpg\u0022 alt=\u0022b7905aa4-4849-4f95-b14b-77877712e68d.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s reasonably stable. To flip on braking. Only flips on hard turns, but I\u0027ve time to correct. Autonomous.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-17T20:32:24Z","Content":"\n\u003Cp\u003E\nOk, that was easier than expected ! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere is the science rover \u0022Doggy One\u0022 (every science equipment except Material Study), equipped with the Tylo-rated Skycrane (tested on Kerbin).\n\u003C/p\u003E\n\u003Cp\u003E\nRover is 875kg and 3660kg with Tylo Skycrane (2700m/s, TWR=1.25)\n\u003C/p\u003E\n\u003Cp\u003E\nAtmospheric analyzers are useless, but look nice \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022953335db-76d6-440f-ad07-e2d28f9986e2.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://tof.canardpc.com/view/953335db-76d6-440f-ad07-e2d28f9986e2.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow I\u0027ve to develop a variant for Eve and Laythe with a heatshield. I suppose this version will do for Duna. No need for chutes and heatshield.\n\u003C/p\u003E\n\u003Cp\u003E\nSome more test :\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe rover can land by hitting the ground at 10m/s, not tire blast.\n\u003C/li\u003E\n\u003Cli\u003E\nBraking hard doesn\u0027t flip the rover. But it can if the skycrane is still attached.\n\u003C/li\u003E\n\u003Cli\u003E\nThe rover can flip while jumping\n\u003C/li\u003E\n\u003Cli\u003E\nX4 physic warp is... dangerous\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-17T21:12:32Z\u0022 title=\u002203/17/2016 09:12  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 17, 2016\u003C/time\u003E by Warzouz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vim Razz","CreatedById":43764,"CreatedDateTime":"2016-03-17T20:38:05Z","Content":"\n\u003Cp\u003E\nLots of good stuff in this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you plan to spend a lot of time rovering, it might be worth mapping a set of drive controls to something other than WASD.  I\u0027ve got them on the arrow keys (with camera controls re-mapped to the number pad) with \u0022roll\u0022 double-bound to left and right so that rovers with reaction wheels lean into the turn.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you can use trim control on drive keys (ex: hold alt\u002Bforward to set in forward acceleration, alt-x to clear).  Using trim this way works the same as rotational trim (the longer you hold, the stronger the setting), but there are no UI indicators to tell you what your current drive trim settings are.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-17T22:07:52Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461441\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458236075\u0022 data-ipsquote-userid=\u0022156657\u0022 data-ipsquote-username=\u0022HebaruSan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, HebaruSan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you intend to drive with WASD, remember to turn off any reaction wheels to avoid rotation while you\u0027re steering.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually, that brings up an excellent point I forgot to mention.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, opinions vary on this, but for me:  I like to put some powerful reaction wheels on my rovers, especially if they\u0027re on a low-gravity world (meaning pretty much anywhere but Eve).  Rovers tumble easily in low grav, and the best defense against this is strong SAS.  However, doing this means I \u003Cem\u003E\u003Cu\u003Edefinitely\u003C/u\u003E\u003C/em\u003E need to remap the keys.  I like to remap the rover controls (forward, reverse, turn left, turn right) to the numpad, so that I can drive and steer with both the torque controls WASD as per usual, in concert with the rover controls on the numpad.\n\u003C/p\u003E\n\u003Cp\u003E\nOn Eve it doesn\u0027t matter much, the gravity\u0027s so string that your rover stays pretty much glued to the ground.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461510\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458239262\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOK, here is my starting base.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNice start!  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Making it a bit longer front-to-back would help a lot with resting a flip when braking hard.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461711\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458246744\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHere is the science rover \u0022Doggy One\u0022\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNice!  Like the skycrane.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSuggestion, put a reaction wheel on the rover itself-- will help with stability, as long as you map the rover steering controls away from the WASD torque controls.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-18T08:15:40Z","Content":"\n\u003Cp\u003E\nI\u0027ll add a small reaction wheel upfront and a material lab at the back. The rover will be around 1 ton. Crane will be OK, but Tylo crane may qualify as low TWR.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll test it on Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\nI have a idea for a 4 rover carrier. The carrier will be equipped with science to do high and low non reusable science \u002B a survey scanner. The carrier is designed to be deployed into polar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nTotal carrier weight should be around 20 tons (Tylo crane version). I\u0027ll be able to send it easily anywhere.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nDo you have any idea for a design with heat shield (I think I could stick it on top of the crane with a decoupler so it would reenter up front and the crane would still be usable with the shield to maneuver and deorbit. Further more, that would still fit in my carrier. Chutes could be added on the crane.\n\u003C/p\u003E\n\u003Cp\u003E\nBut as I increase the size of the rover, wheels may be out of the shield.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT : Hopefully wheels behave strangely. As the rover flip while braking, I was doing a classic thing : rdecung brake force on front wheel. That mainly solved the forward flipping on Kerbin. But as I added the crane, I tested the brakes again. and it flipped. That make basically no sense as forward wheel don\u0027t brake. Braking could have been less effective and may result in lateral control loss but not flipping forward.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope 1.1 will improve wheels.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-18T08:20:19Z\u0022 title=\u002203/18/2016 08:20  AM\u0022 data-short=\u00228 yr\u0022\u003EMarch 18, 2016\u003C/time\u003E by Warzouz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-18T11:48:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461363\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458231617\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n19 hours ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI was wondering about their design and especially electricity. The most efficient wheels seems to use 0.7e/s. As I like standard build, I want to do a PB-Nuke rover not a solar one (I had bad experience landing solar probe on Eve pole and getting no direct sun because of surrounding hills..).\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nDoes wheels use 0.7e/s per wheel ?\n\u003C/li\u003E\n\u003Cli\u003E\nIn that case should I build a 2 wheel rover helped by 2 additional landing gears ?\n\u003C/li\u003E\n\u003Cli\u003E\nIf I understand, top speed is around 23m/s and tire blow if I go over 60m/s (means I fall ?)\n\u003C/li\u003E\n\u003Cli\u003E\nI was wondering about structural fuselage and sticking equipment on it. Stack probe up front and stack battery at the back.\n\u003C/li\u003E\n\u003Cli\u003E\nFor vac bodies, I\u0027ll add a skycrane stage (and hope not to blow tires on landing)\n\u003C/li\u003E\n\u003Cli\u003E\nFor atmo bodies, I\u0027ll go with the heat shield and small deorbiting engine.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nDo you have some suggestions ? mistakes not to do ?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n1.  Yup, the ruggedized rover wheels currently use 0.7 EC/sec at full, continuous power.  This might change in 1.1 in the wheel overhaul but I don\u0027t know.  An RTG makes 0.75 EC/sec, enough to run the wheel and have some left over (especially due to the excess from the RTGs running the other wheels) for the probe core, SAS, and lights.  HOWEVER, RTGs cost $23K each or so, meaning even a small probe rover weighing less than a ton will cost about $100K.  Of course, RTGs are at the end of the tech tree so by then you can afford such extravagance.\n\u003C/p\u003E\n\u003Cp\u003E\nHOWEVER, you normally only run the wheels continuously when going up long hills on relatively high-gravity planets.  If you\u0027re going to a low-gravity place, and/or avoid climbing mountains, and/or have a big battery capacity, you can usually get by with fewer RTGs.\n\u003C/p\u003E\n\u003Cp\u003E\n2.  It\u0027s generally better to have all the wheels the same type, for stability reasons.\n\u003C/p\u003E\n\u003Cp\u003E\n3.  Yup on the speeds.\n\u003C/p\u003E\n\u003Cp\u003E\n4.  I tend to put the important guts of probe rovers in the middle and keep the ends as light as possible.  First, this protects the important bits from ground impacts.  Second, it makes the rover easier to get back rightside up if it flips.\n\u003C/p\u003E\n\u003Cp\u003E\n5.  Skycranes don\u0027t work well with carrying multiple rovers per ship.  I find it a lot easier to use radially mounted tanks/engines.  These are attached to the main rover body by the Hardpoints, the only radial decouplers that leave no residue.  This enables stacking several rovers atop each other, all neatly nested and enclosed by the same fairing.  Such as this:\n\u003C/p\u003E\n\u003Ca href=\u0022https://flic.kr/p/sm6ZYw\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u002201-09 PERVs\u0022 class=\u0022ipsImage\u0022 src=\u0022https://farm6.staticflickr.com/5338/17292776474_34965717ba_b.jpg\u0022\u003E\u003C/a\u003E\n\u003Cp\u003E\nAlso note that each rover has 2 probe cores.  It has a 1.25m core amidships  (between the SAS and battery), and it has a 0.625m probe core mounted horizontally on top.  The 1.25m core is for driving, the 0.625m is for landing.  You switch from 1 to the other as needed so the navball is aligned correctly when what you\u0027re doing.  When adding the landing probe core, it appears in the SPH on edge.  Hit the S key 1 time to level it.  This puts it facing the correct direction for navball purposes.\n\u003C/p\u003E\n\u003Cp\u003E\nThe landing core is also the point of attachment between stacked rovers.  Each rover also has a 2nd cubic octagonal strut on the belly.  Put a 0.625m stack separator (the blue ring) on top of the landing probe core, then set the next rover\u0027s belly strut on top of that.  Thus, no residue from separating the rovers, either.\n\u003C/p\u003E\n\u003Cp\u003E\n5.  Another way to land rovers in atmospheres is to mount them vertically atop a normal lander.  Once on the ground, the lander tips itself over thanks to a clever arrangment of legs so the rover is more or less horizontal and just above the ground.  Then release the rover.  This way, the rover only needs a driving probe core, but the lander needs its own stack core for flight.  However, this method only really works for 1 rover at a time.\n\u003C/p\u003E\n"},{"CreatedByName":"radonek","CreatedById":84077,"CreatedDateTime":"2016-03-18T13:12:27Z","Content":"\n\u003Cp\u003E\nMy 2c to lots of good stuff here:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nstick things down to have CoM low. Especially those heavy PB-Nuks.\n\u003C/li\u003E\n\u003Cli\u003E\nso you pushed everything down and have CoM almost touching ground? Great, now move camera to forward view and move things back up a bit to have more ground clearance.\n\u003C/li\u003E\n\u003Cli\u003E\nwhile having landing light is good, having more is better. You see big splotch of light first which then separate to distinct beams. If you angle them correctly, it give good perception of height even in complete darkness.\n\u003C/li\u003E\n\u003Cli\u003E\nweight is a factor too. if your wheels get often broken by small bumps, add more wheels to distribute weight more.\n\u003C/li\u003E\n\u003Cli\u003E\nhave some  spare torque. If I see rover is going to flip, I just bash F key and only then I start thinking how to recover. Minums rover definitely should be able to turn itself over.\n\u003C/li\u003E\n\u003Cli\u003E\nthink about what will be softest part on each side of your rover. Especially lower front can get into contact with terrain when breaking hard. Also bottom of four-wheelers can get hit while going over sharp edges.\n\u003C/li\u003E\n\u003Cli\u003E\nnot sure about wings on Eve. If they have enough lift to be useful, they will just the same make you more flip-prone. Never tried that though.\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"Kerbal101","CreatedById":157058,"CreatedDateTime":"2016-03-18T13:28:46Z","Content":"\n\u003Cp\u003E\nI hate stock wheels... They do only 10-20 m/s and can unexpectedly break \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThats why my rollers are made of girders, empty RCS fuel tanks and joints from Infernal Robotics. These come earlier in carrier mode and can easily carry over 80 tons at 30 m/s, without risk of braking.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-18T13:34:15Z","Content":"\n\u003Cp\u003E\nThx\n\u003C/p\u003E\n\u003Cp\u003E\nBTW I\u0027ve changed the wheels to reduce flip\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nFront wheels : steering and motion\n\u003C/li\u003E\n\u003Cli\u003E\nRear wheels : braking\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAs I use only 2WD and not 4WD, I only need 2 PBNuke and not 4. And mixing wheels and landing gear didn\u0027t do well. I started on the runway with the wheel IN the ground and I could get out of it. When I used 4 wheel, not problem.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for the unflip device, I tried the landing gear on top, but that hit the crane and blew everything. I\u0027ll do some testing to see if the rover is usable. I was also considering RCS thrusters.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not sure about stacking the rover on top of each other. As I intend to increase it\u0027s length, that may not fit. I\u0027ll try a carrier design this evening. 4 rover may fit around a central axis, I may have to offset 2 by 2. I\u0027ll dig into it.\n\u003C/p\u003E\n\u003Cp\u003E\nObjectives for this evening :\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nAdd reaction wheel control to Doggy One\n\u003C/li\u003E\n\u003Cli\u003E\nIncrease length by adding a small lab\n\u003C/li\u003E\n\u003Cli\u003E\nTest on Kerbin\n\u003C/li\u003E\n\u003Cli\u003E\nTest in Minmus\n\u003C/li\u003E\n\u003Cli\u003E\nDesign the carrier for 4 doggy rovers (should be quite light but very bulky)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAnd BTW, here is the name of my rover design\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nDoggy : the actual rover\n\u003C/li\u003E\n\u003Cli\u003E\nLeash : the sky crane (which comes in 4 variations)\n\u003C/li\u003E\n\u003Cli\u003E\nPack Master : the carrier probe in low polar orbit\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2016-03-18T15:54:22Z","Content":"\n\u003Cp\u003E\nThere is another issue with rovers in Eve. Due the strong gravity, if you\u0027re driving downhill, the rover can speed up very fast and, once it\u0027s above 50 m/s, the wheels will break\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-18T16:06:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222462548\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458301720\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThese are attached to the main rover body by the Hardpoints, the only radial decouplers that leave no residue.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt\u0027s true they leave no residue... but residue doesn\u0027t matter much (at least, not to me), because it\u0027s ephemeral.  The moment you save and reload, or switch back to KSC or some other ship and come back, the residue evaporates.  So, if I can eliminate the residue in a few seconds with two keystrokes, I tend not to worry about it much.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222462548\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458301720\u0022 data-ipsquote-userid=\u002269507\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Geschosskopf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n4.  I tend to put the important guts of probe rovers in the middle and keep the ends as light as possible.  First, this protects the important bits from ground impacts.  Second, it makes the rover easier to get back rightside up if it flips.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAgreed with this.  Plus, there\u0027s a third benefit you didn\u0027t mention:  putting most of the mass in the center means the rover has a lower moment of inertia, which in turn means it requires less torque to turn, which in turn means that when you hit a bump with your front wheels, the wheel suspension takes less of a \u0022shock\u0022 and you\u0027re therefore a little less likely to bust a wheel.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222462605\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458306747\u0022 data-ipsquote-userid=\u002284077\u0022 data-ipsquote-username=\u0022radonek\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, radonek said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nnot sure about wings on Eve. If they have enough lift to be useful, they will just the same make you more flip-prone.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo flipping problem at all.  I\u0027ve used \u0027em on Eve, they worked great.  \u003Cem\u003E\u003Cu\u003EStubby\u003C/u\u003E\u003C/em\u003E wings, is the thing.  Mount them on left and right, putting the CoL just slightly behind the CoM.  No problem at all.  It only takes a tiny amount of wing to be able to glide on Eve.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222462783\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458316462\u0022 data-ipsquote-userid=\u0022105344\u0022 data-ipsquote-username=\u0022juanml82\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n11 minutes ago, juanml82 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThere is another issue with rovers in Eve. Due the strong gravity, if you\u0027re driving downhill, the rover can speed up very fast and, once it\u0027s above 50 m/s, the wheels will break\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis is one reason I like to put stubby wings on Eve rovers.  If you start to go too fast, just pull up and glide gently and slowly until you get down to where the slope levels out.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-03-18T16:14:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461363\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458231617\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs 1.1 approaches...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry, matey. Would like to help but I just can\u0027t read a thread with your profile picture in it. I\u0027m sure this is a problem with me but it just makes me feel nauseas. \u003Cimg alt=\u0022:blush:\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 title=\u0022:blush:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-03-18T17:32:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222462631\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458308055\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBTW I\u0027ve changed the wheels to reduce flip\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nFront wheels : steering and motion\n\u003C/li\u003E\n\u003Cli\u003E\nRear wheels : braking\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nAs I use only 2WD and not 4WD, I only need 2 PBNuke and not 4. And mixing wheels and landing gear didn\u0027t do well. I started on the runway with the wheel IN the ground and I could get out of it. When I used 4 wheel, not problem.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThese things are not hard-and-fast rules or even best practices, but are things you can use or not depending on circumstances.  Lots of folks seem to treat them as dogma but they\u0027re really not.  For example, steering.  4-wheel steering is essential for maneuvering in tight places or where you need precise positioning (like docking to a base).  And it causes no problems at any other times if you know how to drive.  Trying to turn hard at high speed will flip you even with 2-wheel steering so I count this one as a myth.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s largely the same with 2-wheel vs. 4-wheel braking.  The only reason to have no front brakes is if you routinely stomp the brakes at high speed.  If you just tap them, and do a lot of your slowing with reverse drive instead of brakes, you don\u0027t need to worry about flipping when stopping very much.  HOWEVER, this depends a lot on the type of wheel you\u0027re using.  Some wheels are much more grabby than others so do some test drives.  And remember, there\u0027s a right-click adjustment for brake torque you can use.\n\u003C/p\u003E\n\u003Cp\u003E\nAs to 2-wheel vs. 4-wheel drive, the viability of this varies with the weight of the rover, the steepness of the terrain, and the gravity of the planet.  If the rover is light enough, and the hills aren\u0027t too steep, you can get away with it.  But in other cases, you\u0027ll need more oomph to go where you want to.  Also, the best braking comes from applying reverse drive while moving forward and the more powered wheels you have, the better braking you have.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAs for the unflip device, I tried the landing gear on top, but that hit the crane and blew everything. I\u0027ll do some testing to see if the rover is usable. I was also considering RCS thrusters.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere\u0027s no point in having a mechanical un-flip device.  They don\u0027t work on any place with high gravity and on places with low gravity, they work too well.  It\u0027s best just not to flip over to begin with, which is mostly a matter of not driving like a drunken, texting teenager.  But if you flip on a low-gravity place, if torque alone won\u0027t flip you back, you can just use a little RCS.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222462798\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458317195\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n59 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s true they leave no residue... but residue doesn\u0027t matter much (at least, not to me), because it\u0027s ephemeral.  The moment you save and reload, or switch back to KSC or some other ship and come back, the residue evaporates.  So, if I can eliminate the residue in a few seconds with two keystrokes, I tend not to worry about it much.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBut the Hardpoints have other advantages over other radial decouplers.  First is their shape, which is VERY convenient for positioning the tanks where you want them.  Second is that you can remove them from the staging menu so you don\u0027t accidentally fire them before you\u0027re ready.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222461721\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458247085\u0022 data-ipsquote-userid=\u002243764\u0022 data-ipsquote-username=\u0022Vim Razz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n20 hours ago, Vim Razz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIf you plan to spend a lot of time rovering, it might be worth mapping a set of drive controls to something other than WASD.  I\u0027ve got them on the arrow keys (with camera controls re-mapped to the number pad) with \u0022roll\u0022 double-bound to left and right so that rovers with reaction wheels lean into the turn.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, remapping the driving keys is very useful and important.  It tends to minimize adverse roll and yaw when turning, it allows you to do pitch and roll corrections easily mid-jump to land flat aftwards, and you can use both torque and steering as needed to turn, or 1 or the other.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-18T18:23:33Z","Content":"\n\u003Cp\u003E\nMinmus test : that was much less fun than I expected. I don\u0027t understand why, the the rear of the rover is lifting when I accelerate. Torque partially compensate. Rover is 1.1T.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT : Remapping steering solve this issue : \u003Cstrong\u003Eit\u0027s VERY important to remap the keys\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nBrake works fine, no flipping. But on stop, with brake on, the river starts to jiggle.\n\u003C/p\u003E\n\u003Cp\u003E\nEDITs : well, that mountain was very far....\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-03-18T19:40:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222462967\u0022 data-ipsquote-contentid=\u0022134394\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221458325413\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMinmus test : that was much less fun than I expected. I don\u0027t understand why, the the rear of the rover is lifting when I accelerate.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT : Remapping steering solve this issue : \u003Cstrong\u003Eit\u0027s VERY important to remap the keys\u003C/strong\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDing ding ding!  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t remap the keys, then \u0022W\u0022 is telling your rover \u0022Use the wheels to accelerate forward, \u003Cem\u003E\u003Cu\u003EAND\u003C/u\u003E\u003C/em\u003E use the reaction torque to try to pitch down.\u0022\n\u003C/p\u003E\n"},{"CreatedByName":"seaces","CreatedById":131939,"CreatedDateTime":"2016-03-18T19:45:27Z","Content":"\n\u003Cp\u003E\n\u003Ciframe class=\u0022imgur-album\u0022 frameborder=\u00220\u0022 height=\u0022550\u0022 src=\u0022//imgur.com/a/a3dUw/embed?background=ffffff\u0026amp;text=1a1a1a\u0026amp;link=4e76c9\u0022 width=\u0022100%\u0022\u003E\u003C/iframe\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThere is my roover on the Moon. It has almost every science experiment except those that require atmosphere and materials bay was too big for me. I have used Infernal robotics parts to make it more compact for crane, on the bottom I have 4 small airbags also from one mod and it had 4 retrorockets also fro mone mod. I included all these to guarantee a safe landing and good error margin. Oh and Infernal robotics has a drill ( see the fron of the rover it is lowered) with that I took surface samples. Some batteries got destroyed becouse I fliped this 2 times but got it under control since i put reaction wheels. What I sugest is to play with infernal robtics and rovers it can be made more comapct maybe and add some itneresting option. For example is have used it also to rotate around my panels and also stow the in safe place when I drive, only when I am use the electricity I deploy like this this is to save the panels. Oh and palce on some good postions those 1x1 solar panels they can act like emrgency charing if you destry your big panels or something. that is the only mistake that I made with this design. this one proved really good one and I can go fast too. Autonomy on batteries is like 20 minutes but I destroyed some as I have said so now it is like 11-15min then I have to charge.\u003Cbr\u003E\u003Cbr\u003E\nHope this gives you some ideas. Oh and test test test while on kerbin. I drived this one a lot around rocket launch pad becosue you have some steep hils there so you can see how it can climb, stability etc.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-18T21:18:14Z","Content":"\n\u003Cp\u003E\nRoving on the Mun at 25m/s and jumping into craters is very fun... but dangerous. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI added action groups :\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\n6 : toggle 4WD to climb hills\n\u003C/li\u003E\n\u003Cli\u003E\n8 : Full science activation\n\u003C/li\u003E\n\u003Cli\u003E\n10 : Antenna deploy (cosmetic - it\u0027s a dog after all)\n\u003C/li\u003E\n\u003C/ul\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-19T12:44:25Z","Content":"\n\u003Cp\u003E\nWell everything is going nicely\n\u003C/p\u003E\n\u003Cp\u003E\nHere is my Eve skycrane\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://tof.canardpc.com/view/0eba62a4-b154-4f11-b2ca-64add2f3f349.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00220eba62a4-b154-4f11-b2ca-64add2f3f349.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://tof.canardpc.com/preview/0eba62a4-b154-4f11-b2ca-64add2f3f349.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nRolling down a 30° hill on Eve at 30m/s.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://tof.canardpc.com/view/5c01c212-1c01-41a7-b81d-332bedb23db1.jpg\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg alt=\u00225c01c212-1c01-41a7-b81d-332bedb23db1.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://tof.canardpc.com/preview/5c01c212-1c01-41a7-b81d-332bedb23db1.jpg\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-19T12:46:14Z\u0022 title=\u002203/19/2016 12:46  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 19, 2016\u003C/time\u003E by Warzouz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ryan234abc","CreatedById":136492,"CreatedDateTime":"2016-03-19T13:30:55Z","Content":"\n\u003Cp\u003E\nNice job with the Eve rover!\n\u003C/p\u003E\n\u003Cp\u003E\nAs you\u0027ve probably gathered, centre of mass needs to be very low down. I tend to base my rovers on a turtle as that helps to stick to the low COM model. This is a rover I slapped together quickly and it flipped very quickly.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kuLjkJk.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/kuLjkJk.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow, it works, but when going faster than 3m/s in low G or once a tire is broken, it just flips and there is NO chance of getting it back. Believe me dude, getting a rover down to Eve surface is 1 up from anything I\u0027ve ever done. Quick question though - Are you ever going to get it back again? *HINT HINT CHALLENGE HINT HINT*\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-19T13:35:35Z\u0022 title=\u002203/19/2016 01:35  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 19, 2016\u003C/time\u003E by ryan234abc\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-03-19T15:46:24Z","Content":"\n\u003Cp\u003E\nYes.I\u0027ve figure that the rover, at high speed (\u0026gt;15m/s) can bump, even on flat terrain. This result in loss of control. In that case, the rover don\u0027t blow immediately. That leave the time to control with the reaction wheel. It\u0027s the same when Jumping from cliffs. If you\u0027ve time to set the wheels parallel to to arriving terrain, you don\u0027t bounce and your rover is fine. If you hit one or 2 wheels before the other, you can start a heavy roll. It\u0027s recoverable, but hazardous.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd BTW, The rover performs very well. I was rolling on a 22% slope at 55m/s on Laythe and I could brake to 0 quite fast without even loosing control.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-03-19T16:25:44Z\u0022 title=\u002203/19/2016 04:25  PM\u0022 data-short=\u00228 yr\u0022\u003EMarch 19, 2016\u003C/time\u003E by Warzouz\u003C/strong\u003E\n\u003C/span\u003E\n"}]}