{"TopicId":136051,"ForumId":16,"TopicTitle":"Interplanetary Mothership ideal Acceleration","CreatedByName":"Shikashi","CreatedById":152398,"CreatedDateTime":"2016-04-04T18:49:43Z","PageNum":1,"Articles":[{"CreatedByName":"Shikashi","CreatedById":152398,"CreatedDateTime":"2016-04-04T18:49:43Z","Content":"\n\u003Cp\u003E\nHey all, today I have a rather complicated question...\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, let me explain a bit:\u003Cbr\u003E\u003Cbr\u003E\nI have never visited any other planet besides Duna, so I wanted to change that. I got up the greatest minds of kerbality to create a fully self sustaining mothership, refineries, launchpads and much more included, designed to establish bases at all planets.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, with most things like ore cannisters, containers and stuff unloaded, my mothership can go for 0.9 m/s², even much less when even half filled(but at least i can get somewhere).\n\u003C/p\u003E\n\u003Cp\u003E\nThe question is: HOW MUCH actually is needed for a proper mothership? Or doesn\u0027t it matter and only efficiency is counted?\n\u003C/p\u003E\n"},{"CreatedByName":"N_Danger","CreatedById":159757,"CreatedDateTime":"2016-04-04T19:12:47Z","Content":"\n\u003Cp\u003E\n For me it is the length of time I have to burn at a maneuver node. People have shown that no more than 5 minutes is best (2.5 on ether side). You can do this multiple times raising your orbit each pass.\n\u003C/p\u003E\n\u003Cp\u003E\nIt will depend on where you are going, how massive your ship is and how long you want to deal with this process.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-04T20:05:47Z","Content":"\n\u003Cp\u003E\nI\u0027ve had to burn for 13 minutes once for Jool (so an average acceleration of about 2.6 m/s\u003Csup\u003E2\u003C/sup\u003E), and that was a nightmare. Also it was on a yellow timer and physics warping would have been suicidal - so it probably actually lasted about 20 minutes.\n\u003C/p\u003E\n\u003Cp\u003E\nThe right answer is \u0022it doesn\u0027t matter\u0022, except you shouldn\u0027t really go out of your way to hate the game \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nYou can split the burn over a couple of orbits, but there is no way of splitting the difference between a Minmus/SOI edge burn (say 900 m/s) and your final escape burn (say 2000 m/s), so if you\u0027re going any further than Duna or Eve, you\u0027re looking at a 15-minute burn on your final pass in any event - which means more certainly since you\u0027ll lose most of the Oberth effect towards the end and finish up spending way more dv.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I were you, I\u0027d split the mothership or find some way of putting a heavy lifter behind it to do the escape burn.\n\u003C/p\u003E\n\u003Cp\u003E\nP.S. An average of 2.6 m/s\u003Csup\u003E2\u003C/sup\u003E probably meant I started with a TWR of about 0.2. I don\u0027t ever start with less than about 0.27 these days, unless I know that the mid-burn TWR is going to be signicantly higher.\n\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2016-04-05T12:34:54Z","Content":"\n\u003Cp\u003E\nIdeal for what?\n\u003C/p\u003E\n\u003Cp\u003E\nFor fuel efficiency, one engine will always be more efficient than two of the same engine. But trying to push a megaton mothership around on a single nuke is incredibly tedious.\n\u003C/p\u003E\n\u003Cp\u003E\nFor usability, you want some more. But how much more is a matter of taste; basically, aim to have a ship that can accelerate a few thousand m/s within a few minutes.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m quite fond of mixing up the propulsion on things; a low-TWR high efficiency engine (usually an LV-N) for most things, but with the option to kick in some high-TWR oxidising rocketry when necessary. It\u0027s not the most fuel efficient thanks to the engine dead weight, but much nicer to fly.\n\u003C/p\u003E\n"},{"CreatedByName":"March Unto Torment","CreatedById":149317,"CreatedDateTime":"2016-04-05T14:26:08Z","Content":"\n\u003Cp\u003E\n\u0022Less than two hours,\u0022 is the best answer you\u0027re getting from me, who is currently struggling with a TWR of 0.05 for a Jool ejection burn.\n\u003C/p\u003E\n"},{"CreatedByName":"Shikashi","CreatedById":152398,"CreatedDateTime":"2016-04-06T13:13:38Z","Content":"\n\u003Cp\u003E\nOk ok... So...\n\u003C/p\u003E\n\u003Cp\u003E\nMy mothership made it to Minmus, where it will be refueled and upgraded for a bit.\u003Cbr\u003E\u003Cbr\u003E\nHaving to burn for 15 minutes is not so much of a problem, it is stable in maximum physics warp \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI will also fill in some EPL Rocketparts resource and probably get down to 0.5 m/s²...\n\u003C/p\u003E\n"}]}