{"TopicId":136512,"ForumId":16,"TopicTitle":"Center of Lift","CreatedByName":"glaivens","CreatedById":161665,"CreatedDateTime":"2016-04-09T13:08:27Z","PageNum":1,"Articles":[{"CreatedByName":"glaivens","CreatedById":161665,"CreatedDateTime":"2016-04-09T13:08:27Z","Content":"\n\u003Cp\u003E\nCan anyone tell me why my center of lift is pointing downwards and not the opposite ? Sorry for my ignorance.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2016-04-09T13:13:54Z","Content":"\n\u003Cp\u003E\nWelcome aboard! I\u0027ve only seen that if the wings are angled down. Could you share a pic of the craft in the editor with the CoL marker showing?\n\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2016-04-09T14:08:42Z","Content":"\n\u003Cp\u003E\nIt also happens if the root part of the vessel is rotated 180º in the hanger. If you rotate the vessel so its nose is pointing up slightly it should clear up.\n\u003C/p\u003E\n"},{"CreatedByName":"Jaeleth","CreatedById":136435,"CreatedDateTime":"2016-04-13T20:05:40Z","Content":"\n\u003Cp\u003E\nMost likely you have rotated the part where the wings are attached.\n\u003C/p\u003E\n\u003Cp\u003E\nThe correct way to correct this is either re-rotating that part to correct attitude or remove wings and install them again in case you need that part rotated the way it is. Pitching up the part slightly will also produce the same effect but it is not correct since it will introduce a minor unalignment in your ship, increasing lift and drag too. pitching up wings slightly will also solve the problem but it will generate more lift and, therefore, more drag which might not be intended.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2016-04-13T21:15:37Z","Content":"\n\u003Cp\u003E\nEssentialy, what is happening is that since KSP uses symmetrical airfoils, all craft if moving through the air in the default orientation with no rotation on the wings, would produce no lift.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe SPH COL indicator therefor assumes a slight Angle Of Attack on the whole craft.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nwith careful use of the Rotation widget you can simulate 0 AOA and make the arrow on the lift marker disappear altogether.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022nO9RULw.png\u0022 class=\u0022ipsImage\u0022 height=\u0022625\u0022 src=\u0022http://i.imgur.com/nO9RULw.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"}]}