{"TopicId":136947,"ForumId":16,"TopicTitle":"Rocket Stability","CreatedByName":"Gibster","CreatedById":97634,"CreatedDateTime":"2016-04-14T18:09:36Z","PageNum":1,"Articles":[{"CreatedByName":"Gibster","CreatedById":97634,"CreatedDateTime":"2016-04-14T18:09:36Z","Content":"\n\u003Cp\u003E\nFor too long have most of my rockets oscillated or flipped, making them rather a pain to fly into orbit. I want to be able to build larger rockets without dreading the launch (whereas most of my smaller rockets are more stable). Teach me the way of the stable rocket, as I have tried many things, fins (and trying to disable certain control surfaces), tinkering with thrust vectoring, simply adding more reaction control wheals, etc. all with limited success. Some just replace one problem with another, for example I\u0027ve found that adding fins simply replaces flipping with heavy oscillation. How can I make flying a rocket a joy a again?\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2016-04-14T19:04:27Z","Content":"\n\u003Cp\u003E\nI am assuming you\u0027ve already checked the forum for threads that give basic rocket design 101 tips, mentioning things like checking that center of mass stays above/ahead center of lift/drag even when stages emtpy or decouple, etc (if not, hint hint).\n\u003C/p\u003E\n\u003Cp\u003E\nMaybe you are trying too hard? I know, sounds silly, but stick with me. A basic rocket should need very little help to follow a natural east-prograde trajectory. So try to build it with as few fins/reaction wheels/gimbal as you can get away with first, and only add to it if it\u0027s clear that what is there is too weak to do what it must.\n\u003C/p\u003E\n\u003Cp\u003E\nBut it sounds like you have already tried all the tools... so, have you considered your launch profile? Perhaps your chosen trajectory (or the way you control the rocket) is causing more of an issue than the design.\n\u003C/p\u003E\n\u003Cp\u003E\nTry to keep the rocket as much as possible on the prograde vector, with as little manual control input as possible, for a very smooth gravity turn and minimal fighting with the atmosphere. Many of the problems you mention are only really a problem when you start pointing outside the circle of the navball prograde marker (causing very harsh and hard to fight drag vectors), or because too much manual input oversteers and then needs correcting, causing more and more oscillation.\n\u003C/p\u003E\n\u003Cp\u003E\nI find that a well built rocket is capable of doing a near to perfect and very repeatable gravity turn almost entirely by itself, at most needing a tiny nudge a bit after lift-off to start the prograde slide (a few test launches can quickly show at what speed and how much inclination that one nudge needs to be, but usually at between 50-100m/s nudge to about 80-85 degrees east), and maybe a bit of throttling to keep apoapsis not too far ahead to minimize the need of circularizing (depends a bit on the rocket and staging, but 40-60 seconds ahead of your craft until you reach target tends to produce very nice results). Again, depends on your rocket and staging design, but aim to be at 45 degrees inclination somewhere around 10-15km altitude, 20 degree at around 30-35km, and level with the horizon around 50-55km. There\u0027s still a lot of wiggle room with that to account for various rocket designs and sizes.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd watch what happens when the speed indicator switches from surface to orbit: if there is a clearly visible jolt in the prograde marker, it means your gravity turn can be improved - a good gravity turn will hardly twitch the marker at that moment.\n\u003C/p\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2016-04-14T19:09:42Z","Content":"\n\u003Cp\u003E\nThere are many causes of unstable rockets, but the keys are proper design and piloting. I never tinker with thrust vectoring or control surfaces, and I rarely add reaction wheels.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen designing your rocket:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nThe top of the rocket should be as aerodynamic as possible. Putting a fairing on could be a huge help\n\u003C/li\u003E\n\u003Cli\u003E\nI always have fins at the bottom of my rockets. They\u0027re usually ones with control surfaces\n\u003C/li\u003E\n\u003Cli\u003E\nDon\u0027t have a TWR above 1.5 on the pad. Speed will amplify any small aerodynamic issues\n\u003C/li\u003E\n\u003Cli\u003E\nThe rocket should be aerodynamically stable. This means to test it by flying it, turning off SAS, and giving it a slight nudge in a direction. It should return to pointing to prograde after a few seconds.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nWhen flying your rocket:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nMake only small course corrections (press Caps Lock for fine controls). Don\u0027t ever let your nose get pointed far from your velocity vector\n\u003C/li\u003E\n\u003Cli\u003E\nThat means that your gravity turn should be gradual and smooth. I use a 5-10 degree turn at 50 m/s for medium to large rockets\n\u003C/li\u003E\n\u003Cli\u003E\nDon\u0027t use SAS too much on big rockets -- it tends to cause oscillations. I usually turn it off after my gravity turn, or set it to prograde and turn it on in short spurts\n\u003C/li\u003E\n\u003Cli\u003E\nIf your rocket starts to wobble or bend, don\u0027t try to correct it. Instead, turn off SAS if it\u0027s on, and throttle back slightly\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-14T19:11:07Z\u0022 title=\u002204/14/2016 07:11  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 14, 2016\u003C/time\u003E by Empiro\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CSE","CreatedById":145588,"CreatedDateTime":"2016-04-14T19:30:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222513972\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460660982\u0022 data-ipsquote-userid=\u0022112072\u0022 data-ipsquote-username=\u0022Empiro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 minutes ago, Empiro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n[...] turn off SAS if it\u0027s on, and throttle back slightly\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis. If your small rockets are more stable but your larger ones tumble even though they look just like the small ones scaled up, there are a few factors I can think of that just creep up on you from KSP 1.25m to 2.5m parts, without  deliberate intent on your part to change your designs:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nthe scaled-up rockets might be less stiff, because joint strength is subject to the square-cube law,\n\u003C/li\u003E\n\u003Cli\u003E\nthe scaled-up rockets might be going faster, because the Mainsail is just a better lifter engine than the 1.25m engines that you start with,\n\u003C/li\u003E\n\u003Cli\u003E\nthe scaled-up rockets might be shorter and fatter, relatively, and have worse aerodynamics: with the more capable 2.5m parts you don\u0027t always need as much rocket under your payload to get your target performance,\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n... and actively managing the throttle during the ascent will tend to help with all of this.\n\u003C/p\u003E\n"},{"CreatedByName":"Gibster","CreatedById":97634,"CreatedDateTime":"2016-04-14T19:31:29Z","Content":"\n\u003Cp\u003E\nHmm, so it sounds like I might be over controlling my rocket, which makes sense because for the first 10,000 meters I\u0027m constantly tapping the A or D keys. That\u0027s going to be a hard habit to fight. So what I\u0027m hearing is to make a small 5-10 degree turn around 50 m/s and then let the rocket itself do most of the flying, with only minor course corrections and disabled or prograde SAS.\n\u003C/p\u003E\n\u003Cp\u003E\nBTW here\u0027s one of my problem rockets: \u003Ca href=\u0022http://imgur.com/a/Oohxz\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/Oohxz\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2016-04-14T19:42:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222514010\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460662289\u0022 data-ipsquote-userid=\u002297634\u0022 data-ipsquote-username=\u0022Gibster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 minutes ago, Gibster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHmm, so it sounds like I might be over controlling my rocket, which makes sense because for the first 10,000 meters I\u0027m constantly tapping the A or D keys. That\u0027s going to be a hard habit to fight. So what I\u0027m hearing is to make a small 5-10 degree turn around 50 m/s and then let the rocket itself do most of the flying, with only minor course corrections and disabled or prograde SAS.\n\u003C/p\u003E\n\u003Cp\u003E\nBTW here\u0027s one of my problem rockets: \u003Ca href=\u0022http://imgur.com/a/Oohxz\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/Oohxz\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep, that sounds like it could be the issue. Your rocket looks good -- you can try to take out the reaction wheel. It might be weakening the joint of your rocket a bit. If you take that out, and directly connect the tank to a larger fairing base, I bet your rocket will be rock solid. The only other minor issue I could see is that the TWR is a tad high on both your first and second stages. The easiest way to fix that would be to add more fuel to the second stage, but that\u0027s completely optional -- I think the rocket should fly great either way.\n\u003C/p\u003E\n"},{"CreatedByName":"Gibster","CreatedById":97634,"CreatedDateTime":"2016-04-14T19:47:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222514025\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460662949\u0022 data-ipsquote-userid=\u0022112072\u0022 data-ipsquote-username=\u0022Empiro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Empiro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYep, that sounds like it could be the issue. Your rocket looks good -- you can try to take out the reaction wheel. It might be weakening the joint of your rocket a bit. If you take that out, and directly connect the tank to a larger fairing base, I bet your rocket will be rock solid. The only other minor issue I could see is that the TWR is a tad high on both your first and second stages. The easiest way to fix that would be to add more fuel to the second stage, but that\u0027s completely optional -- I think the rocket should fly great either way.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nOk I\u0027ll try that, I just unlocked the 2.5 meter base fairings anyways. Will report back with my launch to Minmus.\n\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2016-04-14T19:59:53Z","Content":"\n\u003Cp\u003E\nI concur with the others - try the different flight profile you described and let us know. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022true\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve flown weirder rockets well enough.\n\u003C/p\u003E\n"},{"CreatedByName":"the_pazter","CreatedById":153052,"CreatedDateTime":"2016-04-14T21:21:56Z","Content":"\n\u003Cp\u003E\nKerbal joint reinforcement defiantly will get rid of most of the oscillations. and the flipping means, either A: Lack of fins or B: Too Quick, Too Low\n\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-04-15T04:02:35Z","Content":"\n\u003Cp\u003E\nYou\u0027ve already got some really good advice, and rather than beat a dead horse, I thought I\u0027d add some very minor observations regarding the particular rocket you posted that will help. I would suggest using less fins, that rocket looks like it could get away with just basic fins. Use 4 fins, not 6, and make sure they\u0027re on the N, S, E, \u0026amp; W sides of your rocket. Most of the time less is more with fins/reaction wheels/control surfaces. It\u0027s hard to say with your particular rocket, but I\u0027ve found that a lot of times, fairings tend to be counter-productive or just plain unnecessary. You *might* try not using that fairing. Other than that, definitely try altering your ascent profile to the gravity turn methods everyone has already recommended.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222514025\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460662949\u0022 data-ipsquote-userid=\u0022112072\u0022 data-ipsquote-username=\u0022Empiro\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Empiro said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYour rocket looks good -- you can try to take out the reaction wheel. It might be weakening the joint of your rocket a bit.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u002B1\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-04-15T06:34:34Z","Content":"\n\u003Cp\u003E\nSometimes I paint myself into a corner when designing a rocket and then struggle to get it not to flip during ascent and the usual methods either don\u0027t work or aren\u0027t a viable option for some reason. Then you can tackle a common cause of flipping by keeping the fuel mass up-top during the lift.\n\u003C/p\u003E\n\u003Cp\u003E\nBy default, your craft will often lighten at the top/front, with engines at the rear drawing their fuel from the front first. This shifts the CoM back behind the lift and the craft flips. To fix this you can do something like this...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oCVJlN3.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/oCVJlN3.jpg\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nThe engines are isolated from the tanks by a decoupler that has staging and crossfeed disabled. Then add a couple of fuel ducts as you can see. This means the fuel flows from the lower tank, through the upper, through the top fuel duct, the main body, the lower fuel duct and finally to the engine. The fuel in the lower tank then being used first, keeping the CoM forward. \n\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-04-15T16:33:27Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/113764-foxster/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022113764\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/113764-foxster/\u0022\u003E@Foxster\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nGod you\u0027re impressive...that thing is crazy\n\u003C/p\u003E\n"},{"CreatedByName":"mrclucks","CreatedById":139561,"CreatedDateTime":"2016-04-16T13:40:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222514010\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460662289\u0022 data-ipsquote-userid=\u002297634\u0022 data-ipsquote-username=\u0022Gibster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/14/2016 at 4:31 AM, Gibster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHmm, so it sounds like I might be over controlling my rocket, which makes sense because for the first 10,000 meters I\u0027m constantly tapping the A or D keys. That\u0027s going to be a hard habit to fight. So what I\u0027m hearing is to make a small 5-10 degree turn around 50 m/s and then let the rocket itself do most of the flying, with only minor course corrections and disabled or prograde SAS.\n\u003C/p\u003E\n\u003Cp\u003E\nBTW here\u0027s one of my problem rockets: \u003Ca href=\u0022http://imgur.com/a/Oohxz\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/Oohxz\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou might want to swap out the mail sail for the slightly weaker 2.5 m engine(name escapes me) for more DV and such.  If your twr is 1 or a bit below, then add boosters for an initial kick.  If you still need more thrust after that then try adding liquid fuel boosters with reliants on the end.  Once you\u0027re at 20km or so, a .8 twr is fine. \n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-16T20:15:02Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EFoxster   \u003C/strong\u003Ethat\u0027s the most Kerbal thing i\u0027ve seen all day,  nice !\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EGibster\u003C/strong\u003E those pix you shared seem to show the centre of gravity and thrust axis (pink indicator) but where\u0027s the blue centre of lift indicator?\n\u003C/p\u003E\n\u003Cp\u003E\nThose fins look very small in relation to the size of the rocket.    I\u0027d probably rather four larger ones than six small, you can control pitch and yaw independently.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso it\u0027s very tall and thin.   Should still be possible to get that working but i do find shorter fatter rockets nicer to fly.  More frontal area = aero lossses but sometimes it\u0027s worth it for an easier life.\n\u003C/p\u003E\n\u003Cp\u003E\nShort  and fat -\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002220160416141549_1_zpsz3s2ajuo.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022564\u0022 src=\u0022http://i1144.photobucket.com/albums/o492/narostel/20160416141549_1_zpsz3s2ajuo.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-04-17T01:49:21Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152027\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0022\u003E@AeroGav\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a little off topic, but I\u0027m curious...what exactly is going on with that rocket? It\u0027s cost is over 4 million funds, it\u0027s over 300 tons, but it ultimately only has under 5k dV?\n\u003C/p\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-04-17T01:51:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222517840\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460857761\u0022 data-ipsquote-userid=\u0022159324\u0022 data-ipsquote-username=\u0022KocLobster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, KocLobster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s cost is over 4 million funds\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLooks like it\u0027s got at least 12 Vectors, maybe 16, so there\u0027s that.\n\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-04-17T01:55:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222517845\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460857888\u0022 data-ipsquote-userid=\u0022156531\u0022 data-ipsquote-username=\u0022FullMetalMachinist\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, FullMetalMachinist said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nLooks like it\u0027s got at least 12 Vectors, maybe 16, so there\u0027s that.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTrue, but aren\u0027t those only roughly 20k funds? That\u0027s still 3.5million unaccounted for that I can\u0027t see. Maybe I\u0027m just mistaken; maybe he \u003Cem\u003Ehas \u003C/em\u003E4 million funds, and that isn\u0027t the cost of the rocket but how much he has?\n\u003C/p\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-04-17T02:01:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222517850\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460858127\u0022 data-ipsquote-userid=\u0022159324\u0022 data-ipsquote-username=\u0022KocLobster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, KocLobster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nTrue, but aren\u0027t those only roughly 20k funds? That\u0027s still 3.5million unaccounted for that I can\u0027t see. Maybe I\u0027m just mistaken; maybe he \u003Cem\u003Ehas \u003C/em\u003E4 million funds, and that isn\u0027t the cost of the rocket but how much he has?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmmm, true. And the rocket definitely costs 4 million. Now I\u0027m really curious as well...\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-17T05:14:39Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222517840\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460857761\u0022 data-ipsquote-userid=\u0022159324\u0022 data-ipsquote-username=\u0022KocLobster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, KocLobster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152027\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0022\u003E@AeroGav\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a little off topic, but I\u0027m curious...what exactly is going on with that rocket? It\u0027s cost is over 4 million funds, it\u0027s over 300 tons, but it ultimately only has under 5k dV?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSomeone wanted a rocket that could put a 30T lander on Minmus.    I don\u0027t have his mods so i used ModularFuelTanks to swap the contents of the top Kerbodyne tank to 30 Tonnes of Xenon.    That\u0027s probably why.           All I need to do is add one Ox-stat and a Dawn thruster and i\u0027d definitely win the Delta V race.  TWR on the other hand...\n\u003C/p\u003E\n"},{"CreatedByName":"Martian Music","CreatedById":154849,"CreatedDateTime":"2016-04-17T07:44:43Z","Content":"\n\u003Cp\u003E\nI feel you. I got to a point where I was so desperate that I started getting designs from real-life rockets and youtubers. I had good designs (mostly like yours) and still it always went wrong. Turns out it\u0027s mostly in how you do your ascent. Yeah as others explained, the trick is mostly in your early 5-10 degrees turn, and also your TWR. I miss the old \u0022gravity turn at 10k meters\u0022. I\u0027m not sure about this, but more fins makes it worse. Sometimes 2 are enough.\n\u003C/p\u003E\n\u003Cp\u003E\nOn a side note, KJR really helps so I highly suggest it. No, it shouldn\u0027t be considered \u0022cheats\u0022 or whatsoever.\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, I\u0027m really bad at ascents so if I said anything wrong, pls dont kill me.\n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-04-17T16:31:48Z","Content":"\n\u003Cp\u003E\nEspecially for 2.5m or larger rockets, the biggest problem seems to be the fact that when you have multiple tanks stacked on top of each other, the top tank is emptied first and then it works its way down.  This causes your center of mass to shift too far back.  Try splitting it up so each tank has its own stage.\n\u003C/p\u003E\n"},{"CreatedByName":"Wemb","CreatedById":121979,"CreatedDateTime":"2016-04-18T15:35:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222517840\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460857761\u0022 data-ipsquote-userid=\u0022159324\u0022 data-ipsquote-username=\u0022KocLobster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 17/04/2016 at 2:49 AM, KocLobster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152027\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152027-aerogav/\u0022 rel=\u0022\u0022\u003E@AeroGav\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s a little off topic, but I\u0027m curious...what exactly is going on with that rocket? It\u0027s cost is over 4 million funds, it\u0027s over 300 tons, but it ultimately only has under 5k dV?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n... and a TWR of 5.64? Is that for calibrated for Kerbin, cause if so, that really is overbuilt!\n\u003C/p\u003E\n\u003Cp\u003E\nWemb\n\u003C/p\u003E\n"},{"CreatedByName":"KocLobster","CreatedById":159324,"CreatedDateTime":"2016-04-18T15:47:46Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222518050\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460870079\u0022 data-ipsquote-userid=\u0022152027\u0022 data-ipsquote-username=\u0022AeroGav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/17/2016 at 10:14 PM, AeroGav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSomeone wanted a rocket that could put a 30T lander on Minmus.    I don\u0027t have his mods so i used ModularFuelTanks to swap the contents of the top Kerbodyne tank to 30 Tonnes of Xenon.    That\u0027s probably why.           All I need to do is add one Ox-stat and a Dawn thruster and i\u0027d definitely win the Delta V race.  TWR on the other hand...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI don\u0027t understand though; you could easily accomplish that w/o mods for dramatically cheaper. Why use a dawn and xenon? I really struggle to grasp why you\u0027d design a rocket like this. You could easily achieve your goal for less than 200k.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2016-04-18T20:40:49Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222520423\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221460994466\u0022 data-ipsquote-userid=\u0022159324\u0022 data-ipsquote-username=\u0022KocLobster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, KocLobster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI don\u0027t understand though; you could easily accomplish that w/o mods for dramatically cheaper. Why use a dawn and xenon? I really struggle to grasp why you\u0027d design a rocket like this. You could easily achieve your goal for less than 200k.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027ll rephrase this again -\n\u003C/p\u003E\n\u003Cp\u003E\nI PUT THE XENON IN THE KERBODYNE TANK IN ORDER TO CREATE A 30 TONNE BALLAST TO SIMULATE THE WEIGHT OF THE LANDER OF A  PERSON WHO WAS HAVING TROUBLE PUTTING HIS 30 TONNE LANDER ON MINMUS.      That user hadn\u0027t linked a craft file for his lander and was using mods, including a large nuclear reactor for electricity generation, which I did not have installed.   Creating that Kerbo-Xenon tank was the quickest way for me to create a 30 tonne ballast that was about the same size as his lander, so that I could spend more time designing the launcher itself, rather than first trying reverse engineer his Minmus base from a picture.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sure it\u0027s still a rubbish rocket but it\u0027s the most powerful i\u0027ve ever built by some margin.  It was done more to challenge myself than help the OP, other more experienced rocketeers had already posted designs.  I normally concentrate on Spaceplanes.  Pretty sure that person was also in a Sandbox game, so cost was irrelevant.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I remove the Xenon payload, cost drops from 4 and a half million Kredits to 432,000.   Delta V also goes up to 6700.\n\u003C/p\u003E\n\u003Cp\u003E\nXenon is clearly a VERY expensive propellant.  It\u0027s also much heavier than an LF/O tank the same size.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-18T21:26:55Z\u0022 title=\u002204/18/2016 09:26  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 18, 2016\u003C/time\u003E by AeroGav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-04-19T04:43:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222520938\u0022 data-ipsquote-contentid=\u0022136947\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461012049\u0022 data-ipsquote-userid=\u0022152027\u0022 data-ipsquote-username=\u0022AeroGav\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n7 hours ago, AeroGav said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nXenon is clearly a VERY expensive propellant.  It\u0027s also much heavier than an LF/O tank the same size.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd, as I found out when I got bored and stacked something like 100 large tanks of it on the launchpad, it\u0027s also very highly explosive, especially for a noble gas...\n\u003C/p\u003E\n"}]}