{"TopicId":137202,"ForumId":16,"TopicTitle":"Which science data can be safely stored in the capsule without overwriting?","CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2016-04-17T22:33:26Z","PageNum":1,"Articles":[{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2016-04-17T22:33:26Z","Content":"\n\u003Cp\u003E\nI\u0027ve always been confused by which science experiments can and which cannot exist at the same time in the capsule together. Sometimes it would warn you that it will be overwritten, and sometimes it will let you store it without problems.\n\u003C/p\u003E\n\u003Cp\u003E\nI want to touch down in a few different locations on the Mun, collect Goo experiment data, and then store it all in one capsule on the way home. Is that possible or will it now allow me to store them together?\n\u003C/p\u003E\n"},{"CreatedByName":"Leeman","CreatedById":161471,"CreatedDateTime":"2016-04-17T22:44:30Z","Content":"\n\u003Cp\u003E\nIt will be possible. As long as those experiments are unique (i.e.from different Biomes from the mun). It will ask you to overwrite it if you have the same experiment stored already. For Example if you have in the capsule the Goo Experiment from the Easter Crater.. It will ask you to dump it or overwrite it if you try to put in another Goo Experiment from the Easter Crater\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-17T22:45:27Z\u0022 title=\u002204/17/2016 10:45  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 17, 2016\u003C/time\u003E by Leeman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-04-17T23:08:57Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/161471-leeman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161471\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161471-leeman/\u0022 rel=\u0022\u0022\u003E@Leeman\u003C/a\u003E\u0027s got it, you can store all experiment results indefinitely, as long as they\u0027re unique.\n\u003C/p\u003E\n\u003Cp\u003E\nA bit of an extension on his answer, though.  Strictly speaking, you don\u0027t have to always be in different biomes for the result to be unique. What you have to do is be in a different \u003Cu\u003E\u003Cem\u003Esituation\u003C/em\u003E\u003C/u\u003E.  \n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s what I mean, a given science result situation consists of three things:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nThe experiment.  This is the instrument or observation (Goo, temp, crew report, EVA report, etc).\n\u003C/li\u003E\n\u003Cli\u003E\nThe biome/location.  This is (drumroll) the biome or location that you run the experiment at.\n\u003C/li\u003E\n\u003Cli\u003E\nThe condition.  This is \u0022landed\u0022, \u0022flying\u0022, \u0022splashed down\u0022, etc.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nSo, what you get is this:  A Goo observation (experiment) while landed (condition) at the Mun\u0027s East Side Crater (biome).  \u003Cbr\u003E\nAfter taking the result from the Goo experiment and resetting it with a scientist, you can run another observation: Goo low in space over the Mun.  Note that some experiments (like EVA reports) are biome specific while you\u0027re \u0022low in space over __ \u0022, but some can only be done once for \u0022low in space\u0022.  So for those, you can hit every biome twice, once landed, and once low in orbit. \n\u003C/p\u003E\n"},{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2016-04-18T03:28:04Z","Content":"\n\u003Cp\u003E\nAh, got it. Thanks \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-18T09:09:12Z","Content":"\n\u003Cp\u003E\nTo follow up on \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/161471-leeman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022161471\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/161471-leeman/\u0022 rel=\u0022\u0022\u003E@Leeman\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/156531-fullmetalmachinist/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022156531\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156531-fullmetalmachinist/\u0022 rel=\u0022\u0022\u003E@FullMetalMachinist\u003C/a\u003E, the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Science#Activities\u0022 rel=\u0022external nofollow\u0022\u003EKSP wiki page on Science\u003C/a\u003E has a useful table to let you know what counts as \u0022unique\u0022 for each experiment.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso useful to know is that the lab (MPL) can store unlimited copies of any experiment, so there is no need for them to be unique. This means that you can dump everything into the MPL, then EVA to transfer science reports from the MPL to your return capsule (if you try to \u0022store\u0022 multiple reports to a pod, you\u0027ll only transfer unique reports and keep hold of the copies) and return whatever is left to the MPL while remaining on EVA. It\u0027s a bit fastidious doing all this, especially if you have a forest of solar panels in the way (always the case for me) but it can help sometimes.\n\u003C/p\u003E\n"}]}