{"TopicId":137645,"ForumId":16,"TopicTitle":"Building a Munar base?","CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2016-04-21T20:34:00Z","PageNum":1,"Articles":[{"CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2016-04-21T20:34:00Z","Content":"\n\u003Cp\u003E\nHopefully this is the correct forum for this question. I recently did a polar orbit scan of Mun with the M700 to determine the best places for mining ( I don\u0027t have the science for the M4435 narrow-band scanner or I would have put it on the probe also). Anywho, Let\u0027s talk \u0022mining\u0022 for a bit. How is mining worthwhile...I get that you can make fuel...but then what, sell it? So, question 1 is: is mining worth the trouble?\n\u003C/p\u003E\n\u003Cp\u003E\nIf it is, the questions multiply (they always seem to!):\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I have the science for the M4435...is there a way to \u0022mark the spot\u0022 with the best ore concentrations so I can easily find that spot from Mun orbit, and land there?\n\u003C/p\u003E\n\u003Cp\u003E\nHow do you build a \u0022base\u0022? I would like to have a small base for mining ops and science research but I have no idea what parts are used and how that is accomplished.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-04-21T21:44:59Z","Content":"\n\u003Cp\u003E\nIt\u0027s not really worth the trouble mining if you are just playing the game through and reaching the end of the tech tree and such. You can go anywhere in the system from a single launch without refueling. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you get into building space stations all over the place and perhaps building bases on different planets then part of the \u0022fun\u0022 could be building a refueling station, Minmus being favorite for the low gravity. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for building a base...It\u0027s whatever your imagination makes it. Again, it tends to have little real purpose in terms of moving the game along, it\u0027s more of a self-generated goal. There are some great mods out there with hab modules and life support that are worth checking out. \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-04-21T22:16:40Z","Content":"\n\u003Cp\u003E\nAs for \u0022what\u0027s the point of mining\u0022:\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re talking about the Kerbin system (Mun and Minmus), there really isn\u0027t any economic point.  Theoretically yes, you could mine fuel and then either make money by selling it, or save money by not having to launch so much fuel up from Kerbin.  However, it would require so much play time for so little financial gain that there wouldn\u0027t be much economic point.  You could make a lot more money in a lot less of your time by just doing a contract or two.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are basically two reasons for doing mining:\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, just for the fun of it.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  It can be a fun \u0022role-playing\u0022 experience to say, \u0022I\u0027m going to fuel my operations from the Mun and have a big fuel depot in Kerbin orbit\u0022 or whatever.  I don\u0027t do that much myself these days, because I\u0027ve already \u003Cem\u003E\u003Cu\u003Edone\u003C/u\u003E\u003C/em\u003E that enough that the novelty wore off and it\u0027s not particularly fun for me anymore.  But I sure had a ball with it for a career or two.  So, if your prime motivation is gameplay rather than economic, go to it!\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, if you\u0027re mining outside the Kerbin system, it can have a big payoff.  Doing a return mission that will thoroughly explore the Jool system, or Moho, or wherever, becomes a lot easier if you only have to carry fuel for one-way and can refuel locally for the return journey.  You only have to pack half the dV (or less!), which saves a whole bunch of money and makes the engineering much simpler.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for how to build a base:  Hooking things together on the surface of planets is currently a bit of a \u0022hole\u0022 in KSP.  It\u0027s really difficult and frustrating.  It\u0027s \u003Cem\u003E\u003Cu\u003Epossible\u003C/u\u003E\u003C/em\u003E to latch things together on the surface using docking ports, and some folks have had success with it, but I find it incredibly finicky and frustrating, to the point that it kills my enjoyment of the game.  There are a couple of workarounds for this that I\u0027ve used:\n\u003C/p\u003E\n\u003Cp\u003E\nOption #1:  Don\u0027t build a surface base.  Build an \u003Cem\u003E\u003Cu\u003Eorbital\u003C/u\u003E\u003C/em\u003E base.  The thing that goes down to land just mines the fuel and flies it up to an orbital depot, which is where you build all your stuff.  Since you never have to connect together two things that are sitting on the surface, there\u0027s no problem.\n\u003C/p\u003E\n\u003Cp\u003E\nOption #2:  Use Kerbal Attachment System.  It\u0027s a handy mod that includes these nifty little \u0022connector ports\u0022, a small radially attached piece that an EVA kerbal can hook up with just a couple of mouse clicks.  Just land ship A within a couple of dozen meters of ship B, send out an EVA kerbal, clickety-click, they\u0027re connected by a \u0022pipe\u0022 and now they act like they\u0027re one ship.  When you\u0027re done, they\u0027re easily disconnected again.  This way is my favorite.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNo, there\u0027s no way to \u0022mark the spot\u0022 in stock.  I usually just turn on the overlay display in the orbital map and just land my ship on the brightest \u0022glowy spot\u0022.  Some mods do let you add markers in the map view and/or the flight view-- for example, I believe ScanSat has such a marker.  But I generally don\u0027t bother with them, I just use the stock map overlay.\n\u003C/p\u003E\n"},{"CreatedByName":"strider3","CreatedById":199830,"CreatedDateTime":"2016-04-22T00:07:01Z","Content":"\n\u003Cp\u003E\nThank you both. This was a question for the future, as I don\u0027t have the science to do most of it. But, it\u0027s always helpful to know which way to spend your science points. I believe I will save these options for the future...as you said Snark...having \u0022fuel stops\u0022 along a long journey would be helpful. That philosophy reminds me of the early Western U.S. explorers. They would have \u0022caches\u0022 of stuff placed in areas and they would slowly expand their travel abilities by leap-frogging until they had a line of these caches that would support a long journey, without bringing everything needed to survive. Interestingly (or not) I live near the Cache Le Poudre river, French for \u0022hide the powder\u0022 (a direct translation). The early trappers in the area named the river because they would store little caches of gunpowder and other supplies in the area.\n\u003C/p\u003E\n\u003Cp\u003E\nYou helpful people can look forward to my next post...\u0022let\u0027s talk Administration Building strategies\u0022...or you can run away like mad! LOL!\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-22T07:43:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222529212\u0022 data-ipsquote-contentid=\u0022137645\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461277000\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n[...]\n\u003C/p\u003E\n\u003Cp\u003E\nOption #1:  Don\u0027t build a surface base.  Build an \u003Cem\u003E\u003Cu\u003Eorbital\u003C/u\u003E\u003C/em\u003E base.  The thing that goes down to land just mines the fuel and flies it up to an orbital depot, which is where you build all your stuff.  Since you never have to connect together two things that are sitting on the surface, there\u0027s no problem.\n\u003C/p\u003E\n\u003Cp\u003E\nOption #2:  Use Kerbal Attachment System.  It\u0027s a handy mod that includes these nifty little \u0022connector ports\u0022, a small radially attached piece that an EVA kerbal can hook up with just a couple of mouse clicks.  Just land ship A within a couple of dozen meters of ship B, send out an EVA kerbal, clickety-click, they\u0027re connected by a \u0022pipe\u0022 and now they act like they\u0027re one ship.  When you\u0027re done, they\u0027re easily disconnected again.  This way is my favorite.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n[...]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAbsolutely agree with all of that, but there is also:\n\u003C/p\u003E\n\u003Cp\u003E\nOption #3: make your base mostly horizontal, and mount the biggest landing legs on it in the SPH, in mirrored pairs, at exactly the half-way line, and docking ports at the same half-way line (or at the ends, or one end...  Then do the same for whatever you want to add to be base, with a docking port at the front end, but \u003Cem\u003E\u003Cu\u003Ealso\u003C/u\u003E\u003C/em\u003E add wheels to it (preferably rugged ones) so that the wheels don\u0027t quite touch the ground with landing legs fully extended. When it is empty, the landing legs will lift it higher than the heavier base, but with the legs lifted and wheels on the ground, it will sit slightly lower. With a little jostling, you can get them to hook up quite easily, even on relatively uneven ground.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-22T07:44:51Z\u0022 title=\u002204/22/2016 07:44  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 22, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wemb","CreatedById":121979,"CreatedDateTime":"2016-04-22T12:34:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222529485\u0022 data-ipsquote-contentid=\u0022137645\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461283621\u0022 data-ipsquote-userid=\u0022159656\u0022 data-ipsquote-username=\u0022Victor3\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Victor3 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThank you both. This was a question for the future, as I don\u0027t have the science to do most of it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRegardless of the in-game economics, it can be fun trying this - but I found it very difficult to even make it pay off in terms of refining enough fuel to get the fuel back into orbit on the Mun - sure my design was rubbish and inefficient, but still, the gravity on the Mun makes it challenging - so if you are going to try this, I\u0027d suggest doing it on Minmus.\n\u003C/p\u003E\n\u003Cp\u003E\nSnark\u0027s Option 1 - an orbital lander is going to be easier, but I doubt you\u0027ll be able to make it work on the Mun. Option 2 is a lot of fun, though I\u0027ve still not managed to build a refueling base with pipework that didn\u0027t occasionally just detonate without warning. \n\u003C/p\u003E\n\u003Cp\u003E\nOh, and as for science, there\u0027s nothing really in the stock game to be gained from it - you _can_ land a science lab on the moons and get extra science, but since you can max out the tech tree without a science lab at all, and since they take so long to generate returns (compared to bringing the raw data back home), it\u0027s rather all just cosmetic. At least the fuel base can help you reduce the need for sending fuel into orbit as well as your rockets.\n\u003C/p\u003E\n\u003Cp\u003E\nMight want to look into things like USI\u0027s Kolonisation mod if you want a real base/challenge. \n\u003C/p\u003E\n\u003Cp\u003E\nWemb\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-22T12:38:53Z\u0022 title=\u002204/22/2016 12:38  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 22, 2016\u003C/time\u003E by Wemb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"davidy12","CreatedById":143411,"CreatedDateTime":"2016-04-22T12:49:18Z","Content":"\n\u003Cp\u003E\nWhy build moon bases you ask?\n\u003C/p\u003E\n\u003Cp\u003E\nWhy do we build rockets? Why build space stations.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cem\u003E\u003Cu\u003EFOR THE FUN OF IT!!!\u003C/u\u003E\u003C/em\u003E\u003C/strong\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nI love building bases because its fun, even in sandbox mode, think about how you can build it \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-04-22T13:04:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222530156\u0022 data-ipsquote-contentid=\u0022137645\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461311037\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nOption #3:  \u003Cem\u003E\u0026lt;useful technical description of technique\u0026gt;\u003C/em\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, there\u0027s certainly that, and certainly there are plenty of folks who have made surface base-building work for them in stock... but that sort of thing is exactly what I was referring to when I said:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222529212\u0022 data-ipsquote-contentid=\u0022137645\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461277000\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s \u003Cem\u003E\u003Cu\u003Epossible\u003C/u\u003E\u003C/em\u003E to latch things together on the surface using docking ports, and some folks have had success with it, but I find it incredibly finicky and frustrating, to the point that it kills my enjoyment of the game.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n...I\u0027ve done it like you describe, it\u0027s just that it\u0027s so time consuming and fiddly that it\u0027s a total buzzkill for me.  I find myself getting impatient and irritated, instead of actually enjoying the game.  I\u0027m not sure why my reaction is so strong (I\u0027m fairly OCD; goodness knows I plow enough hours into \u003Cem\u003Eother\u003C/em\u003E aspects of this game, why should I get so frustrated at this one?)  My guess is that it comes down to basically two things, for me.  The first is, I get frustrated because it\u0027s not \u003Cem\u003E\u003Cu\u003Esupposed\u003C/u\u003E\u003C/em\u003E to be hard.  Things in the game that are hard, because doing them IRL would be hard, are \u003Cem\u003E\u003Cu\u003Egreat\u003C/u\u003E\u003C/em\u003E!  It\u0027s what makes KSP a fun challenge.  But this feels like such a pointless interruption of gameplay for something that ought to be dead simple that it just bugs me.  It\u0027s as if they made a minigame out of \u0022here are the 12 steps you have to do to zip up your spacesuit before you can send a kerbal on a mission.\u0022  The other thing about it that bugs me is that it\u0027s putting a very narrow design limit on what things have to look like to make them dockable, which again bugs me:  I look at my base and don\u0027t see \u0022oh yay, here\u0027s this neat base that I designed!\u0022, but rather \u0022here\u0027s this ugly kludge that\u0027s not how I would have designed a base, but that I did in order to work around this silly artificial limitation of the game.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not saying that this would necessarily be anyone else\u0027s experience, but it\u0027s certainly mine.  I find that I just can\u0027t stand it, I\u0027d rather spend my time and design efforts elsewhere, so I just can\u0027t be bothered.  KAS answers the problem perfectly for me, so it\u0027s what I do.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-22T17:55:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222530584\u0022 data-ipsquote-contentid=\u0022137645\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461330243\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes, there\u0027s certainly that, and certainly there are plenty of folks who have made surface base-building work for them in stock... but that sort of thing is exactly what I was referring to when I said:\n\u003C/p\u003E\n\u003Cp\u003E\n...I\u0027ve done it like you describe, it\u0027s just that it\u0027s so time consuming and fiddly that it\u0027s a total buzzkill for me.  I find myself getting impatient and irritated, instead of actually enjoying the game.  I\u0027m not sure why my reaction is so strong (I\u0027m fairly OCD; goodness knows I plow enough hours into \u003Cem\u003Eother\u003C/em\u003E aspects of this game, why should I get so frustrated at this one?)  My guess is that it comes down to basically two things, for me.  The first is, I get frustrated because it\u0027s not \u003Cem\u003E\u003Cu\u003Esupposed\u003C/u\u003E\u003C/em\u003E to be hard.  Things in the game that are hard, because doing them IRL would be hard, are \u003Cem\u003E\u003Cu\u003Egreat\u003C/u\u003E\u003C/em\u003E!  It\u0027s what makes KSP a fun challenge.  But this feels like such a pointless interruption of gameplay for something that ought to be dead simple that it just bugs me.  It\u0027s as if they made a minigame out of \u0022here are the 12 steps you have to do to zip up your spacesuit before you can send a kerbal on a mission.\u0022  The other thing about it that bugs me is that it\u0027s putting a very narrow design limit on what things have to look like to make them dockable, which again bugs me:  I look at my base and don\u0027t see \u0022oh yay, here\u0027s this neat base that I designed!\u0022, but rather \u0022here\u0027s this ugly kludge that\u0027s not how I would have designed a base, but that I did in order to work around this silly artificial limitation of the game.\u0022\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not saying that this would necessarily be anyone else\u0027s experience, but it\u0027s certainly mine.  I find that I just can\u0027t stand it, I\u0027d rather spend my time and design efforts elsewhere, so I just can\u0027t be bothered.  KAS answers the problem perfectly for me, so it\u0027s what I do.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSorry, I must have skipped over that bit in your post.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, it really doesn\u0027t have to be hard.\n\u003C/p\u003E\n\u003Cp\u003E\nTo demonstrate, I made a savegame especially for you: killed off all my ships and crew, squandered my money, wrecked KSC, and left just this poor soul trying to get fueled up: \u003Ca href=\u0022http://www.surrendermonkeys.fr/public/KSPSaves/moho%20landing%20-%20RCS%20retrog_hold%20suicide%20at%2012s.sfs\u0022 rel=\u0022external nofollow\u0022\u003Emoho landing save game\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe savegame name should tell you all you need to know to land at exactly the right spot. It gives you a couple of hundred metres altitude to get used to the lander (basically, empty as it is, you\u0027ll accelerate with 1 thrust increment and slow with 2...). Then just lift the landing gear, turn and drive to the mining craft (head for the end with the big thermal thingy sticking straight up). Approach at less than 2m/s and it should be done. I personally leave SAS and RCS on while driving since I have the driving keys mapped to the number pad.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-04-22T21:54:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222531249\u0022 data-ipsquote-contentid=\u0022137645\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461347735\u0022 data-ipsquote-userid=\u0022153264\u0022 data-ipsquote-username=\u0022Plusck\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Plusck said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHowever, it really doesn\u0027t have to be hard.\n\u003C/p\u003E\n\u003Cp\u003E\nTo demonstrate, I made a savegame especially for you: killed off all my ships and crew, squandered my money, wrecked KSC, and left just this poor soul trying to get fueled up: \u003Ca href=\u0022http://www.surrendermonkeys.fr/public/KSPSaves/moho%20landing%20-%20RCS%20retrog_hold%20suicide%20at%2012s.sfs\u0022 rel=\u0022external nofollow\u0022\u003Emoho landing save game\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe savegame name should tell you all you need to know to land at exactly the right spot. It gives you a couple of hundred metres altitude to get used to the lander (basically, empty as it is, you\u0027ll accelerate with 1 thrust increment and slow with 2...). Then just lift the landing gear, turn and drive to the mining craft (head for the end with the big thermal thingy sticking straight up). Approach at less than 2m/s and it should be done. I personally leave SAS and RCS on while driving since I have the driving keys mapped to the number pad.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThank you, I really appreciate your taking the trouble (and hopefully your link can help other folks).  However, even without looking at it (which I can\u0027t at the moment, not being in front of my KSP machine), I can tell you that it\u0027s a complete non-starter for me.\n\u003C/p\u003E\n\u003Cp\u003E\nFor one thing, you lost me the moment you said \u0022wheels\u0022.  I do not want wheels on my base.  Period, full stop.  Wheels are for rovers.  Bases are \u003Cem\u003E\u003Cu\u003Ebuildings\u003C/u\u003E\u003C/em\u003E.  If I have to have #*(\u0026amp;#% \u003Cem\u003E\u003Cu\u003Ewheels\u003C/u\u003E\u003C/em\u003E sticking out from every component of my otherwise reasonable-looking base, it\u0027s going to be like sandpaper on my soul.  I just can\u0027t stand it.  Every time I look at those silly useless things sticking out of a structure that does not need them or want them, and that only slapped \u0027em on there because of a regrettable hole in the game that forces me to use them because it\u0027s the only tool at my disposal, I\u0027ll cringe and feel a little surge of resentment rage.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not saying it\u0027s rational, I\u0027m saying I \u003Cem\u003E\u003Cu\u003Ehate it\u003C/u\u003E\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIn addition to which:  There is no stock put-things-on-wheels solution that I would find acceptable, even if I didn\u0027t aesthetically object to wheels poking out of my buildings.  I\u0027ve \u003Cem\u003E\u003Cu\u003Edone\u003C/u\u003E\u003C/em\u003E this.  I do appreciate your taking the effort, but trust me that when I say \u0022it\u0027s horrible,\u0022 it\u0027s not because I \u003Cu\u003E\u003Cem\u003Edon\u0027t know how\u003C/em\u003E\u003C/u\u003E to do it, it\u0027s because I \u003Cem\u003E\u003Cu\u003Ehate it\u003C/u\u003E\u003C/em\u003E.  Different things bug different people in KSP.  \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s too fiddly.  There\u0027s \u003Cem\u003E\u003Cu\u003Ealways\u003C/u\u003E\u003C/em\u003E backing-and-filling to get the damn docking ports lined up right, and multiple tries required, and half the time something doesn\u0027t work anyway because there\u0027s a bit of bumpiness to the terrain and it doesn\u0027t work so now you have to go and hunt up a different location that\u0027s smoother so they will align properly, and even if you do that and you successfully hook up your first three base components, now you come along with your 4th component and the ground\u0027s too bumpy for that so you have to disassemble your \u003Cem\u003E\u003Cu\u003Ewhole damn base\u003C/u\u003E\u003C/em\u003E and try to drive it somewhere that all the components can hook up...\n\u003C/p\u003E\n\u003Cp\u003E\nUh-uh.  Nope.  Not gonna go there.  Do not want.\n\u003C/p\u003E\n\u003Cp\u003E\nIf the technique works for you, great!  I know from reading the forums that it works for other folks, too.  However it has never, does not now, and will never work for \u003Cu\u003E\u003Cem\u003Eme\u003C/em\u003E\u003C/u\u003E.  Ever.  So if I didn\u0027t have KAS to work with, I\u0027d probably just abandon planetary bases entirely as not worth the annoyance.\n\u003C/p\u003E\n\u003Cp\u003E\nBut that\u0027s just me.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Hopefully your technique may work for other folks, who have different play styles, frustration tolerance levels, or hot-button issues than I do!\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-22T22:24:20Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222531893\u0022 data-ipsquote-contentid=\u0022137645\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461362084\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThank you, I really appreciate your taking the trouble (and hopefully your link can help other folks).  However, even without looking at it (which I can\u0027t at the moment, not being in front of my KSP machine), I can tell you that it\u0027s a complete non-starter for me.\n\u003C/p\u003E\n\u003Cp\u003E\nFor one thing, you lost me the moment you said \u0022wheels\u0022.  I do not want wheels on my base.  Period, full stop.  Wheels are for rovers.  Bases are \u003Cem\u003E\u003Cu\u003Ebuildings\u003C/u\u003E\u003C/em\u003E. \n\u003C/p\u003E\n\u003Cp\u003E\n[...]\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s too fiddly.  There\u0027s \u003Cem\u003E\u003Cu\u003Ealways\u003C/u\u003E\u003C/em\u003E backing-and-filling to get the damn docking ports lined up right, and multiple tries required, and half the time something doesn\u0027t work anyway because there\u0027s a bit of bumpiness to the terrain and it doesn\u0027t work so now you have to go and hunt up a different location that\u0027s smoother so they will align properly, [...]\n\u003C/p\u003E\n\u003Cp\u003E\nUh-uh.  Nope.  Not gonna go there.  Do not want.\n\u003C/p\u003E\n\u003Cp\u003E\n[...]\n\u003C/p\u003E\n\u003Cp\u003E\nBut that\u0027s just me.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E  Hopefully your technique may work for other folks, who have different play styles, frustration tolerance levels, or hot-button issues than I do!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n(I snipped the quote a bit just for convenience)\n\u003C/p\u003E\n\u003Cp\u003E\nOK, I get it, you hate wheels on anything but rovers.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever (and I do appreciate your acknowledgement that this is not rational), why don\u0027t you hate having \u003Cu\u003E\u003Cem\u003Elanding legs\u003C/em\u003E\u003C/u\u003E on bases too? Perhaps because it\u0027s easier to pretend that they\u0027re fixed jacks used to stabilise the base... but then mobile homes have wheels and jacks, and while you might understandably hate \u003Cem\u003E\u003Cu\u003Ethem\u003C/u\u003E\u003C/em\u003E, they do form the closest analogy to the sort of thing we\u0027d need to have if we started trying to drop numerous modules onto a distant planet or moon. And yes, it will necessarily be fiddly.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the stock game provides huge wheels which seem to have the express purpose of supporting massive constructions... like bases. Though I don\u0027t actually use them.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, the thing I gave you to land is a \u003Cem\u003E\u003Cu\u003Elander\u003C/u\u003E\u003C/em\u003E and \u003Cem\u003E\u003Cu\u003Efuel carrier\u003C/u\u003E\u003C/em\u003E. It is not intended to be the main part of a base, but something which can roll up to it and syphon off fluids. From a realism (or rather not-breaking-credulity) standpoint, it is perfectly logical. I doubt a real base would want people pointing large rockets anywhere near their fuel stockpiles, so wheels would be a must for that role anyway. So it\u0027s a temporary attachment to the centre of the base. Wheels are a natural fit for this purpose.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd the other point about that lander is that it is simple to build, once you\u0027ve done it once, and does not require numerous attempts to connect just as long as you approach straight on, which is not too difficult to do. That was one of the main points about providing that savegame: to demonstrate that \u003Cem\u003Eit does not have to be fiddly\u003C/em\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd that \u0022doing it once\u0022 was also relatively simple. I\u0027ve spent far more time just trying to build something to land and take off from Eve.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, if you \u003Cem\u003E\u003Cu\u003Edo\u003C/u\u003E\u003C/em\u003E want to get fiddly (and \u0022you\u0022 in this context certainly cannot refer to you personally, I know), that lander also provides that possibility: the wheels can come off, once attached, as long as the tanks aren\u0027t full. Decouple the docking port and they roll out from under the body of the lander. If you want to build a huge base on legs alone, just put a docking port under a central 2.5m part and you can use the wheels waiting on the surface. That, of course, is very fiddly but again, this is probably what we\u0027d need to do for anything other than huge bases - and they will probably be cut directly out of the rock.\n\u003C/p\u003E\n"},{"CreatedByName":"flatbear","CreatedById":143398,"CreatedDateTime":"2016-04-23T02:29:03Z","Content":"\n\u003Cp\u003E\non a side note, is there an easy way cheat mate/dock parts of a mun base? I forgot some of my rcs thrusters that I put on my other mun base parts and now its really hard to get this last part to mate to the rest of the base.  Thanks.  (usually I try and use low thrust to hover and then use rcs to dock but I dont have enough rcs thrusters here D:) (please forgive the use of mechjeb)\u003Cimg alt=\u0022sFkt10W.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/sFkt10W.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-23T02:35:22Z\u0022 title=\u002204/23/2016 02:35  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 23, 2016\u003C/time\u003E by flatbear\u003C/strong\u003E\n\u003C/span\u003E\n"}]}