{"TopicId":138065,"ForumId":16,"TopicTitle":"Docking concepts in the game tutorial","CreatedByName":"Crystal_Mace","CreatedById":149414,"CreatedDateTime":"2016-04-25T05:48:41Z","PageNum":1,"Articles":[{"CreatedByName":"Crystal_Mace","CreatedById":149414,"CreatedDateTime":"2016-04-25T05:48:41Z","Content":"\n\u003Cp\u003E\nI\u0027m currently working my way through the docking tutorial and I have some questions. I\u0027m not approaching it wringing my hands and begging someone to help me feel better about myself....I get that docking is one of the most difficult procedures to grasp at first. Instead I\u0027m trying to pull the tutorial apart so I understand what\u0027s actually going on.\u003Cbr\u003E\u003Cbr\u003E\n1. Getting to a coplanar orbit: Gene says target the stranded vehicle (no questions there) then set up a maneuver node on the ascending or descending node pulling the magenta handles to project a coplanar orbit for me (Val in the rescue vehicle.) \u003Cbr\u003E\na. Why does the rate of change in degrees vary so much?\u003Cbr\u003E\nb. Why is it often impossible to zero out the degrees without moving the maneuver node?\u003Cbr\u003E\nc. Why does the zeroed out coplanar orbit often change after the maneuver is complete and I remove the node?\u003Cbr\u003E\nd. What level of accuracy do I need to achieve, plus or minus 0.1 degrees, or dead on?\u003Cbr\u003E\u003Cbr\u003E\n2. Achieving intersecting orbit within 5 kms: set a maneuver node that gets me within 5 kms of the stranded vehicle by accelerating prograde;\u003Cbr\u003E\na. What do the two color intersect markers actually indicate and why are there two of them? Is it where the two vehicles actually meet in orbit? \u003Cbr\u003E\nb. What is the relationship of their movement to the position of the node and why do the figures and positions jump round so much? Note that I often feel like even using some sort of hyper-acurate measuring device my margin of error is often between 4,6 kms, and 2043 kms. Am I also racing the actual change in the positions of the two craft in the time it takes to position the node and change the prograde vector? When a tiny change of position causes one of the two dotted lines to jump to the other side of the orbit or disappear altogether....what has just happened?\u003Cbr\u003E\nc. Why does moving the node or the prograde vector seem to take separation in one direction...then suddenly the other with no apparent rhyme or reason, and why is the rate of change in either direction not even close to constant?\u003Cbr\u003E\nd. When conducting maneuver nodes in docking, do I use the pink target mode Icon or the blue maneuver node icon?  Is it both?  If so when do you use them?\u003Cbr\u003E\u003Cbr\u003E\nThis is as far as I\u0027ve gotten in the tutorial. Conducting the actual docking should be no worse than maneuvering a Kerbal back to the airlock after a spacewalk compared to making sense out of setting myself into position with maneuver nodes. I\u0027ve done that from being out of visible sight of the ship...it\u0027s all a matter of flying towards the positional reference on the screen and not panicking before I get there. Or is there something I don\u0027t know yet...?\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Space Program General Discussions\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-25T06:27:02Z\u0022 title=\u002204/25/2016 06:27  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 25, 2016\u003C/time\u003E by Crystal_Mace\u003C/strong\u003E\n\u003Cbr\u003ELeft out an imporant quuestion.\n\u003C/span\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-04-25T06:48:51Z","Content":"\n\u003Cp\u003E\n1. You don\u0027t have to zero it out. If you don\u0027t get it exactly on the AN/DN crossover, it will make less of a difference to the angle, but may make it easier to get AN/DN to occur where you are going to meet the other ship, which is the most crucial thing in fact.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, one thing that is new-ish in 1.1 is that if you are not in warp, subtle changes to maneuvre nodes can make significant changes since the \u0022in physics\u0022 part of the code calculates your orbit constantly. If you have enough time, in-game, do all your precise node changes on the lowest warp setting.\n\u003C/p\u003E\n\u003Cp\u003E\nI say new-ish because the same thing happened before, but it wasn\u0027t anywhere near as noticeable.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for it changing after doing the burn - because burns can never be 100% precise. And because you have probably now passed onto a new orbit for the calculations.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the intersect and AN/DN figures are given as the result of your set maneuvre node. If there is any difference between what was planned and what you actually did, it will appear as soon as you delete the node.\n\u003C/p\u003E\n\u003Cp\u003E\n2. The two chevrons indicate: Firstly, where your ship is when the paths cross at the closest point. Secondly, where the other ship will be when you are at that location. If your orbit crosses the other one twice, then the first one will be orange, and the second purple.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:12px;\u0022\u003ETip: If you have difficulty seeing where you\u0027ll be later, just drop another node a little later, leave it at 0 m/s, and go back to the \u0022real\u0022 node you are trying to set. This way, you will only see the intersects which occur \u003Cem\u003Eafter\u003C/em\u003E that second node. This probably won\u0027t help for the tutorial though...\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nFor 2b) - see the second paragraph above, unfortunately...  [edit: actually not necessarily - you could be just grazing the other orbit at one point, and the slightest change causes that \u0022graze\u0022 to travel all the way around the orbit. Imagine an extremely long pair of scissors: the slightest movement will make the point of contact race along the blade. \u003Cspan style=\u0022font-size:12px;\u0022\u003EIncidentally, some have tried to use that analogy to suggest a way of passing information at infinite speeds... which couldn\u0027t happen but it does at least illustrate how a minor variation can radically change the intersect point\u003C/span\u003E]\n\u003C/p\u003E\n\u003Cp\u003E\nFor 2c) - when you get a close approach, the game can decide that actually another point on the orbit is closer. Again, this is probably due to the same thing as 2b...\n\u003C/p\u003E\n\u003Cp\u003E\nFor 2d) - not quite sure what you mean. Once you are very close, maneuvre nodes are pointless because \u0022pushing the marble\u0022 (pushing the target\u0027s yellow retrograde marker over the pink anti-target cross, by pointing on the other side of the yellow and gently firing the engines) does exactly what you would be trying to set up as a maneuvre node. The trouble is that you can\u0027t do this at a distance because your rate of approach and direction of approach will move as you move around the orbit. And once you are very very close you turn around and use RCS.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I can suggest anything - learn to use HN IJKL for RCS translation. It helps to train the right hand to do this while the left continues to use WASD for rotation.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately I haven\u0027t had time to look at the tutorials yet, so I hope nothing above has \u003Cem\u003Eadded\u003C/em\u003E any confusion...\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-25T07:06:03Z\u0022 title=\u002204/25/2016 07:06  AM\u0022 data-short=\u00228 yr\u0022\u003EApril 25, 2016\u003C/time\u003E by Plusck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tg626","CreatedById":112361,"CreatedDateTime":"2016-04-25T06:55:08Z","Content":"\n\u003Cp\u003E\nImportant point for accuracy of burn.  If the set burn time is 30 seconds, you want to start the burn at -15 seconds to yhe maneuver node.  You want the burn time \u0022centered\u0022 on the node.  If you wait until zero, your result will be off.\n\u003C/p\u003E\n\u003Cp\u003E\nStill, there will be some inaccuracies.\n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-04-25T09:42:16Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222538001\u0022 data-ipsquote-contentid=\u0022138065\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461563321\u0022 data-ipsquote-userid=\u0022149414\u0022 data-ipsquote-username=\u0022Crystal_Mace\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Crystal_Mace said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n1. Getting to a coplanar orbit: Gene says target the stranded vehicle (no questions there) then set up a maneuver node on the ascending or descending node pulling the magenta handles to project a coplanar orbit for me (Val in the rescue vehicle.)\n\u003C/p\u003E\n\u003Cp\u003E\nb. Why is it often impossible to zero out the degrees without moving the maneuver node?\u003Cbr\u003E\nd. What level of accuracy do I need to achieve, plus or minus 0.1 degrees, or dead on?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFor b. the problem is that if you don\u0027t do the maneuver EXACTLY at the AN/DN, then the position of that node will start to move.  And the closer you get to 0, the more precise you have to be with that.  If you end up pushing that node too far away, then you won\u0027t be able to zero it out without moving your burn to where the node is now.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for d. that depends.  In theory, you can still intercept your target with an inclination of 90 degrees.  You\u0027ll ONLY be able to do so exactly at the AN/DN though and even if you do get a close approach, you\u0027ll have a huge velocity difference that you\u0027d need to cancel out in order to STAY close to them long enough to do anything useful.  The lower the difference in inclination is, the wider a range is for where you\u0027ll be able to get a close approach to your target and the smaller your velocity difference will be when you do get there.  In order to actually dock, you\u0027re going to have to cancel that difference out entirely at some point anyway, so might as well get it as close to 0 as possible right from the start.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222538001\u0022 data-ipsquote-contentid=\u0022138065\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461563321\u0022 data-ipsquote-userid=\u0022149414\u0022 data-ipsquote-username=\u0022Crystal_Mace\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, Crystal_Mace said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nc. Why does moving the node or the prograde vector seem to take separation in one direction...then suddenly the other with no apparent rhyme or reason, and why is the rate of change in either direction not even close to constant?\u003Cbr\u003E\nd. When conducting maneuver nodes in docking, do I use the pink target mode Icon or the blue maneuver node icon?  Is it both?  If so when do you use them?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nc.  Burning your engines changes the shape of your entire orbit, especially the point directly opposite where you are burning from.  If you start out fairly close to the target and just burn straight towards it, at first, it might move you closer to it, but it\u0027s also causing your overall orbital path to diverge further away, so at some point that effect will make your separation increase.\n\u003C/p\u003E\n\u003Cp\u003E\nd.  For getting the initial encounter, just use the maneuver nodes(or don\u0027t even bother with maneuver nodes at all and use normal/antinormal to zero out the inclination and then you only need prograde and retrograde from there on).  Once you\u0027re on final approach(within a couple km), switch to target mode and watch the prograde/retrograde and target/antitarget markers.  You want to get and keep those markers aligned with each other as closely as possible.  To do this, burn slightly off to one side from the prograde or retrograde markers.  This will \u0022push\u0022 the retrograde marker away from the direction you\u0027re burning or \u0022pull\u0022 the prograde marker towards it.  Then when you get in very close and have your velocity almost matched as well, switch to RCS and use that to maintain alignment.  Gradually reduce your approach velocity as you get closer.  By the time you\u0027re within 10m or so, you\u0027ll probably want to be going as slow as 0.1 m/s.\n\u003C/p\u003E\n"},{"CreatedByName":"Wemb","CreatedById":121979,"CreatedDateTime":"2016-04-25T11:25:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222538001\u0022 data-ipsquote-contentid=\u0022138065\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461563321\u0022 data-ipsquote-userid=\u0022149414\u0022 data-ipsquote-username=\u0022Crystal_Mace\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Crystal_Mace said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n2. Achieving intersecting orbit within 5 kms: set a maneuver node that gets me within 5 kms of the stranded vehicle by accelerating prograde;\u003Cbr\u003E\na. What do the two color intersect markers actually indicate and why are there two of them? Is it where the two vehicles actually meet in orbit? \u003Cbr\u003E\nb. What is the relationship of their movement to the position of the node and why do the figures and positions jump round so much? Note that I often feel like even using some sort of hyper-acurate measuring device my margin of error is often between 4,6 kms, and 2043 kms. Am I also racing the actual change in the positions of the two craft in the time it takes to position the node and change the prograde vector? When a tiny change of position causes one of the two dotted lines to jump to the other side of the orbit or disappear altogether....what has just happened?\u003Cbr\u003E\nc. Why does moving the node or the prograde vector seem to take separation in one direction...then suddenly the other with no apparent rhyme or reason, and why is the rate of change in either direction not even close to constant?\u003Cbr\u003E\nd. When conducting maneuver nodes in docking, do I use the pink target mode Icon or the blue maneuver node icon?  Is it both?  If so when do you use them?\u003Cbr\u003E\u003Cbr\u003E\nThis is as far as I\u0027ve gotten in the tutorial. Conducting the actual docking should be no worse than maneuvering a Kerbal back to the airlock after a spacewalk compared to making sense out of setting myself into position with maneuver nodes. I\u0027ve done that from being out of visible sight of the ship...it\u0027s all a matter of flying towards the positional reference on the screen and not panicking before I get there. Or is there something I don\u0027t know yet...?\n\u003C/p\u003E\n\u003Cp\u003E\nKerbal Space Program General Discussions\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWow, okay, I think the answer to all of your points in 2 can generally be summed up with the words \u0027because they\u0027re curves not straight lines\u0027. Two curves crossing each other will have two points of intersection, hence two pairs of intercept markers. They move around so much because when you burn in a straight line by a constant amount, the resulting changes in the intersection of the two curves will chang in a non-linear way. This also answers point \u0027c\u0027. \n\u003C/p\u003E\n\u003Cp\u003E\nFor \u0027d\u0027 - use the manoeuvre node marker when you want to execute a manoeuvre.  The pink target marker is just the direction your target is in - and does not automatically have any particular relevance to whatever manoeuvre you\u0027re trying to do.\n\u003C/p\u003E\n\u003Cp\u003E\nIn short, it\u0027s very hard to describe exactly what any particular manoeuvre will do to an intercept without a computer - your best bet, till it becomes more intuitive, is to set a manoeuvre a considerable time away to give you the space needed to fiddle and tweak the node till your resultant intercept is as close as possible. Do not expect to see a linear relationship between changes in the nodes and the effect on the intercept - you won\u0027t. Small changes and tweaks and using the Mk1 eyeball is the way to go. Eventually you\u0027ll stumble upon a nice, close intercept. \n\u003C/p\u003E\n\u003Cp\u003E\nOnce you\u0027ve got it a good intercept, just wait till your vessel gets to that point in space, then forget about manoeuvre nodes and intercepts - just get into target mode, zero your relative velocity. Then you\u0027ve achieved your rendezvous and you can begin the process of a close approach for docking.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck, and remember, not even the crew of Gemini IV got this s*** right the first time - took Dr Buzz Aldrin to write the book (literally) on rendezvous  before NASA got it done.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EWemb\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-04-25T18:15:24Z\u0022 title=\u002204/25/2016 06:15  PM\u0022 data-short=\u00228 yr\u0022\u003EApril 25, 2016\u003C/time\u003E by Wemb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Crystal_Mace","CreatedById":149414,"CreatedDateTime":"2016-04-25T18:19:06Z","Content":"\n\u003Cp\u003E\nPlusck, tg626,Hodari, Wemb,  thank you muchly!   I had no idea there was so much actually applicable knowledge out there let alone explainable!  My trouble in learning  to do anything is I can\u0027t just be pointed at a complicated  task with inexplicable procedures and told to do it....  I have to understand what I\u0027m trying to do, what those inexplicable things are in relation to the task, what\u0027s going to happen when I do them.  I often think ruefully of math and science professors I\u0027ve had who were smart enough to get a tenured position at a university, but couldn\u0027t (or wouldn\u0027t) explain their fields to me at all.  Their response to questions was \u0022Read your text book.  It\u0027s all there\u0022.  Perhaps, but as I know from experience, the ability to read a book, and the ability to solve a differential equation are two different things.  A lot of the time the fastest way to get me lost on a road trip is to hand me the map.  But tell me what we\u0027re looking for, and I\u0027ll find it.  Eventually.  \u0026lt;g\u0026gt;\n\u003C/p\u003E\n"},{"CreatedByName":"Wemb","CreatedById":121979,"CreatedDateTime":"2016-04-25T18:57:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222539186\u0022 data-ipsquote-contentid=\u0022138065\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461608346\u0022 data-ipsquote-userid=\u0022149414\u0022 data-ipsquote-username=\u0022Crystal_Mace\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n37 minutes ago, Crystal_Mace said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nPlusck, tg626,Hodari, Wemb,  thank you muchly!   I had no idea there was so much actually applicable knowledge out there let alone explainable!  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, well, it\u0027s not exactly rocket science, is it? Ah, no, wait...\n\u003C/p\u003E\n\u003Cp\u003E\nWemb\n\u003C/p\u003E\n"},{"CreatedByName":"Crystal_Mace","CreatedById":149414,"CreatedDateTime":"2016-04-27T04:26:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222539305\u0022 data-ipsquote-contentid=\u0022138065\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221461610628\u0022 data-ipsquote-userid=\u0022121979\u0022 data-ipsquote-username=\u0022Wemb\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 4/25/2016 at 11:57 AM, Wemb said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYeah, well, it\u0027s not exactly rocket science, is it? Ah, no, wait...\n\u003C/p\u003E\n\u003Cp\u003E\nWemb\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWell it sort of is......sort of.......\n\u003C/p\u003E\n\u003Cp\u003E\nAs it turns out there IS something I didn\u0027t know  as to docking being different from getting back on board  from EVA, and I could have anticipated it if I\u0027d remembered my elementary physics.  The effect of a Kerbal reboarding in terms of their mass compared to the vehicle is such that their effect on the craft is negligible  Two vehicles are similar enough to have a catastrophic effect on each other colliding, or if one or the other needs to be redirected to achieve successful docking the energy needed must be VERY efficiently applied in hyper-precise vectoring.. I\u0027m learning to appreciate what a formidable task Aldrin had calculating how it had to be done for Geminii to pave the way for Apollo and beyond.\n\u003C/p\u003E\n"},{"CreatedByName":"Wemb","CreatedById":121979,"CreatedDateTime":"2016-04-27T16:32:35Z","Content":"\n\u003Cp\u003E\nHow you dock is dependant on how you fly your ship, of course, but as much as that is dependant on your skill, it\u0027s arguably just as dependant on your design - have a ship where the CoM doesn\u0027t lie on the CoT, and you\u0027re in trouble. Equally putting the RCS thruster blocks in poorly chosen places can also be disastrous when docking. One thing which will help you is to ensure you have \u0027Fine Control\u0027 (Caps Lock) turned on - this balances the thrust levels on your RCS to ensure you rotations don\u0027t turn into translations and visa-versa if your CoM isn\u0027t exactly at the center of your CoT from the RCS system.  Also Docking Port Alignment Indicator mod is a must-have for me.\n\u003C/p\u003E\n\u003Cp\u003E\nWemb\n\u003C/p\u003E\n"}]}