{"TopicId":138728,"ForumId":16,"TopicTitle":"Mun Landing","CreatedByName":"TheGuyNamedAlan","CreatedById":162058,"CreatedDateTime":"2016-05-02T07:06:18Z","PageNum":1,"Articles":[{"CreatedByName":"TheGuyNamedAlan","CreatedById":162058,"CreatedDateTime":"2016-05-02T07:06:18Z","Content":"\n\u003Cp\u003E\ndear all\n\u003C/p\u003E\n\u003Cp\u003E\ni always have a problem landing on mun. i keep on coming down too fast as i cannot slow down. i find landing at mun very difficult as i keep on coming in at 50 m/s each time. also i am doing career mode so i will have a very small amount of fuel left when i reach mun orbit\n\u003C/p\u003E\n\u003Cp\u003E\nplz help me, thx\n\u003C/p\u003E\n"},{"CreatedByName":"N_Molson","CreatedById":63688,"CreatedDateTime":"2016-05-02T07:11:16Z","Content":"\n\u003Cp\u003E\nIts a bit hard to say with so little information but those two principles can never hurt :\n\u003C/p\u003E\n\u003Cp\u003E\n- Maximize the fuel / empty mass ratio of your lander.\u003Cbr\u003E\n- Have an engine powerful enough to slow you down. Or add MOAR small ones.\n\u003C/p\u003E\n\u003Cp\u003E\nHere\u0027s how they did it in Apollo 11 (in imperial units, of course) :\u003Cbr\u003E\u003Cbr\u003E\u003Cimg alt=\u0022LM-descent.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://www.braeunig.us/apollo/pics/LM-descent.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"TheGuyNamedAlan","CreatedById":162058,"CreatedDateTime":"2016-05-02T07:25:14Z","Content":"\n\u003Cp\u003E\nthx but i can\u0027t slow down!!\n\u003C/p\u003E\n\u003Cp\u003E\ni think it\u0027s way too heavy\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-02T07:25:49Z\u0022 title=\u002205/02/2016 07:25  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 2, 2016\u003C/time\u003E by TheGuyNamedAlan\u003C/strong\u003E\n\u003Cbr\u003Emistake\n\u003C/span\u003E\n"},{"CreatedByName":"marcello639","CreatedById":144435,"CreatedDateTime":"2016-05-02T07:30:35Z","Content":"\n\u003Cp\u003E\nVery useful tool is kerbal engineer (only mod I use myself) it will help to build much more efficiently. \n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow","CreatedById":65767,"CreatedDateTime":"2016-05-02T10:23:40Z","Content":"\n\u003Cp\u003E\nBest way to slow down, even in an underpowered craft, is to set your periapsis at about 5000m rather than all the way down to the surface.  As you approach periapsis, face retrograde and burn to slow down.  If you keep your heading marker just above the retrograde marker, you should be able to keep your rate of decent nice and low.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2016-05-02T10:57:14Z","Content":"\n\u003Cp\u003E\nOne thing, make sure you\u0027re in \u0022Surface\u0022 mode and not \u0022Orbit\u0022 mode on your navball. If it says \u0022orbit\u0022 in green at the top of the navball, click that text until it says \u0022surface.\u0022 Assuming you have that set:\n\u003C/p\u003E\n\u003Cp\u003E\nIf you cannot slow your craft by 50m/s in a few (less than 5) seconds, you need more engines. At least, until you\u0027re more comfortable landing. \u0022More engines\u0022 here could also be \u0022Less stuff to push around.\u0022 I know you want 3 Kerbals and all the science, plus that rover on the Mun, but for your first landing you should stick to a mk1 pod, parachute, decoupler, fuel tank(s), and engine. And probably landing gear \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAs you\u0027re coming down, you should only be burning retrograde, or offset to retrograde so as to push retrograde (in SURFACE mode!) to the very center of the navball. Then, you only have to worry about going slowly. Don\u0027t let yourself fall too fast (but don\u0027t burn up all your fuel hovering) and as you get close (land near sunrise or sunset so you can see a nice shadow on the ground as you get close) make sure you\u0027re going less than 7 m/s.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd practice. Practice practice practice. This is a skill you are learning, not an achievement you\u0027re earning.\n\u003C/p\u003E\n"},{"CreatedByName":"Jhawk1099","CreatedById":156674,"CreatedDateTime":"2016-05-02T16:34:37Z","Content":"\n\u003Cp\u003E\nAs a first timer a good setup is a mk1 command pod with a flt-400 fuel tank and a terrier engine. Of course you\u0027d want landing gear solar panels and batteries and other logistical things. If you are using any mods that give you delta-v readouts try to have around 7,900. This is a lot more than you need but extra fuel is always good. And I feel your pain, my first mun landing was on a canyon wall and Jeb got stranded... as did the rescue craft... and that craft. But now I can land some pretty insane things on the mun and bring them back if I want. Just keep trying and you\u0027ll get it soon.\n\u003C/p\u003E\n"},{"CreatedByName":"suicidejunkie","CreatedById":155878,"CreatedDateTime":"2016-05-02T17:19:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222554929\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462173914\u0022 data-ipsquote-userid=\u0022162058\u0022 data-ipsquote-username=\u0022TheGuyNamedAlan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, TheGuyNamedAlan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthx but i can\u0027t slow down!!\n\u003C/p\u003E\n\u003Cp\u003E\ni think it\u0027s way too heavy\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe Apollo picture sort of shows it, but the scaling isn\u0027t really the best.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is easiest if you come in horizontally.  As noted above, set your PE to about a kilometer above the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nThen burn retrograde at PE.  I suggest setting a maneuver node at PE, and drag retrograde until it shows a full stop and drop.  Start your actual burn at T-{half the burn time}.\n\u003C/p\u003E\n\u003Cp\u003E\nTip the nose slightly above retrograde to keep your vertical speed near zero, and you will have all the time in the world to slow down because you are not descending (avoid targeting your landing just short of a mountain of course).\n\u003C/p\u003E\n\u003Cp\u003E\nAfter you kill your ~500m/s orbital velocity that way, you\u0027ll be hovering just above the surface (at the old PE altitude) and can gently set \u0027er down. \n\u003C/p\u003E\n\u003Cp\u003E\nUse the IVA view to keep an eye on the radar altimeter to see how close the surface is. \n\u003C/p\u003E\n\u003Cp\u003E\nYou need to descend quickly to save fuel, but you also need to be able to stop at the end, so pick some safety limits, and adjust based on fuel levels and the Jeb-itude of your pilot: Try allowing a descent rate of 75-100 when the radar alt is pegged, drop to 50m/s when above 1000m, bring it down to 25 above 500m, then drop to 10m/s for the last 100m and puff it down to near zero at touchdown.\n\u003C/p\u003E\n\u003Cp\u003E\nNote how the time to impact remains somewhat constant at all altitudes under that scheme \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWhen you get more experience, you can blend that last step into the retrograde burn, and pull off a nice time-reversed gravity turn.\n\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow","CreatedById":65767,"CreatedDateTime":"2016-05-02T17:35:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222555931\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462209591\u0022 data-ipsquote-userid=\u0022155878\u0022 data-ipsquote-username=\u0022suicidejunkie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n13 minutes ago, suicidejunkie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n  As noted above, set your PE to about a kilometer above the surface.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe problem with setting your PE as low as 1km is that you run the very real risk of running in to a mountain.  Some of the terrain on Mun is 5 or 6km high, so even setting it at 5km carries a small risk of hitting something.\n\u003C/p\u003E\n"},{"CreatedByName":"suicidejunkie","CreatedById":155878,"CreatedDateTime":"2016-05-02T17:42:33Z","Content":"\n\u003Cp\u003E\nYes; it is good to note that \u00271km above terrain\u0027 often means 4km PE above \u0027sea level\u0027.  Preferably the orbit line should not intersect any terrain while putting the PE as low as possible.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd definitely don\u0027t use mountains as backstops.\n\u003C/p\u003E\n"},{"CreatedByName":"NikkyD","CreatedById":97466,"CreatedDateTime":"2016-05-02T17:48:04Z","Content":"\n\u003Cp\u003E\nWhy so risky ? somewhere between 5 and 7 km is fine. Set SAS to retro, burn and throttle as you feel comfortable. I don\u0027t have good manual landing skills but this way i manage 800 dV landings. 900 if i realize that i will end up on the side of a mountain and need to carefully balance everything out with super soft touchdown.\n\u003C/p\u003E\n"},{"CreatedByName":"MaxL_1023","CreatedById":152317,"CreatedDateTime":"2016-05-02T17:48:05Z","Content":"\n\u003Cp\u003E\nWhat are you using for landing? You need at least 5 KN for every ton of lander to easily land on the mun - any less and you will have trouble slowing down fast enough as you bleed off horizontal velocity. \n\u003C/p\u003E\n\u003Cp\u003E\nA Lander can mk I, heatshield with ~50 ablator, , FTL-400\u002BTerrier, some batteries and solar panels \u002B science stuff should have enough delta-v to land from Mun orbit, take off, and return to Kerbin (you need about 2k to have a decent margin). \n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-05-02T18:28:01Z","Content":"\n\u003Cp\u003E\nHave you landed on Minmus?  It is vastly easier and lets you practice many of the steps needed for the Mun (just make sure you get your inclination changed before trying to plot a course for Minmus).  If you do have experience on Minmus, then you probably need more engines because you are trying something that works on Minmus (with next to no gravity) that doesn\u0027t work on the Mun (which definitely does have gravity).  If you are using spark engines swap them out for terriers (and higher ISPs as well).\n\u003C/p\u003E\n\u003Cp\u003E\nDo you have Kerbal Engineer/Flight Engineer installed?  It tells you surface elevation (the thing at the top is for \u0022sea level\u0022, which you will have a hard time finding on the Mun) and I\u0027d hate to have to look in the cockpit to figure that out.  Don\u0027t take the \u0022suicide burn\u0022 at face value: it doesn\u0027t seem to include sideways velocity.  You can use it if you want after killing your sideways velocity (4-8km up, as noted above), but no before.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd make sure you have enough fuel!  You will need nearly 1000m/s to get home (leaving a few hundred m/s in orbit is an option, but learning to dock is probably harder than learning to land on the moon without docking).\n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-05-02T18:33:29Z","Content":"\n\u003Cp\u003E\nI find it useful to think in terms of stages, and in reverse order.\n\u003C/p\u003E\n\u003Cp\u003E\nStart by designing a lander--something that is capable of getting from munar orbit down to the munar surface. To be on the safe side, I\u0027d say start with a single occupant lander can, an FL-T800 fuel tank (the largest Size 1 tank), whatever batteries and reaction wheels and lander legs you think are necessary (go ahead and include the small science instruments; they\u0027re lightweight), and an engine. To decide which engine, look at the current mass of your ship add a bit to account for the mass of the engine, multiply by the Mun\u0027s gravity (1.63), and make sure your engine has AT LEAST that much thrust in kN. I\u0027d go ahead and double it to be on the safe side.\n\u003C/p\u003E\n\u003Cp\u003E\nNow start thinking of your lander as the payload. Strap enough (detachable) tanks and engines to the bottom (or sides) to transfer that payload from Kerbin orbit to Mun orbit. Delta-v is the important thing here; 1200 m/s ought to be enough but you\u0027ll probably want more to leave a margin for error. Familiarize yourself with the Tsiolkovsky rocket equation so you can calculate it.\n\u003C/p\u003E\n\u003Cp\u003E\nNow think of THAT entire cluster (lander plus the transfer stage) as the payload, and put enough (detachable) tanks and engines underneath to launch it from the pad up to Kerbin orbit. Big ol\u0027 solid booster rockets are your friend here. Make sure the total thrust at launch will be AT LEAST ten times the total mass of the rocket, preferably a fair bit more than that.\n\u003C/p\u003E\n\u003Cp\u003E\nFollow these steps and you should be able to get to Mun with a lander that\u0027s able to land. (Getting home is another story... but don\u0027t worry, if you\u0027re not using any life support mods, Jeb can wait patiently until a rescue craft shows up.)\n\u003C/p\u003E\n"},{"CreatedByName":"KamenRiderzero1","CreatedById":158519,"CreatedDateTime":"2016-05-02T19:05:28Z","Content":"\n\u003Cp\u003E\nLanding on anything takes the same thing as it does to get to Carnegie Hall...\n\u003C/p\u003E\n\u003Cp\u003E\nThe N, Q or R train...  I mean Practice.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMuch like why NASA went with LOR and the Lunar Module, weight is your key issue.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI usuaaly get away with a Poodle and extra, radially tanks I drop off when I land.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002212717503_10206045297316430_9030087089953\u0022 src=\u0022https://scontent-lga3-1.xx.fbcdn.net/v/t1.0-9/12717503_10206045297316430_9030087089953387606_n.jpg?oh=0ac9b017f05d67ad9b19f1c1ad05fcdc\u0026amp;oe=57BA898E\u0022 style=\u0022width:838px;height:471px;\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002212734038_10206003708476735_3577729340298\u0022 src=\u0022https://scontent-lga3-1.xx.fbcdn.net/hphotos-xfp1/v/t1.0-9/12734038_10206003708476735_3577729340298905711_n.jpg?oh=6808831f5ecd26df0d8b94b90838d54b\u0026amp;oe=57B19529\u0022 style=\u0022width:838px;height:471px;\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Terwin","CreatedById":139655,"CreatedDateTime":"2016-05-02T19:51:10Z","Content":"\n\u003Cp\u003E\nI prefer burning to a near horizontal stop(usually keeping ~20m/s horizontal speed for drifting past uneven patches while I descend) at at least 8km(aka an orbit that never hits the surface) then using the KER readout to slow down to ~80m/s when my suicide burn read-out gets down to 200m, ~40m/s at a read-out of 100m, then ~5m/s or once I reach a suicide burn of 50m,  then eye-balling it and trying to keep it below 3m/s when I am close to touch-down.  Not the most fuel efficient, but it lets me land mostly where I want.\n\u003C/p\u003E\n\u003Cp\u003E\nI stop my horizontal velocity when KER says I have a reasonably flat surface to land on(usually \u0026lt; 10 degrees, less if I have a tall/narrow ship).\n\u003C/p\u003E\n\u003Cp\u003E\nI try not to land on the Mun without an acceleration of at least 2m/s/s(\u0026gt;1.25TWR, usually higher by the time I reach the surface), preferably 3m/s/s \u002B(\u0026gt; 1.8TWR, usually above 2 by the time I reach the surface)  \n\u003C/p\u003E\n"},{"CreatedByName":"AbacusWizard","CreatedById":116476,"CreatedDateTime":"2016-05-02T23:05:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222556212\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462215928\u0022 data-ipsquote-userid=\u0022158519\u0022 data-ipsquote-username=\u0022KamenRiderzero1\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, KamenRiderzero1 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI usuaaly get away with a Poodle and extra, radially tanks I drop off when I land.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHey, no littering! Keep Mun beautiful! \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tater","CreatedById":119411,"CreatedDateTime":"2016-05-02T23:14:18Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222554914\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462172778\u0022 data-ipsquote-userid=\u0022162058\u0022 data-ipsquote-username=\u0022TheGuyNamedAlan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, TheGuyNamedAlan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ni am doing career mode so i will have a very small amount of fuel left when i reach mun orbit\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nA couple things.  \n\u003C/p\u003E\n\u003Cp\u003E\nOne, a picture of the craft would be helpful.\n\u003C/p\u003E\n\u003Cp\u003E\nTwo, when you say you have a small amount of fuel left, do you mean before attempting landing? Again, a craft to see would help.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"KamenRiderzero1","CreatedById":158519,"CreatedDateTime":"2016-05-03T03:44:17Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/wkmUArvMEUs?feature=oembed\u0022 width=\u0022459\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI made this to try to help, but everything went about as good as you expect.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-05-03T03:46:47Z","Content":"\n\u003Cp\u003E\nThis question about how to play the game has been moved to Gameplay Questions. \n\u003C/p\u003E\n"},{"CreatedByName":"RizzoTheRat","CreatedById":123362,"CreatedDateTime":"2016-05-03T08:35:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222556929\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462230356\u0022 data-ipsquote-userid=\u0022116476\u0022 data-ipsquote-username=\u0022AbacusWizard\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n9 hours ago, AbacusWizard said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHey, no littering! Keep Mun beautiful! \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGlad it\u0027s not just me. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E My usual early game lander has a Mk1 capsule, tank and terrier on the centreline, and then 3 radial tanks with the landing gear on the tanks. The radials get me to the Mun and landed, the center needs enough fuel to take off and get me home, but I always make sure I get a few hundred meters above the surface before I jetison the radial tanks so they\u0027re destroyed rather than littering the surface \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-05-03T08:59:16Z","Content":"\n\u003Cp\u003E\nI looked through the answers and did found the most usefull trick to land safely (providing you have a reasonable TWR)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAfter deorbiting, set a node near the impact zone and pull the retrograde handle until it flips. This gives you a time to approximative impact in stock. \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHere is what I do for Mun\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nSet orbit to 30km (not the most efficient, but it\u0027s easier)\n\u003C/li\u003E\n\u003Cli\u003E\nDerobit about 40 to 60m/s\n\u003C/li\u003E\n\u003Cli\u003E\nSet the node as explained.\n\u003C/li\u003E\n\u003Cli\u003E\nIf the time is from 40 to 80s you have a easy TWR.\n\u003C/li\u003E\n\u003Cli\u003E\nSet you SAS to retrograde (ignore the manoeuvre node)\n\u003C/li\u003E\n\u003Cli\u003E\nSwitch to surface tracking\n\u003C/li\u003E\n\u003Cli\u003E\nYou should start burning when your time to node is equal to you burn time (you can start before if you want)\n\u003C/li\u003E\n\u003Cli\u003E\nStop burning when you speed is around 30m/s then the hard part begins...\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nFor the actual landing\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nTry to evaluate your altitude by searching for scatter or shadow. Spot light under the lander is also an asset.\n\u003C/li\u003E\n\u003Cli\u003E\nKeep your speed under control around 30m/s, be ready to slow hard if the ground is near you.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen your very near, slow down to 1 to 5m/s and try to land around 1m/s. Try not to overcompensate and rise, it\u0027s usually a panic moment you won\u0027t recover from if you\u0027re not easy with landing.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nJust yesterday, I used this technique to land at 200m from a Mun Arch\n\u003C/p\u003E\n\u003Cp\u003E\nI recommend adding Kerbal Engineer Redux mod (KER) which adds a lot of very useful informative data (especially altitude from terrain and TWR).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Mahnarch","CreatedById":114432,"CreatedDateTime":"2016-05-03T17:26:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222557909\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462265956\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n8 hours ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EAfter deorbiting, set a node near the impact zone and pull the retrograde handle until it flips. This gives you a time to approximative impact in stock. \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnd, here, I thought I was a genius for coming up with that. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been doing that for about a year.\n\u003C/p\u003E\n"},{"CreatedByName":"Warzouz","CreatedById":140055,"CreatedDateTime":"2016-05-03T18:52:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222558768\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462296390\u0022 data-ipsquote-userid=\u0022114432\u0022 data-ipsquote-username=\u0022Mahnarch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Mahnarch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAnd, here, I thought I was a genius for coming up with that. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been doing that for about a year.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI read it somewhere.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222557558\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462247057\u0022 data-ipsquote-userid=\u0022158519\u0022 data-ipsquote-username=\u0022KamenRiderzero1\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, KamenRiderzero1 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/wkmUArvMEUs?feature=oembed\u0022 width=\u0022459\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI made this to try to help, but everything went about as good as you expect.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou don\u0027t need that much RCS, you should remove all those rcs tanks, there is enough for docking into the landing can. Your lander can torque is powerful enough to recover. Also, you can reduce engine gimbal to 20%.\n\u003C/p\u003E\n"},{"CreatedByName":"KamenRiderzero1","CreatedById":158519,"CreatedDateTime":"2016-05-03T19:51:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222558966\u0022 data-ipsquote-contentid=\u0022138728\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221462301525\u0022 data-ipsquote-userid=\u0022140055\u0022 data-ipsquote-username=\u0022Warzouz\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n55 minutes ago, Warzouz said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou don\u0027t need that much RCS, you should remove all those rcs tanks, there is enough for docking into the landing can. Your lander can torque is powerful enough to recover. Also, you can reduce engine gimbal to 20%.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nActually, the can flew solo the whole way. I know I should have put the tanks on the cruise stage instead, but I just didn\u0027t feel like it.\n\u003C/p\u003E\n"}]}