{"TopicId":139291,"ForumId":16,"TopicTitle":"RT 2 - Circularise orbit without maneuver nodes","CreatedByName":"astrospud","CreatedById":36799,"CreatedDateTime":"2016-05-08T08:23:10Z","PageNum":1,"Articles":[{"CreatedByName":"astrospud","CreatedById":36799,"CreatedDateTime":"2016-05-08T08:23:10Z","Content":"\n\u003Cp\u003E\nHello all, I\u0027ve kinda come up against a wall when it comes to precisely setting up a Remotetech 2 network. \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s early on in Career Mode, and one of the juicy contracts is to set up a network with 4 sats, and another to Alt Map scan Kerbin (with network). I\u0027ve upgraded the VAB, tracking Station and Launch pad once and I would\u0027ve thought I would have access to node placement, but alas and alack, no. I\u0027ve had quite a few hours put into KSP over the years, and you\u0027d think I could successfully circularise and orbit from launch without using nodes. Nope. \n\u003C/p\u003E\n\u003Cp\u003E\nI have no idea what I\u0027m doing wrong. With node, I can time the burn to 1/2 the Dv burn duration either side of the burn and generally get it bang on the money. Without node placement, I\u0027d wait for Ap. and start my burn there. I look over at my engineer and it says my Apoapsis is holding (give or take), until my Periapsis starts climbing out of negative territory. Then my Ap. starts climbing rapidly. A life spoiled by access to nodes I guess. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve done searches for this, but all search results come up with no reference to Remotetech 2 and the need to remain in contact with ground station. The RT2 contact in question requires each satellite to have an eccentricity of no more than 0.04. How do I achieve this without nodes?\n\u003C/p\u003E\n\u003Cp\u003E\nBTW, here\u0027s a small list of mods I\u0027m running (don\u0027t laugh. There are some real crackers in that list I can\u0027t Kerbal without)...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nKSP: 1.1.2 (64bit) - Unity: 5.2.4f1 - OS: Windows 10  (10.0.0) 64bit\u003Cbr\u003E\nToolbar - 1.7.12\u003Cbr\u003E\nUSI Tools - 0.7.2.1\u003Cbr\u003E\nAmbient Light Adjustment - 2.5.6.3\u003Cbr\u003E\nChatterer - 0.9.8.1230\u003Cbr\u003E\nCommunity Resource Pack - 0.5.1.1\u003Cbr\u003E\nContract Configurator - 1.11.5\u003Cbr\u003E\nContract Pack: Anomaly Surveyor - 1.4.3\u003Cbr\u003E\nCC-CP-SCANSat - 0.6.0.1\u003Cbr\u003E\nContract Pack: Field Research - 1.1.7\u003Cbr\u003E\nContract Pack: Bases and Stations - 3.2.1.2\u003Cbr\u003E\nContract Pack: The K Files - 1.1.1.3\u003Cbr\u003E\nContract Pack: RemoteTech - 2.0.2\u003Cbr\u003E\nCrowd Sourced Science - 3.0.2\u003Cbr\u003E\nDMagic Orbital Science - 1.2.4\u003Cbr\u003E\nContract Parser - 1.0.3\u003Cbr\u003E\nContracts Window Plus - 1.0.6.3\u003Cbr\u003E\nProgress Parser - 1.0.4\u003Cbr\u003E\nEngine Lighting - 1.4.3\u003Cbr\u003E\nEVA Struts - 1.0.1\u003Cbr\u003E\nEVA Transfer - 1.0.4\u003Cbr\u003E\nFirespitter - 7.2.3\u003Cbr\u003E\nHeatControl - 0.3\u003Cbr\u003E\nInterstellar Fuel Switch - 2.0.1\u003Cbr\u003E\nRasterPropMonitor - 0.26\u003Cbr\u003E\nKAS - 0.5.7\u003Cbr\u003E\nKerbal Engineer Redux - 1.1.1\u003Cbr\u003E\nKerbal Joint Reinforcement - 3.1.7\u003Cbr\u003E\nKIS - 1.2.9\u003Cbr\u003E\nKSP-AVC Plugin - 1.1.6.1\u003Cbr\u003E\nKWRocketryRedux - 3.0.4\u003Cbr\u003E\nInfernal Robots - 2.0\u003Cbr\u003E\nModular Rocket Systems - 1.12.6\u003Cbr\u003E\nORIGAMI Antennas - 0.9.5\u003Cbr\u003E\nNearFuturePropulsion - 0.7\u003Cbr\u003E\nNearFutureSolar - 0.6\u003Cbr\u003E\nPlanetShine - 0.2.5\u003Cbr\u003E\nProcedural Parts - 1.2.1\u003Cbr\u003E\nRCS Build Aid - 0.8\u003Cbr\u003E\nRealPlume - Stock - 0.10.7\u003Cbr\u003E\nRemoteTech - 1.7\u003Cbr\u003E\nSCANsat - 1.1.6.1\u003Cbr\u003E\nStock Visual Enhancements - 0.6.4\u003Cbr\u003E\nTextureReplacer - 2.4.13\u003Cbr\u003E\nTweakScale - 2.2.10\u003Cbr\u003E\nUSI Core - 0.2.2.1\u003Cbr\u003E\nAsteroid Recycling Tech - 0.8.2.1\u003Cbr\u003E\nUSI Exploration Pack - 0.5.2.1\u003Cbr\u003E\nFreight Transport Tech - 0.5.2.1\u003Cbr\u003E\nKolonization Core - 0.2.2.1\u003Cbr\u003E\nUSI-LS - 0.4.2.1\u003Cbr\u003E\nUSI Survivability Pack - 0.5.2.1\u003Cbr\u003E\nUKS - 0.40.2.1\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-05-08T10:10:22Z","Content":"\n\u003Cp\u003E\nIf you start burning prograde a little \u003Cem\u003Ebefore\u003C/em\u003E your Ap, the Ap will slowly scoot forward ahead of you in orbit. If you control the thrust of your burn properly, the Ap will stay about the same distance ahead and not gain any altitude -- all the time, your Pe will be rising. You often need to thrust limit your engine, and just touch the thrust a little for this to work. It\u0027s just another trick that takes practice.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-05-08T16:35:02Z","Content":"\n\u003Cp\u003E\nYou can also tweak things a bit by aiming slightly above (radially outward of) or below (radially inward of) prograde.\n\u003C/p\u003E\n\u003Cp\u003E\nFor example:  Suppose you start your burn a little before you get to Ap.  You\u0027re pretty close to Ap, so you\u0027re going mostly horizontally, with just a teeny \u0022up\u0022 component (assuming that you\u0027re holding prograde).  Your goal is to raise your Pe to be close to your Ap, without raising your Ap too much.\n\u003C/p\u003E\n\u003Cp\u003E\nWell, if you burn strictly prograde in that condition, you \u003Cem\u003E\u003Cu\u003Ewill\u003C/u\u003E\u003C/em\u003E rase your Pe by a lot... but you\u0027ll also be raising your Ap in the process.  You\u0027d like for your Ap not to rise too much.  Well, you can tip your rocket \u003Cem\u003E\u003Cu\u003Eslightly\u003C/u\u003E\u003C/em\u003E downard (just a few degrees)-- this will tend to \u0022depress\u0022 your Ap while still allowing your Pe to climb.\n\u003C/p\u003E\n\u003Cp\u003E\nSimilarly:  Once you get past your Ap, so that your altitude is now decreasing:  you do the same thing, except tip your rocket \u003Cem\u003E\u003Cu\u003Eup\u003C/u\u003E\u003C/em\u003E slightly.  That will accomplish the same thing (depress your Ap while letting your Pe continue to rise).\n\u003C/p\u003E\n\u003Cp\u003E\nIn other words,\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nTipping slightly below prograde will \u003Cem\u003E\u003Cu\u003Elower\u003C/u\u003E\u003C/em\u003E your Ap if it\u0027s in front of you, but \u003Cem\u003E\u003Cu\u003Eraise\u003C/u\u003E\u003C/em\u003E your Ap if it\u0027s behind you.\n\u003C/li\u003E\n\u003Cli\u003E\nTipping slightly above prograde will \u003Cem\u003E\u003Cu\u003Eraise\u003C/u\u003E\u003C/em\u003E your Ap if it\u0027s in front of you, but \u003Cem\u003E\u003Cu\u003Elower\u003C/u\u003E\u003C/em\u003E your Ap if it\u0027s behind you.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe other thing you can do is spread out the burn.  This works fine even without any of the tipping described above-- you can do it while holding steady prograde the whole time.\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nStart your burn slightly before Ap.  \u0022How much before\u0022 may take some trial-and-error.  You want to be pretty close to Ap... but if you\u0027re \u003Cem\u003E\u003Cu\u003Etoo\u003C/u\u003E\u003C/em\u003E close, you won\u0027t have enough TWR to keep your Ap in front of you.  Just try it and see.\n\u003C/li\u003E\n\u003Cli\u003E\nAs you burn, your Ap will move forward.\n\u003C/li\u003E\n\u003Cli\u003E\nIdeally you want your Ap to move forward just slightly faster than your ship is catching up to it.\n\u003C/li\u003E\n\u003Cli\u003E\nIf you\u0027re burning full-throttle and your ship catches up with and overtakes your Ap ... you waited too late to start the burn.  Go back to step 1 and start your burn a little earlier.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/li\u003E\n\u003Cli\u003E\nThe longer you burn, the more the Ap will start to accelerate ahead of you.\n\u003C/li\u003E\n\u003Cli\u003E\nWhen you see it start to \u0022run away\u0022 ... stop burning and wait to catch up with it.  Then go back to step #1 again.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nJust repeat that cycle.  When your Pe starts to get close to your Ap, you\u0027ll find that it\u0027ll hit that \u0022run away\u0022 condition much sooner (because when your orbit is getting close to circular, just a small amount of dV will move Ap by a lot).\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027ll probably have to iterate only two or three times before you\u0027re close enough to count as circular.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2016-05-08T17:44:59Z","Content":"\n\u003Cp\u003E\nWhat I do is (based on a previous forum post by someone else that I\u0027ve lost track of):\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nUse SAS to lock prograde\n\u003C/li\u003E\n\u003Cli\u003E\nGo to map screen once your Ap is around 70 km (maybe earlier once you\u0027ve practiced this a few times)\n\u003C/li\u003E\n\u003Cli\u003E\nHover mouse over Ap marker to see your time to apoapsis\n\u003C/li\u003E\n\u003Cli\u003E\nAdjust throttle to keep this between 30 and 50 seconds; so if it\u0027s below that, throttle up, and if it\u0027s above, throttle down\n\u003C/li\u003E\n\u003Cli\u003E\nContinue till Pe marker rises above 70 km\n\u003C/li\u003E\n\u003Cli\u003E\nAllow your time to apoapsis to drop below 30 during the final stretch, with the goal of reaching 0 seconds exactly as Pe reaches 70 km\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nAs bewing says, the \u0022\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:22.4px;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;float:none;background-color:rgb(255,255,255);\u0022\u003EAp climbing rapidly\u003C/span\u003E\u0022 is your time to apoapsis getting away from you. If you watch that number directly and keep it in a suitable range, you\u0027ll prevent that from happening. It\u0027s not so tough once you get a sense of how different throttle values affect it.\n\u003C/p\u003E\n"},{"CreatedByName":"astrospud","CreatedById":36799,"CreatedDateTime":"2016-05-08T23:06:09Z","Content":"\n\u003Cp\u003E\nAll great answers here, thanks! \n\u003C/p\u003E\n\u003Cp\u003E\nLast night I tried several times to keep my Ap ahead of me, but was always at below 30s to Apoapsis, now I think about it. With nodes, I\u0027ve almost always needed a burn time near 1 minute for the Dv to circularise, thus halving that burn time to 30s or so either side of Ap. I will practice the with all the advice stated above. \n\u003C/p\u003E\n\u003Cp\u003E\nMany thanks!\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2016-05-09T05:47:49Z","Content":"\n\u003Cp\u003E\nYou need to upgrade mission control as well as the tracking station to access nodes.\n\u003C/p\u003E\n"},{"CreatedByName":"astrospud","CreatedById":36799,"CreatedDateTime":"2016-05-09T07:53:22Z","Content":"\n\u003Cp\u003E\nYeah, I just found that out last night as well!\n\u003C/p\u003E\n"}]}