{"TopicId":13939,"ForumId":16,"TopicTitle":"How to make Mk3 Spaceplane","CreatedByName":"fraczus","CreatedById":31354,"CreatedDateTime":"2012-07-09T21:48:16Z","PageNum":1,"Articles":[{"CreatedByName":"fraczus","CreatedById":31354,"CreatedDateTime":"2012-07-09T21:48:16Z","Content":"\n\u003Cp\u003ELike in subject. I\\\u0027ve got problems to do a Mk3, stable spaceship. Any advices?\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2012-07-09T21:56:59Z","Content":"\n\u003Cp\u003EMK3 cockpits and chassis sections can be quite heavy, but in principle, they work the same as most other space planes The most difficult part is the wings. Getting a stable flyer is easy, just making larger wings and but getting them into space is the more difficult part. You will want to vertical launch them. In order to do that, go to your KSP folder and the ships folder. Go to SPH folder and copy the saved file for your space plane, and paste it into VAB. When in VAB. you can load it up, but will be in a horizontal position, once you click the cockpit, it will immediately orient to vertical. The following spoiler is a pic of a MK2 space plane on pad.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i529.photobucket.com/albums/dd332/KwKiller/Kerbal%20Space%20Command/screenshot23.png\u0022 alt=\u0022screenshot23.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe important thing to remember is the structure connecting to boosters to the back. A single coupler is flimsy and needs to have the structural links. A MK3 is done very similar, just on a larger scale. If you want to do runway liftoff, remember a couple facts. To pitch up, you want the rear landing gears just back from centre of gravity so it can pivot on them to get some bank upwards for list. You will want to make sure that any orbital boosters are symetrical on the X and Y axis of the plane to prevent spinout, and more wing surface and jet engines will be needed to get initial lift.\u003C/p\u003E\n"}]}