{"TopicId":140423,"ForumId":16,"TopicTitle":"Hello and Help!","CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-24T13:36:54Z","PageNum":1,"Articles":[{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-24T13:36:54Z","Content":"\n\u003Cp\u003E\nHi EliteKerbalPlayers!\n\u003C/p\u003E\n\u003Cp\u003E\nMy name is Joel Thomas and I\u0027m a noob to the KSP fraternity \u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E. Introduction aside, I was hoping the mighty KSP community can help me with a little project that I\u0027m trying to achieve in Career mode. I want to establish a lunar base on the surface on the Mun and use this project as a testing ground for my future planetary base missions, primarily Duna. The project is called \u0022Lyra\u0022 Lunar Base Deployment System. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Lyra%20LDBS_zpsfn9oflbe.png\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i1294.photobucket.com/albums/b605/thomj084/Lyra%20LDBS_zpsfn9oflbe.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe inspiration came from the now defunct \u0022Constellation\u0022 program that NASA originally proposed to go to Mars. Through this system, I want to deploy my Mun base which I affectionately named \u0022Ares 1-A Mun Base Plan\u0022. This is shown below:\n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i1294.photobucket.com/albums/b605/thomj084/Ares%201-A%20Deployment%20Plan_zpshjxjeg0j.jpg?t=1464011631\u0022 alt=\u0022Ares%201-A%20Deployment%20Plan_zpshjxjeg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo what\u0027s the problem? Well, I have the following issues that I was hoping the community could give me advice/ ideas to address them properly. These issues are:-\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\n How will I land these modules on a planet safely and efficiently?\n\u003C/li\u003E\n\u003Cli\u003E\n How do I launch these modules into space efficiently and effectively? \n\u003C/li\u003E\n\u003Cli\u003E\n Would it be ideal if I launch these modules into space, establish an orbit around the Mun and dock with some form of \u0022central\u0022 station to land these things?\n\u003C/li\u003E\n\u003Cli\u003E\n Any other ideas/ advice?\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nMany Thanks,\n\u003C/p\u003E\n\u003Cp\u003E\nJoel (a.k.a Talisman)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-24T13:54:40Z\u0022 title=\u002205/24/2016 01:54  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 24, 2016\u003C/time\u003E by thomj084\u003C/strong\u003E\n\u003Cbr\u003ESpelling mistakes; Update Image (Mun Base Plan);\n\u003C/span\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2016-05-24T14:51:17Z","Content":"\n\u003Cp\u003E\nHello Joel and welcome to the KSP forums!\n\u003C/p\u003E\n\u003Cp\u003E\nThat looks like a very interesting and ambitious project.\n\u003C/p\u003E\n\u003Cp\u003E\nYou mentioned that you are fairly new to KSP and your questions are quite general, so I\u0027ll give quite general answers.\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nYou will probably want to use some sort of space crane to land and drop them on the surface of another celestial body.\n\u003C/li\u003E\n\u003Cli\u003E\nYou really just need a rocket underneath and probably a fairing to help manage aerodynamics during ascent.\n\u003C/li\u003E\n\u003Cli\u003E\nI think it will work better to land them separately and then try to attach them to each other on the surface.\n\u003C/li\u003E\n\u003Cli\u003E\nYou will probably need to find a very flat place in order to dock those together on the surface.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nGlad to have you aboard.  I hope your project goes well.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy landings!\n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-24T15:06:59Z","Content":"\n\u003Cp\u003E\nHey Starhawk,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m not a complete noob (had the game since 0.18 myself \u003Cimg alt=\u0022^_^\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 title=\u0022^_^\u0022\u003E) but I\u0027ll be more specific with my problems.\n\u003C/p\u003E\n\u003Cp\u003E\n1) I tried the space crane idea but my design never worked because when I use the winch from the KAS mod, it does not want to lower the payloads on the ground.\n\u003C/p\u003E\n\u003Cp\u003E\n2) Cheers about the Fairings although I\u0027m already good about it.\n\u003C/p\u003E\n\u003Cp\u003E\n3) I was thinking about the same way for landing each module separately. But it devilishly expensive!\n\u003C/p\u003E\n\u003Cp\u003E\n4) I intend to find a good landing spot (lost count on my Mun and Minimus landings) and even establish a landing probe/rover on Duna.\n\u003C/p\u003E\n\u003Cp\u003E\nMany thanks for your kind words for the forums.\n\u003C/p\u003E\n\u003Cp\u003E\nJoel\n\u003C/p\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2016-05-24T15:52:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222598900\u0022 data-ipsquote-contentid=\u0022140423\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464102419\u0022 data-ipsquote-userid=\u0022164707\u0022 data-ipsquote-username=\u0022thomj084\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n42 minutes ago, thomj084 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI tried the space crane idea but my design never worked because when I use the winch from the KAS mod, it does not want to lower the payloads on the ground.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTry to design such a system that doesn\u0027t use KAS or a winch.  Instead, mount your base module low underneath your spacecrane and attach it with a docking port and a strut.  Then you can land the spacecrane and simply disconnect the node on the docking port, allowing the module to drop to the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nHope this helps.\n\u003C/p\u003E\n\u003Cp\u003E\nHappy landings!\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2016-05-24T16:03:25Z","Content":"\n\u003Cp\u003E\nYour design has docking ports on each module; if you make sure the port is over the centre of mass, could you make a crane with a docking port instead of a KAS winch?  If you use girders to extend your landing struts (or instead of landing struts), you could land the crane on the Mun and undock, dropping each module a fraction of a metre to the ground.  The wheels you have are quite strong.\n\u003C/p\u003E\n\u003Cp\u003E\nThe crane would be expensive, but you\u0027d only need one.  Just be sure you land the ISRU first so you don\u0027t have to haul prohibitive amounts of fuel.  If the lacking stability of the docking port is a concern, remember that KAS also has struts.  The cheapest way to put this together will likely be to have a dedicated tug module to ferry the modules from Kerbin to the Mun and then use the crane only for landing, but you\u0027re still going to have quite a few launches just to get it all in the sky.\n\u003C/p\u003E\n\u003Cp\u003E\n/Ninja\u0027d by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/131400-starhawk/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022131400\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/131400-starhawk/\u0022 rel=\u0022\u0022\u003E@Starhawk\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-24T16:03:57Z\u0022 title=\u002205/24/2016 04:03  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 24, 2016\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-24T16:14:58Z","Content":"\n\u003Cp\u003E\n\u003Ca data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/131400-starhawk/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022131400\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/131400-starhawk/\u0022 rel=\u0022\u0022\u003E@Starhawk\u003C/a\u003E Thanks for the heads up! I shall attempt this design.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/125721-zhetaan/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125721\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125721-zhetaan/\u0022 rel=\u0022\u0022\u003E@Zhetaan\u003C/a\u003E I couldn\u0027t stop loling when you \u0022Ninja\u0027d\u0022  in your post. The crane design you stated was my first ever design (through the use of Infernal Robotics) but the issue I had with the design was it does not have the strength or \u0022weight\u0022 to stay put  because when to say I grab one of the modules with the crane, the crane flips over whenever I tested it on KSC. I do wish there were some more cool modules that were available in Infernal Robotics plus a better crane design from my part which is effective, capable, strong and reliable.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the posts though, I really appreciate it!\n\u003C/p\u003E\n\u003Cp\u003E\nJoel\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2016-05-25T00:44:22Z","Content":"\n\u003Cp\u003E\nIn that case, you can always add more weight.  I love Infernal Robotics: it\u0027s one of my very favourite mods.  But if weight is your problem, then you may consider that something bulkily stock may be the answer to your problem.  A skycrane, by design, is not particularly heavy, but there\u0027s nothing preventing you from making a heavier one.  Maybe incorporate ore tanks into the legs, for example.  Of course, you sacrifice efficiency doing that, but the crane that works is always going to be more efficient than the one that does not.\n\u003C/p\u003E\n"},{"CreatedByName":"WellItExplodedAgain","CreatedById":149143,"CreatedDateTime":"2016-05-25T13:22:58Z","Content":"\n\u003Cp\u003E\nHello Joel,\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTo get your crafts in space, it would be cheaper to launch multiple things at once. I recommend to launch everything in LKO then launch another craft to tug everything around to your destination. This project looks like it is going to be expensive. Good luck! \n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-25T14:12:45Z","Content":"\n\u003Cp\u003E\nHey @WellExplodedAgain,\n\u003C/p\u003E\n\u003Cp\u003E\nFortunately, I have made around 5million within my career mode (thanks to my space station, telescope, landings on Mun, Minimus and a pass by of Duna in LKO and Geosynchronous) . I\u0027ve made a design of a crane that acts as a tug for the landed modules and allows it to be taken off the carrier modules which has these base modules (2 modules packed in a container fairings which will be deployed once it\u0027s on the ground). I\u0027m still messing about with these designs. I\u0027ll update on this situation here \u003Cimg alt=\u0022^_^\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 title=\u0022^_^\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThanks,\n\u003C/p\u003E\n\u003Cp\u003E\nJoel\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-25T17:08:10Z","Content":"\n\u003Cp\u003E\nTo expand a bit more about my situation, I have created an image below on how I intend to develop the base:\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg class=\u0022ipsImage\u0022 src=\u0022http://i1294.photobucket.com/albums/b605/thomj084/Ares%201-%20A%20Module%20Breakdown_zpshcilrfag.jpg?t=1464109442\u0022 alt=\u0022Ares%201-%20A%20Module%20Breakdown_zpshc\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nMy problem is I\u0027m not sure how to launch, land and deploy the CNS and the other modules? I tried my crane design with infernal robotics and there was some worrying game breaking mechanics \u002B explosions\u003Cimg alt=\u0022:lol:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_laugh.png\u0022 title=\u0022:lol:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nHence, can anyone give me some advice now that my space crane and my mobile crane ideas both failed?\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2016-05-25T20:06:02Z","Content":"\n\u003Cp\u003E\nHmm.\n\u003C/p\u003E\n\u003Cp\u003E\n...\n\u003C/p\u003E\n\u003Cp\u003E\n... Hmm.\n\u003C/p\u003E\n\u003Cp\u003E\nLaunching isn\u0027t really a problem.  Your central module looks as though it can go on the nose of a rocket without too much trouble, and the habitation module looks as though it can be paired with another bottom-to-bottom and sent that way, assuming the assembly is light enough to launch.  I\u0027d suggest making a central beam of some sort and attaching the modules to the middle with separators; it keeps your launcher\u0027s orbital stage in one piece and avoids the problem of balance.  For any other problems with launching, I\u0027d suggest looking at \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022 rel=\u0022\u0022\u003E@Geschosskopf\u003C/a\u003E\u0027s topics on the subject.  I don\u0027t know whether he\u0027s the definitive expert on unconventional lifters, but he knows a lot more than I do and brings photos to prove it.\n\u003C/p\u003E\n\u003Cp\u003E\nDeployment doesn\u0027t look to be too concerning, either.  Your modules are on rover wheels and have power; so long as you have sun, the biggest problem will be getting the docking ports to line up correctly.  That can be more problematic than it seems, but aside from telling you to land somewhere flat and to make sure that all of your wheels bear roughly equivalent weight (so the suspension keeps the ports at the same height), there isn\u0027t much else I can do to help.\n\u003C/p\u003E\n\u003Cp\u003E\nLanding is going to be interesting without a crane.  My first thought is to attach fuel tanks and engines to the sides via the same docking ports you will use to attach your modules.  This is something that will very much need to be assembled in space, so strutting, if needed, will need to be KAS-based.  You can use a standard bottom-mounted descent stage, then decouple and switch to the side engines for final landing, especially for the central module.  Getting rid of the lander engines is simply a matter of running up the TWR to .7 so and undocking.  Make certain you use gimballing engines and a lot of roll authority or else minor misalignments in docking will make you spin.  Your longer modules will need even more roll authority to keep from falling over.  Landing on the wheels will require putting the docking port right at the bottom of the fuel tank so the engine can clear the ground.  Keeping a low centre-of-mass is all-important here, too, so you may benefit more from using a wide stack of short tanks than a tall tank.  Getting all of this into orbit and to the Mun is going to be utterly insane, which, if nothing else, will give you a deep appreciation for why we\u0027ve not built a real-life moonbase yet.\n\u003C/p\u003E\n\u003Cp\u003E\nAlternatively, you can install Extraplanetary Launchpads and build it all in place.  But I suspect that you\u0027re more interested in the challenge.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I\u0027d like to compliment you on your design drawings.  You put more care into the presentation than I\u0027ve put into some of my missions.\n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-25T20:10:55Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/125721-zhetaan/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022125721\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/125721-zhetaan/\u0022 rel=\u0022\u0022\u003E@Zhetaan\u003C/a\u003E Thanks for your compliments, I really appreciate it. Could you provide some examples of \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0026amp;do=hovercard\u0022 data-mentionid=\u002269507\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/69507-geschosskopf/\u0022 rel=\u0022\u0022\u003E@Geschosskopf\u003C/a\u003E works that might aid me in this project?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks,\n\u003C/p\u003E\n\u003Cp\u003E\nJoel\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-25T20:12:14Z\u0022 title=\u002205/25/2016 08:12  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 25, 2016\u003C/time\u003E by thomj084\u003C/strong\u003E\n\u003Cbr\u003EForgot something important to write;\n\u003C/span\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2016-05-25T20:24:20Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/118691-flying-on-duna-in-104-some-general-guidelines/\u0022 rel=\u0022\u0022\u003EFlying on Duna in 1.0.4\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s an older thread for an older version of KSP, but it\u0027s got some great ideas about launchers in the section entitled \u0027Launching from Kerbin\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/127345-the-outer-planets-traveling-circus-episode-28-superheroes-the-end/\u0026amp;page=1\u0022 rel=\u0022\u0022\u003EThe Outer Plants Traveling Circus\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSpecifically, look at Episodes Two, Nine, and Ten.  Nine specifically has a winged rover that, though not precisely what you\u0027re looking for to land on the Mun, nevertheless offers a few ideas for attachment and so forth to get unconventional shapes off the ground (and back on the ground somewhere else).  You\u0027d likely be best off scrapping the wings in favour of beams with engines on the ends, but it\u0027s your ship.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-25T20:28:11Z\u0022 title=\u002205/25/2016 08:28  PM\u0022 data-short=\u00228 yr\u0022\u003EMay 25, 2016\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-25T20:35:44Z","Content":"\n\u003Cp\u003E\nTruly appreciate this info Zhetaan, I shall get back to you about the situation. Thanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-05-25T20:39:36Z","Content":"\n\u003Cp\u003E\nYour CNS looks fairly balanced around the vertical axis. My suggestion is to attach another docking port on top of the docking port. To that, add some fuel tanks, solar panels, a probe core, SAS, 2 radially mounted Monoprop tanks, RCS, and radially mounted engines. This thing will act as a kind of tug for your modules.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the bottom of each module, add some folding landing legs. Space them so that when they deploy, they are linearly placed along the ventral side. Only one should touch the ground at a time. To form a tripod, use the wheels (set on brakes, of course).\n\u003C/p\u003E\n\u003Cp\u003E\nAfter you land the first module, fly your tug back to munar orbit. Rendezvous with the next module, and dock. Fill the tanks with fuel, and burn to the surface. When you are almost at the ground, and moving slowly, deploy the legs. They should all stick out along the underside of the module. Land the module on a leg and two wheels. It should be vertical or almost vertical. To set it on the ground, close the first landing leg, and give a short sideways burst with the RCS. You should fall onto the second leg, and the next two wheels. Now might be a good time to remove that tug. Fly it away a safe distance, and land it.\n\u003C/p\u003E\n\u003Cp\u003E\nKeep raising the gear until it\u0027s only the 4 wheels on the ground. Then drive the module over, and dock.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, Welcome Aboard!\n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-25T20:47:07Z","Content":"\n\u003Cp\u003E\nMuch appreciated Dman979 and Thank you!\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-05-25T20:56:27Z","Content":"\n\u003Cp\u003E\nBy the way, it would be nice if you posted a mission report letting us know how this turned out. I\u0027d love to see what you go with!\n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-25T21:16:48Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022http://forum.kerbalspaceprogram.com/index.php?/profile/123837-dman979/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022123837\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/123837-dman979/\u0022 rel=\u0022\u0022\u003E@Dman979\u003C/a\u003E It\u0027s quite wonderful to see people are interested in my project. I\u0027ll be more than happy to create a detailed report with nice pictures to show you about the mission\u003Cimg alt=\u0022^_^\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 title=\u0022^_^\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-26T11:23:24Z","Content":"\n\u003Cp\u003E\nSo, after several design failures and near destruction of KSC. I have finally developed a final prototype that can successfully land all the modules including the CHS and Habitation module. I present you...\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\n\u003Cimg alt=\u0022Aspida%20-%20Orbital%20Skycrane_zpsuxwb3\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i1294.photobucket.com/albums/b605/thomj084/Aspida%20-%20Orbital%20Skycrane_zpsuxwb3mcg.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022text-align:justify;\u0022\u003E\nEven though I\u0027m really close to deploying my Lunar Base Deployment Mission or \u0022Lyra\u0022 here is my next problem. After I land my modules, I want to obviously undock from my sky crane. However, the sky crane goes berserk (as expected) and blow up somewhere else. My dilemma is that I would love to reuse my sky crane  without it being blown up (so basically I want to control  the crane rather than losing control) so I can save a lot of money as the current cost for the sky crane is under 20K which is quite amazing. Any ideas?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks,\n\u003C/p\u003E\n\u003Cp\u003E\nJoel \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-05-26T11:34:00Z\u0022 title=\u002205/26/2016 11:34  AM\u0022 data-short=\u00228 yr\u0022\u003EMay 26, 2016\u003C/time\u003E by thomj084\u003C/strong\u003E\n\u003Cbr\u003EWritten Format\n\u003C/span\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-05-26T12:35:06Z","Content":"\n\u003Cp\u003E\nAdd a probe core.\n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-26T12:49:59Z","Content":"\n\u003Cp\u003E\nThat\u0027s the thing Dman979, I already have, yet I do not gain control of the system when I undock the crane from the payload.\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-05-26T15:09:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222602042\u0022 data-ipsquote-contentid=\u0022140423\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464266999\u0022 data-ipsquote-userid=\u0022164707\u0022 data-ipsquote-username=\u0022thomj084\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, thomj084 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat\u0027s the thing Dman979, I already have, yet I do not gain control of the system when I undock the crane from the payload.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHmm, really? On the crane? I\u0027ve never seen that happen before.\n\u003C/p\u003E\n\u003Cp\u003E\nCan you do a quick test for me?\n\u003C/p\u003E\n\u003Cp\u003E\nLand the crane/module, undock, and switch to the crane. What color is the light at the bottom left of the screen? Green, or purple?\n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-26T16:06:43Z","Content":"\n\u003Cp\u003E\nGreen, but I realize my mistake. I made the crane from the Hab / CHM Module so when I undock I wasn\u0027t controlling the crane, I was controlling the payload all this time, lol!\n\u003C/p\u003E\n"},{"CreatedByName":"Dman979","CreatedById":123837,"CreatedDateTime":"2016-05-26T16:24:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222602327\u0022 data-ipsquote-contentid=\u0022140423\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464278803\u0022 data-ipsquote-userid=\u0022164707\u0022 data-ipsquote-username=\u0022thomj084\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 minutes ago, thomj084 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nGreen, but I realize my mistake. I made the crane from the Hab / CHM Module so when I undock I wasn\u0027t controlling the crane, I was controlling the payload all this time, lol!\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E We all make PEBCAKs sometimes.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, about that mission report?\n\u003C/p\u003E\n"},{"CreatedByName":"thomj084","CreatedById":164707,"CreatedDateTime":"2016-05-26T16:45:51Z","Content":"\n\u003Cp\u003E\nsoon \u003Cimg alt=\u0022^_^\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_happy.png\u0022 title=\u0022^_^\u0022\u003E soon...\n\u003C/p\u003E\n"}]}