{"TopicId":140933,"ForumId":16,"TopicTitle":"Ocean recovery $$$?","CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2016-06-01T02:09:33Z","PageNum":1,"Articles":[{"CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2016-06-01T02:09:33Z","Content":"\n\u003Cp\u003E\nDo parts that have fallen into the water add $$ when a craft (flight) is recovered?  Obviously they would have parachutes. If not, does it help (or matter) if they have flotation added to them?\n\u003C/p\u003E\n\u003Cp\u003E\nTB2\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-01T03:25:20Z","Content":"\n\u003Cp\u003E\nThere are some complicated details inside that question, actually, now that I think about it. In general, the answer is yes, but not quite the way you ask it. You are implying that the parts fell into the water separately from their craft.\n\u003C/p\u003E\n\u003Cp\u003E\nIf the parts are separate from the main craft, then they follow the rules of debris. Either you have to watch them fall all of the way down \u003Cstrong\u003Eand stop moving\u003C/strong\u003E, or they have to be within your physics radius -- or else they may get auto deleted as \u0022burned up in the atmosphere during reentry\u0022. Once they come to rest, they will remain there forever until you specifically recover them -- they will definitely not be recovered automatically with the main craft. When you recover them, you will get kerbucks for their recovery depending exclusively on their total distance from KSC (being underwater makes no difference).\n\u003C/p\u003E\n\u003Cp\u003E\nIf you land a craft in the water and some pieces fall off and sink, then the same thing happens. The sunken pieces are debris and must be recovered separately, once they finish moving. However, the autodeletion concept probably still applies. If you recover the ship before the pieces finish sinking (moving), I suspect they will get autodeleted. If you care to find out for certain, you can test it. Engines sink -- so if you ditch a plane, decouple the engine over deep water, and recover the craft while it is sinking ... you will know by whether there is debris remaining afterward for you to recover separately.\n\u003C/p\u003E\n\u003Cp\u003E\nBut if non-floating parts can get autodeleted after they hit the water, then yes -- adding flotation to them might make all the difference.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-01T03:48:36Z\u0022 title=\u002206/01/2016 03:48  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 1, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mahnarch","CreatedById":114432,"CreatedDateTime":"2016-06-01T22:09:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222610887\u0022 data-ipsquote-contentid=\u0022140933\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464751520\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nor else they may get auto deleted\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI learned this the hard way several months ago;\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI built this super-sweet cargo plane with pods behind the tail so that I could fly over and stage a chute and decoupler to land a kerbal at a specific point.\n\u003C/p\u003E\n\u003Cp\u003E\nI dropped off three kerbals that day, but the lands were greedy and swallowed them all whole - for, when I went back to pick up some science with them, they were no where to be found.\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-06-01T23:06:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222612029\u0022 data-ipsquote-contentid=\u0022140933\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221464818963\u0022 data-ipsquote-userid=\u0022114432\u0022 data-ipsquote-username=\u0022Mahnarch\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n55 minutes ago, Mahnarch said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI learned this the hard way several months ago;\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI had two tourists get autodeleted (maybe just one, but it killed the contract).  They were in separate capsules that all separated and pulled parachutes together, but the one on top was carrying a sputnik and fell faster.  Somehow the tourists were deleted in the process.\n\u003C/p\u003E\n\u003Cp\u003E\nI suspect it was a bug, I just reverted and adjusted things so they all could land together.\n\u003C/p\u003E\n"},{"CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2016-06-02T11:54:31Z","Content":"\n\u003Cp\u003E\nThanks all for the informative feedback!  I was wondering why my booster rockets were not being recovered even with parachutes. Now I can build even more economical rockets knowing this. \n\u003C/p\u003E\n\u003Cp\u003E\nTB2\n\u003C/p\u003E\n"},{"CreatedByName":"wumpus","CreatedById":133850,"CreatedDateTime":"2016-06-02T14:58:25Z","Content":"\n\u003Cp\u003E\nIt is very hard to beat the autodeleter from 1.0 (and I think that was the last time it expanded).  When I tried to build a \u0022stock recoverable\u0022 first stage it involved firing retrorocket (flea) and carefully tuning the parachutes to open (I think it was changing the pressure, one of the settings) after the velocity was slow enough to not to burn up the rocket and low enough that it would be deleted as it slowly wafted down.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you really want to recover bits of you rocket I suggest the following mods:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://mods.curse.com/ksp-mods/kerbal/223119-stagerecovery\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://mods.curse.com/ksp-mods/kerbal/223119-stagerecovery\u003C/a\u003E   (straightforwardly does what you expected.  Put parachutes on rockets and they are recovered)\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/72605-110-flight-manager-for-reusable-stages-fmrs-x110-experimental/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThis one is for more fancy (spacex-style) recovery and will take more time.  Basically it lets you take control of each stage as it is ditched.  But if you want to create fancy air-launched systems or do vertical landing (on rockets), this is a must.\n\u003C/p\u003E\n"},{"CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2016-06-05T16:18:25Z","Content":"\n\u003Cp\u003E\nThanks for the feedback,  stagerecovery is what I was looking for. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTB2\n\u003C/p\u003E\n"},{"CreatedByName":"Loren Pechtel","CreatedById":157006,"CreatedDateTime":"2016-06-05T23:17:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222617660\u0022 data-ipsquote-contentid=\u0022140933\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465143505\u0022 data-ipsquote-userid=\u002266586\u0022 data-ipsquote-username=\u0022TBryson2\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, TBryson2 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks for the feedback,  stagerecovery is what I was looking for. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTB2\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, it works like a charm.  One thing to watch, though--your first stage might be in physics range at landing.  If so you have to make sure it\u0027s chutes actually work--deploy at a proper speed to avoid destruction.  Stages that will be outside physics range get simulated landings, the chute controls don\u0027t matter--they simply touch down at the velocity the attached chutes would slow them to.  In theory you are also allowed to include some fuel and a probe core but I have never experimented with this.  It might be worthwhile when landing big stages.\n\u003C/p\u003E\n"}]}