{"TopicId":141462,"ForumId":16,"TopicTitle":"Using way too much delta v to get to Eve","CreatedByName":"gunnargolf","CreatedById":165310,"CreatedDateTime":"2016-06-08T20:21:19Z","PageNum":1,"Articles":[{"CreatedByName":"gunnargolf","CreatedById":165310,"CreatedDateTime":"2016-06-08T20:21:19Z","Content":"\n\u003Cp\u003E\nHi everyone\n\u003C/p\u003E\n\u003Cp\u003E\nI just launched my first one way trip mission to Eve. I\u0027ve escaped Kerbins SOI and am Orbiting the Sun. According to delta-v charts, I should only need about 90 m/s to get from the edge of Kerbins SOI all the way to Eve. I seem to be needing around 700 m/s to reach it, which I dont\u0027t have. I really don\u0027t get how I should be able to reach it with such little delta-v. Can you help me out?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://www.dcl.hpi.uni-potsdam.de/home/feinbube/web/stealth/KSPDeltaVMap/\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://postimg.org/image/e71wcyz6z/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://s33.postimg.org/e71wcyz6z/ksp.jpg\u0022 class=\u0022ipsImage\u0022 alt=\u0022ksp.jpg\u0022\u003E\u003C/a\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"mk1980","CreatedById":163203,"CreatedDateTime":"2016-06-08T21:27:07Z","Content":"\n\u003Cp\u003E\nYou dont burn to solar orbit first. The delta v maps assume that youre doing a direct transfer burn from low kerbin orbit. In this case you take advantage of the oberth effect.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-06-08T22:53:41Z","Content":"\n\u003Cp\u003E\nThat 90 m/s is an unlikely minimum. It supposes you are right on the edge of Kerbin\u0027s SOI and a small amount of dV will finish the escape. Then that you have managed things so that that escape will launch you exactly on an intercept for Eve. \n\u003C/p\u003E\n\u003Cp\u003E\nBetter to assume you are going to need much more and build accordingly. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-08T22:53:55Z\u0022 title=\u002206/08/2016 10:53  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 8, 2016\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-09T03:49:13Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222622927\u0022 data-ipsquote-contentid=\u0022141462\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465421227\u0022 data-ipsquote-userid=\u0022163203\u0022 data-ipsquote-username=\u0022mk1980\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 hours ago, mk1980 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou dont burn to solar orbit first. The delta v maps assume that youre doing a direct transfer burn from low kerbin orbit. In this case you take advantage of the oberth effect.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n^ This.  \u003Cstrong\u003EOberth effect is your friend.\u003C/strong\u003E  What the dV map is saying is: if you do a single burn in LKO, it\u0027s only a little bit more to go all the way to Eve than it is just to get to the edge of Kerbin\u0027s SoI.  If you launch to just barely get out of the SoI, and \u003Cem\u003E\u003Cu\u003Ethen\u003C/u\u003E\u003C/em\u003E do your Eve transfer burn from way out there, that\u0027s really inefficient and eats up more total dV.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222623060\u0022 data-ipsquote-contentid=\u0022141462\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221465426421\u0022 data-ipsquote-userid=\u0022113764\u0022 data-ipsquote-username=\u0022Foxster\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Foxster said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThat 90 m/s is an unlikely minimum. It supposes you are right on the edge of Kerbin\u0027s SOI and a small amount of dV will finish the escape.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n^ Not this.  If you\u0027re in a circular solar orbit congruent with Kerbin\u0027s, it takes a lot more than 90 m/s to lower Pe to Eve.  It\u0027s not just an unlikely minimum,, it\u0027s mathematically impossible.  \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"mk1980","CreatedById":163203,"CreatedDateTime":"2016-06-09T07:03:24Z","Content":"\n\u003Cp\u003E\nhere\u0027s a link to a website that calculates some important numbers for efficient transfers:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nit also explains the process a bit.\n\u003C/p\u003E\n\u003Cp\u003E\nbasically, it boils down to the following:\n\u003C/p\u003E\n\u003Cp\u003E\n- for an optimal (or near optimal) transfer, you have to launch during a \u0022launch window\u0022 - the source and target planet should be in the correct constellation, otherwise an optimal transfer is not possible.\n\u003C/p\u003E\n\u003Cp\u003E\n- that constellation can be described by a \u0022phase angle\u0022. if you view the solar system from \u0022top down\u0022 and draw a line from the starting planet (in your case- kerbin) through the sun, and another line from the target planet (Eve) through the sun, the phase angle is the angle between the 2 planets. the calculator suggests a phase angle of -54°. if you imagine the solar system as a clock, that means the constellation is about right when kerbin is at \u00223 o\u0027clock\u0022 and eve is near \u00225 o\u0027clock\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n- the \u0022ejection angle\u0022 from the calculator tells you where on the low kerbin orbit you should place your maneuver node. for a transfer to one of the inner planets, that ejection angle is always on the \u0022day\u0022 side of the planet, for transfers outwards its on the \u0022night\u0022 side. in my experience, that angle is not necessarily the correct angle for each situation. i suppose it would be if everything is perfectly aligned, but in practise you\u0027ll often have to drag the node a bit upwards or downwards to get an intercept.\n\u003C/p\u003E\n\u003Cp\u003E\n- the goal of the planned transfer is that both your ship and the target planet will arrive at the same point at the same time. the numbers are calculated in a way that this intercept point is more or less exactly on the oppsosite side of the sun from kerbins position at the time of the burn.\n\u003C/p\u003E\n\u003Cp\u003E\n- note that it\u0027s pretty difficult to set up such a burn with the default maneuver node interface. the main problem here is that you basically have to zoom in to kerbin to drag the node along the orbit, but at the same time you kinda have to zoom out to see the effect of that node (ie. to see if the burn will result in an intercept). takes quite a bit of practice to do it. to my knowledge, there are various mods that make the process easier. I\u0027m probably not the right person to make suggestions since i always did my transfers with the stock tools, but i\u0027m sure others can give you some good suggestions how to make it a bit less frustrating\n\u003C/p\u003E\n\u003Cp\u003E\nif all of that sounds to difficult, an alternative solution is to bring more deltaV than suggested by the maps. those maps assume near perfect efficiency for most maneuvers, so if you want to just get there somehow, it may be a good idea to bring more fuel than the bare minimum. nuclear engines are pretty efficient. it\u0027s not hard to design a nuclear powered probe/ship that has 4-5 km/s deltaV. if you can get that thing to kerbin orbit, you can easily reach eve or duna even with farily inefficient burns.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}