{"TopicId":141732,"ForumId":16,"TopicTitle":"space rocket launching from aircraft, how to make aircraft survive?","CreatedByName":"orangesherbet0","CreatedById":165458,"CreatedDateTime":"2016-06-13T16:41:15Z","PageNum":1,"Articles":[{"CreatedByName":"orangesherbet0","CreatedById":165458,"CreatedDateTime":"2016-06-13T16:41:15Z","Content":"\n\u003Cp\u003E\nI am having a problem where I want to launch rockets from a high-altitude airplane to lower costs. The airplane has a detachable rocket with enough delta-V to get to orbit from high altitude, but not enough to get to orbit from the ground. Currently I am doing my best to put the airplane in level flight, hit stability control, switch control to the rocket, then launch, but I find that in the time it takes to put the rocket in stable orbit, the airplane eventually hits the ground destructively. I\u0027m not even sure if I can switch back to the aircraft from the space control center if it survived (anyone know?). Perhaps this type of project is not even possible in KSP?\n\u003C/p\u003E\n\u003Cp\u003E\nDoes anyone have any ideas to allow the airplane to survive with low cost, or implement some career-mode-allowable autopilot functionality without mods, or mods that enable this functionality via coding or otherwise without seeming like complete cheating (mechjeb)?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-13T16:42:09Z\u0022 title=\u002206/13/2016 04:42  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 13, 2016\u003C/time\u003E by orangesherbet0\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"volcanicshrimp","CreatedById":139666,"CreatedDateTime":"2016-06-13T17:30:00Z","Content":"\n\u003Cp\u003E\nIt sounds like your plane is despawning (which happens if craft in an atmosphere get ~22.5km away from the currently controlled craft. The only ways to get around it that I know of are to put the rocket on a suborbital trajectory which it will stay in space on until you\u0027ve landed the plane then circularize after landing (more complicated and inefficient) or use mods such as FMRS.\n\u003C/p\u003E\n"},{"CreatedByName":"Thalamask","CreatedById":152732,"CreatedDateTime":"2016-06-13T17:38:23Z","Content":"\n\u003Cp\u003E\nEASY WAY   ---\u0026gt;   I haven\u0027t actually tested this in person, but it should work. Get the mod \u0022Stage Recovery\u0022 installed and slap parachutes on your plane. When it gets out of physics range, it should despawn, with Stage Recovery giving you a refund for the parts recovered.\n\u003C/p\u003E\n\u003Cp\u003E\nHARD WAY   ---\u0026gt;   As noted above, you\u0027d need to launch your rocket to an apoapsis that\u0027ll give you time to land and recover your plane before switching back to the rocket to circularise. Inefficient and tricky at best, a nightmare at worst.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-06-14T04:20:20Z","Content":"\n\u003Cp\u003E\nYeah, basically the mission profile you describe doesn\u0027t work in KSP, because of a limitation of the way the game works.  Only the currently controlled craft, and other craft inside the \u0022physics bubble\u0022, is actually physically simulated.  In atmosphere, the physics bubble goes out to 22.5km.  When the airplane goes outside of that, it switches to \u0022on rails\u0022 ... which equates to \u0022instantly destroyed\u0022 if it\u0027s below 23 km altitude.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can work around that with mods such as Stage Recovery, as described above.\n\u003C/p\u003E\n\u003Cp\u003E\nI played around a bit with \u0022two stage to orbit, recover the first stage\u0022 without mods.  It\u0027s doable, but requires a kind of odd mission profile that\u0027s designed more around the game\u0027s limitations than what I\u0027d prefer to design.  The key point to remember is that it\u0027s okay to be outside the \u0022physics bubble\u0022 while in atmosphere, without getting destroyed, \u003Cem\u003E\u003Cu\u003Eas long as your altitude is above the 1%-atmospheric-pressure-line\u003C/u\u003E\u003C/em\u003E (which on Kerbin is around 23 km).\n\u003C/p\u003E\n\u003Cp\u003E\nMy bottom \u0022launcher\u0022 stage wasn\u0027t an airplane, though.  It was a turbojet-powered booster; the rocket was vertical takeoff.\n\u003C/p\u003E\n\u003Cp\u003E\nSo the mission profile looks like this:  Bottom stage is a whole bunch of turbojets, arranged radially around a rocket-powered core for that last bit of oomph.  It has enough power to lob the whole ship into a trajectory that peaks pretty high up (in the 50 km range).  The bottom stage conks out while the craft is still rising fast-- and, crucially, is above the magic 23km altitude limit.  Stage away the top stage and apply enough thrust to lob it to a higher Ap, leaving the bottom stage behind.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat happens next depends on how high an orbit I\u0027m targeting for the upper stage.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s a low orbit, I coast up to Ap and circularize, then immediately switch back to the bottom stage, which has coasted up past its Ap and started to fall back, but hasn\u0027t fallen below 23km yet and therefore hasn\u0027t been destroyed.  I control it as it falls, and land it with parachutes in the ocean east of KSC.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it\u0027s a high orbit, then I don\u0027t have time to wait for it to get to Ap (the lower stage would get destroyed).  So in that case, I do enough burn to boost the Ap up to where I want it, and then switch back to the bottom stage and land it, and then switch back again to the 2nd stage (which hasn\u0027t reached Ap yet).  Coast up to Ap and circularize.\n\u003C/p\u003E\n\u003Cp\u003E\nIt works pretty well, and was interesting to play with.  However, I soon got bored with it (babysitting the booster stage back to earth is just really tedious, at least for me).  I\u0027d rather just fly a traditional rocket and deal with money another way.\n\u003C/p\u003E\n"},{"CreatedByName":"the_Demongod","CreatedById":150124,"CreatedDateTime":"2016-06-16T03:08:36Z","Content":"\n\u003Cp\u003E\nSounds like you\u0027re looking for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/72605-110-flight-manager-for-reusable-stages-fmrs-x110-experimental/\u0026amp;page=1\u0022 rel=\u0022\u0022\u003EFMRS\u003C/a\u003E, \u0022Flight Manager for Reusable Stages.\u0022 It basically freezes the stage you ditch (in your case, an aircraft, but could also be the Falcon 9 first stage for example), and then you fly the second stage to space as usual, and then you can return to the first stage afterwards to manually fly it back to base.\n\u003C/p\u003E\n\u003Cp\u003E\nIt hasn\u0027t been updated for 1.1.2 yet though, so YMMV with its current state.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-16T03:09:00Z\u0022 title=\u002206/16/2016 03:09  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 16, 2016\u003C/time\u003E by the_Demongod\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Van Disaster","CreatedById":58876,"CreatedDateTime":"2016-06-16T14:02:06Z","Content":"\n\u003Cp\u003E\nFMRS does not seem reliable at the moment. StageRecovery works if your stages manage to live until they despawn - unfortunately launching from pure atmospheric carrier craft has usually meant the carrier crashing before it despawns when I\u0027ve tried. A long time ago I managed it with a plane that could zoom climb almost to the edge of the atmosphere, that was enough time to throw the payload out \u0026amp; boost it out of the atmosphere \u0026amp; switch back to my plane and land it.\n\u003C/p\u003E\n"}]}