{"TopicId":142578,"ForumId":16,"TopicTitle":"sliding planes","CreatedByName":"Acronza1","CreatedById":165941,"CreatedDateTime":"2016-06-27T02:36:44Z","PageNum":1,"Articles":[{"CreatedByName":"Acronza1","CreatedById":165941,"CreatedDateTime":"2016-06-27T02:36:44Z","Content":"\n\u003Cp\u003E\nHIYO!\n\u003C/p\u003E\n\u003Cp\u003E\nso quick question.\n\u003C/p\u003E\n\u003Cp\u003E\neverytime i make a plane and start to take off my plane starts to turn to the left and ends up crashing on the side of the runway.\n\u003C/p\u003E\n\u003Cp\u003E\nim not sure how to fix it so it runs strait, the weight and lift are in the same spot with the thrust behind it all, the wheels are in even places, and my lifting area are all symmetric, so im not sure why it keeps flying off to the left before takeoff.\n\u003C/p\u003E\n\u003Cp\u003E\nso how do i fix this?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-27T05:06:12Z","Content":"\n\u003Cp\u003E\nDo you know the trick for using Absolute mode to set the angle on your wheels to exactly zero?\n\u003C/p\u003E\n\u003Cp\u003E\nOther than that, try setting the friction on your front wheel to .3 or less (assuming a tricycle arrangement) -- and see what happens. You can also increase the friction on your rear wheels -- adding drag at the back end increases stability.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, steer your plane one degree right (to a heading of 91) before you turn on \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and begin your takeoff roll, and then don\u0027t steer after that.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-27T05:35:04Z\u0022 title=\u002206/27/2016 05:35  AM\u0022 data-short=\u00228 yr\u0022\u003EJune 27, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FyunchClick","CreatedById":143109,"CreatedDateTime":"2016-06-27T16:01:58Z","Content":"\n\u003Cp\u003E\nMake sure your gear isn\u0027t overloaded. It\u0027ll start skating around a lot if it is I noticed. Add additional load bearing gear to see if that helps.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, I notice my planes tend to start losing grip and spinning out when the plane is at or over minimum takeoff speed. I presume it\u0027s because the lack of load on the wheels are causing them to lose grip but the simulation is still considers the thing landed and looks too much to the wheels for attitude  behavior. Pulling back hard on the stick just before you reach takeoff speed usually takes the load off of front gears entirely and puts a bit back on the rear and that helps me out.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-27T16:10:18Z\u0022 title=\u002206/27/2016 04:10  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 27, 2016\u003C/time\u003E by FyunchClick\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"}]}