{"TopicId":142820,"ForumId":16,"TopicTitle":"Aerobraking damage (not heat related)","CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2016-06-30T02:05:22Z","PageNum":1,"Articles":[{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2016-06-30T02:05:22Z","Content":"\n\u003Cp\u003E\nI just sent an Ike mining ship through a Duna aerobrake to slow down on the way from Kerbin to its destination.  My periapsis was about 19km.   Before hitting the atmosphere, I retracted all of my Gigantor solar panels, but extended my medium thermal control system radiators.  My thinking was this would increase drag and help funnel away heat from the hottest parts.  I thought the aerobrake went very, as I did not see any temps over 1200 or so, and that was for the stuff facing into the wind, like my landing legs and engine.  But then (of course, right after quicksaving) I noted that all of my radiators, and one of my Gigantors, were \u0022broken,\u0022 like what happens if you collide with something else.  I can verify there were no visual explosions, and the flight log did not say \u0022radiator exploded due to overheating\u0022 or whatnot.  Nor did I hit anything, and there was nothing within a many-kilometer radius to hit.  \n\u003C/p\u003E\n\u003Cp\u003E\nIs this a bug or part of normal gameplay?  In real life, I get that if you had a flimsy radiator panel sticking while plowing through the atmosphere at 1500 m/s, it would just snap off due to the force of the wind.  But I did not know KSP modeled that kind of thing, apart from the heat of reentry. And even then, I\u0027m unclear why a retracted Gigantor would have been hit with enough force to snap it off.   \n\u003C/p\u003E\n\u003Cp\u003E\nI did a little physics warp on my way up after temps started dropping, so I suppose that could have caused some weirdness.  \n\u003C/p\u003E\n\u003Cp\u003E\nThanks for any thoughts!\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-30T06:24:27Z","Content":"\n\u003Cp\u003E\nThe game does model dynamic air pressure. And I don\u0027t think it gives you a message when something snaps because of it.\n\u003C/p\u003E\n\u003Cp\u003E\nI occasionally do a gigantor test. I have one mounted on a little slow jet. I get the jet into the air at 50 m/s and extend the gigantor. Then accelerate until the gigantor snaps off (usually around 85 m/s IIRC). Anyway, it doesn\u0027t explode, and I don\u0027t recall ever seeing a message of any sort.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"the_Demongod","CreatedById":150124,"CreatedDateTime":"2016-06-30T06:42:01Z","Content":"\n\u003Cp\u003E\nYeah like he said, many flimsy parts will break under aerodynamic stress. This includes radiators, solar panels, and some antennas (I think... either they already do or it\u0027s a planned feature). The part usually says \u0022Snaps under high dynamic pressure\u0022 in the editor if it\u0027s susceptible to this.\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2016-06-30T15:15:13Z","Content":"\n\u003Cp\u003E\nThanks guys.  But do you think this would be enough to break a retracted Gigantor as well?  I guess I could try to occlude them better, but this was not a real extreme aerorake (engine assisted, apoapsis only brought down to about Ike altitude), so it seems surprising that would be enough to break your retracted equipment.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-30T16:19:53Z\u0022 title=\u002206/30/2016 04:19  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 30, 2016\u003C/time\u003E by Aegolius13\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-06-30T16:22:29Z","Content":"\n\u003Cp\u003E\nThat\u0027s the thing that bothers me about what you said. AFAIK, you can\u0027t break a retracted gigantor without an impact. I may be wrong about that, of course -- but it\u0027s certainly never happened to me, and you have to be able to launch them from Kerbin. So they have to be able to take a couple km per second in a thickish atmosphere. Do you have it mounted with the pointy end aimed lengthwise? So something buggy may have happened.\n\u003C/p\u003E\n\u003Cp\u003E\nOr perhaps one of your radiators may have taken out the gigantor when the radiator snapped off? Were any of them in front of the gigantor?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-06-30T16:23:34Z\u0022 title=\u002206/30/2016 04:23  PM\u0022 data-short=\u00228 yr\u0022\u003EJune 30, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2016-06-30T16:32:34Z","Content":"\n\u003Cp\u003E\nSounds like you either need a wider heat-shield than your craft and keep it pointed into the atmosphere, or you need to leave your fairing on until after your aerobraking maneuver (just keep a battery and a small 1x6 solar panel on the fairing base for transit).\u003Cbr\u003E\u003Cbr\u003E\nI\u0027ve never had a gigantor shear off on me when it\u0027s retracted, but I have had those static panels shear off if I\u0027m going stupid fast inside atmospheres so it\u0027s not surprising that the same can be said for the gigantors.\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2016-06-30T16:34:23Z","Content":"\n\u003Cp\u003E\nYep, solar panels were placed with long end lengthwise.  I too have definitely put retracted Gigantors through worse on Kerbin landings / aerobrakes, so would be surprised if aero forces alone broke it.  \n\u003C/p\u003E\n\u003Cp\u003E\nYour idea about radiator shrapnel sounds plausible - the radiators are below the solar panels on my ship, so were positioned in front of the solar panels as I aerobraked with my ship pointed retrograde. \n\u003C/p\u003E\n\u003Cp\u003E\nThat said, I\u0027ve had some weird things happen on Duna.  Like one of the retractable 1x6 solar panels on my lander broke during landing a few days ago, even though it was retracted from orbit to the ground.  \n\u003C/p\u003E\n\u003Cp\u003E\nIn any event, I took the easy way out and fixed it in the savegame editor.  \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}