{"TopicId":142945,"ForumId":16,"TopicTitle":"I can\u0026#039;t get to Minmus","CreatedByName":"phantom000","CreatedById":160599,"CreatedDateTime":"2016-07-02T00:17:32Z","PageNum":1,"Articles":[{"CreatedByName":"phantom000","CreatedById":160599,"CreatedDateTime":"2016-07-02T00:17:32Z","Content":"\n\u003Cp\u003E\nI got there once but i can\u0027t seem to get back. It\u0027s navigation. I can get to Minmus orbit just fine but getting into Minmus gravity is something else. When i set up a maneuver node i can never get it to show \u0027Minmus Encounter\u0027 am i doing something wrong or is this some kind of bug?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-07-02T01:51:37Z","Content":"\n\u003Cp\u003E\nNo, I\u0027m afraid you are doing something wrong. Do you want to figure out how to get a maneuver node set properly? Or do you just want to get there? It\u0027s pretty easy to get there without using a maneuver node.\n\u003C/p\u003E\n\u003Cp\u003E\nPart of the problem with maneuver nodes is that Minmus is not in an equatorial orbit -- so if your ship is equatorial (which it almost certainly is) then you will usually miss Minmus by at least 2Mm, and you won\u0027t ever show an encounter. This is probably what is happening. One answer is to set Minmus as your target, and then set the maneuver node so that you are as close as you can reasonably get, then do the burn, and then after that burn north or south to get your \u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E into Minmus\u0027 orbital plane.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is also possible to add the normal/antinormal bit into the maneuver node itself, and then you will see an encounter. It is also possible to get close with the first maneuver node, and then put a second maneuver node on your projected flightpath, with the small normal/antinormal burn in it.\n\u003C/p\u003E\n\u003Cp\u003E\nOr, you could waste a whole bunch of fuel and adjust your ascending/descending nodes to match Minmus first, and then set your maneuver node like you normally do.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you just want to go there, then launch straight up when \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003E\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E is 30 to 45 degrees ahead of Minmus. Get your \u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E up to 44Mm or so, burn north or south to adjust to Minmus\u0027 orbital plane, and then add just enough prograde to get an encounter.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-02T02:00:53Z\u0022 title=\u002207/02/2016 02:00  AM\u0022 data-short=\u00228 yr\u0022\u003EJuly 2, 2016\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CSE","CreatedById":145588,"CreatedDateTime":"2016-07-02T13:34:20Z","Content":"\n\u003Cp\u003E\nI think the easiest way is to launch into an equatorial orbit just as for going to the Mün. Target Minmus and perform a prograde burn with the closest approach you can get. This will take you out to Minmus\u0027 orbital distance just as you have been doing. In the map view, your orbital path will take you above or below Minmus, which is why your closest approach doesn\u0027t make an encounter.\n\u003C/p\u003E\n\u003Cp\u003E\nNow put a new node on your path about half-way to Minmus. Burn normal or anti-nomal (up or down when you\u0027re looking at your orbit as horizontal) at this point to give you a course correction that is so cheap in propellant / \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E\u003C/abbr\u003E that it normally doesn\u0027t affect mission planning at all.\n\u003C/p\u003E\n\u003Cp\u003E\nThis isn\u0027t quite as efficient as launching straight into the correct plane and burning all the way to Minmus encounter before you\u0027ve left Kerbin\u0027s atmosphere. But it\u0027s close - much more efficient than trying to match planes in low Kerbin orbit or correcting at the last minute as you fly past your goal. And it lets you do one thing at once: launch east; circularize east; burn prograde from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003E\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E\u003C/abbr\u003E; burn normal from half-way.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-02T13:40:07Z\u0022 title=\u002207/02/2016 01:40  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 2, 2016\u003C/time\u003E by CSE\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vaporized Steel","CreatedById":108520,"CreatedDateTime":"2016-07-03T16:11:47Z","Content":"\n\u003Cp\u003E\nI always go 90degrees orbit. The I open map view. Then I zoom out and change camera orientation that my blue orbit line becomes straight by camera angling exactly parallel to the vessels orbit. \n\u003C/p\u003E\n\u003Cp\u003E\nThen I zoom out and keep rotating the camera. I do this by keeping the camera parallel to my vessels orbit until minmus orbit line also becomes parralel to my vessels orbit line.\n\u003C/p\u003E\n\u003Cp\u003E\nAt this point they cross. This is where I want to put a maneuver node. All I need to make sure is that minmus is one quarter orbit from this position which is the an/dn. You can easily eyeball this. \n\u003C/p\u003E\n"},{"CreatedByName":"Waxing_Kibbous","CreatedById":151611,"CreatedDateTime":"2016-07-03T20:04:11Z","Content":"\n\u003Cp\u003E\nHere is a video that may be helpful:\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ZZ5AvIHOSQg?start=367\u0026amp;feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Mjarf","CreatedById":16666,"CreatedDateTime":"2016-07-03T20:53:14Z","Content":"\n\u003Cp\u003E\nI usually enter a regular equatorial orbit around Kerbin 100km or so high, then set Minmus as target and match the orbital inclination. Once the orbital inclinations are parallel it\u0027s very easy to set up a maneuver node to get an encounter.\n\u003C/p\u003E\n"},{"CreatedByName":"FullMetalMachinist","CreatedById":156531,"CreatedDateTime":"2016-07-03T23:36:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222660010\u0022 data-ipsquote-contentid=\u0022142945\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467579194\u0022 data-ipsquote-userid=\u002216666\u0022 data-ipsquote-username=\u0022Mjarf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Mjarf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI usually enter a regular equatorial orbit around Kerbin 100km or so high, then set Minmus as target and match the orbital inclination. Once the orbital inclinations are parallel it\u0027s very easy to set up a maneuver node to get an encounter.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhile this is probably the simplest way to get to Minmus (and the easiest way to grasp the orbital mechanics involved), it\u0027s probably the \u003Cem\u003Eleast efficient\u003C/em\u003E way to do it in terms of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E. Inclination changes at low Kerbin orbit are \u003Cu\u003Ecrazy\u003C/u\u003E expensive. \n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s much more efficient to burn prograde to raise your AP to roughly Minmus\u0027 orbit, then make a mid-course burn that fixes your inclination and gets you an intercept at the same time. \n\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2016-07-05T01:49:45Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222657754\u0022 data-ipsquote-contentid=\u0022142945\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221467418652\u0022 data-ipsquote-userid=\u0022160599\u0022 data-ipsquote-username=\u0022phantom000\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/1/2016 at 7:17 PM, phantom000 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI got there once but i can\u0027t seem to get back. It\u0027s navigation. I can get to Minmus orbit just fine but getting into Minmus gravity is something else. When i set up a maneuver node i can never get it to show \u0027Minmus Encounter\u0027 am i doing something wrong or is this some kind of bug?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe trick to hitting Minmus encounters is to leave Kerbin orbit at either the ascending or descending node of Minmus relative to Kerbin..  What you do is launch into a low parking orbit at Kerbin, then set Minmus as your target.  This will show its ascending and descending nodes on your \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E orbit.  Then look where Minmus is.  It will be closer to 1 of those nodes or the other, and on its way to the next.  Create a maneuver node on the opposite node and pull prograde until your trajectory crosses Minmus\u0027 orbit near the node Minmus will reach next.  You should see a closest approach marker at this time.  Move the node forwards or backwards on your \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E orbit and adjust the burn as necessary in all directions EXCEPT normal \u002B/-.  The goal is to get an encounter pretty much at one of Minmus\u0027 nodes so that you don\u0027t need to change inclination.\n\u003C/p\u003E\n\u003Cp\u003E\nit could well be that getting this type of encounter sends you pretty far beyond Minmus\u0027 orbit nearly to the edge of Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E.  But no matter.  You\u0027re moving so slow out at Minmus that it really doesn\u0027t affect your capture burn even if you encounter it at about 90^ to its direction of travel..  \n\u003C/p\u003E\n"}]}