{"TopicId":143361,"ForumId":16,"TopicTitle":"Advice for a maned mission to Dunna","CreatedByName":"Nicholas Kerman","CreatedById":166034,"CreatedDateTime":"2016-07-08T14:02:58Z","PageNum":1,"Articles":[{"CreatedByName":"Nicholas Kerman","CreatedById":166034,"CreatedDateTime":"2016-07-08T14:02:58Z","Content":"\n\u003Cp\u003E\nSo I was looking for advice for a manned mission to Dunna, I thought perhaps I could launch two stages. 1 the landing module that would dock with 2 the main part this would consist of a mobile processing lab fuel and engine anyway I am saying this to ask if I\u0027m taking this game way to seriously and if their is an easy way to do a mission to do a mission to Dunna and return thank you! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"Mastikator","CreatedById":135309,"CreatedDateTime":"2016-07-08T14:12:56Z","Content":"\n\u003Cp\u003E\nYeah if you\u0027re bringing a mobile processing lab then it makes sense to have a detachable lander. Though, my advice would be to have 2 command modules on the landing craft, so that you get 2 sets of experiments. One loaded into each command module. One set is used in the mobile processing plant and another is brought home.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-07-08T14:19:27Z","Content":"\n\u003Cp\u003E\nMoving to Gameplay Questions.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I understand you correctly, you\u0027re planning on sending a Duna mission consisting of an orbiter and a lander.  The orbiter stays in orbit around Duna.  The lander goes down to the surface, then ascends and docks with the orbiter.  Yes?\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s a perfectly reasonable mission profile, and lots of folks do it that way, yes.  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIn terms of \u003Cem\u003E\u003Cu\u003Eengineering\u003C/u\u003E\u003C/em\u003E, going to Duna is not a lot harder than going to the Mun.  It doesn\u0027t need a huge amount more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E overall.  Duna has a higher escape velocity, which means you need more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to get off it than ascending from the Mun... but on the other hand, Duna has aerobraking available, so \u003Cem\u003E\u003Cu\u003Elanding\u003C/u\u003E\u003C/em\u003E is cheaper, which helps to balance that out.\n\u003C/p\u003E\n\u003Cp\u003E\nMy suggestion is to practice on the Mun first, get comfortable with it, make sure you can do the Mun easily and well.  Once you can do that, you\u0027re definitely ready for Duna.  Assuming that you\u0027re comfortable with the Mun already, things to know about going to Duna:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nNavigation is really important.  \u0022Needs only a little more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E than going to the Mun\u0022 is true only if you hit a good launch window.  So plan accordingly; my favorite tool for this is \u003Ca href=\u0022http://ksp.olex.biz\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz\u003C/a\u003E ... it\u0027ll tell you when to launch, in what direction, and how fast.\n\u003C/li\u003E\n\u003Cli\u003E\nPlan to aerobrake into orbit when you arrive at Duna, so you can save \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.  Design mission accordingly.  (Aerobraking is a lot easier at Duna than at Kerbin.)\n\u003C/li\u003E\n\u003Cli\u003E\nLander should take advantage of Duna\u0027s atmosphere.  There are various ways to handle Duna landing.  My personal favorite:  Put on drogue chutes (you\u0027ll almost definitely need them), then a \u003Cem\u003E\u003Cu\u003Esmall\u003C/u\u003E\u003C/em\u003E number of parachutes (enough to slow you to a few dozen m/s, don\u0027t try to slow to a safe landing speed, you\u0027d have to spam them), and use a brief burst of thrust from your engines just before touchdown to cushion the landing.\n\u003C/li\u003E\n\u003Cli\u003E\nBe aware that there\u0027s a \u003Cem\u003E\u003Cu\u003Ebig\u003C/u\u003E\u003C/em\u003E difference in atmosphere thickness with altitude.  Specifically, if you\u0027re relying on atmosphere to slow you down for landing, it\u0027s a whole lot harder in the highlands than the lowlands.  So you may find life easier if you try to land in the lowlands.\n\u003C/li\u003E\n\u003Cli\u003E\nIf you\u0027re planning on including a mining vessel for refueling, plan on visiting Ike.  It\u0027s a lot friendlier than Duna for this.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2016-07-08T16:43:34Z","Content":"\n\u003Cp\u003E\nBelow are some rough numbers for your Δv budget.  Note that these can vary depending on the specifics of the launch window and your skill at performing the maneuvers efficiently.\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch to Kerbin orbit:  3400 m/s\u003Cbr\u003E\nTrans-Duna injection:  1100 m/s\u003Cbr\u003E\nDuna orbit insertion:  600 m/s\u003Cbr\u003E\nDeorbit:  50 m/s\u003Cbr\u003E\nLanding:  100 m/s\u003Cbr\u003E\nLaunch to Duna orbit:  1400 m/s\u003Cbr\u003E\nRendezvous and docking:  150 m/s\u003Cbr\u003E\nTrans-Kerbin injection:  650 m/s\n\u003C/p\u003E\n\u003Cp\u003E\nIf you aerocapture at Duna, then you don\u0027t need the full 600 m/s for Duna orbit insertion, but it\u0027s not zero either.  Aerocapture will get you into some cockamamie orbit that will need to be refined to get into a nice stable orbit from which you can perform your landing.  You\u0027ll still need to budget something.  Landing is performed mostly with parachutes, as Snark described.  The 100 m/s budget is to perform a cushioning burn just before touchdown.  The budget for rendezvous and docking may or may not be needed depending on how the mission is designed.  I\u0027ve budgeted nothing for your arrival back at Kerbin; it is assumed you\u0027ll perform a direct reentry.  If not, you\u0027ll have to budget something for either Kerbin orbit insertion, or refinement of your orbit following Kerbin aerocapture.\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s assume we have a disposable launch vehicle that gives you the 3400 m/s needed to get to orbit and no more.  Therefore, your Duna vehicle must provide everything else, or about 4000 m/s.  That can easily be divided up into two stages.  I generally like to use one of two methods:\n\u003C/p\u003E\n\u003Cp\u003E\nStage 1 = 1100 m/s for trans-Duna injection \u002B 600 m/s for Duna orbit insertion = 1700 m/s (less if aerocapture is performed)\u003Cbr\u003E\nStage 2 = 50 m/s for deorbit \u002B 100 m/s for landing \u002B 1400 m/s for launch \u002B 650 m/s for trans-Kerbin injection = 2200 m/s\n\u003C/p\u003E\n\u003Cp\u003E\nor\n\u003C/p\u003E\n\u003Cp\u003E\nStage 1 = 1100 m/s for trans-Duna injection \u002B 600 m/s for Duna orbit insertion \u002B 650 m/s for trans-Kerbin injection = 2350 m/s (less if aerocapture is performed)\u003Cbr\u003E\nStage 2 = 50 m/s for deorbit \u002B 100 m/s for landing \u002B 1400 m/s for launch \u002B 150 m/s for rendezvous/docking = 1700 m/s\n\u003C/p\u003E\n\u003Cp\u003E\nThe first method is good for something like a simple \u0027plag a flag\u0027 mission.  You ditch stage 1 as soon as you reach Duna orbit and pack everything else you need into a single self-contained lander/return/reentry vehicle.  It a simple method that doesn\u0027t require any orbital rendezvous and docking.  Works well for a small-scale mission.\n\u003C/p\u003E\n\u003Cp\u003E\nThe second method is as you described, where the lander includes only what is needed to land and get back up to an orbiting mother vehicle.  This is good if you want to place some heavy components in orbit that don\u0027t need to go down to the surface, such as a science lab.  It is a bit more complex because of the need to perform a rendezvous and docking.  One of the questions here is whether you have one pod or two.  That is, is the lander pod separate from the return/reentry pod?  The Apollo moon missions used two pods, but you could do it with a single multi-function pod.  Just beware that if you abandon the orbiting module during landing that you include a probe core to control it while it is unmanned.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that in the second case, designing your vehicle to produce the correct Δv can be more challenging because of the complex staging.  For example, Stage 1 will perform TDI and DOI with a fully fuelled lander attached, while TKI will be performed with no lander, or a fuel-depleted lander.  You can\u0027t always trust what the Δv readouts say (assuming you\u0027re using \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003E\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E or MechJeb).  You really need to think through all the staging steps, and it may be necessary to perform some of the Δv calculations by hand.\n\u003C/p\u003E\n\u003Cp\u003E\nNote that it\u0027s possible to transfer some or all of the rendezvous/docking budget from the lander to the orbiter.  It is common practice to make the orbiting ship the passive vehicle and the ascending ship the active vehicle, but you don\u0027t have to do it that way.  For instance, if you don\u0027t want to pack \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E into your lander, you can always just have it attain a stable orbit and then have the mothership come get it.  Or you could have one ship perform rendezvous and docking, while the other performs any necessary plane change (assuming some launch error).  My budget includes 50 m/s (plus \u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003E\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\u003C/abbr\u003E\u003C/abbr\u003E) for rendezvous and docking, and 100 m/s for plane change (which is enough to perform up to about a 6-7 degree plane change).\n\u003C/p\u003E\n\u003Cp\u003E\nI also recommend adding some Δv margin to play it safe.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-08T23:25:48Z\u0022 title=\u002207/08/2016 11:25  PM\u0022 data-short=\u00228 yr\u0022\u003EJuly 8, 2016\u003C/time\u003E by OhioBob\u003C/strong\u003E\n\u003C/span\u003E\n"}]}