{"TopicId":143649,"ForumId":16,"TopicTitle":"Just what are Kerbals made of that they\u0026#039;re so tough??","CreatedByName":"Loren Pechtel","CreatedById":157006,"CreatedDateTime":"2016-07-12T19:32:34Z","PageNum":1,"Articles":[{"CreatedByName":"Loren Pechtel","CreatedById":157006,"CreatedDateTime":"2016-07-12T19:32:34Z","Content":"\n\u003Cp\u003E\nRescue a Kerbal on Minmus.  I\u0027ve got a leftover science craft in Minmus orbit, I refuel it and send it down and the comedy begins.\n\u003C/p\u003E\n\u003Cp\u003E\nUnfortunately, she\u0027s on a steep slope.  My lander lands and begins sliding down the slope at about 1 m/s.  I switch to her and give chase.  I use her jetpack to get close and then try to run around in front of it (it\u0027s sliding down with the door in front) and then use the jetpack to jump up.  This doesn\u0027t work very well and my jetpack keeps shutting down even though I didn\u0027t actually get a grip on the rocket.  The physics model has a problem here and throws me aside multiple times, the last time throwing me \u003Cstrong\u003Ethrough\u003C/strong\u003E the rocket and bouncing off the ground just in front of a landing leg.  She\u0027s fine, the leg goes boom.\n\u003C/p\u003E\n\u003Cp\u003E\nReload, I decide to see what the lander will do.  As I write this it\u0027s skiing down the lowlands of Minmus.  I can see flat terrain ahead, it\u0027s going to have to stop sometime.  I\u0027m 1.7km from touchdown.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:  I came back to find it basically at rest more than 4km from the initial landing point.  I was skiing on lowlands, I\u0027m stationary on slopes?!?!?!  (And it turns out I\u0027m not stationary--I got the Kerbal, came back and it\u0027s sliding at a quarter of a m/s.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-07-12T20:57:38Z\u0022 title=\u002207/12/2016 08:57  PM\u0022 data-short=\u00227 yr\u0022\u003EJuly 12, 2016\u003C/time\u003E by Loren Pechtel\u003C/strong\u003E\n\u003C/span\u003E\n"}]}