{"TopicId":14397,"ForumId":16,"TopicTitle":"How can I improve my rover design?","CreatedByName":"joecool280","CreatedById":1632,"CreatedDateTime":"2012-07-15T21:03:14Z","PageNum":1,"Articles":[{"CreatedByName":"joecool280","CreatedById":1632,"CreatedDateTime":"2012-07-15T21:03:14Z","Content":"\n\u003Cp\u003EI designed this rover, that I hope to eventually drive around on the Moon/Minmus in future updates, and at the moment want to use it to explore Kerbin. I am a little worried about it\\\u0027s speed and handling though, on flat ground, trying to turn at over 35m/s will often cause it to flip over, on rough ground it seems to flip over at around 20m/s. It\\\u0027s fine for pottering around the Space centre, but trying to get to the mountains in the distance takes a lot of careful, patient control. It is EXTREMELY frustrating when after spending half an hour travelling in a desired direction, only to a hit a lump, flip and crash...\u003C/p\u003E\n"},{"CreatedByName":"Trekkin","CreatedById":23636,"CreatedDateTime":"2012-07-15T22:06:35Z","Content":"\n\u003Cp\u003EFirstly, hello and welcome and all that.\u003C/p\u003E\u003Cp\u003ESecondly, more people trust your posted .craft files if you add pictures of the craft in your post. it\\\u0027s easier to believe it isn\\\u0027t a virus that way, and usually the problems with the craft can be diagnosed visually.\u003C/p\u003E\u003Cp\u003EThat said, your design suffers somewhat from a high center of gravity, and from having the wheels too far back. Flipping the forward gear around 180 degrees will help, as will orienting them orthagonally to the canards and moving the canards up.\u003C/p\u003E\n"},{"CreatedByName":"mixinghoney","CreatedById":2266,"CreatedDateTime":"2012-07-15T23:54:14Z","Content":"\n\u003Cp\u003ECan\\\u0027t you just put a picture? \u003C/p\u003E\n"},{"CreatedByName":"rkman","CreatedById":15721,"CreatedDateTime":"2012-07-16T00:28:21Z","Content":"\n\u003Cp\u003ECarts are very prone to flipping over, even if the center of mass is low to the ground (although that certainly helps).\u003C/p\u003E\u003Cp\u003ETo make a cart safer to drive you can edit some cfg parameters:\u003C/p\u003E\u003Cp\u003Ereduce maxSteerAngle \u003C/p\u003E\u003Cp\u003Ereduce steerLimitSpeed \u003C/p\u003E\u003Cp\u003Eincrease steerSpeedFalloff\u003C/p\u003E\u003Cp\u003Eto reduce top speed (also reduces acceleration):\u003C/p\u003E\u003Cp\u003Ereduce forwardTorque \u003C/p\u003E\u003Cp\u003Eincrease frictionTorque \u003C/p\u003E\u003Cp\u003E\\\u0027cheat\\\u0027:\u003C/p\u003E\u003Cp\u003Etinker with compensationSpeed\u003C/p\u003E\n"},{"CreatedByName":"DomAzaris1996","CreatedById":25990,"CreatedDateTime":"2012-07-16T07:57:10Z","Content":"\n\u003Cp\u003EFirst thing is a longer rover will be harder to flip, although it is harder to land in the first place..\u003C/p\u003E\u003Cp\u003EOne thing you could do is put the front wheels backwards (with the WASDQE keys), to increase your base of support \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"joecool280","CreatedById":1632,"CreatedDateTime":"2012-07-16T17:35:05Z","Content":"\n\u003Cp\u003EThank you all, and I apologise for the lack of picture, I will remember next time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}