{"TopicId":14576,"ForumId":16,"TopicTitle":"Increasing Stability - Tension-Compression Structure and Mass Damping","CreatedByName":"CrashnBurn","CreatedById":32280,"CreatedDateTime":"2012-07-18T19:05:26Z","PageNum":1,"Articles":[{"CreatedByName":"CrashnBurn","CreatedById":32280,"CreatedDateTime":"2012-07-18T19:05:26Z","Content":"\n\u003Cp\u003EAfter watching the wobblies on my large boosters, I decided to apply some common structural engineering principles to increase rigidity and also to stabilize the vehicle.\u003C/p\u003E\u003Cp\u003EFirst I designed a tension-compression structure to increase rigidity. As there is no way to pre-tension a design in KSP, I decided to use the engine thrust to create the required structural load. This worked beautifully and allowed for a much lighter design. You can watch the structure load and unload as you turn the thrust on and off.\u003C/p\u003E\u003Cp\u003EHowever, there was still a good bit of wobble as I got to extreme vehicle heights. So I added a mass-damper, using the observation that the struts will act like springs (you can see them change length as they load and unload). I added a long \u0027pendulum\u0027 mass (as tall as the vehicle), connected at the top of the Tension-Compression structure by structural pylons (little flex) and at the extreme bottom by 4 struts (lots of flex).\u003C/p\u003E\u003Cp\u003EThis addition completely eliminated wobble, even when adding a lot of height and putting the control surfaces and SAS at the extreme ends of the vehicle to try and create instability.\u003C/p\u003E\u003Cp\u003ETesting with Mechjeb (to stay more consistent between flights) the design maintains consistent stability and rigidity as height increases. I stopped testing at a dozen tanks in the stack, I know, how un-Kerbal of me not to test to failure...but I think you will agree that the vehicle looks quite Kerbalesque, anyway.\u003C/p\u003E\u003Cp\u003EThe craft files requires the Mechjeb plugin.\u003C/p\u003E\u003Cp\u003EThe first pic and craft file are of the 12-stack tension structure without the mass damper.\u003C/p\u003E\u003Cp\u003EThis gets to a 200Km circular orbit easily with plenty of gas to play around or go to the Mun. But expect a bit of wobble.\u003C/p\u003E\u003Cp\u003ENext Pic and craft file are a shorter model of the same thrust- tensioned structure using the centrally-hung second stage as a pendulum-style mass damper.\u003C/p\u003E\u003Cp\u003EJust a fast \u0027first try\u0027 at it, I\\\u0027m sure it can be refined, but it works well as a proof of concept.\u003C/p\u003E\n"},{"CreatedByName":"Bluejayek","CreatedById":18471,"CreatedDateTime":"2012-07-18T23:52:04Z","Content":"\n\u003Cp\u003EWow, very kerbal craft, I like it.\u003C/p\u003E\u003Cp\u003EWelcome to the forums! Very good entrance post \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"CrashnBurn","CreatedById":32280,"CreatedDateTime":"2012-07-19T02:23:40Z","Content":"\n\u003Cp\u003EThanks Bluejayek. I like to make an entrance. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\\\u0027m still new at this, but I\\\u0027ll be sure to add to the fun, here. Seems like a great community.\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2012-07-19T15:14:13Z","Content":"\n\u003Cp\u003EAh, you designed a mass damper similar to the one used in the Tapei 101?\u003C/p\u003E\n"},{"CreatedByName":"CrashnBurn","CreatedById":32280,"CreatedDateTime":"2012-07-19T18:04:38Z","Content":"\n\u003Cp\u003EHi Khrissette, yep, you\\\u0027re right. I didn\\\u0027t know if it would work in the KSP game physics, but apparently it does. Using the second stage to damp the sway of the initial launch and climb costs very little in additional mass. It could possibly be a net improvement in total mass if less stabilizing equipment is required.\u003C/p\u003E\u003Cp\u003EEven if it didn\\\u0027t work, it\\\u0027s still quite a Kerbal solution. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"antbin","CreatedById":22389,"CreatedDateTime":"2012-07-23T21:14:04Z","Content":"\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/wIyT3JTBdco?start=212\u0026amp;feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"CrashnBurn","CreatedById":32280,"CreatedDateTime":"2012-07-27T20:06:16Z","Content":"\n\u003Cp\u003EThis mass damper design will work now with the new larger parts in .16 if you use my part.cfg edit for the decouplers. \u003C/p\u003E\n"}]}