{"TopicId":14741,"ForumId":16,"TopicTitle":"Hotkey to Alternate Hat Switch Between RCS and Camera Control","CreatedByName":"Sky Visitor","CreatedById":32304,"CreatedDateTime":"2012-07-20T22:02:51Z","PageNum":1,"Articles":[{"CreatedByName":"Sky Visitor","CreatedById":32304,"CreatedDateTime":"2012-07-20T22:02:51Z","Content":"\n\u003Cp\u003ESo after getting my new joystick, the T-Flight Hotas X, I wanted to go completely keyboard free. I like to move the camera around a lot when I am flying, and obviously the best place to map control of this to is the hat switch. However, this is also the best place to map RCS in my opinion, and KSP does not have a keybind to toggle between using the hat switch for different functions.\u003C/p\u003E\u003Cp\u003EThis method will allow you to use the hat for RCS, and then when pressing another button and moving the hat, make that move the camera. This frees up a lot of buttons on your joystick if you were using those for camera/RCS, or allows you to go completely keyboard free if you were still using keys for either of those functions. \u003C/p\u003E\u003Cp\u003EHow to:\u003C/p\u003E\u003Cp\u003E1. Download \u0027Joytokey\u0027 program here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.electracode.com/4/joy2key/JoyToKey%20English%20Version.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.electracode.com/4/joy2key/JoyToKey%20English%20Version.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E2. Extract and run the program.\u003C/p\u003E\u003Cp\u003E3. There is already a configuration made for you, called \u0027First Configuration\u0027. Above the key-mappings you will see \u0027Joystick 1\u0027 and \u0027Joystick 2\u0027 tabs. \u003C/p\u003E\u003Cp\u003E4. Go into the Joystick 1 tab. Click the \u0027Others\u0027 tab on the right and put a checkmark in the \u0027Use POV switches\u0027 box.\u003C/p\u003E\u003Cp\u003E5.Find which button you want to hold down while moving the hatswitch to control the camera. I chose \u0027Button 1\u0027 which on my joystick is the trigger. Double click it, and go to the \u0027Special\u0027 tab and select to use the configuration of Joystick 2 temporarily. Hit OK and leave everything else alone in this tab.\u003C/p\u003E\u003Cp\u003E5. Move to the \u0027Joystick 2\u0027 tab. Again, go to the \u0027Others\u0027 tab and check the \u0027Use POV Switches\u0027 box.\u003C/p\u003E\u003Cp\u003E6. Find the \u0027POV1:Up\u0027 in the list of buttons. Highlight it, and at the bottom click \u0027Auto Setting Wizard\u0027. For the \u0027Up\u0027 one, hit the up arrow, etc. for all 4 directions.\u003C/p\u003E\u003Cp\u003ENOTE: If you have changed the keys which control your camera movement in KSP from these defaults, you must press whatever keys you use. If you haven\\\u0027t changed the default camera pans, ignore this note.\u003C/p\u003E\u003Cp\u003E7. After you do those 4 directions just close out of the setting wizard (not the whole program).\u003C/p\u003E\u003Cp\u003E8. In KSP, make sure you have mapped RCS control to the hat switch.\u003C/p\u003E\u003Cp\u003E9. Now when Joytokey is running and you hold the button you have set to use the configuration of \u0027Joystick 2\u0027 while moving the hat, you will be able to move the camera in 8 directions. When not holding that button and moving the hat, you will use RCS!\u003C/p\u003E\u003Cp\u003E10. Just make sure to start Joytokey before you start KSP.\u003C/p\u003E\u003Cp\u003ENote: The Logitech Attack 3 does not have a hat switch, but you can get this to work with the buttons on top of it. I do not own that joystick, but the setup method will be similar, just don\\\u0027t \u0027Enable POV Switches\u0027 on Joystick 2 and instead map the buttons on top to the arrow keys.\u003C/p\u003E\u003Cp\u003EEnjoy, and safe flying!\u003C/p\u003E\u003Cp\u003ESky Visitor\u003C/p\u003E\n"},{"CreatedByName":"T-Bouw","CreatedById":21500,"CreatedDateTime":"2012-07-25T10:11:34Z","Content":"\n\u003Cp\u003EI\\\u0027m a joystick-afficondo as well (always short on buttons) and have used JoyToKey before, but I never new about such a function.\u003C/p\u003E\u003Cp\u003EI\\\u0027ll go look for it or download a newer version.\u003C/p\u003E\u003Cp\u003EThanks for the tip!\u003C/p\u003E\n"}]}