{"TopicId":14753,"ForumId":16,"TopicTitle":"Renaming parts - Will it break my unlaunched ships and/or the ones already out?","CreatedByName":"wildkittyv1","CreatedById":30893,"CreatedDateTime":"2012-07-21T03:21:28Z","PageNum":1,"Articles":[{"CreatedByName":"wildkittyv1","CreatedById":30893,"CreatedDateTime":"2012-07-21T03:21:28Z","Content":"\n\u003Cp\u003EYeah, basically at this point I have a lot of parts and mods installed and would like to rename some of the parts in order to put them in better order to keep things more organized and easier to find.\u003C/p\u003E\u003Cp\u003EI\\\u0027m just wondering if this will break the craft I have built but not launched, and if it will also break the ones I have flying. Does the game call for the name of the part in its config when looking for it, or is it some other type of unlisted ID? I figure this is going to break stuff since I don\\\u0027t really see anything else in the part configs that the game would use as a reference except for their names.\u003C/p\u003E\u003Cp\u003EIf this is the case, is there any way to work around it?\u003C/p\u003E\u003Cp\u003EThanks in advance.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2012-07-21T12:13:06Z","Content":"\n\u003Cp\u003EChanging the folder names won\\\u0027t break your spacecraft\u003C/p\u003E\u003Cp\u003EChanging the \u003Cstrong\u003Etitle =\u003C/strong\u003E parameter in the part.cfg file won\\\u0027t break your spacecraft; it will just alter the title in the description in the VAB/SPH.\u003C/p\u003E\u003Cp\u003EChanging the \u003Cstrong\u003Ename =\u003C/strong\u003E parameter in the part.cfg file will break existing and saved spacecraft.\u003C/p\u003E\n"},{"CreatedByName":"wildkittyv1","CreatedById":30893,"CreatedDateTime":"2012-07-21T15:58:29Z","Content":"\n\u003Cp\u003EYeah, I did some poking around in the craft files last night after making that post and found what they call for when figuring out which parts to use.\u003C/p\u003E\u003Cp\u003EI guess my question now would be if they are organized by the part name (the one you would have to edit that would break them) or are they organized by the folder names?\u003C/p\u003E\u003Cp\u003EIf it\\\u0027s just the folder names then it\\\u0027s a pretty easy task of organizing, but if they\\\u0027re organized by part name then I\\\u0027m wondering if I can rename the part names in the craft files to match what I change them to to avoid breakage (this would be more tedious and require double/triple checking to ensure some of my more complex ships don\\\u0027t break). I do realize that each part also lists the parts it\\\u0027s connected to, so I would be responsible for changing more than just a few instances of the part name on each craft.\u003C/p\u003E\u003Cp\u003EFor now, I suppose I could just do with renaming the part descriptions, as it\\\u0027s mostly some adapters and parts that don\\\u0027t exactly spell out their size in their name/description. But yeah, I need to find out if its the folder order or the part name which decides their listing in the parts list.\u003C/p\u003E\u003Cp\u003EAnd thanks for your help here and in my Mun base thread. I\\\u0027m going to be fiddling with that today and try to stabilize my Munar base. Most of this is probably thinking outloud, as I could just really test it with some parts I\\\u0027ve never used and see what happens. I\\\u0027ll probably have my own answer before you respond, but any additional knowledge is always appreciated.\u003C/p\u003E\u003Cp\u003EThanks again \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: Seems I answered my own question with a bit of fiddling. It looks like renaming the folders will change their positions in the parts lists, so that pretty much nullifies all the questions I asked above. Now, I just have to take on the task of organizing a good 400 parts with new folder names while making sure I know which packs they\\\u0027re from and keeping them grouped - shouldn\\\u0027t be -too- hard.\u003C/p\u003E\n"}]}