{"TopicId":14956,"ForumId":16,"TopicTitle":"0.16 Is even more challeng(er)ing","CreatedByName":"Captain Lou","CreatedById":419,"CreatedDateTime":"2012-07-23T23:18:46Z","PageNum":1,"Articles":[{"CreatedByName":"Captain Lou","CreatedById":419,"CreatedDateTime":"2012-07-23T23:18:46Z","Content":"\n\u003Cp\u003EWIththe new module, fuel anks and engines i\\\u0027m finding it harder to get into orbit.\u003C/p\u003E\u003Cp\u003ETwo main problems:\u003C/p\u003E\u003Cp\u003E1.) Rocket fails on launch pad. - Obviously the new patch has heavier components but still, what appears to be a good design will fail 20-305 of the time when set on the launch pad. What\\\u0027s puzzling is if its an issue like too much weight on a decoupler or something it should fail 100% of the time?\u003C/p\u003E\u003Cp\u003E2.) the other, more puzzling issue is when the rockets appear ok, launch ok , even separate a stage or two ok, then the rocket spontaneously explode. past causes for this were having SRBs burning next to a liquid fuel tank, or engines overheating, but according to the read outs engines are fine and no SRBS are being used.\u003C/p\u003E\u003Cp\u003EI don\\\u0027t have a specific design to show, but has anyone else found building a non-assploding rocket has gotten much tougher in 0.16? any tips / tricks to look for when building with the new command module and fuel tank/engine combinations?\u003C/p\u003E\n"},{"CreatedByName":"Sunlis","CreatedById":17853,"CreatedDateTime":"2012-07-23T23:34:24Z","Content":"\n\u003Cp\u003EI\\\u0027m not sure about the exploding problem, but they added a new Launch Clamp part that lets you hold you rocket off the launch pad and release it in a stage of your choosing, similar to a decoupler.\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2012-07-23T23:58:45Z","Content":"\n\u003Cp\u003EHave you tried using the launch assist struts to keep it off the ground?\u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-07-24T00:48:43Z","Content":"\n\u003Cp\u003EDo you use the large decouplers in your upper stages, and lots of thrust in the lower stages? Because in 0.16, the high thrust can crush the decoupler, destroying the craft.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2012-07-24T01:46:35Z","Content":"\n\u003Cp\u003EThat big decoupler needs to be a fair bit stronger -- simply rotating a craft in space can cause it to fail.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-24T04:55:30Z","Content":"\n\u003Cp\u003EIt\\\u0027s not just rockets. I built a little jet that disintegrated during its takeoff roll. It started bouncing around and then throwing parts in random directions. It didn\\\u0027t collide with anything or roll over and hit the ground, mind you: just shook itself apart, and \u003Cem\u003Ethen\u003C/em\u003E fell over and blew up. But it doesn\\\u0027t happen every time, either. \u003C/p\u003E\n"},{"CreatedByName":"tk5800thesecond","CreatedById":16577,"CreatedDateTime":"2012-07-24T04:58:58Z","Content":"\n\u003Cp\u003EThe Space Kraken is unhappy\u003C/p\u003E\n"},{"CreatedByName":"Jarnis","CreatedById":884,"CreatedDateTime":"2012-07-24T05:11:07Z","Content":"\n\u003Cp\u003EMore struts.\u003C/p\u003E\u003Cp\u003EAlso use 1M decouplers, they are stronger.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-07-24T06:12:23Z","Content":"\n\u003Cp\u003EI made it a little better by slightly increasing the deadzones on my joystick, but it\\\u0027s still a problem. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EMore struts. \u003C/div\u003E\u003C/blockquote\u003EBut struts won\\\u0027t stick to cockpits, which is what just fell off of my rocket car. :\\\u0027(\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2012-07-24T06:57:58Z","Content":"\n\u003Cp\u003EI think this issue may also be related to the collisions between parts of a same ship, which have been deactivated. My guess is that parts could press onto one another to help with stability, but now the only force to keep the rocket in one piece is that of the joints, which are entirely free to move and rotate, so I think they tend to break apart more often. What would be needed is to strengthen the joints (and the decoupler).\u003C/p\u003E\n"},{"CreatedByName":"Gabe_Ruckus","CreatedById":32373,"CreatedDateTime":"2012-07-24T08:29:23Z","Content":"\n\u003Cp\u003ESomehow, the new 3m couplers do give way under high thrust. I feel like it\\\u0027s got something to do with torque, because it seems to happen more as my tanks empty out. My lower stage will be on its last tank with that 1200 thrust engine, and then drive the whole lower stage into the top of my rocket. I\\\u0027ve yet to get to the Mun with the 3m parts, it\\\u0027s getting pretty frustrating now. \u003C/p\u003E\u003Cp\u003EOh, torque. Torque is the relationship between mass and force. Force is equal, but the mass of a stack of empty 3m tanks is WAY less than a stack of full tanks, and that means exponentially more torque as they empty out. That\\\u0027s my best guess to the problem.\u003C/p\u003E\n"},{"CreatedByName":"geb","CreatedById":5399,"CreatedDateTime":"2012-07-24T08:43:34Z","Content":"\n\u003Cp\u003EGabe - the word you\\\u0027re looking for is acceleration. Torque is something different.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E2.) the other, more puzzling issue is when the rockets appear ok, launch ok , even separate a stage or two ok, then the rocket spontaneously explode. past causes for this were having SRBs burning next to a liquid fuel tank, or engines overheating, but according to the read outs engines are fine and no SRBS are being used.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe mass of your rocket lowers as fuel is burned, but the engines keep providing the same thrust. That means that on empty tanks, you\\\u0027re accelerating much harder than you did at the start of the flight with full tanks.\u003C/p\u003E\u003Cp\u003EGetting more acceleration is great, but only if all your components can handle it. Higher acceleration puts greater compression or strain on all your bits.\u003C/p\u003E\u003Cp\u003EThere are two ways to solve it. Either add more struts or throttle down a bit when your fuel tanks are starting to run low.\u003C/p\u003E\n"},{"CreatedByName":"leopardenthusiast","CreatedById":26084,"CreatedDateTime":"2012-07-24T11:44:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI made it a little better by slightly increasing the deadzones on my joystick, but it\\\u0027s still a problem. But struts won\\\u0027t stick to cockpits, which is what just fell off of my rocket car. :\\\u0027(\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStruts DO stick to cockpits now, which is good given that my ASAS is a hat on top of my capsule and I put my parachute on top of that. And I\\\u0027m fairly sure plane cockpits have always allowed struts.\u003C/p\u003E\n"},{"CreatedByName":"Cryphonus","CreatedById":23502,"CreatedDateTime":"2012-07-24T13:39:00Z","Content":"\n\u003Cp\u003E[gmod]Not even remotely funny. -DR[/gmod]\u003C/p\u003E\n"},{"CreatedByName":"mrdest21","CreatedById":10441,"CreatedDateTime":"2012-07-24T15:42:56Z","Content":"\n\u003Cp\u003EI\\\u0027ve been having the same problems. I\\\u0027ve been good at rocket design in 0.15 and before, all vanilla parts. But in 0.16, I have yet to put a rocket into orbit, never mind on the mun. When my rockets reach the second stage of the atmosphere, my lower stages seem to break off and collide into the rest of the rocket, killing everyone. And that\\\u0027s in the best cases. The most common case is putting the rocket on the launch pad with cranes and all and having half the fuel tanks explode, yet leaving the rocket to wobble around on its remaining tanks.\u003C/p\u003E\u003Cp\u003EHow do you get to orbit if everything explodes because it\\\u0027s too big because it\\\u0027s carrying the fuel needed?\u003C/p\u003E\n"},{"CreatedByName":"Gabe_Ruckus","CreatedById":32373,"CreatedDateTime":"2012-07-24T16:11:28Z","Content":"\n\u003Cp\u003EI thought about force and acceleration as being the culprit too, but the increase in acceleration isn\\\u0027t THAT drastic as tanks empty out. The change in mass is much greater, and since F=M*A, there shouldn\\\u0027t be that much force. The whole rocket seems to sway all over the place with 3m parts, which combined with the thrust vectored heavy engine would send the force on the rocket in different directions from the actual direction of flight. That seems like it would treat the entire stage like a giant lever, and break the coupler or upper fuel tanks, those parts being under the most mechanical stress.\u003C/p\u003E\n"},{"CreatedByName":"Corax","CreatedById":11311,"CreatedDateTime":"2012-07-24T16:13:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mrdest21\u0022 data-cite=\u0022mrdest21\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EHow do you get to orbit if everything explodes because it\\\u0027s too big because it\\\u0027s carrying the fuel needed?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPractice, experiment, use the scientific method.\u003C/p\u003E\u003Cp\u003EWith the new parts, you have to basically relearn building rockets, but it\\\u0027s doable and once you get the hang, surprisingly simple.\u003C/p\u003E\u003Cp\u003EAlso, don\\\u0027t restrict your research to just the assembly side, but as others said, experiment during the flight, trying different throttle settings etc.\u003C/p\u003E\n"},{"CreatedByName":"CrashnBurn","CreatedById":32280,"CreatedDateTime":"2012-07-24T16:51:42Z","Content":"\n\u003Cp\u003EI agree that the new couplers are far too weak, but you can get a payload to the Mun with them, the problem is that you can\\\u0027t do it relying on Mechjeb, at least not alone. You have to experiment with each booster design and see where is wobbles and breaks and throttle down during those times. Keep the G\\\u0027s below 2.\u003C/p\u003E\u003Cp\u003EThe new parts take some of the fun out of the game unless you love to micromanage the launch. I can manually fly the new parts to orbit with some luck (the rockets still randomly explode about 25% of the time) and I can also get them to orbit if I turn off Mechjeb throttle and/or stage control at specific times of high stress on the booster. But it\\\u0027s a pain in the butt.\u003C/p\u003E\u003Cp\u003ESome new guidelines to try that worked for me:\u003C/p\u003E\u003Cp\u003E1.) No more than 3 large tanks stacked\u003C/p\u003E\u003Cp\u003E2.) Keep the rocket short (tall rockets with the new parts wobble and disintegrate) I put my second stage in the middle of my first stage instead of on top of it. Then brace the first stages together (see my how-to on mass damping for some ideas)\u003C/p\u003E\u003Cp\u003E3.) Place your control surfaces close/directly over to the radial decouplers to avoid torque on the decouplers from control inputs.\u003C/p\u003E\u003Cp\u003E4.) Place the radial decouplers near the middle of the stack height.\u003C/p\u003E\u003Cp\u003EHere is a pic of my Mun lander and the Booster that got it there, for reference. It uses the center stage as a mass damper, but still wobbles a bit due to the instability of the new parts. The same design is completely stable with old parts.\u003C/p\u003E\u003Cp\u003EThe center stage is held in place by only two of the new large radial decouplers with the two outer tanks connected together at the bottom with struts that pass by the narrow point of the center stage engine, allowing the center stack to swing freely on the radial decouplers.\u003C/p\u003E\n"},{"CreatedByName":"MaxMurder","CreatedById":11958,"CreatedDateTime":"2012-07-24T19:48:59Z","Content":"\n\u003Cp\u003EMax Q causes some epic failures...\u003C/p\u003E\u003Cp\u003EMake sure you throttle down once you get some altitude, or drag will break your rocket. \u003C/p\u003E\u003Cp\u003EMy strategy is once i am above 10000m i throttle down to the point where i am accelerating slowly, about 1-2m/s. Then once I am above the atmosphere i throttle back up. This keeps my rockets from exploding and is much easier on fuel.\u003C/p\u003E\n"},{"CreatedByName":"TheGripenSaidWhat?","CreatedById":23890,"CreatedDateTime":"2012-07-24T20:34:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MaxMurder\u0022 data-cite=\u0022MaxMurder\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMax Q causes some epic failures...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003ETHIS is probably the best explanation as to why even my most stable of rockets have a slight tendancy to blow up when getting around that 30,000~/45,000~ range. I don\\\u0027t remember seeing a more realistic simulation of drag and heat values in teh update changelog, so I figured this was a bug and was about to report it.\u003C/p\u003E\n"},{"CreatedByName":"mrdest21","CreatedById":10441,"CreatedDateTime":"2012-07-25T04:40:45Z","Content":"\n\u003Cp\u003EConnecting the radial decouplers in the middle of the parallel stacks has done wonders for me. I\\\u0027ve now gone to the moon and back.\u003C/p\u003E\u003Cp\u003ETwo weird things:\u003C/p\u003E\u003Cp\u003E1. when I hit launch on my new rocket, something explodes loudly in the bottom stage yet there seems to be no issue at all with missing parts or lost fuel.\u003C/p\u003E\u003Cp\u003E2. My lower rocket is 2 stages. 1 engine with 6 engines around it \u002B3 fuel tanks each is one, the other is 2 engines attached to each of the 6 with 2 tanks each. The plan is for the outer ring to run out, jettison and have the 7 engines then finish before the orbit stage. Yet, fuel seems to be travelling between the tanks. 6 of the 12 outer ring engines keep firing well after all of the other 13 engines are dead (even though those 6 engines and their matching 6 should have been empty minutes earlier), making the whole stages a bit awkward. Is there a known way for fuel to travel between tanks without any fuel lines between them?\u003C/p\u003E\n"},{"CreatedByName":"TheKerbinator","CreatedById":29261,"CreatedDateTime":"2012-07-25T09:20:43Z","Content":"\n\u003Cp\u003EI actually like the new game mechanics. To me, it makes sense that G forces actually have an influence on the rocket parts. In 0.15 you could spurt up with a can of boom and everything survived. Now you have to think about drag, acceleration and such.\u003C/p\u003E\u003Cp\u003EAlso, I really like the new explosions. Instead of everything exploding, now some parts survive and collide into each other, very cool!\u003C/p\u003E\u003Cp\u003EOn a side note, I\\\u0027ve been to the Mun two times now, even brought a rover there.\u003C/p\u003E\n"},{"CreatedByName":"Secular_Response","CreatedById":34080,"CreatedDateTime":"2012-07-29T03:42:55Z","Content":"\n\u003Cp\u003EI also like the increased difficulty of .16. It\\\u0027s much harder to even reach orbit, but it\\\u0027s great when you do.\u003C/p\u003E\u003Cp\u003EThere are a couple of things that get me into orbit now. One is using lots of struts. Even with the large decouplers, you can still improve their strength substantially by placing about three struts on each of the four inner... whatever they\\\u0027re called, there are four of them. Look down into the decoupler and put one in the center and one on each side, all leading up to the engine or wherever it will stick.\u003C/p\u003E\u003Cp\u003EAnother is using the throttle wisely. As other commenters have stated, you don\\\u0027t need to thrust at 100% all the way up. As soon as I reach around 200 m/s, I throttle down to keep it there. It still climbs fine, and eventually my throttle is quite low, yet the speed keeps climbing. Great way to extend the lifespan of the stage.\u003C/p\u003E\u003Cp\u003EYesterday I landed on the Mun twice. My rocket has the lander on top, followed by a tri-coupler and a stack of three tanks, three high. The bottom stage is the same as the second, a stack of three tanks, but four tanks high instead of three. I add radial decouplers and place three stacks of two of the largest tanks around the stage. Finally, I strut the hell out of the beast. It hasn\\\u0027t blown up on me yet.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://img36.imageshack.us/img36/7981/screenshot11fxc.png\u0022 alt=\u0022screenshot11fxc.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://img716.imageshack.us/img716/5511/screenshot12fv.png\u0022 alt=\u0022screenshot12fv.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://img824.imageshack.us/img824/5568/screenshot13xu.png\u0022 alt=\u0022screenshot13xu.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2012-07-29T04:18:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Secular_Response\u0022 data-cite=\u0022Secular_Response\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAnother is using the throttle wisely. As other commenters have stated, you don\\\u0027t need to thrust at 100% all the way up. As soon as I reach around 200 m/s, I throttle down to keep it there. It still climbs fine, and eventually my throttle is quite low, yet the speed keeps climbing. Great way to extend the lifespan of the stage.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you have a thrust to weight ratio of 2.2 or below, you should be at max throttle the whole way. Above 2.2, and you will have to throttle down a little during the ascent until you get to around 6km and then start slowly throttling up again.\u003C/p\u003E\n"},{"CreatedByName":"Ziff","CreatedById":27566,"CreatedDateTime":"2012-07-29T04:31:05Z","Content":"\n\u003Cp\u003EUse the new parts for a center main stage. Make the parallel / radial stages out of the old parts. 3 of those new engines is 3600 thrust or 18 of the old engines. Did you ever use 18 engines for an entire launch? Watch your G forces. After 9km you pick up a ton of G forces , if you\\\u0027re seeing 4 or 5 G\\\u0027s, its game over. Chances are, if youre using the new parts with the same old designs you are going to explode.\u003C/p\u003E\u003Cp\u003E-Ziff\u003C/p\u003E\n"}]}