{"TopicId":150200,"ForumId":16,"TopicTitle":"Career mode and science requirements","CreatedByName":"Saylorock93","CreatedById":163745,"CreatedDateTime":"2016-10-17T08:27:25Z","PageNum":1,"Articles":[{"CreatedByName":"Saylorock93","CreatedById":163745,"CreatedDateTime":"2016-10-17T08:27:25Z","Content":"\n\u003Cp\u003E\nHi guys, today i wanna say my opinion, and maybe ask for advices about the career mode. I have to say that in my 250h of gameplay i never played career until now, and i have to admit that is pretty intriguing. The progression feeling and actually building and planning to achieve a real mission (with rewards) and goals adds alot of spices to the game and i\u0027m happy of it. \u003Cbr\u003E\u003Cbr\u003E\nBUT\u003Cbr\u003E\u003Cbr\u003E\nOkay so, you start with few useless parts, it\u0027s nice to unlock the first five upgrades with few science points, but after that you find yourself with totally impossible tasks (unless building stupid ugly glitchy ships), i have to fly around passsengers, but i do not have spots for my planes, that can barely take off because lack of parts, obviously i won\u0027t put 4 pods to fit 4 passengers on the plane, i like the game to be at least 1% realistic. They ask me to try out 2,5m parts ahahah and i don\u0027t have even 2.5m fuel tanks. They asked me to explore di moon and i don\u0027t even have electricity.\u003Cbr\u003E\u003Cbr\u003E\nNow everyone will say: \u0022hey you stupid, just unlock everything\u0022. Sure, every stage now is 90 science. How many upgrades? I don\u0027t remember, 10? maybe less, it\u0027s 900 science. How can i make 900 science with going around with stupid vessels that ALSO looks incredibly ugly if they have to be functionals (because lack of parts). Few experiments around are like 10 science, less, i don\u0027t even have ladders and electricity to send back experiments and i have around 20 science now.\u003Cbr\u003E\nIt\u0027s seriously GRINDING and it\u0027s not fun.\u003Cbr\u003E\nReally you want me to walk all around \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E to gather science? WALKING? it would take hours, obviously i don\u0027t have wheels.\n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2016-10-17T09:07:32Z","Content":"\n\u003Cp\u003E\nYou need more science, I tend to focus on the lower part of the tree to get more science equipment. \u003Cbr\u003E\nPersonally i drop the flying tourists, do them later then they go orbital, anyway you need the MK1 passanger module to do tourist better.\u003Cbr\u003E\nYou also want to unlock eva early eva reports over various biomes give lots of science.\u003Cbr\u003E\u003Cbr\u003E\nOne tricks if you have base plane parts unlocked is to make an jet powered rover, think an plane without wings. drive around on the space center an collect science. \u003Cbr\u003E\nits stupid but it works. crew, eva report, goo and science lab, thermometer if you have it. use the MK1 rocket pod and use an scientist, this way he can collect data and restore the material lab and goo container. \u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Saylorock93","CreatedById":163745,"CreatedDateTime":"2016-10-17T09:15:06Z","Content":"\n\u003Cp\u003E\nthank you that could be a start\n\u003C/p\u003E\n"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2016-10-17T09:39:34Z","Content":"\n\u003Cp\u003E\nThe \u0022jet\u0022 science rover is actually pretty useful - you can gather around 300 points if you check all of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E biomes (default settings, no accelerometer, no gravioli).\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/AuMp4iM.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022AuMp4iM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nDo not forget you can collect the data and reset the instruments - you do not really need to carry around 100 thermometers.\n\u003C/p\u003E\n\u003Cp\u003E\nMun and Minmus are however the best places to farm for science - an early simple Mun landing (w/o terrain samples, single biome) can generate science in excess of 600 points.\n\u003C/p\u003E\n\u003Cp\u003E\nRequired techs are even less than what you need to build the jet rover.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022http://i.imgur.com/m8rb6qE.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022m8rb6qE.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIf by chance you are using Porkjet\u0027s part overhaul, the new 303 engine makes a Mun landing viable in the very early stages of a career (day 7).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBoth Mun and Minmus routes can be easily \u0022eyeballed\u0022 w/o maneuver nodes, you might find interesting strategies if you check the old @GoSlash27 \u0022caveman challenge\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nGood luck.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-10-17T09:43:11Z","Content":"\n\u003Cp\u003E\nYou don\u0027t need ladders (jetpacks work fine) and you don\u0027t need electricity to explore the Mun (Jeb and Val use very little electricity controlling a lander, and you\u0027ll have an alternator until you get to the final lander stage anyway). If in doubt, do a free return trajectory and just grab science from orbit. EVA in Mun orbit gives you new data for each biome you fly over.\n\u003C/p\u003E\n\u003Cp\u003E\nI never like to grind in career, so I never go running around \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to get 1.6 science here and 2.2 there. I don\u0027t do any \u0022observation\u0022 contracts either unless they\u0027re very very close. However, a very simple plane (cockpit, tail, elevators and twin junos, each on a single Mk0 tank) is good enough for the \u0022in flight\u0022 stuff within 50km of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you take a couple of suborbit tourist contracts, you also get the science on the ground wherever you land. Just make sure to vary your flightpath each time. So you get paid to explore a new biome.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can get to the Mun on 30 parts and 18t, with an effort. With a little more effort you can land on both the Mun and Minmus under the same conditions, especially now that you can do complex fuel routing without fuel ducts (you need the FL-T800 to cut the part count, but you can shave two parts off by not using ducts). And as soon as you get onto the surface of the Mun or Minmus, you can steam ahead in science (and suddenly find yourself building twice as big for a marginal improvement in capability... that\u0027s what career is very good at demonstating).\n\u003C/p\u003E\n"},{"CreatedByName":"Saylorock93","CreatedById":163745,"CreatedDateTime":"2016-10-17T11:24:51Z","Content":"\n\u003Cp\u003E\nthank you for the advices guys\n\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2016-10-17T14:40:46Z","Content":"\n\u003Cp\u003E\nYeah, as others have said, focus on getting a rocket capable of putting a (one, single, no need for more) Kerbal on the Mun (which also works for Minmus) and you\u0027re golden. You don\u0027t need electricity or batteries or solar panels, just simple legs and fuel and engines and scientific instruments... Once you get that going even if your craft is sub-par, you can land on all all biomes and suck that sience out.\n\u003C/p\u003E\n\u003Cp\u003E\nYou might want to spend some money on upgrading the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and launch pad first, thou.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nBTW, you might want to go unlocking stuff that will allow you to have satellite contracts. Those pay very well for the launch it self, but you\u0027ll then get contracts to preposition said satellites, which are essentially free money.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-17T14:48:51Z\u0022 title=\u002210/17/2016 02:48  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 17, 2016\u003C/time\u003E by Rosco P. Coltrane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"dangerhamster","CreatedById":146944,"CreatedDateTime":"2016-10-17T16:49:02Z","Content":"\n\u003Cp\u003E\nRegarding the \u0022test item X\u0022 contracts, as long as they say \u0022at the Launchpad\u0022 you don\u0027t need to build a proper vessel at all. For \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u0027s simply stick them below any control module, remove the fuel and stage when ready. Rocket engines ditto- no need for a fuel tank.\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-10-17T18:05:31Z","Content":"\n\u003Cp\u003E\ntry to get every last bit of science you can get from every launch.  there are alot of tricks you can do on the first 4-5 missions that will give you a real boost.\n\u003C/p\u003E\n\u003Cp\u003E\nyour first launch could have 4 goo cans, because if you build right(stach boosters ontop of eachother, when the next in line fires, itll just destroy the one under it lol no need for decouplers) youll be able to hit 4 biomes(launch pad, lower, upper atmo, and where you land),  youll be able to get 3 crew reports, and 3 eva reports.\n\u003C/p\u003E\n\u003Cp\u003E\nthen upgrade your kerbonaut complex so you can eva(while in flight).   and grab the science nodes for thermometer and barometer.  now youll be able to eva and pull results from those so you can get even more.  if your not ready for orbit, there is a lot you can get on a sub orbital flight since you can get 2 results from every biome from those tests, and another goo can from lower space.\n\u003C/p\u003E\n\u003Cp\u003E\nfor the 3rd flight you wanna see if you can unlock the materials bay,  as soon as its unlocked your next rocket should have 4 or 5 of them.  lol\n\u003C/p\u003E\n\u003Cp\u003E\n3 quick missions that should give a strong head start.\n\u003C/p\u003E\n\u003Cp\u003E\noh and don\u0027t forget that every biome has a low orbit biome for eva reports.  you can get like 6 with a 0 inclination orbit\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-10-17T21:16:38Z\u0022 title=\u002210/17/2016 09:16  PM\u0022 data-short=\u00227 yr\u0022\u003EOctober 17, 2016\u003C/time\u003E by DD_bwest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2016-10-18T01:02:04Z","Content":"\n\u003Cp\u003E\nSomething I don\u0027t believe anyone has mentioned:\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t HAVE to accept any particular contract.  Pay attention to the contract terms, and what you\u0027ll get paid for it.  Some of them are nearly impossible--ignore them and let them expire.  Others require a special dedicated craft/mission design and take substantial time to complete, but pay only pennies--ignore them and let them expire.\n\u003C/p\u003E\n\u003Cp\u003E\nThe early tourist contracts are among those \u0022not worth the effort\u0022 contracts, as you noted.  Many parts tests are likewise ridiculously difficult.  Others are basically \u0022free money and science\u0022.  I look for \u0022test decoupler at speed/altitude that I generally stage at anyway\u0022 or \u0022test parachute at speed/altitude ditto\u0022.  But \u0022test large part at 1500 m/sec at 3000 m altitude\u0022?  Pretend that offer just doesn\u0027t exist; it\u0027ll expire in a few days and be replaced with something that may be more to your liking.\n\u003C/p\u003E\n\u003Cp\u003E\nMy standard beginning to a new career is generally along the lines of: Go to Mission Control, accept \u0022Science from Kerbin\u0022 and \u0022Launch first vessel\u0022 contracts.  Go to \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E, get a Mk 1 capsule with a Kerbal onto the launch pad.  Get crew report.  Go EVA, get EVA report at launch pad. Put EVA report into capsule.  Go to physics warp x4 and run to the crawlerway: a matter of seconds.  Get that EVA report, run back to capsule. Recover.  *KA-CHING* as the first contract pays off.  Go to R\u0026amp;D, spend those points down the bottom line by preference, in order to get more science experiments.  Go to \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E, get a Mk1 capsule (rotate it so it stands up properly) and slap 2 goo containers on it.  Launch to runway, with Bob the scientist.  Run both goo experiments, and get a crew report from the runway.  Go EVA, get EVA report from runway, pull data from one goo container, reset and rerun goo.  Shove experiment results (EVA and 1 goo) into capsule.  Run (at physics warp x4) off the side of the runway to the flat ground just past it, grab an EVA report \u0022from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E\u0022, run back to capsule, recover.  Go back to R\u0026amp;D, spend that.  Repeat the Bob-in-capsule-plus-science-gear at the launch pad, because you haven\u0027t run goo there yet.  (Just run the goo, no need for crew report/EVA report, or running anyplace; you\u0027ve gotten all the nearby stuff now.)  Recover.  NOW, go back to the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E and put a Mk 1 pod onto a Flea, slap a couple goo cylinders on it, parachute on top, (I don\u0027t THINK you\u0027ll have the thermometer quite yet, I\u0027m working from memory and haven\u0027t memorized the new V1.2 science tree yet.)  Launch nearly vertical but a little bit EAST (ideally you come down on top of the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E for maximum science return, but there\u0027s still plenty of tasty science to be had if you come down on the crawlerway or general \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E grounds).  On your way down while hanging from the chute, get a crew report \u0022while flying\u0022, ONE goo, and a thermometer reading if you\u0027ve got it.  DO NOT RECOVER that craft yet!  Run the other goo container.  Get out of the craft (hang on!), pull out the crew report from the capsule, get an EVA report if you don\u0027t already have one for that biome, get back in, and get a fresh crew report \u0022landed at BIOME\u0022.  Get back into the pod and NOW you can recover. *KA-CHING!* as the 2nd contract pays off.  You will also pick up some cash and some science for an altitude record, yay.  Go spend that science; get the thermometer if you don\u0027t already have it, but now make sure you\u0027ve got some of the tech from the other branches:  soon enough, you\u0027ll be wanting the Thumper booster, steerable fins, radial decouplers, and the LV-909.  But you don\u0027t need it quite yet--since the next flight will be a capsule on a Hammer, launched east into the ocean.  More \u0022free money\u0022 for speed/altitude/distance records, possibly some additional \u0022flying over\u0022 science (certainly a thermometer reading, as it treats \u0022flying over water\u0022 as a new and different thing than the \u0022flying over shores\u0022 you got in the first flight).  Do the whole \u0022crew report/EVA report/goo/temperature\u0022 routine while \u0022splashed in water\u0022.  You\u0027ll be doing it again soon, but this time with a Thumper.  First though, check Mission Control to see if it\u0027s got new contract offers (I forget when it start offering more than the \u0022starting 4\u0022).  Take the \u0022escape the atmosphere\u0022 contract, and maybe something else if there\u0027s, say, a part test on offer for something quick and easy and profitable (especially if it\u0027s something you\u0027d be doing anyway - I am quite fond of \u0022test drogue chute\u0022 contracts for that very reason).\n\u003C/p\u003E\n\u003Cp\u003E\nTotal time elapsed, maybe an hour or so Kerbal time, but less than half that YOUR time (due to that physics warping while Jeb and Bob were running around at the beginning). \n\u003C/p\u003E\n\u003Cp\u003E\nAbout two more flights and you\u0027ll be in orbit, with upgraded Mission Control (for more contracts at once) and the Astronaut Complex (so you can EVA in space).  With the science from that first orbital mission, you\u0027ll want electrics and the Hecs probe core so you can get a couple of those tasty, lucrative \u0022unmanned satellite\u0022 contracts, which should give you the cash to upgrade the Launch Pad and/or \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E--which you\u0027ll need for Bob\u0027s (NOT JEB!) upcoming mission to Munar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd once you\u0027ve got a scientist with goo and a materials bay en route to Mun:  the whole Kerbal solar system opens up for you.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, something you don\u0027t really learn in Sandbox:  SMALL IS BEAUTIFUL.  You want the tiniest payload that will get the job done, and the cheapest rocket that will get the payload there. \u003Cbr\u003E\nAnd in the early career, SRBs are your best friends: their Isp is lousy, and their \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E isn\u0027t great, but they are CHEAP AS DIRT.\n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-10-18T02:35:57Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222808740\u0022 data-ipsquote-contentid=\u0022150200\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221476692845\u0022 data-ipsquote-userid=\u0022163745\u0022 data-ipsquote-username=\u0022Saylorock93\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Saylorock93 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHi guys, today i wanna say my opinion, and maybe ask for advices about the career mode. I have to say that in my 250h of gameplay i never played career until now, and i have to admit that is pretty intriguing. The progression feeling and actually building and planning to achieve a real mission (with rewards) and goals adds alot of spices to the game and i\u0027m happy of it. \u003Cbr\u003E\u003Cbr\u003E\nBUT\u003Cbr\u003E\u003Cbr\u003E\nOkay so, you start with few useless parts, it\u0027s nice to unlock the first five upgrades with few science points, but after that you find yourself with totally impossible tasks (unless building stupid ugly glitchy ships), i have to fly around passsengers, but i do not have spots for my planes, that can barely take off because lack of parts, obviously i won\u0027t put 4 pods to fit 4 passengers on the plane, i like the game to be at least 1% realistic. They ask me to try out 2,5m parts ahahah and i don\u0027t have even 2.5m fuel tanks. They asked me to explore di moon and i don\u0027t even have electricity.\u003Cbr\u003E\u003Cbr\u003E\nNow everyone will say: \u0022hey you stupid, just unlock everything\u0022. Sure, every stage now is 90 science. How many upgrades? I don\u0027t remember, 10? maybe less, it\u0027s 900 science. How can i make 900 science with going around with stupid vessels that ALSO looks incredibly ugly if they have to be functionals (because lack of parts). Few experiments around are like 10 science, less, i don\u0027t even have ladders and electricity to send back experiments and i have around 20 science now.\u003Cbr\u003E\nIt\u0027s seriously GRINDING and it\u0027s not fun.\u003Cbr\u003E\nReally you want me to walk all around \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E to gather science? WALKING? it would take hours, obviously i don\u0027t have wheels.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, you don\u0027t need to build \u0022stupid, ugly, glitchy ships\u0022 or walk around for hours.  At least not on default difficulty settings or anything close to them.  What you DO have to do is be smart about which contracts you take and especially which nodes you unlock in what order.  At each step in your progression, think carefully about which things you will need for the next step and unlock those.  Top priorities early on will be more science experiments and better rocket parts so you can get into orbit, then batteries and solar panels.  Once you do get into orbit, just doing EVAs over each biome will give you a lot of science.  And don\u0027t forget that you can also get science from high orbit as well before you need to move on to the moon.  And from whatever biomes you land in or fly over on the way to and from space. \n\u003C/p\u003E\n\u003Cp\u003E\nAs for contracts,only take ones which either are easy to complete or which you can accomplish on missions that you were planning to do anyway(or ones that look especially fun if you\u0027re not TOO worried about optimizing for efficiency).  Read the fine print carefully.  Part test on the launchpad?  Easy, take it.  Part test between 32500 and 32600m and between 200-275m/s?  Skip it unless you want to abuse the fact that it unlocks that part until you complete the contract. \n\u003C/p\u003E\n\u003Cp\u003E\nAs long as you\u0027re smart about these things, money should be no problem early on(world firsts alone will cover most of what you need even without taking a lot of extra contracts) and there\u0027s plenty of science available as well.  You might need a couple \u0022extra\u0022 missions early on to get all of it, but not a huge amount of grinding or building anything ridiculous.\n\u003C/p\u003E\n"}]}