{"TopicId":151115,"ForumId":16,"TopicTitle":"Can\u0026#039;t get to orbit - things do not work as described in tutorials","CreatedByName":"Emin","CreatedById":170962,"CreatedDateTime":"2016-10-29T21:55:28Z","PageNum":1,"Articles":[{"CreatedByName":"Emin","CreatedById":170962,"CreatedDateTime":"2016-10-29T21:55:28Z","Content":"\n\u003Cp\u003E\nIn all tutorials I have seen it says that in order to get to orbit I shall use the \u0022D\u0022 key (yaw control) to turn at 10 km so that the rocket\u0027s angle is 45 deg and heading is East. The thing is it doesn\u0027t work that way, first when I use \u0022D\u0022 the rocket almost doesn\u0027t react, when I start pressing it continuously at ~5kms all I get at 10 kms is about 6-8 degrees and never heading East, always North. I have to play with roll and pitch in order to get more or less right heading, but fighting with it I either overshoot the orbit (apiapsis ~100kms) or undershoot it (once it was at ~40 kms). What is most mysterious is why the rocket doesn\u0027t react to controls. It is almost as if the only thing controlling it was the wheels in the pod, whereas I expected the winglets to have flaps etc. - do they? \n\u003C/p\u003E\n\u003Cdiv data-role=\u0022contentPage\u0022\u003E\n\u003Cdiv data-role=\u0022contentPage\u0022\u003E\n\u003Cp\u003E\nCan\u0027t record a film showing my tries (Corel\u0027s Video Studio Pro X9 again crashing on me - don\u0027t buy that crap), but\u003Ca href=\u0022http://imgur.com/zwU1qWL\u0022 rel=\u0022external nofollow\u0022\u003E here is the pic of my rocket\u003C/a\u003E. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n"},{"CreatedByName":"Emin","CreatedById":170962,"CreatedDateTime":"2016-10-29T22:07:08Z","Content":"\n\u003Cp\u003E\nDiscovered that I could turn the rocket on the launchpad with Q/E keys and thus move the orange \u0022bird\u0022 on the navball so that it would indicate 90degs (and so would the numerical heading say). Hoped that would help, but no. \n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-10-29T22:11:54Z","Content":"\n\u003Cp\u003E\nThe way the rocket is oriented on the launchpad depends on whether or not you turned the control part (the pod, in your case) during construction in the editor. It works the way the tutorial says, by pressing D, if the pod is in its default orientation. But if you turned it during construction, then you\u0027ll have to steer a different way.\n\u003C/p\u003E\n\u003Cp\u003E\nYour goal is always to find the 90° direction. If necessary, do a test launch and flail around a bit until you have found it, then revert and do it properly the second time. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"COL.R.Neville","CreatedById":168067,"CreatedDateTime":"2016-10-29T22:33:57Z","Content":"\n\u003Cp\u003E\nyeah roll with the q/e to get the navball oriented correctly then s is up etc. \n\u003C/p\u003E\n\u003Cp\u003E\nalso nothing says you HAVE to go east. just put the thing up there. the rest will work itself out usually with more \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E\u0027s. \n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2016-10-29T23:11:21Z","Content":"\n\u003Cp\u003E\ni never orient my rockets like the tutorial and just use d to go east.\n\u003C/p\u003E\n\u003Cp\u003E\nalthough i orient my boosters in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E so that they are on the sides.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nwhat engine do you have at the bottom?  the reliant does NOT have a gimble.  and while i see fins, those ones dont have a control surface and just act to stabilize flight.\n\u003C/p\u003E\n\u003Cp\u003E\nalso if you watching a video tutorial on youtube that says to start turning at 10km, chances are they havent turned the rocket in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003Evab\u003C/abbr\u003E,  so that d is still east for them.\n\u003C/p\u003E\n\u003Cp\u003E\nlearning to read and fly by the navball is essential.  pay attention to the degree markers and the North line. your gonna wanna look for the 90degree marker if your shooting for an easterly zero degree inclination orbit. \n\u003C/p\u003E\n\u003Cp\u003E\nalso i find the wait until 10km method more difficult than  just tipping 5-10 degrees  at around 50m/s, and following prograde till orbit.  you can stall the rate your turning slightly by going back to stab assist.  as its best to be at 45 degrees at 10km and going around 350-400m/s\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-10-30T02:20:02Z","Content":"\n\u003Cp\u003E\nThe pod torque *is* the only thing helping to steer the rocket depicted. That type of fin does not pivot, SRBs do not pivot, and neither does that model of liquid fuel engine. So a ship that large and long is going to need more control authority to be manageable during ascent. Either substitute different parts, or make the rocket smaller. \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-10-30T04:26:34Z","Content":"\n\u003Cp\u003E\nThe tutorials are all too complicated. Steering a rocket in atmosphere is very tricky, and is really an advanced technique. The \u0022turn 45 degrees at 10km\u0022 rule is also very obsolete, so those tutorials are out of date.\n\u003C/p\u003E\n\u003Cp\u003E\nTo get to orbit the very first time, you can just launch straight up with about 1000 m/s of velocity. When you are above maybe 60km, you turn your rocket to point east -- directly toward the horizon. Then burn until your \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E is above 70km. This technique is rather inefficient, but when you try it you will learn a lot about managing your \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E while you are trying to get to orbit. And you will actually get to orbit every time. \u003Cstrong\u003E\u003Cem\u003EThen\u003C/em\u003E\u003C/strong\u003E start working on advanced techniques like gravity turns.\n\u003C/p\u003E\n\u003Cp\u003E\nTo get your rocket to turn when you are low in the atmosphere, you need to turn a little bit just as you leave the launchpad. After that, you can lock your \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to prograde, and that can turn your ship very slowly for you in the direction it\u0027s already going.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2016-10-30T04:27:31Z","Content":"\n\u003Cp\u003E\nThe tutorials you\u0027re reading are old, and are for the old aerodynamics model.  A 10km \u0022Newb Turn\u0022 is ferociously inefficient these days, and with the new aerodynamics is likely to send you flying into a horrible spin unless your drag is perfect, which will make it horribly difficult to turn.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat you want to do is go straight up until you\u0027re at 40-50 m/s and then nose over towards 90 degrees by 5-10 degrees.   Then you (in general) follow the prograde marker hanging around near the top of it.  Under most circumstances you\u0027ll still end up ~45 degrees at 10k, but your prograde will now be aimed the same way you are and you\u0027ve already started transferring energy into horizontal movement.  Every ship will behave and respond differently depending on drag and control factors, but this is a basic general course the majority of my ships hit:\n\u003C/p\u003E\n\u003Cp\u003E\nLaunchpad -\u0026gt; 45 m/s: Straight up.\n\u003C/p\u003E\n\u003Cp\u003E\nBend to ~10 degrees off up.  Play chase (or force) the Navball slowly over.\n\u003C/p\u003E\n\u003Cp\u003E\n5k : Usually ~60 degrees\n\u003C/p\u003E\n\u003Cp\u003E\n10k: Usually ~45 degrees\n\u003C/p\u003E\n\u003Cp\u003E\n15k: Usually ~35-30 degrees\n\u003C/p\u003E\n\u003Cp\u003E\n20k: Usually ~20 degrees\n\u003C/p\u003E\n\u003Cp\u003E\n25k: I\u0027m shoving the thing down to 5-10 degrees (wherever I can keep control at) and going for the gold.\n\u003C/p\u003E\n"},{"CreatedByName":"Plusck","CreatedById":153264,"CreatedDateTime":"2016-10-30T15:08:40Z","Content":"\n\u003Cp\u003E\nAbsolutely as \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110855-wanderingkid/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110855\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110855-wanderingkid/\u0022 rel=\u0022\u0022\u003E@WanderingKid\u003C/a\u003E says. However you might not even have enough control for that, so you\u0027d probably be best pressing D as soon as you lift off and then letting off the keys as soon as you get to about 8-10° at 50-100m/s. You probably don\u0027t want \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E on at all at this stage.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso you could greatly simplify things for yourself by eliminating one of your stages. Having three stages all with the same rocket engine is not efficient, and it\u0027s making your rocket very tall and skinny - probably good for aerodynamics but not a help if your only control comes from the command pod torque wheels.\n\u003C/p\u003E\n\u003Cp\u003E\nSo cut the last stage - add another fuel tank to the next stage up instead - and don\u0027t overdo the fins.\n\u003C/p\u003E\n\u003Cp\u003E\nThe other option for fins is to unlock the first \u0022flight\u0022 set of parts, and use Elevon 1s for control surfaces instead.\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2016-10-30T15:19:54Z","Content":"\n\u003Cp\u003E\nI second what \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153264-plusck/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022153264\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/153264-plusck/\u0022 rel=\u0022\u0022\u003E@Plusck\u003C/a\u003E and \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110855-wanderingkid/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022110855\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/110855-wanderingkid/\u0022 rel=\u0022\u0022\u003E@WanderingKid\u003C/a\u003E said. Forget about that \u0022climb to 10km and hang a right\u0022 nonsense. It no longer applies in KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nUsing the rocket shown, here\u0027s the easy way to do it:\n\u003C/p\u003E\n\u003Cp\u003E\nAt 50 m/sec, tip it East to 85° pitch. Turn off \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and stage the SRBs when finished. Keep your t/w to 2cos(pitch). At 70°, t/w= 1.7 50°, 1.5 and so-on. Once you clear 27km altitude at around 800 m/sec, turn \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E back on and fly prograde. It should pretty much fly itself to orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"Emin","CreatedById":170962,"CreatedDateTime":"2016-10-31T22:58:40Z","Content":"\n\u003Cp\u003E\nThanks for all the answers and support! The number of replies exceeded my expectations by far - a very supportive community I find myself in.\n\u003C/p\u003E\n\u003Cp\u003E\nNow about the progress:\n\u003C/p\u003E\n\u003Cp\u003E\n- we did make it into orbit on another profile, one I play with my daughter, just using a shorter, stubbier rocket, mimicking the Vostok we built the first stage as 4 liquid fuel boosters on the sides, second as a single liquid fuel rocket at the core and third as the capsule with the smaller liquid fuel engine and just two fuel tanks,\n\u003C/p\u003E\n\u003Cp\u003E\n- I suspected the fins/winglets I have did not have control surfaces, so on that rocket did include just one set of 4 at the bottom, \n\u003C/p\u003E\n\u003Cp\u003E\n- I didn\u0027t realize the LV-T30 has no gimbal, I assumed all liquid fuel engines in the program do have this - that would explain why my rocket was so hard to control. \n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-11-01T15:47:50Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222832453\u0022 data-ipsquote-contentid=\u0022151115\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221477954720\u0022 data-ipsquote-userid=\u0022170962\u0022 data-ipsquote-username=\u0022Emin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, Emin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n- I suspected the fins/winglets I have did not have control surfaces, so on that rocket did include just one set of 4 at the bottom, \n\u003C/p\u003E\n\u003Cp\u003E\n- I didn\u0027t realize the LV-T30 has no gimbal, I assumed all liquid fuel engines in the program do have this - that would explain why my rocket was so hard to control. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIn the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E/\u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E part lists, you can right click on a part to show more info about it, including details about how much control surface or gimbal those parts have.\n\u003C/p\u003E\n"}]}