{"TopicId":151615,"ForumId":16,"TopicTitle":"Interplanetary Asteroid Rendezvous","CreatedByName":"The-MathMog","CreatedById":36417,"CreatedDateTime":"2016-11-06T15:18:15Z","PageNum":1,"Articles":[{"CreatedByName":"The-MathMog","CreatedById":36417,"CreatedDateTime":"2016-11-06T15:18:15Z","Content":"\n\u003Cp\u003E\nHey guys, so I am looking for some tips on how to efficiently rendezvous with asteroids in interplanetary space, as I\u0027ve heard that it would be more fuel efficient in the end, when dealing with bigger asteroids (starting of with C-Class and then going bigger). I want it to be fuel efficient too, as I am planning on mining them in my career mode.\u003Cbr\u003E\nRendezvous with them, when they are in Kerbin\u0027s sphere of influence, I\u0027ve got pretty much nailed down, as all that need is some \u0022basic\u0022 rendezvous.\u003Cbr\u003E\u003Cbr\u003E\nI did do a few quick searches, but they didn\u0027t help me out much, so sorry if there if there is a topic with it (link then maybe?)\u003Cbr\u003E\nAll tips help, as it is always good to refresh some old knowledge too (been playing it for almost 4 years I think) \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2016-11-06T16:30:05Z","Content":"\n\u003Cp\u003E\nThe classic thread: \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/68613-asteroid-rendezvous-outside-of-kerbin%C3%A3%C2%A2%C3%A2%E2%80%9A%C2%AC%C3%A2%E2%80%9E%C2%A2s-soi/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"},{"CreatedByName":"The-MathMog","CreatedById":36417,"CreatedDateTime":"2016-11-06T18:40:15Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222840857\u0022 data-ipsquote-contentid=\u0022151615\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478449805\u0022 data-ipsquote-userid=\u0022127483\u0022 data-ipsquote-username=\u0022eddiew\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, eddiew said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe classic thread: \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/68613-asteroid-rendezvous-outside-of-kerbin%C3%A3%C2%A2%C3%A2%E2%80%9A%C2%AC%C3%A2%E2%80%9E%C2%A2s-soi/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks, that\u0027s what I was looking for! \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2016-11-06T20:38:32Z","Content":"\n\u003Cp\u003E\nI\u0027ve experimented A LOT with Ast. HSJ-227 which is a Class E asteroid and the very first one to spawn (within 10s) of a new game, capturing it outside of Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E is definitely more fuel efficient. I suggest you experiment a lot too, as I learned a great deal from them. and even if you mess up, just start a new sandbox and try again.\n\u003C/p\u003E\n\u003Cp\u003E\nthe test vessel was using a single Rhino engine attached to three full-sized Kerbodyne tanks (and a couple of twin-boar boosters to get it into orbit)\n\u003C/p\u003E\n\u003Cp\u003E\nI was able to (using mechjeb node planner) eject from Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E in the opposing direction of the asteroid, fine-tune closest approach, match velocities at closest approach, capture and then proceed to redirect for an aerobrakeing using a PE of 42Km  (any lower and it\u0027ll burn on re-entry, any higher and it wont capture at all)\n\u003C/p\u003E\n\u003Cp\u003E\neach test had a different delta-V for redirect, as I captured it at different times, but none of which was more than 150 m/s, and for a Rhino engine, that\u0027s pretty easy to do. it seems the sooner you capture the asteroid, the less delta-V is required for redirection, but also required more delta-V for ejection and matching velocities, you might need Big Mac\u0027s Fancy Mathematics to find the optimal time for capture to reduce overall delta-V used during the life of the mission.\n\u003C/p\u003E\n\u003Cp\u003E\nafter these tests, I\u0027ve experimented even further using different vessel builds, including LV-N and ION engines;\n\u003C/p\u003E\n\u003Cp\u003E\nLV-N was great for ejection, rondevous, and matching velocities allowing me to do all aforementioned things A LOT sooner than normal, which saved redirection delta-V, but I actually lost A LOT of overall delta-V after capturing, due to the overall mass of the asteroid and vessel.\n\u003C/p\u003E\n\u003Cp\u003E\nin fact I ended up using more \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E than the previous \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E\u002BOX build of the Rhino engine, and now that I think back, I probably should have tested a hybrid of LV-N and Rhino for the heavy stuff\n\u003C/p\u003E\n\u003Cp\u003E\nthe ION engine test was very, very interesting, I was able to eject, rondevous and match velocities MUCH sooner than LV-N but the burn times were awful. when I captured the asteroid, it was a full 52 days ahead of \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E entry and about 32 m/s for redirection, but again, it lost overall delta-V due to the mass of the Asteroid and ran out of XenonGas after spending 2 hours burning only 5 m/s of the 32 m/s required, definitely not a good choice for heavy-hauling, and a hybrid probably would have been better suited.\n\u003C/p\u003E\n\u003Cp\u003E\nI also found out that if you plan on turning the asteroid into a refueling station, it is NOT a good idea to bring mining equipment with you and refuel mid-flight as you\u0027ll be dragging dead-weight with you and losing delta-V for majority of the mission and using more ore during the redirect than what would be profitable, just launch a big rocket with enough fuel to do everything in one go, launch a mining rig once it\u0027s in orbit and re-use the rocket(s) as aux tanks for storing fuel, just be sure to bring all 3 docking ports on the mining rig so you can dock different vessels to it.\n\u003C/p\u003E\n\u003Cp\u003E\nI hope this helps, and I wish you best of luck and many happy landings.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-06T20:59:31Z\u0022 title=\u002211/06/2016 08:59  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 6, 2016\u003C/time\u003E by Xyphos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tyko","CreatedById":164179,"CreatedDateTime":"2016-11-07T17:48:17Z","Content":"\n\u003Cp\u003E\nI spent the whole weekend (literally \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E ) experimenting with asteroids. Good news is that I have a design that can capture and redirect up to Class E. Bad news is that my longest burn time was 37 minutes. The Tug uses an LV-N plus one and a half Kerbodyne orange tanks. It develops 12700m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E on its own.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen I docked with a 1700 metric ton Class E the Tug (minus fuel spent on rendezvous) had 170m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E to move the rock around. This was enough to divert it into a stable highly eccentric orbit. I\u0027ll revisit that asteroid when I have higher tech. The Tug with a Class C had over 1700m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E to work with and was easily capable of parking the asteroid in a stable \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nThe biggest issue was rotating the craft to execute burns. With two 1.25m Reaction Wheels plus \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E I was able to turn the Class E, but it was really slow\n\u003C/p\u003E\n"},{"CreatedByName":"The-MathMog","CreatedById":36417,"CreatedDateTime":"2016-11-07T18:47:47Z","Content":"\n\u003Cp\u003E\nThanks for the astounding amounts of info guys! I will test out a lot of it myself, and try to get a better grasp at what it exactly takes.\u003Cbr\u003E\u003Cbr\u003E\nSo far after the initial post, I\u0027ve managed to put a C-Class asteroid into orbit around Kerbin, using a vessel with around 10.000 delta-v, in the form of 2 Nuclear engines. I did forget about using the atmosphere as aerobreaking, and I\u0027ve not put it in a highly inclined (polar) orbit, and I need to bring it down into an equatorial orbit, which will take a few more missions (my current spacecraft can put 500\u002B delta-v into the 130\u002B ton heavy rock). I am using stage-recovery mod too, so the missions are not thaaat expensive in the end, but I probably still loose a bit more cash than what I\u0027ll actually gain from it. Oh well, I am paid with a learning experience. Launching one bigger mission is probably a better way, than having to launch 4 medium sized ones. (Even had to do a salvage mission, to add parachutes to the first mission, and de-orbit it, to gain the value back of the nuclear engines.\u003Cbr\u003E\u003Cbr\u003E\nIon engines is probably not something I\u0027m gonna play around with, as my patience isn\u0027t thaaat big. Nuclear only just makes the cut \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tyko","CreatedById":164179,"CreatedDateTime":"2016-11-07T23:36:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222842382\u0022 data-ipsquote-contentid=\u0022151615\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478544467\u0022 data-ipsquote-userid=\u002236417\u0022 data-ipsquote-username=\u0022The-MathMog\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, The-MathMog said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIon engines is probably not something I\u0027m gonna play around with, as my patience isn\u0027t thaaat big. Nuclear only just makes the cut \u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nthe thing that saved my sanity for the 30\u002B minute burns is using alt-period to force a time acceleration while engines are running. It maxes out at 4X acceleration, but that still cuts the burn time to 25%.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2016-11-08T00:49:47Z","Content":"\n\u003Cp\u003E\nThis question about how to play the game has been moved to Gameplay Questions. \n\u003C/p\u003E\n"},{"CreatedByName":"Xyphos","CreatedById":139010,"CreatedDateTime":"2016-11-08T15:52:23Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222842382\u0022 data-ipsquote-contentid=\u0022151615\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221478544467\u0022 data-ipsquote-userid=\u002236417\u0022 data-ipsquote-username=\u0022The-MathMog\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, The-MathMog said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027ve not put it in a highly inclined (polar) orbit, and I need to bring it down into an equatorial orbit\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nin your game settings, if you set your conic patch mode to 0 (far left button until it stops), and the number of patches to 6, which is strongly recommended for gravity assisted maneuvers, you can actually aim the asteroid during the redirect on a fly-by past Kerbin to alter it\u0027s inclination on it\u0027s first pass by without capturing it, then later setup another Kerbin rondevous for an equatorial aerobrake and capture, it takes more time, but uses much less delta-V than altering the inclination after capturing, and you can do it all in a single mission.\n\u003C/p\u003E\n\u003Cp\u003E\nthat\u0027s the beauty of orbital mechanics, what goes around, comes around, not everything has to happen all at once, for time is just an illusion,\n\u003C/p\u003E\n\u003Cp\u003E\nI think the hardest part of this game is learning patience, but learning to use gravity-assisted maneuvers can save you TONS of delta-V.\u003Cbr\u003E\nin fact, gravity assisting makes it possible for an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E spaceplane to reach Laythe and back without refueling mid-flight, but we\u0027ll cover that lesson some other day.\n\u003C/p\u003E\n\u003Cp\u003E\nand before I forget, to setup the second rondevous, burn radial in/out at the solar AP but make sure the PE crosses into Kerbin\u0027s orbit, you should be able to see the node flags line up. try to get them as close as possible and fine-tune the trajectory later on when you\u0027re less than half-way there.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-11-08T16:13:18Z\u0022 title=\u002211/08/2016 04:13  PM\u0022 data-short=\u00227 yr\u0022\u003ENovember 8, 2016\u003C/time\u003E by Xyphos\u003C/strong\u003E\n\u003C/span\u003E\n"}]}