{"TopicId":153019,"ForumId":16,"TopicTitle":"Colonizing","CreatedByName":"Spaceman83","CreatedById":167241,"CreatedDateTime":"2016-12-05T03:35:45Z","PageNum":1,"Articles":[{"CreatedByName":"Spaceman83","CreatedById":167241,"CreatedDateTime":"2016-12-05T03:35:45Z","Content":"\n\u003Cp\u003E\nI have built small base on mun surface i have orbital station kerbin orbit and big mun ship with lander parked on station! I gonna build also mun orbital station and more ships which move between mun and kerbin station(s) so i going to colonize it then maybe minmus but is there any practical point of this? Do i get money or science if i start mining operations? I play career and not yet open those mining equipments! Also duna is interesting but is sooo far i have only sent probe there so it feels too damn hard to build anything there if there is no any practical point of it?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-12-05T04:11:20Z","Content":"\n\u003Cp\u003E\nNo, there is no practical point to it.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only thing you get from colonization/mining is free fuel.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-12-05T08:12:38Z","Content":"\n\u003Cp\u003E\nIf you want to be brave and face a complex mod with a steep initial learning curve, then \u003Cabbr title=\u0022Umbra Space Industries (a collection of mods)\u0022\u003EUSI\u003C/abbr\u003E Kolonization System can make your colony useful. You do get science over time from inhabited colonies, and you can even build new spacecraft on site if you have the required resources on hand.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2016-12-05T11:50:08Z","Content":"\n\u003Cp\u003E\nNo, there\u0027s currently little point to extensive \u0022colonising\u0022 apart from the challenge, so is perhaps best done in sandbox mode. \n\u003C/p\u003E\n\u003Cp\u003E\nMinmus can be marginally useful as a refuelling base but tends to just complicate things with few savings/advantages. A small base with a Mobile Processing Lab can let you generate science very easily.    \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-12-05T18:39:30Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222875556\u0022 data-ipsquote-contentid=\u0022153019\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221480908945\u0022 data-ipsquote-userid=\u0022167241\u0022 data-ipsquote-username=\u0022Spaceman83\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, Spaceman83 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nis there any practical point of this?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot really (at least in stock), but that doesn\u0027t mean you can\u0027t have fun with it.  \u0022Colonizing\u0022 is mainly about role-playing:  i.e. the point of building a base is mainly, well, just to \u003Cem\u003E\u003Cu\u003Ehave a base\u003C/u\u003E\u003C/em\u003E.  Other than being a source of free fuel, there\u0027s really no \u0022point\u0022 to it... but then, when you get right down to it, there\u0027s not any \u003Cem\u003E\u003Cu\u003Epoint\u003C/u\u003E\u003C/em\u003E to, well, pretty much \u003Cem\u003E\u003Cu\u003Eanything\u003C/u\u003E\u003C/em\u003E in KSP, other than \u0022because I like doing it.\u0022  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nOne thing that \u003Cem\u003E\u003Cu\u003Ecan\u003C/u\u003E\u003C/em\u003E make having a base more interesting is if you\u0027ve got the right set of mods installed.  Most of my career play-throughs, I don\u0027t bother with bases.  However, there\u0027s one particular pair of mods that makes them worthwhile for me; when I run these mods, \u003Cem\u003E\u003Cu\u003Ethen\u003C/u\u003E\u003C/em\u003E I build bases.  These two mods are:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nKerbal Attachment System (\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E), to make bases \u003Cem\u003E\u003Cu\u003Epractical\u003C/u\u003E\u003C/em\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nExtraplanetary Launchpads (EPL), to give bases a \u003Cem\u003E\u003Cu\u003Epoint\u003C/u\u003E\u003C/em\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E makes it easy and practical to build a base.  There\u0027s a really handy \u0022connector port\u0022 part-- small, lightweight, can be radially attached practically anywhere-- which lets you send an EVA kerbal to connect any two ships that are parked within a couple of dozen meters of each other.  This makes it easy to land the various components of a base, then connect them together.  (I\u0027ve always found that it\u0027s excruciatingly inconvenient to try to dock together ships on the surface.  There are people who manage to make this work, but I\u0027m not one of them.  \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E, for me, makes the difference between \u0022simple and fun\u0022 versus \u0022really unpleasant and joy-killing\u0022.)\n\u003C/p\u003E\n\u003Cp\u003E\nEPL allows you to build and launch ships \u003Cem\u003Ein situ\u003C/em\u003E from your base, rather than having to ship everything from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.  For example, I did a really fun career playthrough where I established a base on Minmus as early as the tech tree would possibly let me... and then added the self-imposed rule that I would run my entire space program from there.  All new ships to be built and launched from the base, rather than \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.  The only launches I allowed from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E were to supply crew... and even there, I only allowed myself \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E-to-\u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E ships that offloaded the crew to a space station and then returned to Kerbin.  Not only did that make for an interesting challenge, but it also created quite a different gameplay experience.  If you\u0027re launching ships in vacuum from a world with tiny gravity and escape velocity, your design parameters end up looking rather different from when everything needs to punch through atmosphere and claw its way out of Kerbin\u0027s gravity well.\n\u003C/p\u003E\n\u003Cp\u003E\nEPL also allows a style of gameplay for exploration that I really like:  send a fairly small mission to some very remote place (such as Sarnus, Urlum, or Neidon in Outer Planets), with just enough fuel and equipment to land on some little moon and set up a mining/construction base.  It then constructs all the ships it needs to thoroughly explore the neighborhood.  Then, when it\u0027s time to move on (either to go home to Kerbin, or to proceed to the next exploration destination), it builds the ship that will take the crew on to the next place.  This was really, really fun for me-- I had a blast.  That\u0027s probably the most base-building fun I\u0027ve had.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:10px;\u0022\u003EAs long as we\u0027re talking mods, it\u0027s also worth mentioning RoverDude\u0027s UKS/MKS.  That can also give bases a point, especially when combined with EPL.  I did one playthrough with that; glad I tried it out, just for the change of pace, though I probably won\u0027t be doing that again.  (Not that there\u0027s anything wrong with the mod; just that it turns KSP into a completely different game, where it\u0027s much more about managing logistics and much less about \u003Cem\u003E\u003Cu\u003Eflying rocket ships\u003C/u\u003E\u003C/em\u003E.  That\u0027s fine, it just happens not to be my cup of tea.  I\u0027m all about flying rocket ships.)\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, for me, at least, \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E \u002B EPL make the difference when it comes to building bases.  Either I\u0027m running those two mods and I make bases, or else I\u0027m not, and I don\u0027t.\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2016-12-06T00:57:54Z","Content":"\n\u003Cp\u003E\nYou can occasionally get contracts to mine ore, or mine ore and haul it to Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, or (less practically) land the ore on Kerbin.  The former two can be quite profitable since they pay well and cost you nothing if you already have the infrastructure.  Plus you can then turn that ore into free fuel.\n\u003C/p\u003E\n"},{"CreatedByName":"Spaceman83","CreatedById":167241,"CreatedDateTime":"2016-12-06T15:51:16Z","Content":"\n\u003Cp\u003E\nOk thanks for answers!!! Practical business point of view there is always space turism\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \n\u003C/p\u003E\n"}]}