{"TopicId":15335,"ForumId":16,"TopicTitle":"How to get Jeb Bob and Bill back?","CreatedByName":"Great Fune","CreatedById":23224,"CreatedDateTime":"2012-07-26T20:23:55Z","PageNum":1,"Articles":[{"CreatedByName":"Great Fune","CreatedById":23224,"CreatedDateTime":"2012-07-26T20:23:55Z","Content":"\n\u003Cp\u003EI cleared the pad with them on it not knowing it would take them away. I\\\u0027ve cleared the pad 10\u002B times now but they won\\\u0027t come back! :\\\u0027(\u003C/p\u003E\u003Cp\u003EIs there a way I can get them back?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EEd is no Jeb!\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Accelerando","CreatedById":543,"CreatedDateTime":"2012-07-27T01:50:56Z","Content":"\n\u003Cp\u003EFunny thing, every time I clear the pad with some Kerbals on it they come back the very next mission I use the craft file that they were flying when they were cleared. Not sure what\\\u0027s up with your game.\u003C/p\u003E\n"},{"CreatedByName":"Erixxxx","CreatedById":33985,"CreatedDateTime":"2012-07-27T14:58:37Z","Content":"\n\u003Cp\u003EI lost mine last night due to an accident (it wasn\\\u0027t my fault, I swear!) and I couldn\\\u0027t get them back. But when I got up this morning, they were back. Didn\\\u0027t do anything special.\u003C/p\u003E\n"},{"CreatedByName":"Braun","CreatedById":4366,"CreatedDateTime":"2012-07-27T22:03:05Z","Content":"\n\u003Cp\u003Ego to your ksp directory. Look for the persistant file. Delete it, or open it and look for the bob bill and jeb.\u003C/p\u003E\u003Cp\u003EThey should reappear when you delete the entrys.\u003C/p\u003E\u003Cp\u003EIf you delete the file, your gameworld will efectively be reset\u003C/p\u003E\n"},{"CreatedByName":"Fendleton","CreatedById":22867,"CreatedDateTime":"2012-07-27T23:19:06Z","Content":"\n\u003Cp\u003EYeah, I accidentally made Bob explode. Now I\\\u0027ve just got Bill, Jeb and Random Greyshirt.\u003C/p\u003E\u003Cp\u003EWorks out pretty well for dangerous EVAs to work out the jetpack controls (which I have yet to get any semblance of competancy with).....I just send out Ensign Greyshirt and about 30% of the time he might come back.\u003C/p\u003E\n"},{"CreatedByName":"Blargenth","CreatedById":64158,"CreatedDateTime":"2013-11-07T10:52:17Z","Content":"\n\u003Cp\u003ENote: This is with version .22 of the game, campaign mode has been added and all other features too.\u003C/p\u003E\u003Cp\u003EI know this is kind of dredging up this old thread but I just wanted to make this note in case anyone else runs into the same problem. So I\u0027ve been playing a lot lately and had no problem with losing my crew mates Jeb Bob and Bill, until just last night when Jeb was added to the wall of MIA after a failed landing attempt on Duna. I was stunned, that had never happened before and refreshing the game didn\u0027t seem to fix it either.\u003C/p\u003E\u003Cp\u003ELong story short if you want to bring back a Kerb this is how you do it. You will need a compiler called Notepad\u002B\u002B (but it may work with normal notepad, the script just has to be readable and editable). At the bottom of the Persistent.sfs file you would find a list of your crew mates and available recruits. If any of your crew has a \u0027State\u0027 equal to \u00273\u0027 that means they are listed as MIA. Changing the state to 0 will return them from the dead!\u003C/p\u003E\n"},{"CreatedByName":"Steve-S","CreatedById":74649,"CreatedDateTime":"2013-11-07T12:15:49Z","Content":"\n\u003Cp\u003EMaybe the Greyshirts should become Redshirts.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2013-11-07T12:20:50Z","Content":"\n\u003Cp\u003EOr just wait a few days and the three oranges will be reborn by the game itself.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-11-07T12:25:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Blargenth\u0022 data-cite=\u0022Blargenth\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ELong story short if you want to bring back a Kerb this is how you do it. You will need a compiler called Notepad\u002B\u002B (but it may work with normal notepad, the script just has to be readable and editable).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn no way, in any way, is Notepad\u002B\u002B a \u0022compiler\u0022. Other than that, yes this does work.\u003C/p\u003E\n"}]}