{"TopicId":153770,"ForumId":16,"TopicTitle":"SSTO Reentry at 7km/s in Real-Scale Earth?","CreatedByName":"Ar-cen-ciel","CreatedById":171536,"CreatedDateTime":"2016-12-20T12:33:57Z","PageNum":1,"Articles":[{"CreatedByName":"Ar-cen-ciel","CreatedById":171536,"CreatedDateTime":"2016-12-20T12:33:58Z","Content":"\n\u003Cp\u003E\nI\u0027ve been trying to fly the GN Drive powered (vertical) spaceplane over the Earth in Real Solar System for quite some time now.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem, though, is that I never managed to really shed off the orbital speed during the atmospheric entry, and attempting to land the \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E at that speed resulted in the ship itself blown up like fireworks. The only way I could find so far is perform a reverse-thrust with the GN engine in docking mode, but I\u0027d like to find another way if possible.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m using the stock parts for now, though I would like to have this problem solved before I install more advanced mods like \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-20T12:38:41Z\u0022 title=\u002212/20/2016 12:38  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 20, 2016\u003C/time\u003E by Ar-cen-ciel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"OrbitalBuzzsaw","CreatedById":158329,"CreatedDateTime":"2016-12-20T13:27:19Z","Content":"\n\u003Cp\u003E\nPics please\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-12-20T13:29:46Z","Content":"\n\u003Cp\u003E\nWell, the fact that you are using a mod that changes the scale of everything makes advice a little more complicated. However, there have been many many threads on these forums giving generic about getting spaceplanes to reenter successfully. So searching for \u0022spaceplane reentry\u0022 may get you information overload ... um, I mean, exactly the advice that you need.\n\u003C/p\u003E\n\u003Cp\u003E\nIn general, though -- to get a spaceplane to the ground requires a \u0022correct\u0022 reentry flight profile (and sometimes a retroburn is the \u003Cem\u003Eonly\u003C/em\u003E way to get it down in one piece). Which flight profile is the correct one depends tremendously on what parts your spaceplane is built from, especially their heat resistance, aerodynamic lift, and drag properties. The flight profile includes: what do you set the \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E to before reentry, and what \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E do you maintain through the extreme upper atmosphere, the middle atmosphere, and the point of greatest heating.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, your original post gives the impression that you\u0027ve tried every possible combination. Which means there\u0027s nothing left for us to tell you. \u003Cimg alt=\u0022:wink:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut if you haven\u0027t tried all possible combinations yet, then we need to know what you\u0027ve tried. Have you tried putting your \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E just a few Kms into the very top of the atmosphere, setting your \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E to 90 degrees, and just riding it down that way to see how far you get?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Ar-cen-ciel","CreatedById":171536,"CreatedDateTime":"2016-12-20T15:12:46Z","Content":"\n\u003Cp\u003E\nI\u0027m trying to land \u003Ca href=\u0022http://imgur.com/a/oCpxz\u0022 rel=\u0022external nofollow\u0022\u003Ethis spaceplane\u003C/a\u003E back to Earth. All attempts to landing it apart from slowing it down with reverse thrust to less than 5km/h, ended in failure. Tried setting the periapsis to 60km or so, the plane blows up at 0-90 degree of \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAOA\u003C/abbr\u003E. The point of greatest heating is at the cockpit at the front of the fuselage, since it was pointed head-on in all my reentry attempts.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve set the atmospheric burn to 0%, but the reentry heat is still there. Another noteworthy mod that might concern the problem is RealHeat, though I\u0027m not entirely sure whether it is the culprit, especially since I didn\u0027t have \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E installed yet.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-20T16:16:47Z\u0022 title=\u002212/20/2016 04:16  PM\u0022 data-short=\u00227 yr\u0022\u003EDecember 20, 2016\u003C/time\u003E by Ar-cen-ciel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2016-12-20T16:12:41Z","Content":"\n\u003Cp\u003E\nIf that thing really does have infinite deltaV, then you might as well retroburn. \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\nAfter it blows the hell up, you should get a mission report screen that tells you which part blew up first. That info might be useful.\n\u003C/p\u003E\n\u003Cp\u003E\nYou might also want to scale down your retroburns, to find out the minimum amount of retro that it takes to make things work.\n\u003C/p\u003E\n\u003Cp\u003E\nDo you have all your temperature gauges and thermal overlays turned on, so that you can Esc and pause and give it all a good looking over, every few seconds?\n\u003C/p\u003E\n\u003Cp\u003E\nHow long after reentry into the upper atomosphere does it blow? How many Kms do you descend?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Ar-cen-ciel","CreatedById":171536,"CreatedDateTime":"2016-12-21T06:36:21Z","Content":"\n\u003Cp\u003E\nI didn\u0027t quite record it but I think the spaceplane would start heating up from 70km or so, and blow up at the altitude of around 65-55km.\n\u003C/p\u003E\n\u003Cp\u003E\nDecided to remove RealHeat mod and voila, no more overheating at reentry anymore. Not sure how the spaceplane itself would\u0027ve fared at 100% atmospheric heating in default setting, but at least the plane doesn\u0027t overheat into meteors anymore.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-21T06:47:28Z\u0022 title=\u002212/21/2016 06:47  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 21, 2016\u003C/time\u003E by Ar-cen-ciel\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2016-12-21T08:06:14Z","Content":"\n\u003Cp\u003E\nThe main issue here is that KSP fudges atmospheric heating physics upwards, due to its reduced scale. If it were realistically simulated, then reentering at 2 km/s on stock Kerbin probably wouldn\u0027t even give you a visible plasma trail, nor any danger of overheating. When you now scale Kerbin up to 11x size using \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E, you have a problem: you\u0027re trying to do reentry at fully realistic orbital speeds, using physics settings that are designed to make it harder and hotter than normal. This obviously doesn\u0027t work out all that well for most that try it.\n\u003C/p\u003E\n\u003Cp\u003E\nGenerally, you would install \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E together with Realism Overhaul, which ships a proper set of physics constants for real scale atmospheric heating, among other things. The more realistic aerodynamics simulation of \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E helps as well - planting a large surface, such as the belly of a spaceplane, squarely into a hypersonic airstream slows you down better in \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E than in stock. But if you don\u0027t want to go that far just yet (\u0026lt;/rimshot\u0026gt;), then turning down the reentry heating slider in the difficulty options is a good start. I don\u0027t know what you have to set it to in order to get a stockalike experience, you\u0027ll have to experiment until it feels right.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-21T08:07:10Z\u0022 title=\u002212/21/2016 08:07  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 21, 2016\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"}]}