{"TopicId":153708,"ForumId":16,"TopicTitle":"Capure in front or behind?","CreatedByName":"AaronLS","CreatedById":142846,"CreatedDateTime":"2016-12-19T04:36:45Z","PageNum":1,"Articles":[{"CreatedByName":"AaronLS","CreatedById":142846,"CreatedDateTime":"2016-12-19T04:36:45Z","Content":"\n\u003Cp\u003E\nIf I do a fly by the Mun, and behind behind the mun\u0027s direction of orbit, then I get a gravity assist increasing my orbit of Kerbin(not sure on correct terminology here, orbital energy?).  If I pass in front, then my Kerbin orbit is decreased.  So if I were wanting to save some \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E on deorbiting to Kerbin, then first doing a fly by of the Mun on the front side is a good way to lose some orbital energy.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, I\u0027m wondering if this matters within the reference frame of the Mun, if my goal is to capture and orbit the Mun, will it save me \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to put my periapsis on the front side of the Mun?  I would imagine if my periapsis is on the backside of the Mun(relative to it\u0027s orbital direction) then I spend more time approaching and thus spend more time accelerating and thus will need to expend more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to slow down to capture.\n\u003C/p\u003E\n\u003Cp\u003E\nMy fairly non scientific testing with nodes indicates this probably is the case, saving roughly 10% \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E in the couple cases I tried.  Basically using a radial node at the midpoint of my Kerbin orbit to set my approach up to the Mun to pass in front or behind at the same Mun periapsis height, then using a retrograde node at the Mun periapsis to compare \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E needed to drop apoapsis to 100km.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-19T04:37:03Z\u0022 title=\u002212/19/2016 04:37  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 19, 2016\u003C/time\u003E by AaronLS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2016-12-19T14:03:11Z","Content":"\n\u003Cp\u003E\nIt\u0027s a bit more complicated than that. Whether you get a return to the parent \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E faster or slower than you entered it is mostly to do with what angle relative to the assisting bodies orbit you enter at and what angle you leave at. A while ago I wrote up some conclusions \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/132478-gravitaional-assist-rules-of-thumb/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Jonfliesgoats","CreatedById":168077,"CreatedDateTime":"2016-12-19T18:37:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222893224\u0022 data-ipsquote-contentid=\u0022153708\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482156191\u0022 data-ipsquote-userid=\u002257809\u0022 data-ipsquote-username=\u0022tomf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, tomf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt\u0027s a bit more complicated than that. Whether you get a return to the parent \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E faster or slower than you entered it is mostly to do with what angle relative to the assisting bodies orbit you enter at and what angle you leave at. A while ago I wrote up some conclusions \n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/132478-gravitaional-assist-rules-of-thumb/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat\u0027s a handy write-up!\n\u003C/p\u003E\n"},{"CreatedByName":"Ozymandias_the_Goat","CreatedById":159377,"CreatedDateTime":"2016-12-19T19:59:05Z","Content":"\n\u003Cp\u003E\nThis thread should probably be moved to the \u0022Gameplay Questions and Tutorials\u0022 section, as it is about the Kerbal solar system and not our own. \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2016-12-20T03:45:33Z","Content":"\n\u003Cp\u003E\nYup, this is about in-game stuff, not the real world.  Moving.\n\u003C/p\u003E\n\u003Cp\u003E\n(FYI, if you see a thread that looks like it needs moving or any other sort of maintenance requiring moderator attention, the best way to do that is to report the post, rather than just saying \u0022this needs moving\u0022 or whatever.  The former actually gets our attention.  The latter doesn\u0027t-- nothing will happen unless you get lucky and one of us just happens to see the comment.)\n\u003C/p\u003E\n"},{"CreatedByName":"AaronLS","CreatedById":142846,"CreatedDateTime":"2016-12-20T08:54:30Z","Content":"\n\u003Cp\u003E\nThe question wasn\u0027t meant to be about the Kerbal solar system.  I gave that as an example only.  It was meant as a question about physics.\n\u003C/p\u003E\n\u003Cp\u003E\nThe linked article seems to deal with the affect a fly-by has on the orbit around the parent body, which is not what I\u0027m asking about.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyhow, not a big deal.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-12-20T08:54:48Z\u0022 title=\u002212/20/2016 08:54  AM\u0022 data-short=\u00227 yr\u0022\u003EDecember 20, 2016\u003C/time\u003E by AaronLS\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"psychopoak","CreatedById":58162,"CreatedDateTime":"2016-12-20T08:57:22Z","Content":"\n\u003Cp\u003E\nApollo 11 used to go with the \u0022in front\u0022 approach as you can see here \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022fin-apolloroute-xa.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022422\u0022 src=\u0022https://saraliu531.files.wordpress.com/2011/01/fin-apolloroute-xa.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nas you figured out it takes a tiny bit more energy than the \u0022behind approach\u0022. However IIRC they chose this path in case of a malfunction in the engine when at the LOI point. if you go with the behind approach and your engine fails, you will come back to earth with more energy and therefore a higher orbit which in case of a total engine loss cause you to be stuck in space forever... or at leat an awful amount of time if you rely on orbit decay to get you back down. \n\u003C/p\u003E\n\u003Cp\u003E\nIn the same situation the \u0022in front\u0022 approach will get you back to earth with a lower orbit, which naturally bring you down on earth in case of a mishap. \n\u003C/p\u003E\n\u003Cp\u003E\nSo for the sake of it I tend to use the same path as Apollo missions, especially if I want to be greedy and save the maximum fuel possible for a flyby mission\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Champ","CreatedById":96425,"CreatedDateTime":"2016-12-20T10:52:24Z","Content":"\n\u003Cp\u003E\nIf you just want to orbit, behind or in front is the same in terms of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\u003Cbr\u003E\nIf you want to land, you want to capture in a prograde orbit, so it\u0027s behind.\n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2016-12-20T14:06:48Z","Content":"\n\u003Cp\u003E\nMy general impressions are as such:\n\u003C/p\u003E\n\u003Cp\u003E\nTranslunar (in front of the Mun) costs slightly more on injection (initial burn from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E), and a bit more on landing and ascent due to the retrograde orbit you end up in.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, translunar is preferred for flybys and missions where you want a return-to-Kerbin abort mode. A free-return trajectory is a special case of translunar injection where, if you don\u0027t maneuver, you end up just crossing back into Kerbin atmosphere for reentry. This was what was used by the Apollo missions, since if the service module engine failed to fire properly, they would simply just return to Earth. It\u0027s also widely used for flybys, as then it\u0027s very cheap to get your flyby mission back to Kerbin for recovery.\n\u003C/p\u003E\n\u003Cp\u003E\nIn my experience, it\u0027s hard to exactly nail a free-return trajectory (particularly if you want a low perilune), but even if you don\u0027t exactly nail it, you can at least get something close, where only a small adjustment (possibly with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or the lander engine) will correct you to a proper reentry profile. In general, though, you want to at least get something close, which means burning earlier than normal, and with a bit more delta-V than normal.\n\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2016-12-20T16:46:44Z","Content":"\n\u003Cp\u003E\nIf you want a neat trick (but you probably won\u0027t bother to do it twice), it\u0027s possible to get a free return trajectory that captures to a prograde orbit.  The catch is that it takes more delta-v and a longer time, since you pass Kerbin apoapsis, loop around Mun and get ejected (assuming no burn) heading back towards Kerbin apoapsis.\n\u003C/p\u003E\n\u003Cp\u003E\nI do wonder how LOS is now with capturing to a low retrograde orbit...\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2016-12-20T23:23:53Z","Content":"\n\u003Cp\u003E\nIt is as tomf said: If you leave with an angle more prograde relative the assisting body than you entered, then you will gain prograde velocity during the encounter. If you leave less prograde than you entered, then you will lose it.\n\u003C/p\u003E\n\u003Cp\u003E\n Energy gain and loss is all about the angles.\n\u003C/p\u003E\n\u003Cp\u003E\nHTHs,\n\u003C/p\u003E\n\u003Cp\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"Hodari","CreatedById":157578,"CreatedDateTime":"2016-12-21T21:20:12Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222894187\u0022 data-ipsquote-contentid=\u0022153708\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221482224242\u0022 data-ipsquote-userid=\u002258162\u0022 data-ipsquote-username=\u0022psychopoak\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/20/2016 at 3:57 AM, psychopoak said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nApollo 11 used to go with the \u0022in front\u0022 approach\n\u003C/p\u003E\n\u003Cp\u003E\nas you figured out it takes a tiny bit more energy than the \u0022behind approach\u0022. However IIRC they chose this path in case of a malfunction in the engine when at the LOI point.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYeah, they used a \u0022free return trajectory\u0022 where if the engines failed altogether, the craft would end up going around the Moon and coming back to Earth more or less exactly on the correct path for reentry.  This ended up being very useful on Apollo 13.\n\u003C/p\u003E\n"}]}