{"TopicId":154543,"ForumId":16,"TopicTitle":"How bad can it get?","CreatedByName":"Palaceviking","CreatedById":166883,"CreatedDateTime":"2017-01-05T17:24:51Z","PageNum":1,"Articles":[{"CreatedByName":"Palaceviking","CreatedById":166883,"CreatedDateTime":"2017-01-05T17:24:51Z","Content":"\n\u003Cp\u003E\nI\u0027m wondering if anyone has had a career game go really south on them.\n\u003C/p\u003E\n\u003Cp\u003E\nReason being is I\u0027ve taken on about a dozen high rep high payout contract to do some pretty tuff stuff like flags on eve etc, however several years have passed and after killing several kerbals i gave up \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E  and decided to go science the jool system,  then i heavily scienced duna and I\u0027m currently sett up a pretty comprehensive logistics and life support network in the kerbin system.\n\u003C/p\u003E\n\u003Cp\u003E\nObviously all of these things have eaten into my millions considerably but I\u0027ve still got loads left and I\u0027m thinking if I blow the lot before the bailiffs turn up I could probably have a couple good \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003Essto\u003C/abbr\u003E\u0027s out around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003Eksc\u003C/abbr\u003E and then........what\u0027s the worst that could happen?\n\u003C/p\u003E\n\u003Cp\u003E\nOh and i still have six tourists stuck around from various uncompleted contracts(one of them is a level three!).\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2017-01-05T19:59:34Z","Content":"\n\u003Cp\u003E\nso are you in need of cash to finish the contracts?  or are you worried about the rep hit for not finishing them?\n\u003C/p\u003E\n"},{"CreatedByName":"Kerbal Fried Chicken","CreatedById":172854,"CreatedDateTime":"2017-01-05T20:13:08Z","Content":"\n\u003Cp\u003E\nI ruined my first career. Before I understood the vagaries of the contract system I took contracts I didn\u0027t have the skill or the tech to handle, or failed to read the fine print on height and speed of a parts test, or a 3-tourist contract but they all wanted to go different places. (Usually places I hadn\u0027t learned to go.) So I ended up with all contracts I couldn\u0027t do and no room for new ones that I could. I abandoned that career. But I learned to read the fine print. And later learned I could have rescued my game with judicious use of alt-f12.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-01-05T20:16:13Z","Content":"\n\u003Cp\u003E\nYeah, that\u0027s the extent of it: rep and kash. Look at the contracts in Mission Control -- they will tell you \u003Cem\u003Eexactly\u003C/em\u003E how much money a \u0022failure\u0022 will cost you. The reputation penalty is going to be huge. You obviously have a very high rep, being out at Jool -- and the rep penalty (which will look small on the contracts) gets multiplied many times over. I doubt it\u0027ll take you much below 250 on your rep, though. If you really want to try to precalculate it, you can do it in the debug menu.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Palaceviking","CreatedById":166883,"CreatedDateTime":"2017-01-05T20:32:41Z","Content":"\n\u003Cp\u003E\nI really want to focus on my infrastructure now and ignore the contracts without cheating, the world firsts are still trickling in kash and I still have over 19mil in contract advances and I\u0027m thinking about becoming an asteroid wrangler,  if the failures cause massive rep loss will I still be offered contracts? I kinda like doing the low key kerbin system missions. \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-01-05T22:11:04Z","Content":"\n\u003Cp\u003E\nYes, you always get contracts, but the types of contracts you are offered depends on your rep. Low rep means tourist, survey, and part testing contracts only. It\u0027ll be like you\u0027re back at the beginning of the game as far as contracts goes. You end up with the same problem if you kill a kerbonaut or tourist.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-05T22:12:52Z\u0022 title=\u002201/05/2017 10:12  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 5, 2017\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"}]}