{"TopicId":155148,"ForumId":16,"TopicTitle":"How to relay?","CreatedByName":"bertibott","CreatedById":112866,"CreatedDateTime":"2017-01-17T21:15:07Z","PageNum":1,"Articles":[{"CreatedByName":"bertibott","CreatedById":112866,"CreatedDateTime":"2017-01-17T21:15:07Z","Content":"\n\u003Cp\u003E\nHi,\n\u003C/p\u003E\n\u003Cp\u003E\nfirst I should mention that I am running a rather heavily modded install. Still my problem is with mechanics from the stock game.\n\u003C/p\u003E\n\u003Cp\u003E\nI am using the Galileo plent system. I sent a probe to the second moon (Ceti). This probe has some siency stuff on it and is also supposed to function as a relay. For this purpose it is fitted with an HG-5 High Gain antenna (this is the only \u0022real\u0022 antenna on it). This probe is orbiting in a circular, polar orbit at abit 200km (it was supposed to go to a higher orbit but ran out of fuel).\n\u003C/p\u003E\n\u003Cp\u003E\nSo now I launch a second probe. A lander this time. This one has a Communotron 16 on it. Unfortunatly I forgot to activate the antenna after my transfer burn (at the time the built in antenna in the probecore was enough). So after a while I lose the connection... but I think to myself not all is lost... I still have the probecore antenna and the relay... that shoudl fix things for me... right?\n\u003C/p\u003E\n\u003Cp\u003E\nBut when the lander gets closer to the relay it does not establish a connection.\n\u003C/p\u003E\n\u003Cp\u003E\nSo in short... a probecore antenna does not connect with the relay... How do I have to design a relay so that it will actually do its job? Do the probecore antennas not work with relays? Does a relay have to have multiple antennas?\n\u003C/p\u003E\n"},{"CreatedByName":"Benjamin Kerman","CreatedById":172792,"CreatedDateTime":"2017-01-17T21:36:34Z","Content":"\n\u003Cp\u003E\nFirst, check to make sure that the communitron 16 is extended. Even in the probe core can extend antennas, even when not connected to the DSN. Next, make sure that the HG-5 antenna is extended on the relay antenna. You might need a stronger relay antenna, or more relay antennas between the two craft. The HG-5 antenna is really crappy, so make sure that the HG-5 antenna can actually connect to the Kerbin equivalent. \n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-01-17T23:14:22Z","Content":"\n\u003Cp\u003E\nThere are various things that could go wrong, but I would guess that the most likely one is that your probe core simply wasn\u0027t within range of your relay.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222925203\u0022 data-ipsquote-contentid=\u0022155148\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484687707\u0022 data-ipsquote-userid=\u0022112866\u0022 data-ipsquote-username=\u0022bertibott\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bertibott said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut when the lander gets closer to the relay it does not establish a connection.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cem\u003E\u003Cu\u003EHow\u003C/u\u003E\u003C/em\u003E close?\n\u003C/p\u003E\n\u003Cp\u003E\nHG-5\u0027s power is 5000 km.  Probe\u0027s power (with the built-in antenna in the probe core) is 5 km.  Do the math, and the connection range between the two is 158 km.  That\u0027s pretty tight.  Did your probe pass within 158 km of the relay?\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222925203\u0022 data-ipsquote-contentid=\u0022155148\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221484687707\u0022 data-ipsquote-userid=\u0022112866\u0022 data-ipsquote-username=\u0022bertibott\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bertibott said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDoes a relay have to have multiple antennas?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo, just a single antenna will do the trick.\n\u003C/p\u003E\n\u003Cp\u003E\nDepending on the antenna, combining multiple antennas may boost the range somewhat, but not a lot (if you need more range, it\u0027s far more effective to move to a more powerful antenna type than to try to combine lots of little ones.)\n\u003C/p\u003E\n"}]}