{"TopicId":155614,"ForumId":16,"TopicTitle":"Jool 5 Itinerary Help","CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-26T19:50:47Z","PageNum":1,"Articles":[{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-26T19:50:47Z","Content":"\n\u003Cp\u003E\nHi all,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m ok at building and flying aircraft but orbital maneuvers are not my thing, so i thought i better ask.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m currently attempting a Jool 5 mission with a rather large, \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E equipped, engine pod and external tank dropping spaceplane.      \n\u003C/p\u003E\n\u003Cp\u003E\nThe first stop on the tour was Laythe, where it refuelled with \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E.  On the way out of Laythe, the last of the air breathers were shed, so the only propulsion on the motherplane are its NERVs. \n\u003C/p\u003E\n\u003Cp\u003E\nI have a save file for it in orbit around Laythe, with 3800dV.            In the front of the cargo section is a rover (which i recommend jettisoning immediately as it\u0027s worthless).      At the rear is a rocket for Tylo.   This rocket also contains our \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E gear, and much of the aircraft\u0027s accommodation.  The rocket has very tight margins.    It needs to be released from LOW orbit.  It has a jettisonable tank that will be discarded during the descent to Tylo.    It will use its \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E gear to refuel on the surface, but  will have to jettison that stuff to get back to orbit.   The propulsion stage then separates and the kerbal-containing parts re-dock with the spaceplane using \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow my initial plan was just to start in the middle, and work outwards.    I thought this would save fuel on the transfer burns, but actually, the smallest burn that\u0027s sufficient to break orbit from Laythe adds so much velocity to your orbit around Jool that you end up with a PE between Tylo and Bop.   I had to use a lot of fuel slowing down again at Vall so as to not overshoot, in fact i went through 3600 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E getting from Laythe orbit to the surface of Vall !\n\u003C/p\u003E\n\u003Cp\u003E\nThe next thing is that the spaceplane is a bit marginal on \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E and reaction wheel torque for Vall.   It can land there ok. but if i fill up completely on \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E and Oxidizer (for the tylo rocket) \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E drops to 0.85, which means it cannot takeoff.\n\u003C/p\u003E\n\u003Cp\u003E\nI ended up ditching the rover,   filling my \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E tanks half full and leaving the OX empty, which gave me a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E of 1.15 to 1.     I managed to take off with that, and reach orbit with 1680dV remaining, by using a rather unconventional technique.      This is the second savegame point i have to work with.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/LzfsGzaS8b4?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nSo,  I think i got two main choices\n\u003C/p\u003E\n\u003Cp\u003E\n1) Continue from Vall orbit with our 1680dV.    Can this get us to the surface of Bop or Pol, where we can refuel?   If I can make it to either of these bodies, I can take off with a full load of liquid fuel and oxidizer , for the rocket, due to the low gravity.    Please note that once we do Tylo, we\u0027ve crossed the rubicon - our \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E equipment will have been left behind.\n\u003C/p\u003E\n\u003Cp\u003E\n2) Continue from the earlier save in Laythe orbit.    Go from Laythe to Bop or Pol, then see Vall just before Tylo or something like that.   Or perhaps just before returning home, when we\u0027ll be light on fuel anyway, and missing the mass of the rocket\u0027s propulsion stage and IRSU gear.\n\u003C/p\u003E\n\u003Cp\u003E\nNote,  you could just landed the Tylo rocket on Val, to save sending the plane down there, since  i think it could handle the trip without staging and still be usable for the dreaded T.      However,  driving the plane across the surface at high speed was a lot of fun and we got to see a good part of it, going down in the rocket lander we\u0027d be stuck in one spot.   Also,  bear in mind that both my save files i have no oxidizer onboard for the rocket, we need to go to bop or pol first to fill up.\n\u003C/p\u003E\n\u003Cp\u003E\nFor anyone that wants a play, here\u0027s the files\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/e8dwbp2v45lha3r/BACK%20IN%20LAYTHE%20ORBIT.sfs?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/e8dwbp2v45lha3r/BACK IN LAYTHE ORBIT.sfs?dl=0\u003C/a\u003E    \n\u003C/p\u003E\n\u003Cp\u003E\nabove is the Laythe orbit save\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.dropbox.com/s/2hgvp8988zc1g9h/after%20115to%201683dv.sfs?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/2hgvp8988zc1g9h/after 115to 1683dv.sfs?dl=0\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n..and this is the save from the orbit of Vall.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease note, the craft has a \u0022lounge\u0022 area that uses Kerbal Furniture mod parts, no wonder it\u0027s too heavy for Tylo !\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-01-26T20:48:17Z","Content":"\n\u003Cp\u003E\nI think you want to go back to the Laythe save and go to Tylo, as originally planned. Your ejection from Laythe can\u0027t have been right.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, you should be able to adjust your burn to exit such that you leave Laythe\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E with only a few m/s. So you can\u0027t possibly be stuck with an orbit that goes beyond Tylo. You want to stop burning shortly after your burn goes from being closed to open.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, If you burn so that you leave going prograde to Laythe\u0027s orbit, then your resulting orbit will be much higher than Laythe. If you exit retrograde to Laythe, your orbit will be much lower than Laythe. If you want something in between, then you exit with an angle in between prograde and retrograde. I suspect this is your problem. So I think you need to be a lot more vigorous moving your maneuver node around, looking for the proper spot (with the lowest \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E needed) that will get you an \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E at Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-26T21:14:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222935410\u0022 data-ipsquote-contentid=\u0022155614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485463697\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think you want to go back to the Laythe save and go to Tylo, as originally planned. Your ejection from Laythe can\u0027t have been right.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, you should be able to adjust your burn to exit such that you leave Laythe\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E with only a few m/s. So you can\u0027t possibly be stuck with an orbit that goes beyond Tylo. You want to stop burning shortly after your burn goes from being closed to open.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, If you burn so that you leave going prograde to Laythe\u0027s orbit, then your resulting orbit will be much higher than Laythe. If you exit retrograde to Laythe, your orbit will be much lower than Laythe. If you want something in between, then you exit with an angle in between prograde and retrograde. I suspect this is your problem. So I think you need to be a lot more vigorous moving your maneuver node around, looking for the proper spot (with the lowest \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E needed) that will get you an \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E at Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI\u0027d rather not go Laythe direct to Tylo, as landing on Tylo requires discarding my IRSU as stated in the \u003Cabbr title=\u0022Original Post(er). The first post in a thread, or the person who posted it.\u0022\u003EOP\u003C/abbr\u003E.   The IRSU gear is on the tylo lander rocket, which has such slim margins , it can\u0027t take off again unless it jettisons the IRSU equipment.      So Tylo needs to be one of our last stops,   though we could probably call at one of the low grav bodies on the way out.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E of the inner 3 moons practically overlap, if they are lined up, you pretty much go straight from Laythe \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E to Vall to Tylo \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E without being in Jool \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E more than a few seconds.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIf the moons aren\u0027t all in line,  then literally the moment you add one more m/s to your orbit around Laythe and put yourself on an escape trajectory, you can find yourself in an elliptical orbit around Jool with an AP beyond Tylo.   It depends on your ejection angle from Laythe like you say - if it\u0027s prograde to Laythe\u0027s orbit of Jool, then you end up \u0022far out\u0022.     \n\u003C/p\u003E\n\u003Cp\u003E\nLooks like i should have gone Laythe \u0026gt; Bop \u0026gt; Vall \u0026gt; Pol -\u0026gt; Tylo    or   Laythe \u0026gt; Bop \u0026gt; Pol \u0026gt; Tylo \u0026gt; Vall\n\u003C/p\u003E\n\u003Cp\u003E\nbut i think i\u0027ll run with the second save, so long as  i can reach Pol the mission can proceed\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2017-01-27T02:50:13Z","Content":"\n\u003Cp\u003E\nYeah, it seems anomalous that you\u0027d go straight from barely getting out of Laythe\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E to an orbit way out in the boonies.  Sometimes, if you barely clear your original \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, you can end up getting recaptured (here, by Laythe) and then flung out with an unintended gravity \u0022assist.\u0022  That can lead to weird orbits showing up.  Or maybe some mod is causing problems?  I tried to open your save but the mods weren\u0027t compatible so I ended up with a weird asteroid near Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyhow, I punched up an 80km Laythe circular orbit and created a maneuver node to get my apoapsis out to Vall.  There\u0027s no intercept here since the phase angles weren\u0027t right, but it should work fine at the right time.  I don\u0027t imagine it would more than a few hundred delta-v to capture and circularize here.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n Like \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154251\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0022 rel=\u0022\u0022\u003E@bewing\u003C/a\u003E says, it may be helpful to move your maneuver node around a bit.  Ideally, to get the cheapest transfer, you want it so your periapsis does not extend beyond Laythe\u0027s orbit.  (The flipside of that is that your apo is as far out as possible for a given delta-v burn). Perfect Hohmann, in other words.  Of course, that optimal transfer only works if you have the right launch window.  Some small corrections may be needed if the target is not in the exact right place, and for plane change issues.  \n\u003C/p\u003E\n\u003Cp\u003E\nWhen you\u0027re only clearing \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E by a little bit, you get a lot of gravity deflection in your trajectory, so it can end up looking a bit weird.  So I find it\u0027s more reliable to look at the orbit around Jool than your ejection path from Laythe.  \n\u003C/p\u003E\n\u003Cp\u003E\nPic of Laythe to Vall transfer - ~600 m/s:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022vg5tKcj.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/vg5tKcj.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nClose up of Laythe portion of same transfer:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222AiAuXh.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/2AiAuXh.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Gordon Fecyk","CreatedById":157121,"CreatedDateTime":"2017-01-27T18:43:47Z","Content":"\n\u003Cp\u003E\nI was wondering how you were doing. Back when you were asking for gravity assist help, I took your save and tried to fly your proposed mission.\n\u003C/p\u003E\n\u003Cp\u003E\nHaving Ferram Aerospace installed made the Laythe landing interesting and the takeoff impossible, but that\u0027s just me asking for the pain; if I could reach 250 m/s airspeed the rest of the ascent would work. Your craft loves to pitch up.\n\u003C/p\u003E\n\u003Cp\u003E\nVall was rather hard; without the Rapiers in closed-cycle still attached, I couldn\u0027t hand the whole ship safely. And I had no idea how you were going to take off from Vall with a full load of fuel and oxidizer without some kind of long, high jump ramp, because I sure couldn\u0027t. And there was no point in putting monopropellant in the Mk3 cockpit back on Laythe; that was silly of me to take on so much extra mass.\n\u003C/p\u003E\n\u003Cp\u003E\nAt one point I landed, refueled and launched your complete Tylo lander at Vall. Maybe after a few runs back and forth I could have refueled your mother ship in orbit as long as I didn\u0027t put any oxidizer in the top tank.\n\u003C/p\u003E\n\u003Cp\u003E\nI never did get past Vall. That moon has surprisingly strong gravity and a more surprising orbital speed. The transfer from Laythe to Vall wasn\u0027t stupidly expensive though; no more than 1200 m/s if I recall. A Laythe-Laythe outward assist might have saved some \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-01-27T19:23:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222936377\u0022 data-ipsquote-contentid=\u0022155614\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485542627\u0022 data-ipsquote-userid=\u0022157121\u0022 data-ipsquote-username=\u0022Gordon Fecyk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, Gordon Fecyk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI was wondering how you were doing. Back when you were asking for gravity assist help, I took your save and tried to fly your proposed mission.\n\u003C/p\u003E\n\u003Cp\u003E\nHaving Ferram Aerospace installed made the Laythe landing interesting and the takeoff impossible, but that\u0027s just me asking for the pain; if I could reach 250 m/s airspeed the rest of the ascent would work. Your craft loves to pitch up.\n\u003C/p\u003E\n\u003Cp\u003E\nVall was rather hard; without the Rapiers in closed-cycle still attached, I couldn\u0027t hand the whole ship safely. And I had no idea how you were going to take off from Vall with a full load of fuel and oxidizer without some kind of long, high jump ramp, because I sure couldn\u0027t. And there was no point in putting monopropellant in the Mk3 cockpit back on Laythe; that was silly of me to take on so much extra mass.\n\u003C/p\u003E\n\u003Cp\u003E\nAt one point I landed, refueled and launched your complete Tylo lander at Vall. Maybe after a few runs back and forth I could have refueled your mother ship in orbit as long as I didn\u0027t put any oxidizer in the top tank.\n\u003C/p\u003E\n\u003Cp\u003E\nI never did get past Vall. That moon has surprisingly strong gravity and a more surprising orbital speed. The transfer from Laythe to Vall wasn\u0027t stupidly expensive though; no more than 1200 m/s if I recall. A Laythe-Laythe outward assist might have saved some \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n--\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe mission report thread is here  -\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/155135-the-liv-tylo-a-jool-5-odyssey/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThere\u0027s some pictures of the Kerbin launch, the laythe approach and landing (in the dark, on the side of a mountain, with stock visual enhancements - ie. no ambient light at all).   Far more dangerous than any of this, is some footage of a poor Kerbal trying to use it\u0027s bathroom (extremely dangerous, can spaghettify the Kerbal and destroy the ship) and also of the rover trying to kill off its passengers one by one.\n\u003C/p\u003E\n\u003Cp\u003E\nWith stock aero, landing on Laythe at 4km altitude took place at about 40 m/s.   I think by the time we get back to Kerbin we\u0027ll be under 30 with all the mass-shedding.  Takeoff was rather underpowered and it takes for-ever to accelerate, but does at least like to keep pointing in the same direction if you don\u0027t touch anything so it was mostly 40 minutes of pressing the screen grab button.\n\u003C/p\u003E\n\u003Cp\u003E\nDeparture from Laythe was with max \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E and no ox.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/AiMmmfOj8Qk?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nDeparture from Vall was with half \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E and no Ox.    If you thought my Laythe departure was sketchy, see this -\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/LzfsGzaS8b4?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nI don\u0027t know if i can reach Pol with the delta V i have.  Taking off with any more fuel on board seems unlikely.    \n\u003C/p\u003E\n\u003Cp\u003E\nI have two fallback plans\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nGet a gravity assist from Tylo to Pol.   It might make the difference\n\u003C/li\u003E\n\u003Cli\u003E\nGo back to a save on the surface of Vall,  and find a way to separate the Tylo lander.  Fly it to orbit under its own power.  The plane will then be able to get off with a lot more \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E on board - in orbit it can then re-dock with the lander, and carry it to Pol.   How do i separate them though? (drive the rover under it to force it out the cargo bay?)\n\u003C/li\u003E\n\u003C/ol\u003E\n"}]}