{"TopicId":155798,"ForumId":16,"TopicTitle":"Docking help","CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-30T18:51:41Z","PageNum":1,"Articles":[{"CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-30T18:51:41Z","Content":"\n\u003Cp\u003E\nI need help with the docking tutorial in the game. I was trying to complete them all and I\u0027ve done them all up to the docking one where I get stuck. So the part I am having issue with is I get the orbit right. Then I have to get my transfer orbit within 5km of the other ship. That\u0027s tough but I have done it before. Now comes the real kicker. So I need to slow down so I don\u0027t miss it. It says you should start slowing down when you are under 15 km. So I have two questions 1st. How do I know when I am under 15 km. 2nd. When I do start slowing down my separation between the two they become so far apart it is impossible to catch back up to without speeding up again. I\u0027ve been looking at videos of tutorials and can\u0027t seem to find any info on helping me and I have only found 1 video of someone completing this tutorial. Please any help would be really appreciated, thank you.\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2017-01-30T20:36:41Z","Content":"\n\u003Cp\u003E\nwhen your approaching your target, you can have your ship point towards one of the pink markers, you can use this to know where to point your screen to see if coming into view.  With it selected as a target, its distance should be displayed automatically.\n\u003C/p\u003E\n\u003Cp\u003E\nWhen in map view and focused on your own vessel, you can hover your mouse over the \u0022I\u0022 icon and itll should your max accel in m/s.   divide the velocity difference by that number and youll know how long your braking burn will take. I generally do start my burns that far ahead and sacrifice the small distance advantage to just it just perfect.\n\u003C/p\u003E\n\u003Cp\u003E\nIn map view, if you hover your mouse over the intercept location, it should have a time to closest approach, if you right click that data should stay locked onto the map view until you close it.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nMake sure your navball is set to target as well,\n\u003C/p\u003E\n"},{"CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-30T21:47:08Z","Content":"\n\u003Cp\u003E\nSo you are saying as I am approaching. I know the navball should be in target mode but I should be aimed at the target or anti-target?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-01-30T21:50:48Z","Content":"\n\u003Cp\u003E\nI think DD_bwest\u0027s answer may need some clarification.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, 1st. There are two \u0022views\u0022, and you can switch back and forth between them at any time. There is \u0022flight\u0022 view, and \u0022map\u0022 view. In map view, you can see all the orbits. To see a distance readout: you click on your target, click the \u0022Set as Target\u0022 button, and then the key concept is hovering your mouse. If you hover over the target, it shows the distance. Alternately, if you flip to flight view, it always shows the distance to any object within 30km. Within 5km or so, it also shows the name of the object -- but you have to be looking in the correct direction. You need to pan around until you spot your target. If you hover your cursor over your target, it will again show additional information.\n\u003C/p\u003E\n\u003Cp\u003E\n2nd. Once you get really really good at docking, you will be able to perform a continuous braking in various directions all the way until you are right next to the target. As it is, as you say, you do truly want to brake all the way down to nearly 0 relative velocity. At that point, you will be farther than 5 km away (somewhere between 5 and 15km). Then you turn and point your nose at the target and accelerate towards it. Then when you get a lot closer you turn around and brake back to 0 relative velocity again. Then repeat.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2017-01-30T21:56:40Z","Content":"\n\u003Cp\u003E\nThe docking tutorial uses a stop/start method so you\u0027re supposed to speed up again after you\u0027ve cancelled your relative speed. The idea is that you get close, kill your relative velocity by pointing at the retrograde mark in target mode (not target retrograde) ,then point to the target marker and thrust towards it (in map view you can watch the approach markers get closer in this phase). Doing this two or three times should get you a rendezvous at a relatively slow speed.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-30T22:17:00Z","Content":"\n\u003Cp\u003E\n\u003Cimg alt=\u00221LmFsAn.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/1LmFsAn.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo maybe I made things sound like I didn\u0027t know what I am doing. But right here is were I have a big problem. I Want to know where is the thing that tells me if I am about 15 km away from the target and how to slow down without causing the separation to well separate. \n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2017-01-30T22:26:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222939489\u0022 data-ipsquote-contentid=\u0022155798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485812828\u0022 data-ipsquote-userid=\u0022174425\u0022 data-ipsquote-username=\u0022jacob_sword\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n58 minutes ago, jacob_sword said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo you are saying as I am approaching. I know the navball should be in target mode but I should be aimed at the target or anti-target?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\naiming at target or anti target will tell you where your target is when you are in flight view.  so instead of panning around aimlessly looking for it, if your ship is pointed at it, you can look in the direction your ship is pointing and you will see it off in the distance.   its a quick easy way to orientate yourself so that you are looking in the right direction to spot your target.   after you have your bearing and know where your target is, you can then put your ship back on retrograde so that you are ready to cancel out your velocity at closest approach.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222939525\u0022 data-ipsquote-contentid=\u0022155798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485814620\u0022 data-ipsquote-userid=\u0022174425\u0022 data-ipsquote-username=\u0022jacob_sword\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n29 minutes ago, jacob_sword said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://i.imgur.com/1LmFsAn.png\u0022 rel=\u0022external nofollow\u0022 title=\u0022Enlarge image\u0022\u003E\u003Cimg alt=\u00221LmFsAn.png\u0022 class=\u0022ipsImage ipsImage_thumbnailed\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/1LmFsAn.png\u0022 width=\u00221000\u0022\u003E\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSo maybe I made things sound like I didn\u0027t know what I am doing. But right here is were I have a big problem. I Want to know where is the thing that tells me if I am about 15 km away from the target and how to slow down without causing the separation to well separate. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n  the small I on the right hand side at the top will tell you how fast you can accell,  divide your 280.8 m/s by that number and perform your burn that many seconds before your intersect point, and it will have you stopped in relation to your target very close to your 10.3 mark, it may be off by a few hundred meters.    Once at that point you need to start a process of pointing yourself at the target, nudging yourself towards it, and cancelling out that velocity at the new closest approach, and you continue until you are sub 50m.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nedit:  and as bewing said, if you hover your mouse over your target in map view and right click, it will lock its data on the screen and show you its distance.   you dont need to do it as soon as you enter 15km,  all you need to do for the tutorial is be within 15km and have your relative velocity below 50m/s.  \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-01-30T22:49:12Z\u0022 title=\u002201/30/2017 10:49  PM\u0022 data-short=\u00227 yr\u0022\u003EJanuary 30, 2017\u003C/time\u003E by DD_bwest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-30T22:54:25Z","Content":"\n\u003Cp\u003E\nokay I will try thanks.\n\u003C/p\u003E\n"},{"CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-30T22:57:30Z","Content":"\n\u003Cp\u003E\nSo hold on one sec. So I looked at the max speed and it says 14.1 meters per sec. So do the math like you said and I get 19.9148 and so on. So I start slowing down 19 or 20 seconds before the point of contact?  \n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2017-01-30T23:18:00Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222939577\u0022 data-ipsquote-contentid=\u0022155798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485817050\u0022 data-ipsquote-userid=\u0022174425\u0022 data-ipsquote-username=\u0022jacob_sword\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 minutes ago, jacob_sword said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo hold on one sec. So I looked at the max speed and it says 14.1 meters per sec. So do the math like you said and I get 19.9148 and so on. So I start slowing down 19 or 20 seconds before the point of contact?  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nessentially, it doesnt need to be perfect, its just a quick way to guesstimate when to do the burn.  its not perfect since as your slowing down before your point, it will take longer to get there  but all your really looking for is to get close to that intercept point.   there are ways to get it alot more dead on and come to stop within 100m of the target, but that comes with time\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-01-30T23:19:31Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222939525\u0022 data-ipsquote-contentid=\u0022155798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485814620\u0022 data-ipsquote-userid=\u0022174425\u0022 data-ipsquote-username=\u0022jacob_sword\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n51 minutes ago, jacob_sword said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022color:rgb(39,42,52);font-family:\u0027Helvetica Neue\u0027, Helvetica, Arial, sans-serif;font-size:14px;font-style:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255,255,255);float:none;\u0022\u003E\u003Cspan\u003E \u003C/span\u003EI Want to know where is the thing that tells me if I am about 15 km away\u003C/span\u003E\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYour ship is the one on the blue line. The target ship is the one on the yellow line. Hover your mouse over the ship on the yellow line. Right-clicking on it is even more helpful, as DD_bwest said.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222939525\u0022 data-ipsquote-contentid=\u0022155798\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221485814620\u0022 data-ipsquote-userid=\u0022174425\u0022 data-ipsquote-username=\u0022jacob_sword\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n56 minutes ago, jacob_sword said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhow to slow down without causing the separation to well separate. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is a hard trick to learn. You can use the trick DD_bwest said. There are other tricks, involving \u0022pushing\u0022 the retrograde marker around when you burn. These are advanced tricks that you learn by playing the game for many hours.\n\u003C/p\u003E\n\u003Cp\u003E\nWithout doing any tricks, the separation will \u003Cstrong\u003E\u003Cem\u003Ealways\u003C/em\u003E\u003C/strong\u003E increase when you burn. You have to accept that.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you really want to learn right now the advanced techniques of how to make the separation decrease when you burn, you will need to watch some youtube videos on docking maneuvers.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-30T23:22:24Z","Content":"\n\u003Cp\u003E\nOkay thank you guys so much. I\u0027m so close now. The other issue I have now is I am pointing at the target but I don\u0027t see it. Is there a key I have to hit to highlight the other ship or something? \n\u003C/p\u003E\n\u003Cp\u003E\nAlso I can not seem to get my relative velocity to 0. Each time I get close I\u0027m like at 3.3 m but then I get to 1.8 and then it goes back up. What am I doing wrong? \n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2017-01-30T23:28:04Z","Content":"\n\u003Cp\u003E\nare you manually holding your ship over retro grade, or do you click on the little circle to lock in on?\n\u003C/p\u003E\n\u003Cp\u003E\nalso when you get it down tot he 3m/s range, consider using your \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E instead of your main engines to get rid of the last little bit, itll be alot more precise.     hit R to make sure its on, and H is the key that pushes you forward. \n\u003C/p\u003E\n"},{"CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-30T23:29:35Z","Content":"\n\u003Cp\u003E\nI am using \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003Esas\u003C/abbr\u003E to switch between target and the retrograde. I am using \u003Cabbr title=\u0022Reaction Control System\u0022\u003Ercs\u003C/abbr\u003E as well.\n\u003C/p\u003E\u003Cp\u003E\nYeah now my separation is less then 1 km still don\u0027t see it but now my speed is about 10 so going back to retro to slow down which sucks cause now my speartation is going to go back up. Its like I can\u0027t seem to stop these two from moving.\n\u003C/p\u003E\n"},{"CreatedByName":"DD_bwest","CreatedById":164906,"CreatedDateTime":"2017-01-30T23:43:53Z","Content":"\n\u003Cp\u003E\ngetting it right takes practice,   turn off your \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E for everything but pushing yourself forward for now,  when your ship changes the way its pointing using the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters it pushes you sideways a bit messing things up.  if your ship is locked to retrograde, when you get that slow and nudge yourself forward with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E you should be able to get it down.  dont worry about your eventual intercept and seperation when slowing yourself down, youll be fixing it the next time you nudge yourself towards the target\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn real life application, the Dragon capsule when bringing supplies to the ISS does a process that moves it closer and stops until its right up to it.   They do this for safety reasons, so they dont have it coming in real close to the station at a high rate of speed lol\n\u003C/p\u003E\n"},{"CreatedByName":"jacob_sword","CreatedById":174425,"CreatedDateTime":"2017-01-31T00:01:48Z","Content":"\n\u003Cp\u003E\nI DID IT!!!!!!            \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThank you guys so much for helping me!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GgoyJx0.png\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/GgoyJx0.png\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tomf","CreatedById":57809,"CreatedDateTime":"2017-01-31T16:14:45Z","Content":"\n\u003Cp\u003E\nFor a slightly more advanced technique\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nWait until you are about 1 minute before your closest intercept. You can see that from the map view but I use Kerbal engineer or kerbal alarm clock\n\u003C/li\u003E\n\u003Cli\u003E\nEnsure you are in target mode\n\u003C/li\u003E\n\u003Cli\u003E\nfind the anti target marker and the retrograde marker\n\u003C/li\u003E\n\u003Cli\u003E\naim at the point that is opposite the anti-target marker around the retrograde marker. E.g. if you draw a line from your aim point to the anti-target marker the retrograde marker should be in the middle of that line.\n\u003C/li\u003E\n\u003Cli\u003E\nburn, fairly gently\n\u003C/li\u003E\n\u003Cli\u003E\nyou will see the retrograde marker move away from your aim point towards anti-target direction. When retrograde is on top of anti target stop burning \n\u003C/li\u003E\n\u003Cli\u003E\nyou are now heading straight at the target at a slower relative speed than before, your closest intercept point is further away in time, but will be closer than before.\n\u003C/li\u003E\n\u003Cli\u003E\nwait till you are only 30 seconds away and repeat.\n\u003C/li\u003E\n\u003C/ul\u003E\n"}]}