{"TopicId":156292,"ForumId":16,"TopicTitle":"Instability of giant fairings - Kraken food?","CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2017-02-11T10:40:35Z","PageNum":1,"Articles":[{"CreatedByName":"Magzimum","CreatedById":167187,"CreatedDateTime":"2017-02-11T10:40:35Z","Content":"\n\u003Cp\u003E\nSo I have an Eve lander for 3 Kerbals, with a rather un-aerodynamic mothership attached to it. It needs to be launched, and for fun I would like to avoid the \u0022going up straight until drag is no longer an issue\u0022. So I put a huge fairing around it.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002257UA7o8.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/57UA7o8.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nBut that thing is giving me a headache. The payload inside wobbles - it\u0027s moving from side to side already on the launchpad. Autostrut or real struts don\u0027t seem to do much. And if I strut it too much, it just explodes on the launchpad. \n\u003C/p\u003E\n\u003Cp\u003E\nBecause of Eve\u0027s ridiculous atmosphere the ship has giant wings on the top, so it is an aerodynamic disaster. Removal of the fairing therefore results in flipping as soon as start something that resembles a gravity turn. Below it\u0027s shown without the fairing. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022H4zXNtN.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022562\u0022 src=\u0022http://i.imgur.com/H4zXNtN.jpg\u0022 width=\u00221000\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAny tips how to stabilize large fairings? Or perhaps a confirmation that this fairing is just too large for the poor game engine? All comments are welcome.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-02-12T08:47:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222951699\u0022 data-ipsquote-contentid=\u0022156292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221486809635\u0022 data-ipsquote-userid=\u0022167187\u0022 data-ipsquote-username=\u0022Magzimum\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, Magzimum said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nAny tips how to stabilize large fairings? Or perhaps a confirmation that this fairing is just too large for the poor game engine?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNeither/nor. This isn\u0027t a fairing issue. This is a payload issue. The thing you are trying to launch just isn\u0027t stable enough. The game borks out on you not because there\u0027s a fairing, but because the thing inside the fairing is clipping through it as it wobbles, causing all sorts of unintended effects.\n\u003C/p\u003E\n\u003Cp\u003E\nYou might not like it, but you\u0027ll have to redesign that craft. The easiest solution I can see is splitting it in two: you launch the main craft first, with a docking port in place where the wing cluster should connect. Then you launch the wing cluster separately and dock it in Kerbin orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2017-02-12T08:57:06Z","Content":"\n\u003Cp\u003E\nA few options come to mind:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\nAs \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E says; Launch in sections and assemble in orbit.\n\u003C/li\u003E\n\u003Cli\u003E\nBuild in orbit with a mod like ExtraPlanetaryLaunchpads.\n\u003C/li\u003E\n\u003Cli\u003E\nDon\u0027t try to lift your entire Eve launcher. Make it lift itself! Use the engines and fuel! Then refuel in orbit.\n\u003C/li\u003E\n\u003Cli\u003E\nStrap your launch boosters to the side instead of the bottom.\n\u003C/li\u003E\n\u003Cli\u003E\nOnly shield the most offending parts with fairings.\n\u003C/li\u003E\n\u003C/ol\u003E\n"},{"CreatedByName":"paulprogart","CreatedById":174587,"CreatedDateTime":"2017-02-12T10:14:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222951699\u0022 data-ipsquote-contentid=\u0022156292\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221486809635\u0022 data-ipsquote-userid=\u0022167187\u0022 data-ipsquote-username=\u0022Magzimum\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 hours ago, Magzimum said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBut that thing is giving me a headache. The payload inside wobbles - it\u0027s moving from side to side already on the launchpad. Autostrut or real struts don\u0027t seem to do much. And if I strut it too much, it just explodes on the launchpad.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHow did you autostrut?  I\u0027ve had success stabilizing payloads in fairings by setting autostrut on some of \u003Cem\u003Ethe bottom parts inside the fairing\u003C/em\u003E to Heaviest.  Never on anything close to this big mind you, but it might be worth a try...\n\u003C/p\u003E\n\u003Cp\u003E\nTo work, the heaviest part as the game sees it needs to be on the launcher outside the fairing.  Then it will effectively create a bond from the autostrutted parts inside the fairing \u003Cu\u003Ethrough\u003C/u\u003E to the heavy part outside.  You can see the autostruts as orange lines on a part in the \u003Cabbr title=\u0022Vehicle Assembly Building\u0022\u003EVAB\u003C/abbr\u003E when toggling its autostrut mode.  (I can\u0027t remember if there\u0027s a hotkey that needs to be pressed first to turn that on, sorry.)\n\u003C/p\u003E\n\u003Cp\u003E\nOf course this may be considered a cheat, depending on how pure you want to be...\n\u003C/p\u003E\n"},{"CreatedByName":"Benoit Hage","CreatedById":104585,"CreatedDateTime":"2017-02-12T11:30:28Z","Content":"\n\u003Cp\u003E\nCould it be a part clipped that causes your problem? Are you sure every heavy part (all stages) is autostrut to the heaviest? Is your root part centered on your ship (no offset)? What happens if you empty the tanks from your lander, does your rocket still wobble?\n\u003C/p\u003E\n"}]}