{"TopicId":157030,"ForumId":16,"TopicTitle":"Space Junk","CreatedByName":"Tarsirrus","CreatedById":175322,"CreatedDateTime":"2017-02-26T22:37:15Z","PageNum":1,"Articles":[{"CreatedByName":"Tarsirrus","CreatedById":175322,"CreatedDateTime":"2017-02-26T22:37:15Z","Content":"\n\u003Cp\u003E\nI\u0027m starting to see lots of debris from previous launches build up in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and also round my Mun station. Is there some easy way to clean it all up? De-orbiting it is obvious but seems like a lot of work.\n\u003C/p\u003E\n\u003Cp\u003E\nThen are there any design tips I should be thinking of to minimise it in the future?\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-02-26T23:12:06Z","Content":"\n\u003Cp\u003E\nHello, and welcome to the forums!  \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222968830\u0022 data-ipsquote-contentid=\u0022157030\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488148635\u0022 data-ipsquote-userid=\u0022175322\u0022 data-ipsquote-username=\u0022Tarsirrus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, Tarsirrus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m starting to see lots of debris from previous launches build up in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E and also round my Mun station.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYep, it has a way of doing that...\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222968830\u0022 data-ipsquote-contentid=\u0022157030\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488148635\u0022 data-ipsquote-userid=\u0022175322\u0022 data-ipsquote-username=\u0022Tarsirrus\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 minutes ago, Tarsirrus said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there some easy way to clean it all up? De-orbiting it is obvious but seems like a lot of work.\n\u003C/p\u003E\n\u003Cp\u003E\nThen are there any design tips I should be thinking of to minimise it in the future?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLots of options!  Depends a lot on your desired play-style.  Different things bug different people.\n\u003C/p\u003E\n\u003Cp\u003E\nSome of the things you can do:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOption 1:  Just ignore it.\u003C/strong\u003E  It\u0027s not hurting anything.  The chances are basically zero that it will ever collide with anything.  It\u0027s not using up any significant amount of your computer\u0027s processing power.  And by default the game won\u0027t let it build up more than (IIRC) 250 debris, so it can\u0027t increase indefinitely.\n\u003C/p\u003E\n\u003Cp\u003E\nThe only reason you\u0027d \u003Cem\u003E\u003Cu\u003Eneed\u003C/u\u003E\u003C/em\u003E to clean it up is if it just bugs you that it\u0027s there.  That\u0027s totally a matter of taste-- it bothers some people, others don\u0027t care, others actually kinda \u003Cem\u003E\u003Cu\u003Elike\u003C/u\u003E\u003C/em\u003E having some junk floating around.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOption 2:  Reduce the limit, then just ignore it.\u003C/strong\u003E  The game has a built-in limit of how many debris it will allow to accumulate before it starts auto-deleting them.  By default, I think it\u0027s something like 250.  But that\u0027s a game setting, and you can lower it if you like.  So, if you don\u0027t mind having \u003Cem\u003E\u003Cu\u003Esome\u003C/u\u003E\u003C/em\u003E debris, but you just don\u0027t want a \u003Cem\u003E\u003Cu\u003Elot\u003C/u\u003E\u003C/em\u003E of it, then you could just lower this threshold and then ignore the debris.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOption 3:  Use the tracking station for house-cleaning.\u003C/strong\u003E  Go to the tracking station, then turn on the display of debris (by default it\u0027s hidden)-- you can toggle the individual ship types display-or-hide by clicking their icons on that thing at the top center edge of the screen.  Once you\u0027ve done that, the individual debris objects will show up in the ships list.  Just click on one, then click on the red \u0022Terminate\u0022 button down at the bottom.  The game will prompt you \u0022Are you sure?\u0022  Say yes, and \u003Cem\u003Epoof\u003C/em\u003E, gone is that piece of debris.  Repeat for as many debris items as you like.  Once you\u0027re done, you can turn off debris display again.\n\u003C/p\u003E\n\u003Cp\u003E\nIt can be tedious to do this, one by one, if you have a \u003Cem\u003E\u003Cu\u003Elot\u003C/u\u003E\u003C/em\u003E of debris.  But it\u0027s handy for cleaning up individual ones.  If you\u0027ve got a \u003Cem\u003E\u003Cu\u003Elot\u003C/u\u003E\u003C/em\u003E of debris and just want to do a one-time housecleaning, you could briefly lower your debris limit (to clean out a lot of it in one whack), then move it back up again.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you use this technique... be careful not to accidentally delete one of your \u0022real\u0022 ships!  The game\u0027s \u0022delete UI\u0022 is poorly designed-- it doesn\u0027t give you any clue what you\u0027re deleting, whether it\u0027s crewed, etc.  You just have to be super careful to click the correct button in the ships list.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOption 4:  \u003C/strong\u003E\u003Cstrong\u003EPlay in a way that doesn\u0027t generate debris in the first place.  \u003C/strong\u003EThis is a common practice for folks who have a principled stand against leaving debris around.  It\u0027s not too hard to do, if you design your ships \u0026amp; missions accordingly.  Ejected booster stages take care of themselves, as long as you take care to eject them while you\u0027re still suborbital.  Missions to other moons or planets can design so that they eject stages when they\u0027re on a collision course with the target body.  That leaves situations where you\u0027re in a stable orbit, and ejecting would lead to persistent debris.  So, either just don\u0027t eject in such circumstances (i.e. hang on to the thing-you-want-to-dispose-of until you\u0027re suborbital or on a collision course), or else design such stages to have their own small engines and some reserve fuel to deorbit themselves.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-02-27T02:59:15Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EOption 5: Roleplay that debris in orbit is worth its weight in gold.\u003C/strong\u003E This option requires tremendous amounts of roleplaying time, but it is very truthful to real life. Install \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E (and maybe some other shipbuilding mods) and put somebody up in orbit in a spacetug whose job is to gather up debris for reuse.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"FungusForge","CreatedById":148313,"CreatedDateTime":"2017-02-27T03:37:05Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222969012\u0022 data-ipsquote-contentid=\u0022157030\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488164355\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOption 5: Roleplay that debris in orbit is worth its weight in gold.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you won\u0027t be/aren\u0027t using \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E or off world construction mods, but still want to recycle some of the debris (such as large kerbodyne or rockomax fuel tanks) you could use claws to hook the parts up to the station as fuel tanks for visiting craft. If the debris has engines attached you can just put the thrust limit to 0.\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally I\u0027m a recycler, to the point of specially engineering rocket stages (read: slapping docking ports on) so that a future ship can dock to it easily.\n\u003C/p\u003E\n"},{"CreatedByName":"Loren Pechtel","CreatedById":157006,"CreatedDateTime":"2017-02-27T16:45:26Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222968853\u0022 data-ipsquote-contentid=\u0022157030\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221488150726\u0022 data-ipsquote-userid=\u0022125662\u0022 data-ipsquote-username=\u0022Snark\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n17 hours ago, Snark said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EOption 4:  \u003C/strong\u003E\u003Cstrong\u003EPlay in a way that doesn\u0027t generate debris in the first place.  \u003C/strong\u003EThis is a common practice for folks who have a principled stand against leaving debris around.  It\u0027s not too hard to do, if you design your ships \u0026amp; missions accordingly.  Ejected booster stages take care of themselves, as long as you take care to eject them while you\u0027re still suborbital.  Missions to other moons or planets can design so that they eject stages when they\u0027re on a collision course with the target body.  That leaves situations where you\u0027re in a stable orbit, and ejecting would lead to persistent debris.  So, either just don\u0027t eject in such circumstances (i.e. hang on to the thing-you-want-to-dispose-of until you\u0027re suborbital or on a collision course), or else design such stages to have their own small engines and some reserve fuel to deorbit themselves.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you\u0027re in low orbit it doesn\u0027t take much to bring an empty stage down.  I had it happen once unplanned--I forget where it came from but there was a beefy separation motor involved and it was enough to bring the stage down.  While I haven\u0027t tried it I strongly suspect a few separatrons would be enough to bring down at least a light stage.\n\u003C/p\u003E\n\u003Cp\u003E\nBeware, though, that to bring them down requires getting periapsis below IIRC 22km.  They will not be destroyed in atmosphere above this point!  The problem is the atmosphere doesn\u0027t work if they are not in physics range and the destruction altitude is outside physics range from even the lowest orbit.  Thus merely kicking them into the upper atmosphere doesn\u0027t get rid of them!\n\u003C/p\u003E\n\u003Cp\u003E\nPersonally, I play with the Stage Recovery mod so there is value in getting the debris down.  My usual approach is to make my main booster not quite powerful enough to reach orbit, I stage to my space engines during the circularization burn and the booster falls back.\n\u003C/p\u003E\n\u003Cp\u003E\nFor orbital missions where I\u0027m not carrying space engines I simply hold onto the booster during the first part of re-entry, I don\u0027t jettison until my periapsis is below 22km.  If you\u0027re only coming back from orbit the booster won\u0027t have a problem with the upper atmosphere.\n\u003C/p\u003E\n"},{"CreatedByName":"Tarsirrus","CreatedById":175322,"CreatedDateTime":"2017-02-27T21:44:31Z","Content":"\n\u003Cp\u003E\nThanks. If the debris starts auto deleting at 250ish I can live with that. I\u0027m only at about a 100 now which isn\u0027t much of a bother. Any idea if it is oldest first or something else?\n\u003C/p\u003E\n\u003Cp\u003E\nI like the sticking docking ports to all the big tanks and making a giant refuelling stop idea. I might adjust my stock launch unit to give that a try.\n\u003C/p\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2017-02-27T22:15:46Z","Content":"\n\u003Cp\u003E\nGenerally, what I do is design my rockets so that there\u0027s no debris left to worry about. Either have my lifter stages with a probe core and save some fuel for a retrograde burn back into the atmosphere or send them on ballistic trajectories.\u003Cbr\u003E\u003Cbr\u003E\nIn the event that there is simply no way around leaving debris behind (and depending on it\u0027s orbit), I\u0027ll build a special craft designed specifically for retrieval. Once I\u0027ve established that I \u003Cu\u003E\u003Cem\u003E\u003Cstrong\u003Ecan\u003C/strong\u003E\u003C/em\u003E\u003C/u\u003E recover anything derelict, I simply end the flight of future debris from the tracking station and call that a mission performed by someone other than myself.\u003Cbr\u003E\u003Cbr\u003E\nIt\u0027s kind of a hybrid of role play I suppose, but those are the rules that I give myself regarding debris.\n\u003C/p\u003E\n"}]}