{"TopicId":157660,"ForumId":16,"TopicTitle":"Final stage seperation","CreatedByName":"NFunky","CreatedById":128066,"CreatedDateTime":"2017-03-13T00:35:23Z","PageNum":1,"Articles":[{"CreatedByName":"NFunky","CreatedById":128066,"CreatedDateTime":"2017-03-13T00:35:23Z","Content":"\n\u003Cp\u003E\nHey guys, just had a quick question.  Why do all probes/satellites (particularly early ones) seperate from the final stage of their carrier rocket once they reach the proper trajectory/orbit?  And, is do any of those reasons matter in KSP?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve always done it, but I have no idea why.  I guess just because that\u0027s what I\u0027ve always seen them do.  In early career though, when trying to save every buck per launch, why ever bother?  Those TR-18A stack decouplers are $400 each, which I could spend on another RT-10 instead = more \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E/$.\n\u003C/p\u003E\n\u003Cp\u003E\nDoes everybody do integrated upper stages and I\u0027m just late to the party?  I\u0027m also talking about stock here, but what about \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E/\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E?  Does that change the equation a lot?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks!\n\u003C/p\u003E\n"},{"CreatedByName":"Gaarst","CreatedById":126740,"CreatedDateTime":"2017-03-13T00:41:00Z","Content":"\n\u003Cp\u003E\nMost real life rocket separate the last stage in GTO and the probe itself does the GEO insertion. Most probes actually have integrated propulsion systems for altitude control or manoeuvring, and upper stages can\u0027t always restart when you want or aren\u0027t designed to keep functioning for several months, so they ditch upper stages when they did their jobs and rely on their own systems.\n\u003C/p\u003E\n\u003Cp\u003E\nIn KSP separating the last stage is only useful if you have engines on your probe, otherwise you can just leave it there and save the cost of a decoupler. if your probe is just going to float there and won\u0027t move around, it\u0027s just a matter of looks: a satellite usually looks better on its own than with a big upper stage attached to it, but it\u0027s not necessary and doesn\u0027t bring any actual benefit.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2017-03-13T07:45:11Z","Content":"\n\u003Cp\u003E\nIRL you don\u0027t want a big fat fuel tank and engine attached that you have to drag around whilst doing station-keeping manoeuvres. It would be a waste of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E and make the craft unstable. In KSP though, you don\u0027t need to do station keeping so it doesn\u0027t matter. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-03-13T07:46:05Z\u0022 title=\u002203/13/2017 07:46  AM\u0022 data-short=\u00227 yr\u0022\u003EMarch 13, 2017\u003C/time\u003E by Foxster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-03-13T07:47:26Z","Content":"\n\u003Cp\u003E\nIn real life, there\u0027s such a thing as \u0022stationkeeping\u0022. That is the act of using \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to counteract the natural instability of orbits in a real N-body gravitational system. If your satellite doesn\u0027t actively maintain its orbit, it will be perturbed by Jupiter, by the Moon, and by local variations in Earth\u0027s magnetic field caused by local differences in surface material. (You get a different amount of gravity over the Sahara desert than over the Himalayas, or the North Pole. So your orbit starts to wobble.)\n\u003C/p\u003E\n\u003Cp\u003E\nIn KSP, we don\u0027t have any of these things. But if we did, it would make sense to ditch the final propulsion stage, because that would be extra mass that the \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E system needs to keep forced into the inbtended orbit. You\u0027d shorten the lifespan of the satellite by not decoupling the last stage, because it would have to consume that much more propellant for stationkeeping.\n\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2017-03-13T11:20:13Z","Content":"\n\u003Cp\u003E\nA few reasons that upper stages are separated from satellites in real life:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThe extra mass and offset of the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E is detrimental to the attitude control systems, whether \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or reaction wheels.\n\u003C/li\u003E\n\u003Cli\u003E\nThat mass also reduces the delta-V of the sat\u0027s propulsion system, which means it can do fewer station keeping or orbit adjusting maneuvers.\n\u003C/li\u003E\n\u003Cli\u003E\nThe stage casts a shadow that can interfere with solar power production.\n\u003C/li\u003E\n\u003Cli\u003E\nThe stage adds significant drag. The atmosphere at orbital altitude is awfully thin but not completely ignorable, additional drag means station keeping maneuvers are more frequent or greater in magnitude (or both).\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\nThe last one doesn\u0027t matter in KSP as the atmospheric pressure is truly zero in space, but the others matter (if less so than in real life).\n\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2017-03-13T11:31:14Z","Content":"\n\u003Cp\u003E\nUnless they call it Agena or Transtage. Then it can stay connected.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-03-13T15:21:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222984126\u0022 data-ipsquote-contentid=\u0022157660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489404013\u0022 data-ipsquote-userid=\u002212858\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Red Iron Crown said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe extra mass and offset of the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E is detrimental to the attitude control systems, whether \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or reaction wheels.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis one\u0027s also a significant difference between real life and KSP.  Real-life spacecraft generally need to spend \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E fuel not just for stationkeeping, but also for periodic attitude control, since real-life reaction wheels are just \u0022storage batteries\u0022 for angular momentum-- they can\u0027t actually create or destroy it.\n\u003C/p\u003E\n\u003Cp\u003E\nAs opposed to KSP, where, 1. the minor forces IRL that can cause attitude drift don\u0027t exist, 2. ship rotation is killed to precisely zero every time you switch ships or toggle timewarp, and 3. reaction wheels are physics-violating infinite sources of free angular momentum.\n\u003C/p\u003E\n\u003Cp\u003E\nSo, there\u0027s one \u003Cem\u003E\u003Cu\u003Emore\u003C/u\u003E\u003C/em\u003E reason why this is a thing that IRL ships need to do, but KSP ships don\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"NFunky","CreatedById":128066,"CreatedDateTime":"2017-03-13T15:45:59Z","Content":"\n\u003Cp\u003E\nThank you guys for all the quick answers.  I really appreciate it, and everything you all have said makes complete sense.  Does anyone know if there\u0027s a mod that adds station keeping to KSP?\n\u003C/p\u003E\n\u003Cp\u003E\nHonestly, I got to wondering about this question while recreating the early Soviet Luna missions.  Those probes were just metal spheres with antennae and basic scientific sensors.  No \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or attitude control at all I belive?  Certainly not much in the way of station keeping, since they were spending most of their time WAY out in cislunar space.  I\u0027m pretty sure that Luna 1 didn\u0027t even separate until it had left Earth\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, but it did still separate.  Even Sputnik separated from its booster, but I\u0027m guessing that was to reduce drag and extend orbital lifespan.\n\u003C/p\u003E\n\u003Cp\u003E\nI need to do more research myself obviously, but does anyone have any insights into this?\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-03-14T07:57:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00222984263\u0022 data-ipsquote-contentid=\u0022157660\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221489419959\u0022 data-ipsquote-userid=\u0022128066\u0022 data-ipsquote-username=\u0022NFunky\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n16 hours ago, NFunky said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDoes anyone know if there\u0027s a mod that adds station keeping to KSP?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere is one that I know of:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/116818-113-orbital-decay-v152-17072016-total-overhaul/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThe title says 1.1.3 but you can find a link to a 1.2.2 version on the last page of the thread. Can\u0027t tell how well it works, I\u0027ve never used it myself.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2017-03-14T08:18:07Z","Content":"\n\u003Cp\u003E\nOne more reason NASA et al dump the final stage and we don\u0027t (or shouldn\u0027t, whatever) is that NASA plans missions to a very high degree. When they\u0027re almost in orbit the insertion stage is actually out of gas, or nearly so. We (generally) just toss stuff together until it works.\n\u003C/p\u003E\n"},{"CreatedByName":"NFunky","CreatedById":128066,"CreatedDateTime":"2017-03-15T00:24:36Z","Content":"\n\u003Cp\u003E\nThank you so much!  I\u0027d seen that mod before, but it wasn\u0027t on \u003Cabbr title=\u0022Comprehensive Kerbal Archive Network (a KSP mod manager)\u0022\u003ECKAN\u003C/abbr\u003E for 1.2.2 and the thread does say 1.1.3, so I had no idea it was compatible!  Seems to work fine so far, but I haven\u0027t done any rendezvous or anything with it yet.\n\u003C/p\u003E\n"}]}