{"TopicId":15836,"ForumId":16,"TopicTitle":"Game Therad Context Failed","CreatedByName":"Bodhi","CreatedById":18337,"CreatedDateTime":"2012-08-01T00:35:17Z","PageNum":1,"Articles":[{"CreatedByName":"Bodhi","CreatedById":18337,"CreatedDateTime":"2012-08-01T00:35:17Z","Content":"\n\u003Cp\u003EKeep getting this fatal message when I try to run the game. Any idea on how to fix it?\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-01T00:38:28Z","Content":"\n\u003Cp\u003EI get this a lot, usually if I try to relaunch KSP just after closing it, it seems to tie up some system resources.\u003C/p\u003E\u003Cp\u003EIf it works for you the first time but not after that, take a look in your task manager, there might be a zombie instance of KSP preventing you from relaunching the game.\u003C/p\u003E\u003Cp\u003EAlso,\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=3909.0\u0022 rel=\u0022external nofollow\u0022\u003E look here.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2012-08-01T01:03:05Z","Content":"\n\u003Cp\u003EI used to get this all the time, even when I know there are no stray KSP processes running. I seem to have fixed it on my computer (mostly) by going to the KSP install folder, and right clicking the program icon and going into the Compatibility tab, then setting it to run in \u003Cstrong\u003EWindows Vista Service Pack 2\u003C/strong\u003E mode and checking the \u003Cstrong\u003ERun As Administrator\u003C/strong\u003E option too.\u003C/p\u003E\u003Cp\u003ENow I rarely get that error.\u003C/p\u003E\u003Cp\u003EIt didn\\\u0027t work when I made those changes to my desktop icon. Only on the actual .exe file itself.\u003C/p\u003E\u003Cp\u003EAnd I still get that error now and then, but I\\\u0027ve found if I run certain other games or programs, that sometimes fixes it.\u003C/p\u003E\u003Cp\u003EEdit: Oddly enough, I got this error again last night when I used my desktop shortcut (which has the same compatibility settings). But going to the install folder and clicking the actual program icon, it ran fine. I don\\\u0027t know if that made the critical difference, or it was something else. Just throwing this out there.\u003C/p\u003E\u003Cp\u003EPS Others have blamed Kaspersky and ESET antivirus software for this problem. I have ESET and followed everyone\\\u0027s advice (set the entire KSP folder to be an exception, etc), but it didn\\\u0027t help. Also, I have ESET at work and the game runs fine there, never a problem. So I\\\u0027m mystified.\u003C/p\u003E\u003Cp\u003EPS2 It\\\u0027s also been said this is not a KSP problem, but a Unity issue. That may be, as I sometimes see that same error with Lunar Flight, another Unity-based game. \u003C/p\u003E\n"},{"CreatedByName":"Bodhi","CreatedById":18337,"CreatedDateTime":"2012-08-01T16:06:39Z","Content":"\n\u003Cp\u003Erebooting seems to alleviate it, but it is a bit of a pain. I run ESET as well, but am not seeing a connection as it seems to continue even when I disable ESET.\u003C/p\u003E\u003Cp\u003EWho knows...\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-01T17:03:10Z","Content":"\n\u003Cp\u003ESome anti-virus programs are known to cause trouble, I don\\\u0027t know about eset in particular but if you have ever installed norton, you may find there is still remnants of it on your system.\u003C/p\u003E\u003Cp\u003EIf possible, try with no anti-virus, maybe by preventing eset from starting on boot, just don\\\u0027t download anything while testing and if you uninstall it, make sure you can reinstall it first.\u003C/p\u003E\n"},{"CreatedByName":"Freddman","CreatedById":33991,"CreatedDateTime":"2012-08-01T17:26:10Z","Content":"\n\u003Cp\u003EI get this issue my self from time to time.\u003C/p\u003E\u003Cp\u003EFor me it helps to run the game in windowed mode, and while the game is booting up, as soon as the SQUAD logo disappears and the \u0027Loading\u0027 screen starts I click and drag the screen around (the window turns black while dragging it around). I usually drag it around for a couple of seconds, release to see that it starts loading, then drags it around a little more. When it reaches around 20-30% loaded, is stop dragging it. Works 99% it of the time. \u003C/p\u003E\n"}]}