{"TopicId":158524,"ForumId":16,"TopicTitle":"what different antenna","CreatedByName":"horace","CreatedById":166359,"CreatedDateTime":"2017-04-01T10:34:49Z","PageNum":1,"Articles":[{"CreatedByName":"horace","CreatedById":166359,"CreatedDateTime":"2017-04-01T10:34:49Z","Content":"\n\u003Cp\u003E\nsomeone tell me whats the difference with relay antenna and direct and internal antenna\n\u003C/p\u003E\n\u003Cp\u003E\npls\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Numerlor","CreatedById":174198,"CreatedDateTime":"2017-04-01T10:52:37Z","Content":"\n\u003Cp\u003E\nInternal is only used around kerbin and you can\u0027t send science with it.\n\u003C/p\u003E\n\u003Cp\u003E\nDirect is used for transmitting science and to have signal for probe control\n\u003C/p\u003E\n\u003Cp\u003E\nRelay bounces signal from Kerbin around itself so lower tier direct antennas can connect to Kerbin\n\u003C/p\u003E\n"},{"CreatedByName":"horace","CreatedById":166359,"CreatedDateTime":"2017-04-01T10:53:24Z","Content":"\n\u003Cp\u003E\nthx\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-04-02T04:18:25Z","Content":"\n\u003Cp\u003E\nThis question about how to play the game has been moved to Gameplay Questions. \n\u003C/p\u003E\n"},{"CreatedByName":"kBob","CreatedById":102132,"CreatedDateTime":"2017-04-02T04:41:33Z","Content":"\n\u003Cp\u003E\nTake a look at this wiki page, I use it a lot, as I\u0027m always forgetting such details-- there\u0027s a lot of great comparison detail and more: \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Parts\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Parts\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2017-04-02T05:28:02Z","Content":"\n\u003Cp\u003E\nAlso worth noting that a relay antenna can do all the things a direct antenna can do, plus bounce signals to/from other craft.  So there may be most, size or mass reasons to pick a direct antenna, but relays are better from an antenna functionality perspective.  \n\u003C/p\u003E\n"},{"CreatedByName":"MaxwellsDemon","CreatedById":147660,"CreatedDateTime":"2017-04-03T18:33:02Z","Content":"\n\u003Cp\u003E\nOn my last campaign, before I figured antennas out for the most part, I had been overusing relay antennas-- the midsized dish relay (RA-15) in particular looks so appropriate for a Voyager-style probe that it was irresistible.   However, weight- and power-use -wise, it caused trouble-- the good old 88-88 dish is far better for that sort of thing.   The big relays should be saved for dedicated comsats.  They \u003Cu\u003Ecan\u003C/u\u003E send science, but they suck up twice or more of the power doing so, weigh more, and aren\u0027t foldable.\n\u003C/p\u003E\n\u003Cp\u003E\nBasically, considering antenna power and the distances to cover in the stock system, the Communotron 16 extendable or 16S fixed antenna is all you really need within the Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, though you\u0027ll need to have the tracking station upgraded to at least level 2 for Minmus operations.   If you\u0027re going anywhere outside Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, your tracking station needs to be at 2nd level at a minimum and you\u0027ll want to carry the HG-55 folding dish for the planets inside of Kerbin and maybe Duna and the 88-88 dish for all those farther out.  (To get anywhere past Dres, your tracking station has to be at level 3.)\n\u003C/p\u003E\n\u003Cp\u003E\nAll that is just considering straight Kerbin/probe commo.  Probe-to-probe/ship-to-ship communications can use smaller antennas if they\u0027re nearby, and the problem of \u0027blackout zones\u0027 like on the back of the Mun or behind other bodies with respect to Kerbin will need to be lived with or solved by relay comsats.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-03T20:00:28Z\u0022 title=\u002204/03/2017 08:00  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 3, 2017\u003C/time\u003E by MaxwellsDemon\u003C/strong\u003E\n\u003C/span\u003E\n"}]}