{"TopicId":15904,"ForumId":16,"TopicTitle":"How to get theese Space Stations in an Orbit?","CreatedByName":"FriedMunCake","CreatedById":33268,"CreatedDateTime":"2012-08-01T19:51:53Z","PageNum":1,"Articles":[{"CreatedByName":"FriedMunCake","CreatedById":33268,"CreatedDateTime":"2012-08-01T19:51:53Z","Content":"\n\u003Cp\u003EI have made two space stations and I want it in Orbit, I have Mechjeb, Zoxygene Mod, EPS (came with Zoxygene), Damned Robotics and Damned Aerospace Crew tank.\u003C/p\u003E\u003Cp\u003EI am hesitate about editing the persistence file, I will only do so if I see no other way\u003C/p\u003E\u003Cp\u003EIf you think I am crazy for making a space station when docking isn\\\u0027t included, well then I think you\\\u0027d like to look at Damned Robotics, I made docking clamps out of that.\u003C/p\u003E\n"},{"CreatedByName":"Fuflang","CreatedById":18629,"CreatedDateTime":"2012-08-07T10:12:29Z","Content":"\n\u003Cp\u003ELooks like you have quite a bit of fuel (in the form of full fuel tanks) as the body of the station, that is a lot of mass to try and put up into orbit. AKA it\u0027s really heavy and needs some extremely powerful rockets to get it into even the lowest orbit.\u003C/p\u003E\u003Cp\u003EI suggest you find a different part to make the body of your station.\u003C/p\u003E\n"},{"CreatedByName":"6677","CreatedById":890,"CreatedDateTime":"2012-08-07T19:08:43Z","Content":"\n\u003Cp\u003EOr use that fuel to get it into orbit\u003C/p\u003E\n"},{"CreatedByName":"FriedMunCake","CreatedById":33268,"CreatedDateTime":"2012-08-07T23:41:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Fuflang\u0022 data-cite=\u0022Fuflang\u0022\u003E\u003Cdiv\u003ELooks like you have quite a bit of fuel (in the form of full fuel tanks) as the body of the station, that is a lot of mass to try and put up into orbit. AKA it\u0027s really heavy and needs some extremely powerful rockets to get it into even the lowest orbit.\u003Cp\u003EI suggest you find a different part to make the body of your station.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe only thing is that The DYJ Crew Tank Only seem to blend with the new big stock fuel tanks\u003C/p\u003E\n"},{"CreatedByName":"BlazingAngel665","CreatedById":30182,"CreatedDateTime":"2012-08-08T04:27:45Z","Content":"\n\u003Cp\u003ENot to worry, a simple design will work 8.1/10 times. . . Use a decoupler, then put four large tanks below it and a large enging, then radially attach the same stack you just made in x6. Use fuel lines so the inside engine burns the fuel from the outside. Then set the staging so you fire seven engines at ignition. Tie together with struts, then add MORE struts. Then practice flying, it might not be easy to fly but a whole lot of rockets are worse. If the rocket weighs too much on the pad then use SRBs the old ones to kick start it (the new SRBS are puny) hope it helps.\u003C/p\u003E\u003Cp\u003EBA665\u003C/p\u003E\n"},{"CreatedByName":"Fuflang","CreatedById":18629,"CreatedDateTime":"2012-08-09T07:24:39Z","Content":"\n\u003Cp\u003ECheck out the Kosmos Parts pack in the addons showcase fourm. Those are some really good parts that should keep you busy for a while.\u003C/p\u003E\n"},{"CreatedByName":"togfox","CreatedById":17083,"CreatedDateTime":"2012-08-09T07:41:45Z","Content":"\n\u003Cp\u003EIf your after some realism then check out the orbital construction mod. If I design a craft I can\u0027t fly, I\u0027ll break it down and fly it to my space station in parts and the construct it in orbit. It\u0027s not the instant answer you are looking for but it is about playing the game after all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}