{"TopicId":159931,"ForumId":16,"TopicTitle":"FIrst time using Fuel Cells","CreatedByName":"blinktravis289","CreatedById":177279,"CreatedDateTime":"2017-04-29T11:37:33Z","PageNum":1,"Articles":[{"CreatedByName":"blinktravis289","CreatedById":177279,"CreatedDateTime":"2017-04-29T11:37:33Z","Content":"\n\u003Cp\u003E\nSo normally i dont really need to, i have the ability to use Solar Arrays most of the time, and have battery power in reserve to do what i need to do.  But i started a new project this weekend and fuel cells are the best option for it, which leads me to my question.  Is there a way to only turn on fuel cells when you need them?  Like when the battery gets below a certain point?  Im trying to build an aircraft to fly around Kerbin, non stop on only solar power and just a small amount of fuel.  So far, during the day i can rely mostly on solar power, but after some time my fuel cells need to kick on.  The issue is, that my fuel cells are running continuously and it\u0027s costing me fuel during flight,  fuel that i will need on the dark side of the planet.  Thank you for any assistance.\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-04-29T14:21:59Z","Content":"\n\u003Cp\u003E\nWelcome to the forums.\n\u003C/p\u003E\n\u003Cp\u003E\nThis more properly belongs in Gameplay Questions (and will no doubt be moved there by a moderator), but no matter, let\u0027s move on.\n\u003C/p\u003E\n\u003Cp\u003E\nFuel cells are great (arrays even better), depending on what you are using them for. In this case, they may not be too helpful, since they also require oxidizer. If this is an aircraft rather than a spacecraft, you probably don\u0027t wanna lug oxidizer around. Most engines have alternators though, and will recharge your batteries for you.\n\u003C/p\u003E\n\u003Cp\u003E\nAs an aside, fuel cells/arrays can be turned on or off by right-clicking on them and activating/deactivating. A good idea is to assign them to an action group for ease of use.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-29T14:22:33Z\u0022 title=\u002204/29/2017 02:22  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 29, 2017\u003C/time\u003E by Cpt Kerbalkrunch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Regor","CreatedById":175796,"CreatedDateTime":"2017-04-29T14:27:43Z","Content":"\n\u003Cp\u003E\nWelcome to the forums,\n\u003C/p\u003E\n\u003Cp\u003E\nAs \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/175588-cpt-kerbalkrunch/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022175588\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/175588-cpt-kerbalkrunch/\u0022 rel=\u0022\u0022\u003E@Cpt Kerbalkrunch\u003C/a\u003E said, it will probably be moved soon. Anyway, I never use fuel cells, (RTGs are an option) as they are bulky and need oxidiser. If you REALLY must use them, you can always set action groups.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nRegards,\n\u003C/p\u003E\n\u003Cp\u003E\nmabdi36\n\u003C/p\u003E\n"},{"CreatedByName":"TheKosanianMethod","CreatedById":163034,"CreatedDateTime":"2017-04-29T16:35:55Z","Content":"\n\u003Cp\u003E\nAs previously stated, the cells need oxidiser, and that\u0027s just extra mass to lug around. If you want, you can slap on a Juno engine (I \u003Cem\u003Ethink\u003C/em\u003E they have an alternator). If they don\u0027t have an alternator, use a Wheesley. \n\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t want to do either of those, or that\u0027s too much redesign, RTGs don\u0027t need fuel or sun, but they don\u0027t put out a ton of power, so you\u0027ll want to use several. Good luck!\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2017-04-29T16:50:40Z","Content":"\n\u003Cp\u003E\nMoving to Gameplay Questions.\n\u003C/p\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2017-04-29T17:09:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223038690\u0022 data-ipsquote-contentid=\u0022159931\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221493465853\u0022 data-ipsquote-userid=\u0022177279\u0022 data-ipsquote-username=\u0022blinktravis289\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, blinktravis289 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there a way to only turn on fuel cells when you need them?  Like when the battery gets below a certain point?  Im trying to build an aircraft to fly around Kerbin, non stop on only solar power and just a small amount of fuel.  So far, during the day i can rely mostly on solar power, but after some time my fuel cells need to kick on.  The issue is, that my fuel cells are running continuously and it\u0027s costing me fuel during flight,  fuel that i will need on the dark side of the planet.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nFuel cells already work like this: they only start working once your total EC drops below 95% of the available storage capacity, and once they recharge to over that, they stop again.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich means that you have either too much EC usage even when in the sun light, or you are short on solar panels to provide for everything. Hence the EC starts to drain, drops below 95% and the fuel cells kick in.\n\u003C/p\u003E\n\u003Cp\u003E\nKeep in mind that solar panel efficiency depends on the angle of the sun to the panel, so if you have your panels flush with the prograde direction of the fuselage (normally a smart thing to do, since otherwise they cause increasing drag), when the sun is moving towards the horizon behind you, your panels quickly drop in efficiency, and are likely falling short well before sunset.\n\u003C/p\u003E\n\u003Cp\u003E\nIt may be useful in this scenario to place a few panels facing directly to the back of the plane, so you can still get full efficiency out of those right up to the moment the sun sets. Depending on your craft, it may be worth the extra drag to do this.\n\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2017-04-29T17:24:18Z","Content":"\n\u003Cp\u003E\nAs stated so far, the situation in the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E is completely doable with stock parts.\n\u003C/p\u003E\n\u003Cp\u003E\nThere\u0027s a recent mod that can be very helpful with more complex situations involving fuel cells:\n\u003C/p\u003E\n\u003Ciframe data-embedcontent=\u0022\u0022 frameborder=\u00220\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/155547-12-fuelcelltweaks-v101/\u0026amp;do=embed\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nWhich adds a tweakable slider to change the activation threshold from the default 95% battery level, to whatever you want.  Seemed like a good place to mention it\n\u003C/p\u003E\n"},{"CreatedByName":"Wallygator","CreatedById":97357,"CreatedDateTime":"2017-04-30T12:45:20Z","Content":"\n\u003Cp\u003E\nAn important thing to remember with the stock implementation of fuel cells is that EC seems to not be affected by crossfeed - while LOX is.  This means that if you want to create a unitary fuel cell that runs off its own LOX supply (not drawing from your vessels fuel, then you need to isolate your fuel cell part along with an attached LOX tank (sized appropriately to provide the duty cycle you need).  The Clamp-o-tron jr. works well for this, just be sure to set its tweakable to disable cross feed.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso you can set an action group to turn on/off the fuel cells manually when you desire.\n\u003C/p\u003E\n"}]}