{"TopicId":159927,"ForumId":16,"TopicTitle":"Are you supposed to max out science parts?","CreatedByName":"Nightshredder","CreatedById":177275,"CreatedDateTime":"2017-04-29T09:43:32Z","PageNum":1,"Articles":[{"CreatedByName":"Nightshredder","CreatedById":177275,"CreatedDateTime":"2017-04-29T09:43:32Z","Content":"\n\u003Cp\u003E\nHello!\n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027ve recently started to play KSP and since I\u0027m quite the rookie at it I will of course have questions, most are searchable but some are more difficult to find the answer to. Anyway as the title suggests I wonder if you\u0027re actually supposed to add large amounts of out science parts on to your space craft. I mean you can only gather science from a certain surrounding one time so why not max out the reward? The reason why I\u0027m doubting it is all of the pictures I\u0027ve seen of others creations where they only have maybe one goo container instead of 8. Also it looks kind of ridiculous.\n\u003C/p\u003E\n\u003Cp\u003E\nSo if it\u0027s true that you\u0027re only supposed to have maybe one or two science parts then why?\n\u003C/p\u003E\n\u003Cp\u003E\nThanks in advance!\n\u003C/p\u003E\n\u003Cp\u003E\nPicture of what I mean by maxed out science: \u003Ca href=\u0022http://i.imgur.com/53vv6uw.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/53vv6uw.jpg\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-29T09:45:47Z\u0022 title=\u002204/29/2017 09:45  AM\u0022 data-short=\u00227 yr\u0022\u003EApril 29, 2017\u003C/time\u003E by Nightshredder\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"technicalfool","CreatedById":70430,"CreatedDateTime":"2017-04-29T10:22:10Z","Content":"\n\u003Cp\u003E\nReally, how many instruments you attach to a craft depends on what you\u0027re going to do with it. There\u0027s nothing stopping you from attaching a whole load of instruments to a lander probe, going to Minmus, and hopping around collecting science from every biome before coming back.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re sending a crewed mission or an experiment container, a lot of the science instruments can have their data transferred out and used again. If you\u0027re sending the data back by transmitting it rather than returning it, that frees up the instrument to use again. In those cases you only need one of each instrument, and you can then transmit everything back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, or transfer the science to the command pod or experiment container and use the instrument again. The exceptions are the Goo Container and Science Jr that need a scientist to reset them after removing the data.\n\u003C/p\u003E\n\u003Cp\u003E\nSo whether you want to take your time picking each body clean of science, or do whole planets at once with some kind of science strip-miner is up to you, and your budget assuming you\u0027re playing career mode.\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-04-29T11:32:33Z","Content":"\n\u003Cp\u003E\nWelcome to the the forums, good sir.\n\u003C/p\u003E\n\u003Cp\u003E\nAs \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/70430-technicalfool/\u0026amp;do=hovercard\u0022 data-mentionid=\u002270430\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/70430-technicalfool/\u0022 rel=\u0022\u0022\u003E@technicalfool\u003C/a\u003E (a staff member, no less), failed to extend this courtesy, rest assured that he will be publicly flogged as a warning to others.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, on to your question. He was right, of course. As long as your craft is manned (with a Kerbanaut, not a tourist), after gathering science you can EVA, right-click on the part in question (as long as you\u0027re close enough), and hit \u0022take data\u0022. When you reenter your command pod, the data is transferred to it. Each command pod can hold the data from each of your instruments (EVA and crew reports, too) from each biome that you visit. So you can gather all the science a planet/moon has to offer. You\u0027re only limited by your craft\u0027s ability to get there.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-29T11:34:56Z\u0022 title=\u002204/29/2017 11:34  AM\u0022 data-short=\u00227 yr\u0022\u003EApril 29, 2017\u003C/time\u003E by Cpt Kerbalkrunch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2017-04-29T13:46:12Z","Content":"\n\u003Cp\u003E\nAlso keep in mind that you can crew a single-kerbal spacecraft with a scientist if you stash a probe core somewhere.\n\u003C/p\u003E\n\u003Cp\u003E\nWith a scientist aboard, you can clean out several biomes with a single set of science gear.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/a/myIWu%23uMYeNKY\u0022 style=\u0022height:444px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2017-04-29T23:36:53Z","Content":"\n\u003Cp\u003E\nA few additional points to what the others have said. In the stock game there are a few experiments that cannot max out the science return value on the first reading. Goo canisters, science jr., surface samples, and I think a couple others will only collect about 60 to 70% of the total value on your first sample (if you are physically recovering the sample.) Bringing along an experienced scientist will increase this value, and you can store an extra copy in a duplicate of the experiment to further increase your return (with diminishing returns for each copy.)\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, adding a science container pod to your craft will greatly streamline the process of collecting science, especially if you have a scientist on board. By right clicking on the science container you can auto-collect all of the science data from all the experiments on your craft without even getting out to do it. This also allows you to keep an extra copy of the same set of science data in the same situation: for example, take a reading with the mystery goo, transfer it to the science container, reset the goo container with a scientist. Now you can take another reading in the same place with the same goo container and then transfer that copy to your command pod, and you could even repeat the process to keep a third copy of the same reading in the goo container itself to return to Kerbin. You now have three copies of that situation\u0027s data which should basically max out the potential science you can harvest in that area for that experiment.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-04-29T23:41:17Z\u0022 title=\u002204/29/2017 11:41  PM\u0022 data-short=\u00227 yr\u0022\u003EApril 29, 2017\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"}]}