{"TopicId":161219,"ForumId":16,"TopicTitle":"Right approach for interplanetary rendezvous with a polar orbit","CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2017-05-28T18:10:19Z","PageNum":1,"Articles":[{"CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2017-05-28T18:10:19Z","Content":"\n\u003Cp\u003E\nlast week i tried to get a ship to interplanetary rendezvous (from Vall) with another ship that was in a polar orbit around Laythe. \n\u003C/p\u003E\n\u003Cp\u003E\ni wanted to make the encounter that way i only had to adjust only one parameter to get the right inclination.  but how hard i tried i couldn\u0027t find the right time or angle to get the correct burn.\n\u003C/p\u003E\n\u003Cp\u003E\ni tried many different positions in the planets\u0027 orbit to get an encounter but that didn\u0027t work. even with a lot of prograde, radial and normal adjustments.\n\u003C/p\u003E\n\u003Cp\u003E\ni eventually had to pick a very inefficient encounter with laythe and had to make an adjustment burn of 17 degrees to get a proper encounter with the designated ship.  \n\u003C/p\u003E\n\u003Cp\u003E\nmy question is:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003Ehow do i get a ship efficiently aligned with a ship that is already in an certain polar orbit around another planet. \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m sorry if it all sounds a bit vague but I\u0027m currently not available to make a proper screenshots.  \n\u003C/p\u003E\n\u003Cp\u003E\ni could make some sketches in paint if that would be helpful. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-21T05:30:45Z\u0022 title=\u002206/21/2017 05:30  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 21, 2017\u003C/time\u003E by xendelaar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ohm is Futile","CreatedById":172721,"CreatedDateTime":"2017-05-28T19:33:16Z","Content":"\n\u003Cp\u003E\nShort answer would be to watch my video on encounters, as I do that exactly in it I believe: you can watch it \u003Ca href=\u0022https://youtu.be/JUqy-nIMlvE\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\nLonger text version: during interplanetary transfer, probably around your apoapsis if you\u0027re transferring from Kerbin, you should make a correction burn. (EDIT: basically, you don\u0027t want to be too close to the planet, but doing the adjustment burn too close to Kerbin is impractically efficient.) Put down a maneuver node and make sure the icon are showing, that will make the next step easier.\n\u003C/p\u003E\n\u003Cp\u003E\nNext, you want to find the celestial body you want to encounter on the map and click on it. Hit focus view or whatever that message to center your camera on it is. Scroll and wiggle until you can both see your maneuver node and the planet. Look for your trajectory from the original encounter you set up. Use the maneuver node to move that line around until it is at the desired height and inclination. Be very mindful of the direction you\u0027re coming in, you don\u0027t want to be on the right orbit in the wrong direction.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s it about it.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-28T19:35:18Z\u0022 title=\u002205/28/2017 07:35  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 28, 2017\u003C/time\u003E by Ohm is Futile\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2017-05-28T19:51:00Z","Content":"\n\u003Cp\u003E\nYou will always to be able to get \u003Cem\u003Ea\u003C/em\u003E polar orbit (by following \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/172721-ohm-is-futile/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022172721\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/172721-ohm-is-futile/\u0022 rel=\u0022\u0022\u003E@Ohm is Futile\u003C/a\u003E\u0027s instructions), but not necessarily the one you want for a rendezvous. It depends on each ship\u0027s direction of travel when it approaches Laythe. The ship waiting at Laythe is in an orientation determined by how Kerbin, Jool, and Laythe were aligned when you flew the first mission, and when you launch the second mission, they will have moved around and out of alignment with that initial polar orbit, so the second ship will approach from a different direction. A remote station in a polar orbit can be expensive in terms of delta V as compared to a station in an equatorial orbit, since you\u0027re guaranteed a cheap encounter for the latter.\n\u003C/p\u003E\n\u003Cp\u003E\nOne way to deal with that would be to capture yourself into a Jool orbit first, then try various encounters with Laythe from several angles, possibly waiting multiple orbits, until you find a good one. This allows your ship to approach Laythe from a variety of directions instead of just the one you happen to get by chance from the initial transfer.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-05-28T19:54:48Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223071292\u0022 data-ipsquote-contentid=\u0022161219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221495995019\u0022 data-ipsquote-userid=\u0022139535\u0022 data-ipsquote-username=\u0022xendelaar\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, xendelaar said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nhow do i get a ship efficiently aligned with a ship that is already in an certain polar orbit around another planet. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nShort answer: you can\u0027t, but there\u0027s workarounds.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLong answer: orbits are not bound to anything except the position of their focus point (which is the gravity well being orbited). Thus, as the focus travels, the orbit follows the focus and remains with it. However, that is all. The orbit does not follow anything other than the position. If the focus rotates, the orbit ignores it. If the focus itself orbits something else and thus takes a curved path, the orbit ignores the attitude change. It always* stays exactly, perfectly fixed in the same orientation it was when it was first established.\n\u003C/p\u003E\n\u003Cp\u003E\nThat means that any orbit, but especially polar orbits, will appear to \u0022drift\u0022 from the point of view of their focus. If you are on the Mun, and there is something in a polar orbit of it, you will notice that sometimes, this polar orbit is orientated so that the north pole pass will go in the prograde direction of the Mun\u0027s own path. But at another time, the north pole pass may be radial in, radial out, or even retrograde to the Mun\u0027s own path... or anything in between. That is because the Mun travels in a circle around Kerbin, but the polar orbit only follows the position. It does not turn with the circle to always face the same direction with respect to the Mun\u0027s path of travel**. So from Kerbin\u0027s point of view, the polar orbit is sometimes edge-on towards the observer, and sometimes shows its broad side.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich also works for Laythe, or course. Sometimes, a thing in a polar orbit of Laythe will be edge-on towards Jool. And sometimes it will be broad side on. And not only towards Jool... it can also be any position with respect to your arriving spacecraft. It can be aligned for rendezvous, it can be perpendicular, it can be anything in between. \u003Cem\u003EWhen\u003C/em\u003E exactly each phase happens depends solely on how and when the orbit was intially set up. If the orbit is not aligned for rendezvous when you arrive... well, tough luck. There\u0027s absolutely nothing whatsoever you can do. Go perform a plane change to align yourself after capture.\n\u003C/p\u003E\n\u003Cp\u003E\nTwo workarounds can mitigate the issue.\u003Cbr\u003E\n- One, if you arrive at the wrong time, that means that you \u003Cem\u003Eleft\u003C/em\u003E at the wrong time, resulting in intercepting Laythe at the wrong position in its orbit. Leave later, or leave sooner, or try wasting time or accelerating while already en route. Perhaps that way you can hit Laythe when the position is better.\u003Cbr\u003E\n- Two, if you\u0027re forced into a large plane change, try to employ your usual bag of tricks to make plane changes cheaper, especially the \u0022highly elliptical orbit\u0022 trick. First, circularize equatorial, then line yourself up under your target orbit, push the apoapsis waaaay out there, and once at apoapsis, flip your orbit polar. It will still be costly, but this method usually saves at least some \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n(* in a 2-body approximation like the one KSP uses, anyway)\n\u003C/p\u003E\n\u003Cp\u003E\n(** this is why a single polar satellites can scan an entire celestial body - regardless of whether or not the body itself rotates. The travels of the body around its own parent is enough to make sure the polar orbit passes over every single bit of surface eventually.)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-28T19:58:06Z\u0022 title=\u002205/28/2017 07:58  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 28, 2017\u003C/time\u003E by Streetwind\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ohm is Futile","CreatedById":172721,"CreatedDateTime":"2017-05-28T19:59:43Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223071439\u0022 data-ipsquote-contentid=\u0022161219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496001060\u0022 data-ipsquote-userid=\u0022156657\u0022 data-ipsquote-username=\u0022HebaruSan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, HebaruSan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n[snip]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRight, good point, Laythe is a satellite. Getting into a polar orbit is simple enough, but getting into the \u003Cem\u003Esame \u003C/em\u003Epolar orbit is not quite as easy. Yup, I would definitely recommend shooting for Jool first, doesn\u0027t even need to be a polar orbit of Jool (in fact, it probably shouldn\u0027t be) and wait for a good opportunity to transfer from Jool to Laythe with both matching orbits and inclinations and such.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2017-05-28T20:04:01Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223071454\u0022 data-ipsquote-contentid=\u0022161219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496001583\u0022 data-ipsquote-userid=\u0022172721\u0022 data-ipsquote-username=\u0022Ohm is Futile\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 minutes ago, Ohm is Futile said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ndoesn\u0027t even need to be a polar orbit of Jool (in fact, it probably shouldn\u0027t be)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nGood point of clarification; I was definitely imagining an equatorial Jool parking orbit for the encounter-hunting phase.\n\u003C/p\u003E\n"},{"CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2017-05-29T01:04:55Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0026amp;do=hovercard\u0022 data-mentionid=\u002298962\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/98962-streetwind/\u0022 rel=\u0022\u0022\u003E@Streetwind\u003C/a\u003E thanks for the thorough advice.\n\u003C/p\u003E\n\u003Cp\u003E\ni was in an equatorial orbit around Jool in this case (near Vall). and i tried to sit around and wait until i finally got a aligned encounter but after an hour fiddling with nodes i eventually gave up. \n\u003C/p\u003E\n\u003Cp\u003E\ni guess that wasn\u0027t a bad approach at all after all. maybe i should have waited longer. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nthanks again for the explanation\n\u003C/p\u003E\n"},{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2017-05-30T10:53:44Z","Content":"\n\u003Cp\u003E\nA economical way without a lot of maths and guesswork is to plot a node so that you will get a polar orbit, any polar orbit but with a low pe.\n\u003C/p\u003E\n\u003Cp\u003E\nGet to pe and close the orbit but only just so that the ap is as high as possible.\n\u003C/p\u003E\n\u003Cp\u003E\nDo a plane change from as close to ap as possible while raising your pe to that of the target.\n\u003C/p\u003E\n\u003Cp\u003E\nPlot your intercept.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-05-30T18:18:53Z","Content":"\n\u003Cp\u003E\nIf you are going for a non-equatorial orbit in your destination \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, then the plane of that orbit is determined by the timing of the moment when you arrive in that \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. If you want to change the plane, you have to change the timing. Which you do by either slowing down (relative to your target CB) before you hit the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E (so that it takes longer to get there), or speeding up to hit the \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E faster. So it takes a couple burns. You can\u0027t seriously do it by just setting one maneuver node.\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-05-31T15:56:44Z","Content":"\n\u003Cp\u003E\nThis is partly exacerbated by the fact that Vall and Laythe are in the same orbital plane; having some relative inclination between your initial and destination bodies offers you a chance to get at least a little help in setting up an encounter.  Since you don\u0027t have that, you have to provide all of the inclination yourself.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is even more exacerbated by the fact that you\u0027re trying to get the \u003Cem\u003Ecorrect\u003C/em\u003E polar orbit--the problem here is not the inclination but the longitude of ascending node, and the quirks of the Joolian system make it either exceptionally easy or exceptionally difficult to get encounters with the right longitude of ascending node, but without much in between those extremes.\n\u003C/p\u003E\n\u003Cp\u003E\nTo illustrate:  I will assume that you are starting in a Vall equatorial orbit.  You burn to transfer and put a little normal thrust into the burn so you leave Vall\u0027s sphere of influence at an inclined angle.  Let\u0027s assume that you can get an encounter with Laythe that is close to polar.  The periapsis of this encounter is going to be near the equator--but to efficiently change the longitude of ascending node, you really want the apsides to be over the poles.  However, you can\u0027t do that with an efficient transfer.\n\u003C/p\u003E\n\u003Cp\u003E\nThis happens because while you orbit Vall, your motion relative to Jool is going to follow Vall\u0027s orbit.  There will be some periodic oscillation because you are also moving relative to Vall, but the total motion will average to match Vall\u0027s orbit (as it should, because otherwise you wouldn\u0027t \u003Cem\u003Estay\u003C/em\u003E in Vall\u0027s orbit).  Even if you begin in a polar orbit of Vall and leave its sphere of influence directly over the north pole, you\u0027ll still move mostly in the same speed and direction as Vall--your total inclination relative to Vall\u0027s orbit about Jool would be about three degrees.  You can \u003Cem\u003Edeflect\u003C/em\u003E the speed and direction but you can\u0027t \u003Cem\u003Eignore\u003C/em\u003E them.  Any efficient transfer from Vall to Laythe is going to take advantage of the fact that they\u0027re moving in the same direction and plane around Jool (taking that advantage is what makes such a transfer efficient), and that in turn will cause you to enter Laythe\u0027s sphere of influence from the side relative to its poles.  This will always put your periapsis at or near the equator whether your orbital path is equatorial, polar, or anything in between.\n\u003C/p\u003E\n\u003Cp\u003E\nAs others have said, timing is important, but that will only work well if the craft you want to intercept also transferred in from Vall.  If it had, then you wouldn\u0027t be asking here how to do it, so instead I will tell you why you cannot do it:  orbital resonance.  Vall and Laythe are in a 1 : 2 orbital resonance (meaning that Laythe orbits Jool twice for each time Vall orbits once), and while this makes transfer windows regular, repeatable, and fairly common, it also means that that same regularity makes all of those windows identical.  There is room for some variation but if you vary it by too much then you\u0027ll miss the window altogether.\n\u003C/p\u003E\n\u003Cp\u003E\nThis leaves you with a few options.  First, you can try a bad transfer--if you get a Laythe \u0027encounter\u0027 where you just glance through the sphere of influence over one of the poles, then the periapsis will be over the pole. You will be able to close the orbit and adjust the longitude of ascending node fairly easily--in that order, because you\u0027ll need to bring big engines and a lot of fuel as you will have a lot of relative speed, not a lot of time to shed it, and \u003Cem\u003Eno\u003C/em\u003E help from the Oberth effect.  Inefficient transfers are inefficient for a reason.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, you can try corrective burns after you arrive at Laythe.  If it were me, I\u0027d choose to make an equatorial Laythe orbit and then change the inclination at the correct point so that I can align the longitudes of ascending node at the same time, thus performing two manoeuvres in one burn.\n\u003C/p\u003E\n\u003Cp\u003E\nThird, if your interceptor is also a lander, then you can spare yourself a \u003Cem\u003Elot\u003C/em\u003E of aggravation if you simply \u003Cem\u003Eland\u003C/em\u003E on Laythe\u0027s equator, wait until the orbit you want is overhead, and launch to match it, just as you would if it were Kerbin.  If landing was part of the mission profile to begin with, then you should be in good shape--unless the craft you want to intercept has the fuel you need to launch from Laythe, in which case ... oops?\n\u003C/p\u003E\n\u003Cp\u003E\nAlternatively, you can take a more scenic route.  Tylo is also in orbital resonance with Laythe (and Vall) so there may be something you can work with if you use Tylo as an intermediate.  Pol orbits Jool but is \u003Cem\u003Enot\u003C/em\u003E in orbital resonance with Vall or Laythe, so eventually, you are effectively guaranteed to get a transfer that has the correct orientation.  I leave it to you to determine whether \u003Cem\u003Eeventually\u003C/em\u003E will arrive in anything less than geologic time, and whether going to Pol to get to Laythe offers \u003Cem\u003Eany\u003C/em\u003E fuel savings.\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, you can do something that is in between getting a good encounter from Vall and getting a transfer from somewhere else; you can set up an intermediate orbit between Vall and Laythe and time the transfer from that to arrive at Laythe with the right parameters to easily match your chosen orbit.  Get into your intermediate orbit, make the node, and check the encounter.  If you don\u0027t like it, advance the node by an orbit and slide it up the orbital path until you get a new encounter.  Rinse and repeat until you get an encounter that you do like.  Assuming that each new Laythe encounter occurs at a different point on Laythe\u0027s orbit (stay away from orbital resonance), then each encounter should also have a different longitude of ascending node.  This is still theoretical--I prefer to correct from equatorial, as I said--so I don\u0027t know how well it would work, and there\u0027s no easy way to test without doing it, either.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-05-31T16:12:00Z\u0022 title=\u002205/31/2017 04:12  PM\u0022 data-short=\u00227 yr\u0022\u003EMay 31, 2017\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2017-05-31T17:21:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223074896\u0022 data-ipsquote-contentid=\u0022161219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496246204\u0022 data-ipsquote-userid=\u0022125721\u0022 data-ipsquote-username=\u0022Zhetaan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Zhetaan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThis is partly exacerbated by the fact that Vall and Laythe are in the same orbital plane; having some relative inclination between your initial and destination bodies offers you a chance to get at least a little help in setting up an encounter.  Since you don\u0027t have that, you have to provide all of the inclination yourself.\n\u003C/p\u003E\n\u003Cp\u003E\nThis is even more exacerbated by the fact that you\u0027re trying to get the \u003Cem\u003Ecorrect\u003C/em\u003E polar orbit--the problem here is not the inclination but the longitude of ascending node, and the quirks of the Joolian system make it either exceptionally easy or exceptionally difficult to get encounters with the right longitude of ascending node, but without much in between those extremes.\n\u003C/p\u003E\n\u003Cp\u003E\nTo illustrate:  I will assume that you are starting in a Vall equatorial orbit.  You burn to transfer and put a little normal thrust into the burn so you leave Vall\u0027s sphere of influence at an inclined angle.  Let\u0027s assume that you can get an encounter with Laythe that is close to polar.  The periapsis of this encounter is going to be near the equator--but to efficiently change the longitude of ascending node, you really want the apsides to be over the poles.  However, you can\u0027t do that with an efficient transfer.\n\u003C/p\u003E\n\u003Cp\u003E\nThis happens because while you orbit Vall, your motion relative to Jool is going to follow Vall\u0027s orbit.  There will be some periodic oscillation because you are also moving relative to Vall, but the total motion will average to match Vall\u0027s orbit (as it should, because otherwise you wouldn\u0027t \u003Cem\u003Estay\u003C/em\u003E in Vall\u0027s orbit).  Even if you begin in a polar orbit of Vall and leave its sphere of influence directly over the north pole, you\u0027ll still move mostly in the same speed and direction as Vall--your total inclination relative to Vall\u0027s orbit about Jool would be about three degrees.  You can \u003Cem\u003Edeflect\u003C/em\u003E the speed and direction but you can\u0027t \u003Cem\u003Eignore\u003C/em\u003E them.  Any efficient transfer from Vall to Laythe is going to take advantage of the fact that they\u0027re moving in the same direction and plane around Jool (taking that advantage is what makes such a transfer efficient), and that in turn will cause you to enter Laythe\u0027s sphere of influence from the side relative to its poles.  This will always put your periapsis at or near the equator whether your orbital path is equatorial, polar, or anything in between.\n\u003C/p\u003E\n\u003Cp\u003E\nAs others have said, timing is important, but that will only work well if the craft you want to intercept also transferred in from Vall.  If it had, then you wouldn\u0027t be asking here how to do it, so instead I will tell you why you cannot do it:  orbital resonance.  Vall and Laythe are in a 1 : 2 orbital resonance (meaning that Laythe orbits Jool twice for each time Vall orbits once), and while this makes transfer windows regular, repeatable, and fairly common, it also means that that same regularity makes all of those windows identical.  There is room for some variation but if you vary it by too much then you\u0027ll miss the window altogether.\n\u003C/p\u003E\n\u003Cp\u003E\nThis leaves you with a few options.  First, you can try a bad transfer--if you get a Laythe \u0027encounter\u0027 where you just glance through the sphere of influence over one of the poles, then the periapsis will be over the pole. You will be able to close the orbit and adjust the longitude of ascending node fairly easily--in that order, because you\u0027ll need to bring big engines and a lot of fuel as you will have a lot of relative speed, not a lot of time to shed it, and \u003Cem\u003Eno\u003C/em\u003E help from the Oberth effect.  Inefficient transfers are inefficient for a reason.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, you can try corrective burns after you arrive at Laythe.  If it were me, I\u0027d choose to make an equatorial Laythe orbit and then change the inclination at the correct point so that I can align the longitudes of ascending node at the same time, thus performing two manoeuvres in one burn.\n\u003C/p\u003E\n\u003Cp\u003E\nThird, if your interceptor is also a lander, then you can spare yourself a \u003Cem\u003Elot\u003C/em\u003E of aggravation if you simply \u003Cem\u003Eland\u003C/em\u003E on Laythe\u0027s equator, wait until the orbit you want is overhead, and launch to match it, just as you would if it were Kerbin.  If landing was part of the mission profile to begin with, then you should be in good shape--unless the craft you want to intercept has the fuel you need to launch from Laythe, in which case ... oops?\n\u003C/p\u003E\n\u003Cp\u003E\nAlternatively, you can take a more scenic route.  Tylo is also in orbital resonance with Laythe (and Vall) so there may be something you can work with if you use Tylo as an intermediate.  Pol orbits Jool but is \u003Cem\u003Enot\u003C/em\u003E in orbital resonance with Vall or Laythe, so eventually, you are effectively guaranteed to get a transfer that has the correct orientation.  I leave it to you to determine whether \u003Cem\u003Eeventually\u003C/em\u003E will arrive in anything less than geologic time, and whether going to Pol to get to Laythe offers \u003Cem\u003Eany\u003C/em\u003E fuel savings.\n\u003C/p\u003E\n\u003Cp\u003E\nLastly, you can do something that is in between getting a good encounter from Vall and getting a transfer from somewhere else; you can set up an intermediate orbit between Vall and Laythe and time the transfer from that to arrive at Laythe with the right parameters to easily match your chosen orbit.  Get into your intermediate orbit, make the node, and check the encounter.  If you don\u0027t like it, advance the node by an orbit and slide it up the orbital path until you get a new encounter.  Rinse and repeat until you get an encounter that you do like.  Assuming that each new Laythe encounter occurs at a different point on Laythe\u0027s orbit (stay away from orbital resonance), then each encounter should also have a different longitude of ascending node.  This is still theoretical--I prefer to correct from equatorial, as I said--so I don\u0027t know how well it would work, and there\u0027s no easy way to test without doing it, either.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n wow you took quite some effort to explain why it is so darn difficult to align two crafts into a polar orbit.\n\u003C/p\u003E\n\u003Cp\u003E\nyou\u0027re right that the first vessel came directly from kerbin -》 slowed down at tylo 》 and then stopped at laythe to perform an orbital scan. the other vessel got fuel from vall and went directly to laythe.\n\u003C/p\u003E\n\u003Cp\u003E\ni didn\u0027t know my question would be this complex. i thought it would be a matter of timing and some node adjustments. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/93896-daveroski/\u0026amp;do=hovercard\u0022 data-mentionid=\u002293896\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/93896-daveroski/\u0022 rel=\u0022\u0022\u003E@Daveroski\u003C/a\u003E what you describe sounds like robust method but certainly not an economical method. although changing planes at the ap is off course a good thing to do. thanks for the advice \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154251\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0022 rel=\u0022\u0022\u003E@bewing\u003C/a\u003E thanks. i think i tried your method (more or less) and that\u0027s how i went from an inclination of 90 degrees to 17 degrees with a lot of fiddling. it\u0027s just so frustrating i didn\u0027t figure out why i couldn\u0027t reduce the inclination to 0 degrees. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E but i guess it\u0027s just a bit more complex than i assumed it would be. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbal Fried Chicken","CreatedById":172854,"CreatedDateTime":"2017-05-31T19:57:10Z","Content":"\n\u003Cp\u003E\nThis is a prime example of why I read the forums. While I have nothing to offer in response to the question; I learned a huge amount from the replies. So Thank You!!!! to asker and answerers alike.\n\u003C/p\u003E\n"},{"CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2017-06-21T05:21:19Z","Content":"\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cspan lang=\u0022en\u0022 style=\u0022background:rgb(255,255,255);color:rgb(82,82,82);font-family:Helvetica, sans-serif;font-size:10.5pt;\u0022 xml:lang=\u0022en\u0022\u003EI think I found a way to solve the problem for any given polar orbit and starting location. I haven\u0027t had time to thoroughly test my theory yet or do any maths on it, so there is still some work that has to be done. I made a small example which I will explain below.  \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;font-style:normal;font-weight:normal;margin-top:0cm;margin-bottom:0pt;vertical-align:top;\u0022\u003E\n\u003Cspan lang=\u0022en\u0022 style=\u0022background:rgb(255,255,255);color:rgb(82,82,82);font-family:Helvetica, sans-serif;font-size:10.5pt;\u0022 xml:lang=\u0022en\u0022\u003ELet’s say we want to go from Tylo to Vall. Near Vall, a craft is circling the globe in a polar orbit and let’s say we want to rendezvous with this craft! Normally we want to perform a regular hohmann transfer to get to our target. We know that in many cases* we need \u0022the least\u0022 amount of delta v when the inclination angle is approximately 0 degrees: \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;font-style:normal;font-weight:normal;margin-top:0cm;margin-bottom:0pt;vertical-align:top;\u0022\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;font-style:normal;font-weight:normal;margin-top:0cm;margin-bottom:0pt;vertical-align:top;\u0022\u003E\n\u003Csup\u003E\u003Cspan lang=\u0022en\u0022 xml:lang=\u0022en\u0022\u003E\u003Cfont color=\u0022#000000\u0022 face=\u0022Calibri\u0022 size=\u00222\u0022\u003E*when the inclination between the two orbits is ~0 degrees\u003C/font\u003E\u003C/span\u003E\u003C/sup\u003E\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cimg alt=\u002200A9q2J.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/00A9q2J.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cspan lang=\u0022en\u0022 style=\u0022background:rgb(255,255,255);color:rgb(82,82,82);font-family:Helvetica, sans-serif;font-size:10.5pt;\u0022 xml:lang=\u0022en\u0022\u003E\u003Cem\u003E(HOFFMAN should be HOHMANN... but I\u0027m too lazy to change the pictures ;))\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cspan lang=\u0022en\u0022 style=\u0022background:rgb(255,255,255);color:rgb(82,82,82);font-family:Helvetica, sans-serif;font-size:10.5pt;\u0022 xml:lang=\u0022en\u0022\u003EThis way, we require the least amount of delta v to get to the target. Unfortunately, this also means that we always approach the target planet from the same angle. In the example above this is means we always have an relative inclination with the target (in the polar orbit) of 90 degrees, which is \u003Cb\u003E\u003Cu\u003EBAD…\u003C/u\u003E\u003C/b\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cspan lang=\u0022en\u0022 style=\u0022background:rgb(255,255,255);color:rgb(82,82,82);font-family:Helvetica, sans-serif;font-size:10.5pt;\u0022 xml:lang=\u0022en\u0022\u003ESo I figured.. what if we depart from our starting location when the intercept angle is different than 0 degrees, say 30 degrees?! Will this change the angle at which we reach the target planet and the relative inclination with the ship that is in a polar orbit? \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cimg alt=\u0022wp0p8Us.jpg\u0022 class=\u0022ipsImage\u0022 src=\u0022http://i.imgur.com/wp0p8Us.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cspan lang=\u0022en\u0022 style=\u0022background:rgb(255,255,255);color:rgb(82,82,82);font-family:Helvetica, sans-serif;font-size:10.5pt;\u0022 xml:lang=\u0022en\u0022\u003E\u003Cem\u003E(HOFFMAN should be HOHMANN... but I\u0027m too lazy to change the pictures ;))\u003C/em\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cspan lang=\u0022en\u0022 style=\u0022background:rgb(255,255,255);color:rgb(82,82,82);font-family:Helvetica, sans-serif;font-size:10.5pt;\u0022 xml:lang=\u0022en\u0022\u003ESo I tried this method in my current career and got pretty cool results. As shown in the picture above we can see that for this example, the inclination with the final target is only 6 degrees! \u003Cu\u003E\u003Cstrong\u003ETHIS IS GOOD\u003C/strong\u003E\u003C/u\u003E!! We spend more energy on the hohmann transfer and  we also reach the planet at a higher relative velocity, but we DO get a better inclination with the final target which is the polar orbit! \u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp style=\u0022background:rgb(255,255,255);margin:0cm 0cm 0pt;line-height:13.5pt;vertical-align:top;\u0022\u003E\n\u003Cspan lang=\u0022en\u0022 style=\u0022background:rgb(255,255,255);color:rgb(82,82,82);font-family:Helvetica, sans-serif;font-size:10.5pt;\u0022 xml:lang=\u0022en\u0022\u003ESorry if my explanation is a bit fuzzy. I just wrote this on my way to work. Please let me know what you think. I will try to produce more quantitative results when I get home. I wonder how efficient this “new” method is. \u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-21T07:19:38Z\u0022 title=\u002206/21/2017 07:19  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 21, 2017\u003C/time\u003E by xendelaar\u003C/strong\u003E\n\u003Cbr\u003Ehoffman.... DOH!\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-06-21T06:40:47Z","Content":"\n\u003Cp\u003E\nSorry, not gonna work. If your intercept angle is not very very close to zero, then your intercept speed is going to be several km/s -- so your braking maneuver is going to be very expensive. Much more expensive than any plane change at the destination could possibly be.\n\u003C/p\u003E\n\u003Cp\u003E\nBut you can easily get captured into a polar orbit while using a Hohmann transfer. The only question is whether the solar altitude is right -- so that you go right over one of the poles when you get to your destination.\n\u003C/p\u003E\n"},{"CreatedByName":"xendelaar","CreatedById":139535,"CreatedDateTime":"2017-06-21T07:15:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223098578\u0022 data-ipsquote-contentid=\u0022161219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221498027247\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSorry, not gonna work. If your intercept angle is not very very close to zero, then your intercept speed is going to be several km/s -- so your braking maneuver is going to be very expensive. Much more expensive than any plane change at the destination could possibly be.\n\u003C/p\u003E\n\u003Cp\u003E\nBut you can easily get captured into a polar orbit while using a Hohmann transfer. The only question is whether the solar altitude is right -- so that you go right over one of the poles when you get to your destination.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp style=\u0022margin:0cm 0cm 0pt;\u0022\u003E\n\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003E\u003Cfont face=\u0022Calibri\u0022\u003E\u003Cfont size=\u00223\u0022\u003E\u003Cfont color=\u0022#000000\u0022\u003EThanks for the feedback! While you’re probably right, I would still like to compare the numbers to give me some closure...\u003C/font\u003E\u003C/font\u003E\u003C/font\u003E\u003C/span\u003E\u003Cspan lang=\u0022en-us\u0022 style=\u0022background:rgb(255,255,255);color:rgb(0,0,0);font-family:Calibri, sans-serif;font-size:11pt;\u0022 xml:lang=\u0022en-us\u0022\u003EJust to get a feeling what the different delta v requirements are for both methods. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003Cspan lang=\u0022en-us\u0022 xml:lang=\u0022en-us\u0022\u003E\u003Cfont face=\u0022Calibri\u0022\u003E\u003Cfont size=\u00223\u0022\u003E\u003Cfont color=\u0022#000000\u0022\u003E So I will redo the experiment again tonight and I will report back on the forum. \u003Cspan\u003E any additional info would be welcome off course \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\u003C/font\u003E\u003C/font\u003E\u003C/font\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-21T08:38:27Z\u0022 title=\u002206/21/2017 08:38  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 21, 2017\u003C/time\u003E by xendelaar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FancyMouse","CreatedById":142946,"CreatedDateTime":"2017-06-21T07:50:44Z","Content":"\n\u003Cp\u003E\nI don\u0027t know why nobody is mentioning argument of periapsis - from my experience, this is the key to matching a target orbit around another body (especially polar orbit). It starts from this - tweak the mid-course correction so that the argument of periapsis lies on the target orbit plane. Visually, it will be the periapsis marker of the maneuver lies on the same plane with the target orbit. Remember, you\u0027re not trying to match inclination at this step - you\u0027re trying to match argument of periapsis. So if it ended up with a highly inclined capture trajectory, it\u0027s fine. Because it\u0027s mid-course correction, delta V spent is minimal. Second maneuver, you would capture into an elliptic orbit (this delta V is unavoidable), then third maneuver correct the inclination at apoapsis (this delta V is minimal because we\u0027re at apoapsis of elliptic orbit), then you\u0027ll be in the same plane as the target orbit, and then it\u0027s routine Hohmann transfer or any transfer you\u0027d like to do.\n\u003C/p\u003E\n\u003Cp\u003E\nIt sounds very efficient to me, since the big boys are the capture burn and the same-plane transfer, which is not avoidable anyway.\n\u003C/p\u003E\n"},{"CreatedByName":"Whisky Tango Foxtrot","CreatedById":172896,"CreatedDateTime":"2017-06-21T08:20:13Z","Content":"\n\u003Cp\u003E\nMy strategy for getting into any desired orbit from an inter-body transfer is to first adjust my trajectory so that my PE at the target body occurs at the same point where my orbit crosses the desired orbital plane (i.e. at the \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E or \u003Cabbr title=\u0022Descending Node\u0022\u003EDN\u003C/abbr\u003E point) and is as low as safely possible. I do this as early as possible so that the adjustments can be done cheaply. When my transfer trajectory is the way I want it I set up a manoeuvre node at PE to capture into an orbit around the desired body, but only barely, with my AP as high as it can go without leaving the target body\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E. Once I execute my capture burn the opposite \u003Cabbr title=\u0022Ascending Node\u0022\u003EAN\u003C/abbr\u003E/\u003Cabbr title=\u0022Descending Node\u0022\u003EDN\u003C/abbr\u003E marker should be at the AP for an extremely elliptical orbit, so I can make whatever inclination changes are needed very cheaply. I do so, then make any other adjustments I need to make to my orbit using standard Hohmann transfers.\n\u003C/p\u003E\n"},{"CreatedByName":"ernstsmit","CreatedById":152109,"CreatedDateTime":"2017-06-22T11:38:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223073301\u0022 data-ipsquote-contentid=\u0022161219\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496141624\u0022 data-ipsquote-userid=\u002293896\u0022 data-ipsquote-username=\u0022Daveroski\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 2017/05/30 at 0:53 PM, Daveroski said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nA economical way without a lot of maths and guesswork is to plot a node so that you will get a polar orbit, any polar orbit but with a low pe.\n\u003C/p\u003E\n\u003Cp\u003E\nGet to pe and close the orbit but only just so that the ap is as high as possible.\n\u003C/p\u003E\n\u003Cp\u003E\nDo a plane change from as close to ap as possible while raising your pe to that of the target.\n\u003C/p\u003E\n\u003Cp\u003E\nPlot your intercept.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI have noticed in videos on Youtube a lot of people get this wrong. When you get to a new \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, don\u0027t circularize immediately. Plane changes use a LOT of \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E once circularized. In stead I do a small burn to only just capture orbit. Then do the plane changes at the very high AP. This very large plane changes can be done for very small \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E cost. Then once the plane is matched do the circularization burn.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe only downside to this is that an orbit with a very high AP takes a long time to complete. So if you have a time constraint for some reason then this might not work properly. In that case you can bring the AP lower, just remember that the lower it is the more costly the Plane Change Burn.\n\u003C/p\u003E\n\u003Cp\u003E\nHere is a quick example, say my PE is at 100km above Kerbin and my AP is near Minmus Orbit. To do the 6 degree plane change to match Minmus plane would require 330m/s at PE and only 5m/s at AP for the same plane change.\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/g6MYSDx\u0022 style=\u0022height:449px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsEmbeddedOther ipsEmbeddedOther_limited\u0022\u003E\n\u003Ciframe data-controller=\u0022core.front.core.autosizeiframe\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?app=core\u0026amp;module=system\u0026amp;controller=embed\u0026amp;url=http://imgur.com/VmYirks\u0022 style=\u0022height:449px;\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}