{"TopicId":16120,"ForumId":16,"TopicTitle":"Control tumbling/flipping on re-entry","CreatedByName":"purple100","CreatedById":10989,"CreatedDateTime":"2012-08-05T17:00:28Z","PageNum":1,"Articles":[{"CreatedByName":"purple100","CreatedById":10989,"CreatedDateTime":"2012-08-05T17:00:28Z","Content":"\n\u003Cp\u003EI have a rocket with a lander designed for touchdown on Mun with a powered return to Kerbin. Once it drops into lower atmosphere, at 30ish km, it flips over and points nose-down and resists all attempts to change pitch. This is a problem because I can\u0027t use the engine\u0027s thrust to slow it down anymore. Why does it do this, and how do I design the vessel to avoid the problem?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i45.tinypic.com/2njjyvr.jpg\u0022 alt=\u00222njjyvr.jpg\u0022\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-08-05T17:04:07Z","Content":"\n\u003Cp\u003EI would assume it was due to the airflow over the lander, causing it to act a little like a shuttlecock, you may be able to alleviate this by jettisoning those side mounted empty tanks or by using pylons instead.\u003C/p\u003E\n"},{"CreatedByName":"purple100","CreatedById":10989,"CreatedDateTime":"2012-08-05T17:09:03Z","Content":"\n\u003Cp\u003EThe tanks were the simplest solution I could think of to extend the range of landing legs, but they do contribute a fair amount of drag. I\u0027ll see what I can do.\u003C/p\u003E\n"},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2012-08-05T17:19:34Z","Content":"\n\u003Cp\u003EYou might look into Vlad\u0027s airbrakes as another solution to this problem. You can find them \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/13898-Airbrake\u0022 rel=\u0022external nofollow\u0022\u003Ehere.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"purple100","CreatedById":10989,"CreatedDateTime":"2012-08-05T17:51:29Z","Content":"\n\u003Cp\u003EBehavior persists even after removing the landing apparatus. The simple configuration of command module \u002B tank \u002B 1/2 tank \u002B engine starts turning at 25 km and swings like a pendulum.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i46.tinypic.com/2hxouwo.jpg\u0022 alt=\u00222hxouwo.jpg\u0022\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Tigga","CreatedById":31224,"CreatedDateTime":"2012-08-05T18:35:25Z","Content":"\n\u003Cp\u003EWhen unpowered your craft should will be stable if the centre of mass is \u0022above\u0022 your centre of pressure, unstable otherwise. That\u0027s \u0022above\u0022 is not relative to the ground though - it\u0027s relative to your velocity. If you\u0027re trying to land tail down you\u0027ll want aero forces at the capsule end of the ship, mass at the engine end of the ship.\u003C/p\u003E\u003Cp\u003EThe problem is that your centre of mass will vary massively depending on how those fuel tanks are filled. If you have a lot of fuel at the top you\u0027re going to be unstable, if you have a lot at the bottom you should be stable.\u003C/p\u003E\n"},{"CreatedByName":"purple100","CreatedById":10989,"CreatedDateTime":"2012-08-05T18:43:01Z","Content":"\n\u003Cp\u003EMy center of mass is too high up, then? Hmm, that presents a problem. This thing is coming down with the top tank empty and the bottom 1/2 tank about 25% full.\u003C/p\u003E\n"},{"CreatedByName":"Tigga","CreatedById":31224,"CreatedDateTime":"2012-08-05T18:45:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022purple100\u0022 data-cite=\u0022purple100\u0022\u003E\u003Cdiv\u003EMy center of mass is too high up, then? Hmm, that presents a problem. This thing is coming down with the top tank empty and the bottom 1/2 tank about 25% full.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn that case, I wouldn\u0027t have thought it would be in the second config. Dunno then, unless it\u0027s a Smart A.S.S. problem. Never used that myself.\u003C/p\u003E\n"},{"CreatedByName":"Festivefire","CreatedById":9808,"CreatedDateTime":"2012-08-05T18:53:07Z","Content":"\n\u003Cp\u003Eyou could try editing the deploy altitude and drag on a parachute to use it as a drogue to help stabilize your craft once it gets down to about 45000, which I\u0027ve found is the highest a drogue can be effective.\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2012-08-05T19:29:37Z","Content":"\n\u003Cp\u003EThe problem is that the CM and chute have a drag coefficient of 0.1 while everything else is 0.2. This puts the net drag force aft of the center of mass.\u003C/p\u003E\n"},{"CreatedByName":"semininja","CreatedById":3837,"CreatedDateTime":"2012-08-05T19:41:18Z","Content":"\n\u003Cp\u003EIf you stick a few of those airbrake flaps around the decoupler, they should flip you the right way round as soon as you activate them. They\u0027re quite effective; I\u0027ve landed using those once, although I kinda loaded the entire pod with them...\u003C/p\u003E\n"},{"CreatedByName":"purple100","CreatedById":10989,"CreatedDateTime":"2012-08-05T19:43:54Z","Content":"\n\u003Cp\u003EOkay, so I modified an MK16 parachute to partially deploy at very high altitude with a drag of 10. It kept the rocket in retrograde orientation without SAS assistance and allowed me to use the engine to land. Looks like that\u0027s the best solution available at the moment.\u003C/p\u003E\n"},{"CreatedByName":"Festivefire","CreatedById":9808,"CreatedDateTime":"2012-08-05T20:11:21Z","Content":"\n\u003Cp\u003Ethats why i said to use a drogue chute. increased drag at the top end, but not so much as to break the lander. note that i also said you could do a cfg edit to make it deploy at a higher altitude, so it is effective as a drouge chute in the upper atmosphere\u003C/p\u003E\n"},{"CreatedByName":"Clouds","CreatedById":32610,"CreatedDateTime":"2012-08-06T03:11:44Z","Content":"\n\u003Cp\u003EAdding some wings, like the cone on a shuttlecock or the feather/fins on an arrow, would cause a great amount of directional drag and might keep the intended end facing the rear. Be careful not to overdo it, or it\u0027ll also cause it to flip around during launch...\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2012-08-06T05:11:59Z","Content":"\n\u003Cp\u003ETry putting your parachute in a separate stage. The lower atmosphere will slow you down to 100-300 m/s, slow enough to avoid tearing off the parachute. Deploy at at least 400 meters above the ground to get 200 meters of braking (it takes about 200 feet between the parachute deploying and opening below 500).\u003C/p\u003E\n"}]}