{"TopicId":161611,"ForumId":16,"TopicTitle":"Can\u0026#039;t gather data near Mun","CreatedByName":"dylanh88","CreatedById":178553,"CreatedDateTime":"2017-06-05T04:40:34Z","PageNum":1,"Articles":[{"CreatedByName":"dylanh88","CreatedById":178553,"CreatedDateTime":"2017-06-05T04:40:34Z","Content":"\n\u003Cp\u003E\nOkay so I\u0027ll start off by saying I\u0027ve started a new career with the most recent update, I\u0027ve gone to orbit, set up relay sats, and what not. but then i got my fly-by the mun and return contract. so i build my vessel launch it and send to the Mun. Then when i get there suddenly the probe will not connect to my relays. i checked to make sure they were in the proper position and sure enough they were. FYI i have\u003Cstrong\u003E 6\u003C/strong\u003E \u003Cstrong\u003EHG-5 high gain antennas\u003C/strong\u003E on my probe i sent to the Mun. And on the relay, i also have 6 and 2 extra \u003Cstrong\u003Ecommunotron 16\u0027s\u003C/strong\u003E. I\u0027m not sure whats going on here but its quite annoying considering my probe is connected to the relay 100% before i reach the Mun, but when i enter the Muns sphere of influence it just disconnects. I am not in a Mun orbit, just a fly-by. Thank you in advance if you can answer my concerns!\n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2017-06-05T09:06:37Z","Content":"\n\u003Cp\u003E\nDo you have electric charge on your spacecraft? Is your spacecraft on the opposite side of the Mun?\n\u003C/p\u003E\n"},{"CreatedByName":"dylanh88","CreatedById":178553,"CreatedDateTime":"2017-06-05T10:30:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223080960\u0022 data-ipsquote-contentid=\u0022161611\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496653597\u0022 data-ipsquote-userid=\u0022165635\u0022 data-ipsquote-username=\u0022NSEP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, NSEP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nDo you have electric charge on your spacecraft? Is your spacecraft on the opposite side of the Mun?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes there\u0027s plenty of batteries and solar panels. And no it\u0027s between Kerbin and the Mun. \n\u003C/p\u003E\n"},{"CreatedByName":"NSEP","CreatedById":165635,"CreatedDateTime":"2017-06-05T14:24:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223080998\u0022 data-ipsquote-contentid=\u0022161611\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496658617\u0022 data-ipsquote-userid=\u0022178553\u0022 data-ipsquote-username=\u0022dylanh88\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, dylanh88 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYes there\u0027s plenty of batteries and solar panels. And no it\u0027s between Kerbin and the Mun. \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nStrange, im going to think about. Maybe i will have an explanation.\n\u003C/p\u003E\n"},{"CreatedByName":"LordFerret","CreatedById":111598,"CreatedDateTime":"2017-06-05T15:31:38Z","Content":"\n\u003Cp\u003E\nYou say a \u0027fly-by\u0027, but that you\u0027re not in orbit around Mun? Are you within Mun\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E? If not, no, you won\u0027t get any science (related to Mun).\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t know what\u0027s up with your antenna, sounds like a different issue.\n\u003C/p\u003E\n\u003Cp\u003E\nHow about a picture of your craft, or the craft file?\n\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2017-06-05T15:58:55Z","Content":"\n\u003Cp\u003E\nDo CommNet antennae need to be activated to work? I know with Remote Tech that would be one of my guesses.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2017-06-06T03:28:28Z","Content":"\n\u003Cp\u003E\nThis question about how to play the game has been moved to Gameplay Questions. \n\u003C/p\u003E\n"},{"CreatedByName":"Ohm is Futile","CreatedById":172721,"CreatedDateTime":"2017-06-06T03:39:55Z","Content":"\n\u003Cp\u003E\nYeah, only thing I can think of is that the HGs are not extended... Also, do you have any mods that could affect the strength of antennae? What about the difficulty settings?\n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2017-06-06T03:42:48Z","Content":"\n\u003Cp\u003E\nHi \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/178553-dylanh88/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022178553\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/178553-dylanh88/\u0022 rel=\u0022\u0022\u003E@dylanh88\u003C/a\u003E let\u0027s see if we can figure this out.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you are in sight of Kerbin then it looks like a problem with the antennas on your probe rather than the relays since you should be able to connect directly to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nThe first thing I can think of is that both the HG-5 antennas and the Communotron-16\u0027s have to be deployed in order to work. Right-click on the antennas and you should see an option to \u0022Deploy\u0022. The reason you can connect before you get to the Mun is because the capsules and probe bodies have simple antennas built into them but they aren\u0027t powerful enough to transmit long distances and they can\u0027t send science.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the Communotrons can not function as relays, but the HG-5s can. Be aware that the HG-5 is still pretty low power for a relay since it\u0027s the first one you have access to, so you will need to keep the HG-5 relays in orbit of the Mun to connect to a probe on the Mun\u0027s surface. It\u0027s your large ground stations on Kerbin that will do the work to resolve such weak signals from the relays.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-06T03:45:13Z\u0022 title=\u002206/06/2017 03:45  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 6, 2017\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-06-06T05:34:10Z","Content":"\n\u003Cp\u003E\nThere are several settings that you could have changed that would change all this behavior.\n\u003C/p\u003E\n\u003Cp\u003E\nThe Difficulty setting of your game changes the range of all the antennas -- or you might have reduced the ranges manually. You might have turned off all the extra tracking stations on Kerbin. You might have modified the occultation value. Or you might be using mods. Or you might have a corrupt download of the game.\n\u003C/p\u003E\n\u003Cp\u003E\nWith default settings, what you are seeing should be impossible -- assuming at least one of your antennas is deployed, as said above. A single HG5 antenna can easily connect from the Mun direct to Kerbin. No relay sats are necessary -- and even if they are there, they will not be used.\n\u003C/p\u003E\n\u003Cp\u003E\n(Note: as said above, Communotron 16\u0027s do not provide any benefit on a relay sat.)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Ohm is Futile","CreatedById":172721,"CreatedDateTime":"2017-06-06T16:31:24Z","Content":"\n\u003Cp\u003E\nI just realized this but how many relays do you have? is it possible the relay itself is losing sight with the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E? Because I ran the numbers in Poodmund\u0027s signal calculator and as long as all the antennae are deployed and one of the satellite has \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E connection, then you should at least have a red bar if not two orange ones. It definitely should not be completely disconnected.\n\u003C/p\u003E\n"}]}