{"TopicId":161716,"ForumId":16,"TopicTitle":"Rovers (or Elsewise Moving Around) on Gilly?","CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2017-06-07T03:35:44Z","PageNum":1,"Articles":[{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2017-06-07T03:35:44Z","Content":"\n\u003Cp\u003E\nI\u0027m going to be headed to Gilly for the first time.  And OF COURSE I will be setting up an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E refueling facility (like ya do...) for the eventual \u003Cs\u003Eassault on\u003C/s\u003E um, i mean Eve sample return mission.\n\u003C/p\u003E\n\u003Cp\u003E\nNow, I have this whole set of standardized infrastructure set up that works with only very minor tweaks on Mun, Minmus, and Ike (so far).  Basic setup is 1) a permanent mining-and-refining base that converts sunlight and regolith into \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E/O/Mono, 2) a tanker rocket to haul the fuel to an orbiting refueling depot, and 3) a tanker truck rover to cover the 100 meters-ish between the mining base and the landed tanker (because that transfer-truck scheme was way easier for me than learning to reliably land within \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E pipe range of the refinery yet outside the \u0022gigantor-array shatter zone\u0022).\n\u003C/p\u003E\n\u003Cp\u003E\nAnd I\u0027m wondering if I should rethink this for Gilly.  I\u0027ve never been there yet, but by all accounts you can SNEEZE your way to an escape trajectory on Gilly.  So does it make any sense at all to bother with a tanker truck?  How much trouble am I going to have keeping a wheeled vehicle on the ground (or gaining enough traction to start/stop the thing\u0027s movement)?  Note that this particular use case is NOT a long-haul, high-speed off-road exploration vehicle--it\u0027s a tanker truck whose ONLY ROLE is to move at a few m/s max speed across a few dozen meters of the flattest ground I could find in the high-Ore zone, sidle its forty-ton-ish bulk close enough to the tanker rocket to attach a \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E pipe, then head back to the refinery likewise.\n\u003C/p\u003E\n\u003Cp\u003E\nThis scheme works just fine on Minmus, the lowest-gee place I\u0027ve ever been.  But... GILLY....\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m wondering if I should nail the refinery to the surface with a set of \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E harpoons, stick a docking port on top of it, and treat this whole Gilly operation as a \u0022docking maneuver\u0022 rather than a \u0022landing\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nTips? Tricks? Advice?\n\u003C/p\u003E\n\u003Cp\u003E\n=====\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT:  Also, how big a hassle is physics-loading on Gilly?  My permanent infrastructure seems to do a little \u0022jump/settle\u0022 number on physics-load every time I pop on over there from map view.  Do things on landing legs jump right off the ground if they\u0027re landed on Gilly at loading time?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-07T03:42:00Z\u0022 title=\u002206/07/2017 03:42  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 7, 2017\u003C/time\u003E by Srpadget\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2017-06-07T03:53:52Z","Content":"\n\u003Cp\u003E\nWheels just straight up don\u0027t work on Gilly. You can do all of your hauling using \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters with no problem. Heck I wouldn\u0027t even call it landing on Gilly; more like a low speed rendezvous with the surface.\n\u003C/p\u003E\n\u003Cp\u003E\nEveryone has their own creative solutions for mining on Gilly but the few times I\u0027ve mined there I simply used the entire lander as one whole lander/miner/tanker combo in one ship to avoid the problems you mention.\n\u003C/p\u003E\n\u003Cp\u003E\nI think the jumping you are experiencing has more to do with the \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E pipes than the moon. The further separated different parts of the structure are from each other the more likely it is that there will be floating point errors in their location measurements when they all load in. \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E just makes it easier to make wide expansive structures that stretch out over uneven ground.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-07T03:58:33Z\u0022 title=\u002206/07/2017 03:58  AM\u0022 data-short=\u00227 yr\u0022\u003EJune 7, 2017\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ohm is Futile","CreatedById":172721,"CreatedDateTime":"2017-06-07T04:34:28Z","Content":"\n\u003Cp\u003E\nWell, there is a somewhat universal solution if you really want to go wheel. Depending on the size of the vehicle, it could be anywhere from crazy impractical to pretty trivial. Basically, you could put the smallest thrusters on your vehicle facing downwards and then muck around with thrust limits and throttle to see how much you need to stay on the ground... It shouldn\u0027t be too expensive in terms of fuel, at least for the very short trips you would be doing.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, Gilly is probably just too small to apply even this. \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E and other lightweight solutions should be fine and probably more desirable. Heck, you could probably cut the middle man and just straight up dock the hauler with the mining rig since the gravity is so low.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-06-07T05:10:51Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223083249\u0022 data-ipsquote-contentid=\u0022161716\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496806544\u0022 data-ipsquote-userid=\u0022111267\u0022 data-ipsquote-username=\u0022Srpadget\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Srpadget said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI\u0027m wondering if I should nail the refinery to the surface with a set of \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E harpoons, stick a docking port on top of it, and treat this whole Gilly operation as a \u0022docking maneuver\u0022 rather than a \u0022landing\u0022.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPretty much it.Gily landing/lifting off requires \u003Cspan style=\u0022font-size:8px;\u0022\u003E30m/s \u003C/span\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EdeltaV, so small you have trouble to notice.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, you know how when landing on Minmus thing seems to happens in slow motion? On Gily is more like a picture book.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"ARS","CreatedById":168061,"CreatedDateTime":"2017-06-07T06:26:48Z","Content":"\n\u003Cp\u003E\nYou wouldn\u0027t want to use wheels on gilly. Last time I\u0027m landing on that ball of rock with my \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E, it wasn\u0027t treated like a landing, more like a rendezvous with surface\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EIf you want to build a tanker for hauling stuff on gilly just slap a probe core, some reaction wheel, battery, antenna, \u003Cabbr title=\u0022Radio-isotope Thermo-electric Generator (a.k.a. Mars rover heating device)\u0022\u003ERTG\u003C/abbr\u003E (or solar panel) and an array of \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters to move around. Trust me, when you use a wheel on gilly, most of your time will be spent making it move normally instead of hauling stuff. It\u0027s okay if you want to set up a mining base there, but generally, due to gilly\u0027s very low gravity, it\u0027s much more efficient to just use a lander as a miner and a tanker. It doesn\u0027t take a lot of \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E to get into gilly orbit\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022line-height:1.6;\u0022\u003EAnchoring the whole mining rig on gilly is a viable solution to make it stand firm as you do your mining operation. \u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Human Person","CreatedById":174876,"CreatedDateTime":"2017-06-07T06:32:59Z","Content":"\n\u003Cp\u003E\nYou shouldn\u0027t build a permanent base. It\u0027s very inexpensive to take stuff up to Gilly Orbit, so why not take the whole mining Rig up into Gilly orbit instead of docking with it on the surface?\n\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2017-06-08T22:42:59Z","Content":"\n\u003Cp\u003E\nThanks, all, and sorry for the delay in replying.  (Real Life(tm) does have a habit of getting in the way of gaming time!)\n\u003C/p\u003E\n\u003Cp\u003E\nYes, for Gilly the smartest solution is probably to slap an engine (Terrier?  Maybe even a Spark?  Gotta go run the numbers...) under the \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E rig, a docking port up top, and a few \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E blocks around the sides, and just treat it as a miner/refiner/tanker all-in-one solution.\n\u003C/p\u003E\n\u003Cp\u003E\nWhich brings me to a follow-on question, but it\u0027s specific to \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E harpoons, so that\u0027s a question best asked off in the Mod area....\n\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2017-06-08T22:58:37Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223083266\u0022 data-ipsquote-contentid=\u0022161716\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496807632\u0022 data-ipsquote-userid=\u0022146104\u0022 data-ipsquote-username=\u0022HvP\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 6/6/2017 at 8:53 PM, HvP said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI think the jumping you are experiencing has more to do with the \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E pipes than the moon. The further separated different parts of the structure are from each other the more likely it is that there will be floating point errors in their location measurements when they all load in. \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E just makes it easier to make wide expansive structures that stretch out over uneven ground.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI can\u0027t imagine it would be.  I treat those pipes as nothing more than fuel hoses. I hook up, transfer fuel, and unhook.  I don\u0027t even warp while I\u0027m doing that.  After seeing how the various components move around while I\u0027m shifting fuel, and then jump when I detach the pipe, I\u0027ve always been a bit nervous about what would happen if I unloaded/reloaded physics while things were \u0022piped together\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nI may have some \u0027phantom forces\u0027 somewhere in the mining rig, actually.  I\u0027ve noticed across multiple KSP versions, on multiple worlds, on varying types of terrain, that the mining rig will slowly (over multiple visits/reloads) drift east (even if east is UPHILL!) and rotate counter-clockwise.  I never see it move, but over multiple game sessions it keeps turning up slighly further east compared to flag, tanker truck, and nearby terrain features (I could live with that) and the solar arrays no longer track the  sun properly (which is really QUITE annoying at dawn/dusk when the dang thing is 90 degrees rotated from its original orientation).  I\u0027ve taken to saving its post-landing state vector in a text file and then periodically copying that back into the save, to force it back to its original location/orientation....\n\u003C/p\u003E\n"},{"CreatedByName":"HvP","CreatedById":146104,"CreatedDateTime":"2017-06-08T23:19:03Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223085299\u0022 data-ipsquote-contentid=\u0022161716\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221496962717\u0022 data-ipsquote-userid=\u0022111267\u0022 data-ipsquote-username=\u0022Srpadget\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n23 minutes ago, Srpadget said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI can\u0027t imagine it would be.  I treat those pipes as nothing more than fuel hoses. I hook up, transfer fuel, and unhook.  I don\u0027t even warp while I\u0027m doing that.  After seeing how the various components move around while I\u0027m shifting fuel, and then jump when I detach the pipe, I\u0027ve always been a bit nervous about what would happen if I unloaded/reloaded physics while things were \u0022piped together\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nI may have some \u0027phantom forces\u0027 somewhere in the mining rig, actually.  I\u0027ve noticed across multiple KSP versions, on multiple worlds, on varying types of terrain, that the mining rig will slowly (over multiple visits/reloads) drift east (even if east is UPHILL!) and rotate counter-clockwise.  I never see it move, but over multiple game sessions it keeps turning up slighly further east compared to flag, tanker truck, and nearby terrain features (I could live with that) and the solar arrays no longer track the  sun properly (which is really QUITE annoying at dawn/dusk when the dang thing is 90 degrees rotated from its original orientation).  I\u0027ve taken to saving its post-landing state vector in a text file and then periodically copying that back into the save, to force it back to its original location/orientation....\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI know that the drifting along the ground bug was a big problem when 1.0 came out, but I thought it had been minimized in more recent updates, although not completely eliminated. The references I\u0027ve seen implicating \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E probably was a result of wide hooked-together structures amplifying the underlying physics problem you are running into. Thinking about it more, I\u0027ve noticed that switching focus between widely separated ships when both are within physics range exacerbates the problem -- they don\u0027t have to be connected after all.\n\u003C/p\u003E\n\u003Cp\u003E\nHaving BD Armory installed, for example, extends the physics range by about 10 times normal and I was getting bad discontinuities with my surface bases when craft would come into that 20km range or when I switched between them. I had to uninstall it to make my life easier.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s possible that phantom forces could be at work, of course. Clipping service bays, cargo bays, air brakes and landing legs against other craft seem to be the biggest offenders creating phantom forces in my experience.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-08T23:20:16Z\u0022 title=\u002206/08/2017 11:20  PM\u0022 data-short=\u00227 yr\u0022\u003EJune 8, 2017\u003C/time\u003E by HvP\u003C/strong\u003E\n\u003C/span\u003E\n"}]}