{"TopicId":161703,"ForumId":16,"TopicTitle":"Jupiter exploration strategy in RSS/RO","CreatedByName":"paladin17","CreatedById":178614,"CreatedDateTime":"2017-06-06T23:02:09Z","PageNum":1,"Articles":[{"CreatedByName":"paladin17","CreatedById":178614,"CreatedDateTime":"2017-06-06T23:02:10Z","Content":"\n\u003Cp\u003E\nHello.\u003Cbr\u003E\u003Cbr\u003E\nThe question is, plainly put, what is the most effective exploration strategy for Jupiter (in terms of getting more science and perhaps some fun along the way)?\u003Cbr\u003E\nI\u0027m currently playing \u003Cabbr title=\u0022Real Solar System (mod)\u0022\u003ERSS\u003C/abbr\u003E/\u003Cabbr title=\u0022Realism Overhaul (mod)\u0022\u003ERO\u003C/abbr\u003E/RP-0 build (not sure what the exact versions are, KSP is 1.2.2), and I have a probe that just left Earth\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E with slightly more than 4k of delta-v on board; its current Jupiter periapsis is ~ 2200 km with an orbit a few degrees off the satellites\u0027 plane.\u003Cbr\u003E\nInitially, I was planning to capture into satellites\u0027 plane and then one by one catch them on flybys. But now I\u0027m more inclined to go more inclined: that is, polar (Juno style). That way I would get all the Jupiter\u0027s biomes (closing the Gestalt) and I\u0027d also be able to catch Callisto and Ganymede (perhaps even Europa?) flybys as well (by looking for the encounter at ascending/descending nodes). Then the next probe that would enter the system might not bother with Jupiter, and go for satellites right away (e.g. for orbiting etc.).\u003Cbr\u003E\u003Cbr\u003E\nWhat do you guys think?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-06-06T23:02:37Z\u0022 title=\u002206/06/2017 11:02  PM\u0022 data-short=\u00227 yr\u0022\u003EJune 6, 2017\u003C/time\u003E by paladin17\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2017-06-07T06:58:18Z","Content":"\n\u003Cp\u003E\nWelcome to the forums! \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E This is more the place for general KSP advice, and not for detailed help with highly complex mods like Realism Overhaul. For that, you might want to hit up the related discussion thread in the add-on section.\n\u003C/p\u003E\n\u003Cp\u003E\nThat said, your plan sounds decent so far. If you can use one or two close flybys to cheaply bend your polar orbit into one that\u0027s coplanar with the major satellites, you should be able to grab them all eventually. Think Cassini - bouncing from moon to moon for years in flyby after flyby.\n\u003C/p\u003E\n\u003Cp\u003E\nMissions like the current in-planning Europa Clipper even study singular moons without orbiting them. As long as you get enough flybys at the right times, you can map the entire body just as well.\n\u003C/p\u003E\n"}]}