{"TopicId":163470,"ForumId":16,"TopicTitle":"Contracts","CreatedByName":"easytarget","CreatedById":179888,"CreatedDateTime":"2017-07-19T21:01:29Z","PageNum":1,"Articles":[{"CreatedByName":"easytarget","CreatedById":179888,"CreatedDateTime":"2017-07-19T21:01:29Z","Content":"\n\u003Cp\u003E\nI\u0027ve done a quick search here and found an old thread that I think basically said you can cancel contracts w/o penalty, or at worst minimal penalty.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a newb who has just started I have a somewhat similar question so I can determine the most effective strategy to adopt with contracts that are about to expire (currently I have one that\u0027s about to I guess disappear, or be held against me for not completing in 5 hours):  so, the question is this: should I accept the contract even if I\u0027m sure I can\u0027t complete it (this one is a survey and I\u0027m pretty sure I\u0027m not going to be able to figure out how to get to it yet with my limited knowledge, and I\u0027m not looking for clues as to how to handle it, want to figure that out on my own or fail on my own trying), or should I reject these I\u0027m pretty confident I can\u0027t complete either due to time or limited skill because that will do the least damage to me financially and in terms of my reputation?\n\u003C/p\u003E\n\u003Cp\u003E\nSorry for the run on paragraph...and thanks in advance for the help.\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-07-19T21:51:33Z","Content":"\n\u003Cp\u003E\nThe only penalty you receive for contracts that expired but we\u0027re never excepted is that, in the weighed-contract system, you are slightly less likely to receive similar contracts in the future (and that\u0027s if you actually \u003Cem\u003Elooked\u003C/em\u003E at the contract; if you didn\u0027t, letting it expire will have no effect at all). There is no reputation hit. If you decline it, or worse, except it and fail to complete it, you \u003Cem\u003Ewill\u003C/em\u003E be penalized.\n\u003C/p\u003E\n\u003Cp\u003E\nJust let it expire. It\u0027ll be replaced with a new contract soon after. Hopefully one you can complete. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-19T21:56:18Z\u0022 title=\u002207/19/2017 09:56  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 19, 2017\u003C/time\u003E by Cpt Kerbalkrunch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"easytarget","CreatedById":179888,"CreatedDateTime":"2017-07-19T22:19:12Z","Content":"\n\u003Cp\u003E\nThanks man, appreciate the response, just what I needed.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-07-20T02:32:58Z","Content":"\n\u003Cp\u003E\n Notice that the \u0022Expires in ...\u0022  refer to the time limit to accept an offered contract (visualised or not).  \n\u003C/p\u003E\n\u003Cp\u003E\nThe deadline to complete an accepted contract,  if exist,  will be in the contract details window. \n\u003C/p\u003E\n\u003Cp\u003E\nAlso, don\u0027t be afraid of actively declining a contract you find uninteresting.  The actual penalty is pretty small. \n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-07-20T13:30:59Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223125885\u0022 data-ipsquote-contentid=\u0022163470\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221500502752\u0022 data-ipsquote-userid=\u0022179888\u0022 data-ipsquote-username=\u0022easytarget\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 hours ago, easytarget said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks man, appreciate the response, just what I needed.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNo problem (sorry for the delayed response; RL got in the way). And \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/166502-spricigo/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022166502\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/166502-spricigo/\u0022 rel=\u0022\u0022\u003E@Spricigo\u003C/a\u003E\u0027s right about declining contracts. It\u0027s usually a very small penalty (and nothing compared to accepting one and then failing). If you keep getting a certain type of contract that you find uninteresting or just gotten bored of, with the weighed contract system, you only need to decline one or two and you\u0027ll be much less likely to get similar ones in the future. It can be a good way to ensure you receive contract offers you find fun and actually want to do.\n\u003C/p\u003E\n"}]}