{"TopicId":163914,"ForumId":16,"TopicTitle":"What can this ship do in jool system?","CreatedByName":"omelaw","CreatedById":156483,"CreatedDateTime":"2017-07-31T12:58:38Z","PageNum":1,"Articles":[{"CreatedByName":"omelaw","CreatedById":156483,"CreatedDateTime":"2017-07-31T12:58:38Z","Content":"\n\u003Cblockquote class=\u0022imgur-embed-pub\u0022 lang=\u0022en\u0022 xml:lang=\u0022en\u0022\u003E\n\u003Ca href=\u0022//imgur.com/a/zOp13\u0022 rel=\u0022external nofollow\u0022\u003EAlbum a/zOp13 will appear when post is submitted\u003C/a\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThe mothership has 3300m/s \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E in there, but the capture burn (I\u0027m using Laythe gravity assist) will eat some chunk of it (1500m/s if I choose to park at low Laythe orbit, 700m/s if I put its AP near at bob\u0027s orbit)\n\u003C/p\u003E\n\u003Cp\u003E\nit has a lander in it with 2200m/s \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E but can\u0027t reenter, so only body I can land will be bob and pol (and vall?) and mothership has fuel for it to refuel it twice (mothership \u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E calcualted this fuel loaded, but not using it)\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nP.S do you think this ship can withstand areobrakes? (at laythe or when I back to kerbin)\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-31T13:03:01Z\u0022 title=\u002207/31/2017 01:03  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 31, 2017\u003C/time\u003E by omelaw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2017-07-31T13:43:19Z","Content":"\n\u003Cp\u003E\nYou should be able to do the Bop transfer for essentially free. Tweak your trajectory right after you enter Jool\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E and you\u0027ll be surprised at the variety of orbits you can get.\n\u003C/p\u003E\n\u003Cp\u003E\nRegarding aerobraking, I think you\u0027d be fine but better than that, I suggest you quicksave and try it, especially because there are no in game tools to predict what will happen after the braking.\n\u003C/p\u003E\n"},{"CreatedByName":"Cpt Kerbalkrunch","CreatedById":175588,"CreatedDateTime":"2017-07-31T14:16:02Z","Content":"\n\u003Cp\u003E\nHave you already reached Jool? The reason I ask is that, if you catch Tylo (or Laythe as well) on the backside of Jool (when the moon is on the retrograde side of Jool\u0027s orbit around the sun), you will capture without any burn at all. This is one of the best things about going to Jool. You can plan for this in your design, and take advantage of the savings. Your ship is already built, obviously, but it looks just fine to me. I don\u0027t use the Nerv, so I\u0027m not as familiar with it, but I think I\u0027d forget about Laythe. The cost isn\u0027t worth it. I\u0027d just run experiments and EVA on the way through. After passing through, you can also easily get a rendezvous with Vall and Tylo for flyby science grabbing (they\u0027re actually tough to avoid). \n\u003C/p\u003E\n\u003Cp\u003E\nTo me, Pol or Bop should be your goal. With what you have for your lander, you could mine either moon for all the science it has. You should be able to return to Kerbin with your first Jool mission a resounding success. And when you do, I\u0027d forget the aerobrake. If your ship isn\u0027t designed for it, you\u0027ll have to stay so high that the result will be small and not worth the risk. Remember that you\u0027ll be doing the Jool-dive, and moving extremely fast. Easily doable with a shield, but most likely disastrous without one.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-07-31T14:24:33Z\u0022 title=\u002207/31/2017 02:24  PM\u0022 data-short=\u00226 yr\u0022\u003EJuly 31, 2017\u003C/time\u003E by Cpt Kerbalkrunch\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2017-07-31T15:07:05Z","Content":"\n\u003Cp\u003E\nAssuming this is your first trip to Jool\u0027s system and you are here for the science then I suggest ignoring landing initially. There is lots of science to be earned from high and low flybys of as many of the moons as you can manage. When you have done that then see what fuel you have left to get your lander down and back up at one or two of the moons. \n\u003C/p\u003E\n\u003Cp\u003E\nAs you have a lab onboard I\u0027m guessing that your plan is to process the science locally rather than return it, so you could forget about saving \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E for a return. You could always send a crew collection mission later if you like or leave the crew around a handy moon as crew of a science station to process future landing missions. \n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-07-31T18:05:32Z","Content":"\n\u003Cp\u003E\n\u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156483-omelaw/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022156483\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/156483-omelaw/\u0022 rel=\u0022\u0022\u003E@omelaw\u003C/a\u003E:\u003Cbr\u003E\u003Cbr\u003E\nWith 2200 m/s in the lander, then assuming you can get the mothership into close orbit of Vall, you can land and return from there.  I\u0027d advise against hopping around, though.  You can visit Pol and Bop without trouble.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWith the right gravity assist, you won\u0027t need aerocapture, and that\u0027s a good thing; for the amount of fuel it saves, you may not leave yourself enough delta-V to go that far down the gravity well and climb back out again if you want to land on three of the moons as well.\u003C/span\u003E\n\u003C/p\u003E\n"}]}