{"TopicId":16463,"ForumId":16,"TopicTitle":"Working shuttle that needs a tweek or two","CreatedByName":"Allenwr","CreatedById":22802,"CreatedDateTime":"2012-08-09T18:58:23Z","PageNum":1,"Articles":[{"CreatedByName":"Allenwr","CreatedById":22802,"CreatedDateTime":"2012-08-09T18:58:23Z","Content":"\n\u003Cp\u003EWell, with the update, I was able to make a successful shuttle that I can take off and land with.\u003C/p\u003E\u003Cp\u003EI have attached a picture, the first and biggest issue is that the RCS system drains from the outside radially mounted tanks first. I want the RCS to drain the tanks from the external fuel tank then from the orbiter. Putting fuel lines on the RCS tanks doesn\u0027t change anything. The second issue that is just an annoyance, the landing gear always starts extended and sometimes it will break the external fuel tank and the orbiter in half before I can retract them.\u003C/p\u003E\n"},{"CreatedByName":"Endeavour","CreatedById":21125,"CreatedDateTime":"2012-08-09T20:23:32Z","Content":"\n\u003Cp\u003EI think that RCS tanks drain in the order that you place them.\u003C/p\u003E\n"},{"CreatedByName":"Allenwr","CreatedById":22802,"CreatedDateTime":"2012-08-09T22:26:03Z","Content":"\n\u003Cp\u003EI wish that was the case, I even tried changing the order that I placed them. Even in the stages during assembly and launch, changing anything doesn\u0027t change the drain order when I tried. I read in the change log that lower placed tanks drain first. I don\u0027t really have a clue on how I can move the spare tanks lower than the shuttle without changing the shuttle\u0027s COG. I\u0027m not sure where I saw radially mounted RCS tanks drain first.\u003C/p\u003E\u003Cp\u003EEdit: the picture is smaller than I expected, the top RCS tank is on the external fuel tank, the other is under the shuttle.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-09T22:31:07Z\u0022 title=\u002208/09/2012 10:31  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 9, 2012\u003C/time\u003E by Allenwr\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Navy4422","CreatedById":27157,"CreatedDateTime":"2012-08-10T12:08:54Z","Content":"\n\u003Cp\u003EI had this issue as well all I did to fix it was to take the rcs tank I didnt want to drain first and remove it, then replace it and it fixed it for me.\u003C/p\u003E\n"},{"CreatedByName":"Allenwr","CreatedById":22802,"CreatedDateTime":"2012-09-06T00:55:27Z","Content":"\n\u003Cp\u003EWell, I came up with a fix for my problem, I went into the config of the rcs tank and made it mount radially so I can mount them lower than the final stage.\u003C/p\u003E\n"}]}