{"TopicId":165468,"ForumId":16,"TopicTitle":"Minmus -\u0026gt; Moho?","CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2017-09-13T14:40:25Z","PageNum":1,"Articles":[{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2017-09-13T14:40:25Z","Content":"\n\u003Cp\u003E\nI have a SCANSAT map/biome satellite which eventually will take a polar orbit around Minmus after Kerbin and Mun. Seeing I overbuilt it in terms of \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E I am pondering sending it off to some other planet when it\u0027s done around Kerbin. If I refuel it before leaving Minmus, the total \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E budget is 5620 m/s. This leads to some questions:\n\u003C/p\u003E\n\u003Cp\u003E\nDoes it take the same \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E to leave Kerbin to a given planet as leaving the less massive Minmus, considering that Minmus is orbiting at a speed one perhaps could use to one\u0027s advantage?\n\u003C/p\u003E\n\u003Cp\u003E\nHow does 5620 sound for a polar orbit around Moho? Unfortunately, it is a 2 stage rocket with a fuel capacity for 1700 m/s in the first stage so wherever it goes, it will be a one way trip.\n\u003C/p\u003E\n\u003Cp\u003E\nHow about radiators? I have \u003Cabbr title=\u0022Kerbal Inventory System (mod)\u0022\u003EKIS\u003C/abbr\u003E/\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E installed so I could fit some in orbit if needed. Currently the sat has 4 1x6 solar panels but again, more can be fitted if I go further out.\n\u003C/p\u003E\n\u003Cp\u003E\nAny other ideas of where to send the satellite mucho welcome.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Kerbal101","CreatedById":157058,"CreatedDateTime":"2017-09-13T15:27:24Z","Content":"\n\u003Cp\u003E\nYou can get some answers yourself in a fun and interesting way.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022Does it take the same \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E to leave Kerbin to a given planet as leaving the less massive Minmus, considering that Minmus is orbiting at a speed one perhaps could use to one\u0027s advantage? \u0022\u003Cbr\u003E\nMake a lightweight probe, from OCTO, TR-18A stack decoupler (deactivated), four small fuel tanks with legs, one tiny engine below and antenna.\u003Cbr\u003E\nSee that it has around 1000dV, you can get this through \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E - current and total stage \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E are displayable, then just bring one copy to Minmus surface - and leave one copy on Minmus.\u003Cbr\u003E\nDo typical maneuver nodes for both, writing down changes in deltaV before and after each maneuver and you\u0027ll get exact answers yourself. =) \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\nLeaving from Minmus orbit is like leaving from \u0022high Kerbin orbit\u0022, since Minmus gravity is nearly absent. So, its much much more fuel-efficient to leave from Minmus than from Kerbin 70/70, not only in \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E, but also in \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E required. You get like ~150-200 \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E to leave \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, where from Kerbin its ~1000.\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, that means that applies if you have (or mean to have) two identical, equally fueled vehicles on these spots.\u003Cbr\u003E\nIf you mean going to orbit around Minmus from Kerbin low orbit first - and then leaving Kerbin \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E, as compared to just leaving Kerbin low orbit, then leaving from Kerbin low orbit directly will be more efficient due to \u003Ca href=\u0022https://imgur.com/KJr0rTZ\u0022 rel=\u0022external nofollow\u0022\u003EOberth\u003C/a\u003E effect. Especially, if you manage to ninja a \u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/Tutorial:_Gravity_Assist\u0022 rel=\u0022external nofollow\u0022\u003Eslingshot\u003C/a\u003E through Mun, but it requires a lot of patience and practice.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n\u0022How does 5620 sound for a polar orbit around Moho?\u0022\u003Cbr\u003E\nThe stronger the gravity force, the lesser efficiency (\u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E) engines can provide. Thats why changing inclination is best done in distance, I call it \u0022injection correction\u0022.\u003Cbr\u003E\nBurn normal/antinormal to change inclination and radial-in/out to change approach distance to surface, usually it takes a handful \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E (~100-50) if done in distance.\n\u003C/p\u003E\n\u003Cp\u003E\n\u0022How about radiators?\u0022\u003Cbr\u003E\nDepends.. Moho is hot, but not too hot. The critical distance to Kerbol is around 600,000,000 m, the \u0022low orbit\u0022 is around 1,000,000,000 m.\u003Cbr\u003E\nThese are values which I got with own lightweight probe, it really makes large part of fun it.\n\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2017-09-14T10:10:55Z","Content":"\n\u003Cp\u003E\nThanks tons for the detailed post. I am definitely not going directly with this satellite as its original mission was and still is to map all 3 bodies before it needs to find another job. It was my gross miscalculation on the plus side that made me think of putting the fuel to good use.\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2017-09-15T03:52:12Z","Content":"\n\u003Cp\u003E\nIf you fly it correctly, you can get to Moho from Minmus for 5620 m/s.  I know you said you decided against it, but when you\u0027re done mapping the Kerbin system, you\u0027ll still be able to top up the fuel then and do it, if you like.  After all, if you already have the probe, why pay for another?\n\u003C/p\u003E\n\u003Cp\u003E\nDon\u0027t transfer to Moho; that\u0027s hideously expensive.  The trick is to transfer to Moho\u0027s apoapsis and make the inclination change at the same time (Moho\u0027s orbital nodes and apsides coincide); then burn retrograde for an encounter when you reach the apsis.  Once you get an encounter, tweak it to get a gravity assist (and perhaps repeat this step two or six times) and you\u0027ll make Moho orbit with enough fuel left to manoeuvre once or twice.  It will take some time, but you can spend the wait by doing other missions.\n\u003C/p\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2017-09-15T08:41:36Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223172141\u0022 data-ipsquote-contentid=\u0022165468\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221505383855\u0022 data-ipsquote-userid=\u0022140595\u0022 data-ipsquote-username=\u0022LN400\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, LN400 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks tons for the detailed post. I am definitely not going directly with this satellite as its original mission was and still is to map all 3 bodies before it needs to find another job. It was my gross miscalculation on the plus side that made me think of putting the fuel to good use.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nProbable the most obvious \u0022good use\u0022 is to keep that fuel and wait for contracts asking to reposition the satellite.  Its easy, quick and you get some funds.\n\u003C/p\u003E\n\u003Cp\u003E\nIn regards to your question: according to \u003Ca href=\u0022https://alexmoon.github.io/ksp/#/Kerbin/100/Moho/100/false/ballistic/false/1/1\u0022 rel=\u0022external nofollow\u0022\u003Ealexmoon\u003C/a\u003E it takes ~5400m/s to tranfer to Moho from minmus orbit and ~5000m/s from \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E. You can save a bit more starting at minmus and lowering you  periapsis to barely above  Kerbin\u0027s atmosphere.  The issue is timing/ejection angle. \n\u003C/p\u003E\n\u003Cp\u003E\nApart from the tricks Zhetaan mentuoned you can also use a gravity assist at Eve in your way to Moho,  reasonable easy to set and offer quite a bit of DeltaV. \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2017-10-28T20:59:58Z","Content":"\n\u003Cp\u003E\nHaving sent 2 satellites, KSOI and Kerbol 1 out of Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E have already answered a few questions I had about heat. Oddly enough, it turns out the most efficient orientation of the medium radiators is to have the end pointing directly at the sun. I was expecting that having a cooler in the shadow of the space craft would offer better cooling but the tests show otherwise. Kerbol 1 is heading for a periapsis around the sun at about 1.6 million km. The sat is stuffed with panels and radiators size small and medium and will tell me a lot about heat that close to the sun, as well as how to use and not to use radiators and panels. KSOI\u0027s mission is to give me a hint on \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E requirements and time enroute for a quick pop out and return to Kerbin for a manned flight. Should also prove useful for asteroid hunting later on.\n\u003C/p\u003E\n"}]}