{"TopicId":169027,"ForumId":16,"TopicTitle":"Picking a landing spot","CreatedByName":"hhatch","CreatedById":182595,"CreatedDateTime":"2017-12-29T18:18:10Z","PageNum":1,"Articles":[{"CreatedByName":"hhatch","CreatedById":182595,"CreatedDateTime":"2017-12-29T18:18:10Z","Content":"\n\u003Cp\u003E\nI just went to Minmus and ending up landing on the dark side. So I went back and was trying to figure out how to land on a flat area on the sun side. I tried creating all kinds of maneuvers and finally I just had to bring down apoapsis and go into a low orbit. Is there another way to do this  without expending too much fuel ?\u003Cimg alt=\u0022DpBfPkB.png\u0022 class=\u0022ipsImage\u0022 height=\u0022576\u0022 src=\u0022https://i.imgur.com/DpBfPkB.png\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2017-12-29T19:23:14Z","Content":"\n\u003Cp\u003E\nIf you want to land at a spot under the apoapsis, you have no choice but to lower the apoapsis.  The only other thing to do is wait until the area under the peraipsis is in daylight (which it will be eventually).\n\u003C/p\u003E\n\u003Cp\u003E\n(edit)  Based on what I see in the screenshot, performing a retro-burn at periapsis should take only 62 m/s delta-v to circularize the orbit at an altitude of 6,475 km.  That\u0027s pretty minor and shouldn\u0027t cost much fuel at all.  Thankfully Minmus has really low gravity, so orbital maneuvers are pretty cheap to perform.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-29T19:37:52Z\u0022 title=\u002212/29/2017 07:37  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 29, 2017\u003C/time\u003E by OhioBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Aegolius13","CreatedById":165625,"CreatedDateTime":"2017-12-29T19:50:33Z","Content":"\n\u003Cp\u003E\nUsually, there is no reason NOT to circularize into a low orbit before you land.  Think of it this way: suppose you started as shown in the pic above, and then did a big retrograde burn at Peri to lower your Apo all the way to ground level.  At some point during that burn, your Apo is going to equal your Peri (i.e., you\u0027ll be in a circular orbit).  You don\u0027t lose any efficiency by stopping the burn at this point, and then doing a deorbit burn once you\u0027re lined up with a desired landing spot.    \n\u003C/p\u003E\n\u003Cp\u003E\nWhat if your Peri is way higher than needed?  You can do a small retrograde burn at the far-out Apo, to lower your Peri to a level that\u0027s close to the surface but still safe, then circularize as described above.  But the 6.5km Peri shown in your pic is a fine altitude for picking out a Minmus landing site.  Sometimes you may even want to start higher so you can do faster time warp, even if you lose a tiny bit of d-v efficiency.  \n\u003C/p\u003E\n"},{"CreatedByName":"hhatch","CreatedById":182595,"CreatedDateTime":"2017-12-29T21:31:51Z","Content":"\n\u003Cp\u003E\nThanks for the info and comments. I just launched another ship to Minmus and want to do a precision landing next to the ship I landed before. After I screw that up I\u0027m sure I\u0027ll  be back here.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2017-12-30T17:10:06Z","Content":"\n\u003Cp\u003E\nYou can always cancel your orbital speed and just fall straight down. If you do a little clicking, you can see how long it will take to get to the surface. Then you can guess how much your destination CB will rotate in that time.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-12-30T17:11:55Z\u0022 title=\u002212/30/2017 05:11  PM\u0022 data-short=\u00226 yr\u0022\u003EDecember 30, 2017\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"}]}