{"TopicId":170089,"ForumId":16,"TopicTitle":"Setting \u0026amp; Clearing Trim on Console - and control map.","CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2018-01-26T00:04:14Z","PageNum":1,"Articles":[{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2018-01-26T00:04:14Z","Content":"\n\u003Cp\u003E\nI know the answer to this is already on the forum, but I just can\u0027t seem to find it.\n\u003C/p\u003E\n\u003Cp\u003E\nCould someone please clarify how you both set and remove trim whilst using the Radial Control preset on PS4 please?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve managed to accidentally set the trim on one axis or another (usually roll) and I\u0027ve also managed to clear it, but however I managed it, I don\u0027t seem to be able to repeat the procedure.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother more general question - does anyone have a link to the full set of controls when using the Radial preset?  I haven\u0027t been able to find a full list and have stumbled across quite a number of useful controls whilst experimenting.  I\u0027m actually finding the radio menu\u0027s to be almost as easy and quick to select as the mouse keyboard combination on the PC, but it would be nice to have a complete crib sheet.\n\u003C/p\u003E\n\u003Cp\u003E\nCheers\n\u003C/p\u003E\n\u003Cp\u003E\nClipper\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2018-01-26T00:28:50Z","Content":"\n\u003Cp\u003E\nRadial Preset trim: Hold down the Left bumper \u002B adjust the appropriate axis control to set it.\n\u003C/p\u003E\n\u003Cp\u003E\nGet your finger off the stinking bumper \u003Cstrong\u003E\u003Cem\u003Enot\u003C/em\u003E\u003C/strong\u003E to set it.\n\u003C/p\u003E\n\u003Cp\u003E\nLeft bumper \u002B click L3 to clear it.\n\u003C/p\u003E\n\u003Cp\u003E\nAnd once you spell it all out, there are over 180 controls in each of the 3 presets -- which makes a complete list a little impractical. I\u0027m hoping we can publish a spreadsheet, actually. I\u0027m not sure if any users have published partial lists yet.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-26T00:30:18Z\u0022 title=\u002201/26/2018 12:30  AM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 26, 2018\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Clipperride","CreatedById":149816,"CreatedDateTime":"2018-01-26T13:15:37Z","Content":"\n\u003Cp\u003E\nThank you \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154251\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0022 rel=\u0022\u0022\u003E@bewing\u003C/a\u003E oh font of KSP knowledge!\n\u003C/p\u003E\n\u003Cp\u003E\nI remember being surprised at how many pages the full list f PC controls ran to. I wonder, is it worth having a console control (sticky) thread on the forum as a unified resource for such questions and answers?  Although it\u0027s a little confusing when first making the transition from PC, I applaud the Devs for the ease of use and for providing 3 control schemes to suit different players.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}