{"TopicId":170071,"ForumId":16,"TopicTitle":"Space pocks or my space ship has got discitis","CreatedByName":"JoeeoJ","CreatedById":179228,"CreatedDateTime":"2018-01-25T10:25:13Z","PageNum":1,"Articles":[{"CreatedByName":"JoeeoJ","CreatedById":179228,"CreatedDateTime":"2018-01-25T10:25:13Z","Content":"\n\u003Cp\u003E\nHi there,\n\u003C/p\u003E\n\u003Cp\u003E\nthere is strange phenomenon that sometimes appears on my space ships: The space ships shape suddenly has multiple discs integrated into its structur. These discs seem to have only 2 dimensions, they are circular, seem to be of metal (no colors) and if one tries to use the ship in any  way strange things may happen. One ship desintegrated into several parts.\n\u003C/p\u003E\n\u003Cp\u003E\nIt is not reproducable - it simply sometimes happens and If one restarts the game everything is ok again, if one could control oneself and has not touched/done something with that ship. I had it in both ver. 1.2.2 and  1.3.1 about 4-5 times in the 8 month since I play KSP.\n\u003C/p\u003E\n\u003Cp\u003E\nIs that a known problem ? Any \u0022kerbicine\u0022 that can help apart from restarting the game ?\n\u003C/p\u003E\n\u003Cp\u003E\nTIA, Joe\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-01-25T10:35:43Z\u0022 title=\u002201/25/2018 10:35  AM\u0022 data-short=\u00226 yr\u0022\u003EJanuary 25, 2018\u003C/time\u003E by JoeeoJ\u003C/strong\u003E\n\u003Cbr\u003Etypo\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2018-01-25T10:37:45Z","Content":"\n\u003Cp\u003E\nThat sounds like a question for the technical support forum. And it relies on knowing whether your play modded or not.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the most extreme cases, this could even indicate a faulty graphics driver or graphics card. But first you should eliminate all possible software causes, beginning with mods.\n\u003C/p\u003E\n"},{"CreatedByName":"fourfa","CreatedById":151713,"CreatedDateTime":"2018-01-25T20:05:13Z","Content":"\n\u003Cp\u003E\nPeople are just going to be guessing unless you can post up a screenshot.  I\u0027ve seen something from time to time - where the stock fairing texture that usually surrounds a heatshield seems to \u0027detach\u0027 and wander around - it usually clears up when going to timewarp.  But hard to tell if that resembles your problem or not.  A screenshot would really help\n\u003C/p\u003E\n"}]}