{"TopicId":171910,"ForumId":16,"TopicTitle":"How to design and control vehicles with off-center thrust vectors","CreatedByName":"devikwolf","CreatedById":142118,"CreatedDateTime":"2018-03-09T21:45:05Z","PageNum":1,"Articles":[{"CreatedByName":"devikwolf","CreatedById":142118,"CreatedDateTime":"2018-03-09T21:45:05Z","Content":"\n\u003Cp\u003E\nHi all,\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve been lurking for a while without posting or contributing. Veteran KSP player here. I\u0027ve done a lot of bonkers stuff in this great game, but designing -- and controlling -- anything with off-balance thrust is still harder than absolutely anything else I have done in this game.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the entire time I\u0027ve played KSP, I\u0027ve struggled with designing and flying vehicles with off-center thrust vectors, EG an STS-styled space shuttle. I\u0027ve designed and flown a few of these, but the most manageable versions were all pre-KSP1.0. SSTU offers a beautiful set of building blocks to make a ship, but there\u0027s still a ton of limitations from the core mechanics.\n\u003C/p\u003E\n\u003Cp\u003E\n1. The display for thrust vectors and \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E during vehicle design seem to not be useful for something like this; I have to eyeball it, by rotating the camera until the thrust vector is aimed right at the camera, and then I have to gauge whether the thrust vector \u0027ball\u0027 is lined up centrally with the Center of Mass. Maybe I\u0027m totally missing something, but this \u0022eyeball it\u0022 method seems to be the only option in this case? I can\u0027t even find a mod which will draw a ray along the thrust vectors so I can see if it properly intersects \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E. So it seems the only option is to eyeball it, throw it into a test flight, revert, eyeball it again, test again, etc. There\u0027s got to be a better way, even if it\u0027s through a mod, but I\u0027ve never found a mod that will allow me to either do this -- or better still, just let me hit a button or a key to rotate the engine to align it to the center of mass.\n\u003C/p\u003E\n\u003Cp\u003E\n2. During flight, the space shuttle\u0027s main engines would gimbal themselves towards \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E, to account for how the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E would change as fuel burned off (despite the stack being engineered to keep the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E change as in line as possible with the center of thrust, it still moves). KSP of course doesn\u0027t have anything like this stock, but I also can\u0027t find this behavior in any sort of mod. Being able to keep the engines gimbaled to a changing center of mass is a critical ability of the space shuttle.\n\u003C/p\u003E\n\u003Cp\u003E\n3. Navigation in KSP is always aligned through the control part\u0027s forward vector. I\u0027ve found some older mods that give better handling options, but I\u0027ve never been impressed with them. In the past I\u0027ve usually tucked a probe core between the SSME cluster and angled it along the thrust vector, and use it as a control point, but again, this is just a very eyeball-and-test process. I can\u0027t find any mod that offers a \u0022control from thrust vector\u0022 \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve watched users voice these same frustrations for 3-4 years and I\u0027ve not seen any good options besides \u0022wrestle it to orbit by manually doing things that the computer would be doing a thousand times a second\u0022 which is ultimately more frustrating than fun, to me. I\u0027ve managed to get perfectly stable and flyable shuttles in the past, but only after spending dozens of hours making tiny, tiny changes to part positions.\u003Cbr\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2018-03-09T22:32:54Z","Content":"\n\u003Cp\u003E\n1 \u0026amp; 2) \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid will show you all kinds of uneven torques for both dry and full tanks, and recalculate in real time. Kerbal Engineer Redux will show you the total amount of torque, but I\u0027ve never looked at that readout.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat I do in these situations is use Editor Extensions in combination with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid to precisely rotate my engines to their gimbal extent to see what effect that has. \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E-BA also has a gimbal submenu that I haven\u0027t really used.\n\u003C/p\u003E\n\u003Cp\u003E\n2) In a well-designed craft, trying to hold the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E WILL result in thrust through the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E (plus aero forces). As long as the current \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E is within the limits of your gimbals to put the thrust vector through.\n\u003C/p\u003E\n\u003Cp\u003E\n2 \u0026amp; 3) Throttle Controlled Avionics is THE gold standard of controlling \u0022wacky\u0022 craft. It\u0027s got a pretty steep learning curve that I haven\u0027t put the effort into mastering yet. I definitely need to.\n\u003C/p\u003E\n"},{"CreatedByName":"devikwolf","CreatedById":142118,"CreatedDateTime":"2018-03-09T22:46:16Z","Content":"\n\u003Cp\u003E\nThanks for the input \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111640\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0022 rel=\u0022\u0022\u003E@FleshJeb\u003C/a\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll give \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E-BA and \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E a try. I\u0027ve been using MechJeb for ages because of the details it gives during design, but I haven\u0027t used Kerbal Engineer in a few years (I liked what \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E did, at the time, better).\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, my experience with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is that the craft usually starts thrusting with the engines at neutral gimbal, and then once it begins torquing off to one side, it will begin to correct. This occurs in orbit so I\u0027m ruling out any aero influence. However, I MIGHT be mis-attributing the behavior to the fact that my probe\u0027s control vector is only aligned with my thrust vector in the crudest of senses.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m pretty sure I\u0027ve heard of TCA in the past, but I\u0027ll check it out this weekend. If it\u0027s the one I\u0027m thinking of, I played with it a lot, a while ago. I might be thinking of a different mod, though -- I was looking for something that could balance engine throttle and gimbals to put a skycrane into an autonomous hover mode while lowering my Curiosity clone to Duna\u0027s surface, something I\u0027m still trying to accomplish smoothly.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-09T22:46:30Z\u0022 title=\u002203/09/2018 10:46  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 9, 2018\u003C/time\u003E by devikwolf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2018-03-09T23:04:11Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223315244\u0022 data-ipsquote-contentid=\u0022171910\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520635576\u0022 data-ipsquote-userid=\u0022142118\u0022 data-ipsquote-username=\u0022devikwolf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n14 minutes ago, devikwolf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThanks for the input \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111640\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0022 rel=\u0022\u0022\u003E@FleshJeb\u003C/a\u003E!\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ll give \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E-BA and \u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E a try. I\u0027ve been using MechJeb for ages because of the details it gives during design, but I haven\u0027t used Kerbal Engineer in a few years (I liked what \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E did, at the time, better).\n\u003C/p\u003E\n\u003Cp\u003E\nHowever, my experience with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is that the craft usually starts thrusting with the engines at neutral gimbal, and then once it begins torquing off to one side, it will begin to correct. This occurs in orbit so I\u0027m ruling out any aero influence. However, I MIGHT be mis-attributing the behavior to the fact that my probe\u0027s control vector is only aligned with my thrust vector in the crudest of senses.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m pretty sure I\u0027ve heard of TCA in the past, but I\u0027ll check it out this weekend. If it\u0027s the one I\u0027m thinking of, I played with it a lot, a while ago. I might be thinking of a different mod, though -- I was looking for something that could balance engine throttle and gimbals to put a skycrane into an autonomous hover mode while lowering my Curiosity clone to Duna\u0027s surface, something I\u0027m still trying to accomplish smoothly.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E isn\u0027t going to give you that much more information specific to this problem. Although I\u0027ve always used both it and MechJeb for various readouts.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027re probably correct, it\u0027s been about a year since I flew anything that had gimballed engines in space.It should settle out after the initial mis-torque (provided that it\u0027s small enough).\n\u003C/p\u003E\n\u003Cp\u003E\nTCA is a super-complex thrust-balancer. Eventually I\u0027ll get around to learning it.\n\u003C/p\u003E\n\u003Cp\u003E\nMechJeb has a hover mode, but it\u0027s not fantastic. I think it\u0027s the Translatron. I try to push \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E to it\u0027s limits to find out what they are, and they can be fairly narrow without getting into PID tuning. So I try to design my craft to operate within the limits of what \u003Cabbr title=\u0022Mechjeb (mod)\u0022\u003EMJ\u003C/abbr\u003E can do well and reliably. Which means limiting the gimbal range on my engines and keeping my \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E within reasonable bounds (\u0026gt;2 \u0026lt;3) by limiting the thrust sliders, or the max acceleration in the Utility settings.\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: You can also get into automated control via KOS or KRPC.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-03-09T23:04:59Z\u0022 title=\u002203/09/2018 11:04  PM\u0022 data-short=\u00226 yr\u0022\u003EMarch 9, 2018\u003C/time\u003E by FleshJeb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-03-10T15:41:27Z","Content":"\n\u003Cp\u003E\n The trick I use when designing shuttles:\n\u003C/p\u003E\n\u003Cp\u003E\n Not only do I aim the thrust at the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E, but I also juggle the ET\u0027s flow priority so that the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E moves toward the engines as the tanks drain. This is why the engines need to be well- below the main tank instead of next to it.\n\u003C/p\u003E\n\u003Cp\u003E\n For control... handling is a bit wonky. Yaw and roll inputs basically swap and reverse.\n\u003C/p\u003E\n\u003Cp\u003E\nBest,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2018-03-10T16:53:31Z","Content":"\n\u003Cp\u003E\nBehold: the Next- gen Asymmetrical Navigable Rocket (NANR) \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003Cbr\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Hmjsaul.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022594\u0022 src=\u0022https://i.imgur.com/Hmjsaul.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Kmbm0s5.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022601\u0022 src=\u0022https://i.imgur.com/Kmbm0s5.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oEzbttF.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022597\u0022 src=\u0022https://i.imgur.com/oEzbttF.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003C/p\u003E\n\u003Cbr\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nThe fact that the thrust is pointed at the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E and the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E falls toward the engine as the fuel drains makes this rocket controllable... Barely. Roll control is achieved with small yaw inputs.\n\u003C/p\u003E\n\u003Cp\u003E\nHTHs,\u003Cbr\u003E\n-Slashy\n\u003C/p\u003E\n"},{"CreatedByName":"Human Person","CreatedById":174876,"CreatedDateTime":"2018-03-10T16:55:53Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223315226\u0022 data-ipsquote-contentid=\u0022171910\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520634774\u0022 data-ipsquote-userid=\u0022111640\u0022 data-ipsquote-username=\u0022FleshJeb\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n18 hours ago, FleshJeb said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n1 \u0026amp; 2) \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid will show you all kinds of uneven torques for both dry and full tanks, and recalculate in real time.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSecond that. \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid is IMO the most useful mod you can have, even more useful than Mechjeb.\n\u003C/p\u003E\n"},{"CreatedByName":"devikwolf","CreatedById":142118,"CreatedDateTime":"2018-03-10T19:20:30Z","Content":"\n\u003Cp\u003E\n\u003Cabbr title=\u0022Kerbal Engineer Redux (mod)\u0022\u003EKER\u003C/abbr\u003E doesn\u0027t seem to be much help to my current problem, but I definitely wish I had installed this mod a few years ago. Thumbs up for this recommendation!\n\u003C/p\u003E\n\u003Cp\u003E\nSeems I can\u0027t get \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E-BA running properly. The button shows up in the toolbar, but pressing it does nothing. Hm. I\u0027ll do some more digging into what\u0027s keeping that from working properly.\n\u003C/p\u003E\n\u003Cp\u003E\nTried out TCA; it hindered more than helped, ultimately. It made the shuttle extremely controllable at certain parts of the flight, but most of the time it was wobbling around. And I definitely had used this mod in the past, too, at some point. I don\u0027t recall exactly what it was for.\n\u003C/p\u003E\n\u003Cp\u003E\nI spent a while last night playing with the shuttle some more. By locking gimbals on the SSMEs during initial ascent and just relying on aero surfaces and \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E gimbal to maneuver, I eliminated the ascent wobble. Gimbals go back on shortly before \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E sep. Some extreme fine-tuning with the position of my probe core control points have helped a lot, but I still suffer from the fact that \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E doesn\u0027t make engines gimbal towards \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E until after the vehicle is already torquing over. It\u0027s far more controllable now than it was before, but fine rendezvous is a bit tricky because of that wobble. Selecting the probe cores to be a control point is also somewhat frustrating because of how they\u0027re tucked up in the engine cluster, so just getting the cursor to highlight them is a trick. But that\u0027s always been the case with my shuttles.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, and I\u0027m certain this is a limitation of SSTU: I had to mount my shuttle very much lower on the tank than I would like. I believe this is because, unlike the real shuttle which had the heavier oxidizer on the top of the tank, SSTU doesn\u0027t know how to do that, so the tank\u0027s \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E is a lot lower than the real shuttle\u0027s would be. I think, anyways. I could probably solve the problem by building the tank in two parts, a separate piece for LH2 and one for LOX.\n\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2018-03-10T19:44:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223316209\u0022 data-ipsquote-contentid=\u0022171910\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221520709630\u0022 data-ipsquote-userid=\u0022142118\u0022 data-ipsquote-username=\u0022devikwolf\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 minutes ago, devikwolf said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI spent a while last night playing with the shuttle some more. By locking gimbals on the SSMEs during initial ascent and just relying on aero surfaces and \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E gimbal to maneuver, I eliminated the ascent wobble. Gimbals go back on shortly before \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E sep. Some extreme fine-tuning with the position of my probe core control points have helped a lot, but I still suffer from the fact that \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E doesn\u0027t make engines gimbal towards \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E until after the vehicle is already torquing over. It\u0027s far more controllable now than it was before, but fine rendezvous is a bit tricky because of that wobble. Selecting the probe cores to be a control point is also somewhat frustrating because of how they\u0027re tucked up in the engine cluster, so just getting the cursor to highlight them is a trick. But that\u0027s always been the case with my shuttles.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, and I\u0027m certain this is a limitation of SSTU: I had to mount my shuttle very much lower on the tank than I would like. I believe this is because, unlike the real shuttle which had the heavier oxidizer on the top of the tank, SSTU doesn\u0027t know how to do that, so the tank\u0027s \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E is a lot lower than the real shuttle\u0027s would be. I think, anyways. I could probably solve the problem by building the tank in two parts, a separate piece for LH2 and one for LOX.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDo the trim controls affect gimbals before you light the engines? (Alt-W,S,A,D,Q,E. Alt-X to recenter.)\u003Cbr\u003E\n\u0022Control From Here\u0022 can be set via action group now--No clicking necessary.\n\u003C/p\u003E\n\u003Cp\u003E\nChanging your tank setup would definitely help.\n\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2018-03-16T16:03:40Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/142118-devikwolf/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022142118\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/142118-devikwolf/\u0022 rel=\u0022\u0022\u003E@devikwolf\u003C/a\u003E \n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed8497199081\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/142982-11x-gimbal-trim-v111-2016-07-03-for-when-you-dont-really-want-to-go-that-way/\u0026amp;do=embed\u0022 style=\u0022height:207px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\nThis will be worth checking out, even though it\u0027s not currently updated.\n\u003C/p\u003E\n"},{"CreatedByName":"Cap Arcona","CreatedById":126667,"CreatedDateTime":"2018-03-23T21:17:58Z","Content":"\n\u003Cp\u003E\nI\u0027m sure you\u0027ve already tried this, but I\u0027ve found \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E Build Aid to be invaluable. You can make some really precise designs if you put in the time. I lost all my good shuttles with the update, because I\u0027m a dingus and didn\u0027t save my 1.3.1 installation, but I had some that could launch and land with little to no input or MechJeb (getting a stable glide on your shuttle is a pain, but getting a stable launch vehicle is murder). I didn\u0027t know about Thruster Trim, I should hang out in the forums more often.\n\u003C/p\u003E\n"}]}