{"TopicId":176069,"ForumId":16,"TopicTitle":"Need help","CreatedByName":"Thecandym0n131","CreatedById":189337,"CreatedDateTime":"2018-06-21T10:19:24Z","PageNum":1,"Articles":[{"CreatedByName":"Thecandym0n131","CreatedById":189337,"CreatedDateTime":"2018-06-21T10:19:24Z","Content":"\n\u003Cp\u003E\nOk i really enjoy this game but i suck at building like really bad so anyway ive been to both moons landed and returned but for the life of me i cannot get anywhere else. All kinds of this happen but what ever the reasob im tired of sending kerbels to there \u0022 death\u0022 so i was wondering will someone tell me part by part how to build an interplanetary rocket i dont care wherr it can get to and i dont want the perfect rocket i just need to build a basic concept so i can see how its done plz plz help im on ps4 if that matters\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-21T10:37:44Z\u0022 title=\u002206/21/2018 10:37  AM\u0022 data-short=\u00226 yr\u0022\u003EJune 21, 2018\u003C/time\u003E by Thecandym0n131\u003C/strong\u003E\n\u003Cbr\u003EAdding what im playing on\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2018-06-21T15:43:06Z","Content":"\n\u003Cp\u003E\nOn this thread, another guy was asking something very similar.\n\u003C/p\u003E\n\u003Cp\u003E\nI posted a rocket, and the detailed trip to Duna and back, with maneuvers and everything.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 class=\u0022ipsEmbed_finishedLoading\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed500166410\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/174479-ksp-console-version-proof-pls\u0026amp;do=embed\u0022 style=\u0022overflow: hidden; height: 223px; max-width: 502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-06-21T15:43:30Z\u0022 title=\u002206/21/2018 03:43  PM\u0022 data-short=\u00226 yr\u0022\u003EJune 21, 2018\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ArmoredLipid","CreatedById":189824,"CreatedDateTime":"2018-06-22T05:46:31Z","Content":"\n\u003Cp\u003E\nA large number of interplanetary launch window calculators exist; just search up \u0022KSP planetary launch window calculator\u0022. Your rocket should have a lot of delta-v; consider building a small refueling station in low Kerbin orbit to resupply after leaving the atmosphere. Use LV-N \u0022Nerv\u0022 atomic rocket motors for your second stage; while the ion engine has much better IsP, it has much crappier thrust - 1/30 that of the Nerv - and still manages to have a lower thrust-to-weight ratio, despite the fact that the Nerv weighs literal tons. Your lower stage should have anything with a thrust-to-weight ratio of over 1 attached to it - the more, the better. Kickback boosters around a Mammoth central core do wonders. May I ask what, exactly, you are attempting to shoot out of Kerbin?\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2018-06-22T12:42:42Z","Content":"\n\u003Cp\u003E\nThe main difference between a beginner Duna lander and a Mun lander is in the transfer rocket;  most serviceable Mun landers will work as adequate Duna landers; just add parachutes to save fuel (and remember that you will still need to land with the engine; parachutes will slow you but not necessarily to a safe speed on Duna).\n\u003C/p\u003E\n\u003Cp\u003E\nBefore you go any farther, yes, you probably want to go to Duna as your first interplanetary destination.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the transfer rocket, you need extra fuel but not necessarily a larger engine.  If you have the Poodle, it\u0027s a great vacuum-rated engine and will easily give you all of the thrust you need.  It may be overdoing it for a Duna mission but while experienced players can run Duna missions with milligram tolerances in their rockets, for a beginner, I\u0027ll say that while it\u0027s not ideal to take too much rocket, it is generally better to have it and not need it than to need it and not have it.\n\u003C/p\u003E\n\u003Cp\u003E\nIf your issue is not so much in the construction of the rocket but rather in the piloting of that rocket, then you can get a small-scale version of interplanetary transfers by going from Mun orbit to Minmus orbit.  This will let you develop a feeling for how these kinds of manoeuvres work.  Treat Kerbin as the \u0027sun\u0027 and the two moons as \u0027planets\u0027 and you\u0027ll start to see how interplanetary transfers are different from planet-to-moon transfers.  There are transfer windows between the Mun and Minmus approximately every seven days, and if you miss, you won\u0027t be lost in space, unable to return to Kerbin.\n\u003C/p\u003E\n"}]}