{"TopicId":177001,"ForumId":16,"TopicTitle":"Early High Altitude aircraft","CreatedByName":"se5a","CreatedById":156245,"CreatedDateTime":"2018-07-24T11:46:20Z","PageNum":1,"Articles":[{"CreatedByName":"se5a","CreatedById":156245,"CreatedDateTime":"2018-07-24T11:46:20Z","Content":"\n\u003Cp\u003E\nSo I\u0027ve been trying to do those \u0022above 17km\u0022 contracts, and strugling to come up with a stable aircraft that\u0027ll get me up there.\n\u003C/p\u003E\n\u003Cp\u003E\nmy current design has two wheeslies and a reliant. the wheeslies get me to the position and to a reasonable altitude and the reliant gets me up that final altitude.\n\u003C/p\u003E\n\u003Cp\u003E\nproblem is I\u0027m having problems with stability after I\u0027ve burned most my fuel, I suspect the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E changes enough to screw me over.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat designs have you guys used?\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m also using a few mods, such as procedural fuel tanks, which I\u0027m filling with oxygen, since I\u0027ve got enough fuel. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/a/PylQTVG\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/PylQTVG\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"mk1980","CreatedById":163203,"CreatedDateTime":"2018-07-24T12:21:35Z","Content":"\n\u003Cp\u003E\nto be honest, i usually skip those contracts altogether \u003Cspan\u003E:) anything involving science from kerbin, really\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\ndoing them with a capsule (if it\u0027s about crew reports) or a simple probe (other experiments) in a polar orbit is probably the least effort. takes some patience, though. may take a few roations until the capsule crosses over the target area at the right moment.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nas for a plane based solution - i\u0027d either wait for panther engines. they operate just fine up to 12\u002B km or something and have enough thrust with afterburners to do a steep climb to slingshot above the required ~18km before falling back down.\n\u003C/p\u003E\n\u003Cp\u003E\nfor a wheesley \u002B rocket solution, i\u0027d go with very little liquid fuel (wheesleys don\u0027t need much). don\u0027t know how much fuel you have in that plane, but the rocket fuel should easily be enough to push that bird up a few kilometers multiple times. unless you made the plane too heavy.\n\u003C/p\u003E\n\u003Cp\u003E\nmight also be worthwhile to try a terrier instead of reliant. wheesleys should get you high enough for the terrier to work efficiently, so you\u0027d save some mass. a few sparks would also do the trick if you already got those.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\ni\u0027d probably put the wings a bit further in the back. the engines should be roughly the same weight as the cockpit (engines probably a bit heavier) so if the wings are roughly in the middle of the plane, the dry and wet \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E should be reasonably close to each other.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2018-07-24T15:11:10Z","Content":"\n\u003Cp\u003E\nI like something like this:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00223RhWU4a.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022453\u0022 src=\u0022https://i.imgur.com/3RhWU4a.jpg\u0022 width=\u0022808\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nVery low tech. It can hop 3 times to 18km\u002B in a single flight.\n\u003C/p\u003E\n\u003Cp\u003E\nYou are right that \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E shifts are a big problem on this kind of a flight. I find it useful to have a forward fuel tank and lock it, so that it gets used last. That keeps your \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E as far forward as long as possible -- but on a flight that comes close to running on fumes, the landing can still be very dicey.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Freds","CreatedById":132437,"CreatedDateTime":"2018-07-24T15:38:29Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421370\u0022 data-ipsquote-contentid=\u0022177001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532445070\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n28 minutes ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI find it useful to have a forward fuel tank and lock it, so that it gets used last.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nAnother way is to change fuel priorities Instead of tank locking - this is better because fuel just get consumed in the right order, so there is no need manually unlock the tank while in flight and also eliminates the risk of a flameout due to fuel starvation while having fuel onboard.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-24T15:39:33Z\u0022 title=\u002207/24/2018 03:39  PM\u0022 data-short=\u00225 yr\u0022\u003EJuly 24, 2018\u003C/time\u003E by Freds\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2018-07-24T16:14:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421260\u0022 data-ipsquote-contentid=\u0022177001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532432780\u0022 data-ipsquote-userid=\u0022156245\u0022 data-ipsquote-username=\u0022se5a\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, se5a said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSo I\u0027ve been trying to do those \u0022above 17km\u0022 contracts, and strugling to come up with a stable aircraft that\u0027ll get me up there.\n\u003C/p\u003E\n\u003Cp\u003E\nmy current design has two wheeslies and a reliant. the wheeslies get me to the position and to a reasonable altitude and the reliant gets me up that final altitude.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nMy solution is pretty much like \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154251\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0022 rel=\u0022\u0022\u003E@bewing\u003C/a\u003E\u0027s:\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223421370\u0022 data-ipsquote-contentid=\u0022177001\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221532445070\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI like something like this\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n^ This.  A simple, small Juno-powered plane can fly easily up to ~10 km, then a Terrier can pop it up high enough to snag the target zone.\n\u003C/p\u003E\n\u003Cp\u003E\nI like the Terrier because it\u0027s small and lightweight.  Not only does that make it not bog the airplane down, but also, engines are \u003Cem\u003E\u003Cu\u003Eheavy\u003C/u\u003E\u003C/em\u003E, and having a big heavy engine at the back end of an aircraft moves the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E backwards and can reduce airplane stability.  The Terrier, being nicely lightweight for an engine, doesn\u0027t cause so much of a problem.\n\u003C/p\u003E\n\u003Cp\u003E\n(\u0022But Terriers are \u003Cem\u003E\u003Cu\u003Evacuum\u003C/u\u003E\u003C/em\u003E engines!\u0022, I hear you cry.  Yes, but do bear in mind that at a mere 10 km altitude, you\u0027re already almost 90% of the way to a vacuum, and the Terrier gets very close to its excellent vacuum Isp.  You don\u0027t have to get very high above sea level for Terriers to become effective.)\n\u003C/p\u003E\n\u003Cp\u003E\nSo, the main thing to maintain aero stability is to design it so that shifting fuel loads don\u0027t muck around much with the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E.  There are two main things I do to cope with this:\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, \u003Cem\u003E\u003Cu\u003Emake sure the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E isn\u0027t way in the back of the plane\u003C/u\u003E\u003C/em\u003E.  I do this by putting only one relatively lightweight engine in the back (a Terrier), and then mounting my Juno engines \u003Cem\u003E\u003Cu\u003Eamidships\u003C/u\u003E\u003C/em\u003E rather than at the back end of the plane-- e.g. a pair of Junos, one on either side of the fuselage.\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, \u003Cem\u003E\u003Cu\u003Emount the fuel tanks symmetrically fore/aft around the middle of the plane\u003C/u\u003E\u003C/em\u003E.  If your fuel tanks are mostly-fore or mostly-aft of the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E, then your \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E will shift dramatically as they drain, which can kill your stability.  Whereas if the fuel tanks are in the \u003Cem\u003E\u003Cu\u003Emiddle\u003C/u\u003E\u003C/em\u003E, then the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E doesn\u0027t move much as they drain.\n\u003C/p\u003E\n\u003Cp\u003E\nI do this by putting the \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E tanks (for the jet engines) amidships, with the jet engines themselves.  Then a small (say, 2-ton) \u003Cabbr title=\u0022Liquid Fuel and Oxidizer\u0022\u003ELFO\u003C/abbr\u003E tank for the Terrier is also amidships.  If I need to make the airplane longer (to provide better lever arm for control surfaces, to adjust \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E position, etc.), the Structural Fuselage part works great-- it provides a lot of length without adding significant drag, and is very lightweight.  I may not need to add a Structural Fuselage, depending on the overall airplane design; when I do add one, most commonly I put it at the back end, right in front of the Terrier, so that it moves the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E forward.\n\u003C/p\u003E\n\u003Cp\u003E\nA final note, if all else fails:  If you\u0027ve got a plane that works fine to accomplish the objective, and its \u003Cem\u003E\u003Cu\u003Eonly\u003C/u\u003E\u003C/em\u003E problem is \u0022hard to land afterwards because it became unstable\u0022 ... well, you could always \u0022cheat\u0022 and just tack on a radial parachute or two for landing it.  \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E  Perhaps not quite as satisfying as engineering a reliably stable plane, I suppose... but it gets the job done!\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2018-07-24T17:08:38Z","Content":"\n\u003Cp\u003E\n\u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E build aid is really invaluable,  I suspect you are having a problem because your engines are too heavy and when there is no fuel aboard the weight of the cockpit alone is not enough.  The mod shows a red dot which is where your dry \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E is, so you can get that right first then place the fuel equally either side of it.   Also shows torque induced by thrust, so you can center the engine better with offset tool if needed.\n\u003C/p\u003E\n\u003Cp\u003E\nAs Snark said, try using the lighter Terrier, it sill has plenty of power for an airplane,   and try pushing the jet engines forward.    Again,  four or six Junos may be easier to place forward than a pair of heavy wheeleys.\n\u003C/p\u003E\n"},{"CreatedByName":"steuben","CreatedById":77368,"CreatedDateTime":"2018-07-24T18:56:24Z","Content":"\n\u003Cp\u003E\nI\u0027ve got a _very_ early design.  It can do one hop up to 19km-ish. It requires, Aviation, Engineering 101, Basic Rocketry, and Stability. You can add in Survivability for the PresMat for a bit extra science.\n\u003C/p\u003E\n\u003Cp\u003E\nYou strap a pair of Junos either side of the Swivel, four FL-T100s, a pair of Mk-0 \u003Cabbr title=\u0022Liquid Fuel\u0022\u003ELF\u003C/abbr\u003E tanks, and enough bits and bobs to get it to fly and land... if you want to. I\u0027ll bang up a blueprint when I\u0027m on my usual machine.\n\u003C/p\u003E\n"},{"CreatedByName":"se5a","CreatedById":156245,"CreatedDateTime":"2018-07-24T22:31:40Z","Content":"\n\u003Cp\u003E\nThis little dude got me up there, though was a tad nose heavy (actually it was a bit heavy overall) on landing - well, \u0027landing\u0027 the pilots survived....\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/a/LU4YsjG\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/LU4YsjG\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI could drop some unneeded stuff, like sci jr, and drop some of the fuel, but was trying to come up with a little multi-purpose shuttlecraft, not sure how it\u0027ll handle re-entry heat.\n\u003C/p\u003E\n\u003Cp\u003E\nI guess I\u0027ll install tweakscale and increase the size of those wings. why\u0027d squad not make winglets procedurally sized as stock? and wheels... and other things?\n\u003C/p\u003E\n"},{"CreatedByName":"Rocket In My Pocket","CreatedById":154640,"CreatedDateTime":"2018-07-24T23:28:06Z","Content":"\n\u003Cp\u003E\nCorrectCOL mod will show you a nice graph read out and tell you if your dry com vs. wet com is stable on top of just plain out improving a lot of over sights in the stock \u003Cabbr title=\u0022Center of Lift\u0022\u003Ecol\u003C/abbr\u003E marker.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027d link it but I\u0027m on my phone.\n\u003C/p\u003E\n"},{"CreatedByName":"se5a","CreatedById":156245,"CreatedDateTime":"2018-07-25T10:31:06Z","Content":"\n\u003Cp\u003E\nDid some science and built this: \u003Ca href=\u0022https://imgur.com/a/u4As5x3\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/u4As5x3\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nflying it manualy is all good, fairly stable and not too bad to fly.\n\u003C/p\u003E\n\u003Cp\u003E\ntrying to get mechjeb to fly it though... it just goes crazy and I end up in a flat spin. seems like even if I turn mechjeb autopilot on then off again it stays completely screwed up and uncontrollable.\n\u003C/p\u003E\n\u003Cp\u003E\nSince some of my contracts are a fair way around the planet flying them all manually is a bit tedious, a bit of straight and level autopilot is kind of nice. but, mechjeb really hates this plane. not sure why at all.\n\u003C/p\u003E\n\u003Cp\u003E\nThese engines seem to just sip at the fuel, I think I can get just about anywhere on Kerbin with this, and fairly quickly too. but I\u0027m too impatient to just sit there staring at the screen keeping it at the same altitude for the duration of those sorts of flights.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nTried the CorrectCOL mod, which says the pitch is unstable, but I\u0027m unsure why this is. does it just not like canard configurations?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit: tried a tail vs canard version of the above, and it was even worse, horrible to fly manualy and would stall at the slightest provocation.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-25T11:38:45Z\u0022 title=\u002207/25/2018 11:38  AM\u0022 data-short=\u00225 yr\u0022\u003EJuly 25, 2018\u003C/time\u003E by se5a\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Freds","CreatedById":132437,"CreatedDateTime":"2018-07-25T13:48:40Z","Content":"\n\u003Cp\u003E\nMechJeb are nice for space piloting - i use smartASS all the time. For atmospheric flying i use AtmosphereAutopilot mod, it really helps piloting aircraft when using a Keyboard.  Just remember to disable mechjeb smartASS (or any other mechjeb functions) when you enable the mod.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed1672803035\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/124417-122-142-dlc-atmosphereautopilot-1510-looking-for-maintainer/\u0026amp;do=embed\u0022 style=\u0022height:225px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"se5a","CreatedById":156245,"CreatedDateTime":"2018-07-26T01:57:43Z","Content":"\n\u003Cp\u003E\nJust tried AtmosphereAutopilot. it does seem to be way better than MechJeb. I got to the point where I felt just putting the mechjeb modual on the aircraft caused to be unstable. does mechjeb mess with trim at all? sometimes I felt like as soon as I turned it on, and turned it off sometimes itd screw everything up.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThat being said, there must be something up with my designs that make them prone to high speed stalls.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-07-26T02:08:42Z\u0022 title=\u002207/26/2018 02:08  AM\u0022 data-short=\u00225 yr\u0022\u003EJuly 26, 2018\u003C/time\u003E by se5a\u003C/strong\u003E\n\u003C/span\u003E\n"}]}