{"TopicId":180728,"ForumId":16,"TopicTitle":"Are Planes Even Landable?","CreatedByName":"Yeem","CreatedById":194131,"CreatedDateTime":"2018-12-20T20:06:32Z","PageNum":1,"Articles":[{"CreatedByName":"Yeem","CreatedById":194131,"CreatedDateTime":"2018-12-20T20:06:32Z","Content":"\n\u003Cp\u003E\nI\u0027ve had several plane models get off the ground and fly so far, and not a single one of them has been landable in any form. During my descent, I can\u0027t get the plane to drop below 70 horizontal m/s by any means. I\u0027ve read posts about lowering my vertical speed below 5 m/s but even when I do that every single wheel still explodes on contact. I\u0027ve read about making the back wheels lower than the front wheels so that they touch down first, but they just explode when they do. I\u0027ve even gone so far as to pull my plane 5 feet up above the runway, kill the engine and attempt to touch down again -- somehow, in the 3 seconds the plane was in the air, the wheels go from perfectly functional to hot dynamite. Honestly I\u0027m tempted to just start using parachutes and give up on landing being a \u0022thing\u0022. Here are photos of my latest craft.\n\u003C/p\u003E\n\u003Cp\u003E\nhttps://imgur.com/a/h7FsWva\n\u003C/p\u003E\n"},{"CreatedByName":"Cavscout74","CreatedById":181783,"CreatedDateTime":"2018-12-20T21:16:28Z","Content":"\n\u003Cp\u003E\nWhat game version \u0026amp; what wheels are you using?   I can\u0027t open your image for some reason, just shows up as text to me \u0026amp; copying it to a browser does nothing either. \n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve not run into any issues in 1.5.1 yet, but some previous versions had gear problems, primarily excessive bouncing.   But normally, the gear should not explode easily.  I\u0027ve touched down in excess of 100 m/s, bounced repeatedly \u0026amp; broken off other parts of the plane without causing gear to explode.  Frequently, the gear are the some of the few surviving parts of catastrophic crash landings, so you definitely have something odd going on.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2018-12-20T21:34:14Z","Content":"\n\u003Cp\u003E\nSounds like the plane could use more lift so that it\u0027s not relying on speed to remain airborne. Also, those are the weakest model of wheels, and are only suitable for very small planes. If you can get better ones I suspect you\u0027ll have less trouble. \n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2018-12-20T21:39:40Z","Content":"\n\u003Cp\u003E\nWelcome to the forums, yeem.\n\u003C/p\u003E\n\u003Cp\u003E\nThose wheels are generally not capable of handling that much weight. Those ones max out at about 7 tonnes, iirc, for a tricycle arrangement.\n\u003C/p\u003E\n\u003Cp\u003E\nFor fancier designs like yours, you are going to need the next higher tech version of a landing gear.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-20T21:45:25Z\u0022 title=\u002212/20/2018 09:45  PM\u0022 data-short=\u00225 yr\u0022\u003EDecember 20, 2018\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2018-12-20T22:15:59Z","Content":"\n\u003Cp\u003E\nThere are a couple of things to consider when placing landing gear that aren\u0027t at all obvious:\n\u003C/p\u003E\n\u003Cp\u003E\nFirst, the angle of the plane when resting on the ground. If the plane is nose up, it will take off easily, but land badly, since it will have to have a very high angle of attack (angle of nose relative to direction of travel) to land on the back wheels first. If a plane is nose down, it will land better most of the time, but may act weird in some circumstances, and will have trouble taking off. The Space Shuttle, which only even needed to land horizontally and never take off, had a very nose-down attitude on the ground:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www.nasa.gov/images/content/152546main_Landing2-lg.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.nasa.gov/images/content/152546main_Landing2-lg.jpg\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSecond, the location of the landing gear relative to the center of mass (\u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E) of your craft. There are two typical ways of doing this in the real world, but you shouldn\u0027t feel constrained to only using these ways in KSP. The first is tricycle landing gear. This is the most common in modern airplanes, and overall the best in most cases. It has one small wheel at the very front of the plane, and two or more large wheels right behind the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E. As the plane increases its speed, it lifts the front wheel off the ground, the wings start to generate more lift, and the plane takes off. Placing the wheels only slightly behind the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E means that the plane can pitch up easily while still on the ground. When landing, the plane touches down with its nose up, landing on the two large wheels first, then letting the nose drop to the runway.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022tricycle.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022450\u0022 src=\u0022http://www.aerospaceweb.org/question/design/gear/tricycle.jpg\u0022 width=\u0022550\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe other way is called taildragger, and is essentially the opposite, with two large wheels well in front of the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E, and one small wheel at the tail of the plane.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022takeoff-angle.gif\u0022 class=\u0022ipsImage\u0022 height=\u0022372\u0022 src=\u0022http://www.zenithair.com/stol/gif/takeoff-angle.gif\u0022 width=\u0022276\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe first two planes in that image are taildragger, the last is tricycle. When taking off, the plane will quickly rise off the rear wheel, staying on the two main wheels for most of the takeoff. When landing, the plane comes in nearly level, then returns to all three wheels after slowing down.\n\u003C/p\u003E\n\u003Cp\u003E\nFrom my experience in KSP, tricycle is harder to build, but easier to fly, while taildragger is easier to build but harder to fly.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat upgrade level is your runway? For some weird reason, the earlier levels are worse than the flat ground around the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E for landing, so you may want to try that.\n\u003C/p\u003E\n\u003Cp\u003E\nAs others have said, upgrading to heavier duty landing gear will help. You may also want to look at the way the vertical wings that hold your engines on are attached. It looks like they are connected to the part of the swept wing that tilts slightly down, which can cause issues. Placing them slightly further back may help. \u003Ca href=\u0022https://i.imgur.com/T9f6l4g.jpg\u0022 rel=\u0022external nofollow\u0022\u003EThis\u003C/a\u003E vs \u003Ca href=\u0022https://i.imgur.com/yqAtxw9.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E.\n\u003C/p\u003E\n"},{"CreatedByName":"dire","CreatedById":12239,"CreatedDateTime":"2018-12-20T23:49:10Z","Content":"\n\u003Cp\u003E\nIf your mission profile will allow it, you\u0027re going to want to cut down on your engines to just one wheezely, which should still be plenty of thrust for that much plane but reduces the burden on the landing gear. Also don\u0027t forget to throttle down on landing. You should be able to land on between 0 and 15% engine power.\n\u003C/p\u003E\n\u003Cp\u003E\nProtip: If your plane starts acting crazy and doesn\u0027t want to steer straight when you\u0027re taking off, your wheels are overburdened and are more likely to explode when you land. Less of an issue with spaceplanes because they tend to burn so much fuel that they are many tons lighter on touchdown, but your plane is mostly engine and payload and very little fuel, so your takeoff weight is almost the same as your landing weight.\n\u003C/p\u003E\n\u003Cp\u003E\nYou\u0027ll also want to get in the habit of thinking about where your fuel is relative to center of mass, and try to keep your full and empty \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E at about the same spot. That\u0027s only important if your \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E slips behind your center of lift because your plane will then not want to fly straight, which again is more of a factor with spaceplanes whose \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E can potentially shift quite a bit thanks to all the fuel they burn.\n\u003C/p\u003E\n\u003Cp\u003E\nI made a little mark-1 plane for you so you can practice landing and have something to go fast, and if you do give up you should be able to make a powered parachute landing: \u003Ca href=\u0022https://kerbalx.com/direstorm/Mark-1-Mach-1\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/direstorm/Mark-1-Mach-1\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe plane has a couple of more advanced spaceplane features that you can explore as well: the rear wheels are doubled up and you\u0027ve got a small amount of oxidizer to let you hit some of the lower \u0022altitude above\u0022 contracts -- probably can\u0027t get \u0022suborbital tourist\u0022 in this one unless you want to start playing with \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E payloads, and there isn\u0027t really a small, thin \u003Cabbr title=\u0022Solid fuel Rocket Booster\u0022\u003ESRB\u003C/abbr\u003E that would make a good spaceplane booster unless you want to tinker with the sounding rocket mod.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t have sparks yet, you should definitely consider them as they\u0027re very handy for early-career science missions and remain good later for return vessels and landers. I\u0027ll also say you\u0027re right and those lander legs DO seem to be made of explodium, but if you pack spares it\u0027s not too big an issue \u003Cimg alt=\u0022;)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 title=\u0022;)\u0022\u003E If you get frustrated, try again when you can use the small folding wheels.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg src=\u0022https://i.imgur.com/wZOOMiP.png\u0022 class=\u0022ipsImage\u0022 alt=\u0022wZOOMiP.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222018-12-21T00:35:01Z\u0022 title=\u002212/21/2018 12:35  AM\u0022 data-short=\u00225 yr\u0022\u003EDecember 21, 2018\u003C/time\u003E by dire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Yeem","CreatedById":194131,"CreatedDateTime":"2018-12-21T00:55:24Z","Content":"\n\u003Cp\u003E\nThank you very much for all the advice. Turns out \u0022get better landing gear\u0022 was the correct answer, as I can actually land now. I also found that I can reverse the thrust on my wheezelys to manually force the plane to slow down more than it wants to. Just did my first landing with no parachutes.\n\u003C/p\u003E\n"}]}