{"TopicId":181540,"ForumId":16,"TopicTitle":"Rescue in LKO","CreatedByName":"MPDerksen","CreatedById":186988,"CreatedDateTime":"2019-01-20T06:04:51Z","PageNum":1,"Articles":[{"CreatedByName":"MPDerksen","CreatedById":186988,"CreatedDateTime":"2019-01-20T06:04:51Z","Content":"\n\u003Cp\u003E\nMy last thread was all over the place and I got LOTS of great help, but my questions were unfocused.  Let me be specific on the current mission(s).\n\u003C/p\u003E\n\u003Cp\u003E\nI have a craft in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E (\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E of 88.4K, and \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E of 78.5K).  My target craft is in an orbit of \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E 85K and \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E of 74.5K.  So basically a little below me, and will be catching me after many orbits.  My An and Dn are at 0.7 degrees, so my next step is to get that to 0.0, right?\n\u003C/p\u003E\n\u003Cp\u003E\nCurrent separation at the Intersect 1 is 672km, but that should get smaller each revolution.  \n\u003C/p\u003E\n\u003Cp\u003E\nMy current question concerns that my \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E and \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E is not exactly at the same spot as my target.  maybe 20km apart each?  When I watch the Scott Manley videos, he shows that, once you get \u0022close\u0022, you simply \u0022match orbits\u0022 with your target to get your relative velocity the same.  Several tries so far, and I get within a few km for a short time, then have to thrust all over the place to stay close, and then things go to xxxx.  \u003Cbr\u003E\nLet\u0027s start there with my questions?\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2019-01-20T07:23:32Z","Content":"\n\u003Cp\u003E\nFor a rendezvous I will usually get my inclination to 0.1° for a \u0027medium gravity\u0027 body like the Mun.  This will help you later on and is good practice for when you begin docking.\n\u003C/p\u003E\n\u003Cp\u003E\n I make either \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E or \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E the same as my target and wait for the target to ensure a close encounter - in your example you will be at least 3.4km away from an intercept without adjustment.  Once I\u0027m within 50 - 80km of my target I set a maneuver node at the point I matched either the \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E or \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E and play around until I get the intersect within 1km (if you have matched planes you will only need to burn either prograde or retrograde to fine tune the encounter).  With a fairly close orbit like yours the speed of the encounter should be around 20-30m/s but even if its higher, remember that a Kerbal EVA pack has about 500m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E (quite a lot for orbital maneuvers).\n\u003C/p\u003E\n\u003Cp\u003E\nOnce you are within 2.2km of your target, switch to it using the [ key and EVA your stranded Kerbal.  At this point I look for the rescue vehicle and \u0027select as target\u0027.  From here on it\u0027s all about the nav ball so switch it into target mode if it isn\u0027t already.  You should see a target \u003Cimg alt=\u0022:targetpro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetPro20px.png\u0022 title=\u0022:targetpro:\u0022\u003E or anti-target \u003Cimg alt=\u0022:targetretro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetRetro20px.png\u0022 title=\u0022:targetretro:\u0022\u003E symbol in addition to the standard vector symbols.  All you need to do is match up the target symbol \u003Cimg alt=\u0022:targetpro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetPro20px.png\u0022 title=\u0022:targetpro:\u0022\u003E with your prograde symbol \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E and you are now headed towards the rescue vessel at the speed indicated on the top of the navball.  You will need to make some small adjustments and then slow your Kerbal down when you get really close.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-01-20T07:26:58Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223525386\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221547964291\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nso my next step is to get that to 0.0, right?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nRight.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223525386\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221547964291\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nMy current question concerns that my \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E and \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E is not exactly at the same spot as my target.  maybe 20km apart each?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNot a problem.\n\u003C/p\u003E\n\u003Cp\u003E\nLet\u0027s say your separation is decreasing at 20km per orbit. You wait until your separation is less than 20km, and then you know that during your next orbit, you are going to pass each other.\n\u003C/p\u003E\n\u003Cp\u003E\nNow you burn retrograde (or create a retrograde maneuver node) so that your orbit crosses your target orbit -- at approximately the point where the separation goes to zero.\n\u003C/p\u003E\n\u003Cp\u003E\nYou get to that crossing point -- then the trick is to put your navball in TARGET mode, and burn retrograde until your speed is zero. This automatically puts you in the same orbit as your target, and you are pretty close.\n\u003C/p\u003E\n\u003Cp\u003E\nThen you point your nose at your target, and burn just a little bit (10 m/s is a good number). When you get \u003Cstrong\u003E\u003Cem\u003Ereally \u003C/em\u003E\u003C/strong\u003Eclose, you turn around retrograde (still in target mode) and burn to 0.0 m/s again. Then repeat.\n\u003C/p\u003E\n"},{"CreatedByName":"Espatie","CreatedById":194327,"CreatedDateTime":"2019-01-20T08:12:09Z","Content":"\n\u003Cp\u003E\nAs \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022154251\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/154251-bewing/\u0022 rel=\u0022\u0022\u003E@bewing\u003C/a\u003E mentions, making sure your Navball is in target mode is key.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t have to have \u003Cem\u003Eprecisely\u003C/em\u003E the same inclination or the same longitude/argument of Periapsis; reasonably close is good enough, because the following instructions will - by definition - match the orbits.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOnce you are at closest approach, put your Navball into target mode (you will need to have made the other ship a target via the Map window).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EIn target mode the Yellow Prograde and Retrograde icons on the Navball indicate your direction of travel relative to your target.\u003C/strong\u003E The Pink target icons show the absolute direction to the target. The Velocity readout shows the relative velocity between the two craft.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUnless you are incredibly lucky, the Yellow Prograde icon will be nowhere near the Pink target icon.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nThe first thing to do is to kill the crosswise relative velocity. Point your ship to Retrograde and run the engine until Velocity = 0. If your pilot is level 1 then your \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E can lock to the Retrograde icon. At a Velocity of less than 1 m/s the lock will switch to just hold, but that\u0027s fine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOnce you are stationary relative to the target, unlock your \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, turn to point directly at the target (pilot level 3 to automatically lock to that direction, but easily done manually) and burn a bit. Your relative direction is now directly closing the distance. How much velocity you carry here depends on the distance between the two craft and your patience.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOnce you are moving at an acceptable velocity, shut down your engine and turn to point Retrograde again. Don\u0027t get too close too fast! Make small burns to manage your velocity appropriately until you are within 100 metres. Your target will \u0022wander\u0022 slightly off the direction of your movement (because the two craft are in different orbits) but that\u0027s not a problem.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOnce you are within 100 metres of the target you can kill all the remaining relative velocity; you are now stationary with respect to the target and in (almost) exactly the same orbit. You can either switch to the other craft and EVA the occupant over to your rescue ship, or you can set up to dock using \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nOne other thing is that you will now inevitably find that your rescue is taking place on the night side of Kerbin, and will wish you had put some lights on your ship.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nLastly I strongly recommend the mod \u0022Easy Vessel Switch\u0022 for flipping between the ships. \u0022Navball Docking Alignment Indicator\u0022 is very good when you get to docking ships together.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-01-20T08:13:20Z\u0022 title=\u002201/20/2019 08:13  AM\u0022 data-short=\u00225 yr\u0022\u003EJanuary 20, 2019\u003C/time\u003E by Espatie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Daveroski","CreatedById":93896,"CreatedDateTime":"2019-01-20T15:26:18Z","Content":"\n\u003Cp\u003E\nAnd here\u0027s how I do it.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst I don\u0027t worry about the difference in inclination. I\u0027ll work with anything upto 5.0 degrees difference.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I will set my \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E to be a tiny bit less than my target\u0027s \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E. Anything less will do no matter how small so I go tiny difference. This will ensure that at some point our orbits pass each other very closely.\n\u003C/p\u003E\n\u003Cp\u003E\nI will ensure that I have the Target set as \u0022Target.\u0022 but that my Navball is set for \u0022Orbit\u0022 Not Target or surface.\n\u003C/p\u003E\n\u003Cp\u003E\nI will then make a node at my pe and make my \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E roughly the same as my target\u0027s.\n\u003C/p\u003E\n\u003Cp\u003E\nBefore closing the node I will Right click it and using the plus symbol increase the number of orbits until I get either an encounter or in the ballpark.\n\u003C/p\u003E\n\u003Cp\u003E\nThen I will right click the node again and make adjustments with radial in/out \u003Cimg alt=\u0022:antiradial:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Antiradial20px.png\u0022 title=\u0022:antiradial:\u0022\u003E\u003Cimg alt=\u0022:radial:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Radial20px.png\u0022 title=\u0022:radial:\u0022\u003E and Normal and Anti-normal \u003Cimg alt=\u0022:normal:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Normal20px.png\u0022 title=\u0022:normal:\u0022\u003E\u003Cimg alt=\u0022:antinormal:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/Antinormal20px.png\u0022 title=\u0022:antinormal:\u0022\u003E and with a little work I  should be able to get an encounter at 0m or at least pretty close to it.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce I have the node plotted I action it as carefully as possible.\u003Cbr\u003E\nFor me, that means if the burn is only a few seconds, I will reduce the thrust power of my engine by as much as 90% so that I have a nice long burn at the node. I will work out from the duration of the burn when I should start my burn and begin at full throttle so that I am halfway through my burn at the time of reaching the node.\u003Cbr\u003E\nAs I approach the end of the burn I will stop at around 1 second of burn left and then use SHIFT and X to get the burn to 0\u003Cbr\u003E\nThen I will close the node.\n\u003C/p\u003E\n\u003Cp\u003E\nI will look at the map and see that my closest approach is pretty close to 0.\n\u003C/p\u003E\n\u003Cp\u003E\nI will reset my engine to full power and use the sticky pin for my engine so that I can make it softer should I need to. I hate having to be fast on the buttons, I like to be able to take it steady.\n\u003C/p\u003E\n\u003Cp\u003E\nWarp at this point is optional, but I try not to overshoot the point where my navball automatically switches to target. Because sometimes, it doesn\u0027t.\n\u003C/p\u003E\n\u003Cp\u003E\nI like to end up 2-3 KM away. to give myself time to be sure I am ready for the encounter.\n\u003C/p\u003E\n\u003Cp\u003E\nIf it is not already, I will make my navball set for \u0022Target\u0022 not orbit or surface.\n\u003C/p\u003E\n\u003Cp\u003E\nI will aim Retrograde. \u003Cimg alt=\u0022:retrograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/retrograde2.png\u0022 title=\u0022:retrograde:\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIdeally I want to come to a gentle stop as close as possible to the target.\n\u003C/p\u003E\n\u003Cp\u003E\nAt 1000m I will do a full power engine burst. Ready to hit X immediately if braking is too fast.\u003Cbr\u003E\nI will want to finish the braking with the shift key so after the initial burst, I will reduce the power to my engine again and use the shift key and X as required until My relative velocity is 0.\n\u003C/p\u003E\n\u003Cp\u003E\nI will then set my navball back to \u0022Orbit\u0022 not target or surface.\n\u003C/p\u003E\n\u003Cp\u003E\nIf I am taking someone on board via EVA I will orient my ship using just \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E not \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI will point the entry door towards the other ship.\n\u003C/p\u003E\n\u003Cp\u003E\nFor \u003Cem\u003E\u003Cstrong\u003Esimple\u003C/strong\u003E\u003C/em\u003E EVA I just remember the golden rules.\n\u003C/p\u003E\n\u003Cp\u003E\nI Use space to make the kerbal face away from me.\n\u003C/p\u003E\n\u003Cp\u003E\n1. Only travel in one direction at a time.\n\u003C/p\u003E\n\u003Cp\u003E\n2. Only use burst of 1 second.\n\u003C/p\u003E\n\u003Cp\u003E\n3 Three seconds of thrust to move need three seconds of thrust in the opposite direction to stop.\n\u003C/p\u003E\n\u003Cp\u003E\n4. Go up or down then stop.\n\u003C/p\u003E\n\u003Cp\u003E\n5 Go left or right then stop.\n\u003C/p\u003E\n\u003Cp\u003E\n6 Go forward and prepare to stop or grab.\n\u003C/p\u003E\n\u003Cp\u003E\nRepeat as required.\n\u003C/p\u003E\n\u003Cp\u003E\nD.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Espatie","CreatedById":194327,"CreatedDateTime":"2019-01-20T19:15:38Z","Content":"\n\u003Cp\u003E\nI generally approach with the active ship in a wider (i.e. slower) orbit and let the target catch me up, mostly habit because the game loves to give out rescue missions with the target skirting the very edge of the atmosphere of Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nWith practice you get to just know what angle two orbits will close by.\n\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2019-01-20T22:02:08Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223525386\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221547964291\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n15 hours ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nseveral tries so far, and I get within a few km for a short time, then have to thrust all over the place to stay close, and then things go to xxxx.  \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis bit is easy(ish) \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EAvoid thrusting all over the place. This isn\u0027t Elite and you don\u0027t need constant engine thrust to move.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EWhen you do get within a few km, click the \u0022orbit: 2xxx m/s\u0022 readout above your navball and it should change to \u0022target: xx m/s\u0022. Now you can aim for the retrograde marker and burn \u003Cem\u003Egently\u003C/em\u003E until it reaches zero. From here on you will hang around at roughly the same distance. Point at target, burn \u003Cem\u003Eslightly\u003C/em\u003E towards it, e.g. 20m/s, and wait to get closer.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nNavball is everything for rendezvous and docking; ignore everything else on the screen above because,it\u0027s not relevant \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MPDerksen","CreatedById":186988,"CreatedDateTime":"2019-02-11T01:04:20Z","Content":"\n\u003Cp\u003E\nSO close!!  I got to about 600m from the Vergas craft, and m/s about 0.4.  I switch to Vergas, EVA, and start flying.  This is a whole different battle.  How do I know if I’m flying towards the craft directly?  Since the EVA pilot doesn’t have \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, do I maneuver to keep the Prograde marker in the center of the nav ball, and my m/s reasonable?  Since I can’t pitch to face directly at my target (or can I?), I’m faced with not knowing which thrust to apply to slow myself when I get close.  I put the rescue ship directly behind Vergas, hit space, and it only orientates left/right, not pitch.  This would be a helpful binding...\n\u003C/p\u003E\n"},{"CreatedByName":"Espatie","CreatedById":194327,"CreatedDateTime":"2019-02-11T01:12:10Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538423\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549847060\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSO close!!  I got to about 600m from the Vergas craft, and m/s about 0.4.  I switch to Vergas, EVA, and start flying.  This is a whole different battle.  How do I know if I’m flying towards the craft directly?  Since the EVA pilot doesn’t have \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, do I maneuver to keep the Prograde marker in the center of the nav ball, and my m/s reasonable?  Since I can’t pitch to face directly at my target (or can I?), I’m faced with not knowing which thrust to apply to slow myself when I get close.  I put the rescue ship directly behind Vergas, hit space, and it only orientates left/right, not pitch.  This would be a helpful binding...\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou can set the target for your EVA Kerbal to the rescue ship. That gives you the yellow box on screen, the pink target on the navball and directional movement markers.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYour Kerbal will always orient him/herself to be in-line with the North-South Axis of the planet or moon whose \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E you are in. This means that your forward and back thrust always accelerate you in one plane. Forward is always away from your Camera position in that plane, backward towards it, left and right are done with respect to the camera position.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPersonally I remapped my EVA movement keys onto the Numpad, but it\u0027s up to you how you do it.\n\u003C/p\u003E\n"},{"CreatedByName":"MPDerksen","CreatedById":186988,"CreatedDateTime":"2019-02-11T01:25:47Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538429\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549847530\u0022 data-ipsquote-userid=\u0022194327\u0022 data-ipsquote-username=\u0022Espatie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 minutes ago, Espatie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can set the target for your EVA Kerbal to the rescue ship. That gives you the yellow box on screen, the pink target on the navball and directional movement markers.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYour Kerbal will always orient him/herself to be in-line with the North-South Axis of the planet or moon whose \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E you are in. This means that your forward and back thrust always accelerate you in one plane. Forward is always away from your Camera position in that plane, backward towards it, left and right are done with respect to the camera position.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nPersonally I remapped my EVA movement keys onto the Numpad, but it\u0027s up to you how you do it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI did set the ship as \u0022target\u0022, so that\u0027s how I know my relative m/s.  I\u0027m just having a terrible time knowing what thrust to use to move in closer.  I got to 70m, but then was going too fast to slow down, and zipped right by.  It doesn\u0027t seem as simple as just pointing at it, thrust prograde, and then slow down with retrograde.  The little guy doesn\u0027t actually point AT the ship the way a ship with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E will.\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2019-02-11T01:29:44Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538436\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549848347\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt doesn\u0027t seem as simple as just pointing at it, thrust prograde, and then slow down with retrograde.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYou\u0027re nearly there, you just need to match up your prograde vector \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E to your target marker \u003Cimg alt=\u0022:targetpro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetPro20px.png\u0022 title=\u0022:targetpro:\u0022\u003E on the navball and watch your approach speed.  Relying on visuals for the approach is very difficult until you get really close.  An example (I only use the navball information until I get 20-30m from the vessel):\u003Cbr\u003E\u003Cimg alt=\u00224rQFVRz.png\u0022 class=\u0022ipsImage\u0022 height=\u0022667\u0022 src=\u0022https://i.imgur.com/4rQFVRz.png\u0022 width=\u00221009\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhen you thrust to slow down it will change the prograde vector so keep adjusting to keep the two markers lined up and you will make it.\n\u003C/p\u003E\n\u003Cp\u003E\nAnother edit: I only backward thrust to slow down, after that, if your prograde is above the target usle ctrl to lower it, if below use shift.  Use a or d for left right adjustments.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-11T02:13:45Z\u0022 title=\u002202/11/2019 02:13  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 11, 2019\u003C/time\u003E by James Kerman\u003C/strong\u003E\n\u003Cbr\u003Eadded more info and image\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-02-11T02:56:35Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538423\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549847060\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nSO close!!  I got to about 600m from the Vergas craft, and m/s about 0.4.  I switch to Vergas, EVA, and start flying.  This is a whole different battle.  How do I know if I’m flying towards the craft directly?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYes, flying on EVA is different than flying a ship.\n\u003C/p\u003E\n\u003Cp\u003E\nAs mentioned already, the kerbal\u0027s helmet always points north. So you can\u0027t adjust that dimension with the camera. If your destination ship is above you, \u003Cstrong\u003Ethe only way to get there\u003C/strong\u003E is to use the Shift key to thrust \u003Cstrong\u003Eup\u003C/strong\u003E. Similarly with down and the Ctrl key.\n\u003C/p\u003E\n\u003Cp\u003E\nI really only fly EVA in space by eye -- almost never with the navball.\n\u003C/p\u003E\n\u003Cp\u003E\nYou zoom the camera out until you see your destination. You swing the camera around until the camera is directly behind the kerbal, facing the destination. Hit Space to force your kerbal to face in that direction. Now you know that W is prograde, and S is retrograde. Now judge whether your destination ship is above your kerbal\u0027s head, or below his feet -- you need to fix that with the Space or Ctrl keys. So you hit Shift/Ctrl and W to head toward the destination. Keep your speed down -- there\u0027s no reason to go faster than maybe 7 m/s until you are an expert.\n\u003C/p\u003E\n\u003Cp\u003E\nIf the destination ship is sliding sideways (vs your prograde symbol, or just visually) then use A/D to cancel that movement.\n\u003C/p\u003E\n\u003Cp\u003E\nYou want to fix the vertical dimension (Shift/Ctrl) before you get to your destination, because it\u0027s hard to see in that direction.\n\u003C/p\u003E\n\u003Cp\u003E\nUsually, your helmet light is L, and that can really help for the last few meters. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EIt can also help to turn on the lights on your destination ship.\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Espatie","CreatedById":194327,"CreatedDateTime":"2019-02-11T03:10:34Z","Content":"\n\u003Cp\u003E\nI think helmet lights are U by default. IDK I have mine on Numpad *\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nUnlike @bewing I fly long distances almost entirely by Navball in EVA mode. I find flying by eye impossible unless at really close range.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nQuicksave, try it, revert if failed. You\u0027ve got about 200 m/s Delta-V in the pack. It\u0027s perfectly possible to cross kilometres between ships once you have enough practice with the technique.\n\u003C/p\u003E\n"},{"CreatedByName":"GoatRider","CreatedById":103681,"CreatedDateTime":"2019-02-11T03:56:09Z","Content":"\n\u003Cp\u003E\nHelmet light (and ship lighting) is U on my keyboard, and I haven\u0027t changed it from default.\n\u003C/p\u003E\n"},{"CreatedByName":"MPDerksen","CreatedById":186988,"CreatedDateTime":"2019-02-11T03:59:48Z","Content":"\n\u003Cp\u003E\nYou guys are really patient and helpful.  \u003Cbr\u003E\nI’m not really able to get identical orbits, which I’m not sure how critical that is.  Current state is now.\n\u003C/p\u003E\n\u003Cp\u003E\nRescue Ship:\u003Cbr\u003E\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E - 77014\u003Cbr\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E - 85328\n\u003C/p\u003E\n\u003Cp\u003E\nTarget:\u003Cbr\u003E\u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E - 77065\u003Cbr\u003E\u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E - 85346\n\u003C/p\u003E\n\u003Cp\u003E\nThe next Interscet is in 29m, 26s.  Separation of 3.0Km Relative Speed of 13.6m/s\n\u003C/p\u003E\n\u003Cp\u003E\nI backed up a few quick saves to adjust my orbits closer (I was within 0.6Km, but only had a few min to EVA before the ships separated).  Right now, with my nav ball on “Target” mode, I see the pink markers mentioned above.  However, I’m not really sure if the 13.6m/s referrs to getting closer or further apart.  I think the first step is a little advice how to get my relative speed down to 0.0m/s.  How close do the orbits need to match?  Is the above close enough just for a simple rescue or docking?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEdit Note:  I got to the node.  I pointed at the target, and burned prograde.  Never got close.  Then it got ahead of me and when I went back to the map, my orbit was not significantly different and the next encounter was going to be 110K separation.  So yeah, I’m missing something or I’m not smart enough for this simulation. \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EMichael\u003C/span\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-11T04:07:36Z\u0022 title=\u002202/11/2019 04:07  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 11, 2019\u003C/time\u003E by MPDerksen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2019-02-11T04:34:36Z","Content":"\n\u003Cp\u003E\nThe orbital elements don\u0027t need to be terribly similar for the intercept. All that matters is that:\n\u003C/p\u003E\n\u003Cp\u003E\nYou have a close approach\n\u003C/p\u003E\n\u003Cp\u003E\nYou have enough delta-V to kill your relative velocity at the intercept\n\u003C/p\u003E\n\u003Cp\u003E\nThe intercept is not so incredibly fast that it\u0027s hard to get an accurate velocity matching maneuver. A 40 m/sec relative velocity is easier to eliminate than a 4000 m/sec relative velocity.\n\u003C/p\u003E\n\u003Cp\u003E\nThe orbital elements will match up quite well once velocities are matched. Before that point, a near match helps, as it\u0027ll reduce the magnitude of the velocity matching maneuver, but it\u0027s not strictly necessary. \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-11T04:35:14Z\u0022 title=\u002202/11/2019 04:35  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 11, 2019\u003C/time\u003E by Starman4308\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-02-11T04:45:33Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538497\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549857588\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n41 minutes ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI got to\u003Cspan\u003E﻿\u003C/span\u003E the node.  I pointed at the target, and burned prograde.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNah nah nah. Gotta go back and reread the initial comments in this thread. You set target mode, and point \u003Cem\u003E\u003Cstrong\u003Eretrograde\u003C/strong\u003E\u003C/em\u003E in target mode, and burn in that direction.\n\u003C/p\u003E\n\u003Cp\u003E\nIn target mode, the displayed speed is your relative speed. When you burn retrograde, you are burning exactly against your relative speed -- which makes it go to zero.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538497\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549857588\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n43 minutes ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n I think the first step is a little advice how to get my relative speed down to 0.0m/s.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n^That\u0027s how you do it. Burn retrograde in target mode.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538497\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549857588\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n44 minutes ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHowever, I’m not really sure if the 13.6m/s refers to getting closer or further apart.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nBoth. If you have a close approach, then you are getting closer until you get to the node, and then you start getting further apart. The 13.6 is the vector speed difference when you pass each other.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2019-02-11T04:47:40Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538497\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549857588\u0022 data-ipsquote-userid=\u0022186988\u0022 data-ipsquote-username=\u0022MPDerksen\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n48 minutes ago, MPDerksen said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThe next Interscet is in 29m, 26s.  Separation of 3.0Km Relative Speed of 13.6m/s\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nNinja\u0027d by \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022122674\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/122674-starman4308/\u0022 rel=\u0022\u0022\u003E@Starman4308\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nSet a maneuver node a few minutes ahead of your vessels current position and play around with it until you get it to 2.2km or less.  Your relative speed is good but you only really need to get within switching distance of your target (A kerbal on EVA has about 500m/s \u003Cabbr title=\u0022Delta-V\u0022\u003EDv\u003C/abbr\u003E - enough to go more than half way to the mun and in this case you only need to kill 13.6m/s) so that you have control of the kerbal.  Don\u0027t worry about how much time you have to perform the transfer, this changes as you make adjustments.\n\u003C/p\u003E\n\u003Cp\u003E\nYou are moving towards your target when the prograde indicator \u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E(actual direction of your kerbal/vessel) is close to your target marker  \u003Cimg alt=\u0022:targetpro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetPro20px.png\u0022 title=\u0022:targetpro:\u0022\u003E.  If you are moving away from your target you will see the retrograde indicator \u003Cimg alt=\u0022:retrograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/retrograde2.png\u0022 title=\u0022:retrograde:\u0022\u003E (opposite direction).\n\u003C/p\u003E\n\u003Cp\u003E\nYour relative speed should only be zero when you actually get to the rescue vehicle so you don\u0027t need to perfectly match orbits - the fine tuning of the orbits is what happens as a natural consequence of keeping your markers lined up with \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E.  For docking you want to minimize the amount of monoprop your vessel carries so in that case an orbit that varies by 1-2km is desirable for an easy, slow speed dock.\n\u003C/p\u003E\n\u003Cp\u003E\nI have rescued kerbals with a vessel that was in an opposite orbit to the stranded wreck around minmus and often perform high speed intercepts to save on fuel up to 200m/s speed difference (but its best not to try this until you have a better understanding of the process).\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-11T04:48:22Z\u0022 title=\u002202/11/2019 04:48  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 11, 2019\u003C/time\u003E by James Kerman\u003C/strong\u003E\n\u003Cbr\u003Egrammar\n\u003C/span\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2019-02-11T05:23:45Z","Content":"\n\u003Cp\u003E\nok, part of the problem is your rescue ship started from an orbit that is almost identical to that of the target.  That\u0027s why it took you so many orbits to reduce the distance at intercept to a reasonable level.  The larger the difference in orbit, the fewer orbits you need to catch up with the target.  I usually go for an orbit with 2:1 or 3:1 resonance, that means an orbit where the lower of the objects orbits 2-3 times in the time it takes the higher to go around once.  The tricky part here is that instead of just precessing into a rendezvous with your target, once you line up you need to spend some delta-v to change orbits to a rendezvous.  It\u0027s a trade off of time over delta-v, but it allows you to have more control over the rendezvous itself.\n\u003C/p\u003E\n\u003Cp\u003E\nIt\u0027s the same principal as transferring to a moon.  Wait until the ship in the higher orbit is about a quarter further around the planet then the one in the lower orbit.  Plot a maneuver node to intercept the target as close as possible by burning either retrograde\u003Cimg alt=\u0022:retrograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/retrograde2.png\u0022 title=\u0022:retrograde:\u0022\u003E or prograde\u003Cimg alt=\u0022:prograde:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/prograde3.png\u0022 title=\u0022:prograde:\u0022\u003E (depending on whether you\u0027re in the high ship or the low ship), when you get close enough, either plot a maneuver node to match orbits, or burn the opposite direction of your previous burn until the target velocity is as close to 0 m/s as possible.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-11T05:25:05Z\u0022 title=\u002202/11/2019 05:25  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 11, 2019\u003C/time\u003E by Capt. Hunt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MPDerksen","CreatedById":186988,"CreatedDateTime":"2019-02-11T05:34:02Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223538517\u0022 data-ipsquote-contentid=\u0022181540\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221549860333\u0022 data-ipsquote-userid=\u0022154251\u0022 data-ipsquote-username=\u0022bewing\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n45 minutes ago, bewing said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nNah nah nah. Gotta go back and reread the initial comments in this thread. You set target mode, and point \u003Cem\u003E\u003Cstrong\u003Eretrograde\u003C/strong\u003E\u003C/em\u003E in target mode, and burn in that direction.\n\u003C/p\u003E\n\u003Cp\u003E\nIn target mode, the displayed speed is your relative speed. When you burn retrograde, you are burning exactly against your relative speed -- which makes it go to zero.\n\u003C/p\u003E\n\u003Cp\u003E\n^That\u0027s how you do it. Burn retrograde in target mode.\n\u003C/p\u003E\n\u003Cp\u003E\nBoth. If you have a close approach, then you are getting closer until you get to the node, and then you start getting further apart. The 13.6 is the vector speed difference when you pass each other.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nSo here is the clarification I may need.  I was starting with an orbit that was higher (slower) than my target, and letting it catch me.  But if I was in a lower orbit and catching it, then prograde and retrograde get flipped?  Geez, I’m probably over-thinking this.  But I don’t want to get lucky, I want to LEARN the process.  I’ll reread the entire thread before i just stab at it again.  (Plus it looks like there are a few more replies below to consider...)\n\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2019-02-11T06:06:34Z","Content":"\n\u003Cp\u003E\nJust remember that prograde and retrograde are relative ... in the case of rendezvous, target-relative.  Thrusting target-retrograde will always bring your velocity closer to the target, which is probably what you need if you\u0027re already close to it.  If you\u0027re not close, it could be a good way to burn up.  If you\u0027re adjusting your orbit to set up a later encounter, you\u0027ll want to be working relative to the orbit instead.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-02-11T06:07:14Z","Content":"\n\u003Cp\u003E\nOnce you have a close approach (less than maybe 15km at Kerbin -- more on a CB with lower gravity), it\u0027s best not to think of it in terms of orbits anymore. Just think of it in terms of 3-D space.\n\u003C/p\u003E\n\u003Cp\u003E\nYou and the other ship are passing each other. It doesn\u0027t matter which direction. All you are concerned about when doing a rendezvous is relative speeds.\n\u003C/p\u003E\n\u003Cp\u003E\nTarget mode on the navball shows you the relative speeds and directions. You don\u0027t need to worry about which compass points they are.\n\u003C/p\u003E\n\u003Cp\u003E\nYou want prograde (the direction you are moving) to be right on top of the target marker on the navball (or equivalently the retrograde marker on top of anti-target). Because that means you are moving straight toward the target.\n\u003C/p\u003E\n\u003Cp\u003E\nBut you may be going too fast, or too slow, and the prograde marker will always drift over time.\n\u003C/p\u003E\n\u003Cp\u003E\nAs you begin your pass, you may have time to \u0022push\u0022 the retrograde marker on top of the anti-target marker (or pull the prograde marker on top of the target marker).\n\u003C/p\u003E\n\u003Cp\u003E\nBut at some point, you always want to come to a stop, relative to the other ship -- and you always do that by burning retrograde.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Dan Kerman","CreatedById":193616,"CreatedDateTime":"2019-02-11T15:56:25Z","Content":"\n\u003Cp\u003E\nFor rendezvous and docking, I found this guide helped me immensely...  explains it very well...  my approaches are much more controlled and I barely use any mono now to line up. Makes rescues simpler and docking easy peasy.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://web.archive.org/web/20151126132127/http://forum.kerbalspaceprogram.com/entries/3770-Illustrated-guide-to-docking\u0022 rel=\u0022external nofollow\u0022\u003ETutorial\u003C/a\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"MPDerksen","CreatedById":186988,"CreatedDateTime":"2019-02-13T02:19:44Z","Content":"\n\u003Cp\u003E\nright, so that Tutorial helped, but I\u0027m not getting closer.  In fact, my intersection points get further away with each effort.  I see how I\u0027m supposed to move the pink target to move on top of the retrograde marker.  But the target is passing below me at a lower orbit.  Once that happens, then I end up flipping around and chasing it.  My m/s goes from it getting closer to me, to it pulling away.  In the first picture below, you can see that we don\u0027t REALLY \u0022intersect\u0022, but I suspect this is our closest point of passing?\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u00222lnhiwy.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022359\u0022 src=\u0022http://i65.tinypic.com/2lnhiwy.jpg\u0022 width=\u0022502\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nNow here is my nav ball.  According to the tutorial, I would guide the pink marker onto the retrograde one by going to the other side, thrusting, and it would move the yellow one on top of the pink one...\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022oix7dc.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022281\u0022 src=\u0022http://i63.tinypic.com/oix7dc.jpg\u0022 width=\u0022389\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nHere is a picture from that tutorial.  As you can see, the relative speed between them is much higher, and the markers are much closer together than mine above.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Dh1WtNX.png\u0022 class=\u0022ipsImage\u0022 height=\u0022195\u0022 src=\u0022https://web.archive.org/web/20151126132127im_/http://i.imgur.com/Dh1WtNX.png\u0022 width=\u0022486\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s happening, is that I get my speed down to about 3m/s, then Vergas flies below me, and starts pulling ahead.  Then, the next encounter is even further away.  I\u0027m generally not very good at this, I guess, so what else can I try?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-02-13T02:58:23Z","Content":"\n\u003Cp\u003E\nAh, you have to make your orbits \u003Cstrong\u003E\u003Cem\u003Ecross\u003C/em\u003E\u003C/strong\u003E to make it easy to actually get an intercept by only pushing the yellow/green retrograde marker. And you push the retrograde marker around, not the pink antitarget marker. Basically, you waited too long to push your retrograde marker. If you push it around sooner, that will make your orbit cross.\n\u003C/p\u003E\n\u003Cp\u003E\nYes, that orange intercept marker mostly shows the closest approach, but it is not absolutely precise. As you make adjustments to get your closest approach even closer, yes the intercept marker will move farther away from you in time -- but the \u0022separation\u0022 number (which is the important one) will decrease to zero.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can also turn around and point at the target, and pull your prograde marker around in the same way as you push your retrograde marker -- and that will also fix the fact that your orbits don\u0027t cross. This is also necessary if your \u0022target\u0022 speed gets too low (or goes to zero). Having slightly faster intercepts actually works better. The markers don\u0027t have time to drift very far if you are going faster.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-02-13T03:01:43Z\u0022 title=\u002202/13/2019 03:01  AM\u0022 data-short=\u00225 yr\u0022\u003EFebruary 13, 2019\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"}]}