{"TopicId":183484,"ForumId":16,"TopicTitle":"Not getting science missions","CreatedByName":"Ron Devu","CreatedById":196475,"CreatedDateTime":"2019-04-06T23:03:33Z","PageNum":1,"Articles":[{"CreatedByName":"Ron Devu","CreatedById":196475,"CreatedDateTime":"2019-04-06T23:03:33Z","Content":"\n\u003Cp\u003E\nI\u0027m in a position where about the only science missions I get are the survey ones nobody does. Research is not progressing and the science missions I do get are generally well beyond my abilities. For example, I frequently get missions to test equipment I have not unlocked yet. Is there a way to get more, do-able science missions?\n\u003C/p\u003E\n"},{"CreatedByName":"James Kerman","CreatedById":160462,"CreatedDateTime":"2019-04-06T23:09:52Z","Content":"\n\u003Cp\u003E\nGetting a test equipment mission will temporarily unlock the required part. It will be locked again once the mission is successfully completed. Accepting such missions without completing is a technique that can be used to have access to parts higher in the tree when you are short of science points.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2019-04-07T00:15:21Z","Content":"\n\u003Cp\u003E\nAlso, I don\u0027t ever consider contracts as science opportunities. I get science on my own by using the science doodads on return missions (I never bother with probes, except as relay satellites) and I pick contracts for the place I\u0027m going to fund the mission.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-04-07T05:49:38Z","Content":"\n\u003Cp\u003E\nThere are many ways to get science. As 5th Horseman said -- the best method is to unlock science instruments and then take them around the system and perform experiments in new places. This should allow you to progress your research.\n\u003C/p\u003E\n\u003Cp\u003E\nAs James Kerman said, part test contracts always give you the parts you need to complete the contract.\n\u003C/p\u003E\n\u003Cp\u003E\nBeyond that -- the way contracts work is that as you complete them, you gain reputation. As you gain reputation, you get new types of contracts offered to you.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}