{"TopicId":185813,"ForumId":16,"TopicTitle":"SAR Water Vessel Construction","CreatedByName":"Mister_Spaceman","CreatedById":173500,"CreatedDateTime":"2019-06-25T04:28:05Z","PageNum":1,"Articles":[{"CreatedByName":"Mister_Spaceman","CreatedById":173500,"CreatedDateTime":"2019-06-25T04:28:05Z","Content":"\n\u003Cp\u003E\nWith the SM Marine mod seemingly defunct, a lack of other civvie ship mods, and a burning desire to bring \u0022Death to the Green Button\u0022 (Credit to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/183830-realkerbal3x/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022183830\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/183830-realkerbal3x/\u0022 rel=\u0022\u0022\u003E@RealKerbal3x\u003C/a\u003E for the idea), I\u0027ve decided to start building ships capable of bringing crew capsules back to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. However, I haven\u0027t a clue wher to start. I\u0027ve never built any stock vessels capable of water transportation (not well, anyway), much less pick up a capsule and carry it home. I have an idea of the basic requirements:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nBouyant parts (for floating)\n\u003C/li\u003E\n\u003Cli\u003E\nNon-bouyant parts (far not floating too much)\n\u003C/li\u003E\n\u003Cli\u003E\nEngines and air intakes (for moving while you float)\n\u003C/li\u003E\n\u003Cli\u003E\nSome sort of crane system, most likely modded (so the thing can pick up a capsule)\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nMy question is, how does one build a ship with a large enough cargo deck for a crew capsule? What are some tips for proper balance, effecient construction (low part count), and general things to keep in mind for seagoing vessels? I\u0027ve noticed a thread or two that may help greatly with this, namely some of \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/145841-triop/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022145841\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/145841-triop/\u0022 rel=\u0022\u0022\u003E@Triop\u003C/a\u003E\u0027s circumnavigation threads. Any threads that may serve for good inspiration? Are there any mods I\u0027m missing that may help with the whole ship thing?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nModerators- Feel free to relocate this thread if it belongs elsewhere. I can\u0027t tell if it\u0027s at home in the questions subforum, or the spacecraft exchange.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-06-25T07:07:56Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBouyant parts (for floating) ﻿\n\u003C/p\u003E\n\u003Cp\u003E\nNon-bouyant parts (far not floating too much)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nPretty much every part except full ore tanks in buoyant. Interestingly the medium sized rotor sinks while the other two float. Aside from it, I haven\u0027t found any other non\u0027ore tank part that sinks. Even structural girders float (hmm, maybe I should try I-beams).\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nQuote\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEngines and air intakes (for moving while you float)\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhen operating on kerbin, I\u0027d say the best engines for a boat are goliaths, due to their high Isp. Air intakes will work above and below water, as will jet engines (that\u0027s KSP for you).\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want, you can use the breaking ground rotors to make screw propellers:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022kLruZdA.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/kLruZdA.png\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022JNnbc6M.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/JNnbc6M.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022D1hVToi.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/D1hVToi.png\u0022\u003E\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nBut Jet engines are simpler and more powerful, particularly if you don\u0027t care about neutral buoyancy as with a sub. Before breaking ground I used them to make subs (wouldn\u0027t work on Eve, or a mod world like Tekto though) where the sub would start slightly heavy and would slowly sink when full of liquid fuel, and would slowly rise when empty. The low fuel consumption of jets meant that short trips had very minimal buoyancy changes.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SibS7yU.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/SibS7yU.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dmp42Qe.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/dmp42Qe.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nboats are much easier, just about anything floats. You have to try to not make it float. So just take some mk3 fusalages (high impact tolerance), and put some jets on them... like this without wings, and more efficient jets:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022a3WptmK.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/a3WptmK.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nPaddlewheels can work too, but they are slow, as this pre-breaking ground (using the old separate craft for rotors trick) demonstrates.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022R4tEbQy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/R4tEbQy.png\u0022\u003E\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223624797\u0022 data-ipsquote-contentid=\u0022185813\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561436885\u0022 data-ipsquote-userid=\u0022173500\u0022 data-ipsquote-username=\u0022Mister_Spaceman\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Mister_Spaceman said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cul\u003E\u003Cli\u003E\nSome sort of crane system, most likely modded (so the thing can pick up a capsule\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf all you want to do is pick up a capsule, then the current robotic parts are plenty. I tried to make something that could lift a half fueled Rockomax jumbo 64... it was... bendy.\n\u003C/p\u003E\n\u003Cp\u003E\nI could have stengthened it, but my design goal was fitting it in a mk3 cargobay:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u002275OVfyM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/75OVfyM.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022plFSMpP.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/plFSMpP.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022igz16Zu.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/igz16Zu.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nA recovery boat doesn\u0027t have the same restrictions\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-06-25T07:12:05Z\u0022 title=\u002206/25/2019 07:12  AM\u0022 data-short=\u00225 yr\u0022\u003EJune 25, 2019\u003C/time\u003E by KerikBalm\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RealKerbal3x","CreatedById":183830,"CreatedDateTime":"2019-06-25T15:46:33Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/173500-mister_spaceman/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022173500\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/173500-mister_spaceman/\u0022 rel=\u0022\u0022\u003E@Mister_Spaceman\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMy approach to \u0027Death To The Green Button\u0027 (maybe it should be a challenge \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\u003Cspan\u003E) uses airships from the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/150702-17x-heisenberg-airships-part-pack/\u0022 rel=\u0022\u0022\u003EHeisenberg\u003C/a\u003E mod, rather than boats, because airships are much faster and less hacky (no mucking about with buoyancy). I also use \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/142594-171-kerbal-attachment-system-kas-v14-not-compatible-with-ksp-170/\u0026amp;do=getNewComment\u0022 rel=\u0022\u0022\u003E\u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E\u003C/a\u003E winches to pick capsules from the sea, rather than the DLC robotics. Don\u0027t get me wrong, the robotics are awesome, but I don\u0027t use them partly because giant claws are a bit unnecessary when the largest thing you\u0027ll pick up is a Mk1-3 pod, and partly because the robotic\u0027s joint strength is pretty low, leading to some contraptions flopping about and Krakenising (tm).\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003EI\u0027ve only dabbled in building watercraft in KSP, but if that\u0027s what you want to do, good luck. As \u003Cspan\u003E\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91917-kerikbalm/\u0026amp;do=hovercard\u0022 data-mentionid=\u002291917\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/91917-kerikbalm/\u0022 rel=\u0022\u0022\u003E@KerikBalm\u003C/a\u003E said, the ore tanks are pretty much the only things that sink. If you want to get anywhere fast, I\u0027d recommend building your recovery vessel as a hydrofoil, something like this:\u003C/span\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan\u003E\u003Cspan\u003E \u003C/span\u003E\u003C/span\u003E\u003Cimg alt=\u0022Image result for hydrofoil\u0022 data-ratio=\u002256.20\u0022 width=\u0022790\u0022 src=\u0022https://cdni.rt.com/files/2017.10/article/59ec7d74fc7e93a36f8b4567.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThese are possible in KSP, it\u0027s just like a plane, but in the water. Just add a few wings under the hull near the front and if it\u0027s going fast enough the prow of the boat will lift out of the water.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Mister_Spaceman","CreatedById":173500,"CreatedDateTime":"2019-06-25T21:00:49Z","Content":"\n\u003Cp\u003E\nThese are all good points. I\u0027m already learning a bit about Kerbal watercraft. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E I\u0027m considering a either a hydrofoil design with hydrofoils that can fold back into the hull during recovery for hi-speed fun, or a screw-prop design for a challenge. What I\u0027m most unclear on is how to go about the hull. Do traditional \u0022Vee\u0022 hulls really work in KSP? Stock ships I\u0027ve seen tend to look like flat-bottom ships, but perhaps I haven\u0027t had a good enough look. From what I understand, MK-2 parts generate the most drag in water, and are thus the most ineffecient for water travel. Is this simply hearsay, ir is it best to build with MK1 and/or MK3 parts? The small radial ore tanks are the most dense ones, right?\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2019-06-25T23:04:03Z","Content":"\n\u003Cp\u003E\nI think the ore tanks all have approximately the same density/buoyancy.\n\u003C/p\u003E\n\u003Cp\u003E\nUnder almost all circumstances MK2 parts have the worst drag in both air and water, vs. their frontal area. MK3 parts are second worst, but if you want to make large craft for aesthetic reasons -- go with MK3. MK1 parts have the lowest drag, and will give you the best overall performance. Of course, if you just want more speed, simply add moar engines.\n\u003C/p\u003E\n"},{"CreatedByName":"Mister_Spaceman","CreatedById":173500,"CreatedDateTime":"2019-06-26T06:05:03Z","Content":"\n\u003Cp\u003E\nWell, unfortunately, I\u0027ve discovered that this form recovery is not an option. The game is far too laggy for anyhing seaborne. A testbed I\u0027d made with \u0026lt;30 parts had my game running at less than 10 FPS. \u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E Thanks for your help, folks. Perhaps it will come in handy when I save up enough for a decent computer. \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2019-06-26T06:36:18Z","Content":"\n\u003Cp\u003E\nParticle effects destroy framerate when moving on water. Those nice white splashes. You can adjust those in the settings. Why not give that a shot and try again?\n\u003C/p\u003E\n\u003Cp\u003E\nI have a decent computer and the game still chugs whenever something splashes into the water if I have particle effects tuned up to the max. Something SQUAD ought to address... when they get around to it.\n\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2019-06-26T09:05:22Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223625386\u0022 data-ipsquote-contentid=\u0022185813\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221561530978\u0022 data-ipsquote-userid=\u0022167629\u0022 data-ipsquote-username=\u0022Brikoleur\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Brikoleur said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nParticle effects destroy framerate when moving on water. Those nice white splashes. You can adjust those in the settings. Why not give that a shot and try again?\n\u003C/p\u003E\n\u003Cp\u003E\nI have a decent computer and the game still chugs whenever something splashes into the water if I have particle effects tuned up to the max. Something SQUAD ought to address... when they get around to it.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nYea, I found that my subs worked fine underwater, but when they were at the surface with the props splashing, the game slowed to a crawl. Oddly, I think it played smoother with scatterer.\n\u003C/p\u003E\n\u003Cp\u003E\nIf all you want is capsule recover, I\u0027d say fly there in a seaplane with a simple articulated claw on a telescoping hydraulic cylinder\n\u003C/p\u003E\n"},{"CreatedByName":"Aeroboi","CreatedById":186653,"CreatedDateTime":"2019-06-26T12:46:13Z","Content":"\n\u003Cp\u003E\nI\u0027d say go for Mk3 for the carrier with the crane. It isn\u0027t the most hydrodynamic, however it has very good crash tolerance of 50m/s and are larger bulky parts. If a crane is used you need some mass in order not to capsize. This means hitting the water or driving out of the water at speed wont ever destroy the vessel.\u003Cbr\u003E\nStage activated Vector engines are the best sinkable parts. That means a Vector that is staged sinks faster then one that isn\u0027t staged? What?? Yeah, what indeed \u003Cspan\u003E\u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E \u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nOut of all the ore tanks the radial one is the densest, so if you want as much heavier then water mass kg for kg you should use those. For submarines the SM-25 making history service module is the most hydrodynamic. It doesn\u0027t sink but you can stuff it full of Vectors or ore ballast. It also fits inside the Mk3 cargo bay. Best would be to emerge from the water inside a center mk3 cargo bay with a piston to tow it back into the cargo bay.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for engines, I\u0027d go with the Goliath. 2 reasons...\n\u003C/p\u003E\n\u003Cp\u003E\n1: It is the most efficient. People want to go very fast on water but the faster you want to go the more power you need exponentially so the less distance capable to travel. Building a high quality hydrofoil or small footprint catamaran will be most efficient when coupling with the Goliath. Best is to make a high quality prop for infinite action radius.\u003Cbr\u003E\n2: The other reason is that the Goliath is very buoyant. So if you place them slightly on top of the water it will help with floating and stability. It will slow down the vessel so only use them when peed is not your goal.\n\u003C/p\u003E\n"},{"CreatedByName":"Mister_Spaceman","CreatedById":173500,"CreatedDateTime":"2019-06-26T21:50:30Z","Content":"\n\u003Cp\u003E\nGood points. I didn\u0027t realize that the particle effects are so resource intensive. I\u0027ll try turning them down when I get home and see how that goes. Is there a way to only turn off specific particle effects, i.e. the splashes? What do you folks recommend for BG Rotor-powered propellers? I imagine that they\u0027re fairly simple, a few stacked rotors for maximum RPM, and slightly angled control surfaces? \n\u003C/p\u003E\n"}]}