{"TopicId":189279,"ForumId":16,"TopicTitle":"A probe that does not sink","CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2019-10-25T07:41:30Z","PageNum":1,"Articles":[{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2019-10-25T07:41:30Z","Content":"\n\u003Cp\u003E\nFor a simple flyby mission of a few nearby interplanetary destinations, I built an unmanned craft. It is supposed to return the probe core and attached science to Kerbin. Currently the re-entry stage has an Okto-2, a Z-200 battery, a small reaction wheel, a Mk16 parachute, and a size 0 heat shield. It is aerodynamically stable, which is good because I play with \u0022require signal for control\u0022 and \u0022plasma blackout\u0022 difficulty settings active.\n\u003C/p\u003E\n\u003Cp\u003E\nThe problem is, when it splashes down in the ocean, it sinks. This is a problem because I also have the \u0022part pressure limits\u0022 difficulty setting active, so the sinking probe gets crushed after less than a hundred meters of depth. I cannot recover the probe unless it either floats or rests on solid ground/ocean floor. Decoupling the heatshield does not help, the probe still sinks just the same.\n\u003C/p\u003E\n\u003Cp\u003E\nSince this will be coming back from interplanetary space with little to no remaining propulsion, I cannot control where it comes down. And I don\u0027t want to just roll the dice on a multi-year-long mission, only to lose it all after successfully returning to Kerbin.\n\u003C/p\u003E\n\u003Cp\u003E\nHow would you build a re-entry vehicle for a probe that a.) is aerodynamically stable, and b.) floats on water, and c.) returns science observations intact?\n\u003C/p\u003E\n"},{"CreatedByName":"VoidSquid","CreatedById":196199,"CreatedDateTime":"2019-10-25T07:53:49Z","Content":"\n\u003Cp\u003E\nYeah, I had that issue too, my two workarounds: either a bit more fuel for small last minute course corrections, or alternatively I added a MK-1 pod to keep the thingy floating, I prefer the 1st method.\n\u003C/p\u003E\n\u003Cp\u003E\nTo guesstimate when the probe might land, the Trajectories mod is pretty helpful.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-10-25T08:12:13Z\u0022 title=\u002210/25/2019 08:12  AM\u0022 data-short=\u00224 yr\u0022\u003EOctober 25, 2019\u003C/time\u003E by VoidSquid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xd the great","CreatedById":188222,"CreatedDateTime":"2019-10-25T11:24:58Z","Content":"\n\u003Cp\u003E\nI add an empty fuel tank/mk1 structure tube. Adding rear fins may help stability.\n\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2019-10-25T13:57:52Z","Content":"\n\u003Cp\u003E\nAfter deliberating, redesigning, and test flying quite a bit, I went with \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/188222-xd-the-great/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022188222\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/188222-xd-the-great/\u0022 rel=\u0022\u0022\u003E@Xd the great\u003C/a\u003E\u0027s solution: an empty mk0 liquid fuel tank. Managed to integrate it without losing passive stability, and the probe now floats in water. The added mass is quite small. Though admittedly, my probe looks a bit phallic now \u003Cspan\u003E\u003Cimg alt=\u0022:P\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 title=\u0022:P\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Klapaucius","CreatedById":181256,"CreatedDateTime":"2019-10-28T09:57:45Z","Content":"\n\u003Cp\u003E\nWow, I\u0027ve never seen this issue before. As someone who has built a few submarines in KSP, the challenge is getting things \u003Cu\u003E\u003Cstrong\u003E\u003Cem\u003Enot\u003C/em\u003E\u003C/strong\u003E\u003C/u\u003E to float.  \n\u003C/p\u003E\n"}]}