{"TopicId":189605,"ForumId":16,"TopicTitle":"Rover flipping?","CreatedByName":"Fenceingmadman","CreatedById":201226,"CreatedDateTime":"2019-11-06T14:16:51Z","PageNum":1,"Articles":[{"CreatedByName":"Fenceingmadman","CreatedById":201226,"CreatedDateTime":"2019-11-06T14:16:51Z","Content":"\n\u003Cp\u003E\nI built a rover powered by a panther engine but it is very unstable can anybody help me with that theres a video on my channel\n\u003C/p\u003E\n\u003Cp\u003E\nlink\n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 width=\u0022480\u0022 data-embed-src=\u0022https://www.youtube.com/embed/xrJODtHaRIA?feature=oembed\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2019-11-06T19:46:07Z","Content":"\n\u003Cp\u003E\nThe center of mass may be to high and you need to apply \u0022downforce\u0022 if you want it to stick to the ground. I did not check lately but there were components with a naturally offset center of mass so if they are still there you may be able to build a rover with an actual center of mass that is under the ground. \n\u003C/p\u003E\n\u003Cp\u003E\nHere in the pic there is an example of what I mean with \u0022downforce\u0022. Try experimenting with different angles of the deployed control surfaces. This is not a \u0022jet\u0022 rover but I hope you can get some hints.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022wSkHzYJ.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/wSkHzYJ.png\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI had a jet scientific rover but it was not exactly \u0022sporty\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AuMp4iM.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022576\u0022 width=\u00221024\u0022 src=\u0022https://i.imgur.com/AuMp4iM.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fierce Wolf","CreatedById":200019,"CreatedDateTime":"2019-11-07T13:07:38Z","Content":"\n\u003Cp\u003E\nRovers are infamous for being flippy, but here\u0027s is another component, too much raw power.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you want to go\u003Cem\u003E that fast\u003C/em\u003E with a rover put an engine pointing downwards to keep it on the ground\n\u003C/p\u003E\n"},{"CreatedByName":"Linkageless","CreatedById":201088,"CreatedDateTime":"2019-11-07T16:31:18Z","Content":"\n\u003Cp\u003E\nI wonder if larger rover wheels or landing gear would help. Irrespectively, any slight bump you hit at speed will still flip you.\n\u003C/p\u003E\n\u003Cp\u003E\nAs suggested, aerodynamic down force is the conventional solution, but I like Fierce Wolf\u0027s slightly more kerbal solution of a separate engine for downforce.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re feeling creative and have breaking ground or a robotics mod, you could have a variable pitch on your main engine to angle it up slightly. Be careful about the relationship between centre of thrust and centre of mass, and watch your centre of lift, especially if you have any components providing lift. A couple of fins either side of the engine nozzle might just help keep it straight, once you have downforce sorted out.\n\u003C/p\u003E\n"}]}