{"TopicId":18970,"ForumId":16,"TopicTitle":"Matching an elliptical orbit","CreatedByName":"Jeebs24","CreatedById":36727,"CreatedDateTime":"2012-09-10T06:06:17Z","PageNum":1,"Articles":[{"CreatedByName":"Jeebs24","CreatedById":36727,"CreatedDateTime":"2012-09-10T06:06:17Z","Content":"\n\u003Cp\u003EI\u0027m trying to accomplish a rescue mission. While trying to return to Kerbin from the Mun I ran out of fuel and the crew is now stuck in an elliptical orbit. I launched a rescue vessel but I just realized the apoapsis and the periapis will not match for a proper rendezvous. Here\u0027s what the orbits look like: \u003Ca href=\u0022http://i.imgur.com/12bSZl.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/12bSZl.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe smaller orbit is the rescue vessel.\u003C/p\u003E\u003Cp\u003EIf you\u0027re wondering how I ran of fuel. Well here\u0027s a tip of other KSP players; don\u0027t watch a movie and play KSP at the same time. You might get distracted and leave your throttle on for far too long.\u003C/p\u003E\n"},{"CreatedByName":"Anachronda","CreatedById":23187,"CreatedDateTime":"2012-09-10T06:38:16Z","Content":"\n\u003Cp\u003EGood luck. It\u0027s been a while since I\u0027ve attempted a rendezvous (not yet succeeded), but I\u0027ve found it\u0027s not terribly difficult to get a fairly close match to another elliptical orbit. I have succeeded in getting close enough that a more coordinated person than I could finish the job with RCS.\u003C/p\u003E\u003Cp\u003EThe big problem is that the game doesn\u0027t display the apiopsis and periopsis markers for the orbit you\u0027re trying to match, so you have to kind of eyeball it.\u003C/p\u003E\u003Cp\u003EYou can kind of roll the orbit around by burning perpendicular to the path of the orbit while traveling along the sides. There\u0027s no marker for that position, so you\u0027ll have to fiddle with it to get a feel for it. Say about the point on the right side of your picture where the orbits diverge.\u003C/p\u003E\u003Cp\u003EAnother approach I\u0027ve had success with is inflating the smaller orbit into the larger one. Doing a prograde burn about halfway through where the orbits are close will inflate the smaller orbit along about the direction of the larger orbit\u0027s major axis.\u003C/p\u003E\n"},{"CreatedByName":"Jeebs24","CreatedById":36727,"CreatedDateTime":"2012-09-10T09:10:47Z","Content":"\n\u003Cp\u003EOoohhh yeaaa!!!! I managed to match the apoapsis and periapsis and get within 6km.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/6ToIa.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/6ToIa.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EUsed the RCS thrusters to get closer, did your standard EVA and managed to rescue the stranded kerbonauts. \u003Ca href=\u0022http://i.imgur.com/nQ75b.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/nQ75b.png\u003C/a\u003E\u003C/p\u003E\n"}]}