{"TopicId":190587,"ForumId":16,"TopicTitle":"Interplanetary rendevous orbits and Oberth effect","CreatedByName":"VoidFoo","CreatedById":188573,"CreatedDateTime":"2019-12-23T22:24:18Z","PageNum":1,"Articles":[{"CreatedByName":"VoidFoo","CreatedById":188573,"CreatedDateTime":"2019-12-23T22:24:18Z","Content":"\n\u003Cp\u003E\nWhen choosing what orbit to start out with when doing a rendevous coming from interplanetary transfer, is it better to do a lower orbit or higher orbit than the target?\n\u003C/p\u003E\n\u003Cp\u003E\nFor example, I have a refueling station in circular orbit around Duna. I send a ship to Duna, and when arriving I burn retrograde to go into a circular orbit around Duna, but at a different altitude than the station. Then I can do an easy rendevous by dragging around a maneuver node until I get a close separation.\n\u003C/p\u003E\n\u003Cp\u003E\nSo is there a rule of thumb as to what starting orbit is more efficient, delta-v wise, when coming in from an interplanetary transfer orbit?\u003Cbr\u003E\n- If I go for a low orbit, I get good Oberth Effect, but it feels weird because I cross the target orbit to get into the lower orbit, then during rendevous go back up.\u003Cbr\u003E\n- If I go for a high orbit, it feels like I haven\u0027t \u0022wasted\u0022 anything because I don\u0027t cross the target orbit.\n\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2019-12-23T23:49:04Z","Content":"\n\u003Cp\u003E\nFor me, I want my incoming orbit\u0027s \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E to touch the station\u0027s orbit. I burn at that \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E to get an orbit around the planet/moon, then at \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E do the cheaper burn to align my orbit, then another burn back at \u003Cabbr title=\u0022Periapsis\u0022\u003EPe\u003C/abbr\u003E to get an encounter, and finally on the next orbit meet the station.\n\u003C/p\u003E\n\u003Cp\u003E\nOnce you have that basic set of steps down you can optimize, like setting up the meeting of the station on the same burn that you get your orbit. Or algning your orbit on entry to be as close to aligned with the station as possible.\n\u003C/p\u003E\n"},{"CreatedByName":"AHHans","CreatedById":197939,"CreatedDateTime":"2019-12-31T19:49:09Z","Content":"\n\u003Cp\u003E\n[*bleep* Apparently I closed the tab with my first answer without sending the answer. Maybe spending too much time in real-life planes and trains is affecting my brain...]\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223720418\u0022 data-ipsquote-contentid=\u0022190587\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221577139858\u0022 data-ipsquote-userid=\u0022188573\u0022 data-ipsquote-username=\u0022VoidFoo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 12/23/2019 at 11:24 PM, VoidFoo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nWhen choosing what orbit to start out with when doing a rendevous coming from interplanetary transfer, is it better to do a lower orbit or higher orbit than the target?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIf you think about it, then this is the same problem as boosting into an interplanetary transfer straight from a \u0022gateway orbit\u0022 or first lowering your PE and then boosting from there. (Just invert the time-axis, you are allowed to do that in Newtonian physics.) Someone(*) already looked into that, and the result is that it depends on how much speed (or energy) you\u0027ll need to shed: if you come from (or go to) far away (like from Jool to Kerbin or vice versa) then burning at a low PE is better, if it is just between Duna and Kerbin, then you\u0027ll loose more to adjusting your orbit after capture than you\u0027ll gain from burning at low PE.\n\u003C/p\u003E\n\u003Cp\u003E\n(*) The spreadsheet in here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/175831-standard-orbits-for-interplanetary-shuttles-fuel-stations/\u0026amp;do=findComment\u0026amp;comment=3400067\u0022 rel=\u0022\u0022\u003Ehttps://forum.kerbalspaceprogram.com/index.php?/topic/175831-standard-orbits-for-interplanetary-shuttles-fuel-stations/\u0026amp;do=findComment\u0026amp;comment=3400067\u003C/a\u003E\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222019-12-31T19:49:36Z\u0022 title=\u002212/31/2019 07:49  PM\u0022 data-short=\u00224 yr\u0022\u003EDecember 31, 2019\u003C/time\u003E by AHHans\u003C/strong\u003E\n\u003Cbr\u003Efixed typo\n\u003C/span\u003E\n"}]}