{"TopicId":190625,"ForumId":16,"TopicTitle":"Outpost Landing, What am I doing wrong?","CreatedByName":"Wulfonce1988","CreatedById":180757,"CreatedDateTime":"2019-12-26T06:00:15Z","PageNum":1,"Articles":[{"CreatedByName":"Wulfonce1988","CreatedById":180757,"CreatedDateTime":"2019-12-26T06:00:15Z","Content":"\n\u003Cp\u003E\nSo after 200 hours of playing ksp, I still can\u0027t seem to land an outpost on the moon.  I\u0027m basically building a horizontal \u0022hotdog looking\u0022 base complete with all the required components that sits on several landing struts along its length.  I have no problem getting it into orbit around the moon, however when I try to land it, the weight balance shifts as the fuel burns up, making it completely un-flyable after about 20 seconds.  I\u0027ve tried everything I can think of.  Keeping the fuel in the middle, keeping the fuel on the ends, keeping the engines in the middle/ends, adding a butt load (unit of measurement) of \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E thrusters all over the place, adding an excessive amount of stabilization wheels,   but nothing seems to work.  The balance is dead center before the decent but due to the different modules all over the base, the balance changes once the fuel starts to drop.  I even made a prototype, just using fuel tanks alone without the other modules, to try and make it stable.  It sort of worked but again, once the fuel gets to low it might as well be a flying brick.\n\u003C/p\u003E\n\u003Cp\u003E\nI feel like I\u0027m missing something obvious.  I see all these youtube videos of people landing horizontal bases, and at much higher speeds then what I\u0027m attempting to do.  They fly it in like Tom Cruise and set it down effortlessly... probably while drinking a beer with there other hand.  What am I doing wrong?\n\u003C/p\u003E\n"},{"CreatedByName":"TheFlyingKerman","CreatedById":182407,"CreatedDateTime":"2019-12-26T07:10:27Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223721098\u0022 data-ipsquote-contentid=\u0022190625\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221577340015\u0022 data-ipsquote-userid=\u0022180757\u0022 data-ipsquote-username=\u0022Wulfonce1988\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, Wulfonce1988 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nthe weight balance shifts as the fuel burns up\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is obviously the problem. Design your base so that the center of thrust aligns with the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E when empty. Then adjust fuel level in various tanks so that the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECOM\u003C/abbr\u003E remains along the same line.\n\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2019-12-26T15:40:46Z","Content":"\n\u003Cp\u003E\nThe easiest way IMO is to keep all your fuel near the middle (mass-wise) of your base, so that the center of mass does not shift as you burn fuel during landing. Here are some ways to do that:\n\u003C/p\u003E\n\u003Cp\u003E\n1) Design your base starting with fuel tank and engine as the center core, then build 2 or more \u0022wings\u0022 that extend sideways. All wings need to be similar masses.\n\u003C/p\u003E\n\u003Cp\u003E\n2) Design your base without any fuel or engine. Then find the center of mass indicator, place a docking port or decoupler just above or below, and add fuel and engines to that port. This is similar to a \u0022skycrane\u0022 concept.\n\u003C/p\u003E\n\u003Cp\u003E\n3) Build your horizontal base in a straight line, more like a rocket and have the engine aimed lengthwise. Land vertically on the engine, then use reaction wheels or \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E to tip over.\n\u003C/p\u003E\n"},{"CreatedByName":"Fierce Wolf","CreatedById":200019,"CreatedDateTime":"2019-12-26T17:29:27Z","Content":"\n\u003Cp\u003E\nWhat i did: Use 8 side mounted engines and a main engine on the back of the base module. Once the landing starts, turn off the main and on the side rockets. Adjust thrust limit on the one\u0027s that are pushing too hard and try to keep it even, you should have enough time to check which rockets need compensation. Sounds complicated but it\u0027s actually simple, becames routine after the second module of your base.\n\u003C/p\u003E\n"},{"CreatedByName":"Foxster","CreatedById":113764,"CreatedDateTime":"2019-12-27T09:00:42Z","Content":"\n\u003Cp\u003E\nI\u0027m guessing that even though you have an even distribution of fuel tanks they aren\u0027t being used evenly and so the \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E shifts. Check out the fuel priority setting for the tanks and make sure that it is set the same for symmetrically mounted tanks. \n\u003C/p\u003E\n"}]}