{"TopicId":191753,"ForumId":16,"TopicTitle":"Help newbie on space plane landing","CreatedByName":"Syczek","CreatedById":163803,"CreatedDateTime":"2020-02-18T17:05:54Z","PageNum":1,"Articles":[{"CreatedByName":"Syczek","CreatedById":163803,"CreatedDateTime":"2020-02-18T17:05:54Z","Content":"\n\u003Cp\u003E\nFor the starters i use \u003Cabbr title=\u0022Ferram Aerospace Research (mod)\u0022\u003EFAR\u003C/abbr\u003E and many aeroplane parts(my latest creation is hybrid of B9 aerospace,airplane plus engine and stock swept wings,and aero breaks).Everything goes fine till i decelerate to 200 m/s my plane starts to fly down in sharp curve and violent hit up into ground. What i am doing wrong??\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2020-02-18T19:46:34Z","Content":"\n\u003Cp\u003E\nPics of the plane would help diagnose the problem, but I suspect the craft either doesn\u0027t have enough lift for its weight and is stalling, or doesn\u0027t have enough control authority to keep the nose up. \n\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2020-02-18T22:25:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223743089\u0022 data-ipsquote-contentid=\u0022191753\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221582045554\u0022 data-ipsquote-userid=\u0022163803\u0022 data-ipsquote-username=\u0022Syczek\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Syczek said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n.Everything goes fine till i decelerate to 200 m/s\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThere are many possibilities and we need more info. Pictures of the plane will help. A craft file, too, but I think that\u0027s of limited us because someone will need all the same mods as you to test.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s your altitude when you reach 200 m/s (if high, you might be slowing down too much and stalling in thin air)? Does the craft fly well slower on takeoff (if yes, your center of mass might be shifting after burning fuel)? What\u0027s your angle of attack on descent: sharply nose up? Are you going into a flat spin, tail slide, or just dropping like a stone after 200 m/s?\n\u003C/p\u003E\n\u003Cp\u003E\nOne thing you can try is to lower your nose a bit near 200 m/s, maintain velocity, then start nosing up again near runway to bleed off speed. If your plane still stalls at 200 m/s at sea level, you need to add wing area, or shift parts around to keep center of mass ahead of center of lift.\n\u003C/p\u003E\n\u003Cp\u003E\nWhat\u0027s your takeoff speed? If you can\u0027t takeoff from the runway slower than 200 m/s you should probably add wings or adjust your center of balance and lift. Takeoff, cut your engines, and see how your craft glides.\n\u003C/p\u003E\n\u003Cp\u003E\nAs a last resort, if it\u0027s a wing area issue and you don\u0027t want more wings for whatever reason, come in very fast and trigger airbrakes, thrust reversers, chutes just before touchdown.\n\u003C/p\u003E\n"},{"CreatedByName":"Syczek","CreatedById":163803,"CreatedDateTime":"2020-02-19T16:34:53Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://imgur.com/a/NESX3XS\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://imgur.com/a/NESX3XS\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMine Space plane. Builded from mods B9 Aerospace(i use all of them aside procedural ones),Mk3 Expansion (Engine) and rest is Squad parts(aka stock one)\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://www104.zippyshare.com/v/VwUWZOia/file.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www104.zippyshare.com/v/VwUWZOia/file.html\u003C/a\u003E Craft file.\n\u003C/p\u003E\n\u003Cp\u003E\nProblems with landing as i said starts when i decelerate to lower than 200 m/s, Plane starts drop like stone when i lower trust and use brakes. Otherwise take off is smooth it requires 160 m/s to gain lift\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-02-19T16:41:02Z\u0022 title=\u002202/19/2020 04:41  PM\u0022 data-short=\u00224 yr\u0022\u003EFebruary 19, 2020\u003C/time\u003E by Syczek\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2020-02-19T22:54:26Z","Content":"\n\u003Cp\u003E\nYour center of mass is quite a distance ahead of the center of lift. I suspect that when you slow down, the control surfaces can no longer overcome the weight of the forward portion of the craft. Try shifting some of the wings farther forward. If you move the foremost wings especially, they will have more leverage. \n\u003C/p\u003E\n"}]}