{"TopicId":19450,"ForumId":16,"TopicTitle":"[HELP ME!] Minmus landing help!!","CreatedByName":"andreaslv99","CreatedById":50070,"CreatedDateTime":"2012-09-16T15:14:56Z","PageNum":1,"Articles":[{"CreatedByName":"andreaslv99","CreatedById":50070,"CreatedDateTime":"2012-09-16T15:14:56Z","Content":"\n\u003Cp\u003EI can not seem to get to Minmus at all! I would like an flight tutorial \u002B ship building tutorial posted! Im desperate to get to Minmus! I have accually landed there once, but i can\u0027t do it again! \u003C/p\u003E\u003Cp\u003E-andreaslv99\u003C/p\u003E\n"},{"CreatedByName":"Boex","CreatedById":19600,"CreatedDateTime":"2012-09-16T15:58:56Z","Content":"\n\u003Cp\u003EWhat sort of experience level are you? Do you know how to get into a circular orbit, or any orbital maneuvers?\u003C/p\u003E\u003Cp\u003EIt may be wiser to perfect Mun Transfers first, if you haven\u0027t done so yet, as it doesn\u0027t require an inclination change (it\u0027s orbit is equatorial, basically). Minmus is on a tilted orbit (it\u0027s inclined), so half way around, or when you reach it, you need to burn up or down to get there.\u003C/p\u003E\u003Cp\u003EIf you\u0027re confident in both of the above, here\u0027s a simple flight plan -\u003C/p\u003E\u003Cp\u003E - Now, you want to start off in a \u0027parking orbit\u0027 at about 80km. On the map view, search for Minmus. Time warp until it\u0027s on the horizon. Try not to overshoot.\u003C/p\u003E\u003Cp\u003E - You need to burn Prograde until your apoapsis reaches 46 400 000m. (Note - Prograde - In the direction of travel. The yellow circle. NOT the one with the cross through it -that\u0027s Retrograde, the opposite).\u003C/p\u003E\u003Cp\u003E - Half-way to apoapsis, you want to burn North or South, depending on which way Minmus is, until the Patched-Conics predicts an encounter.\u003C/p\u003E\u003Cp\u003E - Burn Retrograde when you reach your Periapsis, and you\u0027ll get into an orbit. Circularize, try to get over a lake, and you\u0027ll be good from there! TIP - Aim for the lakes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ESorry if this is either too advanced or too basic for you, it\u0027s difficult to know how practiced you are. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2012-09-16T17:56:39Z","Content":"\n\u003Cp\u003EMost ships that can land on Mun can also land on Minmus, because the amount of fuel required ends up being about the same. So you might not need to change your rocket at all. Aiming for Minmus is also like aiming for Mun, except that it fluctuates above and below the usual plane. Burn for the usual orbital intercept at Minmus\u0027 orbit distance, then look to see if you\u0027re going to pass above or below it. If so, turn 90 degrees up (if you\u0027re going too low) or down (if you\u0027re going too high), and burn until you get the intersect symbols. Then actually landing on Minmus is much easier than Mun because of the lower gravity. For video tutorials, there are some stickied at the top of the how-to forum section. \u003C/p\u003E\u003Cp\u003EThat\u0027s weird. When I submitted this there was no post above mine, but Boex\u0027s reply is time-stamped 2 hours ahead of mine. Some weird kind of retroactive-ninja-ing.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-16T22:26:41Z\u0022 title=\u002209/16/2012 10:26  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 16, 2012\u003C/time\u003E by Vanamonde\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Randox","CreatedById":18034,"CreatedDateTime":"2012-09-16T18:34:54Z","Content":"\n\u003Cp\u003EYeah, I gave that method a shot today in place of my normal convoluted seat of my pants method, and ended up with rediculous amounts of fuel left over. Compliments of the fuel bug, I was also able to land on the Mun on my way home. Going to try that with my Mun rocket next and see how it fares, since the version I used carried a significantly beefed up launching stage.\u003C/p\u003E\u003Cp\u003EI assume this would work from a higher orbit as well? I was a bit high anyway (and patched conics didn\u0027t show an intercept until I was about 75% of the way there, which was a bit disconcerting). 80km is a bit low for my liking unless I am working on a re-entry.\u003C/p\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2012-09-16T18:41:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Boex\u0022 data-cite=\u0022Boex\u0022\u003E\u003Cdiv\u003E.\u003Cp\u003E - Half-way to apoapsis, you want to burn North or South, depending on which way Minmus is, until the Patched-Conics predicts an encounter.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis! I\u0027ve been wanting to go to Minmus lately and I can\u0027t believe that burning halfway to Apoapsis never occurred to me. I know I am not the OP, but thanks for helping ME out XD. \u003C/p\u003E\u003Cp\u003ETo OP: Minmus is very small so you won\u0027t need a very lard descent and ascent stage.\u003C/p\u003E\n"}]}