{"TopicId":195733,"ForumId":16,"TopicTitle":"How do I Calculate Aircraft Range","CreatedByName":"Mars-Bound Hokie","CreatedById":192121,"CreatedDateTime":"2020-07-20T03:08:47Z","PageNum":1,"Articles":[{"CreatedByName":"Mars-Bound Hokie","CreatedById":192121,"CreatedDateTime":"2020-07-20T03:08:47Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003ENeed I say more?\u003C/span\u003E\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nMore below if the answer is \u0022yes.\u0022\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI bet lots of you are curious about how far your planes can go from their starting point when their tanks are full. However, I doubt all of you want to waste time just taking them out for test runs - one plane at a time. This thread is to finally know, once and for all, how to calculate your planes\u0027 range?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIn the spoiler below, you\u0027ll find \u003Cabbr title=\u0022SpacePlane Hangar\u0022\u003ESPH\u003C/abbr\u003E shots of a few of my aircraft - none of which are SSTOs. What bugs me is that the delta-V count for the engines don\u0027t really give a clue.\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nIf they are, then I obviously missed it. Could someone point that out, please?\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cdiv class=\u0022ipsSpoiler\u0022 data-ipsspoiler=\u0022\u0022\u003E\n\u003Cdiv class=\u0022ipsSpoiler_header\u0022\u003E\n\u003Cspan\u003ESpoiler\u003C/span\u003E\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsSpoiler_contents\u0022\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022Mp7T63E.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.20\u0022 height=\u0022639\u0022 width=\u00221137\u0022 src=\u0022https://i.imgur.com/Mp7T63E.png\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nSupersonic plane designed to take 20 people very high and fast.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022YMIrhpy.png\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002255.79\u0022 height=\u0022626\u0022 width=\u00221122\u0022 src=\u0022https://i.imgur.com/YMIrhpy.png\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nSupersonic one-man jet that can take me around Kerbin\u0027s full equator (with some fuel to spare) in less than an hour\n\u003Cul\u003E\u003Cli\u003E\nIt\u0027s what kicked off the \u0022Around Kerbin in 80 Minutes\u0022 challenge, which won me Thread of the Month for January 2020.\n\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022NU2K7G5.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.60\u0022 height=\u0022679\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/NU2K7G5.png?1\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nPretty impressive flight time for a small career-beginning plane.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp style=\u0022text-align:center;\u0022\u003E\nAll these planes are on my KerbalX\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI also noticed that the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/193782-trans-kerbin-airways-regional-jet-challenge-2-electric-boogaloo/\u0022 rel=\u0022\u0022\u003ERegional Jet Challenge\u003C/a\u003E had the range equation as the following. However, I don\u0027t know if it\u0027s accurate.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022hYDNKok.png?1\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002220.42\u0022 height=\u0022106\u0022 width=\u0022519\u0022 src=\u0022https://i.imgur.com/hYDNKok.png?1\u0022\u003E\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nSpeed in this equation is the given cruising speed at the recommended altitude.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nIs there any way to calculate the range of my aircraft without needing to download any mods? Thank you.\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2020-07-20T03:45:13Z","Content":"\n\u003Cp\u003E\nIt\u0027s not nearly that simple. So the answer really is \u0022no\u0022.\n\u003C/p\u003E\n\u003Cp\u003E\nA tiny difference in how you fly your plane can make the difference in whether you can\u0027t break the sound barrier, or whether your plane will reach mach 2. If your plane is flying fast, it can fly higher. Once you are at nearly max altitude, tiny tweaks in \u003Cabbr title=\u0022Angle of Attack\u0022\u003EAoA\u003C/abbr\u003E can get you hundreds more meters of altitude at a cost of a few m/s of speed. Or occasionally you can sacrifice a km of altitude to achieve an even higher top speed. Every single one of those actions will change your short-term average fuel burn rate by as much as 30% -- or even more.\n\u003C/p\u003E\n\u003Cp\u003E\nFlying a KSP plane to get maximum altitude and speed out of your design will almost always get you maximum range -- but actually doing it in practice is a bit of an art form.\n\u003C/p\u003E\n\u003Cp\u003E\nMax range is certainly not a simple formula. You can try plotting it out at various altitudes and speeds, and I think you will get a very interesting graph.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-07-20T03:46:00Z\u0022 title=\u002207/20/2020 03:46  AM\u0022 data-short=\u00223 yr\u0022\u003EJuly 20, 2020\u003C/time\u003E by bewing\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Joe Kerbal","CreatedById":204871,"CreatedDateTime":"2020-07-21T15:19:48Z","Content":"\n\u003Cp\u003E\nThat equation is basically correct. Point is to identify the speed (and altitude) to minimize fuel burn. You could simply decide to measure it yourself deciding a cruise altitude and speed and then sampling your fuel burn rate (checking how much fuel you spend in a minute). You can do that with half fuel load to have an average cost (it probably changes if you are fully loaded or with empty tanks)\n\u003C/p\u003E\n\u003Cp\u003E\nPlus I suggest you to check how much fuel you spend to gain cruise altitude and speed and subtract that amount from the fuel you use to calculate range available. Taking off and reaching cruise altitude can be an important part of your fuel cost (expecially in short range flight) \n\u003C/p\u003E\n"}]}