{"TopicId":196723,"ForumId":16,"TopicTitle":"REPEATED DATA COLLECTION AND TRANSMISSION","CreatedByName":"Jebediah Kerman\u0026#039;s Junkyard","CreatedById":207130,"CreatedDateTime":"2020-09-05T10:52:07Z","PageNum":1,"Articles":[{"CreatedByName":"Jebediah Kerman\u0026#039;s Junkyard","CreatedById":207130,"CreatedDateTime":"2020-09-05T10:52:07Z","Content":"\n\u003Cp\u003E\nI have seen a video in which it is possible to use the KAL-1000 controller to configure parts like engines too.. i have repeatedly tried doing it, but there is no such solution.\u003Cbr\u003E\nHere\u0027s the link to the video \u003Cspan\u003E: \u003Ca href=\u0022https://youtu.be/KCwXiWU1jwg\u0022 rel=\u0022external nofollow\u0022\u003ECLICK ON THIS LINK TO VIEW THE VIDEO\u003C/a\u003E\u003Cbr\u003E\nIt would be great if someone could help me figure out how to do it\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"Wobbly Av8r","CreatedById":206697,"CreatedDateTime":"2020-09-07T02:27:13Z","Content":"\n\u003Cp\u003E\nSo, build your rocket and include a KAL-1000 controller, go into the Actions window.\n\u003C/p\u003E\n\u003Cp\u003E\nIn the Action Groups column, select KAL-1000 controller, which places that heading in the Group Actions column.\n\u003C/p\u003E\n\u003Cp\u003E\nNow select the engine (highlights in blue), this will add options to the Selection column, and you will select \u0026lt;Thrust Limiter, which will place that option in the Group Actions column.\n\u003C/p\u003E\n\u003Cp\u003E\nYou can leave the Actions window and go back to construction, open the \u003Cabbr title=\u0022Part Action Window\u0022\u003EPAW\u003C/abbr\u003E for the KAL-1000 and click \u0022Open Editor\u0022, which opens the editor window.\n\u003C/p\u003E\n\u003Cp\u003E\nFirst click on the name of your engine so that that part\u0027s window is active, place cursor over the far right dot, click and drag it to the top. There is an empty circle next to it after you do this.\n\u003C/p\u003E\n\u003Cp\u003E\nNow click in that open circle and drag up and outside the entire editor window - the transition to that point is now well above the normal limit and the left dot should show the line connecting the two points that was previously horizontal into a steeply climbing or vertical line. Close the editor.\n\u003C/p\u003E\n\u003Cp\u003E\nMake sure you activate cheats infinite propellant and indestructible (heat, joints, etc.). Open KAL-1000 \u003Cabbr title=\u0022Part Action Window\u0022\u003EPAW\u003C/abbr\u003E and hit play so that it plays a few seconds, then hit pause. It\u0027s primed for thrust limit to be something above the norm... hit Z, [space bar] and enjoy.\n\u003C/p\u003E\n\u003Cp\u003E\nNote: the video claims it is unlimited upwards (maybe) but if your values are too high, my experience was that the vessel will NOT stay intact... so you may want to find some happy medium.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n"}]}