{"TopicId":196920,"ForumId":16,"TopicTitle":"Fuel base","CreatedByName":"GlaciacUtopiian","CreatedById":207272,"CreatedDateTime":"2020-09-15T17:58:04Z","PageNum":1,"Articles":[{"CreatedByName":"GlaciacUtopiian","CreatedById":207272,"CreatedDateTime":"2020-09-15T17:58:04Z","Content":"\n\u003Cp\u003E\nThinking of making a stock refuelling base on the Mun. How would i go about doing that, and how would i make docking easy \u002B transferring fuel, power and other things between craft? I might also make a space station orbiting the Mun, but i don\u0027t know if that would be useful. I\u0027m looking for a docking system that is only using the Jr or regular docking ports, or bigger if they exist, to fuel any size of craft, rover, etc. And then i\u0027ll move to other planets \u003Cimg alt=\u0022:)\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 title=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geonovast","CreatedById":179753,"CreatedDateTime":"2020-09-15T18:58:18Z","Content":"\n\u003Cp\u003E\nMoved to Gameplay Questions.\n\u003C/p\u003E\n"},{"CreatedByName":"Stamp20","CreatedById":202020,"CreatedDateTime":"2020-09-15T20:29:56Z","Content":"\n\u003Cp\u003E\nTo make a refueling base, you need a drill, an \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E converter, cooling, fuel tanks, docking ports, and optionally, space for Kerbals. There are three docking port sizes, the Jr which is 0.625m in diameter, the standard port which is 1.25m, and the senior port which is 2.5m. For reference, the top of a Mk1 pod is 0.625m, the bottom is 1.25m, and all Rockomax tanks are 2.5m.\n\u003C/p\u003E\n\u003Cp\u003E\nFor the base, you can build a \u002B shaped design, with one side being \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, the second being drills, third fuel, and fourth docking ports. You can then put solar panels on top to provide power.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you have Breaking Ground, you can do this for the docking ports:\u003Cbr\u003E\nFor horizontally-docking craft like rovers, place a piston facing down and put a docking port on the end, then rotate it to face outwards and move it so it isn\u0027t clipping. Move the piston so that the docking port can move up and down depending on what vehicle is trying to dock.\u003Cbr\u003E\nFor vertical craft, like rockets, place some docking ports facing upwards on the base and on the craft, a docking port of the same size on the bottom of the craft. Alternatively, you can put the port on the side and dock to the horizontal ports.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you don\u0027t have Breaking Ground, include enough \u003Cabbr title=\u0022Reaction Control System\u0022\u003ERCS\u003C/abbr\u003E or engines on all of your craft to reach the docking ports.\n\u003C/p\u003E\n"},{"CreatedByName":"Grogs","CreatedById":195516,"CreatedDateTime":"2020-09-15T20:41:58Z","Content":"\n\u003Cp\u003E\nI use a rover design with \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E, drills, and a claw on front for my refueling. With the claw, I don\u0027t have to worry about lining up docking ports.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022K7tTS3q.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002256.25\u0022 height=\u0022675\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/K7tTS3q.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2020-09-15T22:07:39Z","Content":"\n\u003Cp\u003E\nI have a standard fuel tank, driven by a standard starship drive section:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022DAg6AVG.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002280.00\u0022 height=\u0022960\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/DAg6AVG.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nIt refuels by sitting on top of the miner:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022ovGc7Hv.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u002280.00\u0022 height=\u0022960\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/ovGc7Hv.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve since redesigned the tanker to survive deep aerobraking into \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E from Minmus. Which means it can also do Vall to Laythe.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-09-15T22:08:02Z\u0022 title=\u002209/15/2020 10:08  PM\u0022 data-short=\u00223 yr\u0022\u003ESeptember 15, 2020\u003C/time\u003E by FleshJeb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Spricigo","CreatedById":166502,"CreatedDateTime":"2020-09-15T22:28:06Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223854786\u0022 data-ipsquote-contentid=\u0022196920\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221600192684\u0022 data-ipsquote-userid=\u0022207272\u0022 data-ipsquote-username=\u0022GlaciacUtopiian\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, GlaciacUtopiian said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nThinking of making a stock refuelling base on the Mun\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHave you considered Minmus instead? It have a lower gravity and is a lot easier to find flat terrain there.\n\u003C/p\u003E\n\u003Cp\u003E\nAnyways, you can prevent some issues if build things horizontally and don\u0027t let your base resting on anything with springs or hinges. \n\u003C/p\u003E\n\u003Cp\u003E\nThere is a few mods that allow you transfer resources without docking, for stock (as you asked) is either the Grabbing Units or Docking ports. Personally, I\u0027d go with docking ports facing downward/upward similarly to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111640\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0022 rel=\u0022\u0022\u003E@FleshJeb\u003C/a\u003E design, however I prefer the transport to have the wheels.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2020-09-16T10:39:47Z","Content":"\n\u003Cp\u003E\ni recomment using large tanks. your refueling trips will become a big nuisance if they require 20 trips each time. using refueling extensively, i ended up loading the convert-o-tron and drills directly on a ship that goes up and down from the planet. it\u0027s less efficient because you have to drag along the weight of those mining equipment, but it\u0027s much faster in-game, because you don\u0027t have to drive a rover from the base to the lander all the time.\n\u003C/p\u003E\n\u003Cp\u003E\nwhether you end up doing that or you make a full mun base, i have a few more recomendations\n\u003C/p\u003E\n\u003Cp\u003E\n- make your lander with a large base. it will be easier to land, which you will want to do often\n\u003C/p\u003E\n\u003Cp\u003E\n- make your lander with lots of reaction wheels, and possibly a good \u003Cabbr title=\u0022Reaction Control System\u0022\u003Ercs\u003C/abbr\u003E system. you will have to dock often, so you want to make it manueverable for easy docking. for the same reason, put your docking port somewhere easy to reach.\n\u003C/p\u003E\n\u003Cp\u003E\n- once you are around mun or (worse) minmus, oberth effect will be unfavorable. i discovered that to make big burns, it is often less convenient to launch from there, even if you save 900 m/s to get out of kerbin\u0027s gravity well. there are ways around that, of course, my favourite one is to launch back towards kerbin and get a gravity assist from it, though it requires to time well the manuever. anyway, you have to take that into account. you also can launch a very big fuel tank (mine has a 600 ton capacity) that you refuel around mun or minmus, then you bring it back to kerbin orbit to refuel stuff there. you only have to refill it once in a while.\n\u003C/p\u003E\n\u003Cp\u003E\n- put an expert engineer with the mining equipment. it\u0027s not strictly necessary, but even a level 0 engineer will quintuplicate the yield over no engineer at all.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nmy standard refueler has 1 convert-o-tron in the middle and 4 rockomax 18 ton around it. it is very easy to land and manuever. i used a single wolfhound engine with a \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E around 0.5, which is good for working on mun. i also made a larger version that holds 300 tons and have 5 wolfhounds (with 4 convert-o-trons and 12 drills), but that one is significantly harder to land because it grew in height more than in diameter; i made it to refuel my 600-ton orbital tank in a reasonable time.\n\u003C/p\u003E\n\u003Cp\u003E\ni also have a few space stations that double as fuel depots, but most times i refuel directly from the mining ship.\n\u003C/p\u003E\n"},{"CreatedByName":"EveMaster","CreatedById":199588,"CreatedDateTime":"2020-09-16T10:56:19Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223854933\u0022 data-ipsquote-contentid=\u0022196920\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221600208886\u0022 data-ipsquote-userid=\u0022166502\u0022 data-ipsquote-username=\u0022Spricigo\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n12 hours ago, Spricigo said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nHave you considered Minmus instead? It have a lower gravity and is a lot easier to find flat terrain there.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is a good idea. Minmus has some inclination but is also easy to reach if you do the burn from low Kerbin orbit at the ascending or descending node. If you would arrive early just do the transfer burn some orbits later. You don\u0027t have to match the inclination that way and changing the inclination high up at Minmus orbit is cheap.\n\u003C/p\u003E\n\u003Cp\u003E\nYou don\u0027t have to do precision landing and docking on the surface, two alternatives are:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nFerry ore from the surface to a converter in orbit. Advantage: No need to carry \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E-converter up and down.\n\u003C/li\u003E\n\u003Cli\u003E\nHave full mining equipment on the lander. Advantage: If you run short on fuel you can use your payload on the way back into orbit.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nIf you decide to ferry ore to a converter in orbit it is important that you use the the large converter. The large converter can create much more fuel out of the same amount of ore.\n\u003C/p\u003E\n\u003Cp\u003E\nThe large drill has the advantage that it also works with low ore concentrations in addion to being faster.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-09-16T10:57:03Z\u0022 title=\u002209/16/2020 10:57  AM\u0022 data-short=\u00223 yr\u0022\u003ESeptember 16, 2020\u003C/time\u003E by EveMaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dr. Kerbal","CreatedById":207217,"CreatedDateTime":"2020-09-16T22:43:22Z","Content":"\n\u003Cp\u003E\nMake a small base on the mun with a con to torn ore tanks and a fuel tanks. Make sure to have radiators and solar panels.\n\u003C/p\u003E\n"}]}