{"TopicId":197151,"ForumId":16,"TopicTitle":"Minmus orbit and night time","CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2020-09-27T08:29:12Z","PageNum":1,"Articles":[{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2020-09-27T08:29:12Z","Content":"\n\u003Cp\u003E\nIt\u0027s been a very good while since I last played KSP and most of the maths needs a good brushing up. Here\u0027s the thing, I\u0027m planning my Minmus comms network (using Remote Tech and SCANSAT) and I need to work out the time these satellites will spend in the dark. For this one, I\u0027m sending a scanning sat to Minmus on a 70km circular orbit.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nI did punch in the numbers but the result I got just seems off. I got a little under 18 minutes in darkness at 70km. I barely remember Minmus and orbital periods now but 18 minutes sounds too low. I was expecting (don\u0027t know why really) more around 30-45 minutes but I did the calculations twice and I got the same result, just short of 18 minutes. Can this be right or did I mess up somewhere?\n\u003C/p\u003E\n"},{"CreatedByName":"VoidSquid","CreatedById":196199,"CreatedDateTime":"2020-09-27T08:54:29Z","Content":"\n\u003Cp\u003E\nThis mod can calculate the times for you:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u002283952\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed575871555\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/186207-110x-dynamic-battery-storage-electricalthermal-planning-and-timewarp-compensation-sept-1/\u0026amp;do=embed\u0022 style=\u0022height:211px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2020-09-27T09:03:50Z","Content":"\n\u003Cp\u003E\nThat sounds about right to me. While an orbit of Minmus at 70km might take a little over an hour and half of that orbit will be over the night side of Minmus‘ surface (or any planet/moon), the time that the orbiting spacecraft is in Minmus’ shadow is quite a bit less than half of an orbit. Minmus casts a conical shadow pointing directly away from the sun: on the surface this means that sunlight and shadow are approximately equal but in space the extra altitude means that there’s a longer arc before you enter the shadow on both sides of the orbit, reducing the time that the vessel is in shadow; with an inclined orbit- which you’ll be using for SCANsat scanning- that number comes down even more as depending on the positions of Minmus and Kerbin you can have times where the shadow is perpendicular to your orbit so the vessel is in constant sunlight.\n\u003C/p\u003E\n\u003Cp\u003E\nI would try to draw a diagram, but I’m not on my PC and it would probably be terrible anyway.\n\u003C/p\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2020-09-27T09:04:16Z","Content":"\n\u003Cp\u003E\nThanks for the heads-up on that mod. Appreciated. I would like though, to know if my maths is in worse shape than I think. I depend too much on doing calculations \u0022by hand\u0022, it\u0027s part of the fun in playing KSP. It is no fun however, to get wrong results due to not getting the maths right.\n\u003C/p\u003E\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223860166\u0022 data-ipsquote-contentid=\u0022197151\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221601197430\u0022 data-ipsquote-userid=\u0022199902\u0022 data-ipsquote-username=\u0022jimmymcgoochie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nJust now, jimmymcgoochie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n[entire post]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThanks heaps! It has been a long time like I said but in my faulty memory, orbiting Minmus took forever and a half even at low altitude! I guess I need to be more optimistic then \u003Cspan\u003E\u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n"},{"CreatedByName":"bewing","CreatedById":154251,"CreatedDateTime":"2020-09-27T12:23:44Z","Content":"\n\u003Cp\u003E\nYeah, the diameter of Minmus is 120km. I don\u0027t remember what the orbital speed at 70km altitude is, but I\u0027m sure it\u0027s over 100m/s. So divide, and that\u0027s 1200 seconds. Or 20 minutes. So your calculation is fine.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2020-09-28T14:52:38Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223860159\u0022 data-ipsquote-contentid=\u0022197151\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221601195352\u0022 data-ipsquote-userid=\u0022140595\u0022 data-ipsquote-username=\u0022LN400\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 9/27/2020 at 4:29 AM, LN400 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI did punch in the numbers but the result I got just seems off. I got a little under 18 minutes in darkness at 70km. I barely remember Minmus and orbital periods now but 18 minutes sounds too low. I was expecting (don\u0027t know why really) more around 30-45 minutes but I did the calculations twice and I got the same result, just short of 18 minutes. Can this be right or did I mess up somewhere?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLet\u0027s go through it step by step.  There are certain assumptions and simplifications that we can (and should!) apply to this problem, but the overall result will still be close enough to correct.  First, however, since your issue is more about your assumed expectations, let\u0027s look at the problem more abstractly and see what insights we get from it to correct your intuition.\n\u003C/p\u003E\n\u003Cp\u003E\nFor one thing, your orbit radius is a bit over twice Minmus\u0027s radius (remember that an altitude of 70,000 metres is actually 130,000 metres from Minmus\u0027s centre).  In terms of the abstraction, let\u0027s call it exactly twice and work from that.\n\u003C/p\u003E\n\u003Cp\u003E\nIf Minmus is at half of the orbital radius, what then?  If we assume that the orbit is a unit circle, that the sun shines from the left side of the graph, and that Minmus\u0027s shadow is a cylinder (projected to be a rectangle--the point is that it does not taper), then Minmus\u0027s bulk will cover the right side of the orbit to half of the orbit\u0027s maximum height above the x-axis.  Thus, we want the angle that leads to a point y = .5 on the unit circle.   We can solve that with trigonometry:  arcsin (.5 / 1) = 30°.  Of course, Minmus covers a portion of the shadow below the x-axis, too, so we need to double the angle.  The total included angle is therefore 60°.\n\u003C/p\u003E\n\u003Cp\u003E\nWe can get that value another way, courtesy of our abstraction:  if the orbit is twice Minmus\u0027s radius, then the size of the shadow, which itself is twice Minmus\u0027s radius, will equal the orbit radius.  Since the distance from the origin to the edge of the shaded part of the orbit is going to be one orbit radius for both the upper and lower edges of the shadow, it altogether makes an equilateral triangle, so the included angle is definitely 60°.  Since your actual orbit is slightly larger than double Minmus\u0027s radius, we can safely expect that the true included angle will be near to but less than this value.\n\u003C/p\u003E\n\u003Cp\u003E\nIn terms of the fractional coverage of the larger orbit, 60° is one sixth of the total orbit, and of course the total is the full circle at 360°.  If you expect a darkness time of 30 - 45 minutes, then you expect an orbital period of 180 - 270 minutes, or 3 to 4.5 hours (actually slightly more).  If you find your orbital period in KSP, you\u0027ll see right away that that does not make sense.  The reasons why are less intuitive, but it\u0027s simple enough to check.\n\u003C/p\u003E\n\u003Cp\u003E\nOrbital period is better to use, but your orbital speed is the first parameter that KSP displays, so let\u0027s work with that, instead.  I\u0027ll show the calculation later, but for now let\u0027s assume that it is at or very near to 116.5 m/s.  The circumference of a 130,000-metre circular orbit is 816,814 metres, so going around that orbit at that rate gives a period of 116.85 minutes.  Thirty minutes of darkness is a little more than one quarter of that orbit.  Forty-five minutes is closer to forty percent--and that should immediately feel absurd, because fifty percent coverage is what you get \u003Cem\u003Eat the surface\u003C/em\u003E.  Forty percent coverage requires you to be so close to surface altitude that to achieve it should have you crashing into the mountaintops.  One sixth of the orbit gives about 19.5 minutes, but again, we\u0027ve already shown that the actual value will be somewhat less than that.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nNow to the more precise calculations:\n\u003C/p\u003E\n\u003Cp\u003E\nMinmus has a standard gravitational parameter, μ, of 1.7658 x 10\u003Csup\u003E9\u003C/sup\u003E m\u003Csup\u003E3\u003C/sup\u003E/s\u003Csup\u003E2\u003C/sup\u003E and a radius, r, of 60,000 metres.  A circular orbit at 70,000 m altitude has a semimajor axis, a, of 130,000 metres, which is equal to the orbital radius at all points on the orbit.  This orbit thus has an orbital speed, v, of:\n\u003C/p\u003E\n\u003Cp\u003E\nv = √(μ / a)\u003Cbr\u003E\nv = √(1.7658 x 10\u003Csup\u003E9\u003C/sup\u003E / 130000)\u003Cbr\u003E\nv = √(13583.1)\u003Cbr\u003E\nv = 116.5 m/s\n\u003C/p\u003E\n\u003Cp\u003E\nMinmus\u0027s shadow cone technically ought to vary in length over the course of its orbit about Kerbin.  Since neither Minmus\u0027s orbit nor Kerbin\u0027s have any eccentricity, the constraints on the variation, and thus also the variation in taper angle, should be relatively easy to determine.  However, for one thing, this orbit is close enough to Minmus that approximating Minmus\u0027s shadow as a cylinder with no taper will work more than adequately (it will slightly overestimate the darkness time, but not by a lot), and for another thing, I don\u0027t know how faithful KSP is to the realities of physics in this case.  I would like to assume that it is accurate but I have neither tested it nor seen anyone else do so.\n\u003C/p\u003E\n\u003Cp\u003E\nUnder these assumptions, the included angle of the shadowed arc of the orbit, θ, is given by twice the arcsine of the body radius, r, divided by the orbital radius, R:\n\u003C/p\u003E\n\u003Cp\u003E\nθ = 2 * arcsin (r / R)\u003Cbr\u003E\nθ = 2 * arcsin (60000 / 130000)\u003Cbr\u003E\nθ = 2 * .479729 rad\u003Cbr\u003E\nθ = .95946 rad or 54.97°\n\u003C/p\u003E\n\u003Cp\u003E\nThe arc length of the shadowed portion of the orbit, l, is given by the included angle multiplied by the orbital radius:\n\u003C/p\u003E\n\u003Cp\u003E\nl = R * θ\u003Cbr\u003E\nl = 130000 * .95946\u003Cbr\u003E\nl = 124,729.4 m\n\u003C/p\u003E\n\u003Cp\u003E\nAt the previously-calculated (constant) rate of speed, your vessel will cover this length in time t:\n\u003C/p\u003E\n\u003Cp\u003E\nt = l / v\u003Cbr\u003E\nt = 124729.4 / 116.5\u003Cbr\u003E\nt = 1070.6 seconds\u003Cbr\u003E\nt = 17.84 minutes\n\u003C/p\u003E\n\u003Cp\u003E\nYour calculations are correct.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222020-09-28T14:56:30Z\u0022 title=\u002209/28/2020 02:56  PM\u0022 data-short=\u00223 yr\u0022\u003ESeptember 28, 2020\u003C/time\u003E by Zhetaan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LN400","CreatedById":140595,"CreatedDateTime":"2020-09-28T20:49:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223860669\u0022 data-ipsquote-contentid=\u0022197151\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221601304758\u0022 data-ipsquote-userid=\u0022125721\u0022 data-ipsquote-username=\u0022Zhetaan\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n5 hours ago, Zhetaan said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n[entire post]\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThat is one thorough post. Thank you a couple of bunches! With my trusty calculator out of commision for the time being, I rely on notepad and Wolfram Alpha but that combo is not the most expedient or practical there ever was and I was afraid I had made some silly errors along the way.\n\u003C/p\u003E\n"}]}