{"TopicId":201977,"ForumId":16,"TopicTitle":"Do Relay Satellites Need Power to Relay Science ?","CreatedByName":"Gavin786","CreatedById":196260,"CreatedDateTime":"2021-04-25T06:04:05Z","PageNum":1,"Articles":[{"CreatedByName":"Gavin786","CreatedById":196260,"CreatedDateTime":"2021-04-25T06:04:05Z","Content":"\n\u003Cp\u003E\nContext: I am building a network of relay satellites and want to know the criteria for how they relay science.  I have looked for an answer to this question on forums and google for some time now but to no avail. \n\u003C/p\u003E\n\u003Cp\u003E\nQuestion: Let us assume I have a relay network, starting at KSP Tracking Station T, going through relay satellites A and B, with a final ship C.  Let us assume also that T-A-B-C is the only communications pathway for C to transmit to T.\n\u003C/p\u003E\n\u003Cp\u003E\nT-----A-----B------C\n\u003C/p\u003E\n\u003Cp\u003E\nNow C wishes to transmit say 80 mits of data to T.  It has enough electricity on board to comfortably do this.\n\u003C/p\u003E\n\u003Cp\u003E\nMy question is about A and B.  Do they also need to have sufficient power to transmit these 80 mits?   How are they factored into the data transmission, is the fact that they have sufficient signal strength to relay enough, or does each have to re-transmit those 80 mits? \n\u003C/p\u003E\n\u003Cp\u003E\nThank you to any who chooses to answer my question.\n\u003C/p\u003E\n\u003Cp\u003E\n- Gavin786\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-04-25T07:00:54Z","Content":"\n\u003Cp\u003E\nNo, you don’t need to worry about powering the relays and the transmission speed of their relay dishes isn’t a factor either (some mods change this, but stock KSP doesn’t care). I think the only thing that matters is signal strength as reduced signal means less science from your transmissions, but I don’t know if that’s actually true or not.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-04-25T07:02:53Z\u0022 title=\u002204/25/2021 07:02  AM\u0022 data-short=\u00223 yr\u0022\u003EApril 25, 2021\u003C/time\u003E by jimmymcgoochie\u003C/strong\u003E\n\u003C/span\u003E\n"}]}