{"TopicId":20375,"ForumId":16,"TopicTitle":"how to get the camera to focus on another stage?","CreatedByName":"mattig89ch","CreatedById":33288,"CreatedDateTime":"2012-09-25T22:37:38Z","PageNum":1,"Articles":[{"CreatedByName":"mattig89ch","CreatedById":33288,"CreatedDateTime":"2012-09-25T22:37:38Z","Content":"\n\u003Cp\u003Ehey all, I was watching this guy on youtube called scott manley. and he was launching unmanned ships into orbit. I wanted to try something similar, but I can\u0027t figure out how to get the camera to focus on the rocket once launched. it gets a few k away and disappears.\u003C/p\u003E\u003Cp\u003Eis there a default control to switch between camera focuses? or is there a mod?\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-09-25T22:39:33Z","Content":"\n\u003Cp\u003EHit the [ and ] keys to switch between ships and debris in the local area.\u003C/p\u003E\n"},{"CreatedByName":"Aphox","CreatedById":32691,"CreatedDateTime":"2012-09-25T22:49:02Z","Content":"\n\u003Cp\u003EThis hasn\u0027t worked for me since .15, but you used to be able to put a MechJeb on any part of the craft and control it when there was nobody in it. With the addition of EVA, you can\u0027t control a part that doesn\u0027t have a manned command pod attached to it, so I have no idea if you can still do this or not.\u003C/p\u003E\u003Cp\u003EAnd yeah use the square bracket keys to switch between different parts/kerbals on EVA/whatever. Don\u0027t know if it still lets you switch to debris parts though.\u003C/p\u003E\n"},{"CreatedByName":"mattig89ch","CreatedById":33288,"CreatedDateTime":"2012-09-27T17:47:16Z","Content":"\n\u003Cp\u003Eha! it worked, awesome. thanks all\u003C/p\u003E\n"},{"CreatedByName":"John F. Kerman","CreatedById":40209,"CreatedDateTime":"2012-09-27T18:36:26Z","Content":"\n\u003Cp\u003EYou could also try the RemoteTech mod. (if/when it\u0027s updated for 0.17 that is)\u003C/p\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2012-09-27T19:27:24Z","Content":"\n\u003Cp\u003EAdditionally, you can go to map mode (not tracking station) and double click any piece of debris.\u003C/p\u003E\u003Cp\u003EAs for mechjeb, you can control the main ship unmanned, and I\u0027ve put up plenty of satellites with unmanned modules, however last time I tried attaching mechjeb to a stage and releasing it didn\u0027t allow me to control the debris. The controls didn\u0027t work and the game became... unresponsive, in a manner. That is, although I could press esc. and click end flight, it would ask me to confirm and I\u0027d confirm, but nothing would happen. The only way for me to leave the debris was to close the game window and restart it. This was in 1.6. I\u0027m not sure if it\u0027s just a problem that I have or what.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2012-09-27T20:23:46Z","Content":"\n\u003Cp\u003EMechJeb has little \u0022external control\u0022 modules or something. Slap one on the side of the stage you\u0027d like to control. It counds as a command \u0027pod\u0027 AFAIK.\u003C/p\u003E\u003Cp\u003ELooks like a little radio. They have one you can use as a part of the stack, too.\u003C/p\u003E\n"}]}