{"TopicId":203986,"ForumId":16,"TopicTitle":"Fly back boosters.","CreatedByName":"Cloakedwand72","CreatedById":38144,"CreatedDateTime":"2021-07-24T20:32:51Z","PageNum":1,"Articles":[{"CreatedByName":"Cloakedwand72","CreatedById":38144,"CreatedDateTime":"2021-07-24T20:32:51Z","Content":"\n\u003Cp\u003E\nHow do you go about making winged fly back boosters? I know how to make SpaceX style first stages and want something new to try to do. That would be a cool challenge.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2021-07-25T02:10:52Z","Content":"\n\u003Cp\u003E\nI don\u0027t know how new you are to the game, but in case you don\u0027t know the boosters will be eliminated after a few kilometers unless you use mods for them. \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-07-25T07:24:30Z","Content":"\n\u003Cp\u003E\nYou’ll probably need FMRS to attempt this- it’s possible in stock KSP, but you need to launch the payload high and fast enough that it doesn’t fall back into the atmosphere while you land the booster again, then switch to the payload and continue. FMRS can effectively rewind time so you can fly the payload up and then fix the booster afterwards; at least that’s what it said on the mod page, I haven’t ever used it myself.\n\u003C/p\u003E\n\u003Cp\u003E\nYou could also try Stage Recovery which can simulate powered landings instead of actually flying them and also catches stages with parachutes. Just throw the booster back in the general vicinity of \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E and it’ll catch it once it reaches the ~25km zone where the game deletes stuff and do the recovery bit while you keep going with the payload.\n\u003C/p\u003E\n"},{"CreatedByName":"Space Kerbalisation Tech","CreatedById":211297,"CreatedDateTime":"2021-07-25T09:22:18Z","Content":"\n\u003Cp\u003E\nA great mod is the kerbal reusability expansion which adds energia2/bikal style deployable wings for fly back boosters.  FMRS is also needed (see posts above). \n\u003C/p\u003E\n"},{"CreatedByName":"Blaarkies","CreatedById":153700,"CreatedDateTime":"2021-07-25T12:16:47Z","Content":"\n\u003Cp\u003E\nI have been wondering about using a launch pad to the west, maybe the desert runway? (you\u0027ll need the DLC for this, but one of the Easter egg launch sites could work in a similar fashion)\u003Cbr\u003E\u003Cbr\u003E\nLaunching east from there, could place the first stage\u0027s trajectory right over the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E before reaching orbit, giving enough time to switch to the payload and insert that into orbit, then switch back to the first stage and let that \u0022re-enter\u0022 and fly in the atmosphere however you want.\u003Cbr\u003E\u003Cbr\u003E\nYou\u0027ll need to stretch what can be considered a \u0022booster\u0022 at this point, it will be close to itself  being in orbit before releasing the payload.\n\u003C/p\u003E\n"},{"CreatedByName":"Serenity","CreatedById":179192,"CreatedDateTime":"2021-07-25T15:15:49Z","Content":"\n\u003Cp\u003E\nI love Kerbal Reusability mod, the landing legs are so good.\n\u003C/p\u003E\n\u003Cp\u003E\nI am not saying its super easy but you can definitely land back boosters with some waste of \u003Cabbr title=\u0022Delta-V\u0022\u003E\u003Cabbr title=\u0022Delta-V\u0022\u003EDV\u003C/abbr\u003E\u003C/abbr\u003E and even without the mod legs you can land on engines.\n\u003C/p\u003E\n\u003Cp\u003E\nGet the rocket around 90-100k apoapsis, as soon as you reach upper atmosphere separate and start an \u0027\u0027aggressive\u0027\u0027 circularization of the payload/stage.\n\u003C/p\u003E\n\u003Cp\u003E\nYou should have enough time to get the second stage and payload in orbit and switch back to booster before it even reaches 70k height.\n\u003C/p\u003E\n\u003Cp\u003E\nSwitch to the booster and land back or boost your orbit and land at that middle spot, it gets quite manageable after few efforts.\n\u003C/p\u003E\n\u003Cp\u003E\nTo land easier you better waste some fuel and have some airbrakes, its not easy to manually suicide burn so zeroing the horizontal/vertical speed few hundred meters above surface is a bit unrealistic but it helps a lot.\n\u003C/p\u003E\n\u003Cp\u003E\nAn easy way to zero those speeds is to hold retrograde with \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E and the moment the retro marker goes crazy its the sweet spot, you then let the rocket gain some speed and bit of final burn, you landed, or exploded.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222021-07-25T15:33:10Z\u0022 title=\u002207/25/2021 03:33  PM\u0022 data-short=\u00222 yr\u0022\u003EJuly 25, 2021\u003C/time\u003E by Serenity\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Blaarkies","CreatedById":153700,"CreatedDateTime":"2021-08-23T08:06:17Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224009309\u0022 data-ipsquote-contentid=\u0022203986\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221627215407\u0022 data-ipsquote-userid=\u0022153700\u0022 data-ipsquote-username=\u0022Blaarkies\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\nOn 7/25/2021 at 2:16 PM, Blaarkies said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI have been wondering about using a launch pad to the west, maybe the desert runway?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis works, but is a little bit tricky because of the site\u0027s latitude (launching east gets you into an inclined orbit).\u003Cbr\u003E\u003Cbr\u003E\nThe booster needs some 2000 m/s \u003Cabbr title=\u0022Delta-V\u0022\u003Edv\u003C/abbr\u003E (or even more) to get its trajectory out over the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E (when launching from the desert launch site). Luckily the inclination issue is so that, launching directly eastward will let the trajectory come down over \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E.\u003Cbr\u003E\u003Cbr\u003E\nThis might leave the booster with an \u003Cabbr title=\u0022Apoapsis\u0022\u003EAp\u003C/abbr\u003E of 100km, which is fine since it gives the payload lots of time to circularize. The booster can then quite easily re-enter (even at 120% reentry heating), and land close to the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E. Since fuel is the only cost at that point, the booster can be much bigger that what is \u0022optimal\u0022, since it gets recovered for \u002B95% cost.\u003Cbr\u003E\u003Cbr\u003E\nWill take some pics next time, it was just a simple 1.25m booster stack putting Kerbal rescue craft in orbit, which is the hard part because of this inclination\n\u003C/p\u003E\n"}]}