{"TopicId":204465,"ForumId":16,"TopicTitle":"Rover don\u0026#039;t rove","CreatedByName":"maddog59","CreatedById":205063,"CreatedDateTime":"2021-08-22T14:34:49Z","PageNum":1,"Articles":[{"CreatedByName":"maddog59","CreatedById":205063,"CreatedDateTime":"2021-08-22T14:34:50Z","Content":"\n\u003Cp\u003E\nI\u0027m having trouble getting a Mun rover to move across the surface. It worked fine on Kerbal, but when I try to move forward it does a headstand, and moving backward it does a tailstand. The only way I can get it to move in either direction is to repeatedly and rapidly tap the W or S keys. I figure it must have something to do with Friction Control, but I\u0027ve tried all kinds of combinations to smooth out the action without any luck. This is (what I thought was) a pretty basic rover - a Mobile Lab with a couple of fuel tanks on the back and a couple of hab modules up front, with four TR-2L\u0027s. It\u0027s admittedly a bit nose heavy, with the tanks nearly empty, but I\u0027d like to see if I can get better performance out of it.\n\u003C/p\u003E\n"},{"CreatedByName":"Stamp20","CreatedById":202020,"CreatedDateTime":"2021-08-22T14:58:20Z","Content":"\n\u003Cp\u003E\nDoes your craft have any reaction wheels? It sounds like the reaction wheels are activating when you try to drive. You can fix it by setting all of the reaction wheels to \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E Only, which will make them ignore WASD input but \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E can still use them to prevent your rover from flipping.\n\u003C/p\u003E\n"},{"CreatedByName":"maddog59","CreatedById":205063,"CreatedDateTime":"2021-08-22T15:12:52Z","Content":"\n\u003Cp\u003E\nThank you! That did the trick. Much obliged!\n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2021-08-23T21:58:27Z","Content":"\n\u003Cp\u003E\nFor some silky reason the default key controls for wheels are WASD, which also control pitch and yaw; the yaw bit is OK, but pitching when you want to drive is annoying and unhelpful. Change your key binds so you drive with the arrow keys and that problem is solved forever, you can keep full \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and reaction wheel control without it interfering with your rover driving.\n\u003C/p\u003E\n"},{"CreatedByName":"Maria Sirona","CreatedById":210882,"CreatedDateTime":"2021-08-25T15:49:44Z","Content":"\n\u003Cp\u003E\nThe home planet is called Kerbin, kerbals are the creatures\n\u003C/p\u003E\n"}]}