{"TopicId":20494,"ForumId":16,"TopicTitle":"[Question] - Solarstable orbit around Kerbin","CreatedByName":"djnekkid","CreatedById":36328,"CreatedDateTime":"2012-09-26T20:05:31Z","PageNum":1,"Articles":[{"CreatedByName":"djnekkid","CreatedById":36328,"CreatedDateTime":"2012-09-26T20:05:31Z","Content":"\n\u003Cp\u003EHi all.\u003C/p\u003E\u003Cp\u003EI\u0027ve been thinking about putting out two sattelies, one on each \u0027solar shift\u0027 around Kerbin. In other words on the Kerbin pro- and retrograde. Am I totally wrong, if i send up a sattelite in keosync, just that it needs to be in 270 degree orbit, and not 90 degree?\u003C/p\u003E\u003Cp\u003EOr are that orbit just something else?\u003C/p\u003E\u003Cp\u003E-DJ-\u003C/p\u003E\n"},{"CreatedByName":"iamaphazael","CreatedById":49843,"CreatedDateTime":"2012-09-26T20:10:07Z","Content":"\n\u003Cp\u003ENo, they both need to be in eastward orbits or they won\u0027t be keostationary. You just need to position them so that when they are in their final orbits they end up where you want them.\u003C/p\u003E\n"},{"CreatedByName":"djnekkid","CreatedById":36328,"CreatedDateTime":"2012-09-26T20:26:25Z","Content":"\n\u003Cp\u003Eits not keostatenary per se I want, its \u0027progradestationary\u0027 if you get my drift...\u003C/p\u003E\u003Cp\u003EHmm, or would they need to be actually just outside of kerbins SOI, but with the same semi-major axis as kerbin...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-26T20:28:29Z\u0022 title=\u002209/26/2012 08:28  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 26, 2012\u003C/time\u003E by djnekkid\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2012-09-26T21:17:34Z","Content":"\n\u003Cp\u003Eyou mean not-orbiting? You can\u0027t have it not-orbiting, unless as you say you go outside the SoI. Then you\u0027re just orbiting the sun.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-09-26T21:21:05Z","Content":"\n\u003Cp\u003EYou want them to be ahead of and trailing kerbin in it\u0027s solar orbit? i.e. Trojan points but a lot closer.\u003C/p\u003E\u003Cp\u003EKeostationary is no good in that case as they\u0027re static with respect to the surface but the surface is rotating with respect to the orbit.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure it\u0027s possible but you\u0027re looking at two 270Ã‚Â° orbits that rotate at the same speed as kerbin so you\u0027re orbiting at the same speed kerbin is rotating but in the opposite direction (actually slightly less so it gradually drifts in synchronisation with Kerbin\u0027s curved path around the sun), the only difference between the satellites would be one was launched when KSC was approaching solar retrograde and one when KSC was on the opposite side of the planet.\u003C/p\u003E\u003Cp\u003EIf that\u0027s not possible because it would be over escape velocity or something then just plonk them into the same solar orbit as kerbin. Go lower/higher initially to get them ahead/behind kerbin then burn back up/down to kerbin\u0027s orbit.\u003C/p\u003E\u003Cp\u003EIf by solar shifts you mean that you want one overhead at midnight and the other overhead at high noon (with respect to a single point in the planet) then that\u0027s just two keostationary orbits launched half a kerbin rotation apart (3 hours).\u003C/p\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2012-09-26T21:27:58Z","Content":"\n\u003Cp\u003ENo, that wouldn\u0027t work, because it has to be going round it with respect to the centre of gravity, not the surface. Essentially, he needs to orbit the sun, but he can\u0027t do that within the sphere of influence of a planet because then you need to counter the gravity of the planet.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-26T21:56:28Z\u0022 title=\u002209/26/2012 09:56  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 26, 2012\u003C/time\u003E by Person012345\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Person012345","CreatedById":33728,"CreatedDateTime":"2012-09-26T21:37:11Z","Content":"\n\u003Cp\u003EWell, I suppose he could orbit kerbin at the same rate that kerbin orbits the sun (but in retrograde) though I\u0027m not sure that\u0027s possible whilst lso being within it\u0027s SoI\u003C/p\u003E\n"},{"CreatedByName":"iamaphazael","CreatedById":49843,"CreatedDateTime":"2012-09-27T00:06:30Z","Content":"\n\u003Cp\u003EOh, I see what you want to do. So, what you want basically is an orbit around Kerbin that has the same period as Kerbin\u0027s orbit around the sun. (This way, your ship makes one orbit around for each orbit or kerbin around the sun, thus keeping all three in the same relative position). I just tried solving the orbital period equation for that period, and assuming that a) the data in the ksp wiki for the mass of Kerbol and Kerbin and Kerbin\u0027s orbital period is all correct, and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E the gravitational constant is the same in game as it is in the real world, and c) I did all my math correctly, then you would need a circular orbit at about 4,342,000,000 m around Kerbin, which is well outside of its sphere of influence. So, the best approximation you can hope for is what others here have suggested: take them into a Kerbol-centric orbit that matches Kerbin\u0027s orbit, just ahead of and behind it.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2012-09-27T02:23:04Z","Content":"\n\u003Cp\u003EIndeed. Not going to happen in a patched-conics system, I\u0027m afraid. As noted the best option would be to go into the Sun\u0027s SoI, and set-up an orbit that\u0027s the same as Kerbin\u0027s, ahead and behind it. The only way to put the satellites anywhere else would be to put it on the Kerbol-Kerbin L1, which won\u0027t happen because it\u0027s not modeled, and would require n-body math to do. In short, not gonna happen (as cool as that would be; there are very good development reasons to not add Lagrange points, as Harv explained...somewhere).\u003C/p\u003E\n"},{"CreatedByName":"djnekkid","CreatedById":36328,"CreatedDateTime":"2012-09-27T05:22:15Z","Content":"\n\u003Cp\u003EYes... It seems like i need to go just outside kerbins SOI, and set up a solar orbit with the same semi-major axis as Kerbin.\u003C/p\u003E\u003Cp\u003EIf i build a rocket, and fire it up just as the sun goes down/up and just go streight up, I should be close to getting just behind (or ahead of) Kerbin. Let the Apoapsis be like 100.000km, and it should be good to go. Hopefully. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Peppe","CreatedById":51446,"CreatedDateTime":"2012-09-27T08:44:36Z","Content":"\n\u003Cp\u003EAre Lagrangian points modeled in KSP?\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Lagrangian_point#L1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Lagrangian_point#L1\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2012-09-27T13:58:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Peppe\u0022 data-cite=\u0022Peppe\u0022\u003E\u003Cdiv\u003EAre Lagrangian points modeled in KSP?\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Lagrangian_point#L1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Lagrangian_point#L1\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. That would require solving the \u003Ca href=\u0022https://en.wikipedia.org/wiki/N-body_problem\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003En\u003C/em\u003E-body problem\u003C/a\u003E. KSP makes do with simpler patched-conics for 2-body solutions.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-27T14:08:11Z\u0022 title=\u002209/27/2012 02:08  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 27, 2012\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"}]}