{"TopicId":206510,"ForumId":16,"TopicTitle":"Aircraft rolling in flight without an input","CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2022-01-20T08:13:11Z","PageNum":1,"Articles":[{"CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2022-01-20T08:13:11Z","Content":"\n\u003Cp\u003E\nI have a problem with my airplane. It keeps rolling to either side without an input.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022rEu4EMt.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/rEu4EMt.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nThe plane is well balanced and flies nicely. I have angled the wings and configured the control surfaces so that it can fly on trim (alt\u002BWASDQE) only with minimal or no inputs. It can fly around the globe 610m/s on almost static altitude on it\u0027s own without any inputs after setting the trims, except for the rolling. I have to constantly press Alt\u002BQ or E, and even in fine mode, I can\u0027t seem to get it to stay level. Everything is symmetrical and snapped to the center, there is no weight imbalance. The fuel drains normally. Here is the craft file just in case. \u003Ca href=\u0022https://kerbalx.com/Kuula4/Laythe-plane-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Kuula4/Laythe-plane-3\u003C/a\u003E  Playing fully stock btw.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022GXuS8OX.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/GXuS8OX.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nSee here. On the left side the gray box is the aerodynamical GUI. \u0022Heading\u0022 and \u0022Roll\u0022 is what we\u0027re interested in. In this screenshot is also information of how I\u0027ve configured the control surfaces. I have also disabled reaction wheels completely from the cockpit. The \u0022roll\u0022 value is constantly changing, no matter how small corrections I make to the trim. In this picture it\u0027s rolling slowly to the left 1/10th of a degree per second, and as a result of the bank angle, my heading is changing left as well (northwards).\n\u003C/p\u003E\n\u003Cp\u003E\nInterestingly, look at the input meters,  where \u0022ROLL\u0022 is. In this screenshot, the plane is slowly rolling to the left, and I have applied right side trim to counteract it. If I trim it anymore to the right from that position, the plane suddenly starts rolling right (instead of the slow left bank until then) very fast, say 5-10 times as fast than in the previous trim position. In a disproportionate manner, instead of leveling calmly. On another separate flight, with the completely same aircraft and heading, the same issue happened but the rolling problem was to the opposite side.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EYesterday with a similar aircraft on 2 separate identical flights, after about 2-5 mins of tedious micromanaging the roll trim I managed to get it perfectly balanced. \u003C/strong\u003EThe needed roll trim was just barely visible on the bottom-left visual meter, unlike in this screenshot where it\u0027s easily seen. \u003Cstrong\u003EThe plane flew straight and level for hours,  \u003C/strong\u003Ecircumnavigating kerbin several times and after running out it stalled safely into the ocean with the crew cockpit still intact. \u003Cstrong\u003EWhat is the problem now? \u003C/strong\u003EI have tried the same for so much longer today and can\u0027t get it to work. Does it come down to luck in milliseconds of keystroke?  I have even enabled smooth controls with CAPSLOCK, but the keyboard input still seems rough for such precise controls. What causes this phantom roll force in an airplane? that forces me to micromanage the roll trim of an aircraft. \u003Cstrong\u003EIs there a precise way for example, to input the control surface trims numerically with decimals? The analogical display of applied torgue in the bottom left corner of the UI leaves a lot to be desired here.\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nHere is an older thread I found on the same problem. In this thread there didn\u0027t seem to be a stock way to  fix  it and the problem was left partly unresolved.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u002298495\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed5538210692\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/97516-airplane-rolling-to-the-left/\u0026amp;_fromLogin=1\u0026amp;do=embed\u0022 style=\u0022height:194px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-20T10:45:50Z\u0022 title=\u002201/20/2022 10:45  AM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 20, 2022\u003C/time\u003E by Kuula4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Starhawk","CreatedById":131400,"CreatedDateTime":"2022-01-20T13:18:24Z","Content":"\n\u003Cp\u003E\nSomething strange happened to roll control a few version back.\n\u003C/p\u003E\n\u003Cp\u003E\nSince then I am constantly fighting with roll stabilization for my craft, especially for spaceplanes.\n\u003C/p\u003E\n\u003Cp\u003E\nA larger vertical stabilizer may help, but I do not have any other remedy.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\nHappy landings!\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-01-20T13:39:34Z","Content":"\n\u003Cp\u003E\nAs far as I can see, your plane has no yaw control. it shouldn\u0027t affect roll, but maybe the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is trying to fix yaw in a way that also affects roll.\n\u003C/p\u003E\n\u003Cp\u003E\nI can\u0027t really say, but I think activating the reaction wheels could improve stability\n\u003C/p\u003E\n"},{"CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2022-01-20T14:55:18Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/131400-starhawk/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022131400\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/131400-starhawk/\u0022 rel=\u0022\u0022\u003E@Starhawk\u003C/a\u003EI can\u0027t think how a larger rudder could help with roll stability. Perhaps if I had a rudder with 2 separate control surfaces, the higher one with roll only? Right now the only roll controls are on my wingtips on those small elevon 4\u0027s.  The issue isn\u0027t in that I don\u0027t have enough torgue. Most of the surfaces are already set to 1-4 degree max authority. The problem is a (for now unknown) phantom force making my symmetrical and balanced aircraft roll to it\u0027s side. It can\u0027t be Kerbin\u0027s rotation causing it, can it? Shouldn\u0027t, because I fly only 0,5-1 degrees max off the rotation...\n\u003C/p\u003E\n\u003Cp\u003E\nAnd indeed, it is really annoying that the plane can\u0027t fly straight. \u003Cstrong\u003EBut what puzzles me, how did I manage to make my craft not roll at all yesterday, 2 times in a row? \u003C/strong\u003EAfter a short trim tapping battle E\u002BQ back and forth, I couldn\u0027t believe it! I sat back and enjoyed the views while my plane flew it\u0027s tanks dry around kerbin. Now I want to do it again, but I just can\u0027t seem to get the trim right no matter how quickly I tap. \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204876-king-of-nowhere/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022204876\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/204876-king-of-nowhere/\u0022 rel=\u0022\u0022\u003E@king of nowhere\u003C/a\u003EOops, looks like I forgot to highlight my rudder from the screenshot. I do have yaw control on a small elevon, it\u0027s behind that top wing strake.\n\u003C/p\u003E\n\u003Cp\u003E\nI am flying without \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E, because I haven\u0027t been able to make a plane capable of continuous circumnavigation, without control inputs, using \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E. With trim I have been able to do this. Also, \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is extremely annoying to use because putting it on cancels manual trim inputs, and touching the controls while it\u0027s on resets itself, causing the nose to drop. I have been practising flying with only manual trim and the results have been amazing, it is such a different world, gliding, turning and landing so smoothly.\n\u003C/p\u003E\n\u003Cp\u003E\nI turned off the reaction wheels based on a feeling. At least without the reaction wheels, I ruled out  the possibility of them creating the phantom roll somehow.\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2022-01-20T17:31:52Z","Content":"\n\u003Cp\u003E\nYaw can absolutely affect roll, and sometimes a larger vertical stabilizer will help with roll stability, or simply moving the vertical stabilizer farther aft.  Not sure that is the cause of your issue though, but perhaps worth testing.\n\u003C/p\u003E\n\u003Cp\u003E\nOn the much larger aircraft I typically build I do not normally encounter your issue.  Perhaps adding some roll stability would help.  Either add a little dihedral to your wings, or mount them higher on the fuselage, either method would add roll stability.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, the control surfaces appear to be much larger than a ship that size needs- perhaps try using smaller control surfaces.  In your photo, you have separate elevator and rudder surfaces on the back of the plane.  Try just using one pair of surfaces, and leaving Pitch and Roll active.\n\u003C/p\u003E\n\u003Cp\u003E\nIf you find a solution, I’m curious what it is.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit:  I would definitely try moving your vertical stabilizer farther aft to see if that helps. \u003Cbr\u003E\nEdit #2:  Is that the Panther engine?  Try turning off the vector control, or gimbal.\n\u003C/p\u003E\n\u003Cp\u003E\nAlso, do you add positive wing incidence to your airplanes?  If so, is it possible the wing incidences became unsymmetrical?  If so, try rebuilding the wings from scratch, making sure they both have exactly the same rotation when you\u0027re done.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-20T18:13:11Z\u0022 title=\u002201/20/2022 06:13  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 20, 2022\u003C/time\u003E by 18Watt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2022-01-20T18:53:55Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224079714\u0022 data-ipsquote-contentid=\u0022206510\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642690518\u0022 data-ipsquote-userid=\u0022210071\u0022 data-ipsquote-username=\u0022Kuula4\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, Kuula4 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI am flying without \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E, because I haven\u0027t been able to make a plane capable of continuous circumnavigation, without control inputs, using \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nTry \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E Prograde in ORBital mode (click on the top indicator of the navball). It works well when you fly strictly eastward. I use it routinely for quick testing/prototyping of planes - shows pretty quickly if you have the basic design parameters right and balanced.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nAs far as I\u0027ve been able to gather over the years, unexpected roll tendencies in an otherwise well-designed and balanced plane is the result of things that we can\u0027t really do much about:\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nDifferences in part placement/rotation of mirrored parts. KSP isn\u0027t particularly precise about this. Tiny fractions of degree differences of lift/drag inducing parts can add a technically and visually imperceptible but still significant torque, especially when approaching maximum dynamic pressure (you often notice it most when its trying to break the sound barrier).\n\u003C/li\u003E\n\u003Cli\u003E\nKSP\u0027s penchant for part asymmetry combined with an inconsistent default radial attachment/rotation position of parts, especially in mirrored symmetry. Drag cubes are not always \u0027mirror-symmetric\u0027, so this sometimes results in a slightly different drag/lift profile left and right of the craft even when you think you have identically mirrored sides, causing a tendency to roll.\n\u003C/li\u003E\n\u003Cli\u003E\nAutostrut recalculation while a plane is under physics stress causing parts to slightly move/rotate from where they should be. This is most noticeable in newer versions when a staging event happens, like when dropping fuel tanks mid-flight, and suddenly a perfectly stable plane will start rolling to one side strongly. But it also happens right on first load of a craft. You can tell that this is playing a part when you revert to launch a plane, without making any changes to it, and it displays different degrees of roll tendency every revert, sometimes even in opposite directions.\n\u003C/li\u003E\n\u003Cli\u003E\nKSP\u0027s \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E (not a role in your case, but still worth mentioning). Somewhere between 1.0 and 1.3.1, they did something with the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E code that introduced a constant \u0027micro-flutter\u0027 to the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E PID, which often adds a tiny unwanted attitude shift every second or so. Since none of the \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E modes do anything to keep a plane level, and yaw/pitch are usually strongly dampened by most planes\u0027 basic design, it tends to be most noticeable in the roll axis.\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\nYou can add a bit of camber to wings to compensate for roll tendencies. I often end up adding a five degree (one fine snap) angle upward towards the wing tips. This adds a roll-countering difference in lift between  wings when you\u0027re not flying exactly level, so it effectively becomes self-stabilizing (at the cost of a tiny loss of total lift capacity). It\u0027s more of a workaround than a solution, but it helps.\n\u003C/p\u003E\n"},{"CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2022-01-20T20:38:31Z","Content":"\n\u003Cp\u003E\nI thought that the vertical stabilizer was called the rudder. But now I see that the rudder is a horizontal control surface in aviation. Must have been a misconception from ships and seafaring... \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198538-18watt/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022198538\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/198538-18watt/\u0022 rel=\u0022\u0022\u003E@18Watt\u003C/a\u003E I ran two brief tests. 1. Moving the vertical stabilizer more to the back. 2. making it larger. Both of the changes showed to be (in my observation) irrelevant to the roll issue.\n\u003C/p\u003E\n\u003Cp\u003E\nI changed the two control surfaces to one smaller one, and it flies just as well. Haven\u0027t tried a landing approach yet though, in those situations, having separate ailerons and elevators is great.  I did have incidence and heeding the advice, I built the wings 3 times from scratch, observed no effect. So I conclude I had used the editor as I intended it to.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224079901\u0022 data-ipsquote-contentid=\u0022206510\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642704835\u0022 data-ipsquote-userid=\u0022152460\u0022 data-ipsquote-username=\u0022swjr-swis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, swjr-swis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can add a bit of camber to wings to compensate for roll tendencies.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224079820\u0022 data-ipsquote-contentid=\u0022206510\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642699912\u0022 data-ipsquote-userid=\u0022198538\u0022 data-ipsquote-username=\u002218Watt\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, 18Watt said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nEither add a little dihedral to your wings,\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nThis I did, and the result is, the plane is much more tolerable now. Instead of having to correct the roll (on 4x physics warp) every 5-10 seconds, I don\u0027t have to pay attention almost at all. Though adding tip curve to the wings helped, it still didn\u0027t eliminate the problem. The plane will still keep a slight bank to the direction the kraken has chosen, 0,5-2 degrees, and so my heading will still change ever so slowly. For now the heading change is only 1/100th of a degree per second, so it is definitely manageable on KSP\u0027s miniature planet sizes. And, this eliminated the real danger of the roll issue - the plane won\u0027t fall, it will just go slowly off-course. I didn\u0027t add any incidence though, I\u0027ll have to try later how it affects and if it ruins this balance.\n\u003C/p\u003E\n\u003Cp\u003E\nUsing these dihedral wings today, I didn\u0027t have to tediously fight with the roll trim at all either! But yesterday, I had a plane without dihedral wings. I eliminated the roll issue completely by tinkering with  alt\u002BQ/E, on 2 separate occasions! It makes me wonder, is such a mod possible that enables inputting numerical trim orders? With decimals even?  Or is it possible to view the precise amount of torgue (phantom roll force) that is being applied to the plane? If the 2 previously mentioned cases are possible this issue could be completely eliminated.\n\u003C/p\u003E\n\u003Cp\u003E\nThough I suppose there is the atmosphere autopilot mod, which looks wonderful and I think it will solve everything. But I\u0027ll stay stock for a while still.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152460-swjr-swis/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152460\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152460-swjr-swis/\u0022 rel=\u0022\u0022\u003E@swjr-swis\u003C/a\u003EHearing what you say about the game physics, I conclude that yesterday I just got lucky removing the roll problem with manual inputs.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224079901\u0022 data-ipsquote-contentid=\u0022206510\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642704835\u0022 data-ipsquote-userid=\u0022152460\u0022 data-ipsquote-username=\u0022swjr-swis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, swjr-swis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nYou can tell that this is playing a part when you revert to launch a plane, without making any changes to it, and it displays different degrees of roll tendency every revert, sometimes even in opposite directions.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nJust saw this! The precisely same craft had his phantom roll to one side and on the next flight to the other. I noticed this yesterday too.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: Another thought rose to my mind, if I didn\u0027t use any autostruts in the plane, it might not suffer from this issue?\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-20T20:42:47Z\u0022 title=\u002201/20/2022 08:42  PM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 20, 2022\u003C/time\u003E by Kuula4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"swjr-swis","CreatedById":152460,"CreatedDateTime":"2022-01-20T20:49:41Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224079975\u0022 data-ipsquote-contentid=\u0022206510\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642711111\u0022 data-ipsquote-userid=\u0022210071\u0022 data-ipsquote-username=\u0022Kuula4\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n6 minutes ago, Kuula4 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\ncamber\n\u003C/p\u003E\n\u003Cp\u003E\ndihedral\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI used the wrong word, didn\u0027t I? It\u0027s dihedral, sorry.\n\u003C/p\u003E\n\u003Cp\u003E\nI only play at being an aeronautical engineer.\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2022-01-20T22:14:24Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224079988\u0022 data-ipsquote-contentid=\u0022206510\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221642711781\u0022 data-ipsquote-userid=\u0022152460\u0022 data-ipsquote-username=\u0022swjr-swis\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n1 hour ago, swjr-swis said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nI used the wrong word, didn\u0027t I? It\u0027s dihedral, sorry.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nHa!  I knew what you meant!  I think dihedral is the preferred term amongst aeronautical enginerds, but I take camber to mean the exact same thing.  At least you didn’t call it caster..\n\u003C/p\u003E\n"},{"CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2022-01-21T10:46:03Z","Content":"\n\u003Cp\u003E\nI launched this similar aircraft 7 separate times and the results were:\u003Cimg alt=\u0022fM8wm2b.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/fM8wm2b.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n-3 times it rolled slightly to the left, until it was at 0,5-2,5 degrees bank angle, then it took much longer to roll any more. I could fly 2,5 times around kerbin near the greatcircle, had to fix roll just a few times. On the first flight the roll was almost unseen, at maximum only 0,5 degrees.\n\u003C/p\u003E\n\u003Cp\u003E\n-2 times it rolled aggressively to the left and it went over 7 degrees, showed no signs of slowing the roll and started falling. I aligned the craft manually several times, even set it into a 45 degree angle on the other side. Still it kept rolling quickly.\n\u003C/p\u003E\n\u003Cp\u003E\n-2 times it rolled slowly to the right but showed no signs of stopping or slowing down unlike when rolling to the left previously.  \n\u003C/p\u003E\n\u003Cp\u003E\nOn none of these flights I used roll trim, only pitch. I made sure by resetting my trim several times (alt\u002Bx)\n\u003C/p\u003E\n\u003Cp\u003E\nIf you\u0027re interested in trying this out, here\u0027s the ship used \u003Ca href=\u0022https://kerbalx.com/Kuula4/Panther-cruiser\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/Kuula4/Panther-cruiser\u003C/a\u003E . You can also do a test with your own craft. The mission is to fly around the globe in an unchanging heading on a steady cruise. Don\u0027t use \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003E\u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E\u003C/abbr\u003E.  Use only Alt\u002BWS trim, go to cruising altitude until you\u0027re roughly level in speed and alt, cruise straight for a while (with 4x physics warp too) and revert a few times. See if the rolling issue ( if your craft might experience any) changes at reverts when there should be no physical difference.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022AyoAJR5.jpg\u0022 class=\u0022ipsImage\u0022 data-ratio=\u0022100.00\u0022 height=\u0022750\u0022 width=\u00221200\u0022 src=\u0022https://i.imgur.com/AyoAJR5.jpg\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nAnyway, I can consider this issue on a personal and case-specific level  solved. The yesterday\u0027s dihedral-wing aircraft (seen dimly in the picture) flew very nicely and never rolled more than 0,7 degrees to either side (seen clearly on the picture). While heading corrections were needed, they were far and wide.\n\u003C/p\u003E\n\u003Cp\u003E\nThanks for the replies.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-01-21T10:47:23Z\u0022 title=\u002201/21/2022 10:47  AM\u0022 data-short=\u00222 yr\u0022\u003EJanuary 21, 2022\u003C/time\u003E by Kuula4\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FleshJeb","CreatedById":111640,"CreatedDateTime":"2022-01-21T18:11:37Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152460-swjr-swis/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022152460\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/152460-swjr-swis/\u0022 rel=\u0022\u0022\u003E@swjr-swis\u003C/a\u003E Also notable: The Coriolis effect and the act of trying to fly a straight line on a sphere. If the \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E were exactly on the equator, we’d see fewer perturbations when flying due East or West. If it were at latitude 45 we’d see it much more.\n\u003C/p\u003E\n"},{"CreatedByName":"Kuula4","CreatedById":210071,"CreatedDateTime":"2022-01-22T06:24:56Z","Content":"\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022111640\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/111640-fleshjeb/\u0022 rel=\u0022\u0022\u003E@FleshJeb\u003C/a\u003E I was thinking about it, but when I\u0027m already flying on the equator (\u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E is not on the equator?) going eastwards, Kerbin\u0027s rotation shouldn\u0027t have any effect. The plane is configured with slight trim and slight incidence, it \u0022bounces\u0022 at an altitude of around 13 to 14km and a steady speed of 610m/s, so the curvature of kerbin is not a problem either. I imagine a nice path for my plane along the greatcircle, but the tiny bank angle always forces it off-course \u003Cspan\u003E\u003Cimg alt=\u0022:(\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 title=\u0022:(\u0022\u003E\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nI also tested this by flying over the equator from north to south and from south to north several times at a 45 degree heading and heavy roll. The phantom roll that the craft had, persisted, and only changed upon reverting and launching again.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}