{"TopicId":208081,"ForumId":16,"TopicTitle":"How do i calculate the Delta V from surface to the minimun orbit possible","CreatedByName":"Askert","CreatedById":221336,"CreatedDateTime":"2022-05-07T01:33:35Z","PageNum":1,"Articles":[{"CreatedByName":"Askert","CreatedById":221336,"CreatedDateTime":"2022-05-07T01:33:35Z","Content":"\n\u003Cp\u003E\nGuys, i was trying to learn things about ksp and i dont know how do i calculate the delta V necessary to make a orbit from surface, i tried to substitute the formulas already knowed and i\u0027ve got nothing productive. As i know that exist a image telling about the delta v costs, i just want to know how to calculate it and try my self with math. im new, sorry.\n\u003C/p\u003E\n"},{"CreatedByName":"Deddly","CreatedById":62955,"CreatedDateTime":"2022-05-18T16:59:18Z","Content":"\n\u003Cp\u003E\nHi \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/221336-askert/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022221336\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/221336-askert/\u0022 rel=\u0022\u0022\u003E@Askert\u003C/a\u003E, it looks like you accidentally posted this in the Portuguese section, so I\u0027ve moved it here to Gameplay Questions in English.\n\u003C/p\u003E\n"},{"CreatedByName":"HebaruSan","CreatedById":156657,"CreatedDateTime":"2022-05-18T18:26:53Z","Content":"\n\u003Cp\u003E\nThere are three main areas in which you need to spend Δv to get to orbit:\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\n\u003Cstrong\u003EOrbital velocity\u003C/strong\u003E\u003Cbr\u003E\nThis is simply how fast you must be going once you\u0027re in orbit to stay in orbit. The vis-viva equation is great for calculating this (you can simplify it a bit for circular orbits):\u003Cbr\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Vis-viva_equation\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://en.wikipedia.org/wiki/Vis-viva_equation\u003C/a\u003E\u003Cbr\u003E\nYou\u0027ll need to know the mass of the body from which you\u0027re launching (\u003Cstrong\u003EM\u003C/strong\u003E), which can be gotten from the KSP wiki:\u003Cbr\u003E\u003Ca href=\u0022https://wiki.kerbalspaceprogram.com/wiki/Kerbin\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://wiki.kerbalspaceprogram.com/wiki/Kerbin\u003C/a\u003E\u003Cbr\u003E\n... and the size of your orbit (\u003Cstrong\u003Er\u003C/strong\u003E and \u003Cstrong\u003Ea\u003C/strong\u003E), which is the body\u0027s radius (also available from the wiki) plus your altitude in orbit (generally 70 km or thereabouts for \u0022the minimum orbit possible\u0022).\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EGravity losses\u003C/strong\u003E\u003Cbr\u003E\nTo get to orbit, you have to travel at least 70 km upwards. That costs energy, and the whole time you\u0027re climbing up there gravity will be pulling you back down. Unfortunately rather than something like the vis-viva equation, gravity losses require solving complicated differential equations that relate to your exact flight path, so folks tend to determine this by trial and error, generally following approximately optimal paths to orbit to control for many of the variables.\n\u003C/li\u003E\n\u003Cli\u003E\n\u003Cstrong\u003EDrag losses\u003C/strong\u003E\u003Cbr\u003E\nWhen launching from a body with an atmosphere, gravity is not the only force holding you back; you also need to spend extra energy to punch through all that air between you and space. Much like with gravity losses, this is very complicated to pre-calculate, but unlike gravity losses it also depends on the thickness of the atmosphere at different altitudes and the details of how your craft is put together; it\u0027ll take a lot more energy to push a big draggy sail through the atmosphere than a sleek spear. Again people usually apply rules of thumb to avoid overly draggy craft and then use trial and error.\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\nIf you\u0027re curious to see a code implementation of a mediocre (but fast) approximation of this calulation, I had to write one for Astrogator. It approximates the difficult components with hard coded linear factors determined empirically using a spreadsheet of the Δv requirements and mass and atmospheric data. I wouldn\u0027t necessarily recommend using this exact calculation yourself, but it can give an idea of what\u0027s involved and why there isn\u0027t one simple equation you can use:\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://github.com/HebaruSan/Astrogator/blob/a57c8ec15a4137abbd5c2b5fe31127531173a136/Source/PhysicsTools.cs#L63-L95\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://github.com/HebaruSan/Astrogator/blob/a57c8ec15a4137abbd5c2b5fe31127531173a136/Source/PhysicsTools.cs#L63-L95\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEDIT: This link from that code is a previous discussion covering most of the same concepts better than I have here:\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedauthorid=\u0022167020\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed3601312528\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/144538-delta-v-calculations-accuracy/\u0026amp;do=embed\u0022 style=\u0022height:194px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222022-05-18T18:29:58Z\u0022 title=\u002205/18/2022 06:29  PM\u0022 data-short=\u00222 yr\u0022\u003EMay 18, 2022\u003C/time\u003E by HebaruSan\u003C/strong\u003E\n\u003C/span\u003E\n"}]}