{"TopicId":208724,"ForumId":16,"TopicTitle":"how would i retrieve a spacecraft that is orbiting the sun?","CreatedByName":"onionsiegward","CreatedById":221936,"CreatedDateTime":"2022-06-25T16:41:30Z","PageNum":1,"Articles":[{"CreatedByName":"onionsiegward","CreatedById":221936,"CreatedDateTime":"2022-06-25T16:41:30Z","Content":"\n\u003Cp\u003E\ni put like 30 pollux boosters on a little craft with like 50 science experiments on it, and I didn\u0027t think it would orbit the sun(i was mistaken). \n\u003C/p\u003E\n\u003Cp\u003E\ni want to retrieve it instead of transmitting the science, because there\u0027s like 400 science stored on it and i don\u0027t want to sacrifice it.\n\u003C/p\u003E\n\u003Cp\u003E\nheres a screenshot: \u003Ca href=\u0022https://gyazo.com/c3713b8a285c5734254401da52364161\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://gyazo.com/c3713b8a285c5734254401da52364161\u003C/a\u003E (yellow line is spacecraft, blue is kerbin)\n\u003C/p\u003E\n\u003Cp\u003E\nwhat science tree things would i need and how would i do it?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nplease help i dont want to lose 400 science and jebadiah\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-06-26T11:52:36Z","Content":"\n\u003Cp\u003E\ndo the ship has still fuel? assuming it has, you are still close enough to kerbin that you can just set kerbin as target, point towards it, and burn.\n\u003C/p\u003E\n\u003Cp\u003E\nelse, if you have little fuel, your orbit is very similar to kerbin, you should be able to return there in the next orbit. set kerbin as target, you should see a close approach marker. if kerbin is in front of your ship during the close approach, then burn retrograde - while your orbit is still touching kerbin\u0027s orbit! important - and watch the marker get closer until you get an encounter. if kerbin is behind, then burn progade instead. this is actually not difficult, but I have no idea how much experience you have in interplanetary traveling.\n\u003C/p\u003E\n\u003Cp\u003E\nif the ship has no fuel, you need to send a rescue mission. send another ship in solar orbit, and do a rendez-vous just like you would do around kerbin. only, it\u0027s going to be a lot slower.\n\u003C/p\u003E\n\u003Cp\u003E\nRegarding needs, if you can strap 30 pollux boosters on a ship, you can go everywhere. I suspect your ship and flight was very inefficient, else you wouldn\u0027t just be in solar orbit, you could go all the way to eeloo and back.\n\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2022-06-26T23:54:00Z","Content":"\n\u003Cp\u003E\nThe orbit is crossing that of Kerbin and will likely get an intercept over time even if you don\u0027t do anything. Once you do, a burn while still very high with Kerbin\u0027s \u003Cabbr title=\u0022Sphere of Influence\u0022\u003ESOI\u003C/abbr\u003E will likely be enough to put into an aerobraking descent. If the craft has a heat shield and parachutes, your problem is then solved. If not, put it into orbit (aerobraking can help with that) and then meet it with another ship. Have a kerbal go it, collect the science, and then ride his/her own ship home. \n\u003C/p\u003E\n"}]}