{"TopicId":210000,"ForumId":16,"TopicTitle":"How low of a orbit around the sun can you have without burning up?","CreatedByName":"olieeee","CreatedById":222950,"CreatedDateTime":"2022-10-05T15:02:17Z","PageNum":1,"Articles":[{"CreatedByName":"olieeee","CreatedById":222950,"CreatedDateTime":"2022-10-05T15:02:17Z","Content":"\n\u003Cp\u003E\nwith two large extendable radiators\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2022-10-05T16:04:55Z","Content":"\n\u003Cp\u003E\nI don\u0027t remember, but you can easily test. use the alt-f12 menu to teleport your ship increasingly closer to the sun, see what it takes to burn it\n\u003C/p\u003E\n"},{"CreatedByName":"18Watt","CreatedById":198538,"CreatedDateTime":"2022-10-05T20:42:04Z","Content":"\n\u003Cp\u003E\nUse caution using time warp close to the sun.  There is a bug where heat accumulates but isn’t dissipated during time warp.  \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2022-10-10T11:22:00Z","Content":"\n\u003Cp\u003E\nI just tested this with hyperedit. Its able to survive at 100.000 km, even 80.000 for minutes, but here the heat shield overheat bar was full and it detonated within seconds at 75.000. \u003Cbr\u003E\nThis was using the large heatshield pointing towards the sun. Now this might be hard on an flyby as you need to keep the heat shield against the sun and its hard to use normal time warp as this spread heat evenly to the craft as 18Watt point out. \n\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2022-10-11T09:50:34Z","Content":"\n\u003Cp\u003E\nAnd did an real mission. Found that time warp 5-100 worked well, but at 1000x all parts heated up. One problem with the huge radiators is that they extend well past the heat shield and you have to align your probe to they are exactly 90 degree to the sun while keeping the heatshield towards the sun and you are rotating relative to the sun during the flyby. One of my radiators blew up, was able to get out in 100x timewarp. \n\u003C/p\u003E\n"},{"CreatedByName":"Beamer","CreatedById":219034,"CreatedDateTime":"2022-10-28T16:11:43Z","Content":"\n\u003Cp\u003E\nTime warp is essentially \u0027cheating\u0027 your way closer than you could go without it, which is fine if you want to do that, but keep in mind that if you go close to Kerbol in timewarp and then turn off timewarp, your craft may quickly overheat.\n\u003C/p\u003E\n\u003Cp\u003E\nA lot depends on your orbit, I have a station that can comfortably do a sub-100,000 km fly-by of Kerbol with an apoapsis of around 1.5 million km, however with a higher apoapsis it can go lower because a) you\u0027re moving faster at periapsis so spend less time close to Kerbol and b) distance to Kerbol decreases and increases faster around the periapsis due to the shape of the orbit. So it\u0027s a classic case of \u0027it depends\u0027.\n\u003C/p\u003E\n\u003Cp\u003E\nMy Kerbol diver has everything in the shade of an inflatable heat shield (which is really the only choice for this sort of craft, ablative heat shields won\u0027t get you that close for long) and has 10 large radiators and 8 edge radiators directly cooling the heat shield as well as 6 small and 4 medium TCSs (all in the shield\u0027s shade, absolutely nothing sticks out). I don\u0027t think Large TCSs can fit in the shade of the shield, if they can it won\u0027t leave much space for anything else. IIRC my heat shield\u0027s skin temp went up to around 94% critical on a 1.5 million km by 99,999 km orbit (without using timewarp). Use NUKs for electricity for your cooling as solar panels will also blow up at that distance.\n\u003C/p\u003E\n\u003Cp\u003E\nMechJeb\u0027s SmartA.S.S. can help keeping your craft pointed towards the sun - choose \u0022ADV\u0022 mode, with Sun as reference and Down as direction (test this direction as it depends on your control module\u0027s orientation). You can use regular \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E to point your shield at the sun of course but if you are in a highly eccentric orbit and accidentally switch your nav ball from surface to orbit you might blow up, the advantage of SmartA.S.S. is that it doesn\u0027t depend on the reference frame your nav ball is set to.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}