{"TopicId":211318,"ForumId":16,"TopicTitle":"How do i fix the shaking problem","CreatedByName":"onurk","CreatedById":224519,"CreatedDateTime":"2023-01-05T13:58:32Z","PageNum":1,"Articles":[{"CreatedByName":"onurk","CreatedById":224519,"CreatedDateTime":"2023-01-05T13:58:32Z","Content":"\n\u003Cp\u003E\n\u003Ca href=\u0022https://drive.google.com/drive/folders/1uHKp2Hifuk1xYFv0v4U5NP59T3m1sQlZ?usp=share_link\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s\u003C/a\u003E the clip I got from the game. Please watch and tell me how to solve this problem\n\u003C/p\u003E\n"},{"CreatedByName":"Stone Blue","CreatedById":77721,"CreatedDateTime":"2023-01-05T15:22:06Z","Content":"\n\u003Cp\u003E\nAlmost looks lie you have different reaction wheels doing adjustments on opposite axis... vOv\n\u003C/p\u003E\n"},{"CreatedByName":"DeadJohn","CreatedById":201293,"CreatedDateTime":"2023-01-05T17:03:34Z","Content":"\n\u003Cp\u003E\nReaction wheel issues as noted above seem like a plausible explanation, plus KSP\u0027s bendy connections between parts especially docking ports. To confirm that reaction wheels are involved, turn off \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E and wait a bit to confirm that the shaking fades.\n\u003C/p\u003E\n\u003Cp\u003E\nThere are several ways to try lessening the problem:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nIf your craft includes multiple parts with reaction wheels, try turning some off.\n\u003C/li\u003E\n\u003Cli\u003E\nTurn on \u0022advanced tweakables\u0022 in settings then experiment with autostruts.\n\u003C/li\u003E\n\u003Cli\u003E\nSend an engineer and use \u0022EVA Construction\u0022 mode to manually add struts.\n\u003C/li\u003E\n\u003Cli\u003E\nTry the \u003Cem\u003EKerbal Joint Reinforcement Next\u003C/em\u003E mod.\n\u003C/li\u003E\n\u003Cli\u003E\n(If you are using the stock docking port rotation feature, that can interfere with struts and autostruts. I like the \u003Cem\u003EDock Rotate\u003C/em\u003E mod better than stock rotation.)\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"},{"CreatedByName":"jimmymcgoochie","CreatedById":199902,"CreatedDateTime":"2023-01-06T13:12:08Z","Content":"\n\u003Cp\u003E\nA long, thin structure with the control point at one end will be susceptible to this kind of issue- since the control point is far from the centre of mass it’s disproportionately affected by any wobbles and will act to correct it, causing an even greater swing in the opposite direction and so on; the oscillation will get worse as long as \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E is active and trying to fix the problem that it created.\n\u003C/p\u003E\n\u003Cp\u003E\nAutostruts would help by holding certain parts still relative to each other and so stiffening the structure, as would putting your control point closer to the centre of mass so it doesn’t move nearly as much if the craft starts wobbling. A quick burst of time warp will freeze the parts and stop the wobble, though this is just a temporary fix and it’ll come back if you leave \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E on.\n\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2023-01-06T13:15:09Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224215845\u0022 data-ipsquote-contentid=\u0022211318\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221672927112\u0022 data-ipsquote-userid=\u0022224519\u0022 data-ipsquote-username=\u0022onurk\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n22 hours ago, onurk said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022https://drive.google.com/drive/folders/1uHKp2Hifuk1xYFv0v4U5NP59T3m1sQlZ?usp=share_link\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s\u003C/a\u003E the clip I got from the game. Please watch and tell me how to solve this problem\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nWhat the other folks have said, but here are some suggestions you can do in-game without having to install anything or launch a new craft or whatever:\n\u003C/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nFirst, \u003Cstrong\u003Echange your \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E mode to \u0022hold orientation\u0022.\u003C/strong\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nYou\u0027ve currently got it set to \u0022hold target\u0022.  My observation has been that \u003Cabbr title=\u0022Stability Augmentation System\u0022\u003ESAS\u003C/abbr\u003E seems to be more zealous if you tell it to hold a \u003Cem\u003E\u003Cu\u003Eparticular\u003C/u\u003E\u003C/em\u003E orientation (such as \u003Cimg alt=\u0022:targetpro:\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/TargetPro20px.png\u0022 title=\u0022:targetpro:\u0022\u003E) than if you tell it to just hold its current orientaiton.\n\u003C/li\u003E\n\u003Cli\u003E\nBy itself, this change may or may not be enough to fix your problem, but I suspect it will help reduce it a bit.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nSecond,\u003Cstrong\u003E reduce your reaction torque\u003C/strong\u003E.  You have a big floppy structure, and reaction wheels don\u0027t react well with something that\u0027s too floppy.\n\u003Cul\u003E\n\u003Cli\u003E\nThe previous posters have suggested ways to solve this by making the structure more rigid, which is true:  basically, \u0022Your structure is too weak for your reaction wheels.\u0022\n\u003C/li\u003E\n\u003Cli\u003E\nHowever, one very easy workaround is to approach the problem from the opposite direction, and instead think of it as \u0022Your reaction wheels are too strong for your structure.\u0022  Instead of trying to make the structure stronger, you can make the reaction wheels weaker.\n\u003C/li\u003E\n\u003Cli\u003E\nSo, for example, just take the control-authority slider for your reaction wheels and reduce it by a lot.  There will be some threshold below which your structure stops oscillating.\n\u003C/li\u003E\n\u003Cli\u003E\nThis does have the disadvantage that your station will be much slower to turn its orientation around to the direction you want... but at least it\u0027ll stop oscillating.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/li\u003E\n\u003Cli\u003E\nThird, \u003Cstrong\u003Emake sure your control-from point is rigidly mounted to your reaction wheel.\u003C/strong\u003E\n\u003Cul\u003E\n\u003Cli\u003E\nThis one\u0027s a bit more subtle to explain, and I don\u0027t know whether it\u0027s actually relevant to you, because from the video I can\u0027t tell where your control point is.\n\u003C/li\u003E\n\u003Cli\u003E\nSo I\u0027ll save the detailed technical explanation of \u0022why this is\u0022 unless you\u0027re actually interested, and give you the bottom line:\n\u003C/li\u003E\n\u003Cli\u003E\nYou may have this particular problem if you\u0027ve set your \u0022control from here\u0022 point to some docking port or command pod that has a lot of bendy connections in between it and your strong reaction wheel.\n\u003C/li\u003E\n\u003Cli\u003E\nFor example, in the video, I see you\u0027ve got a HECS2 probe core, which has very powerful reaction wheels on it.  Suppose you\u0027ve set your \u0022control from here\u0022 point to somewhere else on the station-- for example, some docking port, located on a component that has multiple bendy docking ports between it and the HECS2.\n\u003C/li\u003E\n\u003Cli\u003E\nIf this is part of your problem, then the way to fix this would be to, 1. set your \u0022control from here\u0022 point to be the HECS2, and 2. disable any other reaction wheels on the station besides that HECS2.\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003C/li\u003E\n\u003C/ul\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n"}]}