{"TopicId":21369,"ForumId":16,"TopicTitle":"[0.17] GeoStationary orbit","CreatedByName":"timpossible","CreatedById":40947,"CreatedDateTime":"2012-10-05T02:23:34Z","PageNum":1,"Articles":[{"CreatedByName":"timpossible","CreatedById":40947,"CreatedDateTime":"2012-10-05T02:23:34Z","Content":"\n\u003Cp\u003EI\u0027m planning on setting up a network of satellites around all the planets \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECan someone please help me work out the altitudes for geostationary orbit around each planet.\u003C/p\u003E\u003Cp\u003EMaybe some funky equation with planet, ship mass, and altitude, for variables.\u003C/p\u003E\u003Cp\u003EThat would be great \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#008000;\u0022\u003ETimpossible Out\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"BeefTenderloin","CreatedById":25612,"CreatedDateTime":"2012-10-05T08:44:52Z","Content":"\n\u003Cp\u003EAs far as I know, Ike sits on a dunstationary orbit around Duna. Just match its altitude, and you should be fine.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2012-10-05T08:48:40Z","Content":"\n\u003Cp\u003EI suggest you install the ISA MapSat mod. It\u0027s interface provides you will the geostationary altitude (if it exists) for every celestial body.\u003C/p\u003E\u003Cp\u003EAlso, I wrote a guide a while ago explaining a method of getting a well-spaced constellation of satellites into geostationary orbit without any fancy math (beyond addition and subtraction). See my sig.\u003C/p\u003E\n"},{"CreatedByName":"timpossible","CreatedById":40947,"CreatedDateTime":"2012-10-05T09:33:37Z","Content":"\n\u003Cp\u003Ecool thanks\u003C/p\u003E\u003Cp\u003Eill check them out\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-05T12:49:07Z","Content":"\n\u003Cp\u003EThe wiki (link at top of page) also provides stationary orbits data for many of the bodies.\u003C/p\u003E\n"},{"CreatedByName":"bitbucket","CreatedById":6676,"CreatedDateTime":"2012-10-05T19:08:12Z","Content":"\n\u003Cp\u003EIt\u0027s not possible to put satellites in (adjective)stationary orbits around some objects, as the synchronous orbital distance is outside their sphere of influence. In such cases, you\u0027ll have to settle with a constellation of at least three satellites with line of sight to each other.\u003C/p\u003E\n"},{"CreatedByName":"Azivegu","CreatedById":50726,"CreatedDateTime":"2012-10-09T00:45:27Z","Content":"\n\u003Cp\u003Eactually, to cover a planet completely with 100% reach 100% of the time, you need four sats arranged in the same order that hydrogen atoms surround a carbon atom (cant remember the name of that shape)\u003C/p\u003E\n"},{"CreatedByName":"Ted","CreatedById":26298,"CreatedDateTime":"2012-10-09T00:49:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Azivegu\u0022 data-cite=\u0022Azivegu\u0022\u003E\u003Cdiv\u003Eactually, to cover a planet completely with 100% reach 100% of the time, you need four sats arranged in the same order that hydrogen atoms surround a carbon atom (cant remember the name of that shape)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe the shape is called a \u0027Tetrahedron\u0027 and has four Hydrogen atoms surrounding a single Carbon atom, with all H atoms being 90 degrees from each other in each direction. The name for the molecule is commonly called Methane. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt would make a very good Satellite set-up indeed, probably quite difficult to set up though, even with MechJeb.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2012-10-09T03:36:34Z","Content":"\n\u003Cp\u003EUh...impossible to set-up, more like. Have you \u003Cstrong\u003Elooked\u003C/strong\u003E at a methane atom? Bonding is in three-dimensions, not two. The only possible way to maintain such a set-up would be to use statites, and we don\u0027t have those. They\u0027re more-or-less theoretical.\u003C/p\u003E\u003Cp\u003EThat\u0027s part of the reason why we have and use Molniya orbits.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2012-10-09T04:29:03Z","Content":"\n\u003Cp\u003EIndeed, the minimum number of satellites to guarantee full coverage of a spherical object is six: Three in an orbit high enough to cover moderate latitudes, and three in a polar orbit to keep constant coverage to the polar gap of the first three. There will be significant overlap, but that can\u0027t really be helped.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2012-10-09T11:18:58Z","Content":"\n\u003Cp\u003EIndeed. The huge downside there being that any location dependant on the polar satellites will need quite sofisticated tracking equipment to keep its dish aimed at the overhead satellite. (Same issue with Molniya orbits of course.)\u003C/p\u003E\n"}]}