{"TopicId":21614,"ForumId":16,"TopicTitle":"How to send a Spaceplane to Eve?","CreatedByName":"Russ","CreatedById":54707,"CreatedDateTime":"2012-10-07T17:50:57Z","PageNum":1,"Articles":[{"CreatedByName":"Russ","CreatedById":54707,"CreatedDateTime":"2012-10-07T17:50:57Z","Content":"\n\u003Cp\u003ESo how you do it? Please don\u0027t just post pics of your plane ON Eve I wanna see the launcher. (Getting heavy stuff on orbit is my biggest problem.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-10-07T19:11:13Z\u0022 title=\u002210/07/2012 07:11  PM\u0022 data-short=\u002211 yr\u0022\u003EOctober 7, 2012\u003C/time\u003E by sal_vager\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-07T18:51:23Z","Content":"\n\u003Cp\u003EYou need very little to get to eve and landing can be done on parachutes thanks to the nice thick atmosphere. If you\u0027re only after a one way trip then it sounds like you\u0027re thinking far too large.\u003C/p\u003E\u003Cp\u003EI can\u0027t give you an explicit design as I haven\u0027t tried a one way trip (only ambitious and so far failed return missions) but try it with an existing smaller rocket like a Mun return mission and you\u0027ll be surprised how far you get.\u003C/p\u003E\n"},{"CreatedByName":"Russ","CreatedById":54707,"CreatedDateTime":"2012-10-07T19:01:27Z","Content":"\n\u003Cp\u003ESorry! I was struck by a moment of foolishness when I made this thread! What I meant to write was how to send a SpacePLANE to Eve.\u003C/p\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2012-10-07T19:10:54Z","Content":"\n\u003Cp\u003EI can fix your title for you Russ \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGetting heavy stuff to orbit is a pain, for me anyway as my frame rate dies, so I stick with small rockets.\u003C/p\u003E\u003Cp\u003EBut one trick is to daisy chain your boosters, it\u0027s known here as the asparagus design, basically each pair of boosters feeds fuel into the next, keeping them topped up and allowing you to shed weight early as the first few pairs of boosters run dry.\u003C/p\u003E\n"},{"CreatedByName":"Russ","CreatedById":54707,"CreatedDateTime":"2012-10-07T19:30:59Z","Content":"\n\u003Cp\u003EThank you! I\u0027ll try to do that once I finish my Airplane. \u003C/p\u003E\u003Cp\u003EBTW do you think it (the airplane I\u0027m planning to take to Eve) will need lots of fuel once it get there?\u003C/p\u003E\u003Cp\u003EBTW2 I\u0027ve already sucessfully landed a pod on Eve but it was a vary bad landing and the pod is badly damaged, I\u0027m kinda roleplaying an rescue mission so this airplane needs to be able to go into orbit once it has \u0022recued\u0022 the stranded kerbalnauts.\u003C/p\u003E\n"},{"CreatedByName":"Maxed-Rockets","CreatedById":27598,"CreatedDateTime":"2012-10-07T20:01:14Z","Content":"\n\u003Cp\u003EI don\u0027t think anybody has made an Eve return trip yet, spaceplane or rocket.\u003C/p\u003E\n"},{"CreatedByName":"Russ","CreatedById":54707,"CreatedDateTime":"2012-10-07T20:16:59Z","Content":"\n\u003Cp\u003EI just want to put the plane in orbit, then atach it to a bigger ship with docking claws.\u003C/p\u003E\n"},{"CreatedByName":"EndlessWaves","CreatedById":41302,"CreatedDateTime":"2012-10-07T20:33:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Maxed-Rockets\u0022 data-cite=\u0022Maxed-Rockets\u0022\u003E\u003Cdiv\u003EI don\u0027t think anybody has made an Eve return trip yet, spaceplane or rocket.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe it\u0027s been done down to the top of eve\u0027s highest mountain and back off again but it is very difficult. Take as many drop-tanks as your plane can carry while still being able to take off in 70% stronger gravity and expect to fail.\u003C/p\u003E\n"}]}