{"TopicId":218746,"ForumId":16,"TopicTitle":"S-wing drag","CreatedByName":"miklkit","CreatedById":201493,"CreatedDateTime":"2023-08-03T15:54:20Z","PageNum":1,"Articles":[{"CreatedByName":"miklkit","CreatedById":201493,"CreatedDateTime":"2023-08-03T15:54:20Z","Content":"\n\u003Cp\u003E\nI\u0027ve been noticing that the S-wing has more drag than other wings so went to the Wiki to find out how much more.  It turns out that all wings have a drag of 0.02.  This is incorrect.  Is there a source that lists the proper drag values?\n\u003C/p\u003E\n"},{"CreatedByName":"Zhetaan","CreatedById":125721,"CreatedDateTime":"2023-08-04T14:19:28Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00224308368\u0022 data-ipsquote-contentid=\u0022218746\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221691078060\u0022 data-ipsquote-userid=\u0022201493\u0022 data-ipsquote-username=\u0022miklkit\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n21 hours ago, miklkit said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIs there a source that lists the proper drag values?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nLook at the delta.cfg link in the infobox to the right of the wiki page and it\u0027ll tell you more.  The maximum and minimum drag values in the file are .02, but there\u0027s an angular drag value of 2, and a value for drag that varies with the angle of attack between 0 and .6 in ModuleLiftingSurface.\n\u003C/p\u003E\n\u003Cp\u003E\nWhether those figures mean anything to you is another matter.  If that\u0027s not what you want, then you might be best off looking at modder resources:  modders who make wing parts need to make their wings perform predictably in concert with KSP stock wings, so seeing what they\u0027re using to do that (and how they\u0027re comparing their parts to stock parts) might be of help.  The mods themselves might also be instructive:  \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/topic/203629-112-b9-procedural-wings-fork-modified/\u0022 rel=\u0022\u0022\u003EB9 Procedural Wings\u003C/a\u003E comes to mind as one that not only properly has to account for drag, but must do so on the fly, to coin a pun.\n\u003C/p\u003E\n\u003Cp\u003E\nGood luck!\n\u003C/p\u003E\n"},{"CreatedByName":"miklkit","CreatedById":201493,"CreatedDateTime":"2023-08-04T16:33:39Z","Content":"\n\u003Cp\u003E\nAh, I did not know that the .cfg was readable there.    Yes the drag at maxangleofattack is twice that of the standard wings, so that adds drag.  There is also an entry that says all the wings I looked at use an internal drag model.  Look into modders stuff?  That is way above my pay grade. \n\u003C/p\u003E\n\u003Cp\u003E\nSo I\u0027m back to flying one plane where the only difference is the wings and trying to find any difference in performance.  So far the difference is 2 high drag wings vs 10 low drag wings to get about the same lift.  The s-wing might be the winner here.\n\u003C/p\u003E\n"}]}