{"TopicId":219438,"ForumId":16,"TopicTitle":"EVA Construction - Probodyne Rovemate","CreatedByName":"Turbo Ben","CreatedById":193979,"CreatedDateTime":"2023-09-12T11:54:19Z","PageNum":1,"Articles":[{"CreatedByName":"Turbo Ben","CreatedById":193979,"CreatedDateTime":"2023-09-12T11:54:19Z","Content":"\n\u003Cp\u003E\nHI all, I\u0027m having trouble with a bit of EVA deconstruction on the Mun. I\u0027m in a career game trying to disassemble an old rover that was part of a \u0022finish rover\u0022 mission, which I completed ages ago. The rover has just been sat on the Mun unused. I had a tourist mission to land kerbals on the Mun, so I thought, instead of just terminating the rover, I could deconstruct it and return it to Kerbin. All was going as planned until the last part, the Probodyne Rovemate. I cannot pick it up.\n\u003C/p\u003E\n\u003Cp\u003E\nI\u0027ve tried all I can think of. At first I thought it was a weight issue, so I brought along 2 extra kerbals. Nope. I then thought maybe it was because it was the last part of a seperate vessel, so I took along a \u003Cabbr title=\u0022Kerbal Attachment System (mod)\u0022\u003EKAS\u003C/abbr\u003E fuel hose and connector and linked the Rovemate to my main vessel, essentially making everything part of the same vessel. I still can\u0027t pick up the Rovemate. It lights up green as though it can be picked up, but nothing happens when I click on it.\n\u003C/p\u003E\n\u003Cp\u003E\nI know it\u0027s hardly a massive issue, but I wanted to recover it rather than just destroy it. EVA construction is something I haven\u0027t done much of so wanted to understand why it\u0027s not doing what I want.\n\u003C/p\u003E\n\u003Cp\u003E\nAny suggestions?\n\u003C/p\u003E\n"},{"CreatedByName":"king of nowhere","CreatedById":204876,"CreatedDateTime":"2023-09-12T16:11:47Z","Content":"\n\u003Cp\u003E\nit\u0027s absolutely normal. not really a bug, but a quirk of how the game handles construction.\n\u003C/p\u003E\n\u003Cp\u003E\nthe probe core is the root part. you cannot manipulate root parts in eva construction, in any way.\n\u003C/p\u003E\n"},{"CreatedByName":"Turbo Ben","CreatedById":193979,"CreatedDateTime":"2023-09-13T11:54:52Z","Content":"\n\u003Cp\u003E\nThanks for the info. I was starting to suspect that might be the problem as I was able to manipulate a Rovemate that I took along as a test.\n\u003C/p\u003E\n\u003Cp\u003E\nAfter some experimentation I found a solution. I attached a claw to the rover and docked it with the lander. I was then able to completely deconstruct the rover.\n\u003C/p\u003E\n"}]}