{"TopicId":24559,"ForumId":16,"TopicTitle":"Rockets won\u0026#039;t light in high altitdue","CreatedByName":"backwardsx","CreatedById":61978,"CreatedDateTime":"2013-04-28T19:25:30Z","PageNum":1,"Articles":[{"CreatedByName":"backwardsx","CreatedById":61978,"CreatedDateTime":"2013-04-28T19:25:30Z","Content":"\n\u003Cp\u003EI am trying to build a two stage rocket but for some reason the second stage won\u0027t light up if the rocket gets too high before I initiate it. Is there something I could be missing? Nothing I have read so far seem to suggest that you need to light all rocket in the atmosphere before they will work.\u003C/p\u003E\n"},{"CreatedByName":"Capt\u0026#039;n Skunky","CreatedById":1261,"CreatedDateTime":"2013-04-28T19:37:39Z","Content":"\n\u003Cp\u003EAre you throttled up? (SHIFT key) Is it a rocket engine and have a fuel supply?\u003C/p\u003E\u003Cp\u003EA screenshot would go a long way in helping diagnose this. Use F1 to take a Screenshot. Upload from {KSP install folder}\\Screenshots to a site like imgur.com. Then edit your first post to include a link to the screenshot.\u003C/p\u003E\u003Cp\u003ECheers!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECapt\u0027n Skunky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#800080;\u0022\u003E\u003Cstrong\u003EKSP Community Manager\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rusk","CreatedById":61329,"CreatedDateTime":"2013-04-28T19:37:50Z","Content":"\n\u003Cp\u003EThats why you have oxidizer afaik. In case you are using custom parts check if your tanks come with oxidizer. Also maybe between between your engine and the fuselage you have a part thats is not able to crossfeed fuel. Things like decouplers and such.\u003C/p\u003E\n"},{"CreatedByName":"ZingidyZongxxx","CreatedById":58363,"CreatedDateTime":"2013-04-28T19:40:49Z","Content":"\n\u003Cp\u003EIt may be a jet engine that you\u0027re using. They only work in an atmosphere with oxygen.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-04-29T00:54:59Z","Content":"\n\u003Cp\u003EAre you running out of power? Engines generate electricity while they are running, but if you leave them turned off for a while, the charge on the other parts may drain to zero, leaving the craft uncontrollable.\u003C/p\u003E\n"},{"CreatedByName":"Peder","CreatedById":57860,"CreatedDateTime":"2013-04-29T01:07:03Z","Content":"\n\u003Cp\u003EIm not aware how you build the rocket, but if you have used \u0022docking\u0022 /ports/. Then you need to be aware that docking ports/modules as standard share fuel.\u003C/p\u003E\u003Cp\u003ESo maybe the engines that first fire and burn, suck out all of the fuel from the top of the rocket. So when you try to fire the step 2, you are actual out of fuel... It is just a guess since we cannot see the rocket your build.\u003C/p\u003E\u003Cp\u003E( right click the docking port and choose disable crossfeed ).\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-04-29T01:38:53Z","Content":"\n\u003Cp\u003EIf you\u0027re using jet engines, they\u0027ll flameout in space, and if you\u0027re using a probe, It may be running out of electricity. You don\u0027t give us a lot of information...\u003C/p\u003E\n"},{"CreatedByName":"Laphtiya","CreatedById":61211,"CreatedDateTime":"2013-04-29T13:52:32Z","Content":"\n\u003Cp\u003EMake sure you have the engine ignition in the same stage as the separation of the old part and make sure you\u0027re throttled up (I am assuming you\u0027re maybe using SRBs for your first stage as I do for my probe missions). If it is not this have you set up a fuel share by accident? The original section is not drawing fuel from the other tanks is it?\u003C/p\u003E\n"}]}