{"TopicId":247,"ForumId":16,"TopicTitle":"Attaching Fuel Tanks With Engines","CreatedByName":"JuggernautOfWar","CreatedById":1401,"CreatedDateTime":"2011-07-14T07:36:10Z","PageNum":1,"Articles":[{"CreatedByName":"JuggernautOfWar","CreatedById":1401,"CreatedDateTime":"2011-07-14T07:36:10Z","Content":"\n\u003Cp\u003EYou may attach \u003Cstrong\u003ES\u003C/strong\u003Eolid \u003Cstrong\u003ER\u003C/strong\u003Eocket \u003Cstrong\u003EB\u003C/strong\u003Eoosters to radial decouplers. It makes sense to also attach a liquid fuel tank/engine to a radial decoupler. Why can\u0027t we? Is this unrealistic? I\u0027m pretty sure I\u0027ve seen radial liquid fuel cells before on rocket craft.\u003C/p\u003E\u003Cp\u003EAttached is an example of what I\u0027m talking about.\u003C/p\u003E\n"},{"CreatedByName":"Jarnis","CreatedById":884,"CreatedDateTime":"2011-07-14T09:56:50Z","Content":"\n\u003Cp\u003E...but you can add liquids below solids. So a ring of solids midway up the core stage, then decouplers under them and some liquid fuel tanks \u002B engines below them.\u003C/p\u003E\u003Cp\u003ENot very stable, can rip itself apart, handle with care. Recommended for use only with Kerbals that have submitted a last will \u0026amp; testament on record.\u003C/p\u003E\u003Cp\u003EStill, the simplest construct I have placed on stable orbit consists of a parachute-module-decoupler-liquid tank-liquid-engine \u0027upper stage\u0027 connected to a lower stage with SAS, four fuel tanks and a tri-module with three engines in the bottom spiced with a ring of six solid rocket boosters around the middle of the rocket. Solids give you the oomph to get the whole thing moving and the single \u0027main stage\u0027 with three liquid engines and four fuel tanks gets you to ~30km at which point the light upper stage will get you the needed horizontal velocity with a little bit of fuel to spare for deorbit. Margins are very tight.\u003C/p\u003E\u003Cp\u003EGetting more than that to a stable orbit requires three-stage designs with somewhat convoluted first stages (due to the massive takeoff mass)\u003C/p\u003E\n"},{"CreatedByName":"reissdorf","CreatedById":1093,"CreatedDateTime":"2011-07-14T13:42:41Z","Content":"\n\u003Cp\u003EI was a bit annoyed of not beeing able to attach them, too. So I edited the config.\u003C/p\u003E\u003Cp\u003EJust open the part.cfg in *\\Parts\\fuelTank\\ with notepad and add\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Enode_attach = 0.0, 0.0, -5, 0.0, 0.0, 1.0, 1\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eunder node definitions and change the attachment rules to\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EattachRules = 1,1,1,1,0\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHope that helps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JuggernautOfWar","CreatedById":1401,"CreatedDateTime":"2011-07-14T20:59:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022reissdorf\u0022 data-cite=\u0022reissdorf\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI was a bit annoyed of not beeing able to attach them, too. So I edited the config.\u003C/p\u003E\u003Cp\u003EJust open the part.cfg in *\\Parts\\fuelTank\\ with notepad and add\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Enode_attach = 0.0, 0.0, -5, 0.0, 0.0, 1.0, 1\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eunder node definitions and change the attachment rules to\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EattachRules = 1,1,1,1,0\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHope that helps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh thank you, that will surely come in handy. I wish this bug didn\u0027t exist though. I wonder if the devs will read this?\u003C/p\u003E\n"},{"CreatedByName":"feldopropane","CreatedById":351,"CreatedDateTime":"2011-07-14T21:28:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JuggernautOfWar\u0022 data-cite=\u0022JuggernautOfWar\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOh thank you, that will surely come in handy. I wish this bug didn\u0027t exist though. I wonder if the devs will read this?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethey probably will the devs are real active on the forum \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JuggernautOfWar","CreatedById":1401,"CreatedDateTime":"2011-07-15T01:28:17Z","Content":"\n\u003Cp\u003EAfter more tinkering it seems the ONLY use for the radials are attaching more SRBs. It doesn\u0027t appear to allow any other type of module other than the booster. \u003Cspan\u003EWhat use do these really even have?\u003C/span\u003E SRBs are pretty much only useful for initial liftoff and getting through the denser atmosphere. Once you hit less gravity, friction, etc, liquids are really the only way to go.\u003C/p\u003E\n"},{"CreatedByName":"guerilla_gearhead","CreatedById":341,"CreatedDateTime":"2011-07-15T01:57:25Z","Content":"\n\u003Cp\u003EIt\u0027s useful for getting rid of whatever you attached, hence radial \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Edecoupler\u003C/span\u003E. Sure, you can only attach SRB\u0027s right now but say you have them hooked radially to a bunch of liquid tanks, they liquids burn much longer so once your SRBs burn out you want dump them to lose the extra weight.\u003C/p\u003E\n"},{"CreatedByName":"JuggernautOfWar","CreatedById":1401,"CreatedDateTime":"2011-07-15T22:31:33Z","Content":"\n\u003Cp\u003EYeah I know. The whole point of this thread is to figure out why we can attach SRBs to decouplers but not Engines.\u003C/p\u003E\n"},{"CreatedByName":"reissdorf","CreatedById":1093,"CreatedDateTime":"2011-07-15T22:49:53Z","Content":"\n\u003Cp\u003EIt\u0027s probably because the code isn\u0027t ready yet. I got some quite nice results using my fix, but sometimes it just laggs like hell. \u003C/p\u003E\u003Cp\u003EI\u0027m not sure if it\u0027s collison detection because the node properties are not correct (just copied from the SRB), or if it\u0027s the code that distributes the fuel (it seems to happen sometimes when a center fuel tank without an engine is fueling the engines of the tanks attached to it, if a design shows that error it\u0027s reproducable).\u003C/p\u003E\u003Cp\u003EBut there are some nice designs you can make.\u003C/p\u003E\n"}]}