{"TopicId":24723,"ForumId":16,"TopicTitle":"How to get to duna?","CreatedByName":"Asheron04","CreatedById":60406,"CreatedDateTime":"2013-04-29T19:30:53Z","PageNum":1,"Articles":[{"CreatedByName":"Asheron04","CreatedById":60406,"CreatedDateTime":"2013-04-29T19:30:53Z","Content":"\n\u003Cp\u003EHello everyone. Im not sure if there is a how to already posted for this but im having some issues planning my duna intercept. I always seem to overshoot and cannot get a close enough encounter to get into its soi. And after I do im not sure how or if I should do an aerobrake or just burn retro. Any tips would be appreciated.\u003C/p\u003E\n"},{"CreatedByName":"ThatBum","CreatedById":57405,"CreatedDateTime":"2013-04-29T19:41:40Z","Content":"\n\u003Cp\u003EYou may need to make a second maneuver node at the midpoint between Kerbin and Duna, to correct inclination. \u003C/p\u003E\u003Cp\u003EAlso make sure your phase angles are correct, if you haven\u0027t already. Use this \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ecalculator\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"vencaslac","CreatedById":57518,"CreatedDateTime":"2013-04-29T21:51:53Z","Content":"\n\u003Cp\u003Edo an f5 when you hit the SOI after using that calculator... duna\u0027s atmosphere starts roughly around 40k - it is quite tenuous and will not slow you down much unless you go deep (if your mind\u0027s in the gutter try and dig it out for just a sec) so if you do crash and burn just hit f9 and you can try again... aerobreaking is fun! \u003C/p\u003E\u003Cp\u003EEDIT: let us know how many times you crash into IKE... and how many times it makes you wind up in weird quasi-polar retrograde orbits\u003C/p\u003E\n"},{"CreatedByName":"Asheron04","CreatedById":60406,"CreatedDateTime":"2013-04-29T22:42:50Z","Content":"\n\u003Cp\u003EI have never used the calculator before...ill give it a shot after work. Quicksave is always your friend! Also I have been placing my craft in a 500 km orbit around kerbin to fast forward till duna intercept window. Is this a good practice or is there an easier way of doing it?\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2013-04-29T22:47:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Asheron04\u0022 data-cite=\u0022Asheron04\u0022\u003E\u003Cdiv\u003EI have never used the calculator before...ill give it a shot after work. Quicksave is always your friend! Also I have been placing my craft in a 500 km orbit around kerbin to fast forward till duna intercept window. Is this a good practice or is there an easier way of doing it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPut a probe up to timewarp you to the launch window. Keep your interplanetary craft in low Kerbin orbit.\u003C/p\u003E\n"},{"CreatedByName":"Asheron04","CreatedById":60406,"CreatedDateTime":"2013-04-29T23:58:16Z","Content":"\n\u003Cp\u003EGreat. Thanks for the tips fellas. Ill give it another go later and let you know how it goes!\u003C/p\u003E\n"}]}