{"TopicId":24735,"ForumId":16,"TopicTitle":"Problem with debris","CreatedByName":"greensha","CreatedById":11087,"CreatedDateTime":"2013-04-29T20:24:15Z","PageNum":1,"Articles":[{"CreatedByName":"greensha","CreatedById":11087,"CreatedDateTime":"2013-04-29T20:24:15Z","Content":"\n\u003Cp\u003EI\u0027ve been having a problem with debris... I don\u0027t mind it being up there as it adds a degree of realism. However, it is preventing me from selecting crewed ships as targets for docking. I can select the correct ship in the map screen as a target, but the target ends up being debris in different orbit. I\u0027m not able to delete the debris by selecting it in the map view and then deleting it by hitting the esc key and then ending the mission.\u003C/p\u003E\u003Cp\u003EAny ideas about how to fix my problem?\u003C/p\u003E\u003Cp\u003EThanks, \u003C/p\u003E\u003Cp\u003EAndy\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-04-29T20:31:46Z","Content":"\n\u003Cp\u003EI suggest installing the \u003Ca href=\u0022http://kerbalspaceprogram.com/haystack/\u0022 rel=\u0022external nofollow\u0022\u003EHaystack\u003C/a\u003E mod, it allows you to select induvidual ships/debris. And I know what you mean about debris, I try to deorbit my spent stages, but I never manage it correctly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AceGamer","CreatedById":61925,"CreatedDateTime":"2013-04-29T20:33:19Z","Content":"\n\u003Cp\u003EYou should just be able to end the flight of the debris, works for me.\u003C/p\u003E\n"},{"CreatedByName":"Sovek","CreatedById":57251,"CreatedDateTime":"2013-04-29T21:15:02Z","Content":"\n\u003Cp\u003EBuild rockets with keeping debris to a minimum, I do. Other than that, if you want realism, get the Kerbal Attachment System and start towing things out of orbit. If you want to forgo that, set persistant debris in the settings menu to 0. then go back into your game. this will delete any and all debris.\u003C/p\u003E\n"},{"CreatedByName":"greensha","CreatedById":11087,"CreatedDateTime":"2013-04-30T13:40:12Z","Content":"\n\u003Cp\u003EThe problem is not so much that the debris is in the way... rather there seems to be a bug which prevents me from selecting the correct target ship when debris is present. I can only select the debris and end the mission if I fly a ship close to it and then use the [ and ] keys to select it. I\u0027ll try installing the Haystack mod and see if that helps.\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-04-30T15:03:14Z","Content":"\n\u003Cp\u003EYeah, I think that\u0027s one of the more annoying known bugs with 0.19. I\u0027ve experienced the same problem my own self of late. Only way around it in the vanilla game is to zoom in really close to the target and click its path (not the target itself). Even then that might not work if you\u0027ve got space crap floating around on a path in the same general vicinity.\u003C/p\u003E\n"},{"CreatedByName":"SolarSailor","CreatedById":62439,"CreatedDateTime":"2013-04-30T15:06:17Z","Content":"\n\u003Cp\u003EBasically you have three options:\u003C/p\u003E\u003Cp\u003E- build reusable rockets, or SSTO rockets/spaceplanes.\u003C/p\u003E\u003Cp\u003E- put Sepratrons on your used stages, and set them to retroburn upon separating.\u003C/p\u003E\u003Cp\u003E- shoot them down!\u003C/p\u003E\n"},{"CreatedByName":"GROOV3ST3R","CreatedById":27590,"CreatedDateTime":"2013-04-30T15:10:35Z","Content":"\n\u003Cp\u003EI usually leave persistent debris off. I don\u0027t think my PC could handle a \u0027\u0027realistic\u0027\u0027 amount. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E At the very least I never got to encounter that bug - or it never got me too frustrated.\u003C/p\u003E\n"}]}