{"TopicId":25629,"ForumId":16,"TopicTitle":"4 booster asparagus stage","CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2013-05-05T22:24:12Z","PageNum":1,"Articles":[{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2013-05-05T22:24:12Z","Content":"\n\u003Cp\u003EI saw many Harv\u0027s videos and a asparagus with only 4 boosters on it and it like a asparagus stage then i wonder how did he do it?\u003C/p\u003E\u003Cp\u003Eplease show how to do that:)\u003C/p\u003E\n"},{"CreatedByName":"Pursuedtank","CreatedById":50078,"CreatedDateTime":"2013-05-05T22:31:25Z","Content":"\n\u003Cp\u003EIf you gave a link to it someone could probably work out if there was anything special about it, right now I have no idea what you are talking about.\u003C/p\u003E\n"},{"CreatedByName":"Joe_Bender","CreatedById":60838,"CreatedDateTime":"2013-05-05T23:05:01Z","Content":"\n\u003Cp\u003EI think he is talking about HOCgaming on YouTube.\u003C/p\u003E\u003Cp\u003EThe problem is that Harv has about eight different playlists with over one hundred vids on KSP alone.\u003C/p\u003E\u003Cp\u003EI aint got the time or energy to find that one vid you are talking about.\u003C/p\u003E\u003Cp\u003EPost a link to the vid and you will get your answers.\u003C/p\u003E\n"},{"CreatedByName":"Horn Brain","CreatedById":49626,"CreatedDateTime":"2013-05-06T00:15:54Z","Content":"\n\u003Cp\u003E-snip-\u003C/p\u003E\u003Cp\u003EIf you just want to be able to make a four-booster asparagus-staged lifter, the easiest way (I think) is to make one set of boosters using 2-way symmetry but without the fuel lines, then copy them (hold Alt\u002Bclick on the decoupler) and place the copy on the main stage. You should now have the four boosters. Now, with 2-way symmetry still engaged, link on booster to another, then link the second booster to the main stage using fuel lines. The last thing you must do is make sure that the decouplers fire in the right order, which should be easier since they should appear in groups of two in the staging menu.\u003C/p\u003E\u003Cp\u003EIf that isn\u0027t what you wanted, please try again. Maybe ask someone you know who speaks English well to translate for you so we can understand what it is you want. Alternatively, ask in your native language and maybe we can google translate it/someone here speaks it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-06T08:01:34Z\u0022 title=\u002205/06/2013 08:01  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 6, 2013\u003C/time\u003E by KasperVld\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2013-05-06T00:19:01Z","Content":"\n\u003Cp\u003Ewell... i am chinese\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-05-06T03:09:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ouion\u0022 data-cite=\u0022ouion\u0022\u003E\u003Cdiv\u003Ewell... i am chinese\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOP don\u0027t worry about it, this is help and how to. You\u0027re not expected to have perfect spotless spelling or grammar. All we ask is that you try. I don\u0027t think anyone intended to be rude. But anyhow, to answer your question is pretty simple actually.\u003C/p\u003E\u003Cp\u003EOkay, so it sounds like you have a bit of understanding of how asparagus staging works. You just have all the engines feed from an outer stage, when it\u0027s empty, stage, then feed from the next, and the next and so on as it goes. \u003C/p\u003E\u003Cp\u003EUSUALLY I\u0027ve seen asparagus set up with 2x symmetry, copied three times to create a 6-booster rocket. You can\u0027t just have 6x symmetry because you wouldn\u0027t be able to place the fuel lines correctly. Here\u0027s some GENERAL rules of how you want to do asparagus staging, and I hope you\u0027ll be able to expand on the basics...\u003C/p\u003E\u003Cp\u003E1) How many tanks do you want to DROP in each stage as they burn out?\u003C/p\u003E\u003Cp\u003E2) Set your symmetry to that level. \u003C/p\u003E\u003Cp\u003E3) Design what your side boosters will look like. Add struts if and where necessary.\u003C/p\u003E\u003Cp\u003E4) How many total tanks do you want? (Must be some multiple of the number that you drop.)\u003C/p\u003E\u003Cp\u003E5) Copy your base-symmetrical set of tanks the multiple of the number of tanks you want to have total. (Say, if you want 6 tanks and you have a set of two, copy them three times.)\u003C/p\u003E\u003Cp\u003E6) Which symmetrical set of tanks do you want to drop first?\u003C/p\u003E\u003Cp\u003E7) Which symmetrical set of tanks do you want to drop next?\u003C/p\u003E\u003Cp\u003E8) Connect a fuel line FROM the previous (first, if you\u0027re just starting to line out fuel lines) tanks TO the next ones in the staging sequence.\u003C/p\u003E\u003Cp\u003E9) Repeat from step 7 until you have fuel lines leading to the tank JUST BEFORE the symmetrical set that you started lining out fuel lines from.\u003C/p\u003E\u003Cp\u003E10) From this last set of tanks, just run fuel lines FROM them TO the center stack.\u003C/p\u003E\u003Cp\u003E11) Set up staging sequence as appropriate.\u003C/p\u003E\u003Cp\u003EJust try to apply that to basically two sets of two tanks. \u003C/p\u003E\u003Cp\u003EHere\u0027s a horribly simple way/rule for your specific circumstance that might even be too simple:\u003C/p\u003E\u003Cp\u003ELook at your rocket from the top down. If the fuel lines look like a \u0022Z\u0022 and lead from (arrows point from) the first/next tanks to be staged to the center stack, you\u0027re good. Just set up your staging.\u003C/p\u003E\u003Cp\u003EYou can\u0027t just set symmetry to the number of tanks you want total, it just won\u0027t work. But, have fun. Try it out and hopefully I didn\u0027t just ramble on for a few minutes there..\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-05-06T08:08:56Z","Content":"\n\u003Cp\u003EHere\u0027s also an image about how it works: \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kh7BN.png\u0022 alt=\u0022kh7BN.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2013-05-06T08:48:12Z","Content":"\n\u003Cp\u003EI love this community. Someone asks a newbie question and people give an answer, rather than calling them a noob.\u003C/p\u003E\u003Cp\u003ETo add to what KasperVld said (or had a picture of), you want 4 boosters, so you would want the same as the Asparagas diagram with 4 stages, just drop the S4 tanks/engines and move the S3 stage to the center so it\u0027s right angles to S2. The fuel pipes from S3 to S2 remain the same.\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-05-06T22:17:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KasperVld\u0022 data-cite=\u0022KasperVld\u0022\u003E\u003Cdiv\u003EHere\u0027s also an image about how it works: \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003E/snip/\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, that\u0027s the image I was going to go and try to find, but somehow typing a wall of text is less effort.. Funny how that works haha.\u003C/p\u003E\n"},{"CreatedByName":"Sethnizzle","CreatedById":22985,"CreatedDateTime":"2013-05-07T04:55:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022M5000\u0022 data-cite=\u0022M5000\u0022\u003E\u003Cdiv\u003EOP don\u0027t worry about it, this is help and how to. You\u0027re not expected to have perfect spotless spelling or grammar. All we ask is that you try. I don\u0027t think anyone intended to be rude. But anyhow, to answer your question is pretty simple actually.\u003Cp\u003EOkay, so it sounds like you have a bit of understanding of how asparagus staging works. You just have all the engines feed from an outer stage, when it\u0027s empty, stage, then feed from the next, and the next and so on as it goes. \u003C/p\u003E\u003Cp\u003EUSUALLY I\u0027ve seen asparagus set up with 2x symmetry, copied three times to create a 6-booster rocket. You can\u0027t just have 6x symmetry because you wouldn\u0027t be able to place the fuel lines correctly. Here\u0027s some GENERAL rules of how you want to do asparagus staging, and I hope you\u0027ll be able to expand on the basics...\u003C/p\u003E\u003Cp\u003E..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m confused at why you say you wouldn\u0027t be able to do the fuel lines correctly... Every time I do asparagus staging I just use symmetry to add my rockets. Then when I go to attach the fuel lines if the symmetry changes to whatever symmetry was used for the rockets when you hover the fuel line over a rocket, I just press \u0022X\u0022 and it will set the symmetry for the fuel line back to x1. You\u0027re still adding the fuel lines one at a time, but it saves you time adding your rockets and makes sure all the rockets are symmetrical.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-05-07T05:57:31Z","Content":"\n\u003Cp\u003EHe\u0027s talking about HOCGaming\u0027s That\u0027s no moon community base series. He uses user submitted ships to build a mun base near the Neil Amstrong memorial. Harv (HOCgaming) always uses the same lifter: An asparagus staged booster with mainsails. He uses two times symmetry to place each pair of boosters, and then proceeds to place the fuel lines and struts.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-07T11:26:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sethnizzle\u0022 data-cite=\u0022Sethnizzle\u0022\u003E\u003Cdiv\u003EI\u0027m confused at why you say you wouldn\u0027t be able to do the fuel lines correctly... Every time I do asparagus staging I just use symmetry to add my rockets. Then when I go to attach the fuel lines if the symmetry changes to whatever symmetry was used for the rockets when you hover the fuel line over a rocket, I just press \u0022X\u0022 and it will set the symmetry for the fuel line back to x1. You\u0027re still adding the fuel lines one at a time, but it saves you time adding your rockets and makes sure all the rockets are symmetrical.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI do this to, benefit is that all the boosters are aligned perfectly and you only has to strut one booster. \u003C/p\u003E\u003Cp\u003EDownside is that you has to add fuel lines one and one and sort out decoplers and seperatrons manualy.\u003C/p\u003E\n"}]}