{"TopicId":26208,"ForumId":16,"TopicTitle":"Do g-forces significantly effect thrust-to-weight ratio?","CreatedByName":"GibLit","CreatedById":63061,"CreatedDateTime":"2013-05-09T22:13:07Z","PageNum":1,"Articles":[{"CreatedByName":"GibLit","CreatedById":63061,"CreatedDateTime":"2013-05-09T22:13:07Z","Content":"\n\u003Cp\u003EI checked everywhere for solid confirmation on this and found nothing. I\u0027m just wondering if g-forces exerted on a spacecraft due to acceleration have any effect on the craft\u0027s thrust-to-weight ratio, even in a vacuum. So for example, if a craft is experiencing 10g, it would make it 10 times heavier, meaning it would require 10 times the thrust to propel it at the same rate of velocity as its original weight at 1g. Is there any truth to this?\u003C/p\u003E\u003Cp\u003EI\u0027ve noticed in KSP that it\u0027s more fuel efficient between takeoff and orbit to throttle down sometimes in order to keep a craft at 2g or under (within the green on the g meter). Is that strictly because of atmospheric drag, or does gravity have something to do with it?\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2013-05-10T06:45:24Z","Content":"\n\u003Cp\u003ENo your craft dosent become 10 times heavier under 10g...it\u0027s just that the pressure on everything in and on the craft increeses 10 times under 10g...the total mass and thus the thrust needed to moves said mass remains the same.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-10T07:02:51Z","Content":"\n\u003Cp\u003EIn order to be more efficient while throttling down you most likely have a TWR of over 3. Anything less and you will probably not be getting anywheres near terminal velocity. \u003C/p\u003E\u003Cp\u003EA good indicator (if you aren\u0027t using mechjeb) to know if you need to throttle down is if you are getting re-entry effect during your ascent. Below 10,000m if you have the white trails and above 10km the fire then yes, you can be more efficient by throttling down. I\u0027m not sure if it was intentional but the speed at which those start IS terminal velocity.\u003C/p\u003E\n"},{"CreatedByName":"Nachtengel","CreatedById":65278,"CreatedDateTime":"2013-05-10T07:06:01Z","Content":"\n\u003Cp\u003Eyou have the logic a bit backwards, its actually the thrust to weight ratio that determines the G forces, change in acceleration causes the perceived effect of increased gravity, think of going up or down in an elevator. you do not get physically lighter or heavier, but for the moment the elevator starts, you feel it. just for a second. g and gravity are not the same thing, gravity is consistent (not constant, but its a function of distance nothing else) and your spacecraft will have the same acceleration exerted on it no matter what its doing. g is a designation for perceived weight, or the change in inertia. it is confusingly termed in amounts of gravities at earths surface. but nothing more. change in g force simply is a different method of saying you are accelerating faster.\u003C/p\u003E\u003Cp\u003Ein much the same way that we dont use meters for space distances (AU instead) we use g for accelerations, because it gets silly when talking about such large numbers, so a new system was invented to describe it.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-10T07:39:16Z","Content":"\n\u003Cp\u003EOne problem with high trust is that it might cause structural faults. main example is telescoping main stage during circulating orbit. as the stage is almost empty and have an huge mainsail it causes an high g-force, this might get the rocket to collapse. as with 5g the cargo is pushing 5 times as hard on the main stage than it did at the pad.\u003C/p\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2013-05-10T07:48:19Z","Content":"\n\u003Cp\u003ETo be precise I should be thrust-to-\u003Cem\u003Emass\u003C/em\u003E-ratio. Because the mass stays the same even with different acceleration. Acceleration doesn\u0027t effect this. :-)\u003C/p\u003E\n"},{"CreatedByName":"superm18","CreatedById":57755,"CreatedDateTime":"2013-05-10T07:52:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crown\u0022 data-cite=\u0022Crown\u0022\u003E\u003Cdiv\u003ETo be precise I should be thrust-to-\u003Cem\u003Emass\u003C/em\u003E-ratio. Because the mass stays the same even with different acceleration. Acceleration doesn\u0027t effect this. :-)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eexactly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Francesco","CreatedById":58274,"CreatedDateTime":"2013-05-10T07:52:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003EA good indicator (if you aren\u0027t using mechjeb) to know if you need to throttle down is if you are getting re-entry effect during your ascent. Below 10,000m if you have the white trails and above 10km the fire then yes, you can be more efficient by throttling down. I\u0027m not sure if it was intentional but the speed at which those start IS terminal velocity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Enot true: you need to be travelling at almost two times the terminal velocity at that altitude to see mach effects appear.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-10T08:53:19Z","Content":"\n\u003Cp\u003EI watch the terminal velocity indicator like a hawk during launches of my high TWR jet aircraft, and while I am not positive about the effect below 10km being present at terminal velocity I can confirm it as near fact that above 10km the re entry effect Does happen AT terminal velocity, because up there I ride that speed all the way up to 40km altitude and the effect comes and goes as my speed catches up with TV and then drops behind it slightly.\u003C/p\u003E\n"},{"CreatedByName":"korda","CreatedById":9114,"CreatedDateTime":"2013-05-10T11:56:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Crown\u0022 data-cite=\u0022Crown\u0022\u003E\u003Cdiv\u003ETo be precise I should be thrust-to-\u003Cem\u003Emass\u003C/em\u003E-ratio. Because the mass stays the same even with different acceleration. Acceleration doesn\u0027t effect this. :-)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI may be wrong here, but isn\u0027t it TWR when gravity comes to play? You can have excellent thrust-to-mass-ratio and still you can\u0027t get off planet with stronger g-force since you have bad thrust-to-\u003Cstrong\u003Eweight\u003C/strong\u003E-ratio.\u003C/p\u003E\n"},{"CreatedByName":"transcendentape","CreatedById":58072,"CreatedDateTime":"2013-05-10T12:06:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022korda\u0022 data-cite=\u0022korda\u0022\u003E\u003Cdiv\u003EI may be wrong here, but isn\u0027t it TWR when gravity comes to play? You can have excellent thrust-to-mass-ratio and still you can\u0027t get off planet with stronger g-force since you have bad thrust-to-\u003Cstrong\u003Eweight\u003C/strong\u003E-ratio.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPrecisely. Rather than assuming the terminology in use for years is incorrect, it may be helpful to first consult basic reference resources like wikipedia. It\u0027s called \u003Ca href=\u0022https://en.wikipedia.org/wiki/Thrust_to_weight_ratio\u0022 rel=\u0022external nofollow\u0022\u003Ethrust-to-weight\u003C/a\u003E ratio for a reason.\u003C/p\u003E\n"},{"CreatedByName":"transcendentape","CreatedById":58072,"CreatedDateTime":"2013-05-10T12:34:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GibLit\u0022 data-cite=\u0022GibLit\u0022\u003E\u003Cdiv\u003EI checked everywhere for solid confirmation on this and found nothing. I\u0027m just wondering if g-forces exerted on a spacecraft due to acceleration have any effect on the craft\u0027s thrust-to-weight ratio, even in a vacuum. So for example, if a craft is experiencing 10g, it would make it 10 times heavier, meaning it would require 10 times the thrust to propel it at the same rate of velocity as its original weight at 1g. Is there any truth to this?\u003Cp\u003EI\u0027ve noticed in KSP that it\u0027s more fuel efficient between takeoff and orbit to throttle down sometimes in order to keep a craft at 2g or under (within the green on the g meter). Is that strictly because of atmospheric drag, or does gravity have something to do with it?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure why you\u0027re finding throttling down to be more efficient. It likely may be drag, or wobbly rocket construction, or too much gimbal. TWR does not decrease as acceleration increases, unless the acceleration is due to gravity. Thrust to weight ratio is simply what it states, and so is directly proportional to thrust and inversely proportional to weight (mass times acceleration due to gravity). The weight of the rocket does not change under acceleration. If you could imagine putting an accelerating rocket on some fantastic contraption that could match its acceleration and not burn up in order to weigh it, the rocket would not weigh any more than it does at rest.\u003C/p\u003E\u003Cp\u003EObjects \u003Cem\u003Einside\u003C/em\u003E the rocket do weigh more, since the rocket is accelerating and pushing against them, applying a force which is indistinguishable from gravity. So twr does change for a rocket \u003Cem\u003Einside\u003C/em\u003E the accelerating rocket. For instance, say you constructed a situation where a kerbal had a jetpack with twr ratio of 1.5 inside of a rocket accelerating at 2g. Now, because the rocket is pushing against our jetpack kerbal at twice g, his effective twr is cut in half, and at a twr of 0.75, he won\u0027t be able to lift off of the floor.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-10T13:51:04Z","Content":"\n\u003Cp\u003EAnd here\u0027s another theory of relativity debate! Did you know if your on a train traveling at the speed of light, and you turn the headlight on on the front, the light will not go farther ahead of you?\u003C/p\u003E\n"},{"CreatedByName":"transcendentape","CreatedById":58072,"CreatedDateTime":"2013-05-10T13:55:50Z","Content":"\n\u003Cp\u003EWe are not even remotely dealing with relativistic speeds here\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-10T14:07:01Z","Content":"\n\u003Cp\u003EI know, it was somewhat of a joke.. But it brings up another debate I haven\u0027t had in years about objects disconnected from the vessel which thrust is being applied to, while still inside of it then applying directional force.. Say the kerbal in the rocket uses his jet pack with its 0.75 twr then jumps up off the floor which is now easy since 25% of his weight is carried by the pack. He\u0027s now inside the rocket disconnected from it, does his pack now have a higher twr relative to what it had while it was a part of the rocket?\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-05-10T14:25:17Z","Content":"\n\u003Cp\u003EAssuming that there is air inside the rocket then he\u0027s not really disconnected from it.\u003C/p\u003E\n"},{"CreatedByName":"transcendentape","CreatedById":58072,"CreatedDateTime":"2013-05-10T14:46:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003ESay the kerbal in the rocket uses his jet pack with its 0.75 twr then jumps up off the floor which is now easy since 25% of his weight is carried by the pack. He\u0027s now inside the rocket disconnected from it, does his pack now have a higher twr relative to what it had while it was a part of the rocket?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAssuming the rocket the kerbal is in does not change its acceleration, no. The presence or absence of air in the rocket is irrelevant. The kerbal\u0027s jetpack provides .75g of thrust as measured inside the rocket, and the kerbal makes a leap into the air similar to you jumping off of the ground. The effective gravitational force (my term, not sure what the correct term to use here is) which includes both the gravitational force felt by the rocket and the pseudo-gravitational force due to acceleration of the rocket has not changed any more than you jumping changes the gravitational force you feel on Earth.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-10T14:51:32Z\u0022 title=\u002205/10/2013 02:51  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 10, 2013\u003C/time\u003E by transcendentape\u003C/strong\u003E\n\u003Cbr\u003Echanged rocket pack to jetpack to avoid confusion\n\u003C/span\u003E\n"},{"CreatedByName":"korda","CreatedById":9114,"CreatedDateTime":"2013-05-10T15:09:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003EI know, it was somewhat of a joke.. But it brings up another debate I haven\u0027t had in years about objects disconnected from the vessel which thrust is being applied to, while still inside of it then applying directional force.. Say the kerbal in the rocket uses his jet pack with its 0.75 twr then jumps up off the floor which is now easy since 25% of his weight is carried by the pack. He\u0027s now inside the rocket disconnected from it, does his pack now have a higher twr relative to what it had while it was a part of the rocket?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo his TWR is same, at least the one measured \u003Cstrong\u003Erelative to rocket\u003C/strong\u003E. His acceleration can be measured relative to rocket - while he can accelerate very fast relative to Kerbin, he will still \u0022fall\u0022 back to floor in rocket (since he has too low \u0022local\u0022 TWR on rocket).\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EBtw, we are actually heading straight to Einstein theory. His thought process included something similar to what we are talking about - similarity of acceleration and gravity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-10T15:22:31Z\u0022 title=\u002205/10/2013 03:22  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 10, 2013\u003C/time\u003E by korda\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2013-05-10T16:03:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GibLit\u0022 data-cite=\u0022GibLit\u0022\u003E\u003Cdiv\u003EI\u0027ve noticed in KSP that it\u0027s more fuel efficient between takeoff and orbit to throttle down sometimes in order to keep a craft at 2g or under (within the green on the g meter). Is that strictly because of atmospheric drag, or does gravity have something to do with it?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen launching in an atmosphere, drag is definitely an issue, though the problem decreases with altitude/atmospheric density. I don\u0027t know of a magic formula for finding the speed which keeps you from hitting the drag wall, but a little experimentation with different throttle settings will give you a clue. I did a video test of this problem, which you can see \u003Ca href=\u0022https://youtu.be/YZ-wvb2QPRw\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EOn airless worlds, I believe there\u0027s no benefit to throttling back, though. The sooner you\u0027re clear of the high gravity regions, the better. \u003C/p\u003E\u003Cp\u003EI don\u0027t know if there is any sort of efficiency loss with higher throttle settings in the engine simulation code, perhaps there is.\u003C/p\u003E\u003Cp\u003EPS Results will vary greatly, depending upon the rocket and the world you\u0027re launching from, obviously.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-10T16:07:28Z\u0022 title=\u002205/10/2013 04:07  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 10, 2013\u003C/time\u003E by pebble_garden\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cal\u0026#039;Mihe","CreatedById":65567,"CreatedDateTime":"2013-05-10T16:42:09Z","Content":"\n\u003Cp\u003EI don\u0027t think the engines have an effiency loss based on throttle setting, the rocket motors for sure don\u0027t. The jet engines shouldn\u0027t either, they are instead affected by both altitude and velocity.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-10T18:14:13Z","Content":"\n\u003Cp\u003E\u0022Weight\u0022 is a measure of the force exerted by a mass in the local gravity, so yes, if the local gravity is higher, the ship weighs more, and its T/W is reduced. However, the G meter on the navball is not measureing weight, and instead measures acceleration in earth-gravity-equivalents, and its reading sums acceleration due to both gravity and thrust. So during launch on Kerbin, the increase in G reading you\u0027re seeing has nothing to do with gravity (which is actually getting slowly weaker as you get farther from the mass of Kerbin), but is rather a measure of how hard the engines are pushing the ship. The fuel wastage you\u0027re seeing is due to air resistence rather than gravity, so you wouldn\u0027t need to throttle down like that around vacuum worlds, but it does save fuel in atmosphere to prevent your ship from exceeding the terminal velocity at that altitude. \u003C/p\u003E\u003Cp\u003EAnd the throttle setting has no impact upon the ISP of KSP engines. It used to, but that was fixed a couple of versions ago.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-05-10T18:55:51Z","Content":"\n\u003Cp\u003ETo put it yet another way: Your thrust-to-weight ratio measures the ratio of the force your engines exert in pushing the rocket (\u0022thrust\u0022) against the force that gravity exerts trying to pull your rocket back down to the surface (\u0022weight\u0022). If the resulting number is less than 1, then you are not going into space today. G-forces are just another way to measure the acceleration your rocket experiences relative to acceleration due to gravity at Kerbin\u0027s surface.\u003C/p\u003E\n"},{"CreatedByName":"Endoric","CreatedById":64478,"CreatedDateTime":"2013-05-10T19:09:07Z","Content":"\n\u003Cp\u003Ehere are a few questions on this topic.....\u003C/p\u003E\u003Cp\u003Ei heard TWR at launch is most efficent at 2.2. is that correct?\u003C/p\u003E\u003Cp\u003Ewhat should my TWR be once in space?\u003C/p\u003E\u003Cp\u003Ewhat should my TWR be at different altitudes?\u003C/p\u003E\u003Cp\u003Ealso on terminal velocity: should i not exceed the speed given in the list i found on the wiki at each given altitude mark? i also notice mechjeb differs slightly when using an auto accent.\u003C/p\u003E\u003Cp\u003Eis mechjeb more efficent than a good pilot during accent?\u003C/p\u003E\u003Cp\u003Eis mechjeb more efficent during the gravity turn?\u003C/p\u003E\u003Cp\u003Etanks!\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-05-10T19:50:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Endoric\u0022 data-cite=\u0022Endoric\u0022\u003E\u003Cdiv\u003Ei heard TWR at launch is most efficent at 2.2. is that correct?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what I use, and it\u0027s at least approximately correct. You might have to throttle down a little bit as you\u0027re burning off fuel, however, since otherwise your thrust is constant but your weight is decreasing.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Endoric\u0022 data-cite=\u0022Endoric\u0022\u003E\u003Cdiv\u003Ewhat should my TWR be once in space?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you\u0027re in orbit, TWR doesn\u0027t matter much, as it all comes down to patience. I usually try to avoid going below 10 m/s accel for normal craft, and 2 m/s for big craft going a long way. For example, a transfer orbit to Duna takes about 1000 m/s of acceleration. With 10 m/s, that\u0027s 100 seconds, which is bearable. at 2 m/s, it takes 500 seconds, or a bit over 8 minutes, which can get annoying. At that rate, an Eeloo transfer orbit would take over 15 minutes.\u003C/p\u003E\u003Cp\u003ENow, something to be aware of is that if you\u0027re using a low acceleration craft, it\u0027s quite possible to find yourself spending so little time in the SoI of a celestial object that you can\u0027t achieve an orbit before leaving the SoI. Two pieces of advice on that. First is to enter the SoI as precisely as possible. Not only do you have more time within the SoI to change your velocity, but you also benefit more from the Oberth effect. Second, sometimes even with that, you need to start matching velocity with the celestial object before you enter that object\u0027s SoI.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Endoric\u0022 data-cite=\u0022Endoric\u0022\u003E\u003Cdiv\u003Ewhat should my TWR be at different altitudes?\u003C/div\u003E\u003C/blockquote\u003E I try to maintain a 2.2 TWR from launch until I hit the apoapsis. I don\u0027t mind circularizing with a TWR of 1.0 or so, but I prefer at least a 2.0 even at that point, as it makes getting a circular orbit easier since you don\u0027t have to burn as much before and after apoapsis.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Endoric\u0022 data-cite=\u0022Endoric\u0022\u003E\u003Cdiv\u003Ealso on terminal velocity: should i not exceed the speed given in the list i found on the wiki at each given altitude mark? i also notice mechjeb differs slightly when using an auto accent.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGenerally a good idea to keep it in that general area.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Endoric\u0022 data-cite=\u0022Endoric\u0022\u003E\u003Cdiv\u003Eis mechjeb more efficent than a good pilot during accent?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMJ is pretty good on some craft, and pretty bad on others, it really depends. A very good pilot will always match or beat MJ, however. Where MJ wins is in consistency. While I might occasionally have a very good or very bad launch with a specific vehicle, MJ will almost always have very little variation, which is kind of nice if you\u0027re testing small changes in a craft. Large changes don\u0027t give as accurate a result, as you can more easily be making the ship fit MJ\u0027s launch profile.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Endoric\u0022 data-cite=\u0022Endoric\u0022\u003E\u003Cdiv\u003Eis mechjeb more efficent during the gravity turn?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgain, it\u0027s not bad, but I find I can usually do a bit better after some practice with the specific craft in question, since they all behave a little differently.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-05-10T19:53:14Z","Content":"\n\u003Cp\u003EIn space, as long as you can complete a burn before the celestial motion window passes, T/W doesn\u0027t matter. That\u0027s why ion engines are sufficient to get small ships to distant places, and why the efficiency of LV-Ns is more important than their pitiful thrust. I\u0027ll leave your other questions to the numbers experts, but that takeoff T/W and terminal velocity numbers are at least reasonable.\u003C/p\u003E\n"}]}