{"TopicId":26261,"ForumId":16,"TopicTitle":"Ship veering sharply at takeoff, even at low speeds","CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2013-05-10T13:38:57Z","PageNum":1,"Articles":[{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2013-05-10T13:38:57Z","Content":"\n\u003Cp\u003EI\u0027m completely confused by this, I\u0027ve literally tried everything I can possibly think of to fix it and no matter what I do, the ship veers to the left during take off. Always the left. High speed, low speed, just rolling with ion engines. I\u0027ve looked over every piece, I can\u0027t find any asymmetry. I\u0027ve tried moving pieces to adjust weight, etc... but no joy. I even built a custom truss for the wheels, aligning them in default space -before- placing them on the ship to ensure they were absolutely 100% lined up. Nothing. So please, can someone take a look at this? I honestly don\u0027t care if it can fly, I just want to know why it can\u0027t move forwards ten feet without turning. There\u0027s only two possibilities that I can see, I\u0027m and idiot or it\u0027s a bug. I\u0027ll accept either one, but I have to get a second opinion before I tear my hair out.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i109.photobucket.com/albums/n48/Hyomoto/screenshot93_zps6d39d752.jpg\u0022 alt=\u0022screenshot93_zps6d39d752.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0B_0QFdEFWqr8clo4bVk2SU1iaDQ/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003ECraft File\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0B_0QFdEFWqr8VlRDazgydGU0cW8/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EUnmodded .craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe original uses \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-4-kspx-parts-expansion/\u0022 rel=\u0022external nofollow\u0022\u003EKSPX pack\u003C/a\u003E and \u003Ca href=\u0022http://kerbalspaceprogram.com/improved-trusses-0-18-robaus-warehouse/\u0022 rel=\u0022external nofollow\u0022\u003ERW Improved Trusses and Girders\u003C/a\u003E. The unmodded one has the same problem but no modded pieces.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-11T01:38:02Z\u0022 title=\u002205/11/2013 01:38  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 11, 2013\u003C/time\u003E by Hyomoto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-10T13:45:25Z","Content":"\n\u003Cp\u003EI\u0027ll give it a shot when I get home in an hour, but I\u0027ll say this now, it looks pretty cool \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t have FAR however, I\u0027ll get it in the air without it, and if it still doesn\u0027t work for you it\u0027s beyond me lol\u003C/p\u003E\n"},{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2013-05-10T13:54:57Z","Content":"\n\u003Cp\u003EUnfortunately without that custom strut, I can\u0027t load the craft file. Could you save a version with only stock parts?\u003C/p\u003E\n"},{"CreatedByName":"Cal\u0026#039;Mihe","CreatedById":65567,"CreatedDateTime":"2013-05-10T16:20:30Z","Content":"\n\u003Cp\u003EWithout knowing precisely how FAR handles a plane like that (looks cool by the way!) I would guess that it might be the moveable winglets that you are using for rudders that cause it grief. Try maybe replacing them with a more traditional fixed rudder with attached control surface ?\u003C/p\u003E\n"},{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2013-05-10T18:10:21Z","Content":"\n\u003Cp\u003ESo here\u0027s a thought. Do you have a joystick plugged into your computer? I found that even if I wasn\u0027t using the stick to fly my KSP aircraft, any stick deflection would affect the plane\u0027s control surfaces. Long shot, but hey.\u003C/p\u003E\u003Cp\u003EOr perhaps your input device (if you\u0027re using one) needs to be calibrated?\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-05-10T20:10:18Z","Content":"\n\u003Cp\u003EIf you are veering during takeoff, that\u0027s a landing gear problem. What it means is that, at some point during your takeoff, all of the weight of your craft is balanced on your single front gear. Jebediah is not a very good unicyclist, so you fall over. The reason you always fall left is due floating point precision errors in the game; you are never perfectly balanced even if everything is absolutely symmetric.\u003C/p\u003E\u003Cp\u003EThere are several possible way to fix this, depending on exactly what is causing the weight shift during takeoff. If it\u0027s an angle of attack issue, try a tripod arrangement with two gear up front and one in the back. If it\u0027s a center-of-lift versus center-of-mass issue, adjust your center of lift. If it\u0027s simply that your rear end wants to take off first, adjust your trim before launch.\u003C/p\u003E\n"},{"CreatedByName":"SecondGuessing","CreatedById":62686,"CreatedDateTime":"2013-05-10T20:26:43Z","Content":"\n\u003Cp\u003EIt seems like the issue very well might be that you\u0027ve design the plane to look good but not paid much attention to actual aerodynamics. I can\u0027t load it due the mod parts, so could you upload an image with a view of the landing gear and one with a view of the centers of mass, thrust and lift?\u003C/p\u003E\n"},{"CreatedByName":"42undead2","CreatedById":47664,"CreatedDateTime":"2013-05-10T20:35:25Z","Content":"\n\u003Cp\u003EWhat I think I can see is some turned landing gear.\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-05-10T21:03:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u002242undead2\u0022 data-cite=\u002242undead2\u0022\u003E\u003Cdiv\u003EWhat I think I can see is some turned landing gear.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point. It does look like the front gear is turned to the left a bit. Can\u0027t load the plane to find out for sure without the mods though.\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2013-05-11T01:37:12Z","Content":"\n\u003Cp\u003EYou guys, I\u0027m an ass. Of course I\u0027ll do that. Honestly I was so frustrated I didn\u0027t even consider that I had modded pieces, and I\u0027m really sorry for not mentioning that. It\u0027s the \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-4-kspx-parts-expansion/\u0022 rel=\u0022external nofollow\u0022\u003EKSPX pack\u003C/a\u003E and \u003Ca href=\u0022http://kerbalspaceprogram.com/improved-trusses-0-18-robaus-warehouse/\u0022 rel=\u0022external nofollow\u0022\u003ERW Improved Trusses and Girders\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EHere\u0027s are some screen shots of the bottom and the weight/lift/thrust distribution. Also, I updated the main post with a link to an unmodded file and the two mods used in the regular craft. Thanks for helping me out with this, I\u0027m really sorry to have wasted some of your time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0B_0QFdEFWqr8VlRDazgydGU0cW8/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EUnmodded .craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i109.photobucket.com/albums/n48/Hyomoto/screenshot105_zpsdefd94bd.jpg\u0022 alt=\u0022screenshot105_zpsdefd94bd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i109.photobucket.com/albums/n48/Hyomoto/screenshot93_zps996e04d2.jpg\u0022 alt=\u0022screenshot93_zps996e04d2.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-11T01:52:30Z\u0022 title=\u002205/11/2013 01:52  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 11, 2013\u003C/time\u003E by Hyomoto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cal\u0026#039;Mihe","CreatedById":65567,"CreatedDateTime":"2013-05-11T02:00:32Z","Content":"\n\u003Cp\u003EDownloading now to take it for a spin and see.\u003C/p\u003E\u003Cp\u003EEdit: Ok, it looks like its the front landing gear that is not 100% vertical. On take-off it looks like the front gear buckles ever so slightly, which causes a turn, and on compensating for that, its easy to over compensate and crash it. Its probably caused by having the front gear attached to the seperator, which off-sets it slightly. Try moving the front gear back. Also, I\u0027ve had bad experiences with attaching struts to the land gears, usually that causes the gears to be pushed and pulled in unpredictable ways during take off, leading to crashes. Also, attach the gears directly to the wings, I think you get stability issues with having them attached to a set of struts buried inside the wings.\u003C/p\u003E\u003Cp\u003EI was able to get it up though, once it is airborne it is quite stable and flies nicely, it has a tendency to be jittery in the roll, and the pitch is sluggish, but the Yaw control is excellent. I could touch-back down on the runway at 40 m/s.\u003C/p\u003E\u003Cp\u003EOn a side note, I think you\u0027ll have problems getting it into orbit. The air intakes, while cool-looking, won\u0027t give you enough air at 10k\u002B to enable you to go into orbit.\u003C/p\u003E\u003Cp\u003EEdit Again: What Stochasty says is true, its a balance problem. When holding slightly back during the take-off roll, it is completly stable and stays straight on the runway all the time up to 80m/s where it lifts easily\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-11T02:31:42Z\u0022 title=\u002205/11/2013 02:31  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 11, 2013\u003C/time\u003E by Cal\u0026#39;Mihe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2013-05-11T02:55:28Z","Content":"\n\u003Cp\u003EThanks Stochasty and Cal\u0027Mihe. The technical explanation will certainly help me the most as it is info I can apply to other craft in the future. I\u0027ll give this information a go. I take it, then, Cal\u0027Mihe that you are using a Joystick?\u003C/p\u003E\u003Cp\u003EFollow up question: is that ideal? I have a gamepad I can use, and no lack of disposable income to invest in a joystick. My question is, assuming I absolutely love KSP, is that an investment I should make?\u003C/p\u003E\n"},{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2013-05-11T16:18:26Z","Content":"\n\u003Cp\u003EI was able to take off at 2/3 power and fly, but the plane feels very nose-heavy. I needed a lot of up-elevator to maintain level flight. \u003C/p\u003E\u003Cp\u003EAt full power the plane gets very squirrelly, and there\u0027s a strong pitch-down as if the center of thrust was above the longitudinal axis. I\u0027d shift some things around at the very least. \u003C/p\u003E\u003Cp\u003EAlso having so much wing ahead of the center of mass is probably not helping matters.\u003C/p\u003E\n"},{"CreatedByName":"Rune","CreatedById":52690,"CreatedDateTime":"2013-05-11T16:56:02Z","Content":"\n\u003Cp\u003EWow. That flies? I\u0027m, ashamed at the aerodynamics of KSP. You should \u003Cem\u003Enever\u003C/em\u003E put the center of lift ahead of the center of mass. That is the recipe for an unstable plane.\u003C/p\u003E\u003Cp\u003ERune. \u0022Planes with the center of lift behind the center of mass fly poorly. Planes with the center of mass behind the center of lift fly once.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Cal\u0026#039;Mihe","CreatedById":65567,"CreatedDateTime":"2013-05-12T13:38:02Z","Content":"\n\u003Cp\u003EFor some strange reason his screenshot is not showing the CoL correctly. When I load it into a Vanilla install, then the CoL is properly behind the CoM.\u003C/p\u003E\u003Cp\u003EHyomoto, yep I use a joystick. Cheap old Logitech but it serves me well enough.\u003C/p\u003E\u003Cp\u003EI would say yes depending on if you play flight sims, or play KSP with a strong focus on spaceplanes. You can train yourself to fly flight sims using only keyboard and mouse, but I\u0027d recommend a joystick for the flexibility.\u003C/p\u003E\n"},{"CreatedByName":"miro","CreatedById":58492,"CreatedDateTime":"2013-05-13T09:12:21Z","Content":"\n\u003Cp\u003EI had this problem a while ago, and fixed it by moving the centre of lift closer to the centre of mass. I have no idea how to do that without compromising the glorious beauty of the ship itself. \u003C/p\u003E\u003Cp\u003EI really hope you can make it work, looks stunning. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-08-05T19:46:29Z","Content":"\n\u003Cp\u003ENECROPOSTING //WARNING // NECROPOSTING\u003C/p\u003E\u003Cp\u003EDid you resolve this? My problems have often stemmed from landing gear that were perfectly straight, but attachied to items that moved under the stress of weight even standing still. Use struts either directly on the gear or stabilize the component they\u0027re mounted on. The other thing I have noticed is the wheelbarrow effect which had been mentioned. Either thru aerodynamic forces or just plain old weight, the main gear (the rear tires) must be firmly planted on the pavement.\u003C/p\u003E\u003Cp\u003EI make craft with a \u0022looks first\u0022 mantra such as you, I suppose. I end up editing CFG files. To move your CG aft, you could edit the mass of your engine.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-05T19:52:10Z\u0022 title=\u002208/05/2013 07:52  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 5, 2013\u003C/time\u003E by Guest\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Deejay2000","CreatedById":73422,"CreatedDateTime":"2013-08-06T02:06:20Z","Content":"\n\u003Cp\u003EI don\u0027t think it was necessary to revive this thread. Let it die, the problem has probably been resolved, or the plane has been forgotten/deleted.\u003C/p\u003E\u003Cp\u003E-Deejay\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-08-06T15:07:43Z","Content":"\n\u003Cp\u003EIt was only two months ago. Enlighten me the need for such heavy policing on this site.\u003C/p\u003E\n"}]}