{"TopicId":26515,"ForumId":16,"TopicTitle":"How do I correctly use an ion probe?","CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-05-12T12:17:40Z","PageNum":1,"Articles":[{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-05-12T12:17:40Z","Content":"\n\u003Cp\u003EI\u0027ve spent quite a while trying to make a probe running stock ion engines actually, you know, fly, but the success so far has been minimal. Sure, ion drives as implemented are for tiny, under-one-ton probes. Well, it\u0027s those that I am trying to make work. In particular the kind that start from Kerbin orbit with their ion engines and then go on to, say, Jool, and spin around a few of it\u0027s moons.\u003C/p\u003E\u003Cp\u003EThe biggest problem I\u0027ve been running into is that a stock ion engine probe is constantly running out of power well before it can possibly complete it\u0027s maneuver, and, having limited amounts of solar panels and/or RTGs forces me to cut the throttle, which makes the maneuver even longer, which generally screws everything over. Throwing in enough batteries to last through a maneuver kills the probe\u0027s expected delta-v. Throwing in more xenon to compensate drops max acceleration even further and makes maneuvers take yet longer, as if that wasn\u0027t enough of a problem. Eventually that spirals out of control and results in a probe that is no longer tiny by any means and still doesn\u0027t reliably maneuver.\u003C/p\u003E\u003Cp\u003EAn unexpected discovery that the large Gigantor solar panels actually are less weight-efficient than a large number of OX-4B, which needs to be arranged in a pattern where they don\u0027t cover each other, somewhat helped, but it\u0027s still not enough -- while I\u0027m sure it\u0027s \u003Cem\u003Epossible\u003C/em\u003E to get the probe to do what I want, in theory, using some orbital trickery, doing maneuvers in many small chunks, etc, etc, it\u0027s simply not fun to pilot it, and not worth it, when a comparable -- or even lighter -- quantity of regular rocket fuel and a tiny engine gets the job done better simply because, due to it\u0027s high TWR, maneuvers are completed without energy losses.\u003C/p\u003E\u003Cp\u003EI tried a probe carrier to get a bunch of probes to Jool on LV-N, but the only halfway workable ion probes I did manage to get result in so many individual parts (I had to mount solar panels on cubic struts to reduce mass and squeeze enough in) that a bunch of them makes the ship completely uncontrollable due to lag.\u003C/p\u003E\u003Cp\u003ENo matter how I twist it, it appears to me that stock ion engines consume way too much electric charge for the thrust they do generate.\u003C/p\u003E\u003Cp\u003ECan anyone tell me they have succeeded in sending an ion probe to visit Jool\u0027s moons? More than one moon with the same probe, multiple polar orbits? Stock parts only? How did you fly it?\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-12T12:33:41Z","Content":"\n\u003Cp\u003EI sent a small ion probe to Moho, which is harder to reach than Jool. Here are some pics of the craft: \u003Ca href=\u0022http://imgur.com/a/K1YnZ#0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/K1YnZ#0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFrom your description of your craft, you seem to be on the right path. You need more solar panels if you can\u0027t maintain full throttle. And remember that insolation decreases as you get further away from the sun. A probe to Jool is going to need many more panels than one which stays in the inner solar system.\u003C/p\u003E\u003Cp\u003EBatteries are just dead weight. Leave them at home. Keep one RTG on board if you want to ensure the probe is always under control, but if you have no sunlight you can\u0027t thrust anyway, so what does it matter?\u003C/p\u003E\u003Cp\u003EI would probably plan to aerocapture into Julian orbit, saving you a lot of time and some xenon.\u003C/p\u003E\u003Cp\u003EBut a bigger probe using more conventional propulsion would probably make more sense.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T12:41:54Z\u0022 title=\u002205/12/2013 12:41  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-12T12:37:31Z","Content":"\n\u003Cp\u003EYour second attempt, using lvn\u0027s for the interplanetary burn is the right approach. A single lvn with one flt-800 I think has enough DV to get a 1t probe to jool and capture, BUT. The jool system is so far from the sun that even with 2 gigantor solar arrays you will only be able to run the ion engine at half throttle. If personally not send ions in hat direction, just to the inner planets. This is the probe setup in sending to jool in my exchange thread\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/28431-I-Present-the-Firebat\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/28431-I-Present-the-Firebat\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe thread is really about the launcher. But it carries 4 probes at 0.7 tonnea each to the jool system and delivers them to a pair of other nuclear ssto\u0027s I have there already, which will then in turn place one probe in a polar orbit around each of the four moons and return to laythe. \u003C/p\u003E\u003Cp\u003EDesign is simple. Docking port, battery, scanners, RCs, rtg, and probe core. The RCS is used to adjust their orbits after the larger crafts get them close\u003C/p\u003E\u003Cp\u003EIn closing, ion probes don\u0027t work well the farther away from Kerbol you get\u003C/p\u003E\n"},{"CreatedByName":"Francesco","CreatedById":58274,"CreatedDateTime":"2013-05-12T12:42:41Z","Content":"\n\u003Cp\u003Eyup, solar panels generate half of their power when you are near Jool than when you are near Kerbin.\u003C/p\u003E\u003Cp\u003Ebut I second your question about using ion engines for travelling to outer planets: since you do the escape burn on the dark side of Kerbin, how do you guys manage to do this? batteries, batteries and more batteries?\u003C/p\u003E\u003Cp\u003Eif my math is correct, a 4 minutes periapsis kick consumes 2880 units of electricity at full throttle.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T12:45:18Z\u0022 title=\u002205/12/2013 12:45  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by Francesco\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-05-12T12:43:50Z","Content":"\n\u003Cp\u003EI tried the same as you Mihara, and ran into the same kind of problem. Not enough power to do one continuous burn--\u0026gt;more solar panels--\u0026gt;more xenon--\u0026gt;TWR drops drastically as probe become larger and heavier. Finally i gave up after my last probe ran out of xenon half-way through capture burn into Duna orbit, and ended in solar orbit without a drop of fuel. It might be possible, but surely not efficient - and probe won\u0027t be small and light. Only way around it are mods. There is some adding ion/electric engines with more thrust, or bigger xenon tanks, solar panels etc. Stock? Not really worth the hassle - LFE driven probe would be simpler and more efficient.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-05-12T12:49:31Z","Content":"\n\u003Cp\u003EYours doesn\u0027t have a kethane detector on it, which lets you have more solar panels. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027ve been looking around the mods for solar panels which would be in scale with stock panels in terms of mass and energy output, and somewhere inbetween OX-4 and Gigantor, but with no success so far -- everything is either unrealistically too light or far out of scale in terms of energy output. And I\u0027m banking on aerobraking already, otherwise the probe would simply take too long to get captured.\u003C/p\u003E\u003Cp\u003EThe one other trick I figured out is to incline the Kerbin orbit you start from. This makes no significant difference to interplanetary transfer, but ensures you don\u0027t start your maneuver from Kerbin\u0027s shadow, which can make it impossible to complete in time.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-12T12:56:23Z","Content":"\n\u003Cp\u003EMine actually have both ISA mapsat ANd Kethane scanners on them, tested and working even tho they are clipped ontop of each other. It was the only way i could think of to keep it perfectly balanced while still having a docking port which was also perfectly balanced \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-12T13:13:36Z","Content":"\n\u003Cp\u003EYou need lots of solar panel area, one of the huge ones should be enough most of the time. and yes using the small struts and the panel who point straight out is an good idea 6-10 of them.\u003C/p\u003E\u003Cp\u003EYou don\u0027t need much batteries 2-3 xenon tanks is usual enough. You require less solar panels towards the sun. \u003C/p\u003E\u003Cp\u003EThis should give you an twr on around 0.25-0.2, remember asas to keep this pointed the right way, total weight should be less than a ton. \u003C/p\u003E\u003Cp\u003EIon probes has an slot between the Oscar and ant who give you 1000-1500 m/s for an small probe and a 4 ton nuclear ones. 8000m/s for less than a ton is impressive\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-12T13:26:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mihara\u0022 data-cite=\u0022Mihara\u0022\u003E\u003Cdiv\u003EYours doesn\u0027t have a kethane detector on it, which lets you have more solar panels. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol, what? That makes no difference. The design would have just been slightly different if I had taken one.\u003C/p\u003E\u003Cp\u003EAs to making your transfer injection over the night side, this is a niche case where you may want to consider launching into a retrograde orbit. Orbiting to the west would put your injection over the day side, and a small ion probe will not require a much larger launch vehicle to deliver the extra 350m/sec launching on heading 270 requires.\u003C/p\u003E\n"},{"CreatedByName":"Mihara","CreatedById":59752,"CreatedDateTime":"2013-05-12T13:51:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003EThe thread is really about the launcher. But it carries 4 probes at 0.7 tonnea each to the jool system and delivers them to a pair of other nuclear ssto\u0027s I have there already, which will then in turn place one probe in a polar orbit around each of the four moons and return to laythe.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m nowhere even \u003Cem\u003Enear\u003C/em\u003E sending SSTOs to Laythe. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Like I said, I tried to make a probe carrier for six ion powered, halfway workable ion probes, each at 0.8 for 4600 delta v or so.\u003C/p\u003E\u003Cp\u003EThe thing was way too laggy to fly. I gave up and made a carrier with 8 liquid fuel probes each at 3300 delta v. Much lower part counts on probes, much less pain actually getting them into polar orbit after the carrier drops them as it bounces off the moons, and two spares in case I do mess up.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022magnemoe\u0022 data-cite=\u0022magnemoe\u0022\u003E\u003Cdiv\u003EYou need lots of solar panel area, one of the huge ones should be enough most of the time. and yes using the small struts and the panel who point straight out is an good idea 6-10 of them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuge ones are definitely worse than lots of small ones, they are much heavier for the same amount of charge.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoboRay\u0022 data-cite=\u0022RoboRay\u0022\u003E\u003Cdiv\u003ELol, what? That makes no difference. The design would have just been slightly different if I had taken one.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHey, every kilogram counts. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Not to mention the unwieldy shapes this ends up making.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoboRay\u0022 data-cite=\u0022RoboRay\u0022\u003E\u003Cdiv\u003EAs to making your transfer injection over the night side, this is a niche case where you may want to consider launching into a retrograde orbit. Orbiting to the west would put your injection over the day side, and a small ion probe will not require a much larger launch vehicle to deliver the extra 350m/sec launching on heading 270 requires.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood idea, actually, gotta be better than just inclined.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-12T14:22:51Z","Content":"\n\u003Cp\u003EI was more referencing my method of delivery instead of ion engines. Also, if each of your probes has 3300m/s on its own you can drop some of that fuel, that\u0027s loads too much since your delivering them one at a time at each moon with a carrier type dealie.\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-05-12T15:11:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scotius\u0022 data-cite=\u0022Scotius\u0022\u003E\u003Cdiv\u003EI tried the same as you Mihara, and ran into the same kind of problem. Not enough power to do one continuous burn--\u0026gt;more solar panels--\u0026gt;more xenon--\u0026gt;TWR drops drastically as probe become larger and heavier.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve sent a probe to Jool with two Gigantor, two RTG\u0027s, five fuel tanks, and eight batteries and have been able to do long burns quite easily so long as I\u0027m not in Jool\u0027s shadow.\u003C/p\u003E\u003Cp\u003EThe tricks to ion engines are: Patience. Roll your vehicle so your Gigantors get full sun. Monitor your throttle and resources to minimize your electrical depletion rate. Patience. They\u0027ll get the job done even out at Eeloo, but it\u0027s not \u0022firewall the throttle and done in a minute or two\u0022. Let the game run in the background while you browse the forums. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nyrath","CreatedById":61886,"CreatedDateTime":"2013-05-12T18:14:47Z","Content":"\n\u003Cp\u003EEven in real life, NASA engineers say things like \u003Cem\u003E\u0022The problem with ion drives is that we do not have a long enough extension cord\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003ESolar cell arrays are subject to the inverse-square law, and RTGs or nuclear reactors have too much mass.\u003C/p\u003E\u003Cp\u003EIn real life, some theorists talk about putting titanic kilometer-wide solar power stations in orbit, and having the stations power the ion-drive craft with beamed power.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/infrastructure.php#id--Solar_Power_Stations\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.projectrho.com/public_html/rocket/infrastructure.php#id--Solar_Power_Stations\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-12T18:33:19Z","Content":"\n\u003Cp\u003Ethats a nice concept, and may be an alternative to Ion drives, but it uses H2 rather than Xe\u003C/p\u003E\n"},{"CreatedByName":"foamyesque","CreatedById":2982,"CreatedDateTime":"2013-05-12T18:38:08Z","Content":"\n\u003Cp\u003ELeave from a higher Kerbin orbit. It\u0027ll give you more time to complete your burn, and you\u0027ll be in shadow for a much shorter interval.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-12T18:50:43Z","Content":"\n\u003Cp\u003E\u0022Leave from a higher orbit\u0022 is simply saying \u0022use something other than ion engines for the first part of the trip.\u0022\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-05-12T19:28:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022nyrath\u0022 data-cite=\u0022nyrath\u0022\u003E\u003Cdiv\u003EEven in real life, NASA engineers say things like \u003Cem\u003E\u0022The problem with ion drives is that we do not have a long enough extension cord\u0022\u003C/em\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd that goes triple for VASIMR - it\u0027s a power hog, not the miracle drive it\u0027s sometimes believed to be.\u003C/p\u003E\n"},{"CreatedByName":"Read have Read","CreatedById":60863,"CreatedDateTime":"2013-05-12T22:12:22Z","Content":"\n\u003Cp\u003ESounds like Periapsis Oberth Kicks would be the best way to escape kerbin with Ions.\u003C/p\u003E\u003Cp\u003EPersonally I\u0027ll be retrofitting Ion drives to my KeoStationary Remotetech relays along with larger dishes *because* they are weaker than the Rockomax 24-77 orange radials to perform orbit correction burns. With two 24-77s I have to tell the flight computer to do a 1% burn for 0.5 seconds and I still overshoot the target.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-12T22:18:27Z\u0022 title=\u002205/12/2013 10:18  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 12, 2013\u003C/time\u003E by Read have Read\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-12T22:55:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoboRay\u0022 data-cite=\u0022RoboRay\u0022\u003E\u003Cdiv\u003E\u0022Leave from a higher orbit\u0022 is simply saying \u0022use something other than ion engines for the first part of the trip.\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problem raising orbit from 100 to 500km with ions, before the transfer window. Anyway, an twr of 0.2 is not much worse than an underpowered nuclear ship where 0.4-5 is common. \u003C/p\u003E\u003Cp\u003ELook like the point is to avoid the huge solar arrays, with them you get terrible twr.\u003C/p\u003E\n"},{"CreatedByName":"T3E","CreatedById":66021,"CreatedDateTime":"2013-05-13T08:26:31Z","Content":"\n\u003Cp\u003EHello everyone,\u003C/p\u003E\u003Cp\u003EI dare to abuse this Thread quickly for my own sake:\u003C/p\u003E\u003Cp\u003EQuite new and after i managed to send stuff in the orbit I find this Idea with the probes quite interesting.\u003C/p\u003E\u003Cp\u003EMay I ask where to find the Ion engine? \u003C/p\u003E\u003Cp\u003EAlso I would like to know if theres some necessary \u0022science\u0022 or \u0022utility\u0022 equipment I need? \u003C/p\u003E\u003Cp\u003ESo if possible, hit me up with the MUST HAVE Parts, no need for big explanations, I like to figure it out myself mostly (just a kick start necessary \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E )\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-05-13T09:06:42Z","Content":"\n\u003Cp\u003EIon engine and tank are under utility. Just one of each.\u003C/p\u003E\n"},{"CreatedByName":"Francesco","CreatedById":58274,"CreatedDateTime":"2013-05-13T09:27:32Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/PB-Ion_Electric_Propulsion_System\u0022 rel=\u0022external nofollow\u0022\u003EPB-Ion Electric Propulsion System\u003C/a\u003E a.k.a. ion engine\u003C/p\u003E\u003Cp\u003Ethere are no \u0022must have\u0022 utility parts: a parachute is useful on Kerbin, but totally useless on the Mun.\u003C/p\u003E\u003Cp\u003Ethe only must have parts that I know of are boosters \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}