{"TopicId":27509,"ForumId":16,"TopicTitle":"Way to keep Satellites always facing Kerbin?","CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2013-05-19T03:26:19Z","PageNum":1,"Articles":[{"CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2013-05-19T03:26:19Z","Content":"\n\u003Cp\u003EForgive me if this question has already been asked, not sure exactly what to \u0022search\u0022 for. \u003C/p\u003E\u003Cp\u003EIs there a way to park a satellite in orbit \u0026amp; always have it face Kirbin? \u003C/p\u003E\u003Cp\u003ETB\u003C/p\u003E\n"},{"CreatedByName":"lukerules117","CreatedById":51027,"CreatedDateTime":"2013-05-19T03:32:52Z","Content":"\n\u003Cp\u003Eno but you could land on on the mun\u003C/p\u003E\n"},{"CreatedByName":"maackey","CreatedById":39248,"CreatedDateTime":"2013-05-19T03:45:45Z","Content":"\n\u003Cp\u003EUsing MechJeb or RemoteTech you can set direction to Rad- and the satellite will face the planet as long as you are focused on it. When you switch to another ship you lose all control and it stops turning.\u003C/p\u003E\n"},{"CreatedByName":"Jason Patterson","CreatedById":44388,"CreatedDateTime":"2013-05-19T04:16:50Z","Content":"\n\u003Cp\u003EThe vessels are not considered as extended objects when you are away from them. Instead they are treated as point particles following an idealized orbit through space and their rotation is not calculated. This is good because it keeps the game running smoothly even when you\u0027ve got zillions of missions going, but it\u0027s bad when you\u0027re trying to do something like get a vehicle to face a particular direction consistently.\u003C/p\u003E\u003Cp\u003EFor a real vessel, like the ISS, the ship actually has to rotate constantly with a period that matches its orbital period in order to always keep the same orientation relative to the surface. In exactly the same way our Moon always shows the same face to Earth because it spins at a rate of 1 rotation per orbit.\u003C/p\u003E\n"},{"CreatedByName":"TBryson2","CreatedById":66586,"CreatedDateTime":"2013-05-19T13:24:06Z","Content":"\n\u003Cp\u003EThanks for the replies. The last statement by \u0022James\u0022 is what I was hoping to do (someday). Wasn\u0027t sure if KSP would allow items such as the ISS to keep the same orientation. \u003C/p\u003E\u003Cp\u003ETB\u003C/p\u003E\n"}]}