{"TopicId":27743,"ForumId":16,"TopicTitle":"Wonky control surfaces","CreatedByName":"Hakkonen","CreatedById":66587,"CreatedDateTime":"2013-05-20T16:33:13Z","PageNum":1,"Articles":[{"CreatedByName":"Hakkonen","CreatedById":66587,"CreatedDateTime":"2013-05-20T16:33:13Z","Content":"\n\u003Cp\u003ESo, I\u0027ve decided to start experimenting with spaceplanes, and I notice that control surfaces seem a little wonky. My plane has a pair of delta wings, each with a regular control surface for an aileron, a pair of winglets that tilt up and down to act as elevators, and a tail fin with a small control surface for a rudder.\u003C/p\u003E\u003Cp\u003EThe wonkiness is as follows: the ailerons are directly counteracting the elevators when I enter pitch commands. When pressing S (\u0022pitch up\u0022), the elevators pitch down, which would indeed cause the nose to pitch up, but the ailerons also pitch down, countering the elevators and causing my plane to stay glued to the runway. The reverse is also true: when pressing W, the elevators and ailerons both pitch up, cancelling each other out.\u003C/p\u003E\u003Cp\u003ECuriously, roll commands work fine: when pressing E to roll right, the starboard aileron and elevator pitch up and down respectively, while the port aileron and elevator pitch down and up respectively.\u003C/p\u003E\u003Cp\u003EAm I doing something wrong?\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-05-20T17:15:39Z","Content":"\n\u003Cp\u003ETry using elevons instead of aelerons and elevators?\u003C/p\u003E\u003Cp\u003EThis has come up a few times before and afaik it\u0027s just some obscure bug, but someone else could have more info on it. \u003C/p\u003E\u003Cp\u003EElevons do work tho, and unless your using FAR(of which I know little about) they work better than elevator and aeleron combinations.\u003C/p\u003E\n"},{"CreatedByName":"Aphox","CreatedById":32691,"CreatedDateTime":"2013-05-20T17:57:13Z","Content":"\n\u003Cp\u003EThere are some animation bugs with control surfaces that don\u0027t actually effect your flight. If you\u0027re stuck on the runway, try moving your wheels closer to the center of gravity and make sure your center of lift is in a good spot. I\u0027m guessing it doesn\u0027t actually have anything to do with the elevators glitching out.\u003C/p\u003E\n"},{"CreatedByName":"Hakkonen","CreatedById":66587,"CreatedDateTime":"2013-05-20T18:25:25Z","Content":"\n\u003Cp\u003EWell, I fixed the problem... somehow. I swapped the rear-mounted elevators for canards, and now I can get off the ground. For a few moments, anyway. Once the nose starts going up, I can\u0027t \u003Cem\u003Estop\u003C/em\u003E it from going up. Fortunately, I had the foresight to put a decoupler right behind the cockpit, stick four of those little (Separotron?) rockets on the cockpit to boost it away from the fuselage, and a parachute to get it back on the ground safely. Turns out that was pretty brilliant of me, because the escape-capsule cockpit saved Jeb\u0027s life.\u003C/p\u003E\n"}]}