{"TopicId":29745,"ForumId":16,"TopicTitle":"Dock 2 Docking Ports together in Editor","CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-05-28T12:38:59Z","PageNum":1,"Articles":[{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-05-28T12:38:59Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003Ei\u0027m trying to build a simple space station.\u003C/p\u003E\u003Cp\u003EI want to have two spare fueltanks (for refueling ships or something). But there has to be a way to decouple those tanks, just in case.\u003C/p\u003E\u003Cp\u003EHere is a picture:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mK5gF0T.jpg\u0022 alt=\u0022mK5gF0T.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIs it possible to couple those docking ports in the Editor? Because I can\u0027t just put them together. That doesn\u0027t work.\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\u003Cp\u003EGreetings,\u003C/p\u003E\u003Cp\u003EAkeno\u003C/p\u003E\n"},{"CreatedByName":"Moon Goddess","CreatedById":57446,"CreatedDateTime":"2013-05-28T13:11:08Z","Content":"\n\u003Cp\u003EWhat you are trying to do there should work just fine, I do it all the time.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-05-28T13:18:35Z","Content":"\n\u003Cp\u003EAre you attempting to put the whole shebang on the rocket all at once? You might have have to do it one piece at a time. If you\u0027re using Subassembly then you could just save it and launch it separately (though parallel docking\u0027s a pain).\u003C/p\u003E\n"},{"CreatedByName":"Vosper","CreatedById":59443,"CreatedDateTime":"2013-05-28T13:21:18Z","Content":"\n\u003Cp\u003EAs above, it can be a bit of a pain but build it one section at a time.. so just add the docking port, it will work fine.\u003C/p\u003E\u003Cp\u003EHowever if you do this with tri docking setup, be warned they can not really bite, and two will float off if you undock. I figured a work around, kick me if you need it.\u003C/p\u003E\n"},{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-05-28T13:21:29Z","Content":"\n\u003Cp\u003EThat\u0027s weird. I tried it, but it doesn\u0027t work \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt won\u0027t attach\u003C/p\u003E\n"},{"CreatedByName":"Shiftyeyesshady","CreatedById":33254,"CreatedDateTime":"2013-05-28T13:21:35Z","Content":"\n\u003Cp\u003EThat will work, however the normal docking ports by themselves are incredibly flimsy, without strutting that, it will very likely come to pieces at launch.\u003C/p\u003E\u003Cp\u003EIf you\u0027re not dead set on doing things stock, you might want to look up the quantum struts mod. It allows you to apply struts that disappear and reattach on undock/dock.\u003C/p\u003E\u003Cp\u003EAlternately, though it wouldn\u0027t work in your design, the new larger docking port is massively more sturdy than the two smaller ones.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-05-28T13:22:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Akeno\u0022 data-cite=\u0022Akeno\u0022\u003E\u003Cdiv\u003EIs it possible to couple those docking ports in the Editor? Because I can\u0027t just put them together. That doesn\u0027t work.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECoupling docking ports with eachother works fine, however it all depends on what bits are connected to them, and in what order. The ones you\u0027re trying to connect in that picture might not work because the docking port on the extra fuel tank doesn\u0027t have a connection point (green ball that shows up when moving stuff).\u003C/p\u003E\u003Cp\u003EOne way to work around your issue would be to start building from the centerpiece, attach the second docking port onto the first, then continue building onto it. Fuel tanks won\u0027t connect to everything radially, so you may have to be creative and not use the \u0027radial attachment point\u0027 you have closest to the fueltank.\u003C/p\u003E\u003Cp\u003EI just tried your exact configuration and got it to work with a \u0027cubic octagonal strut\u0027 between the docking port and fuel tank. Order of connection was centerpiece - docking port - 2nd docking port - cubic octagonal strut - fuel tank.\u003C/p\u003E\u003Cp\u003EHope that helps.\u003C/p\u003E\n"},{"CreatedByName":"Sephta","CreatedById":66104,"CreatedDateTime":"2013-05-28T13:23:40Z","Content":"\n\u003Cp\u003Eif you split a couple of parts from a ship, you can only reattach it on the connection point you had it separated before.\u003C/p\u003E\u003Cp\u003EI\u0027D suggest you simply build your tanks from the docking port on outwards - should be easy and all things are properly alligned.\u003C/p\u003E\n"},{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-05-28T13:24:46Z","Content":"\n\u003Cp\u003EOkay. Thank you guys.\u003C/p\u003E\u003Cp\u003E I will try \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}