{"TopicId":29912,"ForumId":16,"TopicTitle":"Ssto..tr?","CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-05-29T02:25:23Z","PageNum":1,"Articles":[{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-05-29T02:25:23Z","Content":"\n\u003Cp\u003EIve been looking at SSTO Tutorials for about a half hour now. They get their planes into orbit, but never even mention returning back to KSC. So like the space shuttle is it possible to construct a 3 man SSTO that can dock with a space station orbiting at 90km then land back at KSC? Im trying to make something that can guarantee a spot on KSC landing everytime. I apologize if this is the wrong forum, but I find this quite challenging \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Phoenix Aerospace","CreatedById":26120,"CreatedDateTime":"2013-05-29T02:32:52Z","Content":"\n\u003Cp\u003ETry the How To forum. Ask a mod to move this thread, and I\u0027m sure you\u0027ll be able to find help.\u003C/p\u003E\n"},{"CreatedByName":"3_bit","CreatedById":52836,"CreatedDateTime":"2013-05-29T05:37:35Z","Content":"\n\u003Cp\u003EThe space shuttle was far from SSTO, and the crew complement was higher than 3, I believe.\u003C/p\u003E\n"},{"CreatedByName":"Designer225","CreatedById":48514,"CreatedDateTime":"2013-05-29T05:49:43Z","Content":"\n\u003Cp\u003EYeah... standard is 7, but in few cases 8 crew members hitch the ride. In some cases it\u0027s 4.\u003C/p\u003E\u003Cp\u003EAnd space shuttles are MSTO, though they landed as planes. And only SRBs and shuttle orbiters are reusable.\u003C/p\u003E\n"},{"CreatedByName":"kujuman","CreatedById":28299,"CreatedDateTime":"2013-05-29T06:09:21Z","Content":"\n\u003Cp\u003ETo answer the question, yes it is quite possible to land back at the runway fairly reliably. Key things to keep in mind:\u003C/p\u003E\u003Cp\u003ETest your plane in the atmosphere with no fuel on board to ensure that it is stable even with less fuel (as fuel drains, the center of mass will shift, if it goes too far back your plane will tumble and if it is too far forward you will be a dart)\u003C/p\u003E\u003Cp\u003EEnsure that your orbit will take you over the KSC. I think most players have stations in an equitorial orbit, so this is not a problem for them.\u003C/p\u003E\u003Cp\u003EThe next step is to save once you\u0027re ready to leave your station. For a roughly circular orbit, if you lower your periapsis to the same level each time and set it the same distance from the KSC, you will land in a consistant way. So try it a few times. If you land short either raise the periapsis or do the deorbit burn later.\u003C/p\u003E\u003Cp\u003EAs a starting point, if you have your periapsis around 24km and about over the middle of the ocean to the east, you should have a close landing. Then just tweak until it\u0027s right by using the quicksave and you\u0027ll have similar results with each subsequant flight.\u003C/p\u003E\n"},{"CreatedByName":"Colonel_Panic","CreatedById":61997,"CreatedDateTime":"2013-05-29T06:14:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EIve been looking at SSTO Tutorials for about a half hour now. They get their planes into orbit, but never even mention returning back to KSC. So like the space shuttle is it possible to construct a 3 man SSTO that can dock with a space station orbiting at 90km then land back at KSC? Im trying to make something that can guarantee a spot on KSC landing everytime. I apologize if this is the wrong forum, but I find this quite challenging \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf your question is whether it\u0027s possible to SSTO a shuttle command pod and return to KSC, the answer is yes.\u003C/p\u003E\u003Cp\u003EThe landing part is both straightforward and tricky. You\u0027ll want to have some kind of marker such as a touched down lander at the pad, so you can see KSC from the orbital map while adjusting your re-entry angle to put you about 30km west of it, so you can fly or glide the rest of the way in for a landing. Markers of some kind at the ends of the runway are recommended too so you can see it on approach and line up with it. You want to get it exactly on your 90-degree east vector on the nose, to be lined up and heading in straight for a landing. Then just lower your gear, slow or cut your engines as you get close, and try to make a soft touchdown at low speed. It\u0027s easier said than done and requires practice. Even if you use mechjeb he will fudge it up more often than not (although at least his landing predictions can be useful for getting your re-entry in the right ballpark)\u003C/p\u003E\n"},{"CreatedByName":"tntristan12","CreatedById":7005,"CreatedDateTime":"2013-05-29T07:46:41Z","Content":"\n\u003Cp\u003EI already have a design that can SSTO to 150km, dock, then return to KSC very reliably. I\u0027ll post it eventually!\u003C/p\u003E\n"},{"CreatedByName":"sgt_flyer","CreatedById":57690,"CreatedDateTime":"2013-05-29T10:34:45Z","Content":"\n\u003Cp\u003Emy kliper\u0027s can house 6 kerbals, but it\u0027s not an SSTO, it was designed for unpowered gliding reentry from the start (as we jetison the orbital module before reentry \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E - to land at KSC with it from a 100x100 equatorial orbit : when you\u0027re above the big mountain range (the one at the west of the desert west of KSC) and have your orbital prediction line finish it\u0027s course a bit before the middle of the sea east of KSC. (roughly slightly after the big island\u0027s latitude) then, just point your nose toward the prograde marker during reentry (and you even can disable ASAS, the Kliper\u0027s can handle the rest \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"dragoncannon","CreatedById":57583,"CreatedDateTime":"2013-05-29T13:19:58Z","Content":"\n\u003Cp\u003EThe Stargazer SSTO can easily fulfill these tasks- although it launches vertically... It is based on the Lockheed Martin development (cancelled 2001) that was scheduled to replace the space shuttle...\u003C/p\u003E\u003Cp\u003ELaunch\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/0m892-I3TJs?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ELanding\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/eV_Nz27tSFo?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-05-29T14:57:19Z","Content":"\n\u003Cp\u003EThat\u0027s awesome guys thanks.\u003C/p\u003E\n"},{"CreatedByName":"pinolallo","CreatedById":47075,"CreatedDateTime":"2013-05-29T15:07:40Z","Content":"\n\u003Cp\u003EThere are some useful advices here \u003Ca href=\u0022http://www.reddit.com/r/KerbalSpaceProgram/comments/1diign/the_pinolallos_ssto_guide/\u0022 rel=\u0022external nofollow\u0022\u003Epinolallos ssto guide\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"AnalogAddict","CreatedById":59758,"CreatedDateTime":"2013-05-29T15:54:54Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/30368-Laythe-Nuke-SP-SSTO-20-OK%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/30368-Laythe-Nuke-SP-SSTO-20-OK%21\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is my spaceplane which gets to and from any station I have in LKO, HKO, LMO, LMinmusO. Deorbiting in a manner unto which one may land at KSC is just picking a method and sticking to it.\u003C/p\u003E\u003Cp\u003EAs someone else mentioned in this post earlier, keep your periapsis placement similar in all of your deorbits and you should land on target. When I develop a new spaceplane I always go for one standardized approach to KSC: At 65 degrees to KSC I lower my periapsis to ~5km, not the most efficient deorbit method but I\u0027m guaranteed to at least hit the mountains just west of KSC. If you have spare fuel left in the spaceplane, kick up them turbofans to bring you in nicely. \u003C/p\u003E\u003Cp\u003EDepending on how much fuel your plane has left you might drop quicker or slower than with my \u0022standardized\u0022 approach as I usually build \u0026lt;30T.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-05-29T15:55:28Z","Content":"\n\u003Cp\u003EOh yeah. It\u0027s possible all right. however you probably want to build a smaller SSTO then work your way up.\u003C/p\u003E\u003Cp\u003EAs an example, this one seats 11\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm9.staticflickr.com/8241/8633642559_e11f560461_c.jpg\u0022 alt=\u00228633642559_e11f560461_c.jpg\u0022\u003E\u003C/p\u003E\n"}]}