{"TopicId":30210,"ForumId":16,"TopicTitle":"Space Plane runs out of Fuel before Orbit.","CreatedByName":"Barujin","CreatedById":67302,"CreatedDateTime":"2013-05-30T09:30:07Z","PageNum":1,"Articles":[{"CreatedByName":"Barujin","CreatedById":67302,"CreatedDateTime":"2013-05-30T09:30:07Z","Content":"\n\u003Cp\u003EI started playing Kerbal at version 0.2. I\u0027ve been trying to get into orbit with a space plane after watching Scott Manley\u0027s YouTube video about them. He got into orbit with an optimized Aeries space plane with plenty of fuel to spare. I built a similar plane with twice the fuel, two aerospike rockets, four tanks of jet fuel, and four jet engines. I can get 1 Km/S of speed at 20 Km altitude, but the plane burns through its fuel before reaching 40 Km. What am I doing wrong? Did something in Kerbal change with a recent version or does the plane simply have too much weight? I thought everything would scale up just fine, but I guess it doesn\u0027t. I\u0027ll try building exactly the same plane that Scott Manley built and see if it works. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-05-30T09:55:02Z","Content":"\n\u003Cp\u003EYou mean 0.20 I suppose, because KSP 0.2 was at least 2 years ago.\u003C/p\u003E\u003Cp\u003ESSTO is hard, and it\u0027s a good thing. IMO, it\u0027s still too easy.\u003C/p\u003E\n"},{"CreatedByName":"Mach56","CreatedById":57826,"CreatedDateTime":"2013-05-30T10:27:35Z","Content":"\n\u003Cp\u003ETry making your own plane, copying someone else w/o a craft file won\u0027t work to well. And SSTO are meant to be small.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-05-30T10:33:30Z","Content":"\n\u003Cp\u003EBasing from what you said about your build, you are indeed overweight, and the culprits are the two extra jet engines. You can live with just two--the key is not the number of engines, but if they are still working ABOVE 22k meters. And to do that, you need extra intakes, and I mean LOTS of intakes. Read my blog on how I made my first successful SSTO-return-to-KSC-Runway flight last night in my Black Mamba (will share the .craft file soon, when I finish all the tweaks I need to do with it).\u003C/p\u003E\u003Cp\u003EAdditionally, you cannot open the extra intakes below 15-19k feet (depending on your v at that point), because they cause drag. Opening them up at higher altitudes (above 19k) will ensure that your jet engines are fed with air well, before they reach flameout. Thus you need to bind intake opening with Custom Action Keys, to activate them at the right time. You also need to bind your regular (default) intakes to action keys, because it helps to close all of them during re-entry.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-30T10:35:52Z\u0022 title=\u002205/30/2013 10:35  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 30, 2013\u003C/time\u003E by rodion_herrera\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AnalogAddict","CreatedById":59758,"CreatedDateTime":"2013-05-30T12:15:13Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mvXimFAl.png\u0022 alt=\u0022mvXimFAl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/30368-Laythe-Nuke-SP-SSTO-20-OK%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/30368-Laythe-Nuke-SP-SSTO-20-OK%21\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EHere is my space plane and a guide on how to get it to orbit. Maybe it will answer some questions for you.\u003C/p\u003E\u003Cp\u003EAlso, in your attempts, are you firing your aerospikes early? I see where can reach 1km/s @ 20km, which is normal, try pushing that up to 1.3~1.4km/s and nudge your altitude up to 24~26km and then fire those aerospikes while pitched towards the heavens. (45 degrees or such, maybe higher depending on if you\u0027re catching your apoapsis.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-30T12:19:45Z\u0022 title=\u002205/30/2013 12:19  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 30, 2013\u003C/time\u003E by AnalogAddict\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-30T13:12:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Barujin\u0022 data-cite=\u0022Barujin\u0022\u003E\u003Cdiv\u003EI built a similar plane with twice the fuel, two aerospike rockets, four tanks of jet fuel, and four jet engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s your problem.\u003C/p\u003E\u003Cp\u003EDiminishing returns on added mass are huge. You don\u0027t get equal performance by doubling the fuel and engines, you get less. It\u0027s far easier to improve performance by removing mass (even fuel and engines) than by adding mass. \u003C/p\u003E\u003Cp\u003EEven the stock version is oversized for a one-seat SSTO plane. A one-seater should come in under 10 tons. Even a two-seater is doable at 12 tons or less:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NtzPzzT.jpg\u0022 alt=\u0022NtzPzzT.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dN4B4jC.jpg\u0022 alt=\u0022dN4B4jC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/CKelHns.jpg\u0022 alt=\u0022CKelHns.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/6lWklc9.jpg\u0022 alt=\u00226lWklc9.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEvery little bit of weight you can shave off by using fewer engines, smaller engines, and less fuel will make reaching orbit easier.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-30T13:22:22Z\u0022 title=\u002205/30/2013 01:22  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 30, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Barujin","CreatedById":67302,"CreatedDateTime":"2013-05-31T14:33:56Z","Content":"\n\u003Cp\u003EOkay, being new to Kerbal, I hadn\u0027t tried actual rocketry yet. I just was really interrested in the whole space plane concept. I finally made a rocket with aerospikes and one striped tank for each one. The one without staging could not make it into orbit (without really smart maneuvers). Once I added ordinary staging, though, it worked perfectly. I realized that rocketry truely functions due to dropping the extra weight. If someone could get a huge amount of fuel up to 20Km safely and with little extra weight, then they could likely get into orbit and go to other planets. Otherwise, I just don\u0027t see space planes as realistic (take-off to landing). Tiny doesn\u0027t exactly get far out there.\u003C/p\u003E\n"},{"CreatedByName":"Snooze","CreatedById":67712,"CreatedDateTime":"2013-05-31T15:32:09Z","Content":"\n\u003Cp\u003ETiny planes are fine. Like Scott Manley, I use a modified AERIS IV to put satellites in orbit. Recently I\u0027ve started using them to trade out crew on my orbital fuel station.\u003C/p\u003E\u003Cp\u003EOP, you can likely get what you\u0027ve designed into orbit with fuel to spare. All you need to do is mind your throttle. Keep your resource window open and watch your fuel consumption versus speed gained. Don\u0027t light the aerospikes until you\u0027re above 22k meters and you\u0027ve gotten all the speed you can out of your air-breathers. Then you light the spikes, assume 45 degrees nose up to grab altitude, once above 32k, level off and start gaining orbital speed.\u003C/p\u003E\u003Cp\u003EIt takes a fair bit of practice as well as getting used to the... peculiarities of your design but once get the basics down it\u0027s all a matter of adjusting for your own plane.\u003C/p\u003E\n"},{"CreatedByName":"White Rider","CreatedById":66087,"CreatedDateTime":"2013-05-31T15:47:42Z","Content":"\n\u003Cp\u003EWhat\u0027s unrealistic about spaceplanes?\u003C/p\u003E\u003Cp\u003EThey are not commonplace on earth for the same reason they are not common here. They are hard to build.\u003C/p\u003E\u003Cp\u003EYou should look up Skylon Project.\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-05-31T15:59:40Z","Content":"\n\u003Cp\u003EYou guys seem pretty good at this whole SSTO thing, and my only attempt so far hasn\u0027t gone so well\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://dl.dropboxusercontent.com/u/42951400/screenshot16.png\u0022 alt=\u0022screenshot16.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://dl.dropboxusercontent.com/u/42951400/screenshot17.png\u0022 alt=\u0022screenshot17.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://dl.dropboxusercontent.com/u/42951400/screenshot18.png\u0022 alt=\u0022screenshot18.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you probably noticed, none of those pictures are in orbit. The plane itself flies amazingly well, with good stability and a great turning circle (especially considering it weighs 38 tons). The issue is that once I get it to about 23km up, the lower engine starts losing power, it\u0027s at 140kN compare to 220 on the top one and has half the electric charge, and it doesn\u0027t equal out until I nose down to a point where I start losing altitude. I started throwing on a ton of wings thinking it started nosing down because it didn\u0027t have enough lift in the thin air before I noticed the engine imbalance. I have an equal amount of intakes on the top and bottom so I have no idea what\u0027s going on. do the intakes get mapped to certain engines or does the angle of the intakes matter?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-31T16:02:59Z\u0022 title=\u002205/31/2013 04:02  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 31, 2013\u003C/time\u003E by Tripod27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-05-31T16:12:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tripod27\u0022 data-cite=\u0022Tripod27\u0022\u003E\u003Cdiv\u003EI have an equal amount of intakes on the top and bottom so I have no idea what\u0027s going on. do the intakes get mapped to certain engines or does the angle of the intakes matter?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou have to understand one thing--KSP doesn\u0027t care about intake angles or how many intakes are PER engine--all it cares about is that you have PLENTY (I believe you can even mount them in reverse to the direction of flight LOL) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E So yeah, you have to be creative in mounting them, but the key is really to carry a lot of intakes. My Black Mamba (you can find it in Spacecraft Exchange) has 14 intakes (7 pairs) but the placement doesn\u0027t make them seem obvious. You can live with 2 intakes up to around 16-18 km, then you have to open up (via action keys) the remaining intakes (in my case, the 12 other intakes) so that your intake value doesn\u0027t drop below 0.13 (dangerous, close to flame out!)\u003C/p\u003E\u003Cp\u003ENow some might say \u0022intake spammer!\u0022 or \u0022that\u0027s cheating!\u0022 Well, this is how I see it--they are simply \u0022constructs\u0022 of better, and more efficient intakes--like if I put 3 intakes together and treat them as \u0022one\u0022 intake, its like saying I have a new intake (modded?) that is three times more efficient than the stock one, so it still makes sense.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-31T16:15:02Z\u0022 title=\u002205/31/2013 04:15  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 31, 2013\u003C/time\u003E by rodion_herrera\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-05-31T16:18:03Z","Content":"\n\u003Cp\u003EStill odd that the bottom engine stalls out first, but whatever I guess, time to add more intakes\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-05-31T16:21:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Barujin\u0022 data-cite=\u0022Barujin\u0022\u003E\u003Cdiv\u003ETiny doesn\u0027t exactly get far out there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the contrary... a key principle of rocketry is that \u0022tiny goes farther.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BWyNJZc.jpg\u0022 alt=\u0022BWyNJZc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BS23e.jpg\u0022 alt=\u0022BS23e.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce you\u0027re above 30km or so, the same rules apply to spaceplanes that apply to rockets.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-31T16:30:09Z\u0022 title=\u002205/31/2013 04:30  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 31, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JebDynamics","CreatedById":64229,"CreatedDateTime":"2013-05-31T18:17:51Z","Content":"\n\u003Cp\u003EIntakes add a lot of drag. The design I\u0027ve been using can get 3 tons of cargo to 80km easily, and up to 5 tons with careful flying ( it gets very front heavy making pitching up to escape the atmo difficult ).\u003C/p\u003E\u003Cp\u003EIt uses about 300 LF to get to 24km on jets, then around 1000-1200 LFO to get to orbit.\u003C/p\u003E\u003Cp\u003EPictured in orbit with cargo behind ( 4.5 ton spacelab )\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/5RMKaS1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/5RMKaS1l.jpg\u0022 alt=\u00225RMKaS1l.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-05-31T18:23:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JebDynamics\u0022 data-cite=\u0022JebDynamics\u0022\u003E\u003Cdiv\u003EIntakes add a lot of drag. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is \u003Cstrong\u003Eprecisely\u003C/strong\u003E why you bind their open/close controls to a Custom Action Key (1...9 keys) so you can \u003Cem\u003EONLY OPEN THEM above 18k meters by pressing the appropriate action key\u003C/em\u003E, and up there, where air is thin, drag is negligible, and your jet engines can enjoy more operation time.\u003C/p\u003E\n"},{"CreatedByName":"JebDynamics","CreatedById":64229,"CreatedDateTime":"2013-05-31T18:49:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EWhich is \u003Cstrong\u003Eprecisely\u003C/strong\u003E why you bind their open/close controls to a Custom Action Key (1...9 keys) so you can \u003Cem\u003EONLY OPEN THEM above 18k meters by pressing the appropriate action key\u003C/em\u003E, and up there, where air is thin, drag is negligible, and your jet engines can enjoy more operation time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve been leaving them all open to simplify things for myself, but I\u0027m sure there are still ways to optimize the ascent.\u003C/p\u003E\u003Cp\u003EIt is critical that you close the intakes when escaping the atmosphere, otherwise the drag will prevent an orbit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-31T18:49:40Z\u0022 title=\u002205/31/2013 06:49  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 31, 2013\u003C/time\u003E by JebDynamics\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-05-31T18:57:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JebDynamics\u0022 data-cite=\u0022JebDynamics\u0022\u003E\u003Cdiv\u003EI\u0027ve been leaving them all open to simplify things for myself, but I\u0027m sure there are still ways to optimize the ascent.\u003Cp\u003EIt is critical that you close the intakes when escaping the atmosphere, otherwise the drag will prevent an orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou close the intakes AFTER you attain more than 1,200 m/s with the jet engines, at an altitude of around 24,000 to 25,000 meters. This is why some people can\u0027t raise their rocket engine speeds high enough to attain insertion, because they haven\u0027t built up their jet speed.\u003C/p\u003E\u003Cp\u003ESimplify? It just takes ONE keypress to toggle a custom action.\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-05-31T19:12:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EYou close the intakes AFTER you attain more than 1,200 m/s with the jet engines, at an altitude of around 24,000 to 25,000 meters. This is why some people can\u0027t raise their rocket engine speeds high enough to attain insertion, because they haven\u0027t built up their jet speed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had a speed of 1300 m/s at 26,000 and soon after I turned off my two jet engines and turned on my 3 nuclears I started losing speed and altitude \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 alt=\u0022-_-\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JebDynamics","CreatedById":64229,"CreatedDateTime":"2013-05-31T19:18:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003EYou close the intakes AFTER you attain more than 1,200 m/s with the jet engines, at an altitude of around 24,000 to 25,000 meters. This is why some people can\u0027t raise their rocket engine speeds high enough to attain insertion, because they haven\u0027t built up their jet speed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is what I said, maybe I didn\u0027t make it clear enough. Intakes need to be closed when your are burning/coasting to apogee.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rodion_herrera\u0022 data-cite=\u0022rodion_herrera\u0022\u003E\u003Cdiv\u003ESimplify? It just takes ONE keypress to toggle a custom action.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI find it simpler to have one hotkey for all intakes on/off. I fly up to 24km as fast as possible without flame-out due to low airspeed.\u003C/p\u003E\n"},{"CreatedByName":"JebDynamics","CreatedById":64229,"CreatedDateTime":"2013-05-31T19:22:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tripod27\u0022 data-cite=\u0022Tripod27\u0022\u003E\u003Cdiv\u003EI had a speed of 1300 m/s at 26,000 and soon after I turned off my two jet engines and turned on my 3 nuclears I started losing speed and altitude \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_sleep.png\u0022 alt=\u0022-_-\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe nuclear engines have too little thrust I\u0027ve found, I have much better luck with LV-T30\u0027s.\u003C/p\u003E\n"},{"CreatedByName":"rodion_herrera","CreatedById":66284,"CreatedDateTime":"2013-05-31T19:25:21Z","Content":"\n\u003Cp\u003EAerospikes are the best rocket engines for spaceplanes.\u003C/p\u003E\n"},{"CreatedByName":"JebDynamics","CreatedById":64229,"CreatedDateTime":"2013-05-31T19:35:47Z","Content":"\n\u003Cp\u003EWhen burning from 24km:\u003C/p\u003E\u003Cp\u003ELV-T30s give me 215kN of thrust at ~360isp and weigh 1.25t\u003C/p\u003E\u003Cp\u003EAerospikes give me 175kN of thrust at ~390isp and weigh 1.5t\u003C/p\u003E\u003Cp\u003EDoesn\u0027t that give T30\u0027s the edge for this use? ( I\u0027m still a little confused about comparing thrust/isp between engines )\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-31T19:36:24Z\u0022 title=\u002205/31/2013 07:36  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 31, 2013\u003C/time\u003E by JebDynamics\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"},{"CreatedByName":"Shrike42","CreatedById":61104,"CreatedDateTime":"2013-05-31T19:48:11Z","Content":"\n\u003Cp\u003EThat is one heck of a plane, Tripod27. But yeah, the LV-Ns are not really much good in-atmosphere, and as a rule of thumb, you\u0027re only ever going to need 2 once you\u0027ve gotten to orbit. \u003C/p\u003E\u003Cp\u003EDepending on if you have a means to refuel once you\u0027re up there, you might keep one LV-N and swap out the other two for LV-T30\u0027s or something. Then shut down the T30s and go wherever your fancy takes you. \u003C/p\u003E\u003Cp\u003EI now have an idea for an SSTO with one of the huge new docking ports at the back end, designed to be used with an LV-N on a fuel tank that you get into space on a rocket. Give your shuttle a long-range option, just because.\u003C/p\u003E\n"},{"CreatedByName":"Curs0r","CreatedById":60051,"CreatedDateTime":"2013-05-31T23:33:21Z","Content":"\n\u003Cp\u003EIn the interest of the most conventional and sleek look for my SSTO I came up with this air hog, which I named the K-21 Munray (yes it took me 21 tries to get my ideal plane happening). The K-19 was probably my favorite but ended up being pretty gutless for Hohmann uses.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud.steampowered.com/ugc/903249917177085135/AC73D14E24083B1993EA0AB7E80839D4CD8DC5D9/\u0022 alt=\u0022AC73D14E24083B1993EA0AB7E80839D4CD8DC5D9\u0022\u003E\u003C/p\u003E\u003Cp\u003EShe is not as nimble as I\u0027d like, and takes the entire run from that start of the runway to the edge of the water to lift off. She will make it to the surface of Minmus from the runway though. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903249917166174961/0B4C22FFD9E2A7C53BCBEAECD14827C8D2AB7A96/\u0022 alt=\u00220B4C22FFD9E2A7C53BCBEAECD14827C8D2AB7A96\u0022\u003E\u003C/p\u003E\u003Cp\u003EI generally end up at a 212km orbit from takeoff with over 2/3 of the fuel remaining. I have a gas station parked in synchronous Kerbin orbit, and I managed Duna (using Ike to brake) off of 1 refuel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903249917180243932/2AA23B1A9A8874D08E61A2A7C41775E4B3F2FE62/\u0022 alt=\u00222AA23B1A9A8874D08E61A2A7C41775E4B3F2FE62\u0022\u003E\u003C/p\u003E\u003Cp\u003EIke braking maneuver\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/903249917180861295/AADFB65231FE32170B16FBB28FE7CB45D10DCD65/\u0022 alt=\u0022AADFB65231FE32170B16FBB28FE7CB45D10DCD65\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was bone dry for fuel, even RCS after pulling the deorbit burn. I have never been so glad to have pointed my craft at a perfectly flat area. At this point I would have been quite screwed in a conventional lander, but this is the very reason for using a space plane.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud.steampowered.com/ugc/903249917180854064/250B6BF3C7689EA90059BBEF732CAA036D5C7376/\u0022 alt=\u0022250B6BF3C7689EA90059BBEF732CAA036D5C7376\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter pulling the standard speed-bleed seesawing for about 10 minutes, I set her down like a leaf in a very flat area.\u003C/p\u003E\n"},{"CreatedByName":"Tripod27","CreatedById":68324,"CreatedDateTime":"2013-06-01T01:08:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shrike42\u0022 data-cite=\u0022Shrike42\u0022\u003E\u003Cdiv\u003EThat is one heck of a plane, Tripod27. But yeah, the LV-Ns are not really much good in-atmosphere, and as a rule of thumb, you\u0027re only ever going to need 2 once you\u0027ve gotten to orbit. \u003Cp\u003EDepending on if you have a means to refuel once you\u0027re up there, you might keep one LV-N and swap out the other two for LV-T30\u0027s or something. Then shut down the T30s and go wherever your fancy takes you. \u003C/p\u003E\u003Cp\u003EI now have an idea for an SSTO with one of the huge new docking ports at the back end, designed to be used with an LV-N on a fuel tank that you get into space on a rocket. Give your shuttle a long-range option, just because.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell the reason it\u0027s so huge is because I want to use it to get to Duna and back, and apparently 12.5 tons of rocket fuel is pretty heavy. I\u0027m trying swapping one nuke for a t30 right now just for making orbit\u003C/p\u003E\u003Cp\u003EAt least with the engine swap it\u0027s slightly under 40 tons now \u0026gt;_\u0026lt;\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-01T01:13:54Z\u0022 title=\u002206/01/2013 01:13  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 1, 2013\u003C/time\u003E by Tripod27\u003C/strong\u003E\n\u003C/span\u003E\n"}]}