{"TopicId":30638,"ForumId":16,"TopicTitle":"engines having no fuel on further stages","CreatedByName":"shields","CreatedById":68805,"CreatedDateTime":"2013-06-01T06:15:34Z","PageNum":1,"Articles":[{"CreatedByName":"shields","CreatedById":68805,"CreatedDateTime":"2013-06-01T06:15:34Z","Content":"\n\u003Cp\u003ENot sure if this is the right forum as i\u0027m new to KSP. So i have the problem of where after my initial burn stages, my other engines that i would use to further\u003C/p\u003E\u003Cp\u003Epush my ship into orbit and any further are empty.. No liquid fuel.. what am i doing wrong exactly?? i load the ship up with many fuel sections but clearly\u003C/p\u003E\u003Cp\u003Ei\u0027m doing something wrong, recap i\u0027d like some help on how to manage my fueling so i may venture further and stop this issue from occurring when i\u0027m switching \u003C/p\u003E\u003Cp\u003Estages.\u003C/p\u003E\u003Cp\u003EThanks heaps!\u003C/p\u003E\n"},{"CreatedByName":"Cykyrios","CreatedById":17639,"CreatedDateTime":"2013-06-01T06:40:31Z","Content":"\n\u003Cp\u003EHi there,\u003C/p\u003E\u003Cp\u003EIf you have any screenshot to show us how you built your rocket, it would help us help you help us all (ahem, GLaDOS was here...).\u003C/p\u003E\u003Cp\u003EAnyway, depending on your rocket, it\u0027s possible that you will need fuel lines for some of your engines.\u003C/p\u003E\n"},{"CreatedByName":"Uberick","CreatedById":65954,"CreatedDateTime":"2013-06-01T06:54:45Z","Content":"\n\u003Cp\u003EAs said, photo would help(try imgur or something of that nature). \u003C/p\u003E\u003Cp\u003EWithout a photo, my guess would be that the way your rocket is staged is such that the bottom stages don\u0027t realize that they\u0027re only supposed to be drawing fuel from a certain section of the rocket. A combination of rearranging decouplers, shutting off fuel crossfeed, or fuel lines should fix it. \u003C/p\u003E\u003Cp\u003EIf you can throw up an image with some more details maybe we can get a more accurate diagnosis. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"tazbertair","CreatedById":12692,"CreatedDateTime":"2013-06-01T08:40:26Z","Content":"\n\u003Cp\u003EI have the same problem at the moment. a2.5m tank/ poodle engine/ 2.5m decoupler/ 2.5m tank arrangement draws fuel from the top tank before emptying the lower one. The only way I have found to disable it is to right-click on the top tank before launch (or when I remember - hopefully before the stage below starts up!) then left click on the two green arrows beside the resources. They turn into red circles, indicating that fuel flow is disabled.\u003C/p\u003E\u003Cp\u003EOf course, it is slightly important to remember to switch fuel flow back on before you need that engine...\u003C/p\u003E\u003Cp\u003EFor added hilarity points, I currently have a 50% fail ratio when staging - the decoupler seems to ram the engine straight up through the tank causing a massive explosion and no more fuel...\u003C/p\u003E\n"},{"CreatedByName":"Procyon","CreatedById":57510,"CreatedDateTime":"2013-06-01T19:01:24Z","Content":"\n\u003Cp\u003Eusing docking ports or decouplers?\u003C/p\u003E\n"}]}