{"TopicId":30732,"ForumId":16,"TopicTitle":"Need help with docking","CreatedByName":"Parkaboy","CreatedById":64208,"CreatedDateTime":"2013-06-01T18:39:47Z","PageNum":1,"Articles":[{"CreatedByName":"Parkaboy","CreatedById":64208,"CreatedDateTime":"2013-06-01T18:39:47Z","Content":"\n\u003Cp\u003EHello, there!\u003C/p\u003E\u003Cp\u003EI\u0027ve just experienced three frustrating days of playing KSP, because of docking ports not working properly. Basically I\u0027m working on a couple of modular bases, to be assembled by rover, but the problem is that while the assembly works fine while testing at the KSC runway, it almost doesn\u0027t work at all on another planet.\u003C/p\u003E\u003Cp\u003EI\u0027ve assembled a base on the surface of the Mun with no dificulty, but while trying to do the second one, more than half of the docking attempts failed, even though I was able to line the ports perfectly. I thought the problem was the docking port I was using (a mod one), but while trying to build a base on Laythe after a long travel, I can\u0027t get my rover to dock with ANYTHING.\u003C/p\u003E\u003Cp\u003EI can\u0027t fihure out what\u0027s the problem. The ports are the stock ones, they are attached correctly, line up perfectly, and all the vessels I\u0027m trying to dock have power. I can even put the modules on top of my rover, and they look like they\u0027re docked, but they aren\u0027t. It\u0027s really annoying.\u003C/p\u003E\u003Cp\u003EDoes anyone know a possible solution for this? Is there a mod that improves how the stock ports dock? I\u0027m not talking about a docking autopilot, since I\u0027m trying to dock on the surface and have no trouble getting the ports in position, just something to make the damn things attach to each other.\u003C/p\u003E\u003Cp\u003EThanks in advance.\u003C/p\u003E\n"},{"CreatedByName":"XerZin","CreatedById":68342,"CreatedDateTime":"2013-06-01T18:49:25Z","Content":"\n\u003Cp\u003EWell I had a docking/RCS problem that just got solved so I read your headline and then the text, this is out of my leugue.. Sorry:confused:\u003C/p\u003E\n"}]}