{"TopicId":30775,"ForumId":16,"TopicTitle":"Travelling 50km on mun by rcs jetpack.","CreatedByName":"jpem","CreatedById":68440,"CreatedDateTime":"2013-06-01T21:58:55Z","PageNum":1,"Articles":[{"CreatedByName":"jpem","CreatedById":68440,"CreatedDateTime":"2013-06-01T21:58:55Z","Content":"\n\u003Cp\u003ECan it be done if you know what you\u0027re doing? I always seem to crash and die. I landed my rover too far out and I need to go get it. Only other solutions is walking or sending another rover from what I can tell. Thank you.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2013-06-01T22:16:14Z","Content":"\n\u003Cp\u003ENever tried jetpacking that far, and if you did make it, you certainly wouldn\u0027t have enough fuel to get back, but if you are retrieving a rover I guess that part wouldn\u0027t matter.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2013-06-01T22:32:24Z","Content":"\n\u003Cp\u003EBefore the time of Rovers I often have covered distances by Jetpack ...\u003C/p\u003E\u003Cp\u003Efrom my experience I can say that you are lucky if you are able to cover a distance of 14 km via Jetpack \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(for me usually a distance of 12 km is the max [6 km to, 6 km from] ... if for some reasons I went more far away, I have to walk the remainin kms on foot)\u003C/p\u003E\n"},{"CreatedByName":"jpem","CreatedById":68440,"CreatedDateTime":"2013-06-01T23:26:19Z","Content":"\n\u003Cp\u003EWell, after moving my base with the fuel I had left I got it down to 12km and jet packed from there. Then found my rover sunk and no longer usable. Sigh. Thanks anyways.\u003C/p\u003E\n"},{"CreatedByName":"jpem","CreatedById":68440,"CreatedDateTime":"2013-06-01T23:44:00Z","Content":"\n\u003Cp\u003EEdit: Double post\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-02T02:33:51Z\u0022 title=\u002206/02/2013 02:33  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 2, 2013\u003C/time\u003E by jpem\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-06-02T02:31:48Z","Content":"\n\u003Cp\u003EI made a 76km flight on the Mun by EVA pack, when a small lander crashed but the pilot lived. I jet-packed him to another craft with an open seat that was landed nearby. Make a high ballistic arc rather than trying to stay low and follow the terrain. It\u0027s a lot safer and you\u0027ll use less propellant.\u003C/p\u003E\n"},{"CreatedByName":"Uberick","CreatedById":65954,"CreatedDateTime":"2013-06-02T04:17:54Z","Content":"\n\u003Cp\u003EFarthest I\u0027ve ever gone is about 10 km. . .\u003C/p\u003E\n"},{"CreatedByName":"Engineer_Tony","CreatedById":66416,"CreatedDateTime":"2013-06-02T09:47:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoboRay\u0022 data-cite=\u0022RoboRay\u0022\u003E\u003Cdiv\u003EI made a 76km flight on the Mun by EVA pack, when a small lander crashed but the pilot lived. I jet-packed him to another craft with an open seat that was landed nearby. Make a high ballistic arc rather than trying to stay low and follow the terrain. It\u0027s a lot safer and you\u0027ll use less propellant.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat is pretty amazing, though it does make sense. The optimum angle for a projectile is an inclination of 45 deg, that would give you maximum range for any given amount of thrust (this only really applies on the mun as there is no air resistance to consider). To get 100% efficiency you would have to do a suicide break at EXACTLY the right moment before landing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESounds dangerous to me, therefore sounds like a job for Jeb \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-02T20:26:50Z","Content":"\n\u003Cp\u003EYou can stretch your RCS fuel supply by getting the little guy going pretty quickly, then allow him to descend gently to the surface. As long as he doesn\u0027t hit the ground overly hard at that first contact, he will slide and bounce for many, many meters.\u003C/p\u003E\n"},{"CreatedByName":"Elemental","CreatedById":58070,"CreatedDateTime":"2013-06-03T18:34:21Z","Content":"\n\u003Cp\u003EDid about 30Km on Minmus... by doing large jumpy flights and then face planting. Kerbals seem more tender this version though so might not get away with it.\u003C/p\u003E\n"},{"CreatedByName":"Deadpangod3","CreatedById":58339,"CreatedDateTime":"2013-06-03T18:49:02Z","Content":"\n\u003Cp\u003EIn .19.1 I landed in the middle of one of Minmus\u0027s lakes and used the face plant-slide trick to save RCS fuel to look at rocks on the shore for some reason... But I had Jeb going soo fast on the way back that he hit bumps somehow and flew into the air several times, and was screaming (\u0026lt;ohgod) he almost it the lander and flew past it, but he got back safe XD I\u0027m guessing it was probably 50 km\u003C/p\u003E\u003Cp\u003EMajor rug burns, or iceburns since its Minmus...\u003C/p\u003E\n"},{"CreatedByName":"Horn Brain","CreatedById":49626,"CreatedDateTime":"2013-06-03T19:44:48Z","Content":"\n\u003Cp\u003EOn Minmus you can literally get to orbit and land again with EVA to spare. On the Mun you need just a tiny bit more fuel to get to orbit. It\u0027s so close it\u0027s almost like the devs purposefully gave us 95% of the propellant necessary to frustrate us. :-)\u003C/p\u003E\u003Cp\u003ELet\u0027s do a ballpark estimate: Assume instantaneous maneuvers for launch and landing, a flat ground, and constant gravity (I don\u0027t expect to be reaching orbital speeds if I have to turn around and come back). This will also obviously ignore surface rotation.\u003C/p\u003E\u003Cp\u003EFrom high school physics, the best launch angle is 45 degrees, so let\u0027s assume the kerbal uses 25% of his dV to launch himself at a 45 degree angle to the surface. The EVA packs have roughly 550 m/s of dV (correct me if I\u0027m wrong, here), so that means a speed of 137.5 m/s initially. If you do the math, you\u0027ll see that means a loft time of almost exactly 2 minutes, which translates to a distance traveled of about 11.6 kilometers. Call it 12.\u003C/p\u003E\u003Cp\u003ETherefore, in the perfect scenario, the kerbal launches himself at exactly 45 degrees and performs an exactly opposite maneuver (suicide burn) upon landing, then repeats the same process for the return trip. Really, you can\u0027t do this because you don\u0027t have perfect control over your thrust angle, you have finite burns (Oberth effect!), and you can\u0027t judge when to do your landing burn accurately enough to do a real suicide burn (not if you\u0027re being even mildly safe). So I wouldn\u0027t expect anyone to be able to do a jump and return of much more than 12 km without special circumstances or a very clever exploitation of the extra physics I omitted.\u003C/p\u003E\u003Cp\u003EBased on what I\u0027ve read here, that seems pretty close to what people are able to do, so I wouldn\u0027t plan on any 50 km return trips. That\u0027s why we have rovers. And rockets.\u003C/p\u003E\n"}]}