{"TopicId":30938,"ForumId":16,"TopicTitle":"Calculate (and plan) a flight - How much fuel do you need, what weight ist okay...","CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-06-02T16:54:25Z","PageNum":1,"Articles":[{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-06-02T16:54:25Z","Content":"\n\u003Cp\u003EHey,\u003C/p\u003E\u003Cp\u003Esince I play this game, I\u0027m very interested in this whole physics stuff. After few hours in the game, I found out, what NASA is doing and especially \u003Cstrong\u003Ehow\u003C/strong\u003E they do do things. Before, I had no clue^^.\u003C/p\u003E\u003Cp\u003EI know that the game simplifies everything so everyone can play it without being a physicist or so. Anyway, the game is still more realistic than other games. And it\u0027s a great fun to play Kerbal Space program \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003EAnd as I like numbers and formulae, I would like to learn how to calculate things in Kerbal Space Program.\u003C/p\u003E\u003Cp\u003ECurrently, I randomly connect parts to my spaceship without looking for their values and information. I take some parts and test them. Mostly, it goes terribly wrong and I have to adjust the parts or exchange them many times, before the launch works. That\u0027s because I don\u0027t really know what information are given when I mouseover a part. The only thing I know is the mass or the elctrical charge.\u003C/p\u003E\u003Cp\u003EI would like to change this. I want to calculate how much fuel I need to get into orbit/to another planet according to the mass of my spacecraft. Or how much delta-V my ship has (although I still don\u0027t understand why a ship can \u003Cstrong\u003Ehave\u003C/strong\u003E delta-v. I thought delta-v is the additional velocity that is needed to change orbit or something).\u003C/p\u003E\u003Cp\u003EI know, it might be difficult, but I\u0027m keen to try learning this. Of course not in the way NASA is doing this^^, but the more \u0022simple\u0022 ways.\u003C/p\u003E\u003Cp\u003EUnfortunately, I couldn\u0027t find any tutorials on how to do this. I just found this in the wiki:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:Advanced_Rocket_Design\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Tutorial:Advanced_Rocket_Design\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOn this page is explained how to calculate delta-v. I understand that except for this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/math/0/4/8/0483f8c3776bea32f980636d13d3d7a1.png\u0022 alt=\u00220483f8c3776bea32f980636d13d3d7a1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis ln*(m1/m2). How do I calculate this? According to wikipedia(\u003Ca href=\u0022https://en.wikipedia.org/wiki/Natural_logarithm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Natural_logarithm\u003C/a\u003E) it\u0027s a natural logarithm. But I don\u0027t get it:confused:\u003C/p\u003E\u003Cp\u003EAnd then: What can I do with this delta-v? Okay, I know what my rocket can achieve but how do I know if my ship can even launch?\u003C/p\u003E\u003Cp\u003EI have much more questions but I think I should understand the basic things first. \u003C/p\u003E\u003Cp\u003EI hope the text is not too confusing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E. It\u0027s just hard to explain.\u003C/p\u003E\u003Cp\u003EThank you for reading this post \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E and sorry if it\u0027s the wrong forum. I didn\u0027t know where this topic fits.\u003C/p\u003E\u003Cp\u003EGreetings,\u003C/p\u003E\u003Cp\u003EDennis\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2013-06-02T17:15:43Z","Content":"\n\u003Cp\u003EdV is the most important value for most of your game it says how much your current rocket can change its speed with the fuel and engines available at this stage.\u003C/p\u003E\u003Cp\u003EAs everything in space can be expressed as chang in orbits (and other things, like drag play only a marginbal role in vacuum) you just need to work with the speed change that is needed to get your orbit to the desired orbit to get a good approximation of the fuel needed (as a fraction of your total rocket weight) (which is given by 1-m1/m2). \u003C/p\u003E\u003Cp\u003EFor example ... to get from a 100km orbit around Kerbin to the Mun you just have to increse your speed so much that the apoapsis reaches to the 11.000 km orbit around mun for which you need a dV of ~800 (that is, you have to get 850 m/s faster than you are now) \u003C/p\u003E\u003Cp\u003E(of course this number is just an ideal ... and doesnÃ‚Â´t tell you where you have to start the burn to get the orbit in a way that you really hit mun at the time your rocket is at its apoapsis and there may be other circumstances that increase the real dV you need (and it also doesnÃ‚Â´t tell you anything about the ~300 m/s dV you need to slow your rocket down afterwards to get into a circular orbit around mun, instead of using mun as the center for a gravitaional slingshot out of Kerbins SoI \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ) )\u003C/p\u003E\u003Cp\u003ECalculating the logarithm naturalis is easy ... usually all scientific calculators (including the one you have in the utilities for windows) have a button for this ...\u003C/p\u003E\u003Cp\u003Eso you just have to divide the mass of your rocket after the fuel of this stage is expended by the total mass of the rocket before the stage is fired \u003C/p\u003E\u003Cp\u003E(with other words, you calculate the logarithm more or less on basis of the fration that the \u0022dead\u0022 mass of your rocket stage (i.e. the mass that is not fuel) takes)\u003C/p\u003E\u003Cp\u003E(and with still other words ... the whole term represents how your rocket gets lighter with the use of fuel ... from 1 (full weight of the rocket with fuel) to 0.something (frational weight of the rocket after fuel of the stagehas been expended)\u003C/p\u003E\u003Cp\u003EI can btw. definitely recommend the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/18230-0-20-Kerbal-Engineer-Redux-v0-6-0-3\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Engineer Redux\u003C/a\u003E - Mod.\u003C/p\u003E\u003Cp\u003EIt calculates dV, ISP, TWR and many more values on base of your current rocket (and includes an inflight item that you can use to monitor many important values during flight) ... for my spaceflight an absolute must\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-02T17:42:19Z\u0022 title=\u002206/02/2013 05:42  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 2, 2013\u003C/time\u003E by Godot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-06-02T19:36:59Z","Content":"\n\u003Cp\u003EAs for the specifics of the rocket equation itself, \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/engines.php\u0022 rel=\u0022external nofollow\u0022\u003EAtomic Rockets can break it down better than I ever could\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003ETo answer a few of the other concerns that might make things a bit easier to understand:\u003C/p\u003E\u003Cp\u003E1. Ships \u0022having\u0022 delta-v: You\u0027re correct; \u0022delta-v\u0022 is basically short for \u0022change in velocity.\u0022 Rockets work by accelerating a volume of propellant out an opening at one end; because of Newton\u0027s Third Law of Motion, this exerts an equivalent force on the rocket in the opposite direction. The more efficient your engine is, the faster it can get the propellant moving, and thus the more your rocket will accelerate for every bit of fuel it uses.\u003C/p\u003E\u003Cp\u003EImagine for a moment a rocket standing still in a featureless volume of space with no other forces acting upon it. Let\u0027s say that, for instance, this particular rocket has a delta-v rating of 1000 m/s. What that means is, if we burn all of it\u0027s fuel in one continuous burn, by the end of that burn the rocket will be moving in a straight line at a velocity of 1000 m/s. If we only burn half of that fuel, it\u0027ll be moving at 500 m/s; if we then turn it around and burn the other half of that fuel against our direction of travel, the rocket will come to a standstill again. In short, a rocket\u0027s \u0022delta-v\u0022 represents how much you can change that rocket\u0027s velocity with a given fuel load.\u003C/p\u003E\u003Cp\u003E2. \u0022How do I know if my ship will even launch?\u0022: That\u0027s actually governed by another number entirely, known as your \u0022thrust-to-weight ratio.\u0022\u003C/p\u003E\u003Cp\u003EEvery rocket engine has a certain maximum thrust rating (though I think the game calls it \u0022Power\u0022 in the VAB parts listings, which isn\u0027t an entirely accurate term). Again, a rocket engine exerts this thrust as a force pushing the rocket upward. At the same time, gravity exerts a force trying to pull your rocket downward (\u0022weight\u0022). The way to find your rocket\u0027s weight on the launchpad is to take its mass, then multiply by 9.8 m/s^2 (the value for surface gravity on Kerbin, identical to that for Earth) to find the total force exerted by gravity, then divide that into the total force exerted by your active engine\u0027s thrust. If that number is less than 1, then you are not going into space today.\u003C/p\u003E\u003Cp\u003E3. Natural logarithms: If you take a number and raise it to a power with an exponent, you get a second number. Relative to that second number, the exponent is the logarithm, and the first number is the base. For example, the logarithm of 1000 using 10 as the base is 3, since 10^3 = 1000.\u003C/p\u003E\u003Cp\u003ENow, the \u003Cem\u003Enatural logarithm\u003C/em\u003E of a given number uses a very special number called \u003Ca href=\u0022https://en.wikipedia.org/wiki/E_%28number%29\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cem\u003Ee\u003C/em\u003E (or Euler\u0027s number)\u003C/a\u003E as its base. Better minds than mine can tell you exactly how \u003Cem\u003Ee\u003C/em\u003E is derived, but suffice it to say that it\u0027s a Very Important Number for a lot of different calculations, to the point that any good scientific calculator should already have a handy \u0022LN\u0022 button you can press to get the natural logarithm of any number.\u003C/p\u003E\n"},{"CreatedByName":"Uberick","CreatedById":65954,"CreatedDateTime":"2013-06-02T23:14:19Z","Content":"\n\u003Cp\u003ESeeing as how this question has already been answered, I\u0027m gonna toss in my 2c seeing as how it can\u0027t hurt.\u003C/p\u003E\u003Cp\u003EFirst of all, that Atomic Rockets link is BRILLIANT,thanks Specialist.\u003C/p\u003E\u003Cp\u003EAlso worth reading(if you like calculations), is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/16511-Tutorial-Interplanetary-How-To-Guide\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/16511-Tutorial-Interplanetary-How-To-Guide\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAs a side note, you can find the gravity values for all the planets and moons on the KSP wiki. Substitute those into the equation in place of 9.81 to see if your ship will take off of THAT planet. As an example, Duna\u0027s value is 2.94, vs Kerbin\u0027s 9.81. As such, you need about a third of the thrust to lift a rocket on Duna. You can use that to pack the minimum amount of engines required, so you don\u0027t have any dead weight.\u003C/p\u003E\n"},{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-06-03T16:47:13Z","Content":"\n\u003Cp\u003EWow! You\u0027re awesome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Thank you very much! That helped me a lot.\u003C/p\u003E\u003Cp\u003EI think now I mostly understand delta-v. But I have still some questions about it:\u003C/p\u003E\u003Cp\u003E1. When you want to go to a 100km Kerbin orbit you need about 4700 m/s (according to the wiki). In the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:Advanced_Rocket_Design#Delta-V\u0022 rel=\u0022external nofollow\u0022\u003Eexample\u003C/a\u003E, Stage one \u003Cem\u003E3350 m/s\u003C/em\u003E and Stage 2 \u003Cem\u003E1168 m/s\u003C/em\u003E. Together, they almost achieve 4700 m/s. But only by using two stages. Is this profitable? If yes, what is a good altitude to start the next stage? I guess, it should be the edge of the atmosphere? Or would it be okay to reach orbit with one stage (that has a delta-v of about 4700 m/s) as well?\u003C/p\u003E\u003Cp\u003E2. But how does this number (4700 m/s) come about? Does this have sth. to do with the orbital velocity?\u003C/p\u003E\u003Cp\u003E3. What is the context of the Thrust-Weight-Ratio and delta-v? I might have a clue. I read this in the wiki:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIf we design our rockets to have 7600 total , and the acceleration of the launch stages are adequate, we can have confidence that our rocket is able to land on the Mun and return to Kerbin. A rocket with a little less can accomplish this goal, but it is less forgiving of less efficient piloting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo I think, we need both values to be high enough. If the ship has a delta-v of e.g. 7600 m/s but just a TWR of 0.5 it won\u0027t start. The explanation might be that you need a big acceleration to escape Kerbin. If you have small engines, they \u003Cem\u003Ewould\u003C/em\u003E reach 7600 m/s. But just very slowly and if there is gravity they can\u0027t even reach it.\u003C/p\u003E\u003Cp\u003EIs that right?\u003C/p\u003E\u003Cp\u003E4. What\u0027s when the value of TWR is extremly high, e.g. \u003Cstrong\u003E\u003Cem\u003E5 \u003C/em\u003E\u003C/strong\u003Eor something. Does it mean, the ship accelerates faster than with a value of 1? I know, that\u0027s not really important, it\u0027s just for understanding what that means \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003E5. @Godot: The mod is great^^. But one question: It shows me two values of delta-v (e.g. 2700 / 8500 m/s). What does that mean? What value is the \u0022right\u0022 one?\u003C/p\u003E\u003Cp\u003EAnd also with mass. First, I thought it would be \u0022dry mass / full mass\u0022. But the difference is sometimes to small (e.g. 42 000 kg / 46 000 kg). I don\u0027t get it. Sometimes I get with these values the right delta-v(which is written in the table) when I calculate it manually and sometimes not. That\u0027s confusing \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\u003Cp\u003E@Uberick: Thanks for the link. I definitely try this out but later on^^. It sounds a bit complicated\u003C/p\u003E\u003Cp\u003EAnd again, thank you for helping me \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2013-06-03T17:47:34Z","Content":"\n\u003Cp\u003E1. Well, all in all it doesnÃ‚Â´t matter too much how many stages you need (although using multiple stages could be a little bit more efficient if you set it up right) ... what matters is that the dV (if calculated right) is \u0026gt;= the dV needed ... what matters more with regards to the dV needed to get into Kerbins 100km Orbit is, how you perform your gravity turns ... peforming the right turns at the right altitudes can indeed make a difference between needing 4500 dV to get to the 100k orbit, or needing 5000\u002B (something that btw. is dependant on the individual rocket ... many people have taken up the standard practice of taken gravity turns at 10, 20 and 30km)\u003C/p\u003E\u003Cp\u003E2. You already cited the formula with which dV is calculated. All in all you can sum it up with ... the more efficient your engine is (expressed by Isp) and the more percent of your rocket is taken up by fuel (or more correctly, by fuel that can be used by the current stage to produce propulsion (in contrast to fuel that only gets used in latter stages ... this counts as payload for this stage) the higher your dV. One might \u003C/p\u003E\u003Cp\u003E3. It determines how much much more than its own weight the engine can lift (or, if calculated for a rocket/stage ... how much more than the rocket weight the engines of this stage can lift) ... so, if you have a TWR of 1.0, your rocket engines might (if your rocket currently is in air and facing upwards) just be able to keep your rocket at the same height, but not be able to ligft it up ... if it is below 1, then it might even just be able to slow the fall of the rocket, if your rocket currently is floating in the air and facing upwards. Therefore you should always try to have a TWR \u0026gt; 1.0 for your ascent stages (at least those stages that are active below ~60km ... in later stages you try to propel your rocket sideways -\u0026gt; TWR doesnÃ‚Â´t play too much of a role in those stages ... for the interplanetary stages the role of TWR becomes rather insignificant (at least if you donÃ‚Â´t mind the time needed to have your engines active to reach a certain speed)\u003C/p\u003E\u003Cp\u003E4. Yep, the higher the TWR, the faster your Propulsion ... for your ascent a TWR of 2.2 is more than sufficient as it allows you to reach terminal velocity (which you shouldnÃ‚Â´t exceed if you want to have an efficient ascent ... if you exceed terminal velocity you lose more energy due to atmospheric drag, than you lose due to gravity)\u003C/p\u003E\u003Cp\u003E5. The first one is the dV of the stage you are looking at, the second number is the sum of all preceding stages ... lets say you are looking at Stage 11 (which becomes active after stages 13 and 12) and it says 1100/4300 then 1100 is the dV of stage 11 and 4300 the sum of stages 11\u002B12\u002B13.\u003C/p\u003E\u003Cp\u003EAs for the mass ... mass of this stage vs. total mass of the rocket\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-03T17:54:08Z\u0022 title=\u002206/03/2013 05:54  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 3, 2013\u003C/time\u003E by Godot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-06-03T18:54:55Z","Content":"\n\u003Cp\u003EThank you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut I still don\u0027t get why it\u0027s 4700 m/s. I know, it\u0027s the delta-v you need to go into Kerbin\u0027s orbit. But this number doesn\u0027t depend on your engines, or? I mean, it doesn\u0027t matter what rocket you are flying with, you still need 4700 m/s delta-v to reach orbit. Or am I wrong?\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-06-03T19:19:29Z","Content":"\n\u003Cp\u003ERegarding point 3 in particular, it\u0027s best to keep in mind that the one factor that delta-v and TWR have in common is \u003Cem\u003Emass\u003C/em\u003E.\u003C/p\u003E\u003Cp\u003EBecause of Newton\u0027s second law of motion (F = ma), we know that a rocket\u0027s rate of acceleration is proportional to both the thrust of its engines and the total mass of the rocket. If we reduce the overall mass while keeping the same engines, our rocket will accelerate faster because it\u0027s pushing a smaller mass with the same amount of force.\u003C/p\u003E\u003Cp\u003ELikewise, the delta-v potential of a rocket is proportional to the propellant fraction and the efficiency of the engines used. If we reduce the size of the payload while keeping the same engines and propellant load, we increase the delta-v, because a smaller overall mass means our rocket has less momentum to overcome in order to reach a given velocity.\u003C/p\u003E\u003Cp\u003EIn light of both of those facts, we can come to the conclusion that ultimately, the best rocket for a given mission is the lightest rocket that can accomplish that mission.\u003C/p\u003E\u003Cp\u003EIn fact, it might help to think of the delta-v equation in terms of mass management. A rocket needs propellant in order to move its payload, but until that propellant is burned, it\u0027s just \u0022dead weight\u0022 that needs to be carried along, and thus you need more propellant to boost both the payload and the propellant you already have... and those costs add up quickly. This is why SSTO craft capable of carrying any signficant payload are so difficult to build, and why staging is so popular for many launches -- dropping unneeded mass at strategic points allows you to change how the equation is calculated in midflight.\u003C/p\u003E\u003Cp\u003EEDIT: Yes, the delta-v requirement for reaching a stable orbit around Kerbin is the same, assuming an ideal flight path. If you have a rocket that\u0027s capable of lifting you off Kerbin\u0027s surface and getting up to that delta-v target, it\u0027ll get you there regardless of how big the rocket itself is or how many engines it has.\u003C/p\u003E\u003Cp\u003EThink of it in the same way you think of money. Let\u0027s say you want to buy a train ticket that costs $100. It doesn\u0027t matter if you pay with a single $100 bill, 5 $20 bills, 10 $10 bills, or 10,000 pennies \u003Cspan style=\u0022font-size:8px;\u0022\u003Ealthough I \u003C/span\u003E\u003Cem\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Ereally\u003C/span\u003E\u003C/em\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E wouldn\u0027t recommend actually trying that last one in real life...\u003C/span\u003E As long as you can afford to pay the fare, you can get on the ride. If you\u0027re even a penny short, though, then you\u0027re out of luck, Chuck.*\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* Disclaimer: This applies equally to all individuals, regardless of whether or not your name is actually Chuck.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-03T19:29:15Z\u0022 title=\u002206/03/2013 07:29  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 3, 2013\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-06-04T04:42:19Z","Content":"\n\u003Cp\u003EOkay, but to say it with your example: I understand that you can buy the ticket with either one $100 bill or 10 10$ bills. But what I don\u0027t understand is, why does the ticket costs $100? Why not $1000 or $50? \u003C/p\u003E\u003Cp\u003ESo why is the delta-v 4700 m/s and not 6000 m/s or 500 m/s?\u003C/p\u003E\u003Cp\u003EYou can\u0027t calculate it with the formula I posted above, because you need the mass and the Isp. But 4700 m/s is a general value. So how do you get this number?\u003C/p\u003E\u003Cp\u003ESorry for annoying you, I just want to understand it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-06-04T05:13:36Z","Content":"\n\u003Cp\u003EThat\u0027s perfectly alright \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E If you\u0027re honestly trying to learn, there\u0027s no such thing as a stupid question.\u003C/p\u003E\u003Cp\u003EAgain, I find that \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/mission.php\u0022 rel=\u0022external nofollow\u0022\u003EAtomic Rockets explains things much better than I can\u003C/a\u003E, but to summarize as best as I can:\u003C/p\u003E\u003Cp\u003EEvery planet has a minimum cost based on that planet\u0027s size and mass. On top of that, as you\u0027re lifting off, you\u0027re fighting against both gravitational drag (i.e. drag exerted as a force on your rocket as it tries to pull you back down) and atmospheric drag (drag exerted by the atmosphere pressing against your rocket and trying to slow it down as it tries to fly upwards). (Since Atomic Rockets doesn\u0027t provide any information on atmospheric drag, you\u0027ll probably have to use the data from the KSP wiki page \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Atmosphere\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E to figure that out.)\u003C/p\u003E\u003Cp\u003EI\u0027m going to admit that I\u0027m still wrapping my head around the atmospheric math myself, so if you want more details on that, you might want to wait for someone more knowledgeable to chip in. (Maybe alterbaron is still around; that sort of question would be right up his alley...)\u003C/p\u003E\n"},{"CreatedByName":"triffid_hunter","CreatedById":61814,"CreatedDateTime":"2013-06-04T05:44:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Akeno\u0022 data-cite=\u0022Akeno\u0022\u003E\u003Cdiv\u003EOkay, but to say it with your example: I understand that you can buy the ticket with either one $100 bill or 10 10$ bills. But what I don\u0027t understand is, why does the ticket costs $100? Why not $1000 or $50? \u003Cp\u003ESo why is the delta-v 4700 m/s and not 6000 m/s or 500 m/s?\u003C/p\u003E\u003Cp\u003EYou can\u0027t calculate it with the formula I posted above, because you need the mass and the Isp. But 4700 m/s is a general value. So how do you get this number?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eyou start off at some altitude, with some horizontal velocity from the planet\u0027s rate of spin.\u003C/p\u003E\u003Cp\u003EWhen you are in orbit, you have a higher altitude and a higher velocity (unless the planet is spinning more than fast enough to tear itself apart). You need a particular velocity at any given orbital altitude which reduces as you get further from the planet. If you don\u0027t have enough horizontal velocity, you will fall back into the atmosphere and burn up.\u003C/p\u003E\u003Cp\u003EOn kerbin, you start off with a horizontal velocity of something like 220m/s at an altitude of about 50-60m above sea level. The atmosphere ends at 70km and you need about 2300m/s velocity at that altitude to remain in orbit.\u003C/p\u003E\u003Cp\u003ESo a kerbin launch requires you to gain 2100m/s in horizontal velocity and lift your launch mass by at least 70km vertically. I usually go for at least 90km so I don\u0027t risk grazing the atmosphere during rendezvous maneuvers, and prefer 125km since I can warp faster there.\u003C/p\u003E\u003Cp\u003EIt takes energy to push mass up a gravity well. it also takes energy to impart higher velocity to that mass when remaining at the same \u0027height\u0027 in the gravity well.\u003C/p\u003E\u003Cp\u003EThat accounts for most of the dV required to get off the planet (I guess at least 3400m/s). The rest is consumed by atmospheric drag- it takes energy to push all that air out of the way on the way up!\u003C/p\u003E\u003Cp\u003Efwiw I\u0027m finding that it\u0027s possible to achieve orbit with as little as 4400 m/s dV these days, have a play with my \u003Ca href=\u0022http://triffid-hunter.no-ip.info/Fuel%20Tanker%20no%20MechJeb.craft\u0022 rel=\u0022external nofollow\u0022\u003EFuel Tanker no MechJeb.craft\u003C/a\u003E and see how you go. It also demonstrates asparagus staging which gives a _huge_ boost to dV by dropping empty fuel tanks and superfluous engines as early as possible.\u003C/p\u003E\u003Cp\u003Eps: note that the dV figure has already taken the mass of your craft into account, and balanced it vs the thrust of your engines and their fuel efficiency. That\u0027s why the required dV is approximately the same for both very large and very small craft!\u003C/p\u003E\n"},{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2013-06-04T06:32:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Akeno\u0022 data-cite=\u0022Akeno\u0022\u003E\u003Cdiv\u003EOkay, but to say it with your example: I understand that you can buy the ticket with either one $100 bill or 10 10$ bills. But what I don\u0027t understand is, why does the ticket costs $100? Why not $1000 or $50? \u003Cp\u003ESo why is the delta-v 4700 m/s and not 6000 m/s or 500 m/s?\u003C/p\u003E\u003Cp\u003EYou can\u0027t calculate it with the formula I posted above, because you need the mass and the Isp. But 4700 m/s is a general value. So how do you get this number?\u003C/p\u003E\u003Cp\u003ESorry for annoying you, I just want to understand it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHi Akeno,\u003C/p\u003E\u003Cp\u003EGreat questions:) Imagine you are on ice skates standing stationary on a nearly frictionless frozen lake. In one hand you are holding one end of a spring which is attached to an old piling jutting out of the ice. Consider it a fixed point. If you are at rest and the spring is totally unstretched then there is no energy present in this system. Now say you start skating. Since you are still holding the spring you are rotating about the post (the spring doesn\u0027t tangle up, its on free rotating bearing or something...its not a perfect analogy). As you skate faster and faster what do you expect to happen? Your radius of rotation will increase won\u0027t it? In this case energy \u003Cstrong\u003Eis\u003C/strong\u003E present in the system, in the form of the kinetic energy of you the iceskater, and of the potential energy of the spring. Again not a perfect analogy, gravity isn\u0027t quite like a spring, gravitational force decreases with distance, whereas spring force increases with distance. But, it turns out that since energy is conserved (assuming no friction:)) the energy of the total system remains constant and we get an equation called the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Vis-viva_equation\u0022 rel=\u0022external nofollow\u0022\u003Evis-viva equation\u003C/a\u003E we we take the sum of the kinetic energy and the gravitational potential energy to get the total energy of the system (if you multiply all of the terms of each side of the vis-viva equation by m for mass, after a little bit of algebra it becomes the conservation of energy equation). If you happen to know what the radius of your orbit is and the gravitational parameter mu for the plant you are orbiting, you can use the vis-viva equation to calculate your orbital velocity. If you recalculate with a different r, and compare the different values of v you have your delta-v... mind you this is your total delta-v, not the delta-v required for say a Hohmann transfer orbit. Does any of that make sense?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-04T06:36:14Z\u0022 title=\u002206/04/2013 06:36  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 4, 2013\u003C/time\u003E by architeuthis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Akeno","CreatedById":67874,"CreatedDateTime":"2013-06-05T19:11:41Z","Content":"\n\u003Cp\u003EThanks for the replies \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI read through the \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/mission.php\u0022 rel=\u0022external nofollow\u0022\u003EAtmic Rockets\u003C/a\u003E page and your answers. Some things are now a bit clearer.\u003C/p\u003E\u003Cp\u003E__________________________________________________\u003C/p\u003E\u003Cp\u003EOkay, so when I want to go to orbit I have to consider 3 things\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe horizontal speed that I need\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe vertikal speed which includes gravitational and atmospheric drag\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnd the sum of theese amount to the total delta-v I need to go into orbit.\u003C/p\u003E\u003Cp\u003EIs that right so far?\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHow do I calculate the horizontal speed\u003C/strong\u003E? According to Atomic Rockets it\u0027s this equation:\u003C/p\u003E\u003Cp\u003E -\u0026gt; dVo = sqrt[ (G * Pm) / Pr ]\u003C/p\u003E\u003Cp\u003EMy question about that is: on the Atomic Rockets page they write, this is the delta-v which is need to achieve orbital velocity. But what orbit do they mean? 70km? 100km? Or is this changeable by changing the radius of the planet? (i.g. 700 000m for a 100km orbit?)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EAnd the gravitational Speed:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E -\u0026gt; Apg = A / g\u003C/p\u003E\u003Cp\u003E -\u0026gt; dVd = delta-escape / Apg\u003C/p\u003E\u003Cp\u003EA = spacecraft\u0027s acceleration (m/s^2). How do I calculate this? I think in the game is only the thrust, not the acceleration. Or did I overlook something?\u003C/p\u003E\u003Cp\u003Eg = acceleration due to gravity on planet\u0027s surface.\u003C/p\u003E\u003Cp\u003EAccording to the Atomic Rockets page, you can\u0027t simply calculate the \u003Cstrong\u003Eatmospheric drag\u003C/strong\u003E. Is that important?\u003C/p\u003E\u003Cp\u003E___________________________________________________\u003C/p\u003E\u003Cp\u003EAs for the vis-viva equation:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/math/9/9/1/99141ee42424be2c2c2f9c3491ae67d5.png\u0022 alt=\u002299141ee42424be2c2c2f9c3491ae67d5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewhat is \u003Cem\u003Ea\u003C/em\u003E in this equation? I read through the article on wikipedia, but it seems to be very complicated.\u003C/p\u003E\u003Cp\u003E___________________________________________________\u003C/p\u003E\u003Cp\u003ENow a more general question: On the Atomic Rocket page, they often write about gravity or acceleration. But as unit they use \u003Cem\u003Em/s\u003C/em\u003E instead of \u003Cem\u003Em/s^2\u003C/em\u003E. Is that right or is it a typo?\u003C/p\u003E\u003Cp\u003E___________________________________________________\u003C/p\u003E\u003Cp\u003EOkay, now I think I should get practise with the basic stuff, such as delta-v calculation, TWR and building a good and light rocket.\u003C/p\u003E\u003Cp\u003EIf I have a question, I will post it here \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E.\u003C/p\u003E\u003Cp\u003EThank you in advance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAkeno\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-06-05T21:33:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Akeno\u0022 data-cite=\u0022Akeno\u0022\u003E\u003Cdiv\u003EThanks for the replies \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problem!\u003C/p\u003E\u003Cp\u003EI\u0027ll preface this by stating once again that there are others who probably understand the math much better than I do, at least when it gets beyond the more basic ideas.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOkay, so when I want to go to orbit I have to consider 3 things\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EThe horizontal speed that I need\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EThe vertikal speed which includes gravitational and atmospheric drag\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnd the sum of theese amount to the total delta-v I need to go into orbit.\u003C/p\u003E\u003Cp\u003EIs that right so far?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds about right.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EHow do I calculate the horizontal speed\u003C/strong\u003E? According to Atomic Rockets it\u0027s this equation:\u003Cp\u003E -\u0026gt; dVo = sqrt[ (G * Pm) / Pr ]\u003C/p\u003E\u003Cp\u003EMy question about that is: on the Atomic Rockets page they write, this is the delta-v which is need to achieve orbital velocity. But what orbit do they mean? 70km? 100km? Or is this changeable by changing the radius of the planet? (i.g. 700 000m for a 100km orbit?)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf my understanding of this particular equation is correct, it\u0027s the minimum horizontal velocity you\u0027d need to achieve at the altitude index level (aka \u0022sea level\u0022) in order to maintain a stable orbit around the planet just above the surface, assuming a perfectly smooth spherical surface, no atmosphere to provide drag, and instantaneous horizontal acceleration. In practice, of course, you really can\u0027t rely on any of those to be true.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003EAnd the gravitational Speed:\u003C/strong\u003E\u003Cp\u003E -\u0026gt; Apg = A / g\u003C/p\u003E\u003Cp\u003E -\u0026gt; dVd = delta-escape / Apg\u003C/p\u003E\u003Cp\u003EA = spacecraft\u0027s acceleration (m/s^2). How do I calculate this? I think in the game is only the thrust, not the acceleration. Or did I overlook something?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re forgetting one of the two basic equations I mentioned earlier: Force = mass * acceleration (F = ma). Solved for acceleration, a = F/m. It\u0027s the same procedure you use to calculate TWR, only you\u0027re measuring the ship\u0027s raw acceleration without taking the extra step of dividing acceleration due to gravity into it.\u003C/p\u003E\u003Cp\u003Eg = acceleration due to gravity on planet\u0027s surface.\u003C/p\u003E\u003Cp\u003E(Something to watch out for: A stage\u0027s final maximum acceleration is going to be higher than it\u0027s initial maximum acceleration, because you\u0027re burning fuel throughout the process, which is reducing its mass at a constant rate (assuming you don\u0027t touch the throttle during the burn). The actual \u003Cem\u003Eaverage\u003C/em\u003E acceleration for the whole burn is probably going to be the mean between the initial and final maximum values for that one stage -- and calculating each stage individually by hand is a long, arduous, repetitive, and potentially maddening affair, the sort of tedium that people who really want to work it out tend to create spreadsheets for so that they can just plug in the values that they want. Plugging in a flat value of 20 m/s^2 -- a little over 2g -- can give you a very rough idea of what the ideal ascent delta-v should look like, though.)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAccording to the Atomic Rockets page, you can\u0027t simply calculate the \u003Cstrong\u003Eatmospheric drag\u003C/strong\u003E. Is that important?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere on Earth, that\u0027s because the atmosphere is not a universally uniform blanket of pressure. On Kerbin it is, meaning that you could in theory calculate the total acceleration due to drag over the course of your burn time to get a reasonable approximation. \u003Cspan style=\u0022font-size:8px;\u0022\u003EI\u0027m still wrapping my head around how exactly would be the best way to do this myself...\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs for the vis-viva equation:\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/math/9/9/1/99141ee42424be2c2c2f9c3491ae67d5.png\u0022 alt=\u002299141ee42424be2c2c2f9c3491ae67d5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ewhat is \u003Cem\u003Ea\u003C/em\u003E in this equation? I read through the article on wikipedia, but it seems to be very complicated.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe value \u003Cem\u003Ea\u003C/em\u003E is for an orbit\u0027s \u003Cem\u003Esemi-major axis\u003C/em\u003E, which is one of the parameters that defines the shape and position of an orbit relative to its central body. In game terms, you find the sum of your orbit\u0027s apoapsis and periapsis and the planet or moon\u0027s diameter, then split that total in half. \u003C/p\u003E\u003Cp\u003EMost of the orbits you\u0027re really going to worry about are going to be ellipses, with the body in question at one focus. \u003Cspan style=\u0022font-size:8px;\u0022\u003EThe other two types are parabolas and hyperbolas, which can get... interesting and confusing compared to ellipses.\u003C/span\u003E I don\u0027t know how much geometry you\u0027ve studied before picking up this game, but I\u0027d recommend \u003Ca href=\u0022http://www.mathsisfun.com/geometry/ellipse.html\u0022 rel=\u0022external nofollow\u0022\u003Ethis page\u003C/a\u003E if you need either a crash course or a refresher. Specifically, the semi-major axis is exactly half the length of the orbit\u0027s major axis.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENow a more general question: On the Atomic Rocket page, they often write about gravity or acceleration. But as unit they use \u003Cem\u003Em/s\u003C/em\u003E instead of \u003Cem\u003Em/s^2\u003C/em\u003E. Is that right or is it a typo?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, if it\u0027s written like that, it\u0027s most definitely a typo... unless you\u0027re seeing it as \u003Cem\u003Em/s\u003C/em\u003E\u003Csup\u003E\u003Cem\u003E2\u003C/em\u003E\u003C/sup\u003E, which is correct; the caret (\u0022^\u0022) is just a way to represent that the following number is an exponent when typing in a format that doesn\u0027t support superscripts.\u003C/p\u003E\u003Cp\u003EHope this all helps!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T22:44:57Z\u0022 title=\u002206/05/2013 10:44  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003C/span\u003E\n"}]}