{"TopicId":31157,"ForumId":16,"TopicTitle":"Which key is for stage lock","CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2013-06-03T20:17:23Z","PageNum":1,"Articles":[{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2013-06-03T20:17:23Z","Content":"\n\u003Cp\u003ENormally i don\u0027t need this because i knew when hit space bar and when don\u0027t:)\u003C/p\u003E\u003Cp\u003EBut i have some problem with re-entry parachute open to to early on to high altitude and most of all to fast, opening chute when capsule still is in Ionization phase. Re-entry flames and boom chute open is very unrealistic.\u003C/p\u003E\u003Cp\u003EIn previous i just putted empty stage, between separation of service module and chute, but in 0.20 it\u0027s not working.\u003C/p\u003E\u003Cp\u003ESo how lock staging i forgot which key to press.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-03T20:19:23Z","Content":"\n\u003Cp\u003Ealt_L is the default.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-06-03T20:26:18Z","Content":"\n\u003Cp\u003EAlt \u002B L.\u003C/p\u003E\u003Cp\u003E(Min 10 letter thing)\u003C/p\u003E\n"},{"CreatedByName":"1001sd","CreatedById":57737,"CreatedDateTime":"2013-06-03T20:28:37Z","Content":"\n\u003Cp\u003EAnd if you are using the linux build, you\u0027ll need to use right shift instead of alt. In linux the alt key is used to something else.\u003C/p\u003E\n"},{"CreatedByName":"Pawelk198604","CreatedById":35539,"CreatedDateTime":"2013-06-03T22:01:52Z","Content":"\n\u003Cp\u003EThanks, but that not helped with my chute it\u0027s still open to early even if put empty stage and lock staging the game just ignore this.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-06-03T22:24:56Z","Content":"\n\u003Cp\u003EIs not the Alt-L just an safety against pressing space during flight. Decouple the pod from fuel and engine then inbound for an Jool aerobrake has some downsides.\u003C/p\u003E\n"},{"CreatedByName":"rpayne88","CreatedById":58336,"CreatedDateTime":"2013-06-04T01:20:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pawelk198604\u0022 data-cite=\u0022Pawelk198604\u0022\u003E\u003Cdiv\u003EThanks, but that not helped with my chute it\u0027s still open to early even if put empty stage and lock staging the game just ignore this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooking at your signature, did you just come up with it or did you copy it from the internet. Ad astra per aspera means to the stars through adversity. The only reason I know this is because I\u0027m in the Civil Air Patrol (Google it for more info) and that\u0027s my squadron\u0027s motto. I don\u0027t think we made it our own, but we may have, but I don\u0027t give a damn who uses it and what for. Just interested. I\u0027m just as clueless as to how to activate stage lock, though.\u003C/p\u003E\n"},{"CreatedByName":"NeoMorph","CreatedById":58200,"CreatedDateTime":"2013-06-05T16:56:05Z","Content":"\n\u003Cp\u003EAd Astra GTC SRI... that\u0027s all mine... lol. And mine is red.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-06-05T17:13:19Z","Content":"\n\u003Cp\u003EThe solution to the OP problem is as easy as it is obvious: Put the chutes on a separate stage. Chutes \u003Cstrong\u003Eonly\u003C/strong\u003E deploy when their stage is activated and stages \u003Cstrong\u003Enever\u003C/strong\u003E activate on their own. Sometimes it may look like a stages decides to trigger on it\u0027s own but that is probably MechJeb. Even when MechJeb\u0027s \u0027Ascent guidance\u0027 is deactivated it can and will still trigger stages. To avoid this simply de-select the \u0027auto stage\u0027 before closing the ascent window.\u003C/p\u003E\n"},{"CreatedByName":"rosenkranz","CreatedById":57152,"CreatedDateTime":"2013-06-05T17:27:05Z","Content":"\n\u003Cp\u003EI was just having a similar problem last night. I had a sky crane set up and the decoupler was the last stage. The idea being to stage a few meters from the ground and let the skycrane go off on it\u0027s own.\u003C/p\u003E\u003Cp\u003EHowever, the staging locked itself and I could not for love nor money get it to unlock. Once down, i had to manually bring the throttle back up just below liftoff thrust and right click the decoupler to decouple manually.\u003C/p\u003E\n"}]}