{"TopicId":31179,"ForumId":16,"TopicTitle":"Good Ascending Node for a polar Mun Orbit?","CreatedByName":"ls612","CreatedById":65397,"CreatedDateTime":"2013-06-03T22:30:35Z","PageNum":1,"Articles":[{"CreatedByName":"ls612","CreatedById":65397,"CreatedDateTime":"2013-06-03T22:30:35Z","Content":"\n\u003Cp\u003EI am thinking of setting up a munbase near the pole, but I would like to be efficent about this and am wondering what the ideal AN between me and the Mun should be to get into a Polar orbit with minimal delta-V after SOI change. Does anyone know what that would be?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-03T22:45:59Z\u0022 title=\u002206/03/2013 10:45  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 3, 2013\u003C/time\u003E by ls612\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZedNova","CreatedById":57175,"CreatedDateTime":"2013-06-03T23:31:20Z","Content":"\n\u003Cp\u003Etry to do as much of it as you can BEFORE you reach it\u0027s SOI. then make minor corrections after SOI.\u003C/p\u003E\n"},{"CreatedByName":"itsme86","CreatedById":59895,"CreatedDateTime":"2013-06-03T23:53:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ls612\u0022 data-cite=\u0022ls612\u0022\u003E\u003Cdiv\u003EI am thinking of setting up a munbase near the pole, but I would like to be efficent about this and am wondering what the ideal AN between me and the Mun should be to get into a Polar orbit with minimal delta-V after SOI change. Does anyone know what that would be?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure it depends on the distance of the AN from the Mun. 0.3 degrees means a lot more when you\u0027re 500,000,000 away than when you\u0027re 5,000,000 away. Are you talking about LKO?\u003C/p\u003E\n"},{"CreatedByName":"architeuthis","CreatedById":57137,"CreatedDateTime":"2013-06-04T01:06:18Z","Content":"\n\u003Cp\u003EDo the plane change maneuver when you are going as slow as possible. The delta-v required is approximately dV=2*v*sin(theta/2), were theta is in radians, and a circular orbit is assumed. Probably the cheapest way to go about this is to get an encounter with the mun at as low of an altitude as possible, wait till periapse and burn till you are just captured by the mun, then wait till apoapse and make your plane change there. When you have the desired inclination you can circularize to whatever orbit you like.\u003C/p\u003E\n"},{"CreatedByName":"SalmonellaDingDong","CreatedById":57168,"CreatedDateTime":"2013-06-04T01:07:55Z","Content":"\n\u003Cp\u003EGet into mun orbit. Right after capture when you still have a huge apoapsis, go out to apoapsis and do the burn there.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-06-04T01:52:08Z","Content":"\n\u003Cp\u003EThe AN and DN are simply the points where two orbits with different inclinations cross one another, so I\u0027m not sure exactly what you are asking. Can you rephrase the question without using that term?\u003C/p\u003E\n"},{"CreatedByName":"ls612","CreatedById":65397,"CreatedDateTime":"2013-06-04T02:41:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoboRay\u0022 data-cite=\u0022RoboRay\u0022\u003E\u003Cdiv\u003EThe AN and DN are simply the points where two orbits with different inclinations cross one another, so I\u0027m not sure exactly what you are asking. Can you rephrase the question without using that term?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m wanting to get from LKO to a polar Mun orbit with minimal delta-v, and with the Maneuver nodes I can see what the AN would be if I didn\u0027t hit the Mun. I want to know how high that is and how much I need to burn normal to get that in the same burn as my injection.\u003C/p\u003E\n"},{"CreatedByName":"alexmun","CreatedById":68608,"CreatedDateTime":"2013-06-04T04:31:41Z","Content":"\n\u003Cp\u003EHere\u0027s the method I use to get the orbital inclination I want upon insertion around a new body:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EDo your insertion burn at periapsis as usual, but stop as soon as you have an apoapsis inside the SOI (you need to be quick on the engine cut-off because the apoapsis will be moving FAST when it first appears).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWait until you\u0027re back at apoapsis, then do a normal inclination change. Your orbital velocity should be nearly zero so the inclination change will be almost free.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGo back to periapsis and circularize as usual.\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis typically only takes a few delta-v more than a normal orbital insertion and you can get whatever inclination you want. The only disadvantage is it takes one extra orbit.\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-06-04T12:29:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ls612\u0022 data-cite=\u0022ls612\u0022\u003E\u003Cdiv\u003EI\u0027m wanting to get from LKO to a polar Mun orbit with minimal delta-v, and with the Maneuver nodes I can see what the AN would be if I didn\u0027t hit the Mun. I want to know how high that is and how much I need to burn normal to get that in the same burn as my injection.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m still confused by \u0022\u003Cem\u003EI can see what the AN would be if I didn\u0027t hit the Mun\u003C/em\u003E.\u0022 The altitude of your AN or DN doesn\u0027t really have any meaning, other than it requires less delta-v to adjust your inclination via burns along the Normal axis \u003Cstrong\u003Eat the crossing node\u003C/strong\u003E when your crossing node is higher, because your velocity is lower. However, you don\u0027t need to do much of a Normal burn at all to attain a polar orbit around the Mun, and you don\u0027t have to wait until you\u0027re at the crossing node to do it:\u003C/p\u003E\u003Cp\u003EImmediately after you make your transfer injection out of LKO, turn toward north or south (along the Normal axis) and make a tiny burn while watching your Periapsis at the Mun (setting Conics Mode to \u00220\u0022 helps see what you\u0027re doing). You want to adjust your Pe to be directly over the north or south pole. When arriving at a body, the latitude of your Pe influences your inclination. If you put your Pe along the equator, you\u0027ll have a low-inclination equatorial orbit, while putting it over a pole yields a polar orbit. Setting up your arrival trajectory from LKO requires very little fuel, since you\u0027re effectively at your Apoapsis in regards to the Mun. You may have to make a bit of Prograde/Retrograde or Radial burn to get your Pe exactly where you want it. You may find it helpful to make these adjustments with RCS, as they don\u0027t require much push and RCS allows you to thrust in any direction without turning the craft.\u003C/p\u003E\u003Cp\u003EYou may even be able to roll these adjustments right into your transfer maneuver planning node, but the coarse control offered by pulling on the handles makes it tricky. The Maneuver Node Improvement tool hasn\u0027t been updated for 0.20.x yet, but it reportedly works. It makes fine node adjustments easier, by allowing you to type in the exact amounts of delta-v to apply along each axis.\u003C/p\u003E\u003Cp\u003EYou may still need a slight Normal burn after entering the Mun\u0027s SOI to pin down a precise inclination if you want a specific angle. Do this while passing over the Mun\u0027s equator, as that\u0027s the only time you\u0027ll be able to select any arbitrary final inclination. Also do it as high as possible, so it requires the least amount of propellent.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-04T12:50:57Z\u0022 title=\u002206/04/2013 12:50  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 4, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ls612","CreatedById":65397,"CreatedDateTime":"2013-06-04T15:06:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027m still confused by \u0022I can see what the AN would be if I didn\u0027t hit the Mun.\u0022 The altitude of your AN or DN doesn\u0027t really have any meaning, other than it requires less delta-v to adjust your inclination via burns along the Normal axis at the crossing node when your crossing node is higher, because your velocity is lower. However, you don\u0027t need to do much of a Normal burn at all to attain a polar orbit around the Mun, and you don\u0027t have to wait until you\u0027re at the crossing node to do it:\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, maybe I\u0027m setting up the burn poorly, but what I\u0027m doing now is setting the Mun as a target while I\u0027m in LKO, then adding normal/antinormal velocity to the node BEFORE adding anything prograde (This is all in the planning stage, not actually burning). This causes the projected inclination to change which gives an AN and DN relative to the Mun. I know then if I burn prograde on top of that I\u0027ll end up in an inclined Mun orbit if I time it right. I\u0027m wanting to do things efficently (in one burn) and would like to know what those ascending/descending numbers should be before I tack on the prograde burn to my maneuver node. I know I could use MechJeb or something to do this for me but that really isn\u0027t the point, I want to learn how to do it myself.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-04T15:09:45Z\u0022 title=\u002206/04/2013 03:09  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 4, 2013\u003C/time\u003E by ls612\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-06-04T15:22:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ls612\u0022 data-cite=\u0022ls612\u0022\u003E\u003Cdiv\u003EOK, maybe I\u0027m setting up the burn poorly, but what I\u0027m doing now is setting the Mun as a target while I\u0027m in LKO, then adding normal/antinormal velocity to the node BEFORE adding anything prograde (This is all in the planning stage, not actually burning). This causes the projected inclination to change which gives an AN and DN relative to the Mun. I know then if I burn prograde on top of that I\u0027ll end up in an inclined Mun orbit if I time it right. I\u0027m wanting to do things efficently (in one burn) and would like to know what those ascending/descending numbers should be before I tack on the prograde burn to my maneuver node. I know I could use MechJeb or something to do this for me but that really isn\u0027t the point, I want to learn how to do it myself.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, now I think I see... you\u0027re trying to do what I was suggesting, but in the opposite order (figuring out the required inclination change first, then setting the prograde burn).\u003C/p\u003E\u003Cp\u003EWhile that is a viable method, I think you\u0027re making it much, much harder on yourself than it needs to be by going about it in that way. You won\u0027t get any feedback on whether or now you\u0027ve set an accurate normal component until after establishing the prograde component. The inclination you need to set will also vary with your starting orbital period around Kerbin, so there really is no simple answer to your specific question.\u003C/p\u003E\u003Cp\u003EIt\u0027s a lot easier to reverse the order of operations, setting your prograde component first (whether by maneuver planning node or by actually making the burn), and then making the fine adjustments to attain your desired inclination. You can actually see the effects of your normal-axis changes as you make them this way, instead of shooting blind and hoping you got it right.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-04T15:30:11Z\u0022 title=\u002206/04/2013 03:30  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 4, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ls612","CreatedById":65397,"CreatedDateTime":"2013-06-04T20:55:38Z","Content":"\n\u003Cp\u003EI know that that is easier but I would like to be efficent about this, especially considering that some of the cargoes are going to be full Orange Tanks. I\u0027m thinking that the best way is to just do a trig calculation with the radius of the moon and the distance to it as two sides of a triangle, and the AN being the angle between the hypotenuse and the elipitic. That gives an AN of about 1.2 degrees. So I guess I\u0027ve answered my own question then.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-06-05T12:48:33Z","Content":"\n\u003Cp\u003EYou\u0027re not going to see significant improvements in efficiency. You get the exact same results by using the maneuver planning system to establish the prograde component of your transfer, then adding the normal component to achieve your desired arrival inclination before making the combined burn.\u003C/p\u003E\u003Cp\u003EIf you\u0027re doing it manually, normal burn followed by prograde burn, the gain is probably less than the margin of error for making the precise burns and the inevitable corrections. And you\u0027re incurring additional steering losses on the inclination change, since you\u0027re burning 90 degrees off prograde. I\u0027m willing to bet the outcomes will be equivalent to the differences that would result simply from hand-flying the same trajectory change multiple times.\u003C/p\u003E\u003Cp\u003EYou\u0027ll also need to take into account where your AN and DN are along your orbit, because that\u0027s going to alter the inclination change you need. If your AN or DN is along the line between Kerbin and the Mun, your calculation will be correct. If your crossing nodes are off that line, you will need more or less of an inclination change depending on which pole of the Mun you intend to pass over, and the variation will increase as the position of your crossing nodes get further from the direct line.\u003C/p\u003E\u003Cp\u003ENow, the big question... did you calculate using the distance to the center of the Mun from Kerbin\u0027s center, from Kerbin\u0027s surface, or from your orbital altitude? And remember, you\u0027re not injecting from a position directly in between Kerbin and the Mun... you\u0027re almost halfway around, depending on your orbital period. Yeah, the difference will be small, but it\u0027s enough to matter when you\u0027re trying to obtain maximum efficiency, since you need to avoid any course-corrections. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(And just to make sure you understand, the AN is just the location where your orbit crosses the plane of the Mun\u0027s orbit while you\u0027re moving north. Your AN isn\u0027t 1.2 degrees... your orbital plane is inclined 1.2 degrees compared to the Mun. It\u0027s the incorrect way you keep using the term that was causing the confusion I had... It\u0027s like looking at a traffic speed-limit sign on the side of a road and saying \u0022My speedometer is 50kph.\u0022 Sorry, but it just doesn\u0027t make sense. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E )\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T16:02:59Z\u0022 title=\u002206/05/2013 04:02  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"}]}