{"TopicId":31253,"ForumId":16,"TopicTitle":"Is it normal for objects in Munar orbit to constantly rotate so I can\u0026#039;t dock?","CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T05:03:05Z","PageNum":1,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T05:03:05Z","Content":"\n\u003Cp\u003EI don\u0027t know if this is a bug or if it\u0027s correct behavior, because this is the first time I tried docking in Munar orbit instead of Kerbin orbit where I\u0027d done lots of docking before.\u003C/p\u003E\u003Cp\u003EI\u0027m having a heck of a hard time docking ships in orbit around the Mun because whichever ship I\u0027m currently not controlling always starts rotating on its own, even if its rotation had been stilled either by SAS or by using the cheat of stopping rotation via a brief time warp. Regardless of how its spin was stopped, it will start spinning again on its own when I leave control of it and use \u0022[\u0022 and \u0022]\u0022 to switch to the other ship. The spin is very very slow - maybe at a rate between about 0.5 RPM and 1.0 RPM or thereabouts, but it\u0027s JUST enough to make docking an infuriating pain because docking is such a slow gentle operation that tiny rotation rate is still enough to mess it up. I line up on the docking port from just a few meters away, and start drifting gently toward it at about 0.3 m/s, and by the time I get there the target craft has rotated far enough that the docking port is at too sharp and angle to connect. So far the only way I\u0027ve been able to do it is to constantly swap control back and forth with \u0022[\u0022 and \u0022]\u0022 to keep re-correcting the rotations of both craft to point toward each other, but since that makes the game forget the targeting (I have to re-target the clamps each time I switch) it\u0027s really fiddly.\u003C/p\u003E\u003Cp\u003EIs this normal behavior? Am I missing something? In Kerbin orbit, the target ships did NOT start rotating all on their own. The only other difference I can think of is that since this is the Mun, I\u0027m also using much smaller ships by the time I\u0027ve dropped all the stages to get here.\u003C/p\u003E\u003Cp\u003EIs there something about the tighter, smaller orbit of the Mun that makes this happen? I am doing this at an orbit with an altitude of only about 7000 m, which is possible on the barren Mun but not Kerbal. I started thinking about things like tidal forces causing swinging, but I don\u0027t think they\u0027re implemented in the game so its probably not that. I thought maybe it\u0027s an illusion due to the object orbiting the Mun, i.e. it\u0027s one revolution per orbit as the object stays fixed going in a big circle around, but the rotation rate is too fast for it to be that. If it was that it would be one rotation every 10 minutes or so, not, every minute.\u003C/p\u003E\u003Cp\u003EWhat am I doing wrong here?\u003C/p\u003E\u003Cp\u003EFor disclosure, I have these mods installed:\u003C/p\u003E\u003Cp\u003ECrew Manifest.\u003C/p\u003E\u003Cp\u003EThat\u0027s it. I removed most of the other mods with the most recent update, and then re-installed Crew Manifest.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T00:46:13Z\u0022 title=\u002206/05/2013 12:46  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003Cbr\u003E(set to [Answered])\n\u003C/span\u003E\n"},{"CreatedByName":"triffid_hunter","CreatedById":61814,"CreatedDateTime":"2013-06-04T05:19:07Z","Content":"\n\u003Cp\u003Eis it a glitch inducing rotation against the fixed stars, or simply the navball rotating due to your ship remaining stationary vs the fixed stars but moving relative to the moon, and your craft\u0027s respective orbits pulling them out of alignment?\u003C/p\u003E\u003Cp\u003Eif the latter, point your docking ports parallel to your orbit\u0027s axis which is north-south for an equatorial orbit. Then the apparent rotation will simply result in the docking port rolling rather than moving away. Also the orbits will be cocentric and simply cause your crafts to move closer and further away along the docking axis rather than shifting around.\u003C/p\u003E\u003Cp\u003EMechJeb\u0027s Smart A.S.S. has Orbit/NML\u002B and NML- for this. I always lock my space stations and other dockables to that orientation.\u003C/p\u003E\u003Cp\u003EIf all else fails, try docking in a higher, slower orbit.\u003C/p\u003E\u003Cp\u003Ehope this helps, post your results for anyone else who comes across this thread \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-06-04T05:21:01Z","Content":"\n\u003Cp\u003EIt\u0027s normal behavior, and yes, the fact that your orbit around the Mun is much tighter is definitely contributing to it; the drift also happens in Kerbin orbit, but it\u0027s much less noticeable precisely because you\u0027re moving around the edge of a much larger orbit.\u003C/p\u003E\u003Cp\u003EThat said, one thing that helps keep your ship stable is to point your target craft in either the \u0022normal\u0022 or \u0022antinormal\u0022 direction -- perpendicular to the direction of your orbit, but parallel to the Mun\u0027s surface. In an equatorial orbit, that would be either north (0 degrees on the Navball, lined up right in the horizon) or south (180 degrees, same), but for a significant inclination off that it gets tricky (though you can cheat a little bit by plotting a maneuver node along one of the purple vectors, then pointing in that direction).\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-04T05:54:29Z","Content":"\n\u003Cp\u003EThe ships are not rotating, but your perspective is. Consider the following bit of stunning computer graphics. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JMTnYQi.png\u0022 alt=\u0022JMTnYQi.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EYour ships (yellow arrows) are facing the same direction the whole time, but as they go around the world, their positions shift relative to each other, making them appear to rotate as you look from one to the other. The reason it\u0027s more noticeable around Mun is that your orbit, although slower in velocity than around Kerbin, is a smaller circle and therefore you are covering a larger angle in the same amount of time.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T06:03:49Z","Content":"\n\u003Cp\u003EThis seems to work well. Thanks for the advice. On a typical east-west oriented orbit, when I point straight north or south, docking becomes possible.\u003C/p\u003E\u003Cp\u003ENow the only question I can think of is... why? What\u0027s the physics behind this? I\u0027d understand if it was rotating at one rotation per orbit, but it\u0027s going faster than that so that can\u0027t be it. (Besides if it was just appearing to rotate once per orbit because it\u0027s not tide-locked, then why doesn\u0027t my craft experience the same effect? Anyway, it works now that I followed the advice.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T06:06:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYour ships (yellow arrows) are facing the same direction the whole time, but as they go around the world, their positions shift relative to each other, making them appear to rotate as you look from one to the other. The reason it\u0027s more noticeable around Mun is that your orbit, although slower in velocity than around Kerbin, is a smaller circle and therefore you are covering a larger angle in the same amount of time.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you re-read my initial post, you see that I mentioned this possibility already, but the fact that it\u0027s rotating more quickly than one revolution per orbit doesn\u0027t seem to fit this explanation.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T06:08:31Z","Content":"\n\u003Cp\u003E(On a purely forum-mechanics question - how do I set this thread subject\u0027s prefix to \u0022[answered]\u0022 now? I tried clicking on the edit button on the original post, but the subject and prefix doesn\u0027t appear to be editable.)\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T09:27:44Z","Content":"\n\u003Cp\u003ELooks like I spoke too soon. The problem is still there no matter how I rotate the craft, and I\u0027m starting to suspect it\u0027s a bug with that one craft rather than being universal. It doesn\u0027t happen with other spaceships I have. This specific craft is composed of exactly 8 parts:\u003C/p\u003E\u003Cp\u003E1 three-man capsule.\u003C/p\u003E\u003Cp\u003E1 senior docking port , on the pointy end of the capsule.\u003C/p\u003E\u003Cp\u003E6 struts to strengthen the connection between the docking port and the capsule - that were there because this was once a piece of a larger rocket and I wanted to strengthen that connection.\u003C/p\u003E\u003Cp\u003EThat\u0027s it - that\u0027s the entire craft. It\u0027s a broken off piece of a larger vessel that met with doom, but it\u0027s the piece with the crew capsule and I\u0027m trying to rescue them.\u003C/p\u003E\u003Cp\u003EI\u0027m trying to dock with it with another craft that has a senior docking port and then carry it home.\u003C/p\u003E\u003Cp\u003EFor some unknown reason THAT particular craft is rotating entirely on its own, and I know for a fact it\u0027s not the effect Vanamonde is talking about because the craft is rotating not just relative to the mun, but also relative to the stationary starfield background, AND furthermore I just noticed that it sometimes turns a different direction. It\u0027s behaving as if there was someone pressing \u0022W\u0022 for a while, then pressing \u0022A\u0022 for a while, then pressing \u0022D\u0022 for a while, etc even though my hands are completely off the keyboard. I\u0027d show it but the only video capture software I have is freeware FRAPS with a 30 second limitation and that\u0027s not enough to show the effect well. (And I\u0027m not paying for it just to use the software once. I\u0027d have to have more other uses for it too before I do that.)\u003C/p\u003E\n"},{"CreatedByName":"triffid_hunter","CreatedById":61814,"CreatedDateTime":"2013-06-04T11:27:23Z","Content":"\n\u003Cp\u003EAs far as I know, that can happen sometimes if you have clipped parts. occasionally, the VAB will place multiple parts in the same place if you leave symmetry on when placing longitudally. you can check your persistence file to see if that\u0027s happened. the format is human readable but rather verbose. There may be other ways it can happen.\u003C/p\u003E\u003Cp\u003EI vaguely recall there being some bug relating to rotating frames of reference that was fixed in one of the recent patches.. I presume you\u0027re using 0.20.2?\u003C/p\u003E\n"},{"CreatedByName":"Atanar","CreatedById":59913,"CreatedDateTime":"2013-06-04T12:42:11Z","Content":"\n\u003Cp\u003ELooks like you experienced the same as in this video:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/NoZ4q3xRGCQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003ETry exiting and reloading your save file.\u003C/p\u003E\n"},{"CreatedByName":"georgTF","CreatedById":57397,"CreatedDateTime":"2013-06-04T13:01:51Z","Content":"\n\u003Cp\u003ESadly i have suffered my fuel depot picking up rotation very quickly and becoming insanely difficult to dock with. Even when i kill rotation by quickly engaging/disengaging time warp, my depot starts spinning again. Far too much to be a side effect of orbiting... In fact, after killing rotation with timewarping, i notice \u0022gravity\u0022 slightly tugging the craft and spinning it up. It then continues until i can\u0027t chase the docking port anymore.\u003C/p\u003E\u003Cp\u003EIt may be a consequence of unintentional clipping. One depot certainly did have a probe core attached inside a large ASAS so that may be the problem.\u003C/p\u003E\u003Cp\u003EOne other thing i\u0027ve noticed is the altitude. Orbiting the Mun at 15km was much worse than 45km. Any idea why? It may be gravity or orbit, but really that sort of thing should not happen at all. It\u0027s really miserable to have to lug a huge pile of space crap into a proper orbit, only to find that it\u0027s nigh on impossible to dock with it.\u003C/p\u003E\n"},{"CreatedByName":"Scrogdog","CreatedById":66879,"CreatedDateTime":"2013-06-04T13:07:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E(On a purely forum-mechanics question - how do I set this thread subject\u0027s prefix to \u0022[answered]\u0022 now? I tried clicking on the edit button on the original post, but the subject and prefix doesn\u0027t appear to be editable.)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPress the \u0022Go Advanced\u0022 button while editing and you\u0027ll find a drop down that will do that.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-06-04T16:56:39Z","Content":"\n\u003Cp\u003EI\u0027ve seen two causes for phantom forces causing this kind of rotation.\u003C/p\u003E\u003Cp\u003EThe first is as mentioned, part clipping.\u003C/p\u003E\u003Cp\u003EThe second is more annoying since it\u0027s harder to avoid. Sometimes, struts just do that. The first time I encountered this and it wasn\u0027t clipping was when I was doing a mothership to Jool type mission, and the phantom rotation started up in LKO. I eventually found that by changing the position of the struts that the phantom rotation would go away. So I did a shakedown cruise to the Mun and Minmus, and the phantom rotation returned in Minmus orbit. I deleted all the struts and put them back in approximately the same place and went on the shakedown cruise again, and had no phantom force problems.\u003C/p\u003E\u003Cp\u003EThe second time was on a grand tour mission, where there was no phantom force problems in LKO, the Mun, or Minmus (yes, because of precisely this issue, those are now required stops on any mothership-style mission that I do). However, it started up in Moho orbit, the first stop of the grand tour. This time, I did more thorough testing. I created a new drive section, hyperedited it into Moho orbit, and it started spinning. I stripped off all of the struts in the drive section, hyperedited that into Moho orbit, and there was no spinning, but the craft wasn\u0027t stable enough to launch. \u003C/p\u003E\u003Cp\u003EI then returned to the original design and stripped off the bottom-most 8 struts (out of 16 struts total, if I remember correctly), hyperedited that into Moho orbit, and there was no spinning. Several attempts at replacing the eight struts all resulted in spinning. So I went back to the reduced strut drive section, found it stable enough to launch, flew it out to Moho where it picked up the mission sections and completed the mission. The drive section with the problem is still in Moho orbit in that save file. In copies of that save file, I\u0027ve both hyperedited the drive section back to LKO (and low Minmus orbit), and just flown it back, and the phantom forces only appear in Moho orbit. Maybe someday I\u0027ll take that drive section on it\u0027s own grand tour to see if there are any other planets/moons that cause that particular one to have phantom forces.\u003C/p\u003E\n"},{"CreatedByName":"AnalogAddict","CreatedById":59758,"CreatedDateTime":"2013-06-04T18:39:06Z","Content":"\n\u003Cp\u003EMake sure your target craft is perfectly still before you swap, with SAS turned off. For instance, if you swap crafts just as SAS was making a slight adjustment then the craft will continue it\u0027s rotation in the direction of the correction maneuver. \u003C/p\u003E\u003Cp\u003EBy swapping crafts, you have effectively disabled SAS thus allowing rotation to continue if any rotation were applied or induced by last second SAS adjustments. \u003C/p\u003E\u003Cp\u003EFrustrating, yes, but I\u0027ve experienced this issue many times and no matter how many times I dock, it all comes back to plain patience.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T19:34:02Z","Content":"\n\u003Cp\u003EIt repeats no matter how much I quit and reload. I eventually decided to \u0022cheat\u0022 and edit the capsule out of the persistence file, after EVA\u0027sing the crew to a different capsule. I figure it\u0027s a cheat, but it\u0027s okay because it\u0027s a cheat to avoid a bug that\u0027s not my fault.\u003C/p\u003E\u003Cp\u003EAnd yes, I\u0027m on 0.20.2\u003C/p\u003E\n"},{"CreatedByName":"Rosarium","CreatedById":51628,"CreatedDateTime":"2013-06-04T22:19:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EIt repeats no matter how much I quit and reload. I eventually decided to \u0022cheat\u0022 and edit the capsule out of the persistence file, after EVA\u0027sing the crew to a different capsule. I figure it\u0027s a cheat, but it\u0027s okay because it\u0027s a cheat to avoid a bug that\u0027s not my fault.\u003Cp\u003EAnd yes, I\u0027m on 0.20.2\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts your fault.... According to your dats you dont sve an ASAS on it so it will be never stable\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2013-06-04T22:46:28Z","Content":"\n\u003Cp\u003ECould you have the trim on at any point? If I recall properly, the trim remains on after quick saves and loads. If the trim is enabled, then the craft will spin no matter whether you have ASAS on or off. Reset trim by pressing Alt \u002B x\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-05T00:06:22Z\u0022 title=\u002206/05/2013 12:06  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 5, 2013\u003C/time\u003E by SDIR\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T23:20:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rosarium\u0022 data-cite=\u0022Rosarium\u0022\u003E\u003Cdiv\u003EIts your fault.... According to your dats you dont sve an ASAS on it so it will be never stable\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst off, I stated this is a broken piece of a larger craft, so you don\u0027t in fact know if it had ASAS or not.\u003C/p\u003E\u003Cp\u003ESecondly, the purpose of ASAS is to stop rotation that is already going, not to avoid STARTING rotation in the first place that magically comes from nowhere.\u003C/p\u003E\u003Cp\u003EThirdly, ASAS is useless without RCS or atmospheric canards, or vectored thrust engines. It does NOT use the torque wheels of the capsule, which is all this piece has. So it would have to be SAS, not ASAS.\u003C/p\u003E\u003Cp\u003ESo you\u0027re wrong on three counts.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-04T23:24:14Z","Content":"\n\u003Cp\u003EI\u0027ve made another version of the capsule where I removed the struts and then put them back again - this magically made the rotations stop so I think that was it.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-05T00:45:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022georgTF\u0022 data-cite=\u0022georgTF\u0022\u003E\u003Cdiv\u003ESadly i have suffered my fuel depot picking up rotation very quickly and becoming insanely difficult to dock with. Even when i kill rotation by quickly engaging/disengaging time warp, my depot starts spinning again. Far too much to be a side effect of orbiting... In fact, after killing rotation with timewarping, i notice \u0022gravity\u0022 slightly tugging the craft and spinning it up. It then continues until i can\u0027t chase the docking port anymore.\u003Cp\u003EIt may be a consequence of unintentional clipping. One depot certainly did have a probe core attached inside a large ASAS so that may be the problem.\u003C/p\u003E\u003Cp\u003EOne other thing i\u0027ve noticed is the altitude. Orbiting the Mun at 15km was much worse than 45km. Any idea why? It may be gravity or orbit, but really that sort of thing should not happen at all. It\u0027s really miserable to have to lug a huge pile of space crap into a proper orbit, only to find that it\u0027s nigh on impossible to dock with it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe effect that changes with altitude is the one where it rotates once around on the axis of orbit per orbit. The clipping effect doesn\u0027t seem to be altitude related.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-05T00:46:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Scrogdog\u0022 data-cite=\u0022Scrogdog\u0022\u003E\u003Cdiv\u003EPress the \u0022Go Advanced\u0022 button while editing and you\u0027ll find a drop down that will do that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you. Done.\u003C/p\u003E\n"},{"CreatedByName":"Brenok","CreatedById":49609,"CreatedDateTime":"2013-06-05T01:05:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E It does NOT use the torque wheels of the capsule, which is all this piece has. So it would have to be SAS, not ASAS.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, it does. If you\u0027re in a fastly rotating pod in vacuum, hitting \u0022t\u0022 will stop it almost immediatly.\u003C/p\u003E\n"},{"CreatedByName":"jheriko","CreatedById":67666,"CreatedDateTime":"2013-06-05T01:54:57Z","Content":"\n\u003Cp\u003EI have had a bug like this when I got a landing leg stuck inside a solar panel. I debugged the problem by mistake by deploying the landing gear and noting that the problem went away, but returned if I raised the gear. On closer inspection one of my three landing legs was occasionally \u0027jittering\u0027. The result I had was slow rotation which gradually accelerated - but when I say slow I mean, say 30s or so before the lander was tumbling like mad... I lowered the gear and decided to land anyway, which was lucky in hindsight. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis sounds only vaguely like your problem though.\u003C/p\u003E\u003Cp\u003EThe other thing I\u0027ve seen which can cause similar things is having uneven distribution of fuel, or parts in general. If you get it badly wrong enough ASAS will compound things instead of making them better as well..\u003C/p\u003E\u003Cp\u003EEDIT: not sure how but i seemed to miss the entire middle page of replies :I\u003C/p\u003E\n"},{"CreatedByName":"triffid_hunter","CreatedById":61814,"CreatedDateTime":"2013-06-05T03:15:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EThirdly, ASAS is useless without RCS or atmospheric canards, or vectored thrust engines. It does NOT use the torque wheels of the capsule, which is all this piece has.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eumm yep ASAS actually does use the torque wheels.. have a pod with an ASAS module, turn SAS on then point it in a different direction and it\u0027ll go back to original heading. SAS only stops rotation, ASAS maintains a heading.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-06-05T04:54:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jheriko\u0022 data-cite=\u0022jheriko\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe other thing I\u0027ve seen which can cause similar things is having uneven distribution of fuel, or parts in general. If you get it badly wrong enough ASAS will compound things instead of making them better as well..\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut unevenly distributed weight should only cause rotational accelerations when under thrust. This is a problem that occurred without any engines powered up (or even present).\u003C/p\u003E\n"}]}