{"TopicId":31677,"ForumId":16,"TopicTitle":"Problem getting into space.","CreatedByName":"DevilsRift","CreatedById":69561,"CreatedDateTime":"2013-06-06T12:15:20Z","PageNum":1,"Articles":[{"CreatedByName":"DevilsRift","CreatedById":69561,"CreatedDateTime":"2013-06-06T12:15:20Z","Content":"\n\u003Cp\u003EEvery time I get out (Or close) to the atmosphere of getting out of Kerbit it pulls me back in. Around 40k altitude it pulls me back down, even if I tilt.\u003C/p\u003E\u003Cp\u003EAny help?\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-06-06T12:18:17Z","Content":"\n\u003Cp\u003EKerbin\u0027s atmospheric height is 69,100 meters\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-06-06T12:24:15Z","Content":"\n\u003Cp\u003E..........\u003C/p\u003E\n"},{"CreatedByName":"Nibb31","CreatedById":7272,"CreatedDateTime":"2013-06-06T12:25:05Z","Content":"\n\u003Cp\u003EGetting to orbit is about horizontal speed, not altitude. The only reason you want to orbit above 70000m is because the atmospheric drag slows you down.\u003C/p\u003E\u003Cp\u003ELook at the map view during the launch. When you reach the magic speed of 2300m/s on a horizontal trajectory, you will see that gravity will still be pulling you down, but you will be going fast enough to fall \u0022beyond the horizon\u0022, therefore you will be in an orbital free-fall.\u003C/p\u003E\u003Cp\u003ESo if you are falling down at 40000m, then your rocket probably isn\u0027t going fast enough to reach orbit. We would need to see a picture of your rocket to figure out exactly what you are doing wrong.\u003C/p\u003E\n"},{"CreatedByName":"Imaginer1","CreatedById":64638,"CreatedDateTime":"2013-06-06T12:27:37Z","Content":"\n\u003Cp\u003EMy first advice is to start with the Kerbal X- maybe adding an ASAS module on. That way we aren\u0027t wondering if this is a bug in the game or a rocket issue.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-06-06T12:30:56Z","Content":"\n\u003Cp\u003ETry watching this:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/tgPr4q5tj-Q?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIt may help\u003C/p\u003E\n"},{"CreatedByName":"Uberick","CreatedById":65954,"CreatedDateTime":"2013-06-06T15:11:27Z","Content":"\n\u003Cp\u003EYou have to reach about 70km in order to get \u0022out\u0022 of the atmosphere. Tilting will do nothing to stop the atmosphere from slowing you down and sucking you back down to Kerbin. When you are launching, switch to your map and watch your apoapsis(highest point of your orbit). once it reaches about 75km, cut your engines and coast until your ship is at about 70km. Then, turn prograde and burn until you circularize.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-06-06T16:39:11Z","Content":"\n\u003Cp\u003EI made an example ship and written instructions for reaching orbit, which you can find here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25008-How-to-reach-orbit-and-a-rocket-that-can-do-it-a-walkthrough-for-newbies\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25008-How-to-reach-orbit-and-a-rocket-that-can-do-it-a-walkthrough-for-newbies\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"lyndonguitar","CreatedById":61194,"CreatedDateTime":"2013-06-06T16:56:28Z","Content":"\n\u003Cp\u003EMaybe he got the wrong idea of space as having \u0022zero-g\u0022 or \u0022no gravity\u0022, That once you go out of the atmosphere into space, even vertical upwards going, You will suddenly float once you get past that boundary. That is very wrong.\u003C/p\u003E\u003Cp\u003ETo achieve proper orbit you need enough horizontal speed, or \u0022sideways\u0022 speed, Being in high enough altitude or in \u0022Space\u0022 doesn\u0027t make you automatically float around, infact the only reason we need to be in space to have a proper orbit is because horizontal speed doesn\u0027t slow down there unlike while in an atmosphere, there\u0027s air particles to slow you down. In fact If there\u0027s no atmosphere you can freefall around for a decent amount of time even at very low altitudes\u003C/p\u003E\u003Cp\u003ETry this interactive animation,\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://waowen.screaming.net/revision/force\u0026amp;motion/ncananim.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://waowen.screaming.net/revision/force\u0026amp;motion/ncananim.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E Imagine your rocket as the cannon ball, and the launch pad as the cannon, the only difference is that the cannon fires horizontally already high up, while your rocket starts from the ground, so you need to go up first.\u003C/p\u003E\u003Cp\u003EThats how you achieve orbit, You just free fall for a very long time because your horizontal movement counter-acts the vertical movement that it would appear as you are staying afloat, not falling to the earth straight down like you should expect\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-06T17:00:10Z\u0022 title=\u002206/06/2013 05:00  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 6, 2013\u003C/time\u003E by lyndonguitar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"DevilsRift","CreatedById":69561,"CreatedDateTime":"2013-06-08T19:12:32Z","Content":"\n\u003Cp\u003EYeah, the thruster wasn\u0027t big enough to push it out of the Atmosphere I suppose.\u003C/p\u003E\u003Cp\u003EI have it now, thanks guys.\u003C/p\u003E\n"}]}