{"TopicId":31945,"ForumId":16,"TopicTitle":"Fuel Flow problems and troubleshooting [Stock Only]","CreatedByName":"xandalis","CreatedById":66674,"CreatedDateTime":"2013-06-08T00:42:20Z","PageNum":1,"Articles":[{"CreatedByName":"xandalis","CreatedById":66674,"CreatedDateTime":"2013-06-08T00:42:20Z","Content":"\n\u003Cp\u003EAlright, so I\u0027m working on a lifter/payload for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29618-The-Simple-Heavy-Lifting-challenge?p=366306\u0026amp;viewfull=1#post366306\u0022 rel=\u0022external nofollow\u0022\u003EThe Simple Heavy Lifting Challenge\u003C/a\u003E, and I\u0027m running into some problems. My problem, is this: the 4th stage in (stage 2 in this case) reads as having let\u0027s say, 1200/1500(ish, I\u0027m rounding here) dV on the pad. After liftoff, by the time the previous stages have been dropped and stage 2 is the current stage, it\u0027s down to about 800/1100 dV at stage sep. I\u0027m using 3-fold asparagus symmetry, and do not usually see this happen. I suspect that it\u0027s my engine clusters (I\u0027m not using rockomax-engines) of LV-T45\u0027s causing the problem.\u003C/p\u003E\u003Cp\u003EAnyway, a bit more on the staging flow (as intended anyway): S5 stacks feed into S4 stacks, which feed into S3, which feeds into the primary lifter body in S2. Should I try adding more fuel feeds, or is this more of an inherent problem with asparistagers that I haven\u0027t noticed on my others until now? \u003C/p\u003E\u003Cp\u003E-Edit: Also, the primary stack core is a 1m stack with 3 2.5m stacks radially mounted, all 4 stacks have engines, and I\u0027ve \u0022loop fed\u0022 the fuel lines between the 1m core and the 2.5m radials to ensure (in theory anyway) even fuel distribution at this stage. (again, the stage that seems to be eating fuel for no reason).\u003C/p\u003E\u003Cp\u003EThis is really starting to cause some hair loss on my end, so the help would be greatly appreciated \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-08T16:24:31Z\u0022 title=\u002206/08/2013 04:24  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 8, 2013\u003C/time\u003E by xandalis\u003C/strong\u003E\n\u003Cbr\u003EForgot some tech info\n\u003C/span\u003E\n"},{"CreatedByName":"Atanar","CreatedById":59913,"CreatedDateTime":"2013-06-08T01:35:34Z","Content":"\n\u003Cp\u003EYour description is hard to understand, and no matter how precise you describe it, on such complex things a screenshot is nessecary to follow what you are talking about.\u003C/p\u003E\u003Cp\u003EAnd yes, delta-v-calculations with fuelpipes may be bugged on various mods.\u003C/p\u003E\u003Cp\u003EAlso, see that your asperagus fuel pipes are all on the top tanks or you might encounter some weired emptying of middle stage tanks.\u003C/p\u003E\u003Cp\u003EAdding more fuel pipes than 6 for a 6-booster asparagus is not a good idea. Fuel lines have no limits and distribute the fuel very well if set up correctly.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-08T01:38:33Z\u0022 title=\u002206/08/2013 01:38  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 8, 2013\u003C/time\u003E by Atanar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xandalis","CreatedById":66674,"CreatedDateTime":"2013-06-08T01:54:11Z","Content":"\n\u003Cp\u003ESo, sounds like I\u0027ll have to go tweak the positioning of the lines. As for mods, non-issue: this is a stock build. Thanks for the tips, but no screenshots will be posted until it\u0027s ready for entry into the challenge. Yes, I\u0027m a secretive-type when it comes to development.\u003C/p\u003E\n"},{"CreatedByName":"Nao","CreatedById":23462,"CreatedDateTime":"2013-06-08T02:58:56Z","Content":"\n\u003Cp\u003EEarlier stages could drain some fuel from top ones if there are fuel loops as you said.\u003C/p\u003E\u003Cp\u003EYou could launching the thing on a pad with clamps holding the center stack and check if the fuel drains properly, if not then its a fuel loop problem.\u003C/p\u003E\n"},{"CreatedByName":"entaran","CreatedById":67823,"CreatedDateTime":"2013-06-08T03:09:05Z","Content":"\n\u003Cp\u003EI tend to put my asparagus fuel lines on the bottom stage just above the engine. I find that it distributes better that way. (plus it makes no sense to pull fuel from the top of a gravity fed tank)\u003C/p\u003E\n"},{"CreatedByName":"xandalis","CreatedById":66674,"CreatedDateTime":"2013-06-08T16:24:02Z","Content":"\n\u003Cp\u003EThanks for the responses. I did indeed have a bad loop, caused by a phantom fuel-line (this build has been plagued by VAB bugs). Not really sure if was actually a phantom fuel line, or some other part (say, an engine?), but I finally did get it to stop bleeding fuel.\u003C/p\u003E\n"}]}