{"TopicId":32221,"ForumId":16,"TopicTitle":"How do I get this thing on the Mun?","CreatedByName":"Hero","CreatedById":70001,"CreatedDateTime":"2013-06-09T22:27:01Z","PageNum":1,"Articles":[{"CreatedByName":"Hero","CreatedById":70001,"CreatedDateTime":"2013-06-09T22:27:01Z","Content":"\n\u003Cp\u003EI recently got my very first spaceship on the Mun, and now I\u0027m starting on a Mun base. So I decided to start out with a living quarters.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s1285.photobucket.com/user/EpicHeroGuy/media/Munbase_zps9df97250.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i1285.photobucket.com/albums/a589/EpicHeroGuy/Munbase_zps9df97250.png\u0022 alt=\u0022Munbase_zps9df97250.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe problem is that I can\u0027t get this thing on the Mun. I\u0027ve tried so many times it\u0027s embarrassing how much I failed. I can\u0027t even get into an orbit. Anyone have tips for a newb on how to get heavy ships to the Mun?\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Atanar","CreatedById":59913,"CreatedDateTime":"2013-06-09T22:45:08Z","Content":"\n\u003Cp\u003ELooks like you got 2 lV 909 engines under there. If that\u0027s supposed to land it on the Mun, I think you should add 2 more of them. Also, your landing stage needs to have a good alignment of the center of mass and the center of thrust, the pic looks like you don\u0027t have that. Lastly you should look into this thread for different landers:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/34802-Help-with-transporting-rovers\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/34802-Help-with-transporting-rovers\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2013-06-10T00:22:24Z","Content":"\n\u003Cp\u003E1. Getting heavy ships to space, recommend you look up something called asparagus staging. It is where you have fuel tanks and engines feeding other ones. This way as you use up tanks, you jettison engines along with it as you need less thrust. Once in orbit, it wouldn\u0027t take too much to make a nice burn to the moon.\u003C/p\u003E\u003Cp\u003ELike said before, the best thing is to use is to trial and error the positioning of four or six vtol engines along the side. Make the lander just as you have it then position and move the engines to balance it. If one side pitches up, then move it either in or the other out a bit. Just place it onto the launch pad and try to lift. If you can lift on kerbal, then can land on the moon. Be sure that you use the same fuel tank and engines for all points else it will imbalance as fuel drains out. Below is a picture of a vtol setup that I use. The hardest part is getting used to the way that the navcom uses unless you have a secondary pod to control from.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s529.photobucket.com/user/KwKiller/media/Kerbal%20Space%20Command/screenshot87.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i529.photobucket.com/albums/dd332/KwKiller/Kerbal%20Space%20Command/screenshot87.png\u0022 alt=\u0022screenshot87.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt is a much older version of ksp, but the same principles work...\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://s529.photobucket.com/user/KwKiller/media/Kerbal%20Space%20Command/screenshot58.png.html\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i529.photobucket.com/albums/dd332/KwKiller/Kerbal%20Space%20Command/screenshot58.png\u0022 alt=\u0022screenshot58.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-10T00:25:16Z\u0022 title=\u002206/10/2013 12:25  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 10, 2013\u003C/time\u003E by Markus Reese\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-06-10T00:28:59Z","Content":"\n\u003Cp\u003EIn the VAB, place a radial decoupler (preferably the structural pylon if you don\u0027t want to leave the decoupler \u0022remains\u0022) over the center of mass of the module. Then, place an I-beam on top of the decoupler as close to being on top of the CoM as possible. Then, build a skycrane thing on top of it to land it on the Mun, and once the module is safely landed, decouple the skycrane and crash it into the Munar surface.\u003C/p\u003E\u003Cp\u003ETo get the module and skycrane to the Mun, I suggest you flip the craft upside-down so the skycrane is at the bottom. This will just make building the lifter to take it to the Mun easier.\u003C/p\u003E\n"},{"CreatedByName":"Zephram Kerman","CreatedById":15270,"CreatedDateTime":"2013-06-10T02:17:23Z","Content":"\n\u003Cp\u003ESince you mention having trouble getting it to orbit, it might help to rearrange the lander for symmetry. If the payload is asymmetrical, that would make the launcher hard to control during the gravity turn.\u003C/p\u003E\n"},{"CreatedByName":"Markus Reese","CreatedById":28539,"CreatedDateTime":"2013-06-10T02:24:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zephram Kerman\u0022 data-cite=\u0022Zephram Kerman\u0022\u003E\u003Cdiv\u003ESince you mention having trouble getting it to orbit, it might help to rearrange the lander for symmetry. If the payload is asymmetrical, that would make the launcher hard to control during the gravity turn.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, that is a good call. The individual engines on the bottom would cause a possibly significant mass offset depending on how it is set up.\u003C/p\u003E\n"}]}