{"TopicId":33464,"ForumId":16,"TopicTitle":"LF Mentor/Teacher","CreatedByName":"XoX","CreatedById":60908,"CreatedDateTime":"2013-06-17T17:40:43Z","PageNum":1,"Articles":[{"CreatedByName":"XoX","CreatedById":60908,"CreatedDateTime":"2013-06-17T17:40:43Z","Content":"\n\u003Cp\u003ESo, when I first saw KSP I knew right there I had to buy it.\u003C/p\u003E\u003Cp\u003EI\u0027ve had it for a while now and started building some stuff I thought I liked but I\u0027m not doing that well at making anything that gets anywhere. Best I\u0027ve done so far was getting into orbit around the planet and that\u0027s about it. \u003C/p\u003E\u003Cp\u003ENow what I would really love is for someone to hit me up on steam or something and help me improve my building skills and teach me how to do more in this game because it has so much epic potential that I want to tap into but I\u0027m not getting there yet.\u003C/p\u003E\u003Cp\u003ESteam: xox_1337\u003C/p\u003E\u003Cp\u003ESkype: xox1337\u003C/p\u003E\n"},{"CreatedByName":"JaySmoka","CreatedById":60988,"CreatedDateTime":"2013-06-17T18:22:01Z","Content":"\n\u003Cp\u003EHave you checked the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/28352-The-Drawing-Board-An-unofficial-library-of-tutorials-and-other-useful-information\u0022 rel=\u0022external nofollow\u0022\u003EDrawing board\u003C/a\u003E? Pretty useful.\u003C/p\u003E\n"},{"CreatedByName":"Raptor831","CreatedById":68286,"CreatedDateTime":"2013-06-17T18:41:28Z","Content":"\n\u003Cp\u003EDon\u0027t know what I can teach, but I can give you some guidance!\u003C/p\u003E\u003Cp\u003EYou should check out the tutorial videos all around here. There are some on the wiki, and there are plenty in the forums. Look at reaching orbit and how to do that well. Orbit around Kerbin is literally halfway to anywhere, as far as Delta-V is concerned.\u003C/p\u003E\u003Cp\u003EAnd speaking of that, you should brush up on actual rocket science. It helps a ton to understand Delta-V, specific impulse (ISP), the rocket equation, Thrust-to-weight ratio (TWR). All of those help you build better, more efficient rockets. KSP is designed to act like real life (mostly), so real-life science can help you. If you want the motherlode, check out \u003Ca href=\u0022http://www.projectrho.com/public_html/rocket/index.php\u0022 rel=\u0022external nofollow\u0022\u003ENyrath\u0027s site\u003C/a\u003E. You\u0027ll have more info than you know what to do with there.\u003C/p\u003E\u003Cp\u003EYou\u0027ll want to learn docking too. It\u0027s not just for stations, as you can assemble larger interplanetary craft in orbit. Then go to the Mun or Minmus. Then maybe try Duna or Eve. Think about how NASA grew. Suborbital flights, then orbital, then rendezvous/docking, then the Moon, then other bodies. Don\u0027t bite off more than you can chew right away, because you\u0027ll get frustrated! :-)\u003C/p\u003E\u003Cp\u003EHonestly, I\u0027ve learned by trial and error (lots of explosions!), and then by using MechJeb. MechJeb\u0027s an autopilot, so if you like flying on your own, I wouldn\u0027t use it. But, it can teach you what a good ascent profile looks like, how to rendezvous with another ship, transferring to another planet/moon, etc. Once you\u0027ve seen it done a few times, you can do it yourself. It also gives you the important numbers (Delta-V, ISP, TWR) for your ships in the VAB/SPH so you aren\u0027t guessing about \u0022Can this reach the mun!?\u0022 you actually know.\u003C/p\u003E\u003Cp\u003EAlso, remember, you really want the smallest/lightest vehicle that can do what you\u0027re planning. More weight = less travel. On this note, look up asparagus staging. It\u0027s the most efficient way to stage, and will help a lot.\u003C/p\u003E\u003Cp\u003EOk, that was a bunch of random thoughts, so I hope that helps!\u003C/p\u003E\n"},{"CreatedByName":"XoX","CreatedById":60908,"CreatedDateTime":"2013-06-17T18:56:10Z","Content":"\n\u003Cp\u003EThanks, I will definitely check those out. It would just be awesome to have someone around that I can just throw quick questions at like \u0022Hey, I\u0027m in the middle of trying to do X, can you help me with Y?\u0022 .\u003C/p\u003E\n"},{"CreatedByName":"JaySmoka","CreatedById":60988,"CreatedDateTime":"2013-06-17T19:48:47Z","Content":"\n\u003Cp\u003ETry to find me on steam (jay_smoka), im not a specialist in anything, but I can help.\u003C/p\u003E\n"},{"CreatedByName":"XoX","CreatedById":60908,"CreatedDateTime":"2013-06-17T20:39:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JaySmoka\u0022 data-cite=\u0022JaySmoka\u0022\u003E\u003Cdiv\u003ETry to find me on steam (jay_smoka), im not a specialist in anything, but I can help.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAdded you.\u003C/p\u003E\u003Cp\u003EAlso, I looked up the Asparagus Staging, whipped up a design and the rocket did better than any before, actually got into a very nice orbit with much more fuel left than ever before. I was adjusting my orbit when I accelerated a bit too fast and the rocket broke into pieces, without that mishap I\u0027m sure I would\u0027ve made it to the mun. Time to try again!\u003C/p\u003E\n"},{"CreatedByName":"JaySmoka","CreatedById":60988,"CreatedDateTime":"2013-06-18T12:21:37Z","Content":"\n\u003Cp\u003EFor even better design (and if you want to do some math), Look a the comments by Temstar on this \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/28248-Is-asparagus-the-best-staging-system-%28might-contain-science%29\u0022 rel=\u0022external nofollow\u0022\u003Ethread\u003C/a\u003E. It give some basic math for better designs. It helped me a lot. Nearly every payload which I have calculated get in orbit quite easily.\u003C/p\u003E\n"}]}