{"TopicId":34284,"ForumId":16,"TopicTitle":"Help with travel to Duna","CreatedByName":"thorodin84","CreatedById":69417,"CreatedDateTime":"2013-06-22T15:24:30Z","PageNum":1,"Articles":[{"CreatedByName":"thorodin84","CreatedById":69417,"CreatedDateTime":"2013-06-22T15:24:30Z","Content":"\n\u003Cp\u003EA delta v map that I have states that it only takes additional 310 m/s to achieve duna orbit after reaching duna\u0027s SOI.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZhleNJS.png\u0022 alt=\u0022ZhleNJS.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut it turns out that I need to add 1675 m/s instead to reduce my periapsis for aerobraking to achieve orbit\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rpTaQF5.png\u0022 alt=\u0022rpTaQF5.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHave i done something wrong?\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-06-22T15:55:07Z","Content":"\n\u003Cp\u003EYou need to perform the burn that lowers your periapsis much, much sooner that that - halfway between Kerbin and Duna or even as soon as you leave Kerbin SOI. The closer you are to your target, the more dV you need to spend to change your course. That 1724 dV burn would could have been done with just a few puffs of RCS just after leaving Kerbin SOI. I find it easiest to change the CONIC_PATCH_DRAW_MODE to 0 in the settings.cfg because it lets you zoom in on your target planet and see and fine-tune the predicted intercept orbit around it. Ideally, you should set your Pe to around 10 km and bleed away all your excess speed by aerobraking.\u003C/p\u003E\u003Cp\u003E*Edit* Also, the 310 m/s dV is the change you need in order to get into orbit from an IDEAL hohmann transfer from Kerbin to Duna. In this ideal situation, your ship would reach the Ap of the transfer orbit at the moment it enters Duna\u0027s SOI and it\u0027s path would be parallel to Duna\u0027s orbit. In your case, you are coming in at a weird angle and at a much greater speed.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T16:51:54Z\u0022 title=\u002206/22/2013 04:51  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by Awaras\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-06-22T16:25:06Z","Content":"\n\u003Cp\u003EDon\u0027t burn retrograde to lower your periapsis. Burn RAD- (or south in this case) to lower it and it should take much less delta-v than burning retrograde. Of course, it is best to do the correction burns while still in solar orbit as Awaras said.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T16:31:33Z\u0022 title=\u002206/22/2013 04:31  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by rryy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Francesco","CreatedById":58274,"CreatedDateTime":"2013-06-22T16:28:44Z","Content":"\n\u003Cp\u003Eyup, you are coming in perpendicular to Duna instead of parallel, so it\u0027s going to require more energy to slow down.\u003C/p\u003E\u003Cp\u003Eyou have to do a correction burn as Awaras said, and you can\u0027t wait to be already inside Duna\u0027s sphere of influence, otherwise it\u0027s going to be very costly in terms of delta-v (as you have experienced).\u003C/p\u003E\u003Cp\u003EI usually do a combined inclination \u002B periapsis height burn at the AN/DN node, which puts my final periapsis on Duna at 11-12 km of altitude or so, to take full advantage of aerobraking.\u003C/p\u003E\u003Cp\u003Eedit: sometimes though, especially if you don\u0027t have RCS on your ship, you won\u0027t be able to set your periapsis precisely enough with the first correction burn, so you\u0027ll have to wait to be closer to the planet to fine-tune it.\u003C/p\u003E\u003Cp\u003Elike, just a little before you enter the planet\u0027s sphere of influence, or just after you\u0027ve entered it.\u003C/p\u003E\u003Cp\u003Eso, for example, the first correction burn will set the periapsis on the equator and will bring it closer to the planet, and then the second burn will set the periapsis exactly at the desired altitude.\u003C/p\u003E\u003Cp\u003Ealso, remember that aerobraking on Duna can be tricky the first times, due to its thin atmosphere:\u003C/p\u003E\u003Cp\u003Eif your periapsis is too high, like at 15km, aerobraking will help you slow you down but not much, and you\u0027ll have to fire rockets anyway; but if your periapsis is too low, like 9-10 km, you risk losing too much speed and going straight to a landing.\u003C/p\u003E\u003Cp\u003Eplay around with this for a while \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T18:18:05Z\u0022 title=\u002206/22/2013 06:18  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by Francesco\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"matt_cain","CreatedById":63941,"CreatedDateTime":"2013-06-22T16:33:11Z","Content":"\n\u003Cp\u003EIf you just want to get into orbit since your this far along in the mission, you can wait to Periapsis to do your retrograde burn to get into a stable orbit. It should take less delta-v. Move your maneuver node and see whether this or rryy\u0027s suggestion makes more sense for what your trying to accomplish. Good luck.\u003C/p\u003E\u003Cp\u003EEdit: Never-mind, rryy\u0027s way is much better.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-22T16:41:59Z\u0022 title=\u002206/22/2013 04:41  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 22, 2013\u003C/time\u003E by matt_cain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2013-06-22T21:15:05Z","Content":"\n\u003Cp\u003EYou also won\u0027t see much aerobraking at 35 kilometers at Duna. Try 13-15 km.\u003C/p\u003E\n"},{"CreatedByName":"zekew11","CreatedById":59689,"CreatedDateTime":"2013-06-23T02:04:37Z","Content":"\n\u003Cp\u003EThe trouble is you planned a retrograde burn. typically this is the burn you would use to lower your periapsis, however because you are not actually orbiting duna, the typical orbital mechanics don\u0027t apply in quite the same way. what you\u0027ll want to do instead is burn perpendicular to the surface towards the side of the planet opposite your closest approach. its a hard thing to articulate... I have found that the directions given by the maneuver planner seldom line up right for what you\u0027re doing; i generally just eye these burns, which unfortunately is only helpful if you understand what i was trying to say.\u003C/p\u003E\u003Cp\u003ERemember though, the earlier you make corrections, the less fuel you\u0027ll use!\u003C/p\u003E\n"},{"CreatedByName":"thorodin84","CreatedById":69417,"CreatedDateTime":"2013-06-23T02:39:14Z","Content":"\n\u003Cp\u003Eok. Thanks for your answers!\u003C/p\u003E\n"},{"CreatedByName":"thorodin84","CreatedById":69417,"CreatedDateTime":"2013-06-23T03:26:31Z","Content":"\n\u003Cp\u003EBut when I try to adjust the periapsis during solar orbit, the intercept goes off the moment I place the manuveur node without any adjustment. I can\u0027t post a pic now as I am out now.\u003C/p\u003E\n"},{"CreatedByName":"matt_cain","CreatedById":63941,"CreatedDateTime":"2013-06-23T04:07:47Z","Content":"\n\u003Cp\u003EIt sounds like you should try waiting till you are closer to your target, it is less efficient, but you\u0027re at such a distance that tiny changes in velocity are throwing you completely off the intercept.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-23T04:10:10Z\u0022 title=\u002206/23/2013 04:10  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 23, 2013\u003C/time\u003E by matt_cain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-06-23T04:13:40Z","Content":"\n\u003Cp\u003EYeah, the maneuver system can get confused sometimes, and the burn you need to perform to correct your course can be less than 1 m/s dV so it is difficult to set a maneuver node with such precision. \u003C/p\u003E\u003Cp\u003EIn that case, don\u0027t place maneuver nodes. Zoom in on the target in the map and use RCS - try thrusting in all possible directions and observe the pe of the intercept. Find out what direction moves your pe closer to the planet and burn that way.\u003C/p\u003E\u003Cp\u003E If you don\u0027t have rcs, point your ship in different directions (prograde, retrograde, nml\u002B, nml-, rad\u002B, rad-) and make tiny burns while watching your ap. You don\u0027t have to do this exactly - just get your ap below 100 km. \u003C/p\u003E\u003Cp\u003EThe patched conic system is frequently imprecise - you set your approach trajectory just right, and as soon as you enter your target\u0027s SOI, the trajectory jumps a few dozen/hundred kilometers in a random direction. \u003C/p\u003E\u003Cp\u003EJust get your ap within a hundred kilometers of the target planet, and do the fine course adjustment after entering the target\u0027s SOI.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-23T04:46:47Z\u0022 title=\u002206/23/2013 04:46  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 23, 2013\u003C/time\u003E by Awaras\u003C/strong\u003E\n\u003C/span\u003E\n"}]}