{"TopicId":34463,"ForumId":16,"TopicTitle":"How to stabalize this","CreatedByName":"Schrimschrim","CreatedById":69464,"CreatedDateTime":"2013-06-23T17:36:13Z","PageNum":1,"Articles":[{"CreatedByName":"Schrimschrim","CreatedById":69464,"CreatedDateTime":"2013-06-23T17:36:13Z","Content":"\n\u003Cp\u003EHey guys, after i have learned how to dock to other ships i want to build a bigger ship in space.\u003C/p\u003E\u003Cp\u003ESo this Ship will contain 4 parts. First Part is already up and i want now the Engines for the ship, but this still dosnt work so well.\u003C/p\u003E\u003Cp\u003ESo maby you have a complete other idea or maybe just an idea how to stabilize this.\u003C/p\u003E\u003Cp\u003EOn this 2 Pictures you can see wich part have to fly in the Orbit 100km or better 150km.\u003C/p\u003E\u003Cp\u003EI coudt delete the hull or the smaller engines so this woudt be much easier, but i like them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i41.tinypic.com/b4j9ex.jpg\u0022 alt=\u0022b4j9ex.jpg\u0022\u003E\u003Cimg src=\u0022http://i42.tinypic.com/ounzte.jpg\u0022 alt=\u0022ounzte.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow here is what is my best try for now.\u003C/p\u003E\u003Cp\u003EI normaly start this with 75% thurst, but this will explode at round about 2-4km\u003C/p\u003E\u003Cp\u003EBut one time i got it.. Exact the same ship.. i lost at start a booster and on the way one of my orange fueltanks with engines but i got close the orbit at 150km .. i did need a bit more fuel (this bit what i lost at start \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E)\u003C/p\u003E\u003Cp\u003EBut why is this not working again!?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i43.tinypic.com/2up4lc9.jpg\u0022 alt=\u00222up4lc9.jpg\u0022\u003E\u003Cimg src=\u0022http://i44.tinypic.com/2r6pukl.jpg\u0022 alt=\u00222r6pukl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor this guys who want to test it on PC is here the craft file.\u003C/p\u003E\u003Cp\u003ETo use this Craft file you need the Kerbal Version 0.20.2.186\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E2 Addons\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EMechJeb 2 \u003C/p\u003E\u003Cp\u003EKSPX Parts\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.file-upload.net/download-7750052/Space-Station--2_1.craft.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.file-upload.net/download-7750052/Space-Station--2_1.craft.html\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Alinor","CreatedById":60876,"CreatedDateTime":"2013-06-23T18:35:15Z","Content":"\n\u003Cp\u003EOne quick fix I can suggest is to send your 3 tank module empty. Grab empty tanks mod or drain them on launch pad. With current configuration your rocket becomes top heavy as fuel below drains.\u003C/p\u003E\u003Cp\u003EUsing Solid rockets is not a good idea for heavy lift configurations. Ditch those and replace with liquid engines. I will trow a guess but you will need allot more fuel to make it, does not look like you have enough.\u003C/p\u003E\u003Cp\u003EAlso since your rocket is short you will have control issues, it must be longer with center of lift way below your cargo.\u003C/p\u003E\u003Cp\u003EIt also looks like you only have one connection to the pain station, if it\u0027s small then no problem but if it is going to grow you will encounter allot of flex when doing maneuvers. Something to consider.\u003C/p\u003E\u003Cp\u003EI will not test it for you, but I have allot of experience with delivering very heavy things in to orbit and I can share one of my successful designs - here is launcher design I developed that brings up to 150tons to orbit. At some point I got bored to bits making rockets every time I sent stuff to orbit, so I use this launcher for everything now. \u003C/p\u003E\u003Cp\u003EYou can go along same lines for your launch vehicle. I would give you craft file but just do not remember all the mods used to make it, so you will likely hit a wall on that. But it can be made using stock parts.\u003C/p\u003E\u003Cp\u003EI can make a guide if you want on how to make it. Part count can be kept around 250 for launcher.\u003C/p\u003E\u003Cp\u003EIt\u0027s 4 stage launcher, with flat platform on top for cargo. You load the launcher, put your cargo on top and off you go. It\u0027s a big platform so ton of stuff can fit. Including your engine array. Stage 4 is modular, it is very easy to change engines and with few of them swapped for nuclear engines, it can be used to haul almost 5 large tanks of fuel in to orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://uber-logic.com/alinor/games/ksp/2013-06-23_00003.jpg\u0022 alt=\u00222013-06-23_00003.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://uber-logic.com/alinor/games/ksp/2013-06-23_00002.jpg\u0022 alt=\u00222013-06-23_00002.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is example of cargo placement, this was mission to add 5 parts to interplanetary station.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://uber-logic.com/alinor/games/ksp/2013-06-23_00004.jpg\u0022 alt=\u00222013-06-23_00004.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the station itself, 130 tons ends up in orbit. Sent with empty tanks\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://uber-logic.com/alinor/games/ksp/2013-06-23_00001.jpg\u0022 alt=\u00222013-06-23_00001.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETesting a rocket is big pain, that\u0027s why I rather give you design that works and later you can develop something of your own. If you have any questions let me know.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-23T18:47:55Z\u0022 title=\u002206/23/2013 06:47  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 23, 2013\u003C/time\u003E by Alinor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Schrimschrim","CreatedById":69464,"CreatedDateTime":"2013-06-23T21:45:41Z","Content":"\n\u003Cp\u003EHey,\u003C/p\u003E\u003Cp\u003Ei understand why you want to send the 3 Tank module empty in space, because this woudt be the best with your rocket, but why shoudt i carry empty fueltanks when i also use them to get in space? With Controlling i have no problems so i hold the heavy top.\u003C/p\u003E\u003Cp\u003EMy problem is, why the structures broke up? In my new rocket is the same. I get to 9km and than some part broke and everything is gone. How can i \u0022repair\u0022 this?\u003C/p\u003E\u003Cp\u003EWhen i woudt use your rocket i woudt get the same rocket like i have her now and it woudt break again.\u003C/p\u003E\u003Cp\u003EI think the problem is that the engines push too srong in the upper stages. I just run on 75% so i cant go lower. I would not fly up.\u003C/p\u003E\u003Cp\u003ESo how can i lead the push from the lower stage on the upper part, but more spread?\u003C/p\u003E\u003Cp\u003EThis is my current Rocket. I want also to recall that the Rocket i have posted bevor already was close the the 150km Orbit i just lost 2 parts on the way. So it was possible but just 1 time. maybe my PC is not strong enough for so many parts?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i42.tinypic.com/fuvrci.jpg\u0022 alt=\u0022fuvrci.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Schrimschrim","CreatedById":69464,"CreatedDateTime":"2013-06-23T23:50:13Z","Content":"\n\u003Cp\u003EI have got a new problem....\u003C/p\u003E\u003Cp\u003Ethe rocket in the post before i got in the orbit i had just to be again a bit slower and very carefull. Than it works. But... at the top i have this peak. and this i want to decouple cause there i want to dock to the other space station part. But when i do this the game understand that the rest of the rocket \u0022the important part\u0022 is just debris and i cant control it.. how can i solve this problem?\u003C/p\u003E\u003Cp\u003EOk the problem was that the landercan cannot control the rocket, but the Mechjeb did it. so i had to put in a new control part to ignore the mechjeb. -.-\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-24T03:05:57Z\u0022 title=\u002206/24/2013 03:05  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 24, 2013\u003C/time\u003E by Schrimschrim\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alinor","CreatedById":60876,"CreatedDateTime":"2013-06-24T03:20:37Z","Content":"\n\u003Cp\u003EControl module needs to be in the on the part for it to be controllable. Ether manned unit or satellite core.\u003C/p\u003E\u003Cp\u003ERocket experiences stress from thrust and aerodynamic dragg. The faster you go in the atmosphere, the more stress your rocket will experience. Each part has maximum tolerance for stress, if you exceed it, part fails structurally and your rocket will likely fall apart.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-24T03:26:53Z\u0022 title=\u002206/24/2013 03:26  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 24, 2013\u003C/time\u003E by Alinor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Schrimschrim","CreatedById":69464,"CreatedDateTime":"2013-06-24T11:40:20Z","Content":"\n\u003Cp\u003Ei have got the rocket to the Space station... but he wont dock... what did i wrong?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i43.tinypic.com/33mv0nb.jpg\u0022 alt=\u002233mv0nb.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-06-24T12:29:27Z","Content":"\n\u003Cp\u003EOne weird way to test that docking issue is to build a simple rover you can use to try \u0027docking\u0027 on the ground, basically :\u003C/p\u003E\u003Cp\u003E- make a rover with 8 wheels split in 2 with docking ports - O-O\u0026lt;||\u0026gt;O-O \u003C/p\u003E\u003Cp\u003E- make sure both sides have a probe and battery power.\u003C/p\u003E\u003Cp\u003E- launch and then drive the rover to some flat space with room to move.\u003C/p\u003E\u003Cp\u003E- experiment with the docking mechanism.\u003C/p\u003E\u003Cp\u003EEdit: Test the effects of getting the docking facing the wrong way... the docks have a side that connects to the structure and a side that connects to other docks.\u003C/p\u003E\n"},{"CreatedByName":"Schrimschrim","CreatedById":69464,"CreatedDateTime":"2013-06-24T13:09:41Z","Content":"\n\u003Cp\u003EYes i have found the side that connect to parts and the other side.... but the other side still dont want to dock the other docking port..\u003C/p\u003E\u003Cp\u003EI also tested it with the smaler docking ports and rovers there is working everything very well.\u003C/p\u003E\u003Cp\u003ESo i cant figure out what the problem is\u003C/p\u003E\n"},{"CreatedByName":"Alinor","CreatedById":60876,"CreatedDateTime":"2013-06-24T23:33:48Z","Content":"\n\u003Cp\u003ELikely cause is your large docking port is upside down. Make sure to position it properly, otherwise they will not dock.\u003C/p\u003E\n"},{"CreatedByName":"Schrimschrim","CreatedById":69464,"CreatedDateTime":"2013-07-13T11:05:06Z","Content":"\n\u003Cp\u003EIts done the Station is ready in orbit \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022%5Bimg%5Dhttp%3A//i42.tinypic.com/2co0vt1.jpg\u0022 alt=\u00222co0vt1.jpg\u0022\u003E\u003C/p\u003E\n"}]}