{"TopicId":34875,"ForumId":16,"TopicTitle":"Polar satellite coverage","CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-06-26T17:59:13Z","PageNum":1,"Articles":[{"CreatedByName":"Kimberly","CreatedById":71980,"CreatedDateTime":"2013-06-26T17:59:13Z","Content":"\n\u003Cp\u003EI want to provide the poles of Kerbin with \u003Cem\u003Econtinuous\u003C/em\u003E coverage of Figaro GPS satellites, in addition to the rest of the planet of course. What orbits/how many satellites will I need? My current plan is to use highly eccentric orbits at a 90-degree inclination, so satellites will spend most of their time above one pole, and to use two satellites per orbit (180 degrees apart). I\u0027m bad at visualizing it, though...will that suffice?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-26T20:35:44Z\u0022 title=\u002206/26/2013 08:35  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 26, 2013\u003C/time\u003E by Kimberly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-06-26T18:34:53Z","Content":"\n\u003Cp\u003EIf you want to do it like a true GPS system, you\u0027ll probably want four satellites in the orbit (each 90 degrees apart from one another) and you\u0027ll want the orbit to be circular. The actual GPS constellation has six such orbital lanes at 55 degrees inclination separated by 60 degrees of right ascension, 24 satellites total (at least, that was prior to 2012; the new system has 32 satellites.\u003C/p\u003E\u003Cp\u003EOne such orbit will probably suffice for your purposes.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2013-06-26T18:52:08Z","Content":"\n\u003Cp\u003ETo get continuous coverage over a spherical surface, including both poles, with only four satellites, you can use John Draim\u0027s \u003Ca href=\u0022https://www.google.com/patents/EP0213355A1\u0022 rel=\u0022external nofollow\u0022\u003ETetrahedral Satellite Configuration.\u003C/a\u003E. It uses four satellites arrayed in four separate elliptical orbits (eccentricity =0.28), inlcined at 33Ã‚Â° and arrayed so that they maintain a tetrahedral framework around the planet.\u003C/p\u003E\u003Cp\u003EBut that\u0027s really more of a commsat setup than a GPS setup. My signature contains a challenge that involves setting up such a configuration over Kerbin.\u003C/p\u003E\n"}]}