{"TopicId":35036,"ForumId":16,"TopicTitle":"Tip - A.S.A.S.","CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-06-27T18:51:51Z","PageNum":1,"Articles":[{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-06-27T18:51:51Z","Content":"\n\u003Cp\u003EPut your A.S.A.S (or regular SAS) module in the \u003Cstrong\u003Ecenter of your craft\u003C/strong\u003E. I\u0027m finding this to be more stable and more reliable than when I was sticking it on the top or bottom of a craft. As my dad would say, \u0022it\u0027s more better\u0022. \u003C/p\u003E\u003Cp\u003EAnyone else experience this?\u003C/p\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-06-27T18:54:18Z","Content":"\n\u003Cp\u003ENo, I don\u0027t think SAS cares about its position on the craft. This could change with the change to SAS in 0.21, but right now, it should work the same anywhere on the craft.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-06-27T19:34:35Z","Content":"\n\u003Cp\u003ESAS works this way yes, because it simply gives torque. Unles I\u0027m mistaken, it matters where you apply the torque.\u003C/p\u003E\u003Cp\u003Efor ASAS it doesn\u0027t matter though, since it\u0027s simply a computer controling your control surfaces\u003C/p\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-06-27T20:40:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003ESAS works this way yes, because it simply gives torque. Unles I\u0027m mistaken, it matters where you apply the torque.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn real life, this would be true, but in KSP this isn\u0027t simulated. You can place an SAS anywhere on the craft and the effect will remain the same.\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-06-27T21:00:02Z","Content":"\n\u003Cp\u003EYou are onto something here, but it not ASAS that needs to be in the center. It\u0027s the \u003Cem\u003Econtrolling part\u003C/em\u003E. Any probe core or docking port will do, just click \u0022control from here\u0022 on it\u0027s context menu before launch.\u003C/p\u003E\u003Cp\u003EHowever, Since C7 has completely fixed ASAS for the next version, this knowledge will not be applicable for long.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-27T21:18:02Z\u0022 title=\u002206/27/2013 09:18  PM\u0022 data-short=\u002211 yr\u0022\u003EJune 27, 2013\u003C/time\u003E by nhnifong\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tobyz28","CreatedById":72108,"CreatedDateTime":"2013-06-27T22:55:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rryy\u0022 data-cite=\u0022rryy\u0022\u003E\u003Cdiv\u003EIn real life, this would be true, but in KSP this isn\u0027t simulated. You can place an SAS anywhere on the craft and the effect will remain the same.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have personally tested this, the position and orientation of the SAS module HUGELY affects it\u0027s effectiveness. I\u0027ll post a screenshot when i\u0027m back home. From what I recall A SAS module at the tip of your craft will only assist in stabilizing the rockets roll (the Q/E keys) and will have very little effect on pitch or yaw. THe best results were with 3 SAS modules (well 6 to keep the ship balanced) oriented along the X/Y/Z axis\u0027s from the ships COM.\u003C/p\u003E\n"},{"CreatedByName":"SDIR","CreatedById":59117,"CreatedDateTime":"2013-06-28T00:30:51Z","Content":"\n\u003Cp\u003EFrom my experience the position of the ASAS doesn\u0027t really matter, so long as it is attached to the craft in some way. Usually its the pod that gives the torque to stabilize the craft and keep it from rolling. If you are really having trouble controlling it, I suggest four RCS thrusters on either end to help with the stability. But with the new .21 patch coming out, the positioning of the reaction wheels WILL matter as they will be giving the torque, as opposed to the command pod, which now houses the SAS system.\u003C/p\u003E\n"}]}