{"TopicId":35480,"ForumId":16,"TopicTitle":"Any trick to getting a Tri Coupler on top AND bottom of a stack of FL fuel tanks ?","CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-07-01T14:08:10Z","PageNum":1,"Articles":[{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-07-01T14:08:10Z","Content":"\n\u003Cp\u003EI wanted to put a Tri Coupler on top of 3 FL T800 tanks, then put another Tri Coupler at the bottom of the tanks to merge them to one to feed a engine, however in this configuration the fuel doesnt get to the engine. It slots together with no apparent issues (I suspect that 1 tank is connected to the top coupler and the other 2 are connected to the bottom one) but does not route the fuel at all.\u003C/p\u003E\u003Cp\u003EI could route fuel lines but that shouldnt be needed and ruins the lines of the craft. \u003C/p\u003E\u003Cp\u003EI tried putting only 1 tank on the 1st Tri Couple then putting on the bottom Tri Coupler, then the other 2 tanks of fuel (not using symmetry)...same result.\u003C/p\u003E\u003Cp\u003EI even tried only 1 tank (so only 1 point of the tri couplers was used), but even that failed.\u003C/p\u003E\u003Cp\u003EI would of thought that was a natural design... going from a small to 3 tanks then slimming back to a single engine. -\u0026lt;EE\u0026gt;{ OoOo\u003C/p\u003E\u003Cp\u003ESquad really need to rethink the part connection system.. this 1 parent to a child limit is infuriating .\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-01T14:12:20Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/9oOpzC9A-N4?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cbr\u003E\u003Cbr\u003EUnfortunately you will need fuel lines to get certain configs to work properly, yes it\u0027s a KSP issue\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-01T14:16:59Z\u0022 title=\u002207/01/2013 02:16  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 1, 2013\u003C/time\u003E by HoY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Epic DaVinci","CreatedById":58581,"CreatedDateTime":"2013-07-01T14:21:04Z","Content":"\n\u003Cp\u003EYes, i know this from experiance. You cannot create a perfect 1-3-1 ship, as the coupler used at the bottom to merge the 3 tanks back into one, only actually couples onto one of the tanks and not all 3. Shame really as i like the look of 3 tank in Tri formation.\u003C/p\u003E\n"},{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-07-01T14:21:29Z","Content":"\n\u003Cp\u003EI had tried that trick (without docking ports), the tanks connected easy enough (though at least one tank will be connected to the opposite coupler the other tanks are attached to) , just the fuel is not routed, and fuel lines just mess up the whole ships looks.\u003C/p\u003E\u003Cp\u003EMay as well just slap on the orange tank in that case.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-01T14:25:25Z","Content":"\n\u003Cp\u003EIt doesn\u0027t work without docking ports. It simply can\u0027t, because they are the only way to make things stick together outside of the VAB. And you can install the fuel lines Inside other parts so you can\u0027t see them from any angle\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-07-01T14:34:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HoY\u0022 data-cite=\u0022HoY\u0022\u003E\u003Cdiv\u003EIt doesn\u0027t work without docking ports. It simply can\u0027t, because they are the only way to make things stick together outside of the VAB. And you can install the fuel lines Inside other parts so you can\u0027t see them from any angle\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoes this not provoke evil clipping booboos?\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-07-01T14:37:53Z","Content":"\n\u003Cp\u003EYou can put the fuel lines facing inward of the tristack, or even hide them inside the tricoupler. Zoom in and rotate your camera to where you\u0027re looking at the tanks from the bottom, attach fuel lines, zoom out, click the tricoupler and the fuel lines will be on the inside. I tested the tricoupler cause I haven\u0027t run into the issue myself (as I don\u0027t fancy that particular design) and it\u0027s actually the upside down tricoupler that won\u0027t feed fuel \u0027the wrong way\u0027.\u003C/p\u003E\u003Cp\u003EI tested all this just to be able to reply to this post, and to learn how it works since I hadn\u0027t run into it myself. Why couldn\u0027t you?\u003C/p\u003E\u003Cp\u003EYou\u0027ve brought up two issues that both that can be worked around very effectively when knowing about the issue and a bit of design testing. Single parent assembly is what it is, work around it or don\u0027t build, I don\u0027t see the point of beating the dark spot of dried blood where a horse used to lay. Yes it\u0027s not ideal, but KSP is still in alpha, we\u0027re effectively testers and just repeatedly whinging about the same things rather than learning to work around them or avoiding the issues alltogether so we can enjoy this awesome game is getting tedious.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-01T14:39:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KerbMav\u0022 data-cite=\u0022KerbMav\u0022\u003E\u003Cdiv\u003EDoes this not provoke evil clipping booboos?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, fuel lines don\u0027t have any colliders whatsoever so you don\u0027t even need to turn part clipping on to do this.\u003C/p\u003E\n"},{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-07-01T15:05:37Z","Content":"\n\u003Cp\u003EJohnno - I was asking for assistance not your particular blend of \u0027fanboism\u0027 thank you, take a hint from HoY and the others in here, they seemed to be able to post without being a sarky sod. \u003C/p\u003E\u003Cp\u003EIf you despise helping whiny entitled players, why hang around in here advising others to learn to cope and deal with issues... leave that to others who are happy to help out the whiners.\u003C/p\u003E\u003Cp\u003EHoy and others, thanks for your contributions.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-07-01T16:59:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ASnogarD\u0022 data-cite=\u0022ASnogarD\u0022\u003E\u003Cdiv\u003EJohnno - I was asking for assistance not your particular blend of \u0027fanboism\u0027 thank you\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBy all means ask, your opening post read more than a rant than a request for assistance though, I\u0027ve tried helping you in previous threads that\u0027ve been just as ranty. I don\u0027t think it\u0027s a problem with the game, but with your approach. When you say stuff like \u0022shouldn\u0027t be needed\u0022 and \u0022would\u0027ve thought it was a natural design\u0022, you\u0027re expecting stuff rather than working with what\u0027s available. Instead of finding the simple workarounds you just seem to get stuck in your criticism filled mindset huffing and puffing about why stuff isn\u0027t the way you expect it to be.\u003C/p\u003E\u003Cp\u003EIt\u0027s not Squad\u0027s or the game\u0027s fault if you can\u0027t figure things out on your own, by all means come and ask on the forums but not all of us fanboys take it lightly when someone\u0027s dissing the game nonstop and ranting about the simplest things a lot of players have no issues with.\u003C/p\u003E\n"},{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-07-01T17:14:14Z","Content":"\n\u003Cp\u003EDissing the game ? Man you havent been online very long, or had a very sheltered online existence... you havent seen \u0027dissing a game\u0027 if you think thats what I am doing.\u003C/p\u003E\u003Cp\u003EI am commenting on what I see are issues, I am showing interest in the title and as an interested individual I am providing feedback... if I was \u0027dissing\u0027 the title, I would be demanding my cash back and calling Squad everything under the sun, and telling my mates and fellow gamers to stay the [beep] away... nah, I am cautiously optimistic about the title and I let others know its a fun title with tonnes of potential but has issues and can be frustrating.\u003C/p\u003E\u003Cp\u003E... if you want others to post as YOU see fit, hand out scripts for us to read...and start your own forum to rule over.\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-07-01T23:03:49Z","Content":"\n\u003Cp\u003EI have just release a set of parts which does that (without the docking port)\u003C/p\u003E\u003Cp\u003EAll the parts use stock parts/stats/graphics, I just welded them together so we can have reduced part count.\u003C/p\u003E\u003Cp\u003EIt\u0027s on Spaceport: \u003Ca href=\u0022http://kerbalspaceprogram.com/ubioweldingltd/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/ubioweldingltd/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe forum post waiting moderator approval (new account limitation)\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-07-02T06:42:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UbioZur\u0022 data-cite=\u0022UbioZur\u0022\u003E\u003Cdiv\u003EI have just release a set of parts which does that (without the docking port)\u003Cp\u003EAll the parts use stock parts/stats/graphics, I just welded them together so we can have reduced part count.\u003C/p\u003E\u003Cp\u003EIt\u0027s on Spaceport: \u003Ca href=\u0022http://kerbalspaceprogram.com/ubioweldingltd/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/ubioweldingltd/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI like!\u003C/p\u003E\u003Cp\u003EHeat dissipation has to be considered though, but that shouldnt be a big problem with the small engines that would fit under this.\u003C/p\u003E\n"},{"CreatedByName":"UbioZur","CreatedById":72946,"CreatedDateTime":"2013-07-02T11:13:04Z","Content":"\n\u003Cp\u003EAgree for heat dissipation, and this is why I will not build tank bigger than 2 Jumbo-64 equivalent.\u003C/p\u003E\u003Cp\u003EIt would be possible to change the center of mass to improve heat dissipation but that would clearly change the gameplay too much (to my taste)\u003C/p\u003E\n"},{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-07-02T11:20:08Z","Content":"\n\u003Cp\u003EThanks for the mod, I\u0027ll have a look at it.\u003C/p\u003E\n"},{"CreatedByName":"ammobake","CreatedById":103703,"CreatedDateTime":"2014-02-23T06:22:34Z","Content":"\n\u003Cp\u003EThe tricouplers can be pretty fun!\u003C/p\u003E\u003Cp\u003EI once attempted a concept rocket called trifecta which was a single occupant probe core. on 4 sides were the support boxes and 4 fuel tanks outside of that. I then added tricoupler and three fuel tanks below that. I added side-mount engines and landing struts on the trifecta fuel tanks themselves (no landing gear on the probe).\u003C/p\u003E\u003Cp\u003EI have a screenshot which proves it is possible to land on the mun with this configuration too!\u003C/p\u003E\u003Cp\u003EI imagine I could also add a tank on top of the probe with side mounts and use that for return only.\u003C/p\u003E\u003Cp\u003EUsing Tricoupler-mounted tanks to mount your landing struts on gives you multiple balanced points of contact and a really wide landing base which is good.\u003C/p\u003E\u003Cp\u003EThe configuration is a bit top-heavy though so you have to be sure not to land on the edge of a crater or something!\u003C/p\u003E\n"}]}