{"TopicId":35567,"ForumId":16,"TopicTitle":"i need to send this mun base up and i started 2 weeks ago","CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-02T04:51:34Z","PageNum":1,"Articles":[{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-02T04:51:34Z","Content":"\n\u003Cp\u003Eok i am a beginner and i am just trying to figure out how to safely land on the Mun with a base but considering how i crashed my first attempt at landing on Mun which was still successful because the pilots survived but i still want some help to deliver this\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/aJVQvtu.png\u0022 alt=\u0022aJVQvtu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Efront side\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7kE1H3W.jpg\u0022 alt=\u00227kE1H3W.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eback side\u003C/p\u003E\u003Cp\u003Ethere is the core of the base and if it is a good start or crap please tell me but at this point i just want to know what it would require to send it up before i try anything ok so please just help a guy out....\u003C/p\u003E\u003Cp\u003Ealso there is a rover on it that is unmanned and can deploy in case i want to see any easter eggs\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-02T04:54:36Z\u0022 title=\u002207/02/2013 04:54  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 2, 2013\u003C/time\u003E by Helix935\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rustylugnut","CreatedById":62058,"CreatedDateTime":"2013-07-02T06:35:43Z","Content":"\n\u003Cp\u003EYou want to start small. You might want to get more general practice in flying and landing and orbital mechanics and stuff before you start trying to build a base on the mun. Other than that, it looks like a pretty good base. You might want to take those big roof panel things off if you don\u0027t have a powerful computer,though, they might make it lag a little.(or alot)\u003C/p\u003E\n"},{"CreatedByName":"rob_dray","CreatedById":73006,"CreatedDateTime":"2013-07-02T06:58:10Z","Content":"\n\u003Cp\u003ESend it up in smaller pasts and dock them together when on the mun. It is hard getting to another part of the station and moving it around to dock without wheels, so i would recommend wheels and then landing legs to lift the wheels of the ground.\u003C/p\u003E\n"},{"CreatedByName":"chrischambers","CreatedById":69113,"CreatedDateTime":"2013-07-02T12:06:30Z","Content":"\n\u003Cp\u003EPerson, I would breck this up into two,\u003C/p\u003E\u003Cp\u003Ethe first to have the Rover and a Module, and the Second to have the second half of the Module and the Cross Connection., and then have legs to set it at the height, to which I want it to be at.\u003C/p\u003E\u003Cp\u003Ebut first look at youtube, and search for video\u0027s on how to send and return from Mun, as this will give you a idea on how to move forward.\u003C/p\u003E\u003Cp\u003Ebut rest ashore that you are not the only one having issues, as I also had a lot of issues at the beginning and still am at docking in space :-(\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-07-02T12:32:24Z","Content":"\n\u003Cp\u003EIf you\u0027re not comfortable landing on the MÃƒÂ¼n I\u0027d advice you to swap out those fuel tanks for hitchhiker storage containers instead. Those two fueltanks give 36 tons of mass, two hitchhiker containers is 5 tons. Unless you\u0027re going to use the fueltanks for the landing, in which case you could just slap some radial engines onto the sides and off you go.\u003C/p\u003E\u003Cp\u003EYour base\u0027s center of mass will be off though because of the rover on one side and the opposite side only has a probecore and some bits. I\u0027d advice you to copy the rover (alt - leftclick) and place one on the opposite side as well. Can move the probecore to another location as it\u0027s light enough.\u003C/p\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2013-07-02T13:53:18Z","Content":"\n\u003Cp\u003Edouble postage.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-02T14:14:10Z\u0022 title=\u002207/02/2013 02:14  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 2, 2013\u003C/time\u003E by falofonos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2013-07-02T14:02:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027d advice you to copy the rover (alt - leftclick)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWoop - learned something.\u003C/p\u003E\n"},{"CreatedByName":"falofonos","CreatedById":57821,"CreatedDateTime":"2013-07-02T14:13:43Z","Content":"\n\u003Cp\u003EAs long as the center of mass is and remains inline with the center of thrust, it shouldn\u0027t be too hard to land it. May take a few tries though.\u003C/p\u003E\u003Cp\u003EAs mentioned above, if your center of mass is off in any direction then the landing rockets will force it into a spin. If the off center mass difference is very small then RCS may prevent a spin and vectoring rockets will be able to compensate to some extent but even a small imbalance will cause a spin at higher throttle settings.\u003C/p\u003E\u003Cp\u003ESimplest way to get it down safely may be to undock the rover in orbit and land it using some sort of skycrane or have 2 rovers as Johnno suggests.\u003C/p\u003E\u003Cp\u003ELanding problems are usually by either coming down with too much velocity generally, resulting in your craft going splat - boom, or touching down with too much lateral velocity leading to a bounce and spin. In the first case a full burn skyward will hopefully prevent lithobreaking, in the second you can overcome it by burning fuel at any altitude to reduce your orbital speed to 0, then you only have to deal with the gravitational acceleration.\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-02T17:33:10Z","Content":"\n\u003Cp\u003Ethat panel at the top is there for i planned on having like a flying rover powered by RCS land on top but at this point it is really just structural\u003C/p\u003E\n"},{"CreatedByName":"troyn123","CreatedById":72967,"CreatedDateTime":"2013-07-02T18:31:52Z","Content":"\n\u003Cp\u003EI\u0027d second what the other folks have said... Start smaller, break it up into small, balanced components that you can assemble via docking once it\u0027s on the moon.\u003C/p\u003E\u003Cp\u003ENow, if you don\u0027t want to listen to sound advice and like building big for fun... Start with a really freakin\u0027 heavy booster stage that can push that thing most of the way to the MÃƒÂ¼n. Add a landing stage to your base with either engines with a \u003Cstrong\u003Ereally\u003C/strong\u003E far vectoring range, or with a decent amount of attitude RCS (no real need to translation though). I\u0027ve got a ludicrously inefficient heavy booster stage that has still served me well. My base was really heavy, so I had to bring my fuel tug from my Kerbin/MÃƒÂ¼n halfway station to top it off a bit to get it landed successfully, but it still got to high orbit just fine.\u003C/p\u003E\u003Cp\u003EI think the key points were:\u003C/p\u003E\u003Cp\u003E * Have fuel lines from the outside tanks replenishing the middle tank, so you use up the heavy outer boosters down low in Kerbin\u0027s gravity when you need it most, and then ditch them, but continue on a completely full central tank.\u003C/p\u003E\u003Cp\u003E * Some separation motors aren\u0027t necessary, but helped. I don\u0027t lose tail fins or knock engines loose anymore, ever since I added those.\u003C/p\u003E\u003Cp\u003E * Small tanks in between the big orange Rockmax tank and the Mainsail, for better heat dissipation.\u003C/p\u003E\u003Cp\u003E * Struts between the tanks.\u003C/p\u003E\u003Cp\u003E * And the most recent change that worked amazingly: Bind the outer boosters to an action group that toggles the engine gimballing. Keep the outer boosters\u0027 gimbals locked unless you really need it, and you\u0027ll wobble a lot less.\u003C/p\u003E\u003Cp\u003EI can send you the craft file if that appeals at all. There\u0027s probably tons of better/more efficient booster stages to be found around these forums though!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VOldIYR.jpg\u0022 alt=\u0022VOldIYR.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-02T19:02:12Z","Content":"\n\u003Cp\u003Ethats good to know thanks but i suck at docking due to over shooting and i upgraded the munar base already as shown below\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jKqcLKj.jpg\u0022 alt=\u0022jKqcLKj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Efront\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RKP6dFn.png\u0022 alt=\u0022RKP6dFn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Eback\u003C/p\u003E\u003Cp\u003Eand i am keeping the rover there \u003C/p\u003E\u003Cp\u003Ei am already working on installing rockets on it through decouplers\u003C/p\u003E\u003Cp\u003Ei am also working on sending up manned rovers along with free kerbals to populate the base\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-02T19:12:27Z\u0022 title=\u002207/02/2013 07:12  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 2, 2013\u003C/time\u003E by Helix935\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-02T20:12:12Z","Content":"\n\u003Cp\u003Ei now have a prototype of the rockets that i will use to send the base up shown below\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bvv2OTw.jpg\u0022 alt=\u0022bvv2OTw.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Eas shown above currently it can nearly reach orbit and will be able to soon when enough time is applied\u003C/p\u003E\n"},{"CreatedByName":"chrischambers","CreatedById":69113,"CreatedDateTime":"2013-07-03T06:03:06Z","Content":"\n\u003Cp\u003Eit looks top heavy, how does she fly ?\u003C/p\u003E\n"},{"CreatedByName":"K^2","CreatedById":57710,"CreatedDateTime":"2013-07-03T06:23:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chrischambers\u0022 data-cite=\u0022chrischambers\u0022\u003E\u003Cdiv\u003Eit looks top heavy, how does she fly ?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat doesn\u0027t actually matter too much. So long as the thrust vector is properly aligned, it takes very little torque to keep the rocket flying straight, so even a top-heavy rocket should be stable enough.\u003C/p\u003E\n"},{"CreatedByName":"AntiEmerald","CreatedById":73150,"CreatedDateTime":"2013-07-03T06:55:18Z","Content":"\n\u003Cp\u003Ethats gonna be way too heavy youve gotta send modules up one at a time and make sure their powerful enough to lift and aerodynamic\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-03T17:22:43Z","Content":"\n\u003Cp\u003Eagain i suck at docking and when i tested it it turned out it is capable of orbit by itself but whenever i separate stages it destabilizes and blows up on the spot which is why i recently tried adding SRBs to stabilize it but i am still working in it\u003C/p\u003E\u003Cp\u003Ein case any one is wondering i don\u0027t mods either so i am just using stock parts ok\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-03T17:34:54Z\u0022 title=\u002207/03/2013 05:34  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 3, 2013\u003C/time\u003E by Helix935\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-03T18:05:02Z","Content":"\n\u003Cp\u003Ealso the current version which has already been tested to almost reach orbit but not completely reach it\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dybG5WD.jpg\u0022 alt=\u0022dybG5WD.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethe center of lift shown confuses me because i made sure to have as much symmetry as possible but still exist for some reason but i will ignore for the time being\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-03T18:19:30Z\u0022 title=\u002207/03/2013 06:19  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 3, 2013\u003C/time\u003E by Helix935\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-07-03T18:25:14Z","Content":"\n\u003Cp\u003EYou need to find your command pod, click on it to move the whole assembly around, and move it sideways to get the center of thrust (the purple arrow sphere) pointing directly at the center of lift (the blue sphere on the ground). Otherwise your rocket won\u0027t fly straight under thrust; I\u0027ve had that problem crop up on me several times and recentering the rocket in the VAB corrected it. A bug with the game, no doubt.\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-04T17:48:55Z","Content":"\n\u003Cp\u003Eyeah the thrust is centered but i already found that the problem will only be a problem if i didn\u0027t have a SAS module and when i am still in atmosphere so not really to worry at the moment also right i am delivering manned rovers to MUN right now but i need to make sure what wheels will work on the surface because i know rovemax m1 doesn\u0027t and rovemax s2 does but what i really need to know is whether or not ruggedized wheels do. Just a question which will solve many problems for me in the future.\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-05T19:35:14Z","Content":"\n\u003Cp\u003Eactually i had already figure out the problem because it was the wheels orientation that screwed it up so ok\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-06T05:17:31Z","Content":"\n\u003Cp\u003EOK now i am back to trying to solve the mun base issue which so far is leaving thinking how the crap do i do this also i just put in both versions of mechjeb plus escape pods in case of disasters to help out but i still need help getting it off the ground\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zLDtuKp.jpg\u0022 alt=\u0022zLDtuKp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ehere is the image now with stats thanks to mechjeb\u003C/p\u003E\u003Cp\u003Eand if you wonder why i got back to this issue it is because i crashed about 6 times because i keep landing on the dark side and/or ran out of fuel when i tried to send manned rovers\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-06T18:49:45Z\u0022 title=\u002207/06/2013 06:49  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 6, 2013\u003C/time\u003E by Helix935\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-09T02:07:38Z","Content":"\n\u003Cp\u003Eok guys i need some help right now because while i was putting in add ons i ran into a problem i downloaded a mod opened the game and found all the parts are gone and i tried deleting the mod but it did not help the least bit so what do i do?\u003C/p\u003E\u003Cp\u003Ejust so you know i can\u0027t land the base without parts of any kind\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-09T20:08:31Z","Content":"\n\u003Cp\u003Enever mind i figured it out but now i have a new problem because for some reason whenever i go to launch pad i am stuck with no stages because the stages window on the left would disappear. i need to fix this because i can\u0027t stand having to turn on engines manually\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-10T02:28:58Z","Content":"\n\u003Cp\u003Enever mind i fixed it due to a messed up mod and i will use jool launchers to get it to Mun sadly\u003C/p\u003E\n"},{"CreatedByName":"Helix935","CreatedById":71312,"CreatedDateTime":"2013-07-14T01:39:53Z","Content":"\n\u003Cp\u003Euhh actually the jool launchers were also messed up so i am still stuck with the same problem i have managed to fix it to the point that i can only use multi stage unmanned probes without a messed up stages thing\u003C/p\u003E\n"}]}