{"TopicId":35660,"ForumId":16,"TopicTitle":"Why my ship is rotating?","CreatedByName":"vtgbart","CreatedById":67951,"CreatedDateTime":"2013-07-02T20:21:05Z","PageNum":1,"Articles":[{"CreatedByName":"vtgbart","CreatedById":67951,"CreatedDateTime":"2013-07-02T20:21:05Z","Content":"\n\u003Cp\u003EHi, I post that one in different section, but it didnt show up, so I try here \u003C/p\u003E\u003Cp\u003EI have just spent couple of houors building thath ship on Kerbin\u0027s orbit - combined my lander and its deploing vessel to two space tugs ( I call them space taxis). One was mounted in front of the lander, the other behind. After long docking procedures I refuelled entire ship and tested it - teh objective was to get enough delta V to get to moho. \u003C/p\u003E\u003Cp\u003EUnfortunately my ship started to revolve after i throttled it up. What did I do wrong? HELP ! I could send you a quicksave on priv\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i42.tinypic.com/2hmikah.png\u0022 alt=\u00222hmikah.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"dahud","CreatedById":6309,"CreatedDateTime":"2013-07-02T20:32:12Z","Content":"\n\u003Cp\u003EA couple of things come to mind: \u003C/p\u003E\u003Cp\u003EOne, you might have inadvertently set the trim on your ship. Trim is a sort of a preset for rotating used mainly for airplanes. If you turn on RCS with no throttle and it tries to spin you, then that\u0027s the problem. Reset the trim with Alt\u002BX.\u003C/p\u003E\u003Cp\u003ESecond, you might have exhaust from some of your engines hitting parts of your ship. When this happens, some or all of the engine\u0027s thrust is negated in accordance with Newton\u0027s first law. To test for this, turn off all the engines except the ones in the back.\u003C/p\u003E\u003Cp\u003EFinally, there might be some imbalance that\u0027s not immediately visible. Pay close attention to how the modules are lined up.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-07-02T21:01:18Z","Content":"\n\u003Cp\u003ETwo more possible options:\u003C/p\u003E\u003Cp\u003EParts that partially clip can push against each other and cause phantom forces. To correct undock (and replace) the offending section.\u003C/p\u003E\u003Cp\u003EEngine gimballing in front of the CoG is borked pushing the nose in the opposite direction. To solve this simply disable all gimballing in front of the CoG.\u003C/p\u003E\n"}]}