{"TopicId":35860,"ForumId":16,"TopicTitle":"Minmus Landings","CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2013-07-04T10:36:02Z","PageNum":1,"Articles":[{"CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2013-07-04T10:36:02Z","Content":"\n\u003Cp\u003EMe and my friends are doing a Mun-\u0026gt;Minmus-\u0026gt;Kerbin challenge. I was wondering if the gravity on Minmus is light enough to shoot a Kerban off towards it on a ladder or something and land them safely using the jetpack? If not what is the minimum required to land on Minmus?\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-07-04T11:14:56Z","Content":"\n\u003Cp\u003EYou need roughly 480 m/s dV (240 m/s going down, 240 going up) to land and take off from Minmus. And yes, a Kerbal can land and get to orbit with just his jetpack.\u003C/p\u003E\n"},{"CreatedByName":"Khrissetti","CreatedById":29557,"CreatedDateTime":"2013-07-04T12:14:20Z","Content":"\n\u003Cp\u003EYeah, I\u0027ve gotten a kerbal down to the \u0027seas\u0027 of Minmus, then back to orbit and inside the craft using 99.3% of the jetpack fuel (And I\u0027m sure you could do it with less)\u003C/p\u003E\n"},{"CreatedByName":"SZDarkhack","CreatedById":57439,"CreatedDateTime":"2013-07-04T12:23:37Z","Content":"\n\u003Cp\u003EA little tip, if the order is not set in stone in your challenge\u0027s rules, prefer Minmus-\u0026gt;Mun-\u0026gt;Kerbin, it\u0027s much more efficient, especially if you\u0027re landing on both moons (you\u0027ll want to be the lightest when you visit the larger gravity well).\u003C/p\u003E\n"},{"CreatedByName":"Synapse","CreatedById":72502,"CreatedDateTime":"2013-07-04T12:28:11Z","Content":"\n\u003Cp\u003EThanks for the tip!\u003C/p\u003E\n"},{"CreatedByName":"PwnedDuck","CreatedById":54398,"CreatedDateTime":"2013-07-04T15:47:37Z","Content":"\n\u003Cp\u003EAlso, land on some of the high mountains to save a few m/s. You can alyays walk down to the lakes if you want to see them...\u003C/p\u003E\n"},{"CreatedByName":"Aragosnat","CreatedById":60487,"CreatedDateTime":"2013-07-04T18:12:36Z","Content":"\n\u003Cp\u003EOne can also seed the MÃƒÂ¼n and MinmÃƒÂ¼s with can landers or probes that have pods that don\u0027t have Kerbals in them so that any dropped Kerbal has a nice place to refuel their packs or just have a manned one to swap Kerbals in and out.\u003C/p\u003E\n"}]}