{"TopicId":35911,"ForumId":16,"TopicTitle":"Rover rotation locked after using KAS","CreatedByName":"decadence","CreatedById":73031,"CreatedDateTime":"2013-07-04T19:59:58Z","PageNum":1,"Articles":[{"CreatedByName":"decadence","CreatedById":73031,"CreatedDateTime":"2013-07-04T19:59:58Z","Content":"\n\u003Cp\u003EAfter releasing my rovers from the KAS, they seem to be stuck in whatever orientation they were in at the time of release.\u003C/p\u003E\u003Cp\u003EThey can roll forwards and backwards, but when I try to turn they just slide sideways slowly even though the wheels move as if they were steering.\u003C/p\u003E\u003Cp\u003EI even got a rover to become locked at a 45 degree angle to the surface, and I know it shouldn\u0027t balance that way.\u003C/p\u003E\u003Cp\u003EWhat did I do to break physics?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cs.unm.edu/~kdilts/screen4.jpg\u0022 alt=\u0022screen4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EApparently if I turn docked mode off, the rover will just start to rotate upwards and start to float away, flipping the lander in the process.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cs.unm.edu/~kdilts/screen5.jpg\u0022 alt=\u0022screen5.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-04T20:07:38Z\u0022 title=\u002207/04/2013 08:07  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 4, 2013\u003C/time\u003E by decadence\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-07-04T20:11:15Z","Content":"\n\u003Cp\u003EThe same thing happened to me when I attached two landers to each other with KAS. The solution for me was to switch what craft has the winch on it. Example: If the rover has the winch and the ship has the connector, then instead try to use the ship\u0027s winch and connect it to the rovers connector.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-04T20:14:43Z\u0022 title=\u002207/04/2013 08:14  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 4, 2013\u003C/time\u003E by RocketPilot573\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"decadence","CreatedById":73031,"CreatedDateTime":"2013-07-04T20:19:49Z","Content":"\n\u003Cp\u003EI have 2 winches on the ship, and the connector ports on the rovers. I don\u0027t see how I could put the winches on the rovers, and get the cables up to the top of the rocket to connect for launching?\u003C/p\u003E\u003Cp\u003EAlso, I tried a fresh rocket and rovers, and here is the result of trying to lift the first rover:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cs.unm.edu/~kdilts/screen6.jpg\u0022 alt=\u0022screen6.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"decadence","CreatedById":73031,"CreatedDateTime":"2013-07-05T18:42:48Z","Content":"\n\u003Cp\u003EI\u0027ve found that quicksaving, and reloading will allow things to start rotating again. This isn\u0027t really a satisfying fix though. If anyone has any insight as to what causes the problem in the first place, or knows of other ways to avoid it I would like to hear them.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-07-05T20:34:08Z","Content":"\n\u003Cp\u003EThis happened to me many times without using KAS. I always just went back to the tracking center as soon as I undocked, then went back to the rover. That way I didn\u0027t have to worry about anything being screwed up in the quicksave.\u003C/p\u003E\n"}]}