{"TopicId":35972,"ForumId":16,"TopicTitle":"Larger plane takeoff problems","CreatedByName":"XenonSpark","CreatedById":34525,"CreatedDateTime":"2013-07-05T08:54:05Z","PageNum":1,"Articles":[{"CreatedByName":"XenonSpark","CreatedById":34525,"CreatedDateTime":"2013-07-05T08:54:05Z","Content":"\n\u003Cp\u003EHi everyone,\u003C/p\u003E\u003Cp\u003EI have a relatively large SSTO (eventually) spaceplane that I\u0027ve been working on for the past few hours. The first half hour consisted of designing and building, and the rest has been me trying to figure out why it can\u0027t fly.\u003C/p\u003E\u003Cp\u003EWell, to be more specific, why it can\u0027t stay on the runway for longer than a few seconds. As I accelerate, when I reach about 45 or 50 m/s the plane suddenly veers right very sharply and banks left.\u003C/p\u003E\u003Cp\u003EI\u0027ve been focusing on making really strong (see: struts) landing gear configurations, but is there something else I\u0027m overlooking?\u003C/p\u003E\u003Cp\u003EHere are a few pictures of the plane:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UryWEk0.jpg\u0022 alt=\u0022UryWEk0.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/C1mMNys.jpg\u0022 alt=\u0022C1mMNys.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DD6I8HD.jpg\u0022 alt=\u0022DD6I8HD.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-05T20:07:54Z\u0022 title=\u002207/05/2013 08:07  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 5, 2013\u003C/time\u003E by XenonSpark\u003C/strong\u003E\n\u003Cbr\u003EAnswered\n\u003C/span\u003E\n"},{"CreatedByName":"legoheli","CreatedById":47640,"CreatedDateTime":"2013-07-05T09:35:24Z","Content":"\n\u003Cp\u003EMost problems you describe are caused in my experience by only having a single vertical stabilizer. \u003C/p\u003E\u003Cp\u003EThe problem is that you\u0027re essentially using wings for vertical stabilization, and a wing pulls you in one direction. If you want to just have a single stabilizer, use part clipping and place them inside each other.\u003C/p\u003E\n"},{"CreatedByName":"XenonSpark","CreatedById":34525,"CreatedDateTime":"2013-07-05T10:32:25Z","Content":"\n\u003Cp\u003EThanks. I added a second one and instead of the plane veering and rolling (followed by intense drifting, followed by death), this time it just veers right. I had no problems with roll whatsoever. I\u0027ll continue to play with the design (further suggestions are still welcome).\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-07-05T10:53:06Z","Content":"\n\u003Cp\u003EApologies for what I am going to say legoheli: Your suggestion is \u003Cstrong\u003Etotal BULL!\u003C/strong\u003E With real life aerodynamics you would be correct to say a wing as a stabilizer would pull a plane to one side but this is KSP. Here the aerodynamics don\u0027t work like that.\u003C/p\u003E\u003Cp\u003ESudden drift on the runway is usually cause by improper landing gear placement. The main (rear) landing gear should be placed not far behind the CoG for easy rotation. If placed too far backward it takes a lot of effort getting the nose to lift. If then the landing gear isn\u0027t perfectly perpendicular to the runway one side can loose traction before the other causing asymmetric drag resulting in a violent turn.\u003C/p\u003E\u003Cp\u003EReduce the number of wheels to the bare minimum and make sure you get them dead straight: single nose gear and regular main. Only double them up it it can\u0027t bare the weight but make sure you keep them perpendicular to the ground and in-line.\u003C/p\u003E\n"},{"CreatedByName":"XenonSpark","CreatedById":34525,"CreatedDateTime":"2013-07-05T19:38:05Z","Content":"\n\u003Cp\u003EHm, alright. That makes a lot of sense given the fact that I have 10 or so landing gears. I\u0027ll try minimizing them. I will keep the second vertical stabilizer for extra in-flight stability. I\u0027ll be back in a few minutes to let you know if the landing gear adjustments worked.\u003C/p\u003E\u003Cp\u003EEDIT: Huzzah! After some experimenting I determined that having the gears mounted on the undersides of my rear wings was the problem. The fact that the wings are mounted at slight angles means that the gears wouldn\u0027t quite snap into a straight alignment. So I moved the gears over to the undersides of my air-breathing engine mounts and takeoff was perfectly smooth. I flew the craft for a glorious two minutes before it stalled at 9000 m. Time to add more stabilizers. Thanks for your help.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-05T19:56:14Z\u0022 title=\u002207/05/2013 07:56  PM\u0022 data-short=\u002211 yr\u0022\u003EJuly 5, 2013\u003C/time\u003E by XenonSpark\u003C/strong\u003E\n\u003Cbr\u003ESuccess!\n\u003C/span\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-07-06T13:02:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022XenonSpark\u0022 data-cite=\u0022XenonSpark\u0022\u003E\u003Cdiv\u003E.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you have a finished design, please share the craft file and note the used mods for it.\u003C/p\u003E\u003Cp\u003EI really like the look!\u003C/p\u003E\n"}]}