{"TopicId":36038,"ForumId":16,"TopicTitle":"Refueling, joysticks, and RCS on tugs","CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-07-05T20:39:28Z","PageNum":1,"Articles":[{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-07-05T20:39:28Z","Content":"\n\u003Cp\u003ESo I have been playing KSP for a week or so, and love itg and no longer have any free time...\u003C/p\u003E\u003Cp\u003EI have a few little questions that I am sure someone who has been playing for longer can easily answer:\u003C/p\u003E\u003Cp\u003E1) I have added the kethane mod, and lcoated kethane on the Mun, but before I go ahead with my plan for estabishing a refinary on the Mun and runnign a tanker service to haul fuel up the my Mun-orbit fuel depot, how do I get the fuel from the refinary to the landed tanker? Do I have to dock the lander to the refinary? Do I need a rover to do the transfer or can I plug them together using and EVA and the KAS mod?\u003C/p\u003E\u003Cp\u003E2) I recon that to fly spaceplanes, and particularly to land landers I will need to use a joystick, but when I tried to use a joystick to fly to orbit it was a disaster because the booster was pretty unstable on launch. Is there a way to enable / disbale the joystick ingame?\u003C/p\u003E\u003Cp\u003E3) Finally I have had a problem with tugs and RCS. I been designing my RCS to have two sets of thrusters - those specifically for rotation and those for translation. I hook them up to a couple of action groups and then enable and disable them depending on if I want to rotate or translate. This obviously requires then to be precisly located depending on the centre of mas. However when I dock to a cargo the centre of mass changes dramatically, and I can\u0027t dock. Is there a soution to this problem? Onething that occured would be to reprogramme the actions groups in flight. is this possible?\u003C/p\u003E\u003Cp\u003EThanks for the help inadvance. Applogies to the hosts/admins if this would have been better as three threads. Tell me off and I will do better next time!\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-07-06T00:24:26Z","Content":"\n\u003Cp\u003E1) KAS will work fine for that, since it\u0027s docking anyway.\u003C/p\u003E\u003Cp\u003E3) It\u0027s not possible to change action groups, but you can manually right-click on the RCS thrusters and toggle them on or off. Also, unless you are using them as main engines, you should be able to rotate and translate with the same ones.\u003C/p\u003E\n"},{"CreatedByName":"HoY","CreatedById":57294,"CreatedDateTime":"2013-07-06T00:58:36Z","Content":"\n\u003Cp\u003EThere\u0027s a mod that lets you change action groups after you\u0027re launched. \u003C/p\u003E\u003Cp\u003EAt least there was in .19.1, I\u0027m looking for it now its called something like action on the fly\u003C/p\u003E\u003Cp\u003EEdit; found it. Looks like it hasn\u0027t been updated since the thread was created but it may still work \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24882-Actions-on-the-Fly-Edit-your-action-groups-in-flight-mode?highlight=Action\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/24882-Actions-on-the-Fly-Edit-your-action-groups-in-flight-mode?highlight=Action\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EEdit2; looks like Pontiac updated the mod, link is on the last page of the thread.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-06T01:28:47Z\u0022 title=\u002207/06/2013 01:28  AM\u0022 data-short=\u002211 yr\u0022\u003EJuly 6, 2013\u003C/time\u003E by HoY\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-07-06T19:35:25Z","Content":"\n\u003Cp\u003EOK, thanks for the fedback. Sounds like I need to get KAS up and running. It is usual for folks to land landers on the Mun within walking distances of bases? Or do I need rovers to drive for several kilometers between landing sit and base?\u003C/p\u003E\u003Cp\u003EAlso, on the RCS thing, does everyone else keep all their RCS thrusters on at once? Am I feeling the need to enable / disable them depending on what I am doing because my spacecraft is not designed right?\u003C/p\u003E\n"}]}