{"TopicId":36977,"ForumId":16,"TopicTitle":"Why is one engine burning more fuel then the other?","CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-14T00:51:18Z","PageNum":1,"Articles":[{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-14T00:51:18Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/577868656160380793/3F158D2F056BE649307D4116392DEA78342C7DC2/\u0022 alt=\u00223F158D2F056BE649307D4116392DEA78342C7DC2\u0022\u003E\u003C/p\u003E\u003Cp\u003EIve been working on this rocket for awhile now. Thing is a titan and it handles like a fighter jet. Only thing holding this rocket back from orbit is the fact that one of the outer liquid boosters burns just over a thousand units of fuel more then other. I messed around with my fuel line combinations, but nothing seems to make it better. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/577868656161618148/FD022BF68FD9CEA73DA7BDCCF0BF5605382D018D/\u0022 alt=\u0022FD022BF68FD9CEA73DA7BDCCF0BF5605382D018D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/577868656161619244/1D2A3821BD304ECC9F6A0D93A4595031F6E06683/\u0022 alt=\u00221D2A3821BD304ECC9F6A0D93A4595031F6E06683\u0022\u003E\u003C/p\u003E\u003Cp\u003ETwo fuel lines on each center tank go from the center to the two outer boosters. The nosecone section has fuel in it.. Then these outer boosters drain into the center engines tank down at the bottom of the craft. This tank has no influence on the two upper stage tanks. So I cannot figure out why one of the engines burns more then then other. I think its the left engine that cuts out a second before sending the craft to its death. Any tips? The craft is a combination of a few mods. The new Novapunch, KW, KAS. The radial mono tanks are from the Kosmos station pack.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-14T08:25:14Z\u0022 title=\u002207/14/2013 08:25  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 14, 2013\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Syhrus","CreatedById":64839,"CreatedDateTime":"2013-07-14T01:07:04Z","Content":"\n\u003Cp\u003EWow are you launching a new moon into orbit or something? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only thing I can think of is fuel lines. I assume your little boosters are run into the large boosters for fuel efficiency? If so, double check ALL of them and see if one is not connected properly, or not facing the right way, etc.\u003C/p\u003E\u003Cp\u003EThat\u0027s about the only thing I can think of.\u003C/p\u003E\n"},{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-14T01:07:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E-cut-\u003C/p\u003E\u003Cp\u003ETwo fuel lines on each center tank go from the center to the two outer boosters. The nosecone section has fuel in it.. Then these outer boosters drain into the center engines tank down at the bottom of the craft. This tank has no influence on the two upper stage tanks. So I cannot figure out why one of the engines burns more then then other. I think its the left engine that cuts out a second before sending the craft to its death. Any tips? The craft is a combination of a few mods. The new Novapunch, KW, KAS. The radial mono tanks are from the Kosmos station pack.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s probably a fault of the plugins. Some parts might be broken and you\u0027ll need to report to the developer of the plugin the issue. If it\u0027s not that, try experimenting with staging and removing the fuel ducts. Also, the amount of parts might cause other parts to break.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-14T01:11:51Z","Content":"\n\u003Cp\u003ELol it works way better then it should. There\u0027s a very large craft in that fairing bound for a Moho landing and return. Sorry I forgot to mention the little boosters are solid fuel. They seperate long before.\u003C/p\u003E\n"},{"CreatedByName":"Gatrnerd","CreatedById":74268,"CreatedDateTime":"2013-07-14T01:12:19Z","Content":"\n\u003Cp\u003EIt might be a fault of the game because of the amount of parts. Here\u0027s some things that may or may not work. It\u0027s good to keep a backup of your craft just in case.\u003C/p\u003E\u003Cp\u003E1. Remove the fuel ducts.\u003C/p\u003E\u003Cp\u003E2. The parts that came with the plugin might be broken, and thus, you\u0027ll need to tell the plugin\u0027s developer about the error. The plugins might not be compatible with each other.\u003C/p\u003E\u003Cp\u003EAnd lastly, 3. It could have something to do with the center of thrust. Experiment a bit.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-07-14T01:16:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003E\u003Cimg src=\u0022%7Boption%7D\u0022 class=\u0022ipsImage\u0022 alt=\u0022%7Boption%7D\u0022\u003ETwo fuel lines on each center tank go from the center to the two outer boosters. The nosecone section has fuel in it.. Then these outer boosters drain into the center engines tank down at the bottom of the craft.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESounds like you simply have too many fuel lines and in a bad layout. From what I understand you\u0027ve created a loop, which is pointless and will just confuse the fuel logic into breaking.\u003C/p\u003E\u003Cp\u003EIf you\u0027re dropping the outside tanks when they\u0027re empty then they should feed the center engine, a single fuel line each at the bottom will be enough. That\u0027s all there is to it. Loops at least confuse the logic but I wouldn\u0027t put several fuel lines where only one is needed either. It\u0027s always best to keep it simple, the more fuel connections you have the more the logic will be stressed.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-14T01:26:14Z","Content":"\n\u003Cp\u003EThere shouldnt be a loop. The center tank feeding the main engine is isolated. The two tanks above it feed into each outer booster which feed into that isolated tank.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2013-07-14T01:30:12Z","Content":"\n\u003Cp\u003EI am looking for something new to do. If you could upload the .craft and provide a link, I\u0027d like to try and find the problem.\u003C/p\u003E\u003Cp\u003Eedit : also list the mods used so I can get the parts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-14T01:33:10Z\u0022 title=\u002207/14/2013 01:33  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 14, 2013\u003C/time\u003E by Otis\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-07-14T01:47:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EThere shouldnt be a loop. The center tank feeding the main engine is isolated. The two tanks above it feed into each outer booster which feed into that isolated tank.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow is it isolated, with a decoupler? It might even be enough that you\u0027re transferring from the center stack to outer stacks and back in, no matter how isolated they are. I\u0027ve seen it before, designs that *should* work if logic is applied properly simply don\u0027t because there\u0027s too many connections or error in routing logic. Also are you splitting fuel or are the tanks separated from eachother in the middle? That could also be enough.\u003C/p\u003E\u003Cp\u003EBottom line, keep it simple. A center stack of tanks with an engine, side boosters feeding into the middle with one fuel line each, drop outside tanks when empty. Adding further tanks would make it asparagus (not sure if just one tank each side counts) just don\u0027t connect the two strings to eachother, I\u0027ve seen that fail as well.\u003C/p\u003E\u003Cp\u003ENo matter how much you try to defend your design you\u0027ve already proved it\u0027s faulty. Logically it may work but the fuel logic breaks at times, hence keep it simple.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-14T01:48:47Z\u0022 title=\u002207/14/2013 01:48  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 14, 2013\u003C/time\u003E by Johnno\u003C/strong\u003E\n\u003Cbr\u003Eclarification\n\u003C/span\u003E\n"},{"CreatedByName":"voidptr","CreatedById":71802,"CreatedDateTime":"2013-07-14T02:07:19Z","Content":"\n\u003Cp\u003EDo you get any structural failure messages in the log at the end? I\u0027ve had high-thrust rockets where shortly after launch the joint between two tanks in one booster failed, so the upper tank didn\u0027t drain completely. As soon as the lower tank emptied, engine shuts down and asymmetric thrust at that point dooms it. Reinforcing the joint with a few trusses and struts takes care of it.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-07-14T02:30:12Z","Content":"\n\u003Cp\u003EAre the two center tanks that you are draining from of equal size? If so, you could just use one fuel line fore each center tank. Send fuel from one tank to the left engine, and fuel from the other tank to the right engine. Then from there send it back to the bottom central tank.\u003C/p\u003E\u003Cp\u003EThat might help, because I think the game is getting confused trying to balance fuel flow from so many different sources.\u003C/p\u003E\u003Cp\u003EThat said, I\u0027m not sure I understand the purpose of this overly complicated setup. Are you trying to get the central section into space with the top part, two empty fuel tanks, and two engines? I assume those are engines between the fuel tanks, with a thin decoupler below them (with the little red arrows). I can understand refueling in space, but why would you need two engines? It might work better to just use a single engine with a bigger fuel tank above it, then you would only have one source for fuel.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-07-14T08:24:50Z","Content":"\n\u003Cp\u003EHey sorry fellas I figured it out. You guys were right keep it simple. I changed it to one fuel line per tank going into each booster. Worked great. Ill be uploading a craft file once in the spacecraft exchange once I work the bugs out.\u003C/p\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-07-14T22:17:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Johnno\u0022 data-cite=\u0022Johnno\u0022\u003E\u003Cdiv\u003ESounds like you simply have too many fuel lines and in a bad layout. From what I understand you\u0027ve created a loop, which is pointless and will just confuse the fuel logic into breaking.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, loops can be quite useful. I use them on large rockets that are too heavy to keep going straight with only RCS, so I occasionally might need to turn off a radially mounted engine in order to get it pointing in the right direction again.\u003C/p\u003E\u003Cp\u003EThe problem is that this drains the tanks at different speeds, which, of course, messes up staging when I\u0027m going to drop them, as well as moving the center of gravity.\u003C/p\u003E\u003Cp\u003ESo, by connecting fuel lines in a loop going all the way around the radial tanks, they all drain at the same speed regardless of which engines I use. Very useful.\u003C/p\u003E\u003Cp\u003ETry it out yourself. Make a small rocket with four small radial tanks and a weak engine on each. Draw fuel lines between the tanks clockwise (or, if you prefer, counter-clockwise, just stick to the same direction all the way around). The, put it on supports. Turn off all the engines but one, then start it, without releasing the supports. Watch the tanks all drain in perfect unison. Nifty.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-14T22:49:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Troberg\u0022 data-cite=\u0022Troberg\u0022\u003E\u003Cdiv\u003ETry it out yourself. Make a small rocket with four small radial tanks and a weak engine on each. Draw fuel lines between the tanks clockwise (or, if you prefer, counter-clockwise, just stick to the same direction all the way around). The, put it on supports. Turn off all the engines but one, then start it, without releasing the supports. Watch the tanks all drain in perfect unison. Nifty.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve seen this mess up beginners often enough to know better, but I tested it anyway, and as I expected, it drained one tank at a time. It did this with 4 way and 6 way symmetry, with LV-T30 and LV-1 engines, etc. I tried hard, but couldn\u0027t duplicate your results. At least one of the following is true. 1) The recipe, and my further testing, missed something important. 2) You\u0027ve got an addon causing this effect. 3) your testing methodology was off.\u003C/p\u003E\u003Cp\u003ECould you post a craft file that exhibits the behavior you describe somewhere?\u003C/p\u003E\n"},{"CreatedByName":"Sathurn","CreatedById":58040,"CreatedDateTime":"2013-07-14T23:23:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Troberg\u0022 data-cite=\u0022Troberg\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETry it out yourself. Make a small rocket with four small radial tanks and a weak engine on each. Draw fuel lines between the tanks clockwise (or, if you prefer, counter-clockwise, just stick to the same direction all the way around). The, put it on supports. Turn off all the engines but one, then start it, without releasing the supports. Watch the tanks all drain in perfect unison. Nifty.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESeconded the try did not work. Looping behavior is unpredictable.\u003C/p\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-07-15T12:05:57Z","Content":"\n\u003Cp\u003EI\u0027ll try later today or tomorrow, as I didn\u0027t bother to save the test craft. I use a bunch of mods (MechJeb, Firespitter, NovaPunch, Damned Robotics, Subassembly saver and a few more), but none that explicitly has that effect.\u003C/p\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-07-15T16:58:56Z","Content":"\n\u003Cp\u003EOK, here\u0027s a simple test craft that works for me. Burn on one engine only for a while, then activate all engines and you\u0027ll see that the fuel levels are equal in all four tanks.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://rpglab.net/nobackup/Fuel%20loop%20test.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://rpglab.net/nobackup/Fuel%20loop%20test.craft\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-15T18:54:22Z","Content":"\n\u003Cp\u003EAll the engines run as long as any of the four tanks have fuel, but there was no equalization of fuel levels in the tanks. Each engine drew from a single tank until one of the tanks emptied, so there was equal draw from each tank up to that point. Then, the tank that the empty tank would feed to started emptying faster since two engines were drawing from it. Once that tank emptied, the tank that that tank fed into started emptying faster. Finally, the fourth tank emptied.\u003C/p\u003E\u003Cp\u003EThis doesn\u0027t sound like what you\u0027re describing. Am I misunderstanding you, or are we still not seeing the same results?\u003C/p\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-07-15T20:39:55Z","Content":"\n\u003Cp\u003EThen we are seeing different results. When I burn one engine, it looks like only the one tank it\u0027s attached to drains, but as soon as all engines start to burn, it\u0027s equalized. A bit like with ordinary asparagus staging, where it looks like it drains the inner tanks as well, but as soon as the outer tanks are dropped, the inner snaps to full immediately.\u003C/p\u003E\u003Cp\u003EMy suspicion is that the display is a bit off, but internally, it\u0027s keeping correct count, and some events (such as killing all engines and then starting them again, or dropping a tank) forces the display to update.\u003C/p\u003E\u003Cp\u003EBtw, I run 0.20.2, if that makes any difference.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-15T21:08:25Z","Content":"\n\u003Cp\u003EOne second. Are you saying that the fuel gauges next to the engines in the staging display are equal? That\u0027s not showing how much fuel is in the tank that engine is attached to, that\u0027s showing how much fuel is available to that engine, and since all the fuel that is available to any of the engines is available to all the engines, those bars should be equal. However, that bar is of all the available fuel tanks combined, there\u0027s no indication of whether the fuel is actually balanced.\u003C/p\u003E\u003Cp\u003EThe testing I did, I was checking the amount of fuel in each tank by right clicking on them.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-07-15T21:09:45Z","Content":"\n\u003Cp\u003EAre you talking about actual fuel amounts, or the little green fuel meter next to the engine in the stage list?\u003C/p\u003E\u003Cp\u003EEdit: 1 minute too late\u003C/p\u003E\n"},{"CreatedByName":"Troberg","CreatedById":66999,"CreatedDateTime":"2013-07-16T09:44:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EOne second. Are you saying that the fuel gauges next to the engines in the staging display are equal? That\u0027s not showing how much fuel is in the tank that engine is attached to, that\u0027s showing how much fuel is available to that engine, and since all the fuel that is available to any of the engines is available to all the engines, those bars should be equal. However, that bar is of all the available fuel tanks combined, there\u0027s no indication of whether the fuel is actually balanced.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, I see. Then I misread the instrumentation. My bad, sorry.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-16T16:17:42Z","Content":"\n\u003Cp\u003ENo problem, just wanted to figure out what was going on. I don\u0027t claim to know everything about the game, so I still pursue what knowledge remains.\u003C/p\u003E\n"}]}