{"TopicId":37074,"ForumId":16,"TopicTitle":"Kouston We have a Problem !","CreatedByName":"Blo0d","CreatedById":74367,"CreatedDateTime":"2013-07-14T21:18:20Z","PageNum":1,"Articles":[{"CreatedByName":"Blo0d","CreatedById":74367,"CreatedDateTime":"2013-07-14T21:18:20Z","Content":"\n\u003Cp\u003EWell. i did experiment a new ship and it kinda worked well too well... Now my 3 pilot are orbiting sun and havin no mean to get back home ! How can i plan a rescue mission and not failling ?! dont want them to die \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E;.;\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sierra_seven_","CreatedById":72072,"CreatedDateTime":"2013-07-14T23:19:28Z","Content":"\n\u003Cp\u003EYou should\u0027ve probably put this in the \u0027How-To\u0027 subforum instead of in the General Discussion one... but seeing as you\u0027re here, let\u0027s see what we can do! Do you have any more information? How far away from the Kerbin system is your experimental ship? You\u0027re gonna be looking at one hell of a rescue mission if your ship is floating in the middle of nowhere \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E So yeah, we\u0027ll need some better information if you need help with this, man!\u003C/p\u003E\n"},{"CreatedByName":"Spaceisbeautifulul","CreatedById":68592,"CreatedDateTime":"2013-07-14T23:23:19Z","Content":"\n\u003Cp\u003EWell, this might take a long time.\u003C/p\u003E\u003Cp\u003EFirst you have to know how to dock, and that takes tons of practice, then if they\u0027re in solar orbit, its the same concept of doing an interplanetary mission, only your target is about 5 meters across with no gravity. \u003C/p\u003E\u003Cp\u003EI myself have never done a docking in Kerbol orbit. Unless you don\u0027t have a docking port and must EVA them over, but you still have to get close which is hard.\u003C/p\u003E\u003Cp\u003EIf you know how to do interplanetary missions, have some more specifics, and can dock/get close to it, then we could take you through it step by step.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-07-14T23:32:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Spaceisbeautifulul\u0022 data-cite=\u0022Spaceisbeautifulul\u0022\u003E\u003Cdiv\u003EWell, this might take a long time.\u003Cp\u003EFirst you have to know how to dock, and that takes tons of practice, then if they\u0027re in solar orbit, its the same concept of doing an interplanetary mission, only your target is about 5 meters across with no gravity. \u003C/p\u003E\u003Cp\u003EI myself have never done a docking in Kerbol orbit. Unless you don\u0027t have a docking port and must EVA them over, but you still have to get close which is hard.\u003C/p\u003E\u003Cp\u003EIf you know how to do interplanetary missions, have some more specifics, and can dock/get close to it, then we could take you through it step by step.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGetting close is quite easy in Kerbol orbit in fact. Provided that the craft start off relatively close. The distances are so huge that you can pretty much ignore orbital mechanics, so just point and burn.\u003C/p\u003E\n"},{"CreatedByName":"TheGadfly","CreatedById":54328,"CreatedDateTime":"2013-07-14T23:33:03Z","Content":"\n\u003Cp\u003ECurrently, Kerbals have infinite life spans and won\u0027t die just sitting in orbit. If you got into solar orbit accidentally, you will have a lot of trouble getting them back as you will need a ship that has much more dV (delta V, or change in velocity, ie \u0022mileage\u0022) than the first. \u003C/p\u003E\u003Cp\u003EStart with a probe core and add a capsule (it should be empty then). Make sure to add solar panels or an rtg. It will need enough fuel to get to solar orbit, make maneuvers to catch up to the stricken craft, and return to Kerbin (you do know how to change periapsis and apoapsis right? if not, check the tutorial) Practice your rendezvous or you will have to ship in need of rescue. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EDon\u0027t sweat it, we\u0027ve all been there.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-14T23:34:40Z","Content":"\n\u003Cp\u003EOP all you need to do is launch a ship that has enough space to hold its crew and the stranded crew ( bring along a hitchhiker container), and that has enough delta-v to rendezvous with the target craft and get back. No docking ports needed, just meet up and EVA over some Kerbals.\u003C/p\u003E\u003Cp\u003EYour biggest worry right now is making a rendezvous and getting back.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-14T23:56:27Z\u0022 title=\u002207/14/2013 11:56  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 14, 2013\u003C/time\u003E by regex\u003C/strong\u003E\n\u003Cbr\u003Estupid phone\n\u003C/span\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-07-14T23:37:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheGadfly\u0022 data-cite=\u0022TheGadfly\u0022\u003E\u003Cdiv\u003EStart with a probe core and add a capsule (it should be empty then). \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt won\u0027t be. The second \u003Cem\u003Emanned\u003C/em\u003E part after the first will be empty, at least in 0.20.\u003C/p\u003E\n"},{"CreatedByName":"Merinsan","CreatedById":57629,"CreatedDateTime":"2013-07-14T23:44:59Z","Content":"\n\u003Cp\u003EYou will have to build a new ship with about double the delta V from LKO to get there and back - I\u0027d recommend more, say about 2.2 times the delta V. Next you just need to arrange an encounter the same way you do it with ships orbiting a planet - It just takes longer.\u003C/p\u003E\u003Cp\u003EDon\u0027t expect to get a really close initial encounter, it\u0027s very hard in solar orbits. When I did it, I got an encounter about 100km.\u003C/p\u003E\u003Cp\u003EIf you can, dock the ships so you can transfer crew or refuel, otherwise you need to space walk across.\u003C/p\u003E\u003Cp\u003ESome thing to keep in mind, don\u0027t use time warp when arranging the rendezvous, until you are under 200m away. Rounding errors will cause the positions of ships to jump. It probably also applies to switching vessels. Once you get under 200m, the physics loads and the errors disappear and stay away until you get past 2.4km.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"FleetAdmiralJ","CreatedById":73364,"CreatedDateTime":"2013-07-15T01:58:07Z","Content":"\n\u003Cp\u003EI actually did a solar orbit rescue mission not too long ago (though with a one man pod lost, though I figure this will be the same). The name of the game will be patience. Since you have a 3 man pod lost, you\u0027ll either need a ship with a 3-man pod but remotely controlled, or something like two 2-man landing pods on the ship. The rescue craft probably will absolutely need nuclear engines just for the fuel efficiency, and quite a bit of fuel (4 to 6 tanks I would guess thereabouts). Then of course you\u0027ll need a launcher to actually get that into space. You\u0027ll want to get your orbit somewhat like the lost ship\u0027s (you can set it as a target and play around with trying to find burn angles/times that get you close). When I had to do it, I think I ended up doing 4 or 5 course corrections to finally get everything lined up. You\u0027re going to be talking about several burns with Delta-V of 2000-4000 quite possibly, thus why fuel-efficient nuclear engines are probably a must, even though the burns will probably take 20 to 30 minutes with those engines.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t have docking ports on your stranded craft, you\u0027re going to have to get relatively close (2k or closer probably. Closer if you can) and then have your lost Kerbals EVA to your rescue ship). Then, of course, you\u0027re going to need to adjust your orbit to try to get a Kerbin encounter once you\u0027re rescued them. My attempt took about 13 months of game time to ultimately complete, I think.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-15T02:01:51Z\u0022 title=\u002207/15/2013 02:01  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 15, 2013\u003C/time\u003E by FleetAdmiralJ\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Blo0d","CreatedById":74367,"CreatedDateTime":"2013-07-15T05:59:27Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://steamcommunity.com/sharedfiles/filedetails/?id=160334774\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://steamcommunity.com/sharedfiles/filedetails/?id=160334774\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIs this link working i uploaded a screen shot of the Situation!\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-07-15T07:30:54Z","Content":"\n\u003Cp\u003EFirst of all, i\u0027d backup your save. If anything goes wrong, you can reload it.\u003C/p\u003E\u003Cp\u003EIf you have a reasonable amount of fuel left in your craft, see if you can get an intercept with Eve. You look pretty close there, and a rescue from a stable Eve orbit seems easier to me than rescuing from a random Kerbol orbit. If you can\u0027t, try to circularise your orbit and get it as close as possible to Kerbin\u0027s orbit around Kerbol.\u003C/p\u003E\u003Cp\u003EElse, make a craft with a probe core, so you don\u0027t risk losing any more Kerbals, and a hitchhiker container or an empty three-kerbal command pod. Have nuclear engines on it, very important for maximum delta-V, and try to get 2 times the delta-V of your other craft. Then make a few calculatioins with the orbital speed of Kerbin, your craft, and the radius of both orbits. Shouldn\u0027t be all too complicated. Find the right moment to launch your ship to get as close an intercept as possible, and preferrably close to target ship\u0027s apoapsis and periapsis. Then, burn prograde or retro, depending on what situation you\u0027re in. Try to equalise your orbits then, and from thereon its a standard intercept maneuver, just on a larger scale.\u003C/p\u003E\u003Cp\u003EMake sure you\u0027ve practiced a rendezvous several times in orbit around Kerbin. These RV\u0027s are alot easier to do, less risky, and will give you essential practice for your rendezvous and docking in Kerbol orbit. And, as said before, watch out for rounding errors, be cautious in your use of timewarp.\u003C/p\u003E\n"}]}