{"TopicId":37546,"ForumId":16,"TopicTitle":"my rovers tend to topple a lot","CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-07-18T05:51:01Z","PageNum":1,"Articles":[{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-07-18T05:51:01Z","Content":"\n\u003Cp\u003Eno matter how close i put the center of mass near the ground and how wide my wheels span...\u003C/p\u003E\u003Cp\u003Eis it just me? or am i doing my driving wrong?\u003C/p\u003E\u003Cp\u003E( i dont go faster than 10m/s)\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-07-18T05:52:47Z","Content":"\n\u003Cp\u003EDon\u0027t include SAS, try moving in docking mode.\u003C/p\u003E\n"},{"CreatedByName":"Flowz0r","CreatedById":9387,"CreatedDateTime":"2013-07-18T06:13:55Z","Content":"\n\u003Cp\u003EIt\u0027s the magic torque you get from your probe body/command pod. The easiest way around this is switching to docking mode as Galacticruler said, but you can also rebind your rover controls to something other than WASD.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-07-18T06:18:12Z","Content":"\n\u003Cp\u003ESAS is only going to help, they don\u0027t add rotation power...yet. \u003C/p\u003E\u003Cp\u003EI use IJKL for rover controls, as they are the same for modded wheels, and RCS translation.\u003C/p\u003E\n"},{"CreatedByName":"Whackjob","CreatedById":71402,"CreatedDateTime":"2013-07-18T06:19:34Z","Content":"\n\u003Cp\u003EMake sure you have at least a 45 degree angle between the rover\u0027s center of gravity and its wheels. Put on a control module. Throw on an ASAS module, point the rover in the direction you want to go, activate ASAS, and throttle up without worry. I\u0027ve gotten up to 25m/s on the Mun.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-07-18T13:40:35Z","Content":"\n\u003Cp\u003ELock the steering on your back wheels, pack a SAS module with it and make sure it\u0027s on when you\u0027re driving around, and \u003Cem\u003E\u003Cstrong\u003Edrive with the docking controls\u003C/strong\u003E\u003C/em\u003E (can\u0027t stress that one enough).\u003C/p\u003E\n"},{"CreatedByName":"Nasakev","CreatedById":72681,"CreatedDateTime":"2013-07-18T17:02:28Z","Content":"\n\u003Cp\u003EAs capi said, locking the steering on your back wheels through the right click menu really helps. It will make your turns wider and thus more stable. If possible, try to slow down before turning. Remember, a rover going 20 m/s is moving at 40 miles per hour. You wouldn\u0027t take tight turns in a car at that speed, right?\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-07-18T17:15:51Z","Content":"\n\u003Cp\u003EI am surprised nobody mentioned precision controls yet.\u003C/p\u003E\u003Cp\u003EToggle precision controls with [Caps Lock] (Roll/Pitch/Yaw markers change from orange to blue). Now your steering won\u0027t go to \u0027full lock\u0027 the moment you hit a key but it will steer more gently. This in combination with pretty much everything already mentioned should keep your wheels on the ground. Personally I prefer remapping rover keys over docking mode as it allows me to use torque independently from steering to compensate an imminent roll over (especially useful on low gravity worlds).\u003C/p\u003E\n"}]}