{"TopicId":37728,"ForumId":16,"TopicTitle":"How to orbital dock? How do make it easier? Any tips?","CreatedByName":"MyASASisOnFire","CreatedById":72094,"CreatedDateTime":"2013-07-19T14:05:10Z","PageNum":1,"Articles":[{"CreatedByName":"MyASASisOnFire","CreatedById":72094,"CreatedDateTime":"2013-07-19T14:05:10Z","Content":"\n\u003Cp\u003EI\u0027ve been trying to build a station at about 150km orbit.\u003C/p\u003E\u003Cp\u003EThe frustration of trying to get anything to dock to anything else in space is making me cry...\u003C/p\u003E\u003Cp\u003EThis is basically me playing KSP:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/37891354/Other%20Pictures/KSP/meplayingksp.jpg\u0022 alt=\u0022meplayingksp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy problem is thus: anything larger than the A1 orbiter, and docking is too difficult for me with standard controls and cameras. I zip back and forth, miss my approach, bump into solar panels, go careening off into nowhere, realign myself, forget I\u0027m upside down and shoot off in the wrong direction, and I end up giving up, letting out a frustrated yell, and firing my station\u0027s new fuel and science block right through the middle of the command module just to be petulant.\u003C/p\u003E\u003Cp\u003EIs there any way of locking the camera to the vehicle? Or switching to a different camera control method? I\u0027d probably find it easier if I knew where my damn ships are in relation to one another, and that\u0027s something I can\u0027t decipher when the camera is totally under my control.\u003C/p\u003E\u003Cp\u003EPS. I watched Scott Manley\u0027s video on orbital docking, but I didn\u0027t understand half of it and his techniques don\u0027t really work for me... and I discovered that when you\u0027re trying to plug four full fuel tanks into your station, it behaves very differently from a dinky little one-man orbiter.\u003C/p\u003E\u003Cp\u003ETa~\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-07-19T16:41:51Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Key_Bindings\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Key_Bindings\u003C/a\u003E (V for camera modes)\u003C/p\u003E\u003Cp\u003EAs for docking, there\u0027s a tutorials section, you can use the forum search (docking is one of the most asked about subjects) and you can try youtube by searching for \u0027kerbal docking\u0027 or somesuch.\u003C/p\u003E\u003Cp\u003EEveryone has their own preferences and there\u0027s a gazillion threads on docking, there\u0027s no need to rehash all of it twice a week (there\u0027s another thread asking for docking help still on page 1 of How To).\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-07-19T16:58:12Z","Content":"\n\u003Cp\u003EI did a few RCS dockings, proved to myself I could do it, and haven\u0027t gone back to it since. I use the MechJeb Smart A.S.S. trick:\u003C/p\u003E\u003Cp\u003E1) Get your ships close to each other (100 meters or less.)\u003C/p\u003E\u003Cp\u003E2) Kill all relative velocity.\u003C/p\u003E\u003Cp\u003E3) Have each ship target the other\u0027s docking port.\u003C/p\u003E\u003Cp\u003E4) Use Smart A.S.S. on both ships to point the ship toward target.\u003C/p\u003E\u003Cp\u003E5) On one of the ships accelerate toward target.\u003C/p\u003E\u003Cp\u003EViola! Automatic docking and you still get most of the feel of doing it by hand.\u003C/p\u003E\n"},{"CreatedByName":"Corw","CreatedById":7116,"CreatedDateTime":"2013-07-19T17:04:47Z","Content":"\n\u003Cp\u003ETry this tutorial.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/nlG-N35u1KQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E The main point is to position your docking port properly so that you can fly as much as possible with assistance of instruments (navball)\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-07-19T17:59:42Z","Content":"\n\u003Cp\u003EHit the V key to change the camera mode. Most folks prefer chase mode for docking maneuvers. Didn\u0027t know that trick until just the other day my own self.\u003C/p\u003E\u003Cp\u003EOther that that, this is all I can offer...\u003C/p\u003E\u003Cp\u003EClose to Rendezvous General Procedure: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/40653-How-to-synchronize-an-orbit-with-another-ship?p=522873\u0026amp;viewfull=1#post522873\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/40653-How-to-synchronize-an-orbit-with-another-ship?p=522873\u0026amp;viewfull=1#post522873\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EActual Docking General Procedure: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/40645-Help-With-Rendezvous?p=522811\u0026amp;viewfull=1#post522811\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/40645-Help-With-Rendezvous?p=522811\u0026amp;viewfull=1#post522811\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"SleepingDragon","CreatedById":69843,"CreatedDateTime":"2013-07-19T22:10:23Z","Content":"\n\u003Cp\u003EPractice, practice, practice. It is hard at first, but later on you will be able to dock any unbalanced crap provided you have enough rcs fuel.\u003C/p\u003E\n"},{"CreatedByName":"Sathurn","CreatedById":58040,"CreatedDateTime":"2013-07-19T22:26:37Z","Content":"\n\u003Cp\u003Ehere my best advice.\u003C/p\u003E\u003Cp\u003ENAVBALL, NAVBALL, NAVBALL!\u003C/p\u003E\u003Cp\u003EI get close, point ship at target, switch ships and repeat. Now both port are, lined up and pointed at each. Now using the hnjikl keys keep them lined up. Do not rotate. If drifting off course adjust your pro-grade marker (target) using iklj so than you start to drift back.\u003C/p\u003E\u003Cp\u003Eand then it is a matter of looking at the NAVBALL.\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2013-07-19T22:34:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sathurn\u0022 data-cite=\u0022Sathurn\u0022\u003E\u003Cdiv\u003Ehere my best advice.\u003Cp\u003ENAVBALL, NAVBALL, NAVBALL!\u003C/p\u003E\u003Cp\u003EI get close, point ship at target, switch ships and repeat. Now both port are, lined up and pointed at each. Now using the hnjikl keys keep them lined up. Do not rotate. If drifting off course adjust your pro-grade marker (target) using iklj so than you start to drift back.\u003C/p\u003E\u003Cp\u003Eand then it is a matter of looking at the NAVBALL.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E^^^ this. That is the easiest way to do it, and I\u0027m surprised that hardly anyone does it (not even Scott Manley does this).\u003C/p\u003E\n"},{"CreatedByName":"bobcook","CreatedById":73597,"CreatedDateTime":"2013-07-20T02:56:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sathurn\u0022 data-cite=\u0022Sathurn\u0022\u003E\u003Cdiv\u003Ehere my best advice.\u003Cp\u003ENAVBALL, NAVBALL, NAVBALL!\u003C/p\u003E\u003Cp\u003EI get close, point ship at target, switch ships and repeat. Now both port are, lined up and pointed at each. Now using the hnjikl keys keep them lined up. Do not rotate. If drifting off course adjust your pro-grade marker (target) using iklj so than you start to drift back.\u003C/p\u003E\u003Cp\u003Eand then it is a matter of looking at the NAVBALL.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kosmo-not\u0022 data-cite=\u0022Kosmo-not\u0022\u003E\u003Cdiv\u003E^^^ this. That is the easiest way to do it, and I\u0027m surprised that hardly anyone does it (not even Scott Manley does this).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMight not be obvious, but I think you need to have SAS enabled to make this work. And it works very well for me. I\u0027ve docked many things this way.\u003C/p\u003E\u003Cp\u003EMy first docking (and several more after that for more practice) was using two identical rockets topped with Mk3 capsules and docking ports. \u003Ca href=\u0022http://www.bobandeileen.com/ksp/KerbinRendezvous.png\u0022 rel=\u0022external nofollow\u0022\u003EMy first Kerbin rendezvous\u003C/a\u003E. That got me to be very comfortable with docking. Then I started docking bigger things, including station components with multiple docking ports. Basically the same process, just takes a lot of patience and practice.\u003C/p\u003E\u003Cp\u003EFor larger things, I find that heavier objects are easier to dock because they wobble less. And also heavy things react less to subtle RCS bursts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-20T03:01:19Z\u0022 title=\u002207/20/2013 03:01  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 20, 2013\u003C/time\u003E by bobcook\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Torch","CreatedById":58443,"CreatedDateTime":"2013-07-20T06:34:32Z","Content":"\n\u003Cp\u003ESo here is my take, the purist will say \u0022NO MODS\u0022, I say, \u0022Bunk\u0022. For docking help, I highly recommend Romfarer\u0027s Lazor System Mod available here: \u003Ca href=\u0022http://kerbalspaceprogram.com/lazor-system/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/lazor-system/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELet\u0027s face it, take your pick of space programs, NASA, ESA, JSL, RSFSP, they all use the most advanced systems available, and that includes a docking cam. That is one of the modules available in the above listed mod. Can I dock without it, of course, you need to understand the mechanics of docking before any of this will make any sense at all. So here is what I do, and some screen shots to illustrate.\u003C/p\u003E\u003Cp\u003EDocking is a matter of lining your ships docking port up with a targets docking port. It is certainly not possible to always just \u0022target the port, switch ships and target again\u0022 in order to achieve a dock. I can\u0027t just \u0022spin\u0022 my station around to align to a ships docking port, nay, MOVE the ship to align with the stations port. Here is where the mod really shines.\u003C/p\u003E\u003Cp\u003EBasically, during a docking operation, you have to do 3 things:\u003C/p\u003E\u003Cp\u003E1. align your docking port to...\u003C/p\u003E\u003Cp\u003E2. the target docking port, and ...\u003C/p\u003E\u003Cp\u003E3. kill any drift between the two.\u003C/p\u003E\u003Cp\u003EIn the mod, you have 3 cross hairs:\u003C/p\u003E\u003Cp\u003E1. The solid white cross represents the center of your ships docking port\u003C/p\u003E\u003Cp\u003E2. The dashed cross represents the center of the target docking port\u003C/p\u003E\u003Cp\u003E3. The red cross represents the speed and direction at which the docking parts are moving relative to each other.\u003C/p\u003E\u003Cp\u003EHere is a screenie of the docking cam, when things are slightly misalligned:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022\u0022 alt=\u0022p\u0026gt;\u0026lt;p\u0026gt;\u0026lt;img src=\u0022\u003E\u003C/p\u003E\u003Cp\u003Eand here is a screenie of the docking I was doing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022\u0022 alt=\u0022p\u0026gt;\u0026lt;p\u0026gt;Bottom Line?  Mods are great, and w\u0022\u003E\u003C/p\u003E\u003Cp\u003Eenjoy!!\u003C/p\u003E\n"},{"CreatedByName":"CodatheSpaceFox","CreatedById":73847,"CreatedDateTime":"2013-07-20T06:52:16Z","Content":"\n\u003Cp\u003EWithout mods, or a successful docking without mechjeb myself. I\u0027ve been pushing myself closer to coming up with ideas to make it easier in Vanilla.\u003C/p\u003E\u003Cp\u003EI can already say that .21 is going to make it infinitely easier with the rebalanced RCS and SAS, but just as well, the navball is a great too on it\u0027s own \u003Cstrong\u003Ebut I found it needs help.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWithout a vector marking rotation, it does make it pretty damn hard to size up your ship VS the guidance, especially which way is \u0022up\u0022 in your navball. I\u0027ve collected on a few little tips that I have turned into habit. Even though I\u0027ve never actually docked anything myself yet, but from experience of other uses, they size up pretty well.\u003C/p\u003E\u003Cp\u003EFirstly, Batteries. about 3 radial batteries with the green lights facing with your docking port on a ship makes it very easy to locate, or even one works just as well to show which way is considered the upward portion of the docking port, to show your ship\u0027s orientation in that respect. Have to thank Scott Manley for that one.\u003C/p\u003E\u003Cp\u003ESecond, if your ship is going to dock, make it readily able. Since I work with SSTOs a lot, I try to avoid the tuck in port, since I always worry it\u0027s going to be a pain to line up, and instead I try to put the port on the front or back of the ship, that way I already am aware of my rotation in respect to it, and don\u0027t need to fumble with it. Again, never managed in practice, but all in all I can at least hit a satellite dead on with a rear facing port for practice.\u003C/p\u003E\u003Cp\u003EAgain, depending on the ship, or station, try to make the ports convenient to it\u0027s size, design, and weight distribution. a lander usually has them on top, for example, so you don\u0027t really need to fumble with side swiping, and in the end, as long as the RCS aren\u0027t duct taped unevenly, that usually leaves \u0022forward\u0022 and \u0022back\u0022 translations unaffected by balance in that respect. And I\u0027ve seen plenty of success with that.\u003C/p\u003E\u003Cp\u003EFor stations, putting your ports out on truss supports, or making a specific docking spot away from the central portion, will help. Truss me.\u003C/p\u003E\u003Cp\u003ENow, hopefully I wasn\u0027t talking out of my atomic engine too much, as I attempt to take my own advice. Hope anything I blabbered out helps. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-20T07:07:06Z","Content":"\n\u003Cp\u003EIf you\u0027re pointing at a spot 50m beside the docking port when you line the pink and green markers up, you\u0027re just setting yourself up to fly past in a straight line 50m from the docking port. The green thing is showing your relative motion, so if you look at the other vessel and see you need to go right to line up, the green thing needs to be to the right of the pink thing.\u003C/p\u003E\u003Cp\u003EI was screwing this part up for a while, but once I got it through my thick head docking became a non-issue, except for the occasional massive explosion upon docking here and there.\u003C/p\u003E\u003Cp\u003EAlso, make sure you\u0027re targetting the port, and controlling your ship from the port. Makes things less complicated, especially if one or the other isn\u0027t right on the end of a rocket.\u003C/p\u003E\u003Cp\u003EAlso, also I also do the trick mentioned above and mount mechjeb, a light, a battery, or some other relatively insignificant object to the \u0022top\u0022 of the rocket while it\u0027s in the VAB.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-20T07:09:51Z\u0022 title=\u002207/20/2013 07:09  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 20, 2013\u003C/time\u003E by Cheebsta\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-07-20T07:36:47Z","Content":"\n\u003Cp\u003E- time your launch, so that u dont have to wait forever,\u003C/p\u003E\u003Cp\u003E- use the manuver node to set up your approach burn, then use RCS to fine tune your approach to make it as close as possible\u003C/p\u003E\u003Cp\u003E- time warp till around a min before the approach and then start maneuvering your ship and lining up you station port with the ship\u003C/p\u003E\u003Cp\u003E- slow down the approach speed to 0.5m/s when theyre less than a hundred meter apart\u003C/p\u003E\u003Cp\u003E-use SAS and RCS to hold the nose direction while tweaking the travel direction\u003C/p\u003E\u003Cp\u003E- always stick your RCS at the right place: around the center of mass\u003C/p\u003E\n"},{"CreatedByName":"Sathurn","CreatedById":58040,"CreatedDateTime":"2013-07-20T13:50:18Z","Content":"\n\u003Cp\u003EWhile a docking cam should be added to stock, the lazormod add other thing I don\u0027t want so I can really judge it. However spinning both ships is perfectly reasonable when learning to dock. \u003C/p\u003E\u003Cp\u003EAnd for the record I can dance around my station going from docking port to docking port without lazormod. But that requires alot of practice.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-07-21T01:58:33Z","Content":"\n\u003Cp\u003EI made a practice ship that launches as one piece with its target ships, so you can practice the last part of the docking without doing a rendezvous first, and starting from close range. Try playing with that for a while before going back to a full rendezvous-to-dock. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25425-Help-with-Docking-A-Trainer-Ship-for-Newbies\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25425-Help-with-Docking-A-Trainer-Ship-for-Newbies\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Anachronda","CreatedById":23187,"CreatedDateTime":"2013-07-21T03:54:14Z","Content":"\n\u003Cp\u003EWell, here\u0027s what I do. I\u0027m an uncoordinated idiot, but I\u0027m getting to the point where I can just fly in and dock, no muss, no fuss.\u003C/p\u003E\u003Cp\u003EThe ship with which I am docking is in an equatorial orbit with its docking port pointing south. This means that the docking ship will be pointing north. This makes the goal of the docking game be to move the target indicator on the navball to the intersection between the north, red, line and the horizon line on the navball.\u003C/p\u003E\u003Cp\u003EIn addition to the target position and velocity indicators, there\u0027s that little thingie in the center of the navball that that looks like a V with wings. This represents you.\u003C/p\u003E\u003Cp\u003EI orient my ship to the intersection of north and the horizon, which is where the target will eventually wind up. Then I rotate my ship using Q and E so that target position indicator is lined up with the wings on the V thingie (i.e., until it\u0027s more or less horizontal). This means I can point at the target using A and D.\u003C/p\u003E\u003Cp\u003EIt also means that the wings of the V thingie lie on a great circle between the target position and the intersection and north and the horizon.\u003C/p\u003E\u003Cp\u003ENow it\u0027s just a matter of walking the target along that great circle until it reaches the intersection.\u003C/p\u003E\u003Cp\u003EIf my prograde velocity vector is to the left of the target position, the target will move to the right. If it\u0027s above the target position, the target will move down. If it\u0027s to the right of the target position, the target will move left. Etc. Using RCS translations, I can move my velocity vector relative to the direction of the target, which means that I can move the target in any direction that I want.\u003C/p\u003E\u003Cp\u003ESo it becomes just a matter of marching the target along the wings of the V until it reaches the intersection. Once it does so, I use the RCS translations to ensure that my velocity vector is pointing straight at the target.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-21T04:00:17Z\u0022 title=\u002207/21/2013 04:00  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 21, 2013\u003C/time\u003E by Anachronda\u003C/strong\u003E\n\u003Cbr\u003Erealized I should have said \u0026quot;horizon\u0026quot; rather than \u0026quot;ground\u0026quot;.\n\u003C/span\u003E\n"}]}