{"TopicId":38147,"ForumId":16,"TopicTitle":"not raise AP during launch to high","CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-07-22T10:21:51Z","PageNum":1,"Articles":[{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-07-22T10:21:51Z","Content":"\n\u003Cp\u003EYesterday it happened again, after launch during circulization the Ap was already much higher then my Pe/desired orbit should have been. I try to stop the engines and coast up to my Ap but somehow more oft than not I mess up and end with a 80/450km orbit ...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-22T12:58:25Z\u0022 title=\u002207/22/2013 12:58  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 22, 2013\u003C/time\u003E by KerbMav\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cheebsta","CreatedById":74167,"CreatedDateTime":"2013-07-22T10:44:35Z","Content":"\n\u003Cp\u003EIs the rocket that did it a lot lighter than you\u0027re used to, or does this always happen?\u003C/p\u003E\n"},{"CreatedByName":"Audiopulse","CreatedById":8838,"CreatedDateTime":"2013-07-22T10:53:55Z","Content":"\n\u003Cp\u003EThis reads as if the AP keeps rising after you already cut the engines? If so this would be a bug.\u003C/p\u003E\u003Cp\u003EIve never heard of something like this, though, so my guess is you just kept firing your engines too long before coasting. Bear in mind that if youre in an elliptical orbit and youre firing at its Periapsis - the Apoapsis far off can rise pretty quickly.\u003C/p\u003E\u003Cp\u003EThats a good method to accumulate Escape-velocity through several orbi\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-07-22T10:59:34Z","Content":"\n\u003Cp\u003EStop your engines earlier. Once you get to around 25-30km drag will barely touch your AP. Normally I turn off my engines straight off when my AP hits 80km, then coast up to AP and burn there.\u003C/p\u003E\n"},{"CreatedByName":"mellojoe","CreatedById":69154,"CreatedDateTime":"2013-07-22T12:02:11Z","Content":"\n\u003Cp\u003EWhen you are burning for circulization, watch where you start the burn. If you are not burning 100% at the Apoapsis, then you will be shifting the AP if you just point along the horizon or along prograde. To keep the AP from moving make sure you start just before the AP and if it is a longer burn time, move your nose down toward the planet at the same time. If you are not burning exactly at the AP, then you will move the AP while burning. You can usually mitigate this by starting burn slightly before and continuing the burn at AP and slightly after AP.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-07-22T12:18:54Z","Content":"\n\u003Cp\u003EYou all got it right I think.\u003C/p\u003E\u003Cp\u003EYes, I started with big landers and station parts as soon as I managed to get anything into a stable orbit. Now while experimenting with mapsat my rockets are really compared to the monsters I used in the last six weeks.\u003C/p\u003E\u003Cp\u003EAnd for the same reason I keep burning up until 70k - with my Ap now far far away/up.\u003C/p\u003E\u003Cp\u003EWhat I dont remember is, if I always used to split the circulization burn around the Ap - I did it yesterday though.\u003C/p\u003E\u003Cp\u003EOK, reprogramming my wetware to pay more attention, thank you! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}