{"TopicId":38349,"ForumId":16,"TopicTitle":"Best moons for kethane operations","CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-23T19:25:16Z","PageNum":1,"Articles":[{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-23T19:25:16Z","Content":"\n\u003Cp\u003EI am building a big interplanetary vessel that will be a kethane miner. The first half is an orbital section and the second half is a land based operation. I can swap the second half out for different stuff whenever I return to Kerbin (or with long missions with my interplanetary tugs, it has at least 2 on board). First, I am setting it up with base modules to work on moons. First target: the Mun. Second target: possibly Minmus. Rather than waste the time heading out to a system and then launching the on-board ion scanner probes, I sent a probe out to Ike and discovered that it has no easily accessible equatorial kethane deposits so it is out. That leaves Gilly, the Jool system (not Lathe, MAYBE Tylo), Eeloo, Dres (dunno much about Dres) and maybe some other stuff. How should I prioritize these bodies? After I have done my work on all of them, I will return to Kerbin and refit the ship for work on places like Duna (or maybe even setting up permenent bases on Duna and Lathe).\u003C/p\u003E\n"},{"CreatedByName":"Galacticruler","CreatedById":58398,"CreatedDateTime":"2013-07-23T19:29:02Z","Content":"\n\u003Cp\u003EThis actually depends entirely on your kethane.cfg in your save folder.\u003C/p\u003E\u003Cp\u003Eif none of them are easily accessible, delete it and reload. There should be a new set of deposits on every world.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2013-07-23T19:35:27Z","Content":"\n\u003Cp\u003EWhy is Ike out? You don\u0027t have to do equatorial-plane transfers. I did one last night going Mun to Minmus, from a starting inclination of 105Ã‚Â°.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-23T20:02:35Z","Content":"\n\u003Cp\u003EEquatorial (or close to it) makes it easier to run the operation since it is pretty heavily dependent on both land and orbital operations. Ascent and rondezvous with an inclined station (or from off the equator) consumes more delta V and my equipment is untested. I\u0027d rather stick to equatorial stuff. It makes my job with the equipment delivery easier and since I am already running lagtopia with the size of the ship, easy is good.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-07-23T20:09:55Z","Content":"\n\u003Cp\u003ESo far, Mun is good, Ike, no good. Have yet to send probes to Jool system yet. Will do that for at least one world there before I waste teh delta V going.\u003C/p\u003E\n"},{"CreatedByName":"Cashen","CreatedById":71281,"CreatedDateTime":"2013-07-23T22:33:42Z","Content":"\n\u003Cp\u003EIt really depends where you want the Kethane to actually be used. Whatever planetary system you plan to use it in, that\u0027s the system you should harvest from. Transporting raw Kethane across interplanetary distances is wasteful. If you have operations on more than one planet, I suggest a different mining/processing operation designed specifically for that system.\u003C/p\u003E\u003Cp\u003EWhat you want to optimize is the Kethane mass fraction of your craft as it lifts the kethane off of whatever body it was mined from. By this I mean, the highest weight percent kethane possible, after propellant, structural and other weight. This is best done from the lowest gravity bodies. In the Kerbin system, this is Minmus, which is the ideal place to extract Kethane. The very low gravity means you can use smaller, lighter engines and still have a good thrust-to-weight ratio, and the lower delta-v requirements mean you can carry less fuel, maximizing the fraction of your craft\u0027s loaded mass that is kethane. Minmus\u0027 orbit is only inclined a small amount, not enough to really matter so long as you do mid-course corrections away from Kerbin.\u003C/p\u003E\u003Cp\u003EFor Duna, it again depends what you\u0027re doing with the Kethane. If your operations are on the surface of Duna, then you\u0027re better off getting it from Duna itself via rover-based operations. If your base is in orbit around Duna, you are better off getting it from Ike and transporting it the short distance over to Duna orbit, to avoid Duna\u0027s higher gravity and atmosphere. Even if there are no equatorial deposits on a moon, all you have to do is approach from a non-equatorial orbit, adjusting your inclination from as far away as possible to save fuel.\u003C/p\u003E\u003Cp\u003EIn the Jool system your best options are either Bop or Pol. Pol is more efficient (lower gravity, less inclination) but Bop is probably easier to land on.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-23T22:50:53Z\u0022 title=\u002207/23/2013 10:50  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 23, 2013\u003C/time\u003E by Cashen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2013-07-24T00:00:08Z","Content":"\n\u003Cp\u003EFinal consideration: fun/challenge. You don\u0027t need to be numerically perfect if you\u0027re enjoying it.\u003C/p\u003E\n"}]}