{"TopicId":38603,"ForumId":16,"TopicTitle":"RCS Linear Vs RCS Block? When To Use Each one?","CreatedByName":"potoes6","CreatedById":75638,"CreatedDateTime":"2013-07-25T00:44:31Z","PageNum":1,"Articles":[{"CreatedByName":"potoes6","CreatedById":75638,"CreatedDateTime":"2013-07-25T00:44:31Z","Content":"\n\u003Cp\u003EI have always used the RSC block but I don\u0027t know times when it would be more efficient to use the linear ports. When do you want to use the linear ports over the blocks and vise versa? \u003C/p\u003E\u003Cp\u003EThanks For Reading\u003C/p\u003E\u003Cp\u003E-Potoes\u003C/p\u003E\n"},{"CreatedByName":"painking","CreatedById":69085,"CreatedDateTime":"2013-07-25T01:07:49Z","Content":"\n\u003Cp\u003EI suppose one could use the linear ports for docking, or, maybe just helping to turn very large ships without expending lots of RCS.\u003C/p\u003E\n"},{"CreatedByName":"Liudeius","CreatedById":74918,"CreatedDateTime":"2013-07-25T01:39:29Z","Content":"\n\u003Cp\u003EI prefer linear, but block are better for rotating since they can provide thrust in four different directions. (How would you use RCS to rotate a perfect cylinder along the vertical axis with only linear.)\u003C/p\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-07-25T01:53:59Z","Content":"\n\u003Cp\u003Eyou cant H or N with linear\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-07-25T02:37:57Z","Content":"\n\u003Cp\u003EThe linear port points out from where you place it. The block points in the other two axes. Other than that, they\u0027re the same.\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-07-25T03:28:41Z","Content":"\n\u003Cp\u003EMainly for part count or drag/mass reasons. You also might want different locations as your CoM changes.\u003C/p\u003E\u003Cp\u003Erotpower or reaction wheels or whatever are still quite overpowered compared to their real counterparts so unless you need to dock you often don\u0027t need RCS at all. If all you need is translation then a simple 4 (even 3 or for the masochist 2 or 1) array of linear RCS ports is sufficient. Some landers probably benefit from full axis RCS arrays during critical phases of flight.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-07-25T05:24:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frederf\u0022 data-cite=\u0022Frederf\u0022\u003E\u003Cdiv\u003EMainly for part count or drag/mass reasons.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESince a quad and a linear thruster have the same thrust, ISP, mass and same drag, I don\u0027t see a reason to favor the linear thruster based on those stats. As for part count, since it takes more linear thrusters to achieve equal maneuverability in most cases, I think that goes to the quad as well. On the other hand, the linear thruster has a higher crash rating and is easier to mount if you want a lot of RCS thrust in one particular direction. The only other reason I can think of to use a linear thruster is if you want a ship that CANNOT use RCS to rotate.\u003C/p\u003E\n"},{"CreatedByName":"Kosmo-not","CreatedById":14082,"CreatedDateTime":"2013-07-25T06:06:24Z","Content":"\n\u003Cp\u003EI find linear RCS thrusters useful on spaceplanes. I can use one block and one linear thruster on each side of the craft and have the same functionality that would result from using 4 blocks (two on the sides, one on top, and one on bottom).\u003C/p\u003E\n"}]}