{"TopicId":38654,"ForumId":16,"TopicTitle":"I need help in making this \u0026quot;boat\u0026quot; float and move quickly through the water","CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-25T03:55:39Z","PageNum":1,"Articles":[{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-25T03:55:39Z","Content":"\n\u003Cp\u003EHey. All the craziness of this update, I\u0027ve been sticking with 0.20 to do Mission \u0022Vacation on Laythe\u0022 (a personal mission). One of the sub-missions is to make high speed boats that, well, will do their job.\u003C/p\u003E\u003Cp\u003EI understand that this is supposed to be a \u003Cem\u003Espace\u003C/em\u003E simulator, and water physics aren\u0027t what they should be, but.. we all bend the rules occasionally. I mean, look at what Hooligan Labs is doing with their airships.\u003C/p\u003E\u003Cp\u003EDisclaimer: I use cheats, so fuel isn\u0027t a problem for me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I made this thing. It\u0027s a highly modified version of my Speed Rover:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i39.tinypic.com/zvy0rm.jpg\u0022 alt=\u0022zvy0rm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i41.tinypic.com/34o4izd.jpg\u0022 alt=\u002234o4izd.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI want this thing to, well, \u0022fly\u0022 over the water at high speed, like a speed boat.\u003C/p\u003E\u003Cp\u003EThe problems I\u0027m having, it likes to veer left constantly, even with ASAS on. Also the front sinks down as you can imagine from the air-breathing engines.\u003C/p\u003E\u003Cp\u003EI had the two side engines to the sides of the main engine before, but the problem is, I also need this thing to be mobile out of water, as part of my.. \u0022mission\u0022, which is a on-shore sphere launchpad that can spawn this (would serve as a boat launcher). This is why it has the rover wheels, to get it into the water.\u003C/p\u003E\u003Cp\u003EAnd the sphere is a Medium sphere, so I also need to keep what goes down the ramp, as compact as possible.\u003C/p\u003E\u003Cp\u003EIt has modified Stock parts with 99999 in \u0027crashTollerance\u0027 to keep the engines and other pieces from breaking due to \u0022splashed down hard and was destroyed\u0022. I also tweaked the weight of the engines to be weigh less so the CoM wouldn\u0027t be shifted to the back. Each weighs 0.5t.\u003C/p\u003E\u003Cp\u003ESo, any idea to make this work? I\u0027m up for suggestions, as long as you understand my intentions for this. I had thought of putting an inflatable balloon on the top to keep the entire thing straight, but I think that would cut the speed drastically (and make it wobble because of the balloon).\u003C/p\u003E\n"},{"CreatedByName":"Benie","CreatedById":70327,"CreatedDateTime":"2013-07-25T19:35:23Z","Content":"\n\u003Cp\u003ESorry, but I have to bump this. I really need help. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"strongest_2hu","CreatedById":67784,"CreatedDateTime":"2013-07-25T21:47:12Z","Content":"\n\u003Cp\u003EThat design is probably never going to work. Even if you did get it up to 20 or 30 m/s you\u0027d find that all the little pieces like the wheels and lights (and engines, they seem to be especially vulnerable) would come off. The most successful stock boats (as opposed to boat pack boats) I\u0027ve seen or made use wing pieces to hold the body of the craft up out of the water, like a hydroplane. You can put landing gear on the bottom of the wings if you are dead set on having it negotiate land as those parts don\u0027t count in the physics simulation and therefore won\u0027t drag you down in the water.\u003C/p\u003E\u003Cp\u003EIt also looks like you\u0027ve got about 200% more engine on that thing than you need, and 100% more intake.\u003C/p\u003E\n"}]}