{"TopicId":39529,"ForumId":16,"TopicTitle":"Heat shields","CreatedByName":"petrichorAM","CreatedById":76235,"CreatedDateTime":"2013-07-27T22:50:11Z","PageNum":1,"Articles":[{"CreatedByName":"petrichorAM","CreatedById":76235,"CreatedDateTime":"2013-07-27T22:50:11Z","Content":"\n\u003Cp\u003EHey, I know that re-entry effects are purely cosmetic at this stage but I like to go for realism with my spacecraft. I am eventually planning to put an unmanned rover on Duna a la Curiosity so want to go for a small sky crane lander with a heat shield below that I can detach once in the atmosphere. Therefore I have two questions:\u003C/p\u003E\u003Cp\u003E1) What\u0027s the best way to design the crane with stock parts and bring the rover down safely\u003C/p\u003E\u003Cp\u003E2)How can I make a heat shield, preferbaly with stock parts but I\u0027m open to mod suggestions, that looks realistic and can be detached without damaging my rover and crane\u003C/p\u003E\u003Cp\u003EThanks in advance!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-07-30T22:24:08Z\u0022 title=\u002207/30/2013 10:24  PM\u0022 data-short=\u002210 yr\u0022\u003EJuly 30, 2013\u003C/time\u003E by petrichorAM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2013-07-27T23:26:06Z","Content":"\n\u003Cp\u003EAll of the fake (stock) heat shields I\u0027ve seen so far have been either simply relatively flat structural parts like the Rockomax adapter \u002202\u0022 for small payloads, or for large ones they are often made from the M-1x1 or M-2x2 structural panels, eg. here\u0027s \u003Cstrong\u003EBrotoro\u0027s\u003C/strong\u003E shield for a rover he landed on Laythe, made from a combo of parts I just mentioned (from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/27552-Long-term-Laythe-Mission-%28pic-heavy%29-_-With-Part-13-_?highlight=brotoro\u0022 rel=\u0022external nofollow\u0022\u003Ethis thread\u003C/a\u003E):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/w7HPUWZ.jpg\u0022 alt=\u0022w7HPUWZ.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-07-27T23:34:54Z","Content":"\n\u003Cp\u003EIf you want to go beyond purely cosmetic, you could always install \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/32342-0-20-Deadly-Reentry-2-3-reentry-heat-plus-thermal-and-g-force-damage-to-parts\u0022 rel=\u0022external nofollow\u0022\u003EDeadly Re-Entry\u003C/a\u003E. Doesn\u0027t take as much getting used to as you might think.\u003C/p\u003E\n"},{"CreatedByName":"petrichorAM","CreatedById":76235,"CreatedDateTime":"2013-07-28T08:21:59Z","Content":"\n\u003Cp\u003EYeah I\u0027ve seen that mod, do you have to use the add-on heat shields or have the undersides of the manned command pods been tagged as shields?\u003C/p\u003E\n"},{"CreatedByName":"ASnogarD","CreatedById":70903,"CreatedDateTime":"2013-07-28T11:37:50Z","Content":"\n\u003Cp\u003EFrom what I have \u0027seen\u0027 in videos , it seems you add a disk shaped ablative shield to the underside of your manned capsules (so I would assume the capsule is flagged as unshielded).\u003C/p\u003E\n"},{"CreatedByName":"Scorpi15","CreatedById":34189,"CreatedDateTime":"2013-07-28T11:41:03Z","Content":"\n\u003Cp\u003EThe small black capsule (forgot the name) has a heatshield already attached. Ditto for the underside of the spaceplane parts. Be careful though, the plugin will disregard the heatshield entirely if it is coming in at the wrong angle, so keep the heatshield facing prograde.\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-07-28T12:09:59Z","Content":"\n\u003Cp\u003ENot only that, but they\u0027re ablative heat shields. Spend too much time in the lower atmosphere slowing down, and you\u0027ll burn through it. On top of that, the mod now models the g-forces your kerbals are experiencing, so if you decelerate too quickly certain parts may explode (same goes for positive acceleration during launch, generally anything over 8-g\u0027s is too much). If you couple this with FAR, you really have to get your approach angle right because the atmosphere isn\u0027t guaranteed to slow you down enough for parachutes (been a couple times I\u0027ve come screaming in at mach 3 below 10,000m.\u003C/p\u003E\n"},{"CreatedByName":"petrichorAM","CreatedById":76235,"CreatedDateTime":"2013-07-28T12:28:59Z","Content":"\n\u003Cp\u003EThink I\u0027ll leave that mod for a while then until I find the re-entry sweet spot, still fully a beginner at KSP! :-) Back to my OP, can anyone offer any suggestions on the \u0027crane\u0027 lander for unmanned rovers and how to incorporate it into a rocket?\u003C/p\u003E\n"},{"CreatedByName":"Nephas","CreatedById":75234,"CreatedDateTime":"2013-07-28T15:10:07Z","Content":"\n\u003Cp\u003EIf you want to do it stock, the closest to a sky crane will be a Lander with radial engines and the rover attached below on structural parts and decoupler/docking ports. For more realism you could install the Kerbal Attachment System Mod (KAS) which brings working cables and winches, so you can really do it Nasa style.\u003C/p\u003E\u003Cp\u003EDon\u0027t get discouraged from the Deadly Reentry mod, it\u0027s not that hard, and considering Duna\u0027s thin atmosphere, the heating won\u0027t be too bad.\u003C/p\u003E\u003Cp\u003EOtherwise, i would just recommend the large adapter parts for heatshields.\u003C/p\u003E\n"},{"CreatedByName":"petrichorAM","CreatedById":76235,"CreatedDateTime":"2013-07-28T15:37:52Z","Content":"\n\u003Cp\u003EI\u0027ll give the KAS mod a go, sounds good! Prob give the deadly re-entry one a go too (I can remove it of I don\u0027t get on with it), how is it with Kerbin\u0027s atmosphere? I guess Eve\u0027s will be the seriously difficult re-entry with that mod though!\u003C/p\u003E\n"},{"CreatedByName":"jbaltus123","CreatedById":64954,"CreatedDateTime":"2013-07-28T16:19:07Z","Content":"\n\u003Cp\u003EDont create a flat heat shield thats not goot!\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-07-28T19:33:42Z","Content":"\n\u003Cp\u003EApparently I completely missed the bit about a skycrane, otherwise I to would have recommended KAS. There was also a mod quite a while back (.19?), that allowed you to use an airbag-style landing system (a la Mars lander style), however I haven\u0027t seen it around lately.\u003C/p\u003E\u003Cp\u003EA little tip for skycranes though; make sure you keep your CoM above your CoT. For some reason (Unity...) if you have a higher CoT KSP likes to reverse the gimballing on your engines, causing hilarity and frustration. Your two options would be to either, keep your CoT below your CoM, or conversely just not use ASAS after your skycrane has separated from it\u0027s transfer craft.\u003C/p\u003E\n"},{"CreatedByName":"petrichorAM","CreatedById":76235,"CreatedDateTime":"2013-07-28T19:37:44Z","Content":"\n\u003Cp\u003ESorry newbie question, CoT and CoM?\u003C/p\u003E\n"},{"CreatedByName":"espm400","CreatedById":71109,"CreatedDateTime":"2013-07-28T19:54:41Z","Content":"\n\u003Cp\u003EMy bad, usually I only abbreviate after spelling it out the first time... Anyways, Cot = Centre of Thrust, CoM = Centre of Mass. You can see these by clicking on the buttons at the bottom left in the VAB/SPH.\u003C/p\u003E\n"},{"CreatedByName":"petrichorAM","CreatedById":76235,"CreatedDateTime":"2013-07-28T20:46:07Z","Content":"\n\u003Cp\u003EThought it might have been something like that but would rather ask haha How would I keep them in the \u0027correct\u0027 places, i\u0027m guessing it would be to do with placement of engines and how my craft is put together?\u003C/p\u003E\n"},{"CreatedByName":"Spaceisbeautifulul","CreatedById":68592,"CreatedDateTime":"2013-07-28T20:51:07Z","Content":"\n\u003Cp\u003EYes, always try to keep the engines on the bottom of whatever craft your building.\u003C/p\u003E\n"}]}