{"TopicId":39987,"ForumId":16,"TopicTitle":"Why can\u0026#039;t I translate left/right without spinning during dock?","CreatedByName":"NecCo","CreatedById":76699,"CreatedDateTime":"2013-07-30T02:24:43Z","PageNum":1,"Articles":[{"CreatedByName":"NecCo","CreatedById":76699,"CreatedDateTime":"2013-07-30T02:24:43Z","Content":"\n\u003Cp\u003EI have spent all day place RCS thursters in different positions and different number of thrusters. even tried just dorsal and ventral RCS pods right on center of mass yet when I press J or L key instead of moving my craft liner it spins the whole ship. PLEASE HELP!!!!!!! I want to built a station but I can\u0027t cause instead of small corrections my ship spins out of control\u003C/p\u003E\n"},{"CreatedByName":"bobcook","CreatedById":73597,"CreatedDateTime":"2013-07-30T02:42:51Z","Content":"\n\u003Cp\u003EDo you have SAS enabled when doing the RCS translation? If you are playing 0.21 then all command pods have it included (just need to turn it on with the T key). If playing older versions then add an ASAS module to your ship.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-07-30T02:52:50Z","Content":"\n\u003Cp\u003EPost a picture so we can see the geometry and RCS placement (actually post two pictures, one from either side of the craft, so we can see all of the RCS ports)\u003C/p\u003E\n"},{"CreatedByName":"NecCo","CreatedById":76699,"CreatedDateTime":"2013-07-30T02:54:43Z","Content":"\n\u003Cp\u003Eno I keep it turned off cause I when I use it a let off the key it move me back to where I was either that or my eyes re playing trick on me. I\u0027m using .20 but I put ASAS on ever ship I build. perhas eye are just play trick so I\u0027ll go into game and try again if not I\u0027ll be back\u003C/p\u003E\n"},{"CreatedByName":"NecCo","CreatedById":76699,"CreatedDateTime":"2013-07-30T04:11:39Z","Content":"\n\u003Cp\u003EOMG it does work I feel so stupide. when I pressed it it looked like it jumped back like when using pitch and yaw control with SAS on but I never had a point of reference cause I never kept sas on when close to what I wanted to dock with.Thanx.\u003C/p\u003E\u003Cp\u003EOne more Question thought I hit the dock port goin .02 m/s sec and it didn\u0027t connect I\u0027m trying to dock with a clamp o tron on the station I made using a ship with a jr clam o tron does this make a diff cause once getting close I thought the magnets would capture it and all I did was bump the station\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-07-30T04:30:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NecCo\u0022 data-cite=\u0022NecCo\u0022\u003E\u003Cdiv\u003EOne more Question thought I hit the dock port goin .02 m/s sec and it didn\u0027t connect I\u0027m trying to dock with a clamp o tron on the station I made using a ship with a jr clam o tron does this make a diff cause once getting close I thought the magnets would capture it and all I did was bump the station\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, punctuation, capitalization, and correct spelling would be appreciated, since your posts are difficult to read.\u003C/p\u003E\u003Cp\u003ETo answer your question, docking ports can only dock with other docking ports of the same type. Also, if you update to 0.21.1 and turn on fine control mode with caps lock, RCS automatically balances when translating so it doesn\u0027t cause rotation.\u003C/p\u003E\n"},{"CreatedByName":"NecCo","CreatedById":76699,"CreatedDateTime":"2013-07-30T04:49:48Z","Content":"\n\u003Cp\u003EOk, thank you sir! And sorry I might be smart but I can\u0027t spell for **** and I hated Angwish class\u003C/p\u003E\n"},{"CreatedByName":"bobcook","CreatedById":73597,"CreatedDateTime":"2013-07-30T05:05:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheDarkStar\u0022 data-cite=\u0022TheDarkStar\u0022\u003E\u003Cdiv\u003EAlso, if you update to 0.21.1 and turn on fine control mode with caps lock, RCS automatically balances when translating so it doesn\u0027t cause rotation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECool, thanks for the tip about the fine controls, I didn\u0027t know about this. Jeb\u0027s been manually docking all sorts of stuff lately, and its not always very pretty. So with this new knowledge his training is now improved, hopefully decreasing his Stupidity score somewhat. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"NecCo","CreatedById":76699,"CreatedDateTime":"2013-07-30T05:15:37Z","Content":"\n\u003Cp\u003ESee I don\u0027t use any mods as of yet I\u0027d like to have the one that shows weight of the craft and thrust because there\u0027s lots of trail and error without it. I knew about caps locks softening control thanks to Scott Manly who\u0027s channel I came across by accident.\u003C/p\u003E\n"},{"CreatedByName":"Enigma179","CreatedById":67703,"CreatedDateTime":"2013-07-30T05:22:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheDarkStar\u0022 data-cite=\u0022TheDarkStar\u0022\u003E\u003Cdiv\u003EAlso, if you update to 0.21.1 and turn on fine control mode with caps lock, RCS automatically balances when translating so it doesn\u0027t cause rotation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWAIT WHAT THAT WAS A THING?\u003C/p\u003E\u003Cp\u003EI\u0027ve still been doing it the old way by swapping RCS on and off to dock for the whole time since the update and this is a thing now?! Maan...\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2013-07-30T06:16:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheDarkStar\u0022 data-cite=\u0022TheDarkStar\u0022\u003E\u003Cdiv\u003ETo answer your question, docking ports can only dock with other docking ports of the same type. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore accurately, they can only dock with other ports of the same \u003Cstrong\u003Esize\u003C/strong\u003E. So, for instance, both of the docking ports that have animated enclosures are medium sized docking ports, and can dock with each other as well as the medium sized clamp o trons.\u003C/p\u003E\n"}]}