{"TopicId":40269,"ForumId":16,"TopicTitle":"Switching between cockpits in IVA mode","CreatedByName":"Dawun","CreatedById":76918,"CreatedDateTime":"2013-07-31T13:23:05Z","PageNum":1,"Articles":[{"CreatedByName":"Dawun","CreatedById":76918,"CreatedDateTime":"2013-07-31T13:23:05Z","Content":"\n\u003Cp\u003EHey guys,\u003C/p\u003E\u003Cp\u003EI\u0027ve been building spaceplanes here for a while (although I haven\u0027t posted here before) and I\u0027ve come across something that might possibly be considered a bug. I\u0027ve searched around for other people with this problem but I couldn\u0027t find any useful information.\u003C/p\u003E\u003Cp\u003EI have a rather large plane now, and challenged myself to fly it into orbit fully in IVA mode. Since the plane is so big I have four Cupola command modules with a kerbal in each, one each on the top, bottom, front, and back of the plane. I think having so many views is a much nicer way to fly (and easier for dockings/landings). I do the ground roll and takeoff from the runway, set my pitch at roughly fifty degree and turn on SAS. This is all from the front cockpit. The SAS is now set to point, say, fifty degrees above the horizon (I believe the default direction is East?). Then I switch command pod using the \u0022v\u0022 key and I\u0027m looking through the eyes of the bottom command pod. This command pod, naturally, is pointed roughly ninety degrees downwards from the front command pod, and this appears so on the navball. The SAS, however, now wants to point this cockpit 55 degrees above East, and the whole plane starts to rotate such that the bottom cockpit is facing the way the front one was.\u003C/p\u003E\u003Cp\u003EThis means that the only way I can switch views while flying my plane is to hit v and then very quickly double tap t, to reset the SAS to the new cockpit direction. This doesn\u0027t work very well though, and makes switching views a pain. Is there any way to have this done automatically or avoid this? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Enigma179","CreatedById":67703,"CreatedDateTime":"2013-07-31T14:16:49Z","Content":"\n\u003Cp\u003ECould always hold F while hitting V; holding F switches SAS to the opposite state while it\u0027s held down, so is faster than the double tap. If your SAS is off for a second just before you swap cockpits you won\u0027t lose your heading too badly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"duncan1297","CreatedById":57230,"CreatedDateTime":"2013-07-31T17:09:36Z","Content":"\n\u003Cp\u003EI\u0027d really like to see what this plane looks like.\u003C/p\u003E\n"},{"CreatedByName":"Dawun","CreatedById":76918,"CreatedDateTime":"2013-07-31T20:07:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Enigma179\u0022 data-cite=\u0022Enigma179\u0022\u003E\u003Cdiv\u003ECould always hold F while hitting V; holding F switches SAS to the opposite state while it\u0027s held down, so is faster than the double tap. If your SAS is off for a second just before you swap cockpits you won\u0027t lose your heading too badly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThats a good idea, but in the end turns out that SAS doesn\u0027t work properly even if you turn it off and back on when you switch. It works okay for a few seconds, but then tries to re-orient the plane again \u0026gt;.\u0026gt;\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022duncan1297\u0022 data-cite=\u0022duncan1297\u0022\u003E\u003Cdiv\u003EI\u0027d really like to see what this plane looks like.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI gave up on the multiple cupola idea, instead I removed the bottom and rear cupolas, put a normal cockpit in the front, and stole an idea from the AWACS aircraft and put a command post thing on my plane. Might be draggy but oh well. It looks like this:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/4wglhj1p1/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://postimg.org/image/4wglhj1p1/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/jcwlkzmtl/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://postimg.org/image/jcwlkzmtl/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/dqpovaz0r/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://postimg.org/image/dqpovaz0r/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://postimg.org/image/zawmksu2r/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://postimg.org/image/zawmksu2r/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt started out as just the cylindrical fuselage thing, but then as I wanted to carry more and more mass up into orbit I started adding on. I have a competition going with some friends to get a spaceplane to Duna\u0027s surface and back to the KSC without dropping any parts, refuelling, or in general any assistance. I can get this plane up into orbit with just under eight thousand oxidizer and the corresponding liquidfuel. According to some calculations I did that isn\u0027t enough for my Duna trip :/\u003C/p\u003E\u003Cp\u003EIt might not be too visible, but there is a pair of nuclear engines right below the skippers. You can see them in the third link.\u003C/p\u003E\n"}]}