{"TopicId":40348,"ForumId":16,"TopicTitle":"mass - gravity - thrust","CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-31T21:41:04Z","PageNum":1,"Articles":[{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-31T21:41:04Z","Content":"\n\u003Cp\u003ESo I would like to build a lander. and I would like to use as small as engines as possible.. Now on Kerban the lander doesn\u0027t even get lifted by the rockets, but this is set for the mun.. Can I figure out if it works there?\u003C/p\u003E\u003Cp\u003EI would need to know the mass (which I can find out)\u003C/p\u003E\u003Cp\u003EThen I need to know the gravity of the mun\u003C/p\u003E\u003Cp\u003Eand then figure out what \u0022engine max power) is..\u003C/p\u003E\u003Cp\u003ELike if a engine max power is 250.. does that mean under Kerban gravity it\u0027ll lift 250 mass?\u003C/p\u003E\u003Cp\u003ESome help would be great. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-07-31T21:52:01Z","Content":"\n\u003Cp\u003ECheck the KSP wiki to find the gravity on each planetary body (google it, that\u0027s what I always do).\u003C/p\u003E\u003Cp\u003EEngine thrust is in kN, and masses are in tones (1000 kg). Divide the power by the mass to get the acceleration: 250 kN can move 250 tonnes at 1m/s^2, which is nowhere near enough on Kerbin or even on Mun, but plenty on Minmus.\u003C/p\u003E\n"},{"CreatedByName":"Dewm","CreatedById":76148,"CreatedDateTime":"2013-07-31T22:01:47Z","Content":"\n\u003Cp\u003EThanks for the help!\u003C/p\u003E\n"},{"CreatedByName":"longhornchris","CreatedById":70974,"CreatedDateTime":"2013-07-31T22:10:08Z","Content":"\n\u003Cp\u003EYou should probably get Kerbin engineering system (KES) and the subassembly loader. KES can give you thrust-to-weight ratios for all the different bodies so you can size your lander for your target planet. Subassembly loader will allow you to save your lander and attach it to another spacecraft rather than re-build it.\u003C/p\u003E\n"}]}