{"TopicId":40523,"ForumId":16,"TopicTitle":"Advice needed for my first Duna landing and return mission","CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2013-08-01T19:01:38Z","PageNum":1,"Articles":[{"CreatedByName":"Kerbonautical","CreatedById":75532,"CreatedDateTime":"2013-08-01T19:01:38Z","Content":"\n\u003Cp\u003ESo I\u0027ve been contemplating taking my first manned return trip to another planet and after dabbling with some of the other planets Duna has stuck out as the go to place to begin, although Laythe was very tempting too.\u003C/p\u003E\u003Cp\u003ESo what sort of vessel should I be constructing here? I\u0027ve tried using the KSP calculator but failed to make any sense of it. I previously constructed an interplanetary vessel which took me most of the day only to find that one of the docking ports was stuck inside the adapter and had to scrap the entire project. So rather than going in blind again I decided to try get some advice from here first.\u003C/p\u003E\u003Cp\u003EMy next planned attempt was going to consist of two poodles on medium size rockomax tanks attached to one extra small one to act as a tug for the vessel. Possibly a 3 way docking station to hold my lander and two extra large rockomax tanks for backup fuel, and a lander powered by a single poodle with a couple radial fuel tanks as a backup. I was also thinking of sticking a probe on each large rockomax fuel tank which will be deployed before leaving Duna and possibly a small rover to attach to the back of the lander.\u003C/p\u003E\u003Cp\u003EDoes this have any remote chance of getting me and 3 kerbals to Duna and back once assembled in orbit or have I overshot/undershot the requirements?\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-08-02T03:23:58Z","Content":"\n\u003Cp\u003EA pic would be better, so we can see your ship.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-02T13:11:20Z\u0022 title=\u002208/02/2013 01:11  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 2, 2013\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jm419","CreatedById":57266,"CreatedDateTime":"2013-08-02T04:17:01Z","Content":"\n\u003Cp\u003EHonestly, I just refueled an Apollo-style craft in Kerbin orbit, and flew there on a freakin\u0027 Mainsail.\u003C/p\u003E\n"},{"CreatedByName":"Enigma179","CreatedById":67703,"CreatedDateTime":"2013-08-02T04:24:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kerbonautical\u0022 data-cite=\u0022Kerbonautical\u0022\u003E\u003Cdiv\u003ESo I\u0027ve been contemplating taking my first manned return trip to another planet and after dabbling with some of the other planets Duna has stuck out as the go to place to begin, although Laythe was very tempting too.\u003Cp\u003ESo what sort of vessel should I be constructing here? I\u0027ve tried using the KSP calculator but failed to make any sense of it. I previously constructed an interplanetary vessel which took me most of the day only to find that one of the docking ports was stuck inside the adapter and had to scrap the entire project. So rather than going in blind again I decided to try get some advice from here first.\u003C/p\u003E\u003Cp\u003EMy next planned attempt was going to consist of two poodles on medium size rockomax tanks attached to one extra small one to act as a tug for the vessel. Possibly a 3 way docking station to hold my lander and two extra large rockomax tanks for backup fuel, and a lander powered by a single poodle with a couple radial fuel tanks as a backup. I was also thinking of sticking a probe on each large rockomax fuel tank which will be deployed before leaving Duna and possibly a small rover to attach to the back of the lander.\u003C/p\u003E\u003Cp\u003EDoes this have any remote chance of getting me and 3 kerbals to Duna and back once assembled in orbit or have I overshot/undershot the requirements?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBasically you\u0027re gonna want kerbal engineering or something to figure out delta-v numbers, and then you\u0027re gonna want to look at a delta-v map (search delta-v map KSP on images and it\u0027ll be the first one). Alarm clock is also useful so you can figure out exact transfer times. I believe the best bet for a Duna land and return is an apollo style thing, with LKO rendezvous; build a lander/ship combo in the VAB, then send up the lander on its own, and the ship on its own, use the ship to fly the lander to Duna orbit, use the lander to land (use chutes to cut down on delta-v requirement for landing) and return, ditch the lander and come home.\u003C/p\u003E\u003Cp\u003EWith nukes, Duna is a pretty easy trip to make, especially if you just build the ship in orbit.\u003C/p\u003E\n"},{"CreatedByName":"Snooze","CreatedById":67712,"CreatedDateTime":"2013-08-02T05:03:24Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/biU8HqF.png\u0022 alt=\u0022biU8HqF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBuild yourself something like this. Easy day.\u003C/p\u003E\u003Cp\u003ELander and drive section were sent up separately and docked in LKO.\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2013-08-02T06:28:10Z","Content":"\n\u003Cp\u003EMy craft to Duna and back used a nuclear engine for transfer both ways, and a separate lander for going to the surface and returning to orbit. All that was plonked on a lifter beefy enough to get it in to Kerbin orbit, and it was good to go.\u003C/p\u003E\n"},{"CreatedByName":"jwenting","CreatedById":57735,"CreatedDateTime":"2013-08-02T06:57:12Z","Content":"\n\u003Cp\u003EHad high hopes for my latest Duna Explorer. Until an unfortunate triggering of the safety release mechanism of the crew capsule during final descent to Duna caused the crew to get stranded there that is.\u003C/p\u003E\u003Cp\u003EFuel for the return trip may have been tight too, to be honest, but probably enough to reach Kerbin and do aerobraking there to land or orbit.\u003C/p\u003E\u003Cp\u003EResult, I\u0027m designing a rescue mission with tons of safety built in. Vehicle will have docking ports, refueling bowsers will be sent ahead to Duna orbit to await its arrival, and I\u0027m even thinking of sending a spare crew vehicle and its own refueling support.\u003C/p\u003E\n"},{"CreatedByName":"Payload","CreatedById":4540,"CreatedDateTime":"2013-08-02T09:30:34Z","Content":"\n\u003Cp\u003EDon\u0027t forget to bring a towel. Nukes are great for landing and taking off from Duna. After all, no one lives there and who really cares if we make it glow. It will just be easier to see.\u003C/p\u003E\n"}]}