{"TopicId":40679,"ForumId":16,"TopicTitle":"Running out of fuel on orbital burn.","CreatedByName":"nitrous729","CreatedById":77222,"CreatedDateTime":"2013-08-02T18:14:11Z","PageNum":1,"Articles":[{"CreatedByName":"nitrous729","CreatedById":77222,"CreatedDateTime":"2013-08-02T18:14:11Z","Content":"\n\u003Cp\u003EHi, new to the game and forums. I have been successful making a decent circular orbit with smaller craft. I am trying to make an attempt to get to the moon following this video \u003Ca href=\u0022https://www.youtube.com/watch?v=cJk9U-A1ps4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=cJk9U-A1ps4\u003C/a\u003E. I feel like i am doing everything right but i always run out of fuel while trying to get the apoapsis to 100km. Any ideas?\u003C/p\u003E\n"},{"CreatedByName":"dlmarti","CreatedById":70037,"CreatedDateTime":"2013-08-02T19:27:04Z","Content":"\n\u003Cp\u003EIf you are running out of fuel, that is the problem:\u003C/p\u003E\u003Cp\u003E1. The craft you made, may not have the capability (not enough delta-v).\u003C/p\u003E\u003Cp\u003E2. Your launch could be really inefficient. \u003C/p\u003E\u003Cp\u003ECan you show a picture of your craft, and describe how you launched it, and when you did your gravity turn?\u003C/p\u003E\u003Cp\u003Ebut tbh, you just need to keep trying really. Try using one of the stock designs (yeah I know they are not the best). If you ABSOLUTELY cannot make it, ask someone here for their easiest to launch design.\u003C/p\u003E\n"},{"CreatedByName":"cmoody","CreatedById":73304,"CreatedDateTime":"2013-08-02T19:35:56Z","Content":"\n\u003Cp\u003EWelcome to the community. If you build the craft like it is in the video, there shouldn\u0027t be any problems. Make sure you modulate your throttle so you keep a respectable speed. (~140m/s up to 12,000m, then work slowly up to 500 m/s until orbit)\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-08-02T20:09:49Z","Content":"\n\u003Cp\u003EIf you\u0027ve got an exact replica of the craft in that video, chances are there\u0027s issues with your piloting. Here\u0027s what you do: make sure your navball\u0027s centered straight up (the little dot on the blue side of the navball) until you get to about 10,000m altitude. Next, aim for heading 090 at 45 degrees elevation - you should see 90 on the nav ball and a line halfway between the straight up dot and the line where the navball turns brown; the intersection of those two is where you need to aim. Hold that heading until you\u0027re at about 30,000 or so, then check the nav map for your time to apoapsis. If it\u0027s anywhere between 30-45 seconds, go ahead and change your elevation to 10-20 degrees and continue your burn watching the nav ball - shorter period stay at 45, longer go immediately horizontal. Cut your burn once your Ap is at about 105k; you should still be in the atmosphere at that point so you\u0027ll lose a little to your apoapsis while you\u0027re coasting upwards. At apopasis, burn as necessary to circularize.\u003C/p\u003E\u003Cp\u003ETry that and see if it helps.\u003C/p\u003E\n"},{"CreatedByName":"jacob97","CreatedById":76819,"CreatedDateTime":"2013-08-02T20:10:23Z","Content":"\n\u003Cp\u003Eif you have the mechjeb mod or flight engineer mod, it will display the Delta-V of a spacecraft. As a rough guide it will take 4000 m/s to reach a stable 100km orbit, plus a bit if u need to increase height at a later time. the delta-v will depend on how sttep in ascent u take is\u003C/p\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-08-03T14:26:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jacob97\u0022 data-cite=\u0022jacob97\u0022\u003E\u003Cdiv\u003Eif you have the mechjeb mod or flight engineer mod, it will display the Delta-V of a spacecraft. As a rough guide it will take 4000 m/s to reach a stable 100km orbit, plus a bit if u need to increase height at a later time. the delta-v will depend on how sttep in ascent u take is\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor someone brand new to the game, i would recommend planning no less than 5000m/s dV for a launch to LKO. Once pilot skill increases, that number can be brought down to around 4400.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-08-03T16:27:14Z","Content":"\n\u003Cp\u003EAs has been said, you need practice. Also, learn about dV, which is the total change in velocity (not net change). The formula for it is dV = I\u003Csub\u003Esp\u003C/sub\u003E * G * ln(starting stage mass / ending stage mass). G is about 9.81 m/s\u003Csup\u003E2\u003C/sup\u003E, or Earth gravity. More efficient engines change your dV a lot, having a lot of fuel increases it with diminishing returns, and excess weight (like too many engines on an orbital transfer stage) lowers it.\u003C/p\u003E\n"},{"CreatedByName":"scooterjes","CreatedById":66795,"CreatedDateTime":"2013-08-03T17:03:21Z","Content":"\n\u003Cp\u003EAs one of the previous posters suggested I will post some pics and the craft file(if you are interested) this rocket can easily lift 50-60 tons into a 100km orbit. As you can see I use Mechjeb(my piloting skill are mediocre at best) but that rocket is very stable and fairly easy to fly the only change you might want to make is depending on your payload is to add a RTG(electricity generator) or 2 and a battery. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0B5QtXfJCkXZfLVVGcWZMeVBicWM/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/file/d/0B5QtXfJCkXZfLVVGcWZMeVBicWM/edit?usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0B5QtXfJCkXZfMm91Yy1xV0c3eFE/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/file/d/0B5QtXfJCkXZfMm91Yy1xV0c3eFE/edit?usp=sharing\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://docs.google.com/file/d/0B5QtXfJCkXZfcndJdl9oMV8taUk/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://docs.google.com/file/d/0B5QtXfJCkXZfcndJdl9oMV8taUk/edit?usp=sharing\u003C/a\u003E here is where you can download the craft file while if you want to study it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-03T17:07:36Z\u0022 title=\u002208/03/2013 05:07  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 3, 2013\u003C/time\u003E by scooterjes\u003C/strong\u003E\n\u003C/span\u003E\n"}]}