{"TopicId":41183,"ForumId":16,"TopicTitle":"View names of parts used in the VAB?","CreatedByName":"Ozihcs","CreatedById":77669,"CreatedDateTime":"2013-08-05T18:54:10Z","PageNum":1,"Articles":[{"CreatedByName":"Ozihcs","CreatedById":77669,"CreatedDateTime":"2013-08-05T18:54:10Z","Content":"\n\u003Cp\u003EAs a complete novice, I find it very strange that there seems to be no way to view the name of parts in the vehicle assemby bay. You have to pick a part and visually compare it to the parts list, which is quite time-consuming when trying to figure out how a preassembled rocket works.\u003C/p\u003E\u003Cp\u003EAre there any keyboard shortcuts I\u0027ve missed? If not, anyone else agree this should be a feature request?\u003C/p\u003E\n"},{"CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2013-08-05T22:24:12Z","Content":"\n\u003Cp\u003EFor now, you can compare parts in the KSP Wiki. Parts are listed in tables showing specs.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-05T22:53:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ozihcs\u0022 data-cite=\u0022Ozihcs\u0022\u003E\u003Cdiv\u003EAs a complete novice, I find it very strange that there seems to be no way to view the name of parts in the vehicle assemby bay. You have to pick a part and visually compare it to the parts list, which is quite time-consuming when trying to figure out how a preassembled rocket works.\u003Cp\u003EAre there any keyboard shortcuts I\u0027ve missed? If not, anyone else agree this should be a feature request?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI figured out the other day that you can switch to Action Group mode and the names of the parts you select in the assembly bay will show up in that panel. This has already saved me many hair-tearing moments.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-05T22:53:54Z","Content":"\n\u003Cp\u003EIt\u0027s been suggested plenty of times. You should be able to learn what everything does/looks like/is named fast enough without more help than is already in the game.\u003C/p\u003E\n"},{"CreatedByName":"Ozihcs","CreatedById":77669,"CreatedDateTime":"2013-08-07T16:18:40Z","Content":"\n\u003Cp\u003E@Johnno\u003C/p\u003E\u003Cp\u003Eokay, technically correct but not very helpful \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI specifically asked about this because it would speed up the learning process of any novice. The game is in Beta, and once complete there will be a rush of less patient people than typically the space geeks who so far participate (presumably). \u003C/p\u003E\u003Cp\u003EThe purpose of a beta process is to weed out bugs but also gain feedback from a small group of users in time to polish the product before release.\u003C/p\u003E\u003Cp\u003ELet me rephrase then: \u003C/p\u003E\u003Cp\u003EBy adding a hot key which brings up the part names of a rocket you would speed up the learning process of new players, who can look at a functional prefab and figure out which parts are used and why. The process of zooming in on a part, and hunting for something which looks just like it in the iconized parts list, has zero pedagogic value and is both tedious and midly annoying. \u003C/p\u003E\u003Cp\u003ESo, pretty please, with sugar on top.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-08T13:39:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ozihcs\u0022 data-cite=\u0022Ozihcs\u0022\u003E\u003Cdiv\u003EThe process of zooming in on a part, and hunting for something which looks just like it in the iconized parts list, has zero pedagogic value and is both tedious and midly annoying. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I said above, you can go to Action Groups and see the part name. It works. Try it.\u003C/p\u003E\n"}]}