{"TopicId":41301,"ForumId":16,"TopicTitle":"SSTO in Duna atmosphere","CreatedByName":"lewille","CreatedById":76348,"CreatedDateTime":"2013-08-06T14:04:38Z","PageNum":1,"Articles":[{"CreatedByName":"lewille","CreatedById":76348,"CreatedDateTime":"2013-08-06T14:04:38Z","Content":"\n\u003Cp\u003EHi guys,\u003C/p\u003E\u003Cp\u003EI build an SSTO that will rendez-vous with a travel \u0022ship\u0022 (more like a strap on nuclear booster) to go land on Duna.\u003C/p\u003E\u003Cp\u003EI wanted to know if it was possible to use the standard air breathing engines in Duna\u0027s atmosphere (albeit with less power) or if it is completely undoable and I have to rocket my way out?\u003C/p\u003E\u003Cp\u003EThanks for your answer\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-06T17:06:26Z\u0022 title=\u002208/06/2013 05:06  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 6, 2013\u003C/time\u003E by lewille\u003C/strong\u003E\n\u003Cbr\u003Eanswered\n\u003C/span\u003E\n"},{"CreatedByName":"rryy","CreatedById":57357,"CreatedDateTime":"2013-08-06T14:33:26Z","Content":"\n\u003Cp\u003EYou have to use rocket engines in Duna\u0027s atmosphere because there is no oxygen for the jet engines to work.\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2013-08-06T14:38:32Z","Content":"\n\u003Cp\u003ENo Oxygen means no jets. I recommend using Atomic Engines, as they have an ISP of like 700 in Dunas atmosphere, which is still far more efficient then any other rocket.\u003C/p\u003E\n"},{"CreatedByName":"littlebattler","CreatedById":73508,"CreatedDateTime":"2013-08-06T14:41:44Z","Content":"\n\u003Cp\u003EA spaceplane is still viable though, as the wings still generate lift even if jet engines don\u0027t work. Wing lift = less delta V needed to get to orbit. Take this into consideration when deciding whether or not you want to make the duna SSTO a spaceplane.\u003C/p\u003E\n"},{"CreatedByName":"AnalogAddict","CreatedById":59758,"CreatedDateTime":"2013-08-06T14:44:13Z","Content":"\n\u003Cp\u003EAn SSTO of mine can get to Duna, land, and go back to orbit of its own volition. Getting the ship back to Kerbin will require a small amount of fuel, which if you were wanting to attach a plane to a transfer stage then that shouldn\u0027t be a problem. \u003C/p\u003E\u003Cp\u003EBare .craft below, add docking ports, rcs, small payloads, and whatnot to your liking. \u003C/p\u003E\u003Cp\u003EJust adding a docking port is your best bet, that\u0027ll let you refuel the craft in LKO then begin the burn towards Duna. That should provide you enough fuel to burn to Duna, land, re-orbit and return without the need for fut\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/44759-The-Courier-SpacePlane-To-orbit-three-times-w-o-refueling%21\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/44759-The-Courier-SpacePlane-To-orbit-three-times-w-o-refueling%21\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"lewille","CreatedById":76348,"CreatedDateTime":"2013-08-06T15:02:24Z","Content":"\n\u003Cp\u003EDamn I was hoping to jet my way back into space.\u003C/p\u003E\u003Cp\u003EOh well... the rocket engine will hopefuly dont use too much fuel to do so\u003C/p\u003E\n"}]}