{"TopicId":41473,"ForumId":16,"TopicTitle":"Should I do the inclination burn closer or farther from the parent body?","CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-08-07T17:55:54Z","PageNum":1,"Articles":[{"CreatedByName":"Themohawkninja","CreatedById":9628,"CreatedDateTime":"2013-08-07T17:55:54Z","Content":"\n\u003Cp\u003EThis is a question that I have wondered for a long time. Is it better do to the inclination burn when in a very high orbit, or a very low orbit, or does it not matter at all?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-07T18:10:49Z\u0022 title=\u002208/07/2013 06:10  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 7, 2013\u003C/time\u003E by Themohawkninja\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-08-07T17:59:35Z","Content":"\n\u003Cp\u003EThe delta-v requirements to change the inclination of an orbit vary significantly with orbital height. Doing the burn at a very high apoapsis is a LOT cheaper, fuel-wise, than doing it at a low orbital altitude.\u003C/p\u003E\n"},{"CreatedByName":"Stochasty","CreatedById":57264,"CreatedDateTime":"2013-08-07T18:05:01Z","Content":"\n\u003Cp\u003EThe slower you\u0027re moving, the cheaper it is to change inclination. As for whether or not \u0022higher is better\u0022 it depends on how steep the inclination change you need to make is; sometimes it\u0027s more efficient to do it where you stand, sometimes it\u0027s more efficient to boost yor orbit first and then make the change. This is obvious for the case of a 180 degree inclination change; it\u0027d take about 4500 m/s to manage in LKO, but you can do it for under 2000 m/s by boosting your orbit to the edge of Kerbin\u0027s SoI, making the change, and then dropping your orbit back down.\u003C/p\u003E\u003Cp\u003EThe math here is very similar to the math for bielliptic transfers. Sometimes they\u0027re efficient, sometimes they\u0027re not; it depends on how large a difference there is between your current orbit and yourtarget orbit, although I don\u0027t remember the exact formula off of the top of my head.\u003C/p\u003E\n"},{"CreatedByName":"King Arthur","CreatedById":73849,"CreatedDateTime":"2013-08-07T18:08:03Z","Content":"\n\u003Cp\u003EGenerally speaking, most orbital manuevers are better done at a higher altitude if you\u0027re flying there as the associated slower velocities mean you spend significantly less dV than you would at lower orbits.\u003C/p\u003E\n"},{"CreatedByName":"asmi","CreatedById":59068,"CreatedDateTime":"2013-08-07T18:18:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022King Arthur\u0022 data-cite=\u0022King Arthur\u0022\u003E\u003Cdiv\u003EGenerally speaking, most orbital manuevers are better done at a higher altitude if you\u0027re flying there as the associated slower velocities mean you spend significantly less dV than you would at lower orbits.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, but that\u0027s not always possible - for example inclination changes need to happen when the vessel cross equator, otherwise only higher inclinations are available and LAN will change as well, LAN changes have to happen in most nothern/southern points of orbit - otherwise inclination will also change.\u003C/p\u003E\n"},{"CreatedByName":"purpletarget","CreatedById":57317,"CreatedDateTime":"2013-08-07T18:34:38Z","Content":"\n\u003Cp\u003EThe cut-off is generally around 60 degrees. If you\u0027re torquing/inclining your orbit more than 60, then you\u0027ll save dV by boosting your Ap and doing the change way out there. Anything under 60ish, just stick altitude you\u0027re at.\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-07T18:34:51Z","Content":"\n\u003Cp\u003EThe formula for an impulse inclination change cost is simple:\u003C/p\u003E\u003Cp\u003E2 * current_velocity * sin (change_in_inclination_angle/2)\u003C/p\u003E\u003Cp\u003EIf I want to change my inclination by 45 degrees and I\u0027m currently going 2246 m/s, it will cost 2 * 2246 * sin (45/2) = 1719 m/s.\u003C/p\u003E\u003Cp\u003ESo you can see that the cost scales directly with velocity. The break-even point will vary with initial and final altitudes, but for an initial altitude of 100km, it costs ~ 920 m/s to raise your apoapsis to the edge of Kerbin\u0027s SOI and a similar amount to lower it again. Your speed at apoapsis would be about 25 m/s, so inclination changes would be trivial. So working backward, somewhere around 55 degrees of inclination change is where it\u0027s more efficient to raise your orbit to change inclinations.\u003C/p\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-08-08T00:05:24Z","Content":"\n\u003Cp\u003EIf you don\u0027t care about lowering your final orbit altitude on the opposite side of the body, you can get away with as little as \u003C/p\u003E\u003Cp\u003Edelta_V = current_velocity * sin(inclination_change)\u003C/p\u003E\u003Cp\u003Eby burning at double the angle by which you wish to change your orbit, but this will quickly leave you on a suborbital trajectory so this is rarely useful unless you are parked in a high circular-ish orbit and wish to move to a lower orbit at a different inclination. Note that for angles \u0026gt;=90deg this just means burning full retrograde to a full-stop (a 0km*Xkm orbit can change inclination for free at X), which will just have you plummet to the surface.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-10-07T18:33:06Z","Content":"\n\u003Cp\u003Eso its not only the height, but the speed too...\u003C/p\u003E\u003Cp\u003Esay, if i want to visit Bop... given the high orbital speeds in low jool orbit (i usually aimed my probes for a 200-300km orbit).. i should better aim for a higher orbit (when aerobraking) and then make the inclination change?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-10-07T18:56:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmlÃƒÂ¼x\u0022 data-cite=\u0022UmlÃƒÂ¼x\u0022\u003E\u003Cdiv\u003Eso its not only the height, but the speed too...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo. It is only about your velocity. Orbiting at higher altitudes just means your orbital velocity is lower.\u003C/p\u003E\n"}]}