{"TopicId":41496,"ForumId":16,"TopicTitle":"Orbital Ops and Rendevous?","CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-07T20:20:10Z","PageNum":1,"Articles":[{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-07T20:20:10Z","Content":"\n\u003Cp\u003EOkay.. First off, this may be a repost of my own thread, if so, sorry. I am new to KSP, just got it on Steam a day or two ago and I love it! My question is this, sorry if I am duplicating \u0026lt;most likely I am, but my serch fu stinks lol\u0026gt;:\u003C/p\u003E\u003Cp\u003E1. How do you duplicate the orbit of your target vessel? I can never seem to pull off 2 identical orbits, they always seem off set with one say being aligned with the equator and the second with a chase orbiter canted off where it passes above and below the target vessels orbit. SOMETIMES, I can get them nearly on the same plane, but never twice on the same plane. \u003C/p\u003E\u003Cp\u003E2. Is there a series of practice launches I should make just to get the feel of it, or is there something I am missing entirely?\u003C/p\u003E\u003Cp\u003EAny and all help is welcomed, thanks in advance!\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2013-08-07T20:52:17Z","Content":"\n\u003Cp\u003EYou can launch to an equatorial orbit by making sure that your gravity turn is always aligned eastward (on the 90 degree line on the NavBall) during ascent. You can actually launch to any inclination because KSC is on Kerbin\u0027s equator. (It is impossible to launch to an inclination that is lower than the latitude of your launch site. So for instance, the IRL Kennedy Space Center, which is at 28.5N cannot launch to equatorial inclinations less than 28.5 degrees.) Launching from Kerbal Space Center to non-east (or west) ward inclinations requires some math because you have to account for Kerbin\u0027s spin.\u003C/p\u003E\u003Cp\u003EAnyway, if you get into orbit and your orbit is inclined relative to your target, you can adjust your orbit\u0027s inclination to match. You want to right click the other vessel in map view and select it as target. There should be two arrows on the target orbit (highlighted in green now) marked AN and DN (ascending node and descending node.) These are the places where your orbital plane crosses the target\u0027s orbital plane. You\u0027ll want to do your inclination change at one or the other one. If you do it at the ascending node, you want to burn anti-normal (triangle with cross-hairs on the maneuver node) Mnemonic: Anti-Normal at the Ascending Node: AN at the AN. If you do it at the DN, you want to burn normal (triangle without cross-hairs)\u003C/p\u003E\n"},{"CreatedByName":"Rhyunix","CreatedById":59383,"CreatedDateTime":"2013-08-07T21:02:58Z","Content":"\n\u003Cp\u003EYou are most certainly not alone in the world of docking rookie\u0027s (don\u0027t mind me..) anyway, Its good to know that you are enjoying the game. I mastered docking easily after doing it Gemini style.\u003C/p\u003E\u003Cp\u003EPrinciple:\u003C/p\u003E\u003Cp\u003ELaunch a medium sized target - no specific value, no crew, one docking port, minimal RCS thrusters\u003C/p\u003E\u003Cp\u003EPlace it in a 120x120 Orbit on the equator (slightly off is good)\u003C/p\u003E\u003Cp\u003ELaunch a small, 1 kerbal craft with a substantial amount of RCS - you\u0027ll need to design a good rocket to get you into space\u003C/p\u003E\u003Cp\u003ETake your time - the first mistake is to rush. Don\u0027t forget there is quick save.\u003C/p\u003E\u003Cp\u003ETake your craft to a stable 100x100 orbit\u003C/p\u003E\u003Cp\u003EThrust prograde until our orbit comes on the path of the target\u003C/p\u003E\u003Cp\u003EWait - timing is never perfect unless you calculate it\u003C/p\u003E\u003Cp\u003EOnce your intercept is close, bring up a node and faf like hell until the distance between target becomes about 0.5 Km\u003C/p\u003E\u003Cp\u003EQuicksave\u003C/p\u003E\u003Cp\u003EDo maneuvers\u003C/p\u003E\u003Cp\u003EOnce you\u0027ve spotted the target, use your nav-ball and burn all of the retrograde until it disappears- you shouldn\u0027t be moving significantly away from the target\u003C/p\u003E\u003Cp\u003EQuicksave\u003C/p\u003E\u003Cp\u003EPoint towards the target and use RCS to get there - take it slow, there\u0027s still no need to rush\u003C/p\u003E\u003Cp\u003EDrift slowly to the Docking port - once you see it, line up both craft on an angle, say 00 degrees\u003C/p\u003E\u003Cp\u003Eline up everything on the nav-ball and visually\u003C/p\u003E\u003Cp\u003Ethrust forward - make sure the yellow prograde marker never leaves the purple target indicator mark\u003C/p\u003E\u003Cp\u003Ethrust until your speed is at 0.2m/s\u003C/p\u003E\u003Cp\u003Edock!\u003C/p\u003E\u003Cp\u003EReload quicksave\u003C/p\u003E\u003Cp\u003Erepeat\u003C/p\u003E\u003Cp\u003Erepeat\u003C/p\u003E\u003Cp\u003Erepeat\u003C/p\u003E\u003Cp\u003Erepeat\u003C/p\u003E\u003Cp\u003ERestart mission\u003C/p\u003E\u003Cp\u003Erepeat whole process\u003C/p\u003E\u003Cp\u003Erepeat\u003C/p\u003E\u003Cp\u003ECongratulations! You\u0027ve learnt to dock!\u003C/p\u003E\n"},{"CreatedByName":"Guber K.","CreatedById":77131,"CreatedDateTime":"2013-08-07T21:03:26Z","Content":"\n\u003Cp\u003EI just watched a youtube video about this. Maybe it will help.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=PLYu7z3I8tdEm5nyZU3a-O2ak6mBYXWPAL\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-08-07T21:04:24Z","Content":"\n\u003Cp\u003EWelcome to the addiction that is KSP...\u003C/p\u003E\u003Cp\u003ELessee....launching. General rule, straight up to 10k, turn to 45 degrees elevation at that point along course 090 (use the navball) and hold that until you\u0027re about 30k, then look at your time to apoapsis. If it\u0027s less than thirty seconds, hold 45 degrees; greater than 45 seconds, start burning along the horizon. Between the two, go somewhere between ten and twenty degrees elevation. This is a rough guesstimate for what\u0027s called a \u0022gravity turn\u0022, and it takes advantage of Kerbin\u0027s gravity to reduce your launch delta-V requirement.\u003C/p\u003E\u003Cp\u003EOrbital ops...Mr. Shifty\u0027s got you covered on how to change the inclination of your orbit relative to a target. Just burn north at the descending node or south at the ascending node until it\u0027s zeroed out; this is the very first thing you want to do when trying to make a rendezvous, as it\u0027s one less dimension you have to worry about. Then use the maneuver nodes to plan the rendezvous; set them at the apoapsis or periapsis (to see which one\u0027s coming up first), then see what a burn prograde or retrograde does to the estimated distance between you and the target. Adjust that as necessary...as long as it\u0027s getting closer over time, don\u0027t worry too much about it. Actual docking can be tricky to the uninitiated; I highly suggest RCS for the first time. The \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:_Gemini_6A_and_7\u0022 rel=\u0022external nofollow\u0022\u003EGemini\u003C/a\u003E tutorial on the wiki may be helpful here.\u003C/p\u003E\u003Cp\u003EI would recommend getting comfortable with getting into orbit before attempting docking, though docking isn\u0027t as big of a deal as you may think. Like most things in the game, it takes practice. Accept that you will botch it badly at some point, and you can laugh at it and move on.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-07T21:39:11Z","Content":"\n\u003Cp\u003Eto all of you who have replied: THANK YOU! I will give it a go through several times! Soo many Kerbonauts have perished just trying to teach me how to fly in the game lol. I sent jebediah into a sun escaping trajectory a time or two on over built speed machines lol. Again, I will give all of your fine advice some much needed practice! I think, for starters I will just launch a herd of lemmings into orbit at the equator just to see if I can match orbits. Practice makes perfect right? Again, thanks for the help, and I will give that video a view shortly. Hey just a silly question, where are y\u0027all getting those ribbons in your signature lines?\u003C/p\u003E\n"},{"CreatedByName":"dave4002000","CreatedById":41394,"CreatedDateTime":"2013-08-07T22:08:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022 data-cite=\u0022AlamoVampire\u0022\u003E\u003Cdiv\u003EHey just a silly question, where are y\u0027all getting those ribbons in your signature lines?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust click on mine, it will automatically link you to the site\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-07T22:18:33Z","Content":"\n\u003Cp\u003Einteresting, thanks dave!\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-07T22:26:42Z","Content":"\n\u003Cp\u003Eon a slightly linked note: I have no signature line option... guess its in the mail or perhaps Bill Kerman lost it in orbit XD BUT, this is my first ribbon:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://ribbons.cgagnier.ca/image.php?ribbon=8460\u0022 alt=\u0022image.php?ribbon=8460\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Keome","CreatedById":72332,"CreatedDateTime":"2013-08-08T00:11:12Z","Content":"\n\u003Cp\u003EIn order to be able to make a signature, you need to have a certain numbers of posts. I think it was 10, but I don\u0027t recall offhand when I could add mine.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-08T00:20:43Z","Content":"\n\u003Cp\u003EI think it is six, since, well, when I looked at SETTINGS, it showed up, and on POST 7, there was my signature LOL\u003C/p\u003E\n"},{"CreatedByName":"stringyquark","CreatedById":74565,"CreatedDateTime":"2013-08-08T02:00:11Z","Content":"\n\u003Cp\u003ERemember the lights. Sucks to be ready to dock as you transition to the dark side.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-08T02:07:20Z\u0022 title=\u002208/08/2013 02:07  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 8, 2013\u003C/time\u003E by stringyquark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-08T06:14:01Z","Content":"\n\u003Cp\u003EOH MY GOD!!!! I DID IT!!! I LANDED ON MUN!!!!!! yes, its just a PROBE lander to theory test my stuff, but its on MUN!!!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img198.imageshack.us/img198/4756/pbce.png\u0022 alt=\u0022pbce.png\u0022\u003E\u003C/p\u003E\u003Cp\u003Ethis taught me something: needs: MORE legs, LONGER ones too XD\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-08T06:14:41Z\u0022 title=\u002208/08/2013 06:14  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 8, 2013\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003Cbr\u003Eafter thought\n\u003C/span\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-08T09:21:42Z","Content":"\n\u003Cp\u003Eside note: achieved docking for the first time, and oh my gawd it was a pain! had to resort to unlimited RCS/Fuel to do it :S but, it taught me stuff, so thats good yes?\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-08T09:32:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022 data-cite=\u0022AlamoVampire\u0022\u003E\u003Cdiv\u003Eside note: achieved docking for the first time, and oh my gawd it was a pain! had to resort to unlimited RCS/Fuel to do it :S but, it taught me stuff, so thats good yes?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure why it was hard for you. Perhaps you might want to try my in-game docking tutorial? (see signature)\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-08-08T14:48:42Z","Content":"\n\u003Cp\u003EAha! I can help. \u003C/p\u003E\u003Cp\u003EDepending on the altitude of your target you may want to go for a direct encounter or make an orbit first. If it is under 150km, you should launch with the target ~30 degrees west of KSC, but that number increases the lower the orbit.\u003C/p\u003E\u003Cp\u003EI would recommend first trying to rendezvous in a orbit of 500km. So here are the steps\u003C/p\u003E\u003Cp\u003E1. Launch you intercept craft with the RIGHT kind of docking ports if you plan to dock. Make a stable orbit at ~100km.\u003C/p\u003E\u003Cp\u003E2. Set your target as a target. Using a maneuver node, make a maneuver with the apoapsis on the orbit of your target. Swing the node around to try and find an intercept. If you cannot, warp around and orbit or two and try again. \u003C/p\u003E\u003Cp\u003E3. When you find an intercept, fiddle with it until it is less that 5 km, the closer the better. You want your burn to replicate the node, so start at full power half of the estimated burn time IE. 30 second burn time, start at t-15 and end at t \u002B15, pointing at the maneuver arrow on the nav ball. \u003C/p\u003E\u003Cp\u003E4. Quicksave and warp to near the intercept. This is the part you may struggle on: The nav ball may swich to \u0022target\u0022 instead of \u0022orbit\u0022 mode if you are close enough, but you can do that manually if you right click on the velocity indicator. At t-30 to intercept, burn facing the new retrograde marker. This mode shows your relative velocity and is necessary to rendezvous. Burn to 0.0 m/s. If you were at the same altitude, and your relative velocity is 0 (same velocity), your orbits will be nearly identical - human error. \u003C/p\u003E\u003Cp\u003E5. Point towards the purple circle and in map view, watch until you get an intercept that comes closer and under .5 km. When you arrive, be careful because you will whiz by fast, burn at the retrograde marker again, in target mode, and you will cut out relative velocity again. You should be close now, and if you need to get closer, repeat this step in smaller increments or use RCS. If you need to dock, ask me and I\u0027ll give you another tutorial. \u003C/p\u003E\u003Cp\u003EP.S.- It helps to remap the translation controls from jhk or whatever to the arrow keys and rshift and rctrl. This is easier than the letter keys, and note that if you map it so up arrow is forward and down arrow is back, and the left and right are left and right, you can control rovers with the arrow keys as well. \u003C/p\u003E\u003Cp\u003EI hope it helps!\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-09T05:31:45Z","Content":"\n\u003Cp\u003ETank Buddy: thank you for those steps, I shall give those a try tonight.\u003C/p\u003E\u003Cp\u003EBlizzy78: it was a royal pain in my backside. No matter what I did I could not slow myself to less than 0.1 meter per second relative to my target. once I got that slow, it was hard as catching snow in summer, but finally managed to lock them together. I think I need more practice, but, I shall start by checking your link out. \u003C/p\u003E\u003Cp\u003EThanks to both of you for the information!\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003EBlizzy78: awesome video. I soo did some of what you show in that video, but, some of it was me not being used to the physics of space and, well, turning my ship into what amounts to a real expensive ballistic missile lol. So do not need that much thrust let alone keeping it CONSTANT XD I need to work on my docking for sure, and your video should help me out a ton. thank you!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-09T05:51:50Z\u0022 title=\u002208/09/2013 05:51  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 9, 2013\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003Cbr\u003Eadditional comment\n\u003C/span\u003E\n"},{"CreatedByName":"neepster","CreatedById":71461,"CreatedDateTime":"2013-08-09T06:59:11Z","Content":"\n\u003Cp\u003EIf you don\u0027t want to do the iterative over and over and over and over, may I suggest MechJeb 2.0 ... Make sure you put RCS units on your stuff WITH MONO Fuel tanks nearby. Use Ascent Guidance to get launch into the plane of the target or just Launch to Rendezvous. Then use the Docking Autopilot. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E At least this is the \u0027easier\u0027 way. I frankly can\u0027t do it any other way (I guess I suck)....\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-08-11T05:58:52Z","Content":"\n\u003Cp\u003EI am losing my mind with docking. I really do not want to run MechJeb if I can avoid it. I figure it is best if I learn how to do this whole rendezvous and docking thing before using mods. The thing is, no matter what I do, I simply cannot get my ships to meet up. I have read the advice here on this thread and many like it, I have watched every video I can find, even the only Blizzy linked, but nothing works. Still not sure how I did it the first time :S Here is what I am doing, and btw, this is the case whether I use the 1 man mercury/gemini looking command module or the 3 man Apollo looking one. Here is what I am doing, step for step.\u003C/p\u003E\u003Cp\u003E1. Launch first ship into a stable 0 degree inclination Equitorial orbit between 150,000m - 200,000m circular orbit. Depending if I use the shielded dock, I will open it, then move to step 2.\u003C/p\u003E\u003Cp\u003E2. Time Warp into my launch window with the target ship in the west about 30-40 degrees behind me.\u003C/p\u003E\u003Cp\u003E3. Launch the same exact ship again so I know I have the proper pair of docking ports for a hoped for rendezvous and docking. I shoot for the same exact orbit, all be it a lower one.\u003C/p\u003E\u003Cp\u003E4. Take a few moments to clean up the orbit and even it out if needed.\u003C/p\u003E\u003Cp\u003E5. change to the larger orbital map\u003C/p\u003E\u003Cp\u003E6. Set up a node to find the nearest intersection of my 2 ships. I try for an encounter that is 0.5 to 1.5Km in distance. \u003C/p\u003E\u003Cp\u003EThese first 6 steps tend to go off like clock work with 0 hiccups. It is when I try to execute the burn for step 6 things get... interesting.\u003C/p\u003E\u003Cp\u003E6A. Do said burn to alter my orbit into the projected one.\u003C/p\u003E\u003Cp\u003E7. Hit X to cut my engines and look for the green circle in the sky.\u003C/p\u003E\u003Cp\u003E8. Once I spot that bugger I do every single thing I can to arrest my speed in relation to the target, but this 9.999 times out of 10 ends up de-orbiting me, even on the slowest settings on my engines. Once managed to de-orbit myself trying to slow down with my RCS thrusters. Only had 4 on the ship too.\u003C/p\u003E\u003Cp\u003E9. Get frustrated and hit alt-f12 to give unlimited fuel and RCS fuel.\u003C/p\u003E\u003Cp\u003E10. Proceed to turn into a ballistic missile that can never achieve anything resembling a docking. By that I mean, that IF by some chance I do not de-orbit myself, I end up zipping past my target and cannot slow myself in time, which turns into a never ending circle of passes as those poor kerbals on the target vessel watch a frustrated ship cartoon it up.\u003C/p\u003E\u003Cp\u003EAny help?\u003C/p\u003E\n"},{"CreatedByName":"aarknevorious","CreatedById":78497,"CreatedDateTime":"2013-08-11T16:49:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022 data-cite=\u0022AlamoVampire\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThese first 6 steps tend to go off like clock work with 0 hiccups. It is when I try to execute the burn for step 6 things get... interesting\u003C/p\u003E\u003Cp\u003EAny help?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is what I usually do:\u003C/p\u003E\u003Cp\u003ESo you are in orbit, coplanar with the target\u0027s. When you achieve intersection (encounters closer than 1.5km or so), start killing your velocity relative to the target, and keep an eye in the map view.\u003C/p\u003E\u003Cp\u003EDo not let your periapsis get lower than 70km (atmosphere), because you will fall back to Kerbin. If you had a good intersection (\u0026lt;= 1.0km), deorbiting won\u0027t be a problem, and you will be stopped relative to your target.\u003C/p\u003E\u003Cp\u003EIf you are quick and have a lot of fuel to spare, it is possible to deorbit and then reorbit with the target, and achieve the encounter, but it is not very efficient...\u003C/p\u003E\u003Cp\u003EIf you got problems:\u003C/p\u003E\u003Cp\u003EWhen you periapsis is as low as you\u0027ll allow it, stop the burn and do one of two things:\u003C/p\u003E\u003Cp\u003Ea) Burn towards the target, until you get another nice intersection on the map view;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Wait confortably for the next intersection;\u003C/p\u003E\u003Cp\u003EThen, repeat the killing-velocity procedure again, until you see the beautiful \u0022Target 0.0 m/s\u0022.\u003C/p\u003E\u003Cp\u003EFrom there, it is as simple as approaching the target with RCS (remember to break, and use time warp), and then you \u0022just\u0022 dock with your target! \u003C/p\u003E\u003Cp\u003ETo me, it is a matter of fiddling with my orbit and the intersections with the target, with small corrections, until I get the \u0022perfect\u0022 intersection, then I just kill my velocity and dock.\u003C/p\u003E\u003Cp\u003EWell, hope I have helped, sorry if I said incorrect stuff, and good docking!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-11T18:18:39Z\u0022 title=\u002208/11/2013 06:18  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 11, 2013\u003C/time\u003E by aarknevorious\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"CorruptDB","CreatedById":75308,"CreatedDateTime":"2013-08-12T20:54:14Z","Content":"\n\u003Cp\u003E@Alamo\u003C/p\u003E\u003Cp\u003EI think you are missing a step after step 7. Once you get to the intersect, since you are now close to the target your navball should change to target mode. It should also show your relative speed relative to the target. Put your nose on the retograde marker and burn until you get the velocity between you and your target to 0 m/s. Now, since we are close to the station and are going the same speed we should be in basically the same orbit, so you can point your nose straight at the target and thrust toward it. Keep your velocity low (1-2 m/s) and use warp if you want to get there faster. The prograde marker for the target should be near the target marker that you are thrusting toward. You want to make the prograde marker and the target marker to line up with each other, use the RCS translation keys (ijkl) to center the yellow prograde marker on the purple target marker. Once you get near the station kill your speed (by backthrusting with n) then use the normal rotate/translation keys to line up with the port and dock. Keep at it, I was very frustrated at first as well (matching orbits MANUALLY instead of using the above method) and I would always do the same as you, end up with the target passing by me at high velocity. By a) matching speeds (and thus orbits) with the target and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E using RCS translation to adjust my course when approching the target I was finally able to dock successfully. Once you have done it a few times it will become A LOT easier, so don\u0027t give up!\u003C/p\u003E\n"}]}