{"TopicId":42259,"ForumId":16,"TopicTitle":"Landing Gear","CreatedByName":"iueras","CreatedById":76413,"CreatedDateTime":"2013-08-13T01:15:37Z","PageNum":1,"Articles":[{"CreatedByName":"iueras","CreatedById":76413,"CreatedDateTime":"2013-08-13T01:15:37Z","Content":"\n\u003Cp\u003EI apologize if this has been answered before. I searched but couldn\u0027t find the answer.\u003C/p\u003E\u003Cp\u003EDoes raising/lowering your landing gear have any effect at all on the drag or aerodynamics (like making it pitch up or down) of a plane at the moment?\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-13T01:30:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022iueras\u0022 data-cite=\u0022iueras\u0022\u003E\u003Cdiv\u003EDoes raising/lowering your landing gear have any effect at all on the drag or aerodynamics (like making it pitch up or down) of a plane at the moment?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot from my experience, no. I\u0027ve flown SSTOs into orbit only to notice once up there that my gear was still down cause I was too stressed during takeoff to remember to raise them.\u003C/p\u003E\u003Cp\u003EBut rather than a definite no, I\u0027ll just say \u0027not in a significant enough manner\u0027.\u003C/p\u003E\n"},{"CreatedByName":"TheHengeProphet","CreatedById":14895,"CreatedDateTime":"2013-08-13T01:45:43Z","Content":"\n\u003Cp\u003ETo my knowledge, yes it does, and also, due to the mechanics of drag, it also affects the mass of your craft, as they have no mass when retracted. This is only for landing gear, and not landing legs.\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-13T01:56:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheHengeProphet\u0022 data-cite=\u0022TheHengeProphet\u0022\u003E\u003Cdiv\u003Eit also affects the mass of your craft, as they have no mass when retracted. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just tested it, there\u0027s no change in mass to the craft between deployed or retracted landing gear. I think you may be confusing it with the fact that they have a mass in the SPH/VAB and will there change your CoM, but as you launch they have no mass.\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-08-13T03:07:13Z","Content":"\n\u003Cp\u003EI tested it a while ago with an SSTO I built in 1.8, and given the tilting over I\u0027d say yes.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-08-13T04:41:46Z","Content":"\n\u003Cp\u003EFrom what I have read, the base KSP program it calculates them as drag or additional mass when they are down. Only for landing gear, not for legs. \u003C/p\u003E\u003Cp\u003EI tested in my KSP but I have the FAR mod on it, and it does make a difference.\u003C/p\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2013-08-13T08:55:12Z","Content":"\n\u003Cp\u003EI tested it and there\u0027s no big difference if it\u0027s down or up. The rocket flips around the same way any time. I tested it with the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Small_Gear_Bay\u0022 rel=\u0022external nofollow\u0022\u003Eairplane gear\u003C/a\u003E but I\u0027m sure it behaves the same with any other landing gear.\u003C/p\u003E\n"},{"CreatedByName":"iueras","CreatedById":76413,"CreatedDateTime":"2013-08-14T16:30:50Z","Content":"\n\u003Cp\u003EAlright thanks for the answers guys. I guess right now it doesn\u0027t make much if any difference so I\u0027ll go with that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ChevronTango","CreatedById":70939,"CreatedDateTime":"2013-08-14T16:46:35Z","Content":"\n\u003Cp\u003EHaving looked through the equations, there is no difference in drag in the slightest, its a fixed constant. Raising or lowering the gear does nothing to the flight in any way, so knowing this I always leave them down unless I\u0027m taking photos. The change in gear only starts the animation.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-08-14T16:54:50Z","Content":"\n\u003Cp\u003EI can\u0027t vouch for what the numbers say, but I can tell you what happens in flight. If you\u0027re flying along in a descent towards landing and you lower the landing gear, the airiplane will both slow down slightly and pitch down slightly. This is with stock air, not FAR.\u003C/p\u003E\n"},{"CreatedByName":"ChevronTango","CreatedById":70939,"CreatedDateTime":"2013-08-14T17:57:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ChevronTango\u0022 data-cite=\u0022ChevronTango\u0022\u003E\u003Cdiv\u003EHaving looked through the equations, there is no difference in drag in the slightest, its a fixed constant. Raising or lowering the gear does nothing to the flight in any way, so knowing this I always leave them down unless I\u0027m taking photos. The change in gear only starts the animation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI made a complete fool out of myself with this one. The drag of the landing gear jumps from 0.1 to 0.7 when comparing stowed to deployed.\u003C/p\u003E\n"},{"CreatedByName":"Dispatcher","CreatedById":78707,"CreatedDateTime":"2013-08-14T18:12:17Z","Content":"\n\u003Cp\u003EIts probably best to assume that it makes a difference, or probably will make a difference in a future KSP version. When I design craft, I try to design with probable future updates or refinements of the simulation. I can say that plane landing gear does have mass and/ or drag effects while flying; retracted or extended. You may test this by taking off without piloting. See how the plane behaves. Then in the SPH slide the forward gear either toward the front or toward the back a little. Then repeat the test. You should see a different behavior in the second test.\u003C/p\u003E\u003Cp\u003EYour results may vary.\u003C/p\u003E\u003Cp\u003EUpdate: I tested my Air Wasp plane (its in my package of \u0022self flying planes\u0022 at the Spaceport). Prior to the addition of ladders to the craft, when flying at 1/3 throttle, pilotless and without SAS or any autopilot, with gear retracted, it flames out and attains an altitude of somewhere near 24000 meters and then tends to partially recover until it finally crashes about 15 minutes into the flight. However, when I test it now with \u003Cstrong\u003Egear extended\u003C/strong\u003E, its maximum altitude is 18150 m, max speed is 545, and it flies for 50 minutes. After that it glides for another 10 minutes. It gets to about 300 meters altitude and speed of about 15 m/s, then due to the lack of forward momentum and lift, it dives the rest of the way; hitting water (in this case) at about 60 m/s, destroying the craft and killing my Kerbal. So landing gear does in practice affect flight. My Kerbal should have ejected. Hmmm. Wait. Someday?\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EI must say that when flying without piloting, there are probably random variables in KSP which may yield varying flight results, so I can\u0027t say for sure what elements have the most influence on variation between flights.\u003C/em\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-15T00:07:02Z\u0022 title=\u002208/15/2013 12:07  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 15, 2013\u003C/time\u003E by Dispatcher\u003C/strong\u003E\n\u003Cbr\u003EI forgot the bolded words. Added the italicized.\n\u003C/span\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-08-14T23:54:38Z","Content":"\n\u003Cp\u003EThe aircraft landing gear (as opposed to the folding landing legs) are massless (and therefore dragless) in flight, whether extended or retracted. Check the mass of a craft in flight (info button in the map screen) before adding landing gear. Then add a bunch of them, and check the mass again. Makes no difference in the stock game. FAR likely changes this.\u003C/p\u003E\u003Cp\u003EThey are good at doing their job of being landing gear though, so they do serve that function. Where you place them on a plane makes a difference to how much aerodynamic moment you need to lift off the runway, but it doesn\u0027t actually change the center of mass. The CoM indicator in the SPH lies. Only trust it before you put the landing gear on.\u003C/p\u003E\u003Cp\u003EAll of this may change in future versions, but as of 0.21 I\u0027m absolutely positive of this.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-08-15T00:02:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ChevronTango\u0022 data-cite=\u0022ChevronTango\u0022\u003E\u003Cdiv\u003EI made a complete fool out of myself with this one. The drag of the landing gear jumps from 0.1 to 0.7 when comparing stowed to deployed.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut the mass is zero. So the drag value won\u0027t make any difference.\u003C/p\u003E\n"},{"CreatedByName":"ChevronTango","CreatedById":70939,"CreatedDateTime":"2013-08-15T00:20:30Z","Content":"\n\u003Cp\u003ESo I\u0027m hoping someone else can shed more light on this than I have done so far. Near as I can tell their are two classes within Kerbal that implement the Landing Gear Behaviour, \u0022LandingGear\u0022 and \u0022ModuleLandingGear\u0022, the latter of which is the one employed by the gear in question. From what little I can read into it, the \u0022LandingGear\u0022 sets the drag values I stated before and implements them correctly, ie updating the values based on wether their stowed or deployed. It does this in the onPartFixedUpdate() method, and without testing it I can\u0027t be sure, but I\u0027m fairly certain the behaviour is correct. The ModuleLandingGear, which is relevant as its the one we are actually using, does not assign any values to the stowed and deployed drag properties of the class object by default, and looking through the part.cfg for landing gear, can\u0027t see an ovveride, so my assumption is these are left as null, and thus the debate on wether drag comes into this in any way arises. ModuleLandingGear does in fact update the drag values with the relevant ones in its Update() method, but I don\u0027t know for certain if that method is Ever called, and even if it were, with null\u0027s representing those variables no doubt headache\u0027s would ensue.\u003C/p\u003E\u003Cp\u003EIn Summary, I looked behind the curtain, and I\u0027m amazed Kerbal works at all sometimes. if your feeling daring try updating the landing gear\u0027s module to what I think is the correct one (LandingGear) and see if that makes a difference. I didn\u0027t see anything wrong with the mass, I\u0027m assuming that\u0027s all inherited nicely, but I\u0027ll need to look into that further and get back to you all to be absolutely sure.\u003C/p\u003E\u003Cp\u003EEdit: To Clarrify LandingGear extends the Part class directly, whilst ModuleLandingGear extends partModule, so you can\u0027t really swap them like I suggested, and they both have no relation to each other, other than being similarly named.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-15T00:27:22Z\u0022 title=\u002208/15/2013 12:27  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 15, 2013\u003C/time\u003E by ChevronTango\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ChevronTango","CreatedById":70939,"CreatedDateTime":"2013-08-15T15:52:34Z","Content":"\n\u003Cp\u003EI\u0027ve been studying this further. I did a quick experiment with a single rocket launched straight up, then again but with as many small landing gears strapped to it as I could get on it, both deployed and stowed, and each time I reached a max height of exactly 2353m. Draw your own conclusions about mass and drag.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img823.imageshack.us/img823/387/yhk4.jpg\u0022 alt=\u0022yhk4.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-08-15T16:06:21Z","Content":"\n\u003Cp\u003EThe old setup (from before I started playing) was that parts derived from Part. The new setup is that you use the default Part and add modules derived from PartNodule. So I bet the LandingGear is obsolete code, while ModuleLandingGear is current.\u003C/p\u003E\n"},{"CreatedByName":"iueras","CreatedById":76413,"CreatedDateTime":"2013-08-15T19:22:53Z","Content":"\n\u003Cp\u003EOk, now I am truly confused. LOL\u003C/p\u003E\u003Cp\u003EShould I attempt to account for the extra mass on the bottom of the plane in SPH when attempting to line up the CoT properly? I\u0027ve been putting one off stuff on top to try and balance the mass of 3 wheels on the bottom (i.e., RCS fuel, a single solar panel, radial mount battery, etc.).\u003C/p\u003E\u003Cp\u003EI will fly under the assumption that it does cause drag and should be stowed in flight. If it doesn\u0027t make a difference, I\u0027m not hurting anything, and if it does...\u003C/p\u003E\u003Cp\u003EThe main issue then is whether or not you should try to balance the mass of the wheels to line up your CoT (or try to use them to shift CoM forward or back like I have also done).\u003C/p\u003E\u003Cp\u003EEDIT: Chevron, could you launch that rocket one more time with all (but ONLY) the gears stripped off? That should settle the question of if it counts as 0 mass in flight for balancing purposes. If you don\u0027t want to let me know and I\u0027ll run an experiment myself, figured I\u0027d ask since you have the rocket and the baseline numbers already. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EEDIT 2: Never mind, I just reread your post. I misunderstood, on second reading it appears you DID launch it once without any gears on it. Thanks for that, and apparently they are indeed massless in flight. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-15T19:26:56Z\u0022 title=\u002208/15/2013 07:26  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 15, 2013\u003C/time\u003E by iueras\u003C/strong\u003E\n\u003Cbr\u003ECause I can\u0026#039;t read\n\u003C/span\u003E\n"},{"CreatedByName":"ChevronTango","CreatedById":70939,"CreatedDateTime":"2013-08-16T22:23:29Z","Content":"\n\u003Cp\u003EStrangely enough, I think I may have narrowed in on the exact cause of this little bug, so if any kerbal developers are watching please take a look at this.\u003C/p\u003E\u003Cp\u003EThe parts class, which almost all part use as base module either directly or as an extension module, uses a rigidbody property to set things like mass and drag and pass it on to the unity physics engine, however, for reasons beyond my understanding the parts module has a \u0022Rigidbody\u0022 property in addition to the \u0022rigidbody\u0022 property defined its its base class, namely the unity component class. For all parts these two distinct properties are in sync, ie the same, however for the landing gear they are out of sync, specifically the inherited component property \u0022rigidbody\u0022 is null, meaning the Part class has had to instantiate a new Rigidbody for its own use, and obviously this is not good. when they are in sync they\u0027re fine, however quite a few of the calculations, namely mass and drag, rely on this object, which is null. The precise reasons for this being null on the landing gear is as of yet unknown to me as my debugging of the kerbal source is very limited, but I\u0027m sure this may be of some interest to any developer working on the problem.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-16T22:27:32Z\u0022 title=\u002208/16/2013 10:27  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 16, 2013\u003C/time\u003E by ChevronTango\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-08-17T02:10:16Z","Content":"\n\u003Cp\u003ENice bug-tracking to figure out why this is. If the Squad folks see and fix this, can you please make them less than half a ton in mass? Many many people will complain about spaceplanes that used to work not working any more if this bug is fixed without any other simultaneous changes to the aerodynamics or jet/intake mechanics.\u003C/p\u003E\n"},{"CreatedByName":"ChevronTango","CreatedById":70939,"CreatedDateTime":"2013-08-17T15:58:52Z","Content":"\n\u003Cp\u003EI have actually fixed the problem now. It turns out that the reason for it not counting mass and drag, despite all the properties being present, was on Load it was told to discount any sort of physical presence of the landing gear, Intentionally. One rogue line of code was all it took to cause all this. Bright side, I can fix the problem easily with a small plugin, bad news, you\u0027ll need to alter the landing gears cfg with a couple extra lines so it uses the fix, not perfectly ideal really.\u003C/p\u003E\u003Cp\u003EThe attached plugin is the fixed class for landing gear. You\u0027ll need to go into the part cfg for small landing gear and change:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = ModuleLandingGear\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eto\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EMODULE\u003Cbr\u003E{\u003Cbr\u003E\tname = ModuleLandingGearFix\u003Cbr\u003E\tstowedDragMin = 0.1\u003Cbr\u003E\tstowedDragMax = 0.1\u003Cbr\u003E\tdeployedDragMin = 0.7\u003Cbr\u003E\tdeployedDragMax = 0.7\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003Eand then install the plugin. That should give landing gear drag and weight as needed. The only thing of note is that the mass of landing gear is 0.5 Tons, which is a lot, but that\u0027s not the problem I\u0027m trying to solve. Feel free to edit the cfg and reduce that if you so wish. It\u0027s made a lot of my planes suddenly very heavy.\u003C/p\u003E\u003Cp\u003Eplugin: \u003Ca href=\u0022http://www./download/oxzjx5uydph8f4c/ModuleLandingGearFix.dll\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/oxzjx5uydph8f4c/ModuleLandingGearFix.dll\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESource: \u003Ca href=\u0022http://www./view/3re8r5ncdb49npa/ModuleLandingGearFix.cs\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./view/3re8r5ncdb49npa/ModuleLandingGearFix.cs\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-17T17:31:17Z\u0022 title=\u002208/17/2013 05:31  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 17, 2013\u003C/time\u003E by ChevronTango\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pa1983","CreatedById":58328,"CreatedDateTime":"2013-08-17T18:47:23Z","Content":"\n\u003Cp\u003EInteresting thread. Im glad the landing gears dont have a weight because there to heavy any way. 100Kg at most considering there size would be suitable. I hope we get Medium and Heavy landing gears in the future.\u003C/p\u003E\n"},{"CreatedByName":"ChevronTango","CreatedById":70939,"CreatedDateTime":"2013-08-17T19:01:55Z","Content":"\n\u003Cp\u003EYou can just adjust the mass to your liking. The default one adds about 2 tons to most of my planes which coupled with the drag makes previously easily takeoffs much more hairy. It\u0027s rather fun actually. Deploying gear mid flight now gives a noticeable deceleration.\u003C/p\u003E\u003Cp\u003EHopefully next update might have this in along with more sensible mass values.\u003C/p\u003E\u003Cp\u003EEdit: Newly Discovered Problem, and perhaps the reason why physics for the landing gear was turned off in the first place, on landing or takeing off with larger aircraft the force on the wheels can be enough to break them. Solution: Turn up the crashTolerance, breakingForce, and breaking Torque.\u003C/p\u003E\u003Cp\u003Erevised and slightly more sensible \u003Ca href=\u0022http://www./download/k2ba1n8bm5qxh2n/part.cfg\u0022 rel=\u0022external nofollow\u0022\u003Epart.cfg\u003C/a\u003E for the smallgearbay\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-17T23:25:57Z\u0022 title=\u002208/17/2013 11:25  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 17, 2013\u003C/time\u003E by ChevronTango\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"iueras","CreatedById":76413,"CreatedDateTime":"2013-08-18T05:33:46Z","Content":"\n\u003Cp\u003EWow, thanks for the responses and effort here Chevron! Downloading that fix and .cfg now. I may lighten the gear some, though. I always felt it was too heavy, just from the amount of stuff I had to pile on top of a plane to balance 3 wheels in the SPH (not realizing that they were massless in flight).\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-08-18T05:45:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ChevronTango\u0022 data-cite=\u0022ChevronTango\u0022\u003E\u003Cdiv\u003EIt turns out that the reason for it not counting mass and drag, despite all the properties being present, was on Load it was told to discount any sort of physical presence of the landing gear, Intentionally. One rogue line of code was all it took to cause all this.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWas this PhysicsSignificance (like with the cubic and octo-struts), or something else? Nice work.\u003C/p\u003E\n"}]}