{"TopicId":42680,"ForumId":16,"TopicTitle":"How do I not use control engines (monopropellant powered) in a detachable craft?","CreatedByName":"Galactus","CreatedById":78644,"CreatedDateTime":"2013-08-16T00:06:34Z","PageNum":1,"Articles":[{"CreatedByName":"Galactus","CreatedById":78644,"CreatedDateTime":"2013-08-16T00:06:34Z","Content":"\n\u003Cp\u003EScenario:\u003C/p\u003E\u003Cp\u003E2 stage rocket with a \u0022moon lander\u0022 type craft at the top.\u003C/p\u003E\u003Cp\u003ESo I have control engines installed both on the rocket sections and on the lander, and I want to be able to use the ones hooked up to the rocket independently of those attached to the lander.\u003C/p\u003E\u003Cp\u003EHow do I go about doing this?\u003C/p\u003E\u003Cp\u003EThe craft is equipped with 2 command modules (an unmanned one attached to the top of the upper rocket stage, and one mk1 capsule hooked up to the lander); by default, on launch, control is granted from the mk1 (if I understand the GUI correctly... lol)\u003C/p\u003E\u003Cp\u003EThanks for your help!\u003C/p\u003E\u003Cp\u003E/e Thanks Johnno!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-16T00:27:04Z\u0022 title=\u002208/16/2013 12:27  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 16, 2013\u003C/time\u003E by Galactus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-16T00:24:27Z","Content":"\n\u003Cp\u003ERightclick the tank you want to turn off and click the little green arrow thingie next to the fuelgauge. When you want to use it again remember to retoggle it.\u003C/p\u003E\u003Cp\u003EUgh read too fast. Right click the RCS cluster - toggle that off. You can probly set it up to action groups too.\u003C/p\u003E\u003Cp\u003EEdit 2: when in doubt, right click.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-08-16T00:27:09Z","Content":"\n\u003Cp\u003EYou can set up an action group to deactivate and reactivate them. Do note that you will have to disable the RCS tank in the lander or it\u0027s fuel may be used up by the launch vehicle first. Do so by right clicking on the fuel tank and click the green triangle to get a no symbol. With the lander tank disabled, the lander thrusters can still use fuel from the launch vehicle tank until it is detached.\u003C/p\u003E\n"}]}