{"TopicId":4305,"ForumId":16,"TopicTitle":"Large rockets are unstable, even with SAS/RCS","CreatedByName":"NoXion","CreatedById":7454,"CreatedDateTime":"2011-12-04T02:50:07Z","PageNum":1,"Articles":[{"CreatedByName":"NoXion","CreatedById":7454,"CreatedDateTime":"2011-12-04T02:50:07Z","Content":"\n\u003Cp\u003EA lot of the time when I build large rockets they have a tendency to start veering off course soon after launch, even with RCS and multiple SAS units - if I leave the damn things off, it happens even faster. Once they start tipping over, \u0027falling off their tail\u0027 so to speak, it\\\u0027s nearly impossible to recover them, even if I switch off SAS and manually use RCS to attempt to right them. I suspect that piling on the SAS units and RCS thrusters may help, but I\\\u0027m looking for more technically elegant solutions since it seems to be the consequence of something I\\\u0027m missing. After all, my rockets are always symmetrical, so do they tip over?\u003C/p\u003E\u003Cp\u003EAdvice is appreciated.\u003C/p\u003E\n"},{"CreatedByName":"Hypocee","CreatedById":8609,"CreatedDateTime":"2011-12-04T07:11:03Z","Content":"\n\u003Cp\u003EWell, a certain degree of that is supposed to happen - it\\\u0027s the challenge of the game right now, and you can have a perfectly good craft that becomes differently stable after it leaves a narrow angle of attack band - but there are a few things you might not have considered.\u003C/p\u003E\u003Cp\u003E1. If it\\\u0027s soon after launch, especially if it involves SRB half-stages, you may be looking at harmonics from \u0027bananaing\u0027 or SRB twist. SRBs on decouplers especially love to twist, but everything bends a little. Look into struts and never ever put winglets on anything radially mounted.\u003C/p\u003E\u003Cp\u003E2. Rather counterintuitively, if you want a rocket to be stable in atmosphere you put mass toward the front, or equivalently keep it away from the back. Where\\\u0027s the heavy part of an arrow? Where\\\u0027s the aerodynamic drag? Longer, narrower stacks beat squatter stacks at this.\u003C/p\u003E\u003Cp\u003E3. As you burn liquid fuel, it drains from the top down. Your mass decreases...and shifts toward the back. Muahahaha. A design can flip into instability as it burns.\u003C/p\u003E\u003Cp\u003E4. You may simply be turning too soon. Going as straight up as possible minimizes the forces produced by instability, possibly delaying it until mass has decreased further or drag becomes less dangerous.\u003C/p\u003E\u003Cp\u003E5. Steerable winglets are powerful in low atmo, and gimbaled engines are powerful everywhere.\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-12-04T09:56:42Z","Content":"\n\u003Cp\u003EI\\\u0027ve had various problems building large rockets to be stable with and without asas. Honestly, throwing asas and lots of RCS/winglets/gimballing engines at the problem can make the problem *worse* - too much correction can quite literally snap your rocket in half, or worse, destablize your rocket and flip it upside down faster by overcorrection.\u003C/p\u003E\u003Cp\u003ESome things to remember that I\\\u0027ve noted about the various control methods: \u003C/p\u003E\u003Cp\u003E1. RCS jets are constant, never change their correction speed, and so are the most reliable but use their own fuel source. Best way of correcting a wacky rocket when nothing else works IMO, but I try not to rely on them during launch with the asas enabled since the RCS fuel is much more useful for turning the ship under manual control.\u003C/p\u003E\u003Cp\u003E2. Winglets are constantly inconsistent and only work in atmosphere. Their inconsistency primarily comes from the variances of altitude and speed you encounter in flight. The slower or higher you go, the less counteraction they have - and vice versa. At very high altitudes you will not get much, if any, correction from them so it\\\u0027s useless to have them on higher stages. In lower altitude at high speed their deflection force can be so powerful as to unexpectedly destabilize a large ship with asas enabled. For an example, if you have a very large and powerful first stage of srb\\\u0027s that gets you up to 150m/s in low altitude, your winglets are going to have a *ton* of deflection force... which will suddenly and unexpectedly go away when you stage and your speed cuts out. Typically I drop the first stage and the second only has the ability straight off the bat to keep around 80m/s... which means the winglets lose a lot of their deflection force, and the asas winds up flipping over the ship due to control loss. Whoops. I tend not to rely on these at all due to their disadvantages.\u003C/p\u003E\u003Cp\u003E3. gimballing engines Of all of these, this tends to be the one I use for doing attitude control with the asas from launch to orbit, but the use of them is tricky. It\\\u0027s best not to have too many of them on a large stage, since they\\\u0027ll all try to assist turning the ship at the same time. On my ship with nine engines, having them *all* attempting to adjust the attitude caused the stage to explode from the engines colliding. Instead, it was sufficient to have the centermost engine with gimballing only with the other 8 normal nongimballing. Gimballing engines will help stablize your ship\\\u0027s attitude, but will not help with roll - so you\\\u0027ll still need something to counteract that, like rcs if that\\\u0027s a problem with your design. Otherwise like RCS jets, they are constantly consistent and will help you turn your ship - with the exception that your engines must be firing for them to do anything. Two gotchas you might not expect: Compared with the nongimballing engines, they\\\u0027re slightly less powerful and use slightly less fuel. This typically means that the other engines will lift more weight, but use more fuel, which means if you mix the two types as I did with my design you may have problems. On my ship, the outer ring of 8 engines runs out of fuel while the centermost engine still has 2/3 of a tank to go. Not a problem with that ship per se since it\\\u0027s already in orbit by that point - but I could see a multistage design having problems with this earlier in flight.\u003C/p\u003E\u003Cp\u003EBesides that, I\\\u0027ve found a lot of the problems with my designs tend to be related to the placement and usage of struts. Putting struts anywhere on the ship in an asymetrical fashion is just asking for trouble; a lot of slow roll and turn problems I\\\u0027ve discovered have been due to very small inconsistencies in my strut placements. Try to always use the symmetry tool when placing them - even better, try to use as few as possible. On my large mun rocket design, I wound up redesigning the strut placement recently. On the second stage which has nine lfe\\\u0027s and something like 52 lft\\\u0027s, on the lowest set of lft\\\u0027s I attached from the centermost lft in quad symmetry mode to four of the outer tanks, then I did it again from the center to the last four.\u003C/p\u003E\u003Cp\u003EIt wound up looking something like this if you looked at it from the top of the ship down:\u003C/p\u003E\u003Cp\u003Eo o o\u003C/p\u003E\u003Cp\u003E\\ | /\u003C/p\u003E\u003Cp\u003Eo-o-o\u003C/p\u003E\u003Cp\u003E/ | \\\u003C/p\u003E\u003Cp\u003Eo o o\u003C/p\u003E\u003Cp\u003EBy doing this I was able to remove several struts, since I\\\u0027d been connecting the outermost tanks to themselves on the outside, then connecting four of the outermost tanks to the inner one. This not only sped up the game slightly, but since I was able to use the symmetry tool to place them, the ship had less roll problems.\u003C/p\u003E\u003Cp\u003EBiggest thing I ever did for myself though was to start with a simple rocket with one stage, launch it, make adjustments - and go from there. Every time you add a stage or new equipment, I suggest launching it before adding the next stage and making it more complicated - fixing a problem is a lot simpler when you know where it came from after all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2011-12-04T10:01:24Z","Content":"\n\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/dXA7siVBFyE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EBut yea. The unstability issue is the reason why my Standard Launch Vehicle is only using 1.75m parts. (I only use large rockets for special missions)\u003C/p\u003E\u003Cp\u003E2m parts are still bearable with, though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-12-04T10:10:02Z","Content":"\n\u003Cp\u003Emore like this:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/ss7KKSP91JA?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EThis is the ship pre strut changes. As you can see, even prior to the minor change I made, it\\\u0027s easily flown to the mun and back. It was made mostly with stock parts. This version of the ship is available here if you want an example to work with:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=3392.msg45384#msg45384\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=3392.msg45384#msg45384\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELet me know if you\\\u0027re interested in the revised design, it\\\u0027s not much of a difference but may give you insight into how the struts can change flight dynamics.\u003C/p\u003E\u003Cp\u003EEDIT: Decided to post my updated design since I have changed a few things to it, take a look comparing the previous version vs this to see how to reduce strut use without compromising stability\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/forum/index.php?topic=3392.msg54654#msg54654\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/index.php?topic=3392.msg54654#msg54654\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Saaur","CreatedById":4298,"CreatedDateTime":"2011-12-05T20:56:14Z","Content":"\n\u003Cp\u003EI love fins. I use like 12 of them on my bottom stage (with no gimballing engines or RCS) to keep me stable in the thick atmo.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/1.png\u0022 alt=\u00221.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETakeoff with SAS and 100% throttle\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/2.png\u0022 alt=\u00222.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThrottle back to 2/3 once the main engine starts to overheat.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/3.png\u0022 alt=\u00223.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EScrewed up the staging so the payload fairing separated at the same time as Stage One dropped. Oh well, still shows the single gimballing engine that moves Stage Two. I leave the RCS off at this point even though it\\\u0027s now expseod. It works better in vacuum anyway..\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/4.png\u0022 alt=\u00224.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EStage Two gets me into a nice stable orbit with a little fuel leftover to extend apoapsis toward the mun.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/5.png\u0022 alt=\u00225.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe \u0027satellite\u0027 is a cleverly disguised fuel tank with nobbly bits to make it look cool. So why not use it to boost for munar injection?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/6.png\u0022 alt=\u00226.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENice circular (and low) munar orbit. This was achieved by using the RCS jets on the lander module to fine-tune my orbital velocity.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/7.png\u0022 alt=\u00227.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ETime to leave the satellite in orbit and get down to the surface.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/8.png\u0022 alt=\u00228.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESat around for a while scanning the skies for my satellite, but never saw it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022https://dl.dropbox.com/u/13297749/Golf%20Mission/9.png\u0022 alt=\u00229.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo I went home.\u003C/p\u003E\u003Cp\u003EAll parts are from Silisko Edition.\u003C/p\u003E\n"},{"CreatedByName":"Ivan Ivanovich","CreatedById":8977,"CreatedDateTime":"2011-12-06T17:28:36Z","Content":"\n\u003Cp\u003ETo be honest, I never had that problem. ASAS and a few fins work great in the lower atmospheres, and in the upper atmospheres I have already a fairly tiny ship that isn\\\u0027t prone to random movements and attitude problems.\u003C/p\u003E\u003Cp\u003EWhat I did notice, though, is that the stock parts are by some margin more stable than the mods. From fuel tanks to engines, nothing performs as well as the stock things. Maybe for their lower power and the lower speeds you can attain, I am not sure about that, but I had rockets that became uncontrollable in orbit (like, say, being stuck \u0027nose down\u0027 for some odd reason, with no chance to turn it towards the direction I wanted it to) only with non-stock parts.\u003C/p\u003E\n"},{"CreatedByName":"Tim_Barrett","CreatedById":3206,"CreatedDateTime":"2011-12-06T22:49:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETo be honest, I never had that problem. ASAS and a few fins work great in the lower atmospheres, and in the upper atmospheres I have already a fairly tiny ship that isn\\\u0027t prone to random movements and attitude problems.\u003C/p\u003E\u003Cp\u003EWhat I did notice, though, is that the stock parts are by some margin more stable than the mods. From fuel tanks to engines, nothing performs as well as the stock things. Maybe for their lower power and the lower speeds you can attain, I am not sure about that, but I had rockets that became uncontrollable in orbit (like, say, being stuck \u0027nose down\u0027 for some odd reason, with no chance to turn it towards the direction I wanted it to) only with non-stock parts.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame here. Even for big rockets, I prefer a non-gimballing but winglet-enabled first stage, because it has an excellent stability value. Even wings themselves are pretty effective after the main part of the atmosphere, as long as you have some time, not like you would make a sharp velocity change in the atmosphere anyway (unless it is some sort of high-flying aircraft. And when they stop becoming effective, my next main stage is usually gimballed and even that works just fine, without RCS.\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-12-07T05:45:46Z","Content":"\n\u003Cp\u003EHm, seems the jury\\\u0027s still out on winglets then - maybe I\\\u0027m just incompetent at using them! ;P Since I didn\\\u0027t say it before I *do* tend to make my supermassive ships using the stock parts, so likely if they are more stable than mod ones, that could be one reason why I\\\u0027m able to do the things I am without things asploding everywhere.\u003C/p\u003E\n"},{"CreatedByName":"Cinon","CreatedById":10555,"CreatedDateTime":"2011-12-14T23:02:33Z","Content":"\n\u003Cp\u003EAre you putting winglets on an upper, light stage?\u003C/p\u003E\u003Cp\u003EIf you do, it will make your rocket massively unstable.\u003C/p\u003E\u003Cp\u003ENo matter how big the rocket is, you should be able to keep it stable using 1 Advanced SAS with 3 AV-R8 Winglets as far to the bottom as possible.\u003C/p\u003E\u003Cp\u003EIf you use gimballing engines, you shouldn\\\u0027t even need winglets.\u003C/p\u003E\u003Cp\u003EBtw don\\\u0027t forget that winglets have the massive benefit of providing lift.\u003C/p\u003E\n"},{"CreatedByName":"Hikaru","CreatedById":9643,"CreatedDateTime":"2011-12-15T09:01:52Z","Content":"\n\u003Cp\u003EThree huh? Always tried using symmetry vs all the parts I had connected, on my current rocket that\\\u0027s six. Which, um, asplodes when I try it - next time I load up the game I\\\u0027ll try using three, or maybe even two.\u003C/p\u003E\n"},{"CreatedByName":"Aynrayne","CreatedById":12158,"CreatedDateTime":"2011-12-15T12:45:24Z","Content":"\n\u003Cp\u003EPutting winglets near the bottom in groups of 3 (on the second to last and last stages) is usually the easiest way to guarantee stability, but it may still be a problem on imbalanced rockets, if you are using multiple winglets, multiple SAS and RCS modules and your ship is still imbalanced, you may need to consider redesigning it.\u003C/p\u003E\n"}]}