{"TopicId":43095,"ForumId":16,"TopicTitle":"Uneven fuel ducting when feeding from one tank","CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2013-08-19T11:18:38Z","PageNum":1,"Articles":[{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2013-08-19T11:18:38Z","Content":"\n\u003Cp\u003EThis *might* be a mini bug but I\u0027m assuming my naivety of gameplay mechanics for now.\u003C/p\u003E\u003Cp\u003EImagine an asparagus setup as shown (excellently I might add) in the wiki:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/thumb/e/e7/Asparagus-staging.svg/100px-Asparagus-staging.svg.png\u0022 alt=\u0022100px-Asparagus-staging.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ES1 is a Rockomax X200-32 (1440 capacity) fuel tank with a mainsail engine beneath it.\u003C/p\u003E\u003Cp\u003ES2-S4 are all Rockomax Jumbo (orange) fuel tanks with skipper engines beneath them.\u003C/p\u003E\u003Cp\u003EFuel ducting exactly as described in the above image and everything works just fine.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWorks fine\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ENow add directly above S1 a payload, comprising of:\u003C/p\u003E\u003Cp\u003EWide stack decoupler (not fuel crossfeed capable)\u003C/p\u003E\u003Cp\u003ERockomax Jumbo (orange) fuel tank\u003C/p\u003E\u003Cp\u003EProbe core of your choice.\u003C/p\u003E\u003Cp\u003EThis also works exactly as expected, with the payload jumbo fuel tank left unmolested by virtue of the non-crossfeed capable stack decoupler.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWorks wonky\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ENow assume you\u0027re happy to use that payload fuel to achieve orbit, you want to get a fuel can into space but you\u0027re happy if it\u0027s an empty fuel can. (first discovered this issue when launching a space station fuel depot module - have simplified the model to test the issue).\u003C/p\u003E\u003Cp\u003ESo you run a pair of fuel ducts from the payload jumbo tank to the two jumbo tanks in S4.\u003C/p\u003E\u003Cp\u003EI expected fuel to first drain from the payload can evenly into the pair of S4 tanks, then when the payload can was empty the S4 pair would start to empty.\u003C/p\u003E\u003Cp\u003EIn reality what happens is that fuel does indeed drain from the payload can, and \u003Cstrong\u003Eone\u003C/strong\u003E of the S4 pair remains full whilst the payload can is draining. The other can in the S4 pair however slowly drains from launch. \u003C/p\u003E\u003Cp\u003ENet result is that one of the S4 pair runs out of fuel a few seconds before the other one - resulting in a rocket fuelled acrobatic ballet which, if adopted by the Bolshoi, would encourage \u003Cstrong\u003Ea lot\u003C/strong\u003E more people to see Swan Lake.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMaybe solution\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ECuriously, feeding the pair of fuel ducts into the S3 pair rather than the S4 pair seems to work ok (though still perhaps slightly out as a twitch upon running dry suggests a minor imbalance). In this setup fuel drains apparently evenly from the payload tank and both the S4 pair such that all three appear to run out at almost exactly the same time; the S3 pair remain topped up and untouched until the S4 pair runs dry (and are subsequently jettisoned).\u003C/p\u003E\u003Cp\u003EIn terms of absolute efficiency this solution \u003Cem\u003Emight\u003C/em\u003E not be optimal as the payload mass is at it\u0027s lightest just as you jettison two engines (and 1300kn of thrust) rather than before, but it\u0027s probably good enough for Kerbal rocket science.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-19T14:30:38Z\u0022 title=\u002208/19/2013 02:30  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 19, 2013\u003C/time\u003E by MiniMatt\u003C/strong\u003E\n\u003Cbr\u003E\u0026#039;twas a bug/issue/feature\n\u003C/span\u003E\n"},{"CreatedByName":"lewille","CreatedById":76348,"CreatedDateTime":"2013-08-19T12:17:11Z","Content":"\n\u003Cp\u003EMy guess is that you have the top tank not completely attached to the bottom one. Thus the fuel is not transfering properly.\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2013-08-19T13:40:35Z","Content":"\n\u003Cp\u003EHiyas,\u003C/p\u003E\u003Cp\u003EUnfortunately doesn\u0027t appear to be the case as tested through numerous iterations. Have just simplified the test further and there is some definite weirdness when ducting a single tank into dual tanks which ultimately duct back into a single tank.\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EEDIT:\u003C/em\u003E sorted screenshot (hopefully below)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/SlkzyM6\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/SlkzyM6l.jpg\u0022 alt=\u0022SlkzyM6l.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003Eclick to enbiggen, useful for seeing direction of fuel lines\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAbove link should show the simplest rocket I can devise to illustrate the problem. Take any probe core/control can; beneath that place any fuel tank and beneath that a stack decoupler. Beneath the stack decoupler place another fuel can and beneath that any engine. Either side of this lower fuel can place a pair of fuel cans on radial decouplers and beneath each of those cans a pair of engines. Take fuel lines \u003Cem\u003Efrom\u003C/em\u003E the pair of radial cans \u003Cem\u003Einto\u003C/em\u003E the lower centre can. Take another pair of fuel lines \u003Cem\u003Efrom\u003C/em\u003E the upper centre can feeding \u003Cem\u003Einto\u003C/em\u003E the radial cans.\u003C/p\u003E\u003Cp\u003ENet result is that one of the radial cans will remain topped up whilst the upper can drains whilst the other radial can will drain at maybe a quarter the speed one would normally expect were it not being (partially) fed from the upper can. The radial pair therefore run out of fuel at different times.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-19T14:08:02Z\u0022 title=\u002208/19/2013 02:08  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 19, 2013\u003C/time\u003E by MiniMatt\u003C/strong\u003E\n\u003Cbr\u003Escreenshotified\n\u003C/span\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-08-19T13:45:06Z","Content":"\n\u003Cp\u003EI\u0027d say file a bug report, with screenshot attached.\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2013-08-19T14:28:03Z","Content":"\n\u003Cp\u003EYep a little more testing has revealed the key problem.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe centre engine has two equal cost paths available to it to reach it\u0027s furthest fuel tank.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIf you remove the two radial engines from the above screenshotted craft, leaving only the centre engine, then the problem is still apparent. However if you remove only the centre engine, leaving only the two radial engines then fuel flow is exactly as expected - ie. the uppermost payload tank drains first with the two radial tanks staying completely topped up until this upper tank is dry. These radial engines have only one path available to them to reach their furthest fuel source whereas the central engine can take either the left or the right path to reach it\u0027s furthest fuel source and both paths are equal cost.\u003C/p\u003E\u003Cp\u003EDoesn\u0027t quite explain why the partial workaround in the original post seems to work but it may come in useful should anyone else stumble across the same problem.\u003C/p\u003E\u003Cp\u003EWill mark as answered and file a bug report as you suggest.\u003C/p\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-08-19T14:31:51Z","Content":"\n\u003Cp\u003EThis is a well known issue, you\u0027ve basically broken the fuel logic going from center stack out to radials, then back into the center stack, creating a loop. Loops tend to break the logic and should be avoided. Once you go out from the centerstack you shouldn\u0027t go back in, if you want to empty that tank you can bleed off the fuel with engines before launch. Alternatively just create a fuel connection straight down, instead of going out to the radials.\u003C/p\u003E\u003Cp\u003ENo need for a bug report I think, it\u0027s been reported (and discussed) plenty of times.\u003C/p\u003E\n"},{"CreatedByName":"shand","CreatedById":57781,"CreatedDateTime":"2013-08-19T14:40:29Z","Content":"\n\u003Cp\u003Ethe problem is in the fuel algorithm \u003C/p\u003E\u003Cp\u003Ebasically speaking (i hope) the fuel drain (rocket) asks the attached fuel tank for fuel. the tank then checks if it can get fuel, if it can it asks the next tank \u0022up\u0022 the chain, if it cant it delivers it. this continues all the way up the chain. however, it is blocked if the fuel source has already been asked by this fuel drain - this is specifically there to prevent looping calculations.\u003C/p\u003E\u003Cp\u003Ethis explains one to one behaviour.\u003C/p\u003E\u003Cp\u003Ewhen there are two potential sources they are both querried for equal proportions. IE, they drain at the same rate. the querries are handled in series. so the A branch will continue til conclusion and then the B branch will run. in completely seperate systems (the asparagus staging you show) this works absolutely fine, because each side branch is independent of the other branches.\u003C/p\u003E\u003Cp\u003EThe problem comes when you want ONE tank to be source to MANY tanks that feed to ONE drain. (one to many to one).\u003C/p\u003E\u003Cp\u003EIn this case the drain querries the inital tank (one) who splits the drain between the 2 (many) side tanks. this then progresses to the payload (one) tank. this is querried by branch A and provides the requested fuel. B branch then runs, but when it reaches the payload tank it requests from the payload tank - the payload tank denies the request as it has already had this discussion regarding the fuel drain with branch A. Branch B gets offended, but pressure from the fuel drain means it reluctantly supplies fuel from its highest tank up the chain.\u003C/p\u003E\u003Cp\u003EThis leads to the payload tank draining AND the next highest tank in branch B.\u003C/p\u003E\u003Cp\u003EThis isnt a \u0022bug\u0022 so much as a side effect of a feature. one the Devs are aware of and no satisfactory solution is currently available. \u003C/p\u003E\u003Cp\u003EI hope this helps your understanding of the fuel flow \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E to get the desired effect i would suggest EITHER splitting the payload tank in half (and routing the fuel from each to one branch only) OR routing the payload tank to the central tank.\u003C/p\u003E\u003Cp\u003EKey rules of KSP fuel:\u003C/p\u003E\u003Cp\u003EONE to MANY : Good\u003C/p\u003E\u003Cp\u003EMANY to ONE : Good\u003C/p\u003E\u003Cp\u003EONE to ONE: lovely\u003C/p\u003E\u003Cp\u003EONE to MANY to ONE: BAD\u003C/p\u003E\u003Cp\u003EMANY to ONE to MANY: BAD.\u003C/p\u003E\u003Cp\u003EPS: the inital solution of moving the payload tank further down the chain works because it halfs the draw on it, that halfs the disbalance - hopefully if you followed the above it will make sense why that is so \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2013-08-19T15:06:59Z","Content":"\n\u003Cp\u003EYep a bit of searching (*cough* what I should have done first *cough*) suggests at least one official bug report at \u003Ca href=\u0022http://bugs.kerbalspaceprogram.com/issues/991\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://bugs.kerbalspaceprogram.com/issues/991\u003C/a\u003E so I won\u0027t duplicate.\u003C/p\u003E\u003Cp\u003EShand your explanation makes perfect sense, I figured late in the day that the problem must lie in parsing in series on each update.\u003C/p\u003E\u003Cp\u003EAs a network tech by trade I\u0027d suggest the problem might be tackled by calculating fuel paths on initialisation rather than each update via something like a \u003Ca href=\u0022https://en.wikipedia.org/wiki/Spanning_Tree_Protocol\u0022 rel=\u0022external nofollow\u0022\u003Espanning-tree algorithm\u003C/a\u003E, but my programming skills leave something to be desired and my knowledge of their KSP code is non-existent so I\u0027m certainly not about to suggest there may be some easy fix.\u003C/p\u003E\u003Cp\u003EThe workarounds you suggest work perfectly, and more importantly I now understand \u003Cstrong\u003Ewhy\u003C/strong\u003E they work perfectly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2013-08-20T11:47:06Z","Content":"\n\u003Cp\u003EWhen you have fuel ducted out of a tank and back into it, the only thing you can be sure of is that the fuel is accessible from any point on the series. I only use that kind of setup when fuel weight balance won\u0027t be an issue.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-08-20T14:34:41Z","Content":"\n\u003Cp\u003EThere is a mod that will let you do something you wouldnt be able to do by hand (that fast and evenly).\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/25823-0-21-1-TAC-Fuel-Balancer-25Jul\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/25823-0-21-1-TAC-Fuel-Balancer-25Jul\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou can set the payload tank to \u0022balance out\u0022 so it refuels ANY tank of the craft - like you could do by yourself with ALT-right-click, but not in the required perfect manner - it is one of the rare occasions I might concur to saying a certain mod does at least have a slightly cheaty game-simplifying option/possibility - but in this case it would be more like a workaround I think.\u003C/p\u003E\u003Cp\u003EIt can also be used to refuel all cans and tanks of a multipart ship at a refueling station - which would just save time and lots of clicking and rotating.\u003C/p\u003E\n"}]}