{"TopicId":45020,"ForumId":16,"TopicTitle":"A ship gets ripped apart while over 10km away from the active vessel","CreatedByName":"M4ck","CreatedById":74138,"CreatedDateTime":"2013-09-05T12:40:03Z","PageNum":1,"Articles":[{"CreatedByName":"M4ck","CreatedById":74138,"CreatedDateTime":"2013-09-05T12:40:03Z","Content":"\n\u003Cp\u003EI am most definitely not playing a stock only game, but maybe someone will have an idea what is wrong/how can I stop this.\u003C/p\u003E\u003Cp\u003EI have three ships orbiting a moon close to each other, separated by around 900m. One is a heavy, spread-out(is that the word?) space station, one is a tiny probe and one is a ship I try to deorbit. Each time I load the game and go to the ship I want to deorbit, a minute or so after doing the burn, the station rips itself to small pieces, one part(I have no idea which) even gets thrown at over 5km/s relative to everything else. I know, this can be caused by some parts clipping, etc.\u003C/p\u003E\u003Cp\u003EThe problem here is, this happens when both other ships are about 13km away from the active vessel. I haven\u0027t ever used the Lazor mod(I\u0027ve heard it can be used to mess with the draw/physics range). Crafts in my game load properly at 2.1km distance, there usually is a long pause before they are loaded, there is another tiny pause at 200m(and things like struts appear then, I have no idea what exactly happens then. but SOMETHING does). If the crafts are way over 2km away from my active ship, shouldn\u0027t they be put back \u0022on rails\u0022? One second I see two regular markers for vessels nearby, but out of draw distance, the next - a huge field of debris.\u003C/p\u003E\u003Cp\u003EBy the way, one time some part from the ripped station actually hit the probe, obliterating it as well(the probe was manned, the pilot got killed - everything was in the flight log). How can this happen out of physics range?!\u003C/p\u003E\u003Cp\u003EEdit: somehow, I still don\u0027t know how, the problem fixed itself this time... But I would still like to know how to do this. The probe is marked as a Base(I think; it shows that fancy light blue marker), and the obliterated station, a ship(regular grey marker). So far, they were both visible all the time, but the distance to the station disappeared after a while, while the probe(\u0022Base\u0022) was still shown until it got about 35km away, at this point only the markers were visible. The one time things didn\u0027t go kaboom, both distances were visible until 35km or so. I honestly have no idea what happened here and how to use it again if it is ever needed...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-07T07:47:25Z\u0022 title=\u002209/07/2013 07:47  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 7, 2013\u003C/time\u003E by M4ck\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dweeb of Kerbin","CreatedById":66678,"CreatedDateTime":"2013-09-07T07:41:45Z","Content":"\n\u003Cp\u003EI have had this happen, though Not often and I don\u0027t know for sure what causes it. In my experience, ships that are \u0022wobbly\u0022 due to lots of docking ports and uneven mass are most prone to this. Also, every time I have had this happen it has been with a ship that was initially within draw distance but was moving out into the 10-15km range. I agree that if ships go on rails at 2k this does not make any sense, but what it often SEEMS like to me is that as the wobbly ship moves further away, something in the calculation gets simplified, leading to bigger wobbles and disaster. I\u0027ve only had one ship that demonstrated this in a somewhat repeatable manner and I would need to time warp it out to a safe distance to prevent the spontaneous combustion.\u003C/p\u003E\n"}]}