{"TopicId":45735,"ForumId":16,"TopicTitle":"VAB building convention / practical application practice - Some component questions","CreatedByName":"I_do_robots","CreatedById":80480,"CreatedDateTime":"2013-09-12T16:45:20Z","PageNum":1,"Articles":[{"CreatedByName":"I_do_robots","CreatedById":80480,"CreatedDateTime":"2013-09-12T16:45:20Z","Content":"\n\u003Cp\u003EI am using mods from KW Rocketry and one for Space Station parts, along with stock items. I guess these are questions of build practice.\u003C/p\u003E\u003Cp\u003EI am attempting to lift a large but simplistic (Space station) center 4 way hub using one of the cube, 6 way docking port adapters as the center piece. I have a tapered adapter at the top and bottom (The hub cap looking convex plates in the \u0022Structural\u0022 menu (Stock item) inversely mounted, which takes the diameter at both ends out to 2.5 meters. Between the four remaining side ports, attached to the lips of the \u0022hub caps\u0022, I crisscrossed some heavy wire, joining the ends above the center of the adjacent port \u0022holes\u0022 and one vertical piece centered between the same \u0022Portals\u0022 to hold the whole assembly together or at least strengthen the joint, like big \u0022X\u0022s. At the top and bottom of these tapers, I want to mount a 3.75 M (Short) standard KW rocketry body piece. To the four ports I put habitation modules (1 each), wired back to the skin of the two 3.75 meter body sections above and below as well as stringers between the ends of the four habitation modules at the sides, strengthening everything in a \u0022Load sharing\u0022 method. \u003C/p\u003E\u003Cp\u003EThat\u0027s all for a single lift...I have a minimum of components, using the 2 sections already lofted to deal with all the sensors, electronics, solar sails, battery banks, SAS and RCS (Other than to manage the lift and docking maneuvers, maybe one SAS ring and some RCS for that sake, but it\u0027s minimal by design...The only small items are the Lazor system sensors at the docking ports.\u003C/p\u003E\u003Cp\u003ESince the 3.75 meter sections are from the Structural menu, would these not be considered crew capable for internal passage to other \u0022Habitable\u0022 areas?\u003C/p\u003E\u003Cp\u003EIf these are meant to be internal crew \u0022working\u0022 or \u0022Pass through\u0022 spaces, sans EVA, that\u0027s not really a rocket-building convention / best practice approach to it, is that right?\u003C/p\u003E\u003Cp\u003EI just like a bit of realism to what I\u0027m building...I guess if it\u0027s no more than a blank hull piece, it can\u0027t be considered \u0022Crew passable\u0022 despite that it is FUEL CROSSOVER compatible...Is that sound, logical reasoning?\u003C/p\u003E\u003Cp\u003EDoes that make sense in the context of practical application of components as We...People...would think into building an actual space craft?\u003C/p\u003E\u003Cp\u003EOr, am I thinking way to much into it and it really doesn\u0027t matter because I am free to assume it COULD work that way because the RPG side \u003C/p\u003E\u003Cp\u003E\u0026gt; Eye roll \u0026lt; of games says I can do whatever I want...Sigh?\u003C/p\u003E\u003Cp\u003EThanks for a helping hand with it...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-13T14:58:14Z\u0022 title=\u002209/13/2013 02:58  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 13, 2013\u003C/time\u003E by I_do_robots\u003C/strong\u003E\n\u003Cbr\u003EANSWERED\n\u003C/span\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-09-12T17:22:53Z","Content":"\n\u003Cp\u003EAt the moment it\u0027s a bit of a moot point as far as the actual game mechanics work, since outside of mods, the only way you can move personnel from one module to another is via EVA. There aren\u0027t any crew-travel-capable parts in the game.\u003C/p\u003E\u003Cp\u003E\u0022Fuel crossfeed capable\u0022 just means that (it\u0027s implied that) there\u0027s some sort of piping inside the part that allows fuel to flow through it (which really only applies to liquid fuel-burning engines anyway; RCS monopropellant and battery / panel electricity sort of work like magic right now).\u003C/p\u003E\n"},{"CreatedByName":"DerekL1963","CreatedById":57091,"CreatedDateTime":"2013-09-12T18:29:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022I_do_robots\u0022 data-cite=\u0022I_do_robots\u0022\u003E\u003Cdiv\u003ESince the 3.75 meter sections are from the Structural menu, would these not be considered crew capable for internal passage to other \u0022Habitable\u0022 areas?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs you say, that\u0027s a roleplay question that only you can answer.\u003C/p\u003E\n"},{"CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2013-09-13T07:42:02Z","Content":"\n\u003Cp\u003ETry this mod if you want to wander around inside you ship: Hollow Structure \u0026amp; Hulls: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/29031-0-21-x-Hollow-Structure-Hulls\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/showthread.php/29031-0-21-x-Hollow-Structure-Hulls\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-13T07:44:25Z\u0022 title=\u002209/13/2013 07:44  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 13, 2013\u003C/time\u003E by Gus\u003C/strong\u003E\n\u003C/span\u003E\n"}]}