{"TopicId":45941,"ForumId":16,"TopicTitle":"Docking decouplers","CreatedByName":"I_do_robots","CreatedById":80480,"CreatedDateTime":"2013-09-14T19:34:30Z","PageNum":1,"Articles":[{"CreatedByName":"I_do_robots","CreatedById":80480,"CreatedDateTime":"2013-09-14T19:34:30Z","Content":"\n\u003Cp\u003EMating / coupling 2 pieces together in orbit.\u003C/p\u003E\u003Cp\u003ECan decouplers be \u0022Coupled\u0022 and is that the same as \u0022Docked\u0022?\u003C/p\u003E\u003Cp\u003EIf so, do I treat the maneuver as a docking exercise with the same functions as docking, only using the decouplers as alignment?\u003C/p\u003E\u003Cp\u003EOf course, I built the sections ahead of me with the same decouplers on the mating ends including with the arrows on them pointing toward each other if they were mated / docked / coupled.\u003C/p\u003E\u003Cp\u003EJust wondering if and how (How from a gameplay standpoint, key function, speed, orbit alignment all of that the same as a docking operation.that is done in orbit or if I must use docking ports only for an evolution like that.)\u003C/p\u003E\u003Cp\u003EThanks for your input. Flying 2nd section up right now and hoping that\u0027s not a bad gamble I took thinking I could do that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-14T20:58:52Z\u0022 title=\u002209/14/2013 08:58  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 14, 2013\u003C/time\u003E by I_do_robots\u003C/strong\u003E\n\u003Cbr\u003EChange ot Kanswered\n\u003C/span\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2013-09-14T19:37:29Z","Content":"\n\u003Cp\u003EDecouplers cannot be used like that, you have to use docking ports.\u003C/p\u003E\n"},{"CreatedByName":"I_do_robots","CreatedById":80480,"CreatedDateTime":"2013-09-14T21:00:19Z","Content":"\n\u003Cp\u003EThank you...I figured as much...I have docking port Sr.(s) at the other ends, guess that can serve as a workable alternative.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-09-14T21:56:01Z","Content":"\n\u003Cp\u003EIf you need to be able to break the connection between two docked sections quickly, what you can do is put a decoupler above the docking port in the stack, like this:\u003C/p\u003E\u003Cp\u003E stack\u003C/p\u003E\u003Cp\u003E |||\u003C/p\u003E\u003Cp\u003Edecoupler\u003C/p\u003E\u003Cp\u003E port\u003C/p\u003E\u003Cp\u003E(the port is facing downwards, of course).\u003C/p\u003E\u003Cp\u003EThis way, once the pieces are docked, you can just blow the decoupler to detach them. That\u0027s a permanent solution, of course - by blowing the decoupler, you blow off the docking port, so you can attach nothing there ever again...\u003C/p\u003E\u003Cp\u003EIf you\u0027re thinking about putting together a lift vehicle in space, I\u0027ll caution you about structural stability. You might want to put together a mockup on Kerbin before you launch the whole thing; if you need struts between the pieces, you\u0027ll need them when you get to where you\u0027re going and to my knowledge there\u0027s no way to put them on then.\u003C/p\u003E\n"},{"CreatedByName":"I_do_robots","CreatedById":80480,"CreatedDateTime":"2013-09-15T03:58:16Z","Content":"\n\u003Cp\u003EActually, I lofted a major section of my space station and got it to a stable orbit at 240 km \u002B/- about 400m between apoapsis and periapsis ( I guess that\u0027s good all in all.). I was about to launch the other half, and all along during building and flying the first half up, I was thinking (Or...never thought otherwise. Go figure, Kerbals are rubbin\u0027 off on me.) on putting them together at the decoupler I put at the top of the engine / tank stack, after I drop that away (More part count reduction too.). The front end is a capable tug, but, only has a larger decoupler at the back of the command module for reentry purposes after the station is \u0022parked\u0022 in orbit and a standard docking port at the nose.\u003C/p\u003E\u003Cp\u003EI think now I\u0027m going to start over (New game, move my builds out of the save / ships folder to the default SHIPS folder ) and put the docking port Sr connectors at both ends and rig my tug with one...I want to be able to use the tug to deorbit the engine tank combos after mating the sections together. To do that and get the sections right, I\u0027ll have to go back to the VAB and redo the ends to match up with each other and the tug. I hope the docking port doesn\u0027t make the base of the rocket unstable for the launch...One way to know...\u003C/p\u003E\u003Cp\u003EThank you for the input. I appreciate the help.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-15T04:00:11Z\u0022 title=\u002209/15/2013 04:00  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 15, 2013\u003C/time\u003E by I_do_robots\u003C/strong\u003E\n\u003Cbr\u003Ereference\n\u003C/span\u003E\n"}]}