{"TopicId":46239,"ForumId":16,"TopicTitle":"The Gilly lander","CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-09-17T19:56:57Z","PageNum":1,"Articles":[{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-09-17T19:56:57Z","Content":"\n\u003Cp\u003ENow i just landed on gilly (using mechjeb if you have to know) and was having fun watching jeb thinking he could fly. I got all my brave kerbonaughts out for a group photo which was good. But when I tried to get them back in i sort of flew them into the ladder (not very fast) and the entire lander split in two. I thought it was ok as it had split apart the ascent stage but then I remembered that i transfered all my fuel out of it and into the transfer stage as i didn\u0027t think I would need it. So I have three brave guys on gilly in a powered but fuel-less ascent stage. \u003C/p\u003E\u003Cp\u003EBUT I do have my transfer stage in orbit of gilly but i haven\u0027t a clue how to get it to the guys as it hasn\u0027t got a capsule so i cant fly them there. \u003C/p\u003E\u003Cp\u003EBTW my list of things on gilly or orbiting it:\u003C/p\u003E\u003Cp\u003EA small probe with some fuel\u003C/p\u003E\u003Cp\u003EThe ascent stage\u003C/p\u003E\u003Cp\u003EThe descent stage\u003C/p\u003E\u003Cp\u003EThe transfer stage orbiting gilly\u003C/p\u003E\u003Cp\u003EAny ideas on what to do? Should I simply send a rescue mission?\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-09-17T20:04:16Z","Content":"\n\u003Cp\u003EYou can fly off of Gilly with rocket pack power.\u003C/p\u003E\n"},{"CreatedByName":"Brotoro","CreatedById":57674,"CreatedDateTime":"2013-09-17T20:05:24Z","Content":"\n\u003Cp\u003EOh.... wait... the mothership has no living space for the kerbals? Ahhhhh...\u003C/p\u003E\u003Cp\u003EDoes your ascent stage have RCS? RCS is usually enough to get off of Gilly.\u003C/p\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-09-17T20:07:57Z","Content":"\n\u003Cp\u003ENo all it can do is move with the capsule torque the rcs was with the decent stage.... sort of a bad design! XD\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-09-17T20:18:33Z","Content":"\n\u003Cp\u003EYou could try docking your ship in orbit with the capsule on the surface, risky but you may get away with it due to Gillys low gravity\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-17T20:18:40Z","Content":"\n\u003Cp\u003EI think the best option is the smallest possible vehicle necessary to return them from low gilly orbit. Do an extreme EVA (make orbit by EVA pack) and rendezvous with a small return craft that can get them home.\u003C/p\u003E\n"},{"CreatedByName":"leax256","CreatedById":57364,"CreatedDateTime":"2013-09-18T01:34:21Z","Content":"\n\u003Cp\u003Etry rotating the craft with the torque to make it lift up a bit and get a kerbal to to push it into orbit. orbital velosity is only like 15 or so m/s. once in orbit get the other craft to dock to it.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-09-18T01:42:00Z","Content":"\n\u003Cp\u003Eat 10km,I believe it is only 18.6m/s orbital velocity.\u003C/p\u003E\n"},{"CreatedByName":"dudester28","CreatedById":61717,"CreatedDateTime":"2013-09-18T02:27:14Z","Content":"\n\u003Cp\u003EScott Manley managed to return to kerbin from gilly on EVA. Given, you probably don\u0027t have a parachut mod installed therefore the kerbals would be killed upon re-entry.\u003C/p\u003E\u003Cp\u003EEdit: going on what you said, I notice a possible design flaw: does a gilly lander need an ascent/descent stage? I haven\u0027t seen a picture,though, so I may be wrong.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-18T02:54:18Z\u0022 title=\u002209/18/2013 02:54  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 18, 2013\u003C/time\u003E by dudester28\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"montyben101","CreatedById":74173,"CreatedDateTime":"2013-09-18T14:25:38Z","Content":"\n\u003Cp\u003EIt was never built to land on gilly, it was built to land on duna but i CBA to design a new one XD\u003C/p\u003E\n"},{"CreatedByName":"Unknow0059","CreatedById":127534,"CreatedDateTime":"2014-11-16T10:23:17Z","Content":"\n\u003Cp\u003EMy lander used Advanced Grab Units (A.K.A Claws) to actually \u0022land\u0022 on Gilly.\u003C/p\u003E\n"}]}