{"TopicId":46391,"ForumId":16,"TopicTitle":"Parachuting bases in","CreatedByName":"Sprool","CreatedById":83158,"CreatedDateTime":"2013-09-24T13:22:11Z","PageNum":1,"Articles":[{"CreatedByName":"Sprool","CreatedById":83158,"CreatedDateTime":"2013-09-24T13:22:11Z","Content":"\n\u003Cp\u003EI\u0027m playing about with the H.O.M.E. pods setting up a few units on Eve, sending them in by parachute re-entry from about 150k orbit. Is there a technique for being able to aim them to land better- within 1/2km or less of same spot?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-24T22:49:10Z\u0022 title=\u002209/24/2013 10:49  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 24, 2013\u003C/time\u003E by Sprool\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Amoun","CreatedById":74485,"CreatedDateTime":"2013-09-24T14:52:41Z","Content":"\n\u003Cp\u003EThere is no fool proof way but a few things you COULD try.\u003C/p\u003E\u003Cp\u003EFirst of all, quicksave as often as you can.\u003C/p\u003E\u003Cp\u003EYou could make your orbit speed 0m/s and just \u0022fall\u0022 towards your site. Also, don\u0027t forget that the planet will rotate as you descend you will need to compensate for that...SO, the lower your start the more dV you will need to slow your speed but less dV (i THINK) as you ascend (but you will have parachutes so shouldn\u0027t be too hard).\u003C/p\u003E\u003Cp\u003EAnother way is you \u0022flying\u0022 down where you lower your PE or AP overshooting the landing site by a bit (to compensate for drag) and deploying your shoots when you are almost over the landing site.\u003C/p\u003E\u003Cp\u003EHowever, it will mainly be trial and error. A few runs and you will get the general idea of how the craft will behave and be able to compensate \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s all I can offer my self....I am sure there will be others who can contribute more detailed instructions.\u003C/p\u003E\n"},{"CreatedByName":"running","CreatedById":82033,"CreatedDateTime":"2013-09-24T15:39:14Z","Content":"\n\u003Cp\u003EI prefer to come in from a stable high orbit, reduce forward speed to 0 so my trajectory is almost straight down. \u003C/p\u003E\u003Cp\u003EI can come in pretty close, but that is with the risk of any parts jettisoned during descent to crash into whatever I put already down there. I haven\u0027t \u0022succesfully\u0022 accidentially bombed my own base yet though.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://scontent-a-lhr.xx.fbcdn.net/hphotos-prn2/1233614_301370653335166_2140350864_n.jpg\u0022 alt=\u00221233614_301370653335166_2140350864_n.jpg\u0022\u003E\u003C/p\u003E\n"}]}