{"TopicId":46949,"ForumId":16,"TopicTitle":"Apollo Saturn V Style","CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-09-30T04:05:39Z","PageNum":1,"Articles":[{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-09-30T04:05:39Z","Content":"\n\u003Cp\u003EOkay, heres the question. I am using mod wise for this, Mechjeb for the autopilot and the Novapunch pack for the parts. I can build a rocket that looks A LOT like NASA\u0027s Saturn V B rocket as seen here:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/photo/my-images/534/z0d3.png/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/a/img534/9108/z0d3.png\u0022 alt=\u0022z0d3.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethe problem is, that, no matter what I try to do to this thing, and in the picture below, you will see some structural pylons and the Novapunch HEAVY struts going from stage to stage to TRY to keep it from writhing like a limp yet possessed noodle. This thing even WITH Mechjeb is UNCONTROLLABLE, I tell it to do a 250km by 250km orbit with a 0 degree inclination, and this thing just flails wildly about the sky picking headings at random. Now, I KNOW this is NOT Mechjeb\u0027s fault as it handles other rockets with no problem, even got my mission to Duna, Landed at the face and home again with 0 issues.\u003C/p\u003E\u003Cp\u003Eedit side note: no parts clipping to make the towers stack, found an odd solution using the radial decouplers XD\u003C/p\u003E\u003Cp\u003EThe rocket only comes in at 500 tons and change... Any ideas on how to make this work? Oh, here is what it looks like about half way through the first stage.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/photo/my-images/809/6gab.png/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/a/img809/4525/6gab.png\u0022 alt=\u00226gab.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-01T04:23:58Z\u0022 title=\u002210/01/2013 04:23  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 1, 2013\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-09-30T04:08:24Z","Content":"\n\u003Cp\u003Etry to disable the torque at the command pod\u003C/p\u003E\u003Cp\u003Eand put the ASAS around of center of mass.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-09-30T04:12:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022lammatt\u0022 data-cite=\u0022lammatt\u0022\u003E\u003Cdiv\u003Etry to disable the torque at the command pod\u003Cp\u003Eand put the ASAS around of center of mass.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI shall give that, a um.. whirl lol\u003C/p\u003E\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003Etried that, disabled torque at the command pod and put a SAS equipped wheel in the middle around the center of mass, and the ship STILL swings like a noodle possessed, almost to the point of destruction.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-30T04:20:19Z\u0022 title=\u002209/30/2013 04:20  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 30, 2013\u003C/time\u003E by AlamoVampire\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2013-09-30T04:30:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlamoVampire\u0022 data-cite=\u0022AlamoVampire\u0022\u003E\u003Cdiv\u003EI shall give that, a um.. whirl lol\u003Cp\u003Eedit:\u003C/p\u003E\u003Cp\u003Etried that, disabled torque at the command pod and put a SAS equipped wheel in the middle around the center of mass, and the ship STILL swings like a noodle possessed, almost to the point of destruction.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehow about trying to disable the ASAS all together and use RCS to control the heading then\u003C/p\u003E\u003Cp\u003Ethis should work.\u003C/p\u003E\u003Cp\u003Eeither way, with this big a rocket, the tip is to not steer much.\u003C/p\u003E\u003Cp\u003Ea vertical ascend till you totally leave the troposphere and then turn will yield you less force exerting on various parts at different direction of the rocket body and hence the unwanted moment vectors that twist the rocket... i believe.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-09-30T04:58:11Z","Content":"\n\u003Cp\u003Eproblem is, even on \u0027vertical ascent\u0027 right off the pad, as soon as it clears that tallest pair of stabilizers it starts swinging like a wet noodle and only gets worse. Even Mechjeb cannot handle the rocket beyond going UP on the FULL rocket. Once it kicks that first stage off after burn out, it seems to stabilize, but, prior to that, it is nothing but a soggy mess that BARELY holds together even WITH unbreakable joints on \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nhnifong","CreatedById":12196,"CreatedDateTime":"2013-09-30T05:10:51Z","Content":"\n\u003Cp\u003ECheck the vectoring range on that 1st stage engine. It doesn\u0027t need to be higher than 0.5. Tiberion might have set it to 2.0 or something \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2013-09-30T05:37:02Z","Content":"\n\u003Cp\u003EI have done this, the trick is disable sas, use fine control mode (hit ~)make small course corrections and fly manually!\u003C/p\u003E\u003Cp\u003EThe problem lies in the connection between the decoupler fairing and engine. Focus your struts there...\u003C/p\u003E\n"},{"CreatedByName":"HansBlix","CreatedById":79483,"CreatedDateTime":"2013-09-30T07:02:56Z","Content":"\n\u003Cp\u003EHey Alamo! Been there done that and can point you in the right direction. \u003C/p\u003E\u003Cp\u003EFirstly, watch the engine. You will need struts between the 1st stage engine and tank or the engine semi-detach\u0027s and will wobble your rocket all over the shop (even though it looks attached and still feeds fuel correctly). These Struts are tricky at best due to the way the engine connections work so may take a few attempts to get right.\u003C/p\u003E\u003Cp\u003ESecondly, before launch lock the thrust vectoring on the main engine. The engine is so powerful, and the rocket so high that thrust vectoring will do you in badly. If needed you can add some rcs to the main body of the rocket to provide better control to replace what the vectoring would normally provide.\u003C/p\u003E\u003Cp\u003EThirdly, moar reaction control wheels. I\u0027m pretty sure there is 5M reaction control wheels in the pack, use one in each stage (remembering to strut), especially between the main engine and the tank at the bottom, makes a big difference.\u003C/p\u003E\u003Cp\u003EFourthly, adjust you ascent profile in mechjeb, set the gravity turn to start after the first stage is done, makes the gravity turn a whole lot easier on the structure.\u003C/p\u003E\u003Cp\u003EFifthly (?), adjust your max acceleration in mechjeb lower and activate. This reduces the thrust the engine produces and makes the whole thing a lot smoother. In some instances you can even then leave the thrust vectoring unlocked as the power being pumped out is a lot less.\u003C/p\u003E\u003Cp\u003ENote that most of the above all impact each other, so no one option will work but a nice combination of each of them should do the trick.\u003C/p\u003E\u003Cp\u003EI\u0027ll load up the game now, and get some pics of one that works shortly, and my launch settings for you. Plus any other tips i happened across as i was building it and have forgotten \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EGood Luck, Hans.\u003C/p\u003E\n"},{"CreatedByName":"HansBlix","CreatedById":79483,"CreatedDateTime":"2013-09-30T07:53:12Z","Content":"\n\u003Cp\u003EOk couldn\u0027t find an old one, so created a quick one from scratch, similar to yours. Note used procedural fairings, which i highly recommend \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EWas nice and stable, plenty of juice to get to the mun, only issue is some rotation in the first stage (sees to be an issue with that first stage engine every time i use it). I changed it a bit and forgot to put the rcs back on which should be able to address that little issue but mechjeb got it to orbit easily even so. \u003C/p\u003E\u003Cp\u003EHad the engine gimbal for the first stage locked, and limit to terminal velocity set in mechjeb (although it didn\u0027t seem to matter). Left the gravity turn at 5k start and it handled it no problem. Added some pics of the strut-work on it. De-couplers and reaction wheels tend to be weak points, but strut every joint to be on the safe side. Reaction wheel on each stage. Was quick and dirty, so excuse the couple of dodgy strut jobs... and there may be some KW Rocketry parts in there inadvertently.\u003C/p\u003E\u003Cp\u003EAlso remember lots of Launch Stability enhancers, spread them around the circumference. The physic engine tends to break stuff when it kicks in when you don\u0027t have enough of them to hold it steady.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/8zx3V\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EHans\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-09-30T12:32:51Z","Content":"\n\u003Cp\u003EThe big rockets from Nova Punch have especially weak connections. Coupled with excessive gimboling of that first stage and oscillation that sets in to the point of destruction, You just have to creatively strut everything using external anchor cubes for the tapered sections to lock everything in place.\u003C/p\u003E\u003Cp\u003EMy strutted together Abomination 5 that doesn\u0027t shake apart or need any other reaction wheels;\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/73cVUHe.jpg\u0022 alt=\u002273cVUHe.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the other hand, Nova Punch 1.25 meter tanks lock together well. This stack of five 1.25 by six meter tanks has no struts, yet flew straight to Kerbal escape from launch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LivgZCw.jpg\u0022 alt=\u0022LivgZCw.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-09-30T16:00:43Z","Content":"\n\u003Cp\u003EYou might have a narrow joint in the middle between wide parts, and it\u0027s weak and bends.\u003C/p\u003E\u003Cp\u003EI\u0027d also say don\u0027t use MechJeb autopilot. Let it point the direction, but control on your own. It oscillates the rocket wildly by doing many convulsive corrections all the time.\u003C/p\u003E\u003Cp\u003EYou don\u0027t need 250 km orbit around Kerbin, 80 kms would be just enough.\u003C/p\u003E\n"},{"CreatedByName":"AlamoVampire","CreatedById":78020,"CreatedDateTime":"2013-10-01T04:23:18Z","Content":"\n\u003Cp\u003EOkay guys, I want to thank all of you for your fine help! Each of you pointed me where I needed to be! So, to all of you, enjoy these pictures of OUR Cooperative Success in my Apollo/Saturn V B Style rocket. While, I found more issues to fix, namely fuel and staging line ups, I would not be at this point with out you guys, so thank you! Let me thank all of you by name, as you each contributed in such wonderful ways:\u003C/p\u003E\u003Cp\u003ELammatt you gave wonderful advice on ascent guidance \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Enhnifong you gave great advice on vectoring ranges \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFrizzank you gave me the advice on disabling various SAS locations, soo much smoother like that!\u003C/p\u003E\u003Cp\u003EHansblix you gave great pictures and advice on where to strut, what to strut, to limit my vertical acceleration, to add in procedural fairings which may have made it a bit bulgy, but wow, did it clean it up, and to shut down stage 1\u0027s vectoring and man did it ever settle that beast down! made it to orbit, ran into fueling issues, but, nothing a little tweaking in the VAB cannot fix \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESRV Ron, you sir, thank you for the advice on the Struts and how to make them attach in nice ways, you just changed alot of future designs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EKulebron, thank you for pointing out about potential weaknesses in my joint locations, thank you.\u003C/p\u003E\u003Cp\u003EAgain, thank you ALL for the help, enjoy these pictures \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/photo/my-images/546/nt6w.png/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/scaled/large/546/nt6w.png\u0022 alt=\u0022nt6w.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/photo/my-images/29/2ozk.png/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/scaled/large/29/2ozk.png\u0022 alt=\u00222ozk.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imageshack.us/photo/my-images/694/o7n1.png/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://imageshack.us/scaled/large/694/o7n1.png\u0022 alt=\u0022o7n1.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"}]}