{"TopicId":47093,"ForumId":16,"TopicTitle":"Determining ascending / descending nodes?","CreatedByName":"Meithan","CreatedById":76123,"CreatedDateTime":"2013-10-01T16:26:56Z","PageNum":1,"Articles":[{"CreatedByName":"Meithan","CreatedById":76123,"CreatedDateTime":"2013-10-01T16:26:56Z","Content":"\n\u003Cp\u003EI have a simple question. Suppose I\u0027m orbiting a planet and I want to change my orbital inclination. Is there a way to determine the position of the ascending and descending nodes of my orbit \u003Cem\u003Ewithout using mods\u003C/em\u003E? I can\u0027t target the planet I\u0027m currently orbiting. On Kerbin, I can use the Mun since its orbital plane coincides with Kerbin\u0027s equator, but is there another way that works in general?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-02T00:42:38Z\u0022 title=\u002210/02/2013 12:42  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 2, 2013\u003C/time\u003E by Meithan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-10-01T17:25:10Z","Content":"\n\u003Cp\u003EIf you refuse to use mods, then you\u0027re stuck with eyeballing it.\u003C/p\u003E\u003Cp\u003EFinding the nodes is easy enough. Just put your map view focus on the planet (double-click it) and then move the camera up/down until the planet\u0027s orbit appears as a flat horizontal line. Then rotate the view left/right until your orbit crosses the planet\u0027s orbit right in the center of the screen. Click there to add a maneuver node to mark the spot (you might not actually use it) and rotate the view vertically so you\u0027re looking down from above on your orbit. The maneuver node is at 1 of the ascending/descending nodes and an imaginary vertical line from it through the planet to the other side of your orbit marks the other ascending/descending node. The node you want to use is the one furthest from the planet (less fuel).\u003C/p\u003E\u003Cp\u003ENow, using the ascending/descending nodes is a bit tricky if the planet\u0027s own orbit is inclined. This is because AFAIK the polar axis of all planets points straight up instead of leaning over like Earth\u0027s does. Thus, the planets\u0027 equators are usually at slight angles to their orbital paths. Thus, to get a zero inclination orbit relative to the planet, you don\u0027t want to quite match its orbital plane. So, you have to go back to the map and move the view so your maneuver node (which is at the ascending or descending node) is in the center of the screen and the planet\u0027s equator is horizontal. Then you can tweak the maneuver node until your orbit is parallel with the equator.\u003C/p\u003E\n"},{"CreatedByName":"Meithan","CreatedById":76123,"CreatedDateTime":"2013-10-02T00:42:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EIf you refuse to use mods, then you\u0027re stuck with eyeballing it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh, I have no problem with using mods, and I\u0027m aware that MechJeb gives this information. My question was more out of interest and to see what clever methods players have devised.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EFinding the nodes is easy enough. \u0026lt;snip\u0026gt;\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESee? This kind of clever method is exactly what I meant! Makes a lot of sense, thanks for the tip.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003ENow, using the ascending/descending nodes is a bit tricky if the planet\u0027s own orbit is inclined. This is because AFAIK the polar axis of all planets points straight up instead of leaning over like Earth\u0027s does. Thus, the planets\u0027 equators are usually at slight angles to their orbital paths.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut then this would be just like the Earth, whose rotation axis is not perpendicular to the orbital plane. So planets in KSP that have an inclined orbit \u003Cem\u003Edo\u003C/em\u003E have seasons after all (unlike Kerbin).\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-10-02T03:36:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Meithan\u0022 data-cite=\u0022Meithan\u0022\u003E\u003Cdiv\u003EOh, I have no problem with using mods, and I\u0027m aware that MechJeb gives this information. My question was more out of interest and to see what clever methods players have devised.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMJ doesn\u0027t make the ascending/descending nodes appear on the map but it does know where they are and will create maneuver nodes at them to change your inclination if you tell it to.\u003C/p\u003E\u003Cp\u003EThe somewhat irksome thing about this is that KSP definitely knows where ascending/descending nodes are but only draws them when you\u0027re doing an intercept instead of always showing them like it does the Pe and Ap.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-10-02T04:14:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EThe somewhat irksome thing about this is that KSP definitely knows where ascending/descending nodes are but only draws them when you\u0027re doing an intercept instead of always showing them like it does the Pe and Ap.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed. I\u0027d like to see these displayed for the body you\u0027re in orbit around whenever you don\u0027t have anything targeted, as well as more orbital information in general. Ah well, if wishes were horses...\u003C/p\u003E\n"}]}