{"TopicId":47729,"ForumId":16,"TopicTitle":"Help with terms","CreatedByName":"Dimetime35c","CreatedById":78776,"CreatedDateTime":"2013-10-08T14:03:40Z","PageNum":1,"Articles":[{"CreatedByName":"Dimetime35c","CreatedById":78776,"CreatedDateTime":"2013-10-08T14:03:40Z","Content":"\n\u003Cp\u003EOkay I am so confused on all the tech terms of KSP. What does ISP mean? How is thrust to weight measured? Is any positive number in TWR mean the rocket will lift off? A little clarification would be nice. I\u0027ve tried looking online and on YouTube and there answers just confuse me even more.\u003C/p\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-10-08T14:07:42Z","Content":"\n\u003Cp\u003EA positive number in TWR will mean that the craft will accelerate in vacuum. On Kerbin you need a TWR of 1 or higher to take off, I believe. I\u0027m no expert and my data may or may not be correct. don\u0027t quote me.\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2013-10-08T14:16:44Z","Content":"\n\u003Cp\u003EDon\u0027t know what ISP stands for but it is a measure of the fuel efficiency of the engine. The higher the number the longer your fuel will last.\u003C/p\u003E\u003Cp\u003EThrust to Weight Ratio. (TWR) Weight divided by thrust = the ratio. It is calculated based on the weight at Kerbin sea level. A TWR over 1 means you have enough thrust to overcome the weight of the craft and take off from Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Depth","CreatedById":81698,"CreatedDateTime":"2013-10-08T14:17:05Z","Content":"\n\u003Cp\u003EISP is the effectiveness/fuel drain of an engine. Generally speaking a higher ISP gives lower thrust, so you make a long effective burn instead of a strong short fuel-hungry one.\u003C/p\u003E\u003Cp\u003EThrust to weight means how much thrust your engines gives vs the weight of the craft. If you have a 1 ton craft, you need more than 1 ton of thrust to lift off, 1:1. In space it\u0027s a bit more complicated, as the ratio between thrust and weight means how quickly you can accelerate.\u003C/p\u003E\u003Cp\u003EEdit: Sniped \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EISP stands for Specific Impulse. As far as I know, in real life it means the velocity of the propellant leaving the engine.\u003C/p\u003E\n"},{"CreatedByName":"Garek","CreatedById":73214,"CreatedDateTime":"2013-10-08T14:17:41Z","Content":"\n\u003Cp\u003EISP is a measure of the efficiency of the engine. I don\u0027t know how exactly it works, but the higher the ISP the more acceleration it will generate from the same amount of fuel. \u003C/p\u003E\u003Cp\u003ETWR is an indicator of how fast the rocket will accelerate. It\u0027s always positive (unless you trust backwards and count that as negative trust). It\u0027s also always relative to a certain gravity (as gravity turns mass into weight), if not specified, it\u0027s usually either Kerbin surface gravity or current gravity. A rocket can take off from a body if it\u0027s TWR for that body\u0027s surface gravity is greater than 1. E.g. a rocket with a Kerbin surface TWR of 0.2 can\u0027t take off from Kerbin but it could take off from the Mun, because the Mun has less than 20% of Kerbin\u0027s gravity, so there it\u0027s TWR would be greater than 1.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-10-08T14:17:58Z","Content":"\n\u003Cp\u003EIsp is Specific Impulse. In short, it\u0027s a measure of rocket engine efficiency. The unit is seconds. Higher values are better. Here\u0027s a good description:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Specific_impulse\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Specific_impulse\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"RoboRay","CreatedById":46556,"CreatedDateTime":"2013-10-08T16:15:16Z","Content":"\n\u003Cp\u003EIn a nutshell, Isp describes how long an engine can produce 1kg (or pound, or stone, or whatever unit you prefer) of thrust from 1kg (or whatever) of fuel. This is why it\u0027s measured in seconds, as the value is a period of time.\u003C/p\u003E\u003Cp\u003EIf an engine delivers one ton of thrust and has an Isp of 400, and you give it 10 tons of fuel, the engine could operate for 4000 seconds before the fuel runs out.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-08T16:18:34Z\u0022 title=\u002210/08/2013 04:18  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 8, 2013\u003C/time\u003E by RoboRay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Runboy","CreatedById":62496,"CreatedDateTime":"2013-10-08T18:59:43Z","Content":"\n\u003Cp\u003EYou can visit the KSP wiki,It has all of the KSP terminology you will ever need.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Terminology\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Terminology\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELeave a reputation if you found this helpful (The sheriff star symbol on the bottom left)\u003C/p\u003E\n"},{"CreatedByName":"Requiem762","CreatedById":82185,"CreatedDateTime":"2013-10-08T19:08:55Z","Content":"\n\u003Cp\u003EISP is fuel efficiency\u003C/p\u003E\u003Cp\u003ETWR needs to be greater than one in atmo/ on the surface but in space any positive number works\u003C/p\u003E\n"},{"CreatedByName":"Crown","CreatedById":18262,"CreatedDateTime":"2013-10-08T21:03:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RoboRay\u0022 data-cite=\u0022RoboRay\u0022\u003E\u003Cdiv\u003EIn a nutshell, Isp describes how long an engine can produce 1kg (or pound, or stone, or whatever unit you prefer) of thrust from 1kg (or whatever) of fuel. This is why it\u0027s measured in seconds, as the value is a period of time.[...]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECareful! Be aware that kg is a mass. Any engines produces Newton, which is a force.\u003C/p\u003E\u003Cp\u003EThe unit of the specific impulse is \u003Cimg src=\u0022http://latex.codecogs.com/gif.download?%5Cfrac%7BN%20s%7D%7Bkg%7D\u0022 alt=\u0022gif.download?%5Cfrac%7BN%20s%7D%7Bkg%7D\u0022\u003E. But it is true what you say.\u003C/p\u003E\u003Cp\u003EThe reason why it is mentioned in seconds is that american (feet, pound) and german (meter, kilogram) rocket engineers had to work together in the 60s. And the only mutual unit is the second. When you eliminate the earth\u0027s acceleration and the mass the second is left.\u003C/p\u003E\u003Cp\u003EAs mentioned many times before, Wikipedia is a very good source for anything. It just takes a while to read it all. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Requiem762\u0022 data-cite=\u0022Requiem762\u0022\u003E\u003Cdiv\u003EISP is fuel efficiency\u003Cp\u003ETWR needs to be greater than one in atmo/ on the surface but in space any positive number works\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Thrust-to-Weight-Ratio is actually a Thrust-to-Mass-Ratio, because weight is a result of acceleration. And in space there is no gravitational acceleration.\u003C/p\u003E\u003Cp\u003ECan there be a \u003Cem\u003Enegative\u003C/em\u003E TWR? \u003C/p\u003E\u003Cp\u003EFor this either the thrust or the mass has to be negative. Mass can\u0027t and a negative thrust would simply mean to accelerate in the other direction. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"}]}