{"TopicId":47882,"ForumId":16,"TopicTitle":"how to deorbit debris","CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2013-10-10T01:41:59Z","PageNum":1,"Articles":[{"CreatedByName":"deepspacecreeper","CreatedById":84329,"CreatedDateTime":"2013-10-10T01:41:59Z","Content":"\n\u003Cp\u003Ehello, is there a way of deorbiting debris, or designing the rocket to allow the debris to be deorbited?\u003C/p\u003E\n"},{"CreatedByName":"Mr.Rocket","CreatedById":80241,"CreatedDateTime":"2013-10-10T01:44:40Z","Content":"\n\u003Cp\u003EJust a guess is to put unmanned pods on everything you want to deorbit, and a little rcs, so when you decouple them you can control them and lead them back to kerbin. I think this is a little extreme,but hey, it might work.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-10-10T01:46:27Z","Content":"\n\u003Cp\u003EOr go to the tracking center, select the debris tab, and then select each piece of debris and hit the Terminate button.\u003C/p\u003E\n"},{"CreatedByName":"aeronaut","CreatedById":83922,"CreatedDateTime":"2013-10-10T01:54:13Z","Content":"\n\u003Cp\u003EThis was my solution for rocket bodies and other random stuff I left in orbit, worked like a charm!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VrGsPk8.png\u0022 alt=\u0022VrGsPk8.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-10-10T01:57:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022aeronaut\u0022 data-cite=\u0022aeronaut\u0022\u003E\u003Cdiv\u003EThis was my solution for rocket bodies and other random stuff I left in orbit, worked like a charm!\u003Cp\u003EBut where are the Sunbeams? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-10-10T02:19:46Z","Content":"\n\u003Cp\u003EThe terminate button is too easy! \u003C/p\u003E\u003Cp\u003EI try to design my rockets so the last jettisoned stage will juuust barely re-enter, and use onboard propulsion to put the payload in orbit.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-10-10T02:53:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Traches\u0022 data-cite=\u0022Traches\u0022\u003E\u003Cdiv\u003EThe terminate button is too easy! \u003Cp\u003EI try to design my rockets so the last jettisoned stage will juuust barely re-enter, and use onboard propulsion to put the payload in orbit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETested two designs with the fuel can launcher.\u003C/p\u003E\u003Cp\u003E1. A pair of small SRB that fired when I decoupled the fuel tank from the booster. It deorbited as planned but has no control.\u003C/p\u003E\u003Cp\u003E2. Added a control module, thruster pack, and parachutes to the orbital booster. That allows me to take command, use fuel left or the thruster pack to deorbit, land, and recover the booster. The Rocomax big orange fuel can can also be recovered once empty by deorbiting with the thruster pack.\u003C/p\u003E\u003Cp\u003EA variation of the design will being the fuel can to Mun orbit. A small amount of fuel from the big can is needed to fine tune Mun orbit. The empty can is crashed into Mun using thrusters. Some SRBs on the launcher may give enough added boost that the can can reach the desired orbit before running out of fuel. Current design makes 100k x 150k orbit but no lower.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pg7ZOax.jpg\u0022 alt=\u0022pg7ZOax.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Space_Coyote","CreatedById":37107,"CreatedDateTime":"2013-10-10T03:41:45Z","Content":"\n\u003Cp\u003EA simple solution is often made simpler by the complexity of the craft..\u003C/p\u003E\u003Cp\u003EIn order to Deorbit a object you\u0027ll need the following items..\u003C/p\u003E\u003Cp\u003E1. A probe control pod (this will allow you to control the item and thus allow you to guide it (AA redundancy system if you so choose would be the Mechjeb plug in..) \u003C/p\u003E\u003Cp\u003E2. Batteries/Solar Panels.,.. This is important cause without even backup power the probe will not be usable to even fire the engines... so Batteries and or solar panels are a miust..\u003C/p\u003E\u003Cp\u003E3. Landing Legs and parachutes (Optional) This is ifr you want to recover the part or not if not, leave the items off and let it crash.. but if you want to recover the parts, then you\u0027ll need 4 sturdy legs and at least 3-4 parachutes (radially mounted)\u003C/p\u003E\u003Cp\u003Eother than those simple suggestions once you have a way to control the rocket to de-orbit, all it is is put t in retrograde and do a slow and gentle burn. Once the fuel is exhauseed even RCS Fuel can be used to decellerate the vehicle so that it can get to the minimum required height for Aerobraking on Kerbin (which is round 30-32 km... If you\u0027re going to dump it on antoher world, cust aim straight at the target and let gravity do the rest..\u003C/p\u003E\u003Cp\u003Ecause when all is said and done, it\u0027ll make a difference ifyou want to recover the parts or not..\u003C/p\u003E\u003Cp\u003ESpace_Coytoe\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2013-10-10T04:50:09Z","Content":"\n\u003Cp\u003EFirst is to reduce the amount of trash, dropping upper stage then Pe is between 0 and 30 km will cost you less than 100 m/s dV from low orbit. \u003C/p\u003E\u003Cp\u003EYou can also get rid of transfer stages this way. Drop them before circulating after aerobrake. \u003C/p\u003E\u003Cp\u003EThis don\u0027t require more parts and the dV cost is low.\u003C/p\u003E\u003Cp\u003ENow for more complex cases, either you are in high orbit or you want to use the upper stage help you doing the burn.\u003C/p\u003E\u003Cp\u003EIn this case you need an probe core and two small solar panels, an small battery might also be nice. \u003C/p\u003E\u003Cp\u003EYou might want to add an small deorbit tank. an 45 liter works well however the torus one is enough then dropping from an partial transfer orbit like halfway to Mun.\u003C/p\u003E\u003Cp\u003EPut an decopler below or mount it radial on an small strut. so it don\u0027t get drained, this saves you the work of dropping the tank just before its burned out or transfer fuel before dropping. \u003C/p\u003E\u003Cp\u003Eadding an 48-7S let you deorbit drop tanks to.\u003C/p\u003E\n"},{"CreatedByName":"Umlüx","CreatedById":69703,"CreatedDateTime":"2013-10-10T09:34:23Z","Content":"\n\u003Cp\u003Ei try to have some sepratrons on lifting stages, so when i decouple them from the payload after reaching low orbit, they fire and the spent stage deorbits.\u003C/p\u003E\u003Cp\u003EIP pusher stages are fitted with a probe core so i can deorbit them after reaching the target or are decoupled after aerobraking before i raise the PE\u003C/p\u003E\u003Cp\u003Eor (usually when i visit the mun) i set up a direct crash course, decouple the pusher and finish the orbit with the payload.\u003C/p\u003E\u003Cp\u003Enevertheless my save is littered with debris... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"WeirdCulture","CreatedById":76591,"CreatedDateTime":"2013-10-10T10:03:23Z","Content":"\n\u003Cp\u003EI had to launch to Cleaning missions for the two ascentstages of the landermodules which were orbiting my MÃƒÂ¼n\u003C/p\u003E\n"},{"CreatedByName":"madbadger2742","CreatedById":82240,"CreatedDateTime":"2013-10-10T10:42:24Z","Content":"\n\u003Cp\u003EFor KSS missions, I just make sure to put a docking port on it, then I use a tug to deorbit it. \u003C/p\u003E\u003Cp\u003ETransfer stages are dropped before capture, and so are typically on an escape trajectory. \u003C/p\u003E\u003Cp\u003EAnything else, I try to do the above recommendation of using a probe core and leaving a skosh of fuel and a battery. When I remember. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}