{"TopicId":48465,"ForumId":16,"TopicTitle":"Trusses and their uses / something missing ?","CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-15T09:37:26Z","PageNum":1,"Articles":[{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-15T09:37:26Z","Content":"\n\u003Cp\u003EHi,\u003C/p\u003E\u003Cp\u003Ehave just tried out one ship-design and seem to have found some odd behavior:\u003C/p\u003E\u003Cp\u003Ewhen you start building your ship, trusses connect perfectly and help increase stability.\u003C/p\u003E\u003Cp\u003E lets say, (ascii incoming) \u003C/p\u003E\u003Cp\u003Ea O is a fuel tank, \u003C/p\u003E\u003Cp\u003EI or - is a truss\u003C/p\u003E\u003Cp\u003E.. is nothing\u003C/p\u003E\u003Cp\u003Eso i start building a rectangle (looking down on my ship\u003C/p\u003E\u003Cp\u003Ethe design looks like this\u003C/p\u003E\u003Cp\u003Eo-o\u003C/p\u003E\u003Cp\u003EI.I\u003C/p\u003E\u003Cp\u003Eo.o\u003C/p\u003E\u003Cp\u003Esince the measurements are all identical, i should be able to attach a truss to finish the rectangle. \u003C/p\u003E\u003Cp\u003EBUT, the truss only connects to one of the two tanks \u003C/p\u003E\u003Cp\u003Eso I cannot stabilize and connect the complete rectangle.\u003C/p\u003E\u003Cp\u003Eis that how trusses should work ? or is that simply an odd behaviour / bug ? \u003C/p\u003E\u003Cp\u003Ethx in advance\u003C/p\u003E\n"},{"CreatedByName":"OptimumAmoeba","CreatedById":57784,"CreatedDateTime":"2013-10-15T10:06:09Z","Content":"\n\u003Cp\u003EIt\u0027s not a bug, it\u0027s to do with the tree structure with parts that stops you from doing this. You will need to use a strut to connect the last corner.\u003C/p\u003E\n"},{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-15T10:16:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OptimumAmoeba\u0022 data-cite=\u0022OptimumAmoeba\u0022\u003E\u003Cdiv\u003EIt\u0027s not a bug, it\u0027s to do with the tree structure with parts that stops you from doing this. You will need to use a strut to connect the last corner.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehm. tree structure.. havenÃ‚Â´t read about that. but i think its a dumb mechanic. \u003C/p\u003E\u003Cp\u003Eso for this particular design i would need \u003C/p\u003E\u003Cp\u003Eat leats 4 more parts and it would look kinda stupid, too. \u003C/p\u003E\u003Cp\u003Ei know it is a little thing, but i think it needs to get ironed out.\u003C/p\u003E\n"},{"CreatedByName":"Garek","CreatedById":73214,"CreatedDateTime":"2013-10-15T10:22:54Z","Content":"\n\u003Cp\u003EYou simply can\u0027t build true cycle structures with the current craft system. The parts are organized in a tree, where each part can have only one parent. So what happens to your connections is:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E    Tank\u003Cbr\u003E   /    \\\u003Cbr\u003ETank  Truss\u003Cbr\u003E  |      |\u003Cbr\u003ETruss Tank\u003Cbr\u003E  |      |\u003Cbr\u003ETank  Truss\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EYou want the last Truss to connect to the last Tank, but that can\u0027t happen directly because parts only connect to one parent. I know of two workarounds:\u003C/p\u003E\u003Cp\u003E1) Struts between the Tank and the Truss can replace the hard joint. Keep in mind that the struts remain only as long as the two parts are connected through the tree structure.\u003C/p\u003E\u003Cp\u003E2) Docking ports. Two docking ports touching each other will connect on vehicle load on launch. For this, your connections have to look like this:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E...     ...\u003Cbr\u003E |      |\u003Cbr\u003ETank  Truss\u003Cbr\u003E |      |\u003Cbr\u003EPort   Port\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAlso, this is not an intended game mechanic, but a limitation imposed by the way crafts are stored.\u003C/p\u003E\n"},{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-15T10:30:14Z","Content":"\n\u003Cp\u003EI see.\u003C/p\u003E\u003Cp\u003Ehave to rethink my whole design then. sad.\u003C/p\u003E\u003Cp\u003Ei dreamed about hexagonal and octagonal and cubic ships and such....\u003C/p\u003E\n"},{"CreatedByName":"OptimumAmoeba","CreatedById":57784,"CreatedDateTime":"2013-10-15T10:54:21Z","Content":"\n\u003Cp\u003ELet the genius / insanity begin!\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-10-15T11:31:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Psykikk\u0022 data-cite=\u0022Psykikk\u0022\u003E\u003Cdiv\u003Ehm. tree structure.. havenÃ‚Â´t read about that. but i think its a dumb mechanic. \u003Cp\u003E(...)\u003C/p\u003E\u003Cp\u003Ei know it is a little thing, but i think it needs to get ironed out.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrees are a reliable way of storing complex structures. They allow for quick and precise determination what part goes where, what parts come off when undocking, and what parts stop working when one of them fails (during launch) without requiring extensive computing.\u003C/p\u003E\u003Cp\u003EI\u0027m sure the devs are aware that the tree topology is not the most realistic representation of a complex ship, and of the limitations that it brings, but apparently they judged that the benefits outweigh the limitations.\u003C/p\u003E\n"},{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-15T12:43:30Z","Content":"\n\u003Cp\u003Eyeah might be. but making circle constructions possible would still be awesome.\u003C/p\u003E\u003Cp\u003Ebut good to know its more of a program-issue rather than something else.\u003C/p\u003E\u003Cp\u003Ewhich means it could get fixed. \u003C/p\u003E\u003Cp\u003Emight be that this circle - construction was also the reason my ssto designs were flawed....\u003C/p\u003E\n"},{"CreatedByName":"sanity","CreatedById":33997,"CreatedDateTime":"2013-10-15T12:45:56Z","Content":"\n\u003Cp\u003Ejust build it in orbit\u003C/p\u003E\n"},{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-15T14:33:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sanity\u0022 data-cite=\u0022sanity\u0022\u003E\u003Cdiv\u003Ejust build it in orbit\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ebuilding in orbit is not an option, as docked structures are not even close to stable enough,\u003C/p\u003E\u003Cp\u003Ealso connecting struts, plates and trusses in space is not possible. (alas)\u003C/p\u003E\u003Cp\u003Eand besting the challenge if putting stuff to orbit is one of the majr things i enjoy about KSP\u003C/p\u003E\n"},{"CreatedByName":"solidgeoff","CreatedById":73791,"CreatedDateTime":"2013-10-15T14:52:53Z","Content":"\n\u003Cp\u003EJust curious, since it seems we\u0027ve got some people who know programming well, do you think changing the game over from tree to a more complex system would be a relatively easy thing to do for KSP? Or would it take a complete overhaul of the system? Currently, it seems struts seem to help most issues. For me, the thing I\u0027d love to see if the ability to grab a complex object (composed of several parts), and flip it over and use a node on the underside.\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2013-10-15T14:53:55Z","Content":"\n\u003Cp\u003EYou can build with docking ports very close to each other, and often the docking ports dock when you launch.\u003C/p\u003E\u003Cp\u003EOtherwise, build close and then use the strut connector to glue things together.\u003C/p\u003E\n"},{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-15T15:28:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022numerobis\u0022 data-cite=\u0022numerobis\u0022\u003E\u003Cdiv\u003EYou can build with docking ports very close to each other, and often the docking ports dock when you launch.\u003Cp\u003EOtherwise, build close and then use the strut connector to glue things together.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ethe strut connector was and is my way to go, but using two parts where normally one should do the trick (putting atruss in between to tanks that were placed before) seems way more pratical and logical and intuitive.\u003C/p\u003E\u003Cp\u003Eeven if the programming model currently does not allow it, it should be the way to go ... and i wonder really how difficult it would be to switch it\u003C/p\u003E\n"},{"CreatedByName":"Garek","CreatedById":73214,"CreatedDateTime":"2013-10-15T15:29:43Z","Content":"\n\u003Cp\u003Esolidgeoff, I know a bit about programming, and I would say that that depends very much on how the software is organized internally, something we don\u0027t know anything about. A solution I can think of which still allows the crafts to be stored primarily as a tree would be if the VAB recognized if you clipped parts\u0027 attachment points into each other and would store a list of additional hard joints in the craft file for those connections. Of course, this creates its own problems: what if you want to have two surface-attachable parts sit directly on each other, but not connected (e.g. some stuff folded with Infernal Robotics)?\u003C/p\u003E\n"},{"CreatedByName":"chrisb2e9","CreatedById":87224,"CreatedDateTime":"2013-10-15T21:17:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Psykikk\u0022 data-cite=\u0022Psykikk\u0022\u003E\u003Cdiv\u003Ebuilding in orbit is not an option, as docked structures are not even close to stable enough,\u003Cp\u003Ealso connecting struts, plates and trusses in space is not possible. (alas)\u003C/p\u003E\u003Cp\u003Eand besting the challenge if putting stuff to orbit is one of the majr things i enjoy about KSP\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPutting aside that you enjoy launching it all as one piece. I took the challenge to send up my ship in parts. \u003C/p\u003E\u003Cp\u003ENotice dual docking ports to make sure it\u0027s all lined up properly. Also, struts added after the fact. Yes, with a mod. But it works... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7460/10298606565_e1e05315d7_o.jpg\u0022 alt=\u002210298606565_e1e05315d7_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you are wondering, on the far side of the ship is my lander. There will be two, one on each side. And I am considering a slight rebuild... only 3 nuclear engines is soooooo slow!\u003C/p\u003E\n"},{"CreatedByName":"Psykikk","CreatedById":83995,"CreatedDateTime":"2013-10-16T08:59:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chrisb2e9\u0022 data-cite=\u0022chrisb2e9\u0022\u003E\u003Cdiv\u003EPutting aside that you enjoy launching it all as one piece. I took the challenge to send up my ship in parts. \u003Cp\u003ENotice dual docking ports to make sure it\u0027s all lined up properly. Also, struts added after the fact. Yes, with a mod. But it works... \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm8.staticflickr.com/7460/10298606565_e1e05315d7_o.jpg\u0022 alt=\u002210298606565_e1e05315d7_o.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf you are wondering, on the far side of the ship is my lander. There will be two, one on each side. And I am considering a slight rebuild... only 3 nuclear engines is soooooo slow!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ewow. nice docking.\u003C/p\u003E\u003Cp\u003Efor me it takes ages to dock and even mechjeb sucks at it. sometimes i think itÃ‚Â´s even worse than myself at docking,\u003C/p\u003E\u003Cp\u003Eespecially when giving control to other docking ports that are not located directly on top / bottom. \u003C/p\u003E\u003Cp\u003Eto me docking is one of the most frustrating parts of the game , probably the main reason I am avoiding it like the plague\u003C/p\u003E\u003Cp\u003Eand launch packages as big as possible....\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-10-16T09:41:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Psykikk\u0022 data-cite=\u0022Psykikk\u0022\u003E\u003Cdiv\u003Efor me it takes ages to dock and even mechjeb sucks at it. sometimes i think itÃ‚Â´s even worse than myself at docking,\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t doubt it. Mechjeb is worse than a rabid ferret at docking.\u003C/p\u003E\u003Cp\u003EJust work at it, and read up on the parts that seem to be tripping you up. I installed the Docking Port Alignment Indicator but recently I\u0027ve started dragging it off to the side so I can dock with the navball. Something, somewhere, at some point in time clicked in my brain and now I \u0022see\u0022 it where I didn\u0027t before.\u003C/p\u003E\n"},{"CreatedByName":"Vlk","CreatedById":57928,"CreatedDateTime":"2013-10-16T11:53:57Z","Content":"\n\u003Cp\u003EI experimented with this \u0022dual-docking\u0022 thing too, but in the end, i did not really like it. As i\u0027ve noticed, the tree structure still stays, there is one \u0022dominant\u0022 connection - you can notice this with fuel flow. (Fuel goes through one docking port, but not the other). And i\u0027m sure it was a perfect dual-docking, because i had to undock with both docking port after.\u003C/p\u003E\u003Cp\u003EBut the main reason i dont like it is that it is still unstable and wobbly, and i noticed more lag too (well, a design like that requires a little more parts, maybe this is a reason for this too).\u003C/p\u003E\n"},{"CreatedByName":"Alexandicity","CreatedById":83819,"CreatedDateTime":"2013-10-16T14:54:32Z","Content":"\n\u003Cp\u003EYes, I had the same problem not long ago. The tree structure imposes some restrictions, but seems a decent choice for most Kerbal endeavors.\u003C/p\u003E\u003Cp\u003EIf you want to create something that \u0022looks\u0022 to have the loop, like your example in the first post, build it as you did. The last truss won\u0027t connect to the first tank, ok, but it will look like it does. Structurally, throw a whole bunch of struts in place to hold everything in place.\u003C/p\u003E\n"}]}