{"TopicId":48919,"ForumId":16,"TopicTitle":"Power generation?","CreatedByName":"Kosmic Debris","CreatedById":27111,"CreatedDateTime":"2013-10-17T12:23:45Z","PageNum":1,"Articles":[{"CreatedByName":"Kosmic Debris","CreatedById":27111,"CreatedDateTime":"2013-10-17T12:23:45Z","Content":"\n\u003Cp\u003EI may be missing something fundamental, but wouldn\u0027t a solar array be one of the very first items on the tech tree? It appears there\u0027s no means to generate power other than via the engines...?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-17T14:05:35Z\u0022 title=\u002210/17/2013 02:05  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 17, 2013\u003C/time\u003E by Kosmic Debris\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-10-17T12:30:43Z","Content":"\n\u003Cp\u003ENope, you are limited to what you can do until you get the basic solar panels in the third column.\u003C/p\u003E\n"},{"CreatedByName":"zarakon","CreatedById":5160,"CreatedDateTime":"2013-10-17T12:33:10Z","Content":"\n\u003Cp\u003EYeah, seems to me like solar panels should be an earlier option. Being able to only generate power with the engine seems unintuitive - if I was new to the game, I probably wouldn\u0027t understand what was going on\u003C/p\u003E\n"},{"CreatedByName":"DevoidLight","CreatedById":60164,"CreatedDateTime":"2013-10-17T12:47:15Z","Content":"\n\u003Cp\u003EFor manned missions in the Kerbin system battery power is more than enough. The first batteries you get are light enough that 8 or so won\u0027t noticeably affect your ship.\u003C/p\u003E\n"},{"CreatedByName":"BostLabs","CreatedById":57527,"CreatedDateTime":"2013-10-17T12:59:07Z","Content":"\n\u003Cp\u003EWell it appears that NASA is still shutdown so their website is down too (damn silly that). So I cannot get some data to back this. Guys, solar panels took a while to show up in our own space program. Stands to reason that they should take a while to show up in KSP as well.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-10-17T13:09:32Z","Content":"\n\u003Cp\u003EThe heating and cooling cycle with the expansion and contraction in space is pretty brutal.\u003C/p\u003E\u003Cp\u003EI think early solar panels were mainly the more fragile Crystalline Silicon Solar Panels.\u003C/p\u003E\u003Cp\u003EAt least the ones that could generate enough power to be worth it.\u003C/p\u003E\u003Cp\u003EI don\u0027t imagine the early panels would have lasted long without cracking.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-10-17T13:16:22Z","Content":"\n\u003Cp\u003EIn the begginings of the space program, batteries were used. People had to think about batteries and oxygen and removal of CO2 and vapor. Those were tough times.\u003C/p\u003E\u003Cp\u003ERemember Sputnik 1? It had batteries, meaning it would went dead after they were depleted.\u003C/p\u003E\n"},{"CreatedByName":"Kialar","CreatedById":60893,"CreatedDateTime":"2013-10-17T13:49:00Z","Content":"\n\u003Cp\u003EThe first use of solar panels was the Vanguard I in the mid-50ies. As far as I remember it did send data until 1964, and the NASA-Execs were rather surprised by the reliability of the power source.\u003C/p\u003E\u003Cp\u003EEdit: Vanguard I started in 1958.\u003C/p\u003E\n"},{"CreatedByName":"Wijbrandus","CreatedById":62681,"CreatedDateTime":"2013-10-17T14:00:02Z","Content":"\n\u003Cp\u003EYou are going to be running short LKO flights for a while anyway. The inherent power capacity of the capsule should be plenty as long as you focus on the flight and not get distracted building another ship, like I did.\u003C/p\u003E\u003Cp\u003E-- moment of silence for Jeb, floating up there all freeze-dried --\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-10-17T15:48:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BostLabs\u0022 data-cite=\u0022BostLabs\u0022\u003E\u003Cdiv\u003EWell it appears that NASA is still shutdown so their website is down too (damn silly that). So I cannot get some data to back this. Guys, solar panels took a while to show up in our own space program. Stands to reason that they should take a while to show up in KSP as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is correct. The Gemini program (the one between Mercury and Apollo) was designed to test the basic concepts required for a long duration trip to the Moon. That included crew endurance (staying in space for more then a week), docking in orbit (required in 2 of the 3 Moon landing schemes) and finally power, showing that fuel cells (rather then batteries like on Mercury) could be used to provide the needed power for an Apollo trip to the Moon.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Gemini_5\u0022 rel=\u0022external nofollow\u0022\u003EGemini 5\u003C/a\u003E was the first US spaceship powered by fuel cells.\u003C/p\u003E\u003Cp\u003ESolar cells of the time would not have provided enough power for crew life support. Even today a large solar array is needed for long duration missions (see the ISS).\u003C/p\u003E\n"},{"CreatedByName":"Kosmic Debris","CreatedById":27111,"CreatedDateTime":"2013-10-17T15:49:18Z","Content":"\n\u003Cp\u003EAnything other than a suborbital hop should have power generation IMHO - even if it\u0027s just a small, fragile solar cell segment, fuel cell or nuclear thermoelectric. The fuel cell option might be interesting for future use as we get into consumables.\u003C/p\u003E\u003Cp\u003EJust IMHO as feedback as they tweak the ladder. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThanks for all the comments on this!\u003C/p\u003E\n"},{"CreatedByName":"nholzric","CreatedById":7793,"CreatedDateTime":"2013-10-17T19:01:51Z","Content":"\n\u003Cp\u003EOther than being a little opaque to new players, I think relying on batteries and medium sized engines for power is a great way to start. Before the update the only time I ever worried about electricity is if I retracted solar panels for aerobraking and forgot about them or only had static panels on the top of my rocket and left it oriented for an inclination change. Now I have to plan to transmit data only during burns or else I\u0027ll run out of juice! It\u0027s been a lot of fun, I just unlocked batteries and I think I\u0027m close to unlocking solar panels! Once I have solar panels I will get to reevaluate how to do missions, what kinds of missions I want to attempt given the ability to transmit science more conveniently. I\u0027m a fan.\u003C/p\u003E\n"},{"CreatedByName":"OrianCEV","CreatedById":77351,"CreatedDateTime":"2013-10-17T19:15:43Z","Content":"\n\u003Cp\u003Eyou can store some data,and recover it when you\u0027re landed back on kerbin.\u003C/p\u003E\n"},{"CreatedByName":"TheSaint","CreatedById":70033,"CreatedDateTime":"2013-10-17T19:27:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022OrianCEV\u0022 data-cite=\u0022OrianCEV\u0022\u003E\u003Cdiv\u003Eyou can store some data,and recover it when you\u0027re landed back on kerbin.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what I\u0027ve been doing. Tried doing the transmittal thing, didn\u0027t have the juice. I suppose you could put two rockets on opposite sides of the spacecraft to burn and give you power while you\u0027re transmitting, but that seems a bit extreme. \u003C/p\u003E\u003Cp\u003EI also think that the solar cells should be earlier. All of the early American and Soviet probes were solar powered. The choice of fuel cells for Gemini and Apollo were for design and reliability reasons, not because of any limitations with the technology. The Soyuz was powered solely by solar panels in 1967.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-10-17T19:52:41Z","Content":"\n\u003Cp\u003EI just spam batteries. \u003C/p\u003E\u003Cp\u003EThe thing that sucks a bit is that the lv-909 doesn\u0027t generate electricity!\u003C/p\u003E\n"},{"CreatedByName":"KatzOhki","CreatedById":73492,"CreatedDateTime":"2013-10-17T19:54:30Z","Content":"\n\u003Cp\u003EI did a Mun and Minmus landing with only 4 extra batteries. Should pose too much a problem unless you plan to transmit data.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-10-17T20:34:32Z","Content":"\n\u003Cp\u003ETier 1 momentum-neutral power generator: fuel tank with an engine on each side.\u003C/p\u003E\n"},{"CreatedByName":"ForeverSka","CreatedById":74372,"CreatedDateTime":"2013-10-17T20:42:46Z","Content":"\n\u003Cp\u003EGood, I\u0027m not the only one who tripped over this. A generator might be an interesting addon... not sure if that\u0027s cannon (not a space exploration history major) but something that can burn a bit of jet fuel in exchange for power.\u003C/p\u003E\u003Cp\u003EOn my low mun orbit goo space experiment I had PLENTY of fuel but had to keep results and transmit on my way back to Kerbin. Still a bit of a chore burning long enough for 3 data points on a simple path like that.\u003C/p\u003E\n"},{"CreatedByName":"Tommygun","CreatedById":41293,"CreatedDateTime":"2013-10-17T21:59:07Z","Content":"\n\u003Cp\u003EI found that I actually liked the challenge of not having power generation on the first missions.\u003C/p\u003E\u003Cp\u003EIt felt appropriate to me. Your first missions should be short and simple as they were in real space programs.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-10-17T22:12:00Z","Content":"\n\u003Cp\u003EOne of the objectives of the first few levels is learning how to conserve limited power. Most important when placing a craft into orbit or doing a Mun flyby with the limited resources given to you for the first levels.\u003C/p\u003E\n"},{"CreatedByName":"Crush","CreatedById":59094,"CreatedDateTime":"2013-10-17T22:17:16Z","Content":"\n\u003Cp\u003EBefore you got batteries you can add more Mk1 pods to your rockets. Looks stupid and is quite weight-inefficient, but each one allows you about one additional transmission per mission. When you man them, you can also return more soil samples per mission.\u003C/p\u003E\u003Cp\u003EResearch Basic Rocketry (5 Sci), Survivability (15 Sci) and then Science Tech (45 Sci) to get the batteries (plus the important SC-9001 Science Junior experiment). \u003C/p\u003E\u003Cp\u003EThis unlocks Electrics (90 Sci) with the static OX-stat solar panels.\u003C/p\u003E\u003Cp\u003EElectrics unlocks Advanced Electrics (160 Sci) which brings you the self-orienting solar arrays.\u003C/p\u003E\n"},{"CreatedByName":"OrianCEV","CreatedById":77351,"CreatedDateTime":"2013-10-17T23:18:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheSaint\u0022 data-cite=\u0022TheSaint\u0022\u003E\u003Cdiv\u003EThat\u0027s what I\u0027ve been doing. Tried doing the transmittal thing, didn\u0027t have the juice. I suppose you could put two rockets on opposite sides of the spacecraft to burn and give you power while you\u0027re transmitting, but that seems a bit extreme. \u003Cp\u003EI also think that the solar cells should be earlier. All of the early American and Soviet probes were solar powered. The choice of fuel cells for Gemini and Apollo were for design and reliability reasons, not because of any limitations with the technology. The Soyuz was powered solely by solar panels in 1967.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHere\u0027s your answer:get a soil sample from a desert or near the water,it i\u0027ll give yo u sand,and you\u0027ll get allot of research points for it,then,just research the bottom most research block until you get to one with a light bulb,it\u0027ll have batteries,the njust spam em\u0027.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-17T23:23:03Z\u0022 title=\u002210/17/2013 11:23  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 17, 2013\u003C/time\u003E by OrianCEV\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"purpletarget","CreatedById":57317,"CreatedDateTime":"2013-10-17T23:48:33Z","Content":"\n\u003Cp\u003EThe early stages is fertile ground to work out power management...because there is none, other that what the engines provide...and even then, perhaps that\u0027s only during an initial ascent.\u003C/p\u003E\u003Cp\u003EThat said, it is possible to do a full Mun direct and return mission with the power of a single pod, and no additional generation after dumping the initial ascent stage. But it does require careful power management, and maneuvering. (Turning off reaction wheels and SAS during transit, only turn when you need to for a maneuver,etc.)\u003C/p\u003E\u003Cp\u003EThis is one reason that having probes earlier wouldn\u0027t be useful, since the constant power draw, and no additional batteries means that a probe would run itself dead in only a few minutes...and without the power to transmit anything useful back to boot.\u003C/p\u003E\n"}]}