{"TopicId":49010,"ForumId":16,"TopicTitle":"Any longitudinal science missions? Requiring length of stay in space?","CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-10-17T19:23:39Z","PageNum":1,"Articles":[{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-10-17T19:23:39Z","Content":"\n\u003Cp\u003EJust got the SC-9001 Science Jr. and I was wondering if there are any current mechanisms in the game play for multiple reports from a single mission - or anything which encourages multiple orbits or a certain length of stay in space. Or are all science returns based on one-time specific location grabs?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-17T21:21:05Z\u0022 title=\u002210/17/2013 09:21  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 17, 2013\u003C/time\u003E by Oddible\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2013-10-17T19:42:15Z","Content":"\n\u003Cp\u003EYou can well do multiple reports and experiments ...\u003C/p\u003E\u003Cp\u003Eevery report/experiment after the first, that is done in the same situation, has diminishing returns ...\u003C/p\u003E\u003Cp\u003Ebut it definizely generates \u0026gt; 0 science points (until you have done it a lot of times).\u003C/p\u003E\u003Cp\u003EFrom my observations it seems like a follow up experiment generates roughly 25% of the science of the last experiment done in the same situation.\u003C/p\u003E\u003Cp\u003EUnless you donÃ‚Â´t get the whole number of science points for an experiment (for example because you transmitted the experimental data via antenna) ...\u003C/p\u003E\u003Cp\u003Ein this case the reduction of science points for follow-up experiments is greatly reduced.\u003C/p\u003E\u003Cp\u003EAs for length of stay in space ... nope, AFAIK there are no experiments/reports which are influenced by the length of stay in space.\u003C/p\u003E\u003Cp\u003EAs for multiple orbits ... well, to reach certain Biomes you will have to do other orbits than the equatorial (for example in order to reach the poles)\u003C/p\u003E\n"},{"CreatedByName":"KatzOhki","CreatedById":73492,"CreatedDateTime":"2013-10-17T19:50:19Z","Content":"\n\u003Cp\u003EYou can get some additional results if you are orbiting above a unique biome. Also, multiple EVAs can be done.\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-10-17T20:14:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Godot\u0022 data-cite=\u0022Godot\u0022\u003E\u003Cdiv\u003EYou can well do multiple reports and experiments ...\u003Cp\u003Eevery report/experiment after the first, that is done in the same situation, has diminishing returns ...\u003C/p\u003E\u003Cp\u003Ebut it definizely generates \u0026gt; 0 science points (until you have done it a lot of times).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhh of course. I assume you mean transmitting results then doing the experiment again - that didn\u0027t even occur to me because I always wanted maximize my results rate by recovering the vessel and since subsequent reports overwrite prior reports. I guess I wasn\u0027t maximizing at all! Since I could have been taking the partial results from transmitting then recovering a second result. So the question here is... \u003C/p\u003E\u003Cp\u003EIf I have an experiment that gets 12 science, and I transmit the results for 50% (6 science) then I do the experiment again (assuming that this would be for less science? maybe 4 science) and recover for the full 100%, I would end up with less total science for the trip (10 rather than the original 12). Right? So this would really only be a benefit if I don\u0027t plan on recovering. Or if I\u0027m doing intermediate steps (like doing a crew report during liftoff, transmitting, doing another during 100km orbit, transmit, boost to Mun, crew report on orbit, transmit, LAND ON MUN, and save that crew report until recovery since it will be a biggie).\u003C/p\u003E\n"},{"CreatedByName":"Ciechosz","CreatedById":18882,"CreatedDateTime":"2013-10-17T20:14:33Z","Content":"\n\u003Cp\u003EI wonder if performing an experiment on a ship that is later destroyed and thus not able to transmit or take it back to Kerbin reduces your gain from future experiments.\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-10-17T20:26:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ciechosz\u0022 data-cite=\u0022Ciechosz\u0022\u003E\u003Cdiv\u003EI wonder if performing an experiment on a ship that is later destroyed and thus not able to transmit or take it back to Kerbin reduces your gain from future experiments.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the gain is based on the return so if you didn\u0027t transmit or recover you\u0027d get the same pool of science again - definitely something to check though!\u003C/p\u003E\n"},{"CreatedByName":"Ciechosz","CreatedById":18882,"CreatedDateTime":"2013-10-17T20:28:30Z","Content":"\n\u003Cp\u003EA quick test with discarding results suggests that you\u0027re right \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}