{"TopicId":49590,"ForumId":16,"TopicTitle":"What Is The Purpose Of Multiple Communication Devices?","CreatedByName":"RazorWolf19","CreatedById":62293,"CreatedDateTime":"2013-10-20T04:08:41Z","PageNum":1,"Articles":[{"CreatedByName":"RazorWolf19","CreatedById":62293,"CreatedDateTime":"2013-10-20T04:08:41Z","Content":"\n\u003Cp\u003EHi. So, other than variety and aesthetics, is there any real point to use one communication device over another? I assume one may be able to transmit data faster or farther (less science % lost) or more efficiently (less power) but I\u0027ve yet to check in-game (this idea came to me just now and I decided to post before I forget; it\u0027s late).\u003C/p\u003E\u003Cp\u003EAlso, if a ship has multiple communication devices all extended and the player decides to transmit data, would said data transmit faster than if the craft only had one device?\u003C/p\u003E\u003Cp\u003EThanks For Reading,\u003C/p\u003E\u003Cp\u003EHappy Flying! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Baconluver25","CreatedById":44881,"CreatedDateTime":"2013-10-20T04:13:10Z","Content":"\n\u003Cp\u003EIt transmits multiple sets of data at the same time. At least that\u0027s what I\u0027ve found through my science experiments.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-10-20T04:20:06Z","Content":"\n\u003Cp\u003EI put the Communotron 16 and the Comms DTS-M1 on one craft. When I started sending data from one experiment it activated the 16, then while that was sending I did another experiment and sent that and the DTS-M1 automatically opened. So I\u0027m guessing that if 1 is in use data will get sent via the other ones. I\u0027ve not yet tested to see of several antenna can be used to send a single experiment back faster thou.\u003C/p\u003E\n"},{"CreatedByName":"RazorWolf19","CreatedById":62293,"CreatedDateTime":"2013-10-20T04:24:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Baconluver25\u0022 data-cite=\u0022Baconluver25\u0022\u003E\u003Cdiv\u003EIt transmits multiple sets of data at the same time. At least that\u0027s what I\u0027ve found through my science experiments.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, when using multiple communication devices, the data is transferred faster. OK. Thanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. However, my initial question: assuming you have only one antenna on your ship, is it faster/more energy efficient to use the \u0022Communotron 16\u0022 , \u0022Communotron 88-88\u0022 or \u0022Comms DTS-M1\u0022 to transfer your data? Or, does it not matter?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-20T04:26:41Z\u0022 title=\u002210/20/2013 04:26  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 20, 2013\u003C/time\u003E by RazorWolf19\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RazorWolf19","CreatedById":62293,"CreatedDateTime":"2013-10-20T04:25:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EI put the Communotron 16 and the Comms DTS-M1 on one craft. When I started sending data from one experiment it activated the 16, then while that was sending I did another experiment and sent that and the DTS-M1 automatically opened. So I\u0027m guessing that if 1 is in use data will get sent via the other ones. I\u0027ve not yet tested to see of several antenna can be used to send a single experiment back faster thou.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECool! Thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Duxwing","CreatedById":42282,"CreatedDateTime":"2013-10-20T04:27:28Z","Content":"\n\u003Cp\u003ECheck the stats in the mouseover menu: the Communotron 16 has the greatest throughput and least power consumption, mass, and price of all the communication systems. I exclusively use it. If you need even more throughput, then use two.\u003C/p\u003E\u003Cp\u003E-Duxwing\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-10-20T04:33:23Z","Content":"\n\u003Cp\u003EI\u0027m guessing that eventually, Squad will give each antenna model a different effective range, so that you\u0027ll either have to use a more-powerful-but-less-efficient antenna or a relay system to transmit data back to Kerbin. However, right now there\u0027s really no reason not to just use the most basic antenna available.\u003C/p\u003E\n"},{"CreatedByName":"AndrewBCrisp","CreatedById":57119,"CreatedDateTime":"2013-10-20T04:39:15Z","Content":"\n\u003Cp\u003EOkay, stupid question time: what exactly do they mean by \u0022throughput\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-10-20T08:36:54Z","Content":"\n\u003Cp\u003EI have no clue what they mean by throughput. Here\u0027s the real numbers, with the 16 being baseline.\u003C/p\u003E\u003Cp\u003EDTS-M1 transmits in 80% of the time using 150% of the power, given the same data.\u003C/p\u003E\u003Cp\u003E88-88 transmits in 60% of the time using 200% of the power, given the same data.\u003C/p\u003E\u003Cp\u003ESo unless your ship has enough power to run one of the dish antennas with at least an 80% uptime, the 16 will actually turn out faster, since it takes less power to send the same info.\u003C/p\u003E\u003Cp\u003EMultiple antennas can be a mess, the data queueing algorithm looks for an antenna that isn\u0027t sending anything, and if it doesn\u0027t find it, dumps it all on the first antenna it found, resulting in the first antenna having a massive queue and all of the other antennas having a queue of one item.\u003C/p\u003E\n"},{"CreatedByName":"cup a joe","CreatedById":145990,"CreatedDateTime":"2015-06-10T19:21:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EI\u0027m guessing that eventually, Squad will give each antenna model a different effective range, so that you\u0027ll either have to use a more-powerful-but-less-efficient antenna or a relay system to transmit data back to Kerbin. However, right now there\u0027s really no reason not to just use the most basic antenna available.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah that\u0027s what i was thinking too, judging by the size the communitron 16 seems good for near/on kerban but for missions when you are farther away...\u003C/p\u003E\n"},{"CreatedByName":"Prepper-Jack","CreatedById":143834,"CreatedDateTime":"2015-06-10T21:44:32Z","Content":"\n\u003Cp\u003EIn the stock game, you can usually get away with the base model for most purposes. There are certain situations where higher throughput might be helpful, however. If you\u0027re sending probes out and about, it can be tedious to send everything over a single base antenna. So, you either add a few more, or go with a faster dish. But, really, the top of the line model is most useful for research stations, which can have the power resources that are required. Transferring 500 science takes forever on the base model..\u003C/p\u003E\u003Cp\u003EIf you play with RemoteTech, they\u0027re a bit more interesting.\u003C/p\u003E\n"},{"CreatedByName":"ajburges","CreatedById":26570,"CreatedDateTime":"2015-06-10T22:48:16Z","Content":"\n\u003Cp\u003ERealistically, asthetics are the real reason to run other antenna. The 16 is the lightest. Since electricity is renewable and time is of no consequence, mass will trump most considerations.\u003C/p\u003E\u003Cp\u003ESomeone will need to dig in the cfg files, but the DTS looks like it should have less drag than the others when stowed. Given the small size of stowed antennas and the mass cost of service bays, it would be a niche advantage even if true.\u003C/p\u003E\u003Cp\u003EThe 88 could work decent with MPL, you may keep MPL ships inactive while they process data and such ships have great power generation. The 88 for a light mass hit will reduce the active time needed to transmit research.\u003C/p\u003E\n"},{"CreatedByName":"Snark","CreatedById":125662,"CreatedDateTime":"2015-06-11T06:04:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Prepper-Jack\u0022 data-cite=\u0022Prepper-Jack\u0022\u003E\u003Cdiv\u003EIf you play with RemoteTech, they\u0027re a bit more interesting.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B1 to this. It\u0027s a really fun mod, adds a whole new dimension of strategy to the game. Among its challenges is that it actually gives you a reason to have to think about what antennas to use, and adds several new types.\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2015-06-11T06:39:48Z","Content":"\n\u003Cp\u003EIt\u0027s worth noting that there is a display bug with the antenna bandwidth readout in the VAB (I\u0027m fairly sure it wasn\u0027t fixed in 1.0.x) where the speed defined in seconds per packet is given as packets per second. This makes the base whip antenna \u003Cem\u003Eappear\u003C/em\u003E to have the best bandwidth, whereas in fact (as Eric S\u0027 experiment shows) it actually has the worst.\u003C/p\u003E\u003Cp\u003EI personally fin that using the whip antenna gets tedious for probes or ships using any experiment above about the CC Seismometer, so I tend to equip later-game probes with the dish (it looks so cool anyway) and enough batteries to transmit at least one of the largest experiments on board solely from stored power.\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2015-06-11T13:17:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EMultiple antennas can be a mess, the data queueing algorithm looks for an antenna that isn\u0027t sending anything, and if it doesn\u0027t find it, dumps it all on the first antenna it found, resulting in the first antenna having a massive queue and all of the other antennas having a queue of one item.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis. And that they open and close for each transmission, even if we have opened them manually. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}