{"TopicId":49648,"ForumId":16,"TopicTitle":"Caught at Sun\u0026#039;s orbit","CreatedByName":"Nostur","CreatedById":10400,"CreatedDateTime":"2013-10-20T13:01:10Z","PageNum":1,"Articles":[{"CreatedByName":"Nostur","CreatedById":10400,"CreatedDateTime":"2013-10-20T13:01:10Z","Content":"\n\u003Cp\u003EHey, I just failed one manouvre and settled down at an orbit around Sun, appx. the same diameter as Kerbin\u0027s orbit around it. My question is - What is the best approach to launch myself to some other planet? I tried setting up multiple manouvres but none was successfull at catching a planet, it just changed my orbit. Can anyone help me, or at least tell me what should I do now? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Thanks\u003C/p\u003E\n"},{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2013-10-20T13:08:02Z","Content":"\n\u003Cp\u003Elaunch at correct planetary phase alignment, boost your orbit so your escape trajectory will match your current orbital body\u0027s prograte or retrograde direction. the main point is getting to the point where the planet is at the same time the planet is there.\u003C/p\u003E\u003Cp\u003Echeck this out\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E it will tell you when to launch, when to begin burning in your orbit so your speed relative to the sun will be decreased or increased to match the orbital body you are wishing to go, you do not need to go to begin manuvers and burns to go to a planet. just use the burn at your current location, such as kerbin, if you are familiar with gravity assists, having tiny burns to make huge differences in your sun orbital trajectory, get to eve at the correct time from the correct way, from eve you can get to anywhere\u003C/p\u003E\n"},{"CreatedByName":"Nostur","CreatedById":10400,"CreatedDateTime":"2013-10-20T13:22:05Z","Content":"\n\u003Cp\u003EI know that website, however it has no option to specify transfer from Sun\u0027s orbit. However I\u0027ll try setting up manouvres to reach eve, thanks for help\u003C/p\u003E\n"},{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2013-10-20T13:25:53Z","Content":"\n\u003Cp\u003Eno problem, it is explained on the site that it only gives information of trajectory between bodies orbiting the same body, like 2 planets, but not like kerbin to minmus or alike, i dont know why, it could have ben a great help if they ve added that,\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-20T14:19:18Z","Content":"\n\u003Cp\u003EI would guess at that point you would just burn prograde when your destination planet was in the correct alignment. Don\u0027t phase angles only apply so you get the correct prograde vector relative to the planet?\u003C/p\u003E\n"},{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2013-10-20T14:20:56Z","Content":"\n\u003Cp\u003Ephase aplies when you do a planetery burn not in suns orbit but in your origin, gee , phase does matter, being at the place where planet is , easy, being there at the same time matters\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-20T14:23:24Z","Content":"\n\u003Cp\u003ESorry I was saying phase angle meant ejection angle. Since he\u0027s in an orbit similar to Kerbin his ejection angle no longer matters but his phase angle should be roughly the same as Kerbins, I would think.\u003C/p\u003E\n"},{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2013-10-20T15:04:22Z","Content":"\n\u003Cp\u003Eyeah you are rigth ejection angle doesnt matter there, itmatters when you begin from a planet\u003C/p\u003E\n"},{"CreatedByName":"reilem","CreatedById":41307,"CreatedDateTime":"2013-10-20T15:49:50Z","Content":"\n\u003Cp\u003EI don\u0027t know why no one else has told you this (or maybe they did and i didn\u0027t read it) all you do is you take the site and plug in: kerbin -\u0026gt; eve. Then you take the phase angle given and just wait until the angle between eve and your craft is the phase angle that is given on the site. Your craft is now \u0027acting\u0027 as kerbin and you basically just make your orbit around the sun bigger as you would with any regular interplanetary burn only this time you don\u0027t need to exit kerbin first.\u003C/p\u003E\n"},{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2013-10-20T15:59:11Z","Content":"\n\u003Cp\u003Eexcept if you want to go to a place why would you go to suns orbit to start adjusting anyway, just start immidiatly where you are, since beginning at suns orbit is a little bit off from anywher close to sun,\u003C/p\u003E\u003Cp\u003Ebut beginning at kerbin is a nice way to have oobart affect on you to be more efficent, its usualy better to start from a planet than in sun orbit travel\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2013-10-20T18:32:50Z","Content":"\n\u003Cp\u003EYou basically have two options:\u003C/p\u003E\u003Cp\u003E1. Burn retrograde and intercept Eve\u0027s orbit, fix inclination and pray they\u0027ll eventually meet up.\u003C/p\u003E\u003Cp\u003E2. Circularize at the nearest planet\u0027s orbit then use KSP Olex to find the phase angle. Since you\u0027re the \u0022planet\u0022 you can use nodes to burn at the right angle and you might get an encounter like that.\u003C/p\u003E\n"},{"CreatedByName":"Nostur","CreatedById":10400,"CreatedDateTime":"2013-10-20T18:45:03Z","Content":"\n\u003Cp\u003EAlright, update: I was able to set up a stable orbit around Jool, and then visit one of his moons. However, right now I have to activate the infinite fuel cheat, because I don\u0027t have enough fuel to return back to Kerbin. I don\u0027t wanna terminate the flight too, I don\u0027t wanna loose Jeb \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-10-20T19:27:34Z","Content":"\n\u003Cp\u003EWhat about sending a rescue mission? You now know what it takes so you can do it better this time.\u003C/p\u003E\u003Cp\u003EIf you want to cheat, you can just edit Jeb back to the KSC.\u003C/p\u003E\n"},{"CreatedByName":"AndreyATGB","CreatedById":62674,"CreatedDateTime":"2013-10-20T19:43:58Z","Content":"\n\u003Cp\u003EFYI, Jeb respawns after some time. You won\u0027t lose him.\u003C/p\u003E\n"},{"CreatedByName":"Nostur","CreatedById":10400,"CreatedDateTime":"2013-10-20T19:46:13Z","Content":"\n\u003Cp\u003EWell I don\u0027t feel like rescuing him, I was never good at randezvous without some aid from MechJeb, and I stopped using it when the latest version came out.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-10-20T20:30:41Z","Content":"\n\u003Cp\u003EYou can become good at rendezvous without using MechJeb. It\u0027s not hard. There\u0027s ton of tutorials and explanations available. And you\u0027ll learn something useful for other parts of the game.\u003C/p\u003E\n"},{"CreatedByName":"EndOfTheEarth","CreatedById":24503,"CreatedDateTime":"2013-10-20T23:41:31Z","Content":"\n\u003Cp\u003EHi there. I used to do all my interplanetary transfers from solar orbit (I no longer do, because it wastes fuel). So the way to get to a planet from a solar orbit is like getting to the Mun from Kerbin orbit:\u003C/p\u003E\u003Cp\u003E1) Select your destination planet as your destination by right clicking on the planet.\u003C/p\u003E\u003Cp\u003E2) Use a maneuver node on some point in your orbit, and play with the prograde/retrograde sliders until your orbit overlaps the orbit of your target planet.\u003C/p\u003E\u003Cp\u003E3) Slide the maneuver node around your orbit until you see a Sphere-of-Influence (SoI) intercept.\u003C/p\u003E\u003Cp\u003E 3b) If nowhere on your orbit results in an intercept, Time accelerate through one complete orbit of the sun, then repeat step 3.\u003C/p\u003E\u003Cp\u003E4) Once you have that intercept, make your burn. You should evenly space the burn so that half of the burn takes place immediately before the node, and half takes place immediately after. If you begin buring at the node, you may not make it. This means doing math in you head (suggested burn time/2). If you cannot do the math in your head, then turn time acceleration down long before you ever reach the node, and do the math on paper or with a calculator.\u003C/p\u003E\u003Cp\u003E5) After your burn, cancel the node, wait a few seconds, then plan an adjustment burn using another maneuver node a little further into your orbit. Play with all the sliders until you are close enough to the planet to that it is visibly curing the orbit. If you\u0027re headed back to Kerbin, try for a collision course.\u003C/p\u003E\u003Cp\u003E6) Wait.\u003C/p\u003E\u003Cp\u003E7) Once you enter the target planet\u0027s SOI, prepare a circulization burn as you would around the Mun or Minmus. If you\u0027re on a collision course for Kerbin, separate the capsule and let gravity do the rest. Do NOT deploy your chutes above 4000m unless landing in mountains, as this will be a high-G reentry.\u003C/p\u003E\u003Cp\u003EAgain, this wastes fuel, and your ship will arrive at its destination with little or no fuel left for a powered landing. Unless you have a really good fuel tanker waiting in the wings, this is a one-way trip, or this is a probe, I\u0027d abort and start over.\u003C/p\u003E\n"},{"CreatedByName":"TheReaper","CreatedById":75943,"CreatedDateTime":"2013-10-20T23:44:16Z","Content":"\n\u003Cp\u003Eyou cant kill jebediah, he is the god at reaperaing\u003C/p\u003E\n"}]}