{"TopicId":49890,"ForumId":16,"TopicTitle":"How do play this game without Engineer Redux?","CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2013-10-21T15:57:13Z","PageNum":1,"Articles":[{"CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2013-10-21T15:57:13Z","Content":"\n\u003Cp\u003EWhenever I try playing without Engineer Redux I have very little idea how to do anything efficiently. The biggest problem is not knowing the TWRs (Thrust to Weight Ratios) and delta-Vs. Without Engineer Redux it seems to be all guess-work and trial and error. I realize that I could calculate these values but I\u0027d prefer to spend my time on other issues. Am I missing something?\u003C/p\u003E\n"},{"CreatedByName":"Rage097","CreatedById":66193,"CreatedDateTime":"2013-10-21T16:02:52Z","Content":"\n\u003Cp\u003EI tend to play everything out by eye and guesswork. This is effective for round trips to the Mun and Minmus with extra fuel left in certain stages. I can also guess my way to other planets. but going to and LANDING then RETURNING form other planets will require more planning. You kinda have to use common sense and guess it if you don\u0027t want to do the calculations.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2013-10-21T16:03:18Z","Content":"\n\u003Cp\u003EThe key is... don\u0027t know that stuff. Guess, and get a feel for what is enough. You can do it. Waste fuel. leave spent stages in orbit. Don\u0027t break 250m/s until you\u0027ve broken 10,000 meters on ascent, but otherwise ignore atmospheric drag. If your engine can\u0027t push you, you know your TWR is too low and you need a bigger engine (or more engines). Otherwise you just need to fiddle.\u003C/p\u003E\u003Cp\u003EHonestly though I (like you) prefer not to do all that. Engineer was one of the first mods I installed on upgrading and don\u0027t feel bad about it at all. Why are you trying to play without it if playing with it is more fun?\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2013-10-21T16:05:37Z","Content":"\n\u003Cp\u003EI use mechjeb\u003C/p\u003E\n"},{"CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2013-10-21T16:10:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EThe key is... don\u0027t know that stuff. Guess, and get a feel for what is enough. You can do it. Waste fuel. leave spent stages in orbit. Don\u0027t break 250m/s until you\u0027ve broken 10,000 meters on ascent, but otherwise ignore atmospheric drag. If your engine can\u0027t push you, you know your TWR is too low and you need a bigger engine (or more engines). Otherwise you just need to fiddle.\u003Cp\u003EHonestly though I (like you) prefer not to do all that. Engineer was one of the first mods I installed on upgrading and don\u0027t feel bad about it at all. Why are you trying to play without it if playing with it is more fun?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess I\u0027m trying to enjoy the game as Squad presents it (ie. stock). I am trying to demonstrate to myself that playing without this information can be just as fun. But I just don\u0027t like it. I can\u0027t figure out why Squad doesn\u0027t include this basic information. They give you lots of other numbers (mostly velocities and distances) elsewhere.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T16:15:31Z\u0022 title=\u002210/21/2013 04:15  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by Gus\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Gus","CreatedById":68154,"CreatedDateTime":"2013-10-21T16:12:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022briansun1\u0022 data-cite=\u0022briansun1\u0022\u003E\u003Cdiv\u003EI use mechjeb\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was waiting for that answer. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-10-21T16:16:00Z","Content":"\n\u003Cp\u003EAdd these two lines to the config file of the specific Engineer part you want to use (under \u0022Editor Parameters\u0022):\u003C/p\u003E\u003Cp\u003E TechRequired = start\u003C/p\u003E\u003Cp\u003E entryCost = 0\u003C/p\u003E\u003Cp\u003EYou\u0027ll have to go to the tech tree, click on \u0022start\u0022 and activate the part but that\u0027s about it. I\u0027m considering to do the same with mechjeb. I don\u0027t see adding mods like those as \u0022overriding\u0022 the tech tree, they are just tools that remove boring, repetitive tasks out of the game for me.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-10-21T16:29:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gus\u0022 data-cite=\u0022Gus\u0022\u003E\u003Cdiv\u003EWhenever I try playing without Engineer Redux I have very little idea how to do anything efficiently. The biggest problem is not knowing the TWRs (Thrust to Weight Ratios) and delta-Vs. Without Engineer Redux it seems to be all guess-work and trial and error. I realize that I could calculate these values but I\u0027d prefer to spend my time on other issues. Am I missing something?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESame my friend. Unless you have personal knowledge of rocketry, or considerable amounts of time to do various experiments. It\u0027ll be hard to get a grasp of whats\u0027 going on. And this compounds itself once you want to make complicated crafts or missions. There is nothing more frustrating to do a long mission, just to realize you didn\u0027t calculate your TWR right for landing/launching or wtvr.\u003C/p\u003E\u003Cp\u003EImagine if NASA worked like that, 2 scientists get together, no calculations and say How many of those orange tanks we need to go up there? 2? 3? Maybe let\u0027s go for 3. I mean, lol, the image makes me laugh a lot. But to get back to the issue, I would reintegrate Engineer redux into the tech tree. I mean stock pods should have all this data available on stock. How has the time to take out a calculator and figure out delta Vs by hand? Not me.\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2013-10-21T16:31:19Z","Content":"\n\u003Cp\u003Eyou know you can just test your landers with hyperedit right?(and how do you think NASA got started?)\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-10-21T16:39:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gus\u0022 data-cite=\u0022Gus\u0022\u003E\u003Cdiv\u003EI guess I\u0027m trying to enjoy the game as Squad presents it (ie. stock). I am trying to demonstrate to myself that playing without this information can be just as fun. But I just don\u0027t like it. I can\u0027t figure out why Squad doesn\u0027t include this basic information. They give you lots of other numbers (mostly velocities and distances) elsewhere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBecause the mods have done it already, between Engineer, MechJeb and Protractor you have all you need. There are myriad other mods that do similarly. It is a moddable game that was always meant to have a strong modding community (hence the mod API being added so early). Best to have Squad working on things in the game that can\u0027t be done with mods. Maybe they\u0027ll add an internal version of Engineer some day, but no need for it now.\u003C/p\u003E\u003Cp\u003EOf course the answer to your actually question is: DOCUMENTATION AND MATH. \u003C/p\u003E\u003Cp\u003EIf you don\u0027t find that fun, then use the wiki, \u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz/\u003C/a\u003E, and mods \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-10-21T16:42:10Z","Content":"\n\u003Cp\u003EPen and a small scratch pad to figure out weights, and a scientific calculator of some kind (I use Excel 2003 to easily update my calculations, you could also use Google docs for free) for LN and EXP.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/w19eC0Z.png\u0022 alt=\u0022w19eC0Z.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERemember that except for the tiny fuel containers the fuel weight ratio is always 8:1 (8 tons of fuel for every 1 ton of dry storage). Also that 1 ton of fuel (1 \u002B 1/8 if dry mass is included) is 80 L of fuel plus the oxydizer.\u003C/p\u003E\u003Cp\u003EThe rest can be done with a bit of educated guess work and a bit of testing. This method also lets you reverse the formula - you can figure out the weight of your ship without any fuel tanks, then compute how much fuel is required to achieve a specific delta-v (I\u0027m not sure if Engineer lets you do that, I haven\u0027t used any mods).\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-10-21T16:59:46Z","Content":"\n\u003Cp\u003EI don\u0027t have problems with other people using mods, but I\u0027m trying to enjoy the game unmodded. Guesswork is part of the fun for me. The statement \u0022it\u0027s problem that I have to guess the TWR\u0022 is about the same as \u0022it\u0027s problem that I have to guess where others are\u0022 in FPS and using it as argument for using wallhack cheat.\u003C/p\u003E\u003Cp\u003ENow, I\u0027m not saying people using mods are cheating. The game\u0027s not finished and it\u0027s not clear what will make it to the final release and what will not. But people playing with mods calculating TWR and dv for them are definitely playing a different game.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-10-21T17:02:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022briansun1\u0022 data-cite=\u0022briansun1\u0022\u003E\u003Cdiv\u003Eyou know you can just test your landers with hyperedit right?(and how do you think NASA got started?)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow is using HyperEdit easier than Engineer or MechJeb in the vab? Also, i\u0027d say that it detracts further from \u0022enjoying the game from a stock perspective\u0022. But that\u0027s just me.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EI don\u0027t have problems with other people using mods, but I\u0027m trying to enjoy the game unmodded. Guesswork is part of the fun for me. The statement \u0022it\u0027s problem that I have to guess the TWR\u0022 is about the same as \u0022it\u0027s problem that I have to guess where others are\u0022 in FPS and using it as argument for using wallhack cheat.\u003Cp\u003ENow, I\u0027m not saying people using mods are cheating. The game\u0027s not finished and it\u0027s not clear what will make it to the final release and what will not. But people playing with mods calculating TWR and dv for them are definitely playing a different game.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure the parallel you are trying to make between cheating in an FPS, and having flight/construction data available to you? Maybe you are referring to mods that having engines hat consume no fuel, or perhaps over powered parts. But mods that give you access to data is not cheating.\u003C/p\u003E\u003Cp\u003ETo compare wanting that data with using wallhacks in an FPS is a bit of a stretch.\u003C/p\u003E\u003Cp\u003EAlso, as you said. It depends what you want out of KSP. I tend to be a bit on the nerdy/semi realistic side of things. So blindly launching stuff in my mind is insane. lol. It\u0027s a bit like when the maneuver nodes were added, some purists were saying that it was cheating to use it. To each his own. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T17:08:16Z\u0022 title=\u002210/21/2013 05:08  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by MedievalNerd\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Simon Ross","CreatedById":82582,"CreatedDateTime":"2013-10-21T17:06:29Z","Content":"\n\u003Cp\u003EThink like a lot of people, I am trying to play career mode as \u0027vanilla\u0027 as possible, but my sandbox version is chock full of mods and aids. Really don\u0027t think there is anything wrong with enjoying playing both versions of the game. Some days I want a real challenge and fire up career mode, other days I simply want to put together impossible ships and fly them around the solar system. Both versions are equally valid, it\u0027s simply depends on the mood I am in at the time.\u003C/p\u003E\n"},{"CreatedByName":"Karriz","CreatedById":58036,"CreatedDateTime":"2013-10-21T17:10:38Z","Content":"\n\u003Cp\u003EI don\u0027t think Engineer redux (or Mechjeb windows) is a cheat by any means - you \u003Cem\u003Ecould\u003C/em\u003E calculate delta-V and TWR it by yourself, but Engineer redux just conveniently gives the numbers to you, which makes sense from gameplay perspective.\u003C/p\u003E\u003Cp\u003EI also have a similar kind of a habit. I want to know if my rocket has enough delta-V to reach it\u0027s destination. I also like to use protractor to get the most fuel efficient launch windows. I just want the numbers, no autopilot. I think these will be implemented to the game eventually in one way or another.\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2013-10-21T17:11:53Z","Content":"\n\u003Cp\u003Ethe post was in answer to this \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThere is nothing more frustrating to do a long mission, just to realize you didn\u0027t calculate your TWR right for landing/launching\u003C/div\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-21T17:17:20Z\u0022 title=\u002210/21/2013 05:17  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 21, 2013\u003C/time\u003E by briansun1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"aNewHope","CreatedById":76088,"CreatedDateTime":"2013-10-21T17:12:40Z","Content":"\n\u003Cp\u003ESince the 0.22 update I play stock. Eyeballing missions to the Mun, Minmus, Duna and Eve is totally possible. I even got a probe to a close flyby with Moho and returned it to Kerbin (I really don\u0027t like the repeat-experiment-and-send-data way of playing).\u003C/p\u003E\u003Cp\u003EBut now I want to try a mission to Eeloo with landing and return. Guess I have to get the engineer again.\u003C/p\u003E\n"},{"CreatedByName":"MedievalNerd","CreatedById":84735,"CreatedDateTime":"2013-10-21T17:14:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022briansun1\u0022 data-cite=\u0022briansun1\u0022\u003E\u003Cdiv\u003Ethe post was in answer the this\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOh I see! With Engineer I simply switch the celestial bodie\u0027s gravity to use. And there we go. Although I\u0027m working on a mission pack and perhaps using hyperedit to tag locations might be helpful... I\u0027ll give it a spin.\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2013-10-21T17:17:39Z","Content":"\n\u003Cp\u003Eor you know just go there\u003C/p\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2013-10-21T17:23:09Z","Content":"\n\u003Cp\u003EIt\u0027s simple enough to just do some rough calculations for things like TWR. Add up the mass of the stage in question, multiply by 10, and see if your total engine thrust is more than that. If it is, congratulations! you have TWR \u0026gt; 1.0 on Kerbin, which means you\u0027ll be able to lift off/land anywhere but Eve.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t want massive TWR safety margins on your landers, then just cut your thrust to like a third for Duna and a sixth for the Mun.\u003C/p\u003E\n"},{"CreatedByName":"Supernovy","CreatedById":29617,"CreatedDateTime":"2013-10-21T17:32:09Z","Content":"\n\u003Cp\u003EUsing the map screen mass readout on the right of the map screen, and the resources display (set to stage only) you can figure out the delta-v at any point in flight via:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Eln[mass/(mass-0.005(liquid fuel \u002B oxidiser))]*9.82*Isp\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EYou either have to remember the engine\u0027s stats, or just right click it to check Isp. It gets a little trickier with multiple engines, but Thrust = mass flow rate * Isp * 9.82, and the flow rate given in the right click menu for engines is the volume flow rate, so:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EThrust/(flow*0.005*9.82) = Isp\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFor the sum of the thrusts and flow rates.\u003C/p\u003E\u003Cp\u003ELastly, TWR is fairly easy, you just have to know the surface gravity of the body (e.g. from the \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Main_Page\u0022 rel=\u0022external nofollow\u0022\u003Ewiki\u003C/a\u003E) or bring a Gravioli detector or Accelerometer, which gives you gravitational acceleration in m/s/s or gees respectively. 9.81 * (gees) = m/s/s.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003ETWR = Thrust/(mass * gravity)\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe thrust is again the sum of all the thrusts on active engines, and the mass from the map screen readout.\u003C/p\u003E\u003Cp\u003ESo as long as you have a calculator that can do natural logs (ln), like the windows calculation in scientific mode, you can figure out all of these things. In the VAB, you\u0027ll have to momentarily bring the craft out to the launchpad to get some of these readings, though. You could think of it as ground tests or engine static firings.\u003C/p\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-10-21T17:34:39Z","Content":"\n\u003Cp\u003EHey, be glad we at least have a stock mass readout in flight now.\u003C/p\u003E\u003Cp\u003EIf you\u0027re the type to make spreadsheets to do calculations about a game (I sure am), you can recreate pretty much all of the calculations that MechJeb and Engineer do for you, at least the VAB design-related ones. Having it there live in the game for you just makes the whole process faster and easier.\u003C/p\u003E\n"},{"CreatedByName":"Stankleberry","CreatedById":76321,"CreatedDateTime":"2013-10-21T17:38:35Z","Content":"\n\u003Cp\u003EI tried playing career mode for about 10 minutes before I fixed Kerbal Engineer to be available from the beginning in all of the pods.\u003C/p\u003E\n"},{"CreatedByName":"DMagic","CreatedById":57416,"CreatedDateTime":"2013-10-21T17:48:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Gus\u0022 data-cite=\u0022Gus\u0022\u003E\u003Cdiv\u003EI guess I\u0027m trying to enjoy the game as Squad presents it (ie. stock). I am trying to demonstrate to myself that playing without this information can be just as fun. But I just don\u0027t like it. I can\u0027t figure out why Squad doesn\u0027t include this basic information. They give you lots of other numbers (mostly velocities and distances) elsewhere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI understand this philosophy; there are good reasons to not use Engineer/MJ, but there are also good reasons for why not to overload users with information in the stock game. Though I think career mode presents a good opportunity to introduce this kind of info in a more reasonable way. \u003C/p\u003E\u003Cp\u003EOne piece of information that I do wish were made more readily available is the craft mass. You can get it from the map, but it would be nice to be able to see this somehow in the VAB. Basically everything you need to know can be calculated from the information readily available (amount of fuel, thrust, ISP), total mass is the only missing component (and adding up 200 parts is no fun).\u003C/p\u003E\u003Cp\u003EAnother issue that I have with Engineer/MJ is that they force you (or at least guide you) into the design standards that they can deal with. For instance, RCS powered landers are completely feasible and in many cases very useful, but those mods just give you a blank stare when you try to incorporate them. Or take the case of a standard Apollo style lander/orbiter. It\u0027s hard to find out the available deltaV at each stage because the lander ends up much lighter when it returns to dock with the orbiter.\u003C/p\u003E\u003Cp\u003EThere are ways around some of these limitations, but I usually resort to calculating by hand when I make designs like this. And that\u0027s not something that a lot of people will want to do when they have the tools that can work with different designs.\u003C/p\u003E\n"},{"CreatedByName":"rhoark","CreatedById":57151,"CreatedDateTime":"2013-10-21T19:38:32Z","Content":"\n\u003Cp\u003EThe way Squad intends KSP is with mods. That\u0027s why they provide modding. Developers play with mods in their own games.\u003C/p\u003E\n"}]}