{"TopicId":50250,"ForumId":16,"TopicTitle":"Losing science points","CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-10-23T18:05:56Z","PageNum":1,"Articles":[{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-10-23T18:05:56Z","Content":"\n\u003Cp\u003ELet\u0027s say I have the following situation, starting at 0 science points:\u003C/p\u003E\u003Cp\u003E1. I have a craft with 400 science points land back at Kerbin.\u003C/p\u003E\u003Cp\u003E2. I recover it.\u003C/p\u003E\u003Cp\u003E3. I get 400 science points in my R\u0026amp;D center.\u003C/p\u003E\u003Cp\u003E4. I unlock some nodes and I am left with 80 science.\u003C/p\u003E\u003Cp\u003E5. I have another craft with 100 SP in it.\u003C/p\u003E\u003Cp\u003E6. Recover it.\u003C/p\u003E\u003Cp\u003ENow comes the fun part:\u003C/p\u003E\u003Cp\u003E7. When I open the R\u0026amp;D Center I have 100 SP...instead of 180.\u003C/p\u003E\u003Cp\u003EAm I missing something or should I report a bug?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-24T06:53:10Z\u0022 title=\u002210/24/2013 06:53  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 24, 2013\u003C/time\u003E by smunisto\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-10-23T18:14:41Z","Content":"\n\u003Cp\u003EThat\u0027s not a bug - the number shown in blue when you recover a craft is your cumulative unspent Science total. The second craft didn\u0027t earn 100 Science, it earned 20 - you can check the totals of the recovered tasks to be sure.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-10-23T18:20:11Z","Content":"\n\u003Cp\u003ETwo words: Diminishing returns.\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2013-10-23T18:27:11Z","Content":"\n\u003Cp\u003ESo when I click recover - the total in the summary window shows my total unspent science?\u003C/p\u003E\u003Cp\u003EOr the top right Science Points counter in the R\u0026amp;D center shows the unspent one? Or both?\u003C/p\u003E\u003Cp\u003EI will check a little more, I am sure the answer is retardedly easy, I can\u0027t seem to get the hang of it though.\u003C/p\u003E\u003Cp\u003ELet\u0027s give the same example with better explanation on my side. We start with 0 SP again:\u003C/p\u003E\u003Cp\u003E1. I land and recover a craft on Kerbin - the summary window shows I earned 100 SP.\u003C/p\u003E\u003Cp\u003E2. I open the R\u0026amp;D Center and, logically, I have 100 SP in the top right corner.\u003C/p\u003E\u003Cp\u003E3. I spend 90 SP and now I have 10 SP in the R\u0026amp;D Center counter.\u003C/p\u003E\u003Cp\u003E4. I recover a second craft - the summary window shows I earned 20 SP.\u003C/p\u003E\u003Cp\u003EIf I understand your explanation correctly, the second craft earned 10 SP, and the other 10 were my remaining unused amount from the previous flight.\u003C/p\u003E\u003Cp\u003EAnd now my R\u0026amp;D Center counter will show 20 SP.\u003C/p\u003E\u003Cp\u003ECorrect?\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-10-23T18:32:37Z","Content":"\n\u003Cp\u003EThat sounds about right from my experience.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2013-10-23T18:40:27Z","Content":"\n\u003Cp\u003EIndeed - now you\u0027ve got it.\u003C/p\u003E\n"},{"CreatedByName":"professorbarba","CreatedById":102201,"CreatedDateTime":"2014-01-30T00:50:41Z","Content":"\n\u003Cp\u003Esmunisto, I have the same problem.\u003C/p\u003E\u003Cp\u003EHeadHunter67: no, that\u0027s not the case for me, because sometimes I recover vessels with less science points then the amount of un-used points I had from the previous mission, and the total number I got is from the last mission. To verify it, I did the following experiment: I had 84 un-used science points from my last mission. I launched a small test mission nearby the space center. When I recover the vessel, the game told me I earned 5 science points. That number cannot be a cumulative one. When I open the R\u0026amp;D center, I had 5 instead of 89.\u003C/p\u003E\u003Cp\u003EIf the game is not mean to be like that, it \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Eis\u003C/span\u003E a bug.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-01-30T02:46:00Z","Content":"\n\u003Cp\u003ENo, it\u0027s not. It\u0027s not something the devs can fix, because that issue is caused by KSP not being able to read from or write properly to the save folder or persistence file. If you\u0027re using the Steam version of KSP, you\u0027ll need to locate your Kerbal Space Program folder and make sure it (and all subfolders/files) do \u003Cstrong\u003Enot\u003C/strong\u003E have Read-Only set.\u003C/p\u003E\u003Cp\u003EIf not (and you\u0027re using Windows), make sure that KSP is not installed anywhere in the following locations (including subfolders): Desktop, Documents, C:\\Users\\, C:\\Program Files (x86), C:\\Program Files, C:\\Windows. If it is in any of these locations, you will need to \u003Cstrong\u003Ecopy\u003C/strong\u003E KSP out (Windows\u0027 \u003Cem\u003EMove\u003C/em\u003E command won\u0027t do the job well enough) into a better location, e.g., C:\\Games\\KSP or C:\\KSP. \u003C/p\u003E\u003Cp\u003EIf you\u0027re using a Mac, on the other hand, you need to manually set the correct permissions on the main KSP folder, following the instructions listed in [thread=24536]this thread[/thread].\u003C/p\u003E\u003Cp\u003EIf it persists still, open up a thread in the Support \u0026amp; Bugs section of the forum and give as much info as you can, and we\u0027ll see if we can sort it out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-01-30T03:19:19Z","Content":"\n\u003Cp\u003EWhen you recover a vessel the blue text shows your total, but there is also a white number just above that which shows the number that your vessel got.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-01-30T17:26:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vexx32\u0022 data-cite=\u0022vexx32\u0022\u003E\u003Cdiv\u003E...If not (and you\u0027re using Windows), make sure that KSP is not installed anywhere in the following locations (including subfolders): Desktop, Documents, C:\\Users\\, C:\\Program Files (x86), C:\\Program Files, C:\\Windows....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHuh? It shouldn\u0027t be in C:\\Progam Files? I simply unzipped the download to there, where is recommended instead?\u003C/p\u003E\n"}]}