{"TopicId":50452,"ForumId":16,"TopicTitle":"How do I center the camera in the VAB?","CreatedByName":"Waymer","CreatedById":49933,"CreatedDateTime":"2013-10-24T22:11:36Z","PageNum":1,"Articles":[{"CreatedByName":"Waymer","CreatedById":49933,"CreatedDateTime":"2013-10-24T22:11:36Z","Content":"\n\u003Cp\u003EBeen trying to figure this out for a while now and it makes me want to pull my hair out.\u003C/p\u003E\u003Cp\u003EIf I create a new craft, the camera centers around its center of mass. If I load an existing one, the camera is centered around a point in space, not the craft.\u003C/p\u003E\u003Cp\u003EThis makes editing the craft really awkward and nearly impossible, since if I need to do anything that requires a different angle I have to move the camera and the craft in some vain attempt to get a better point of view.\u003C/p\u003E\u003Cp\u003ECan someone help me out here?\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-10-25T02:38:30Z","Content":"\n\u003Cp\u003EI believe it centers around the craft, actually. It appears to be centered to the side of the craft due to the craft not being in the center of the screen; the camera is centered around a point on the right of the screen so the parts menu does not block your view.\u003C/p\u003E\u003Cp\u003EI really wish there were a setting to center the camera to the screen, though because I tend to find this disorienting and annoying.\u003C/p\u003E\n"},{"CreatedByName":"epima09","CreatedById":90003,"CreatedDateTime":"2013-10-25T02:43:00Z","Content":"\n\u003Cp\u003EI hold down middle mouse button and scroll up and down to get the angle.\u003C/p\u003E\u003Cp\u003EDid you tried that method?\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-10-25T03:03:17Z","Content":"\n\u003Cp\u003EI quite like being centre around the CoG, it usually lets you know you\u0027ve had a major malfunction before things start to go really wrong. At least enough time to scramble for the abort button. \u003C/p\u003E\u003Cp\u003EThat being said I wish there was a way to lock the camera to the rotation of the craft when docking. I pretty well much ignore what is happening on screen and dock purely on instrumentation, only ever looking at the screen to judge my distance from target.\u003C/p\u003E\n"},{"CreatedByName":"Thogapotomus","CreatedById":83257,"CreatedDateTime":"2013-10-25T03:41:12Z","Content":"\n\u003Cp\u003EYou can always select the whole craft with shift\u002Bclick or clicking the capsule and move it around as you see fit.\u003C/p\u003E\u003Cp\u003EAnd if you\u0027re docking, hit V a couple times to get the chase camera. It locks your view to the craft.\u003C/p\u003E\n"},{"CreatedByName":"FlamedSteak","CreatedById":67223,"CreatedDateTime":"2013-10-25T03:50:17Z","Content":"\n\u003Cp\u003EYou sir, are my new hero.\u003C/p\u003E\n"},{"CreatedByName":"MrDave","CreatedById":64401,"CreatedDateTime":"2013-10-25T04:15:07Z","Content":"\n\u003Cp\u003EIf you press and hold the mouse wheel, you can adjust the camera in the VAB.\u003C/p\u003E\n"},{"CreatedByName":"FITorion","CreatedById":7606,"CreatedDateTime":"2013-10-25T04:19:35Z","Content":"\n\u003Cp\u003EAs far as I\u0027m aware the VAB camera is always centered on the center of the VAB regardless of what craft you have...\u003C/p\u003E\n"},{"CreatedByName":"Ringkeeper","CreatedById":88438,"CreatedDateTime":"2013-10-25T08:31:46Z","Content":"\n\u003Cp\u003Ethere should be a free camera, that you can move around like you want... for some parts the camera atm is soooo bad , you dont see anything.\u003C/p\u003E\n"},{"CreatedByName":"Thogapotomus","CreatedById":83257,"CreatedDateTime":"2013-10-25T19:49:38Z","Content":"\n\u003Cp\u003EYeah, in the VAB you can only zoom in and out, scroll up and down, and spin the camera. The hanger does all that, plus allows you to move the camera with shift\u002Bright click. I\u0027m not sure why they don\u0027t allow it in the VAB even though it\u0027s smaller horizontally.\u003C/p\u003E\n"}]}