{"TopicId":50668,"ForumId":16,"TopicTitle":"Space Station concepts","CreatedByName":"xoknight","CreatedById":80283,"CreatedDateTime":"2013-10-26T15:18:27Z","PageNum":1,"Articles":[{"CreatedByName":"xoknight","CreatedById":80283,"CreatedDateTime":"2013-10-26T15:18:27Z","Content":"\n\u003Cp\u003ESo I decided to start making a Space Station. But I really don\u0027t see an important use in space stations, I mean refueling rockets and space planes are useful but I just think it takes too much fuel to even reach the station. Why not just start your mission instead? Or maybe storing crew..... Until more science equipment comes out, there\u0027s no use for space stations except to store crew...\u003C/p\u003E\u003Cp\u003EIf you have any ideas on what to put on a station/why I should have a station/ or pictures of your station, post below.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-26T15:36:14Z\u0022 title=\u002210/26/2013 03:36  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 26, 2013\u003C/time\u003E by xoknight\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2013-10-26T15:21:31Z","Content":"\n\u003Cp\u003EThese topics are self explanatory: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54774-0-22-Station-Science-%28second-alpha-new-part-and-result-strings%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/54774-0-22-Station-Science-%28second-alpha-new-part-and-result-strings%29\u003C/a\u003E, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/26482-0-21-OrbitalConstruction-Redux-4-2-%28Kethane-EL-Compatibility-Update%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/26482-0-21-OrbitalConstruction-Redux-4-2-%28Kethane-EL-Compatibility-Update%29\u003C/a\u003E. And there are probably several more just like those. There is plenty to do with stations.\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2013-10-26T15:24:53Z","Content":"\n\u003Cp\u003EAt this point, they\u0027re basically just for refueling and fun. One launch of a set of 3-7 orange tanks should be good enough for a whole bunch of interplanetary missions. For this to be fully effective, you can build your interplanetary ships accordingly. For example, build a ship with 6 tanks around it. Attach 3 nuclear engines and 3 more powerful engines on decouplers. Use all that fuel to get into orbit, then ditch the powerful engines and refill all that fuel capacity from your station. Now you have tonnes of fuel to be used by the massively more efficient engines.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-10-26T15:32:54Z","Content":"\n\u003Cp\u003EI use my space station to construct interplanetary ships from parts delivered separately by an universal lifter. Each space station has a habitat for the future ship crew, it has one orange tank and some RCS tanks as a minimum reserve in case the lifter needs to use some of its cargo fuel, and some free docking ports. Then the engine unit, required number of fuel units, and a lander unit are attached to it, the crew transfers to the lander and off we go to anywhere in the system.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-10-26T15:42:50Z","Content":"\n\u003Cp\u003EIt takes 4500m/s deltaV to get into orbit around Kerbin. After that it\u0027s only a little extra to get a randevous with the refueling station.\u003C/p\u003E\u003Cp\u003EThis means you can use your interplanetairy stage to finnish getting into orbit, and than start the burn to another planet (or the mun) with a full stage anyway.\u003C/p\u003E\u003Cp\u003EI also use my stations as a multi ship dock where I assamble my big rockets in orbit.\u003C/p\u003E\u003Cp\u003EI send each stage up with a seperate launch, and than dock them tougether in orbit and top of the fuel tanks\u003C/p\u003E\n"},{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2013-10-26T15:53:54Z","Content":"\n\u003Cp\u003EWith the Kethane mod I\u0027m using space stations around both MÃƒÂ¼n and Minmus as refinery and storage facilities. I do have a ring of refueling units around Kerbin, but those are little more than satellites with fuel in them. \u003C/p\u003E\u003Cp\u003EHaven\u0027t started playing in 0.22 yet. With the addition of SCIENCE! there may be more uses for them.\u003C/p\u003E\n"}]}