{"TopicId":50871,"ForumId":16,"TopicTitle":"What planets do parachutes work on?","CreatedByName":"Phesired","CreatedById":90150,"CreatedDateTime":"2013-10-27T23:51:44Z","PageNum":1,"Articles":[{"CreatedByName":"Phesired","CreatedById":90150,"CreatedDateTime":"2013-10-27T23:51:44Z","Content":"\n\u003Cp\u003EWhat planets do parachutes work on?\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2013-10-27T23:59:50Z","Content":"\n\u003Cp\u003EAnything with an atmosphere: Eve, Kerbin, Duna, Jool and Laythe (moon). For Duna you\u0027ll want to keep in mind that the atmosphere is very thin and you\u0027ll probably need to bring a decent engine to slow your descent before the parachutes deploy, or else they will rip off your craft when they open at several hundreds of meters per second\u003C/p\u003E\n"},{"CreatedByName":"Phesired","CreatedById":90150,"CreatedDateTime":"2013-10-28T00:09:07Z","Content":"\n\u003Cp\u003EWhat about Minnimus?\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-10-28T00:10:03Z","Content":"\n\u003Cp\u003Enope, No atmosphere, same with the Mun\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-10-28T00:23:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Phesired\u0022 data-cite=\u0022Phesired\u0022\u003E\u003Cdiv\u003EWhat about Minnimus?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo atmosphere. However, the low gravity and flat sea at zero altitude on Minmus makes landing there easy for your first attempts.\u003C/p\u003E\n"},{"CreatedByName":"Phesired","CreatedById":90150,"CreatedDateTime":"2013-10-28T00:30:32Z","Content":"\n\u003Cp\u003EThanks all that commented, this is my first successful landing on any planet or moon, I don\u0027t count crash landing survives as success because they\u0027re cheap.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5g6cSIX.png\u0022 alt=\u00225g6cSIX.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat would be my next bet for conquering?\u003C/p\u003E\n"},{"CreatedByName":"Wallace","CreatedById":77574,"CreatedDateTime":"2013-10-28T00:33:49Z","Content":"\n\u003Cp\u003EI think you need more batteries.\u003C/p\u003E\n"},{"CreatedByName":"Phesired","CreatedById":90150,"CreatedDateTime":"2013-10-28T00:37:05Z","Content":"\n\u003Cp\u003EOkay is that sarcasm because I am really not even sure anymore xD\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-10-28T00:37:38Z","Content":"\n\u003Cp\u003EGet some OxStats and you can eliminate a ton of batteries.\u003C/p\u003E\n"},{"CreatedByName":"Phesired","CreatedById":90150,"CreatedDateTime":"2013-10-28T00:38:35Z","Content":"\n\u003Cp\u003EI am on career mode there\u0027s that and I am new to the game so I don\u0027t know what they are.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-10-28T00:40:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Phesired\u0022 data-cite=\u0022Phesired\u0022\u003E\u003Cdiv\u003EI am on career mode there\u0027s that and I am new to the game so I don\u0027t know what they are.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey will be available soon.\u003C/p\u003E\u003Cp\u003EYou find them here on the tech tree.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/p8VrX4G.jpg\u0022 alt=\u0022p8VrX4G.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-28T00:47:57Z\u0022 title=\u002210/28/2013 12:47  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 28, 2013\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2013-10-28T03:27:15Z","Content":"\n\u003Cp\u003EYeah I think most people make a bee line to Electricity early on to get the solar panels, and then to Fuel Systems to get the fuel lines for asparagus staging.\u003C/p\u003E\u003Cp\u003ECongrats on your Minimus trip! Go to Mun next!\u003C/p\u003E\u003Cp\u003EDid you REALLY need that many batteries? Why? I think I went to Minimus with only 2 batteries and my command pod, didn\u0027t transmit and returned with 360 science, my trip to Mun was 306 science, again without transmitting. That was enough to get me quite deep into the tech trees.\u003C/p\u003E\n"},{"CreatedByName":"Phesired","CreatedById":90150,"CreatedDateTime":"2013-10-28T03:31:06Z","Content":"\n\u003Cp\u003EPeople said make batteries so that\u0027s exactly what I did.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-10-28T03:43:04Z","Content":"\n\u003Cp\u003EIt\u0027s \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EMinmus\u003C/strong\u003E\u003C/span\u003E, not Min\u003Cstrong\u003Ei\u003C/strong\u003Emus. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarkyJ279","CreatedById":90044,"CreatedDateTime":"2013-10-28T14:28:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Phesired\u0022 data-cite=\u0022Phesired\u0022\u003E\u003Cdiv\u003EPeople said make batteries so that\u0027s exactly what I did.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve read those posts; Kerbart in your lander thread was being sarcastic (and it does not matter which way your goo canisters face) and Sirine in the unbalanced ship thread was exagerating by an order of magnitude at least.\u003C/p\u003E\u003Cp\u003EJust a heads up, your engines will produce electricity when they are running. In the very early game, you only need enough energy storage to last between using your main engine. You can track how much energy you have left with the resources tab in the top right of the screen. The biggest users of electricity are command-pod/reaction-wheel torque and transmitting data. You can turn SAS off when you are on the ground or not turning so that just leaves the transmitter.\u003C/p\u003E\u003Cp\u003EIf you are using all the energy stores: You must be transmitting contantly! Get those Oxstat solar panels asap.That\u0027ll allow you to remove most of those batteries and generate eletricity when your engines are deactivated. Make sure you angle your panels/craft so they catch as much sun as possible.\u003C/p\u003E\u003Cp\u003EIf you are not using all that energy: Take off the spare batteries based on how much excess energy you have stored when you stop consuming it. Batteries don\u0027t weigh much compared to other parts but with that many the weight will start to add up quickly, especially when you don\u0027t have access to the ludicrously powerful rockomax engines or the efficient nuclear engine. The solar panels are still a good idea for weight efficiency, particularly for probes which will constantly consume energy and spend a long time with the engines off. Weight saving is a good habit to get into early.\u003C/p\u003E\u003Cp\u003EIt all depends on how much of your resources you\u0027re actually using which you will have to workout based on your own flying style.\u003C/p\u003E\u003Cp\u003EAnyway, back to topic;\u003C/p\u003E\u003Cp\u003EIf it has an atmosphere (see the first few posts in this thread), you can use parachutes on it. Only 2 things to watch out for:\u003C/p\u003E\u003Cp\u003E1) Heavier craft will need to spread the load with multiple parachutes at different points around the structure and potentially drogue chutes if you have them. Fortunately, you can unlock more parachutes later for this if you do want to go super-size. You\u0027ll have to experiment and see just how much shock your craft can take when the parachutes open and potentially slow down before then with engines if it is too much. It all depends on how you build your landers.\u003C/p\u003E\u003Cp\u003E2) Duna has a thin atmosphere so parachutes will fully-deploy while you\u0027re going very low and very fast. You can still use parachutes but aerobrake and use your engines to slow yourself down if you\u0027re landing with the lander pictured above or anything larger (particularly since it looks like the legs are a little too high. You\u0027re sitting on your engine).\u003C/p\u003E\u003Cp\u003ENow, to the Mun! \u003C/p\u003E\u003Cp\u003EOr wherever, you know? It\u0027s your space program!\u003C/p\u003E\n"}]}