{"TopicId":51263,"ForumId":16,"TopicTitle":"Need advice on lifting a 54,000 kg station core into orbit (Update: I made it)","CreatedByName":"kelmv","CreatedById":90534,"CreatedDateTime":"2013-10-31T02:42:26Z","PageNum":1,"Articles":[{"CreatedByName":"kelmv","CreatedById":90534,"CreatedDateTime":"2013-10-31T02:42:26Z","Content":"\n\u003Cp\u003EI\u0027m trying to put my first big load into orbit around Kerbin. The problem is that I have never even tried to put something this large into orbit, and I have no real clue how to do so. I\u0027ve sat down with Kerbal Engineer and went about trying to build a rocket under it with the roughly 5.5k dv I want, but that isn\u0027t working out so well.\u003C/p\u003E\u003Cp\u003Etl;rd: How do I heavy lift?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-31T05:29:02Z\u0022 title=\u002210/31/2013 05:29  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 31, 2013\u003C/time\u003E by kelmv\u003C/strong\u003E\n\u003Cbr\u003EChanged to \u0026quot;answered\u0026quot; and altered the title\n\u003C/span\u003E\n"},{"CreatedByName":"Meltro","CreatedById":78609,"CreatedDateTime":"2013-10-31T02:49:18Z","Content":"\n\u003Cp\u003Epicture of the station in question?\u003C/p\u003E\n"},{"CreatedByName":"Nasakev","CreatedById":72681,"CreatedDateTime":"2013-10-31T02:55:18Z","Content":"\n\u003Cp\u003EWhen lifting heavy loads, asparagus staging is your friend. In short, you use a ring of fuel tanks and engines around a central core that drain two by two, dropping each booster as they empty. Here\u0027s a diagram:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://wiki.kerbalspaceprogram.com/w/images/thumb/e/e7/Asparagus-staging.svg/180px-Asparagus-staging.svg.png\u0022 alt=\u0022180px-Asparagus-staging.svg.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe blue circles are fuel tanks with engines and the yellow arrows are fuel lines. All engines draw from the outer two tanks (the ones labeled S4). When those tanks are empty, they are decoupled and the remaining five engines all draw from the S3 tanks, and so on.\u003C/p\u003E\u003Cp\u003ETo see an example in action, check out the stock craft Kerbal X, available in the VAB in sandbox mode.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"kelmv","CreatedById":90534,"CreatedDateTime":"2013-10-31T03:18:58Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/krxfvYV.png\u0022 alt=\u0022krxfvYV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EImgur didn\u0027t like taking my upload.\u003C/p\u003E\u003Cp\u003EThis is the core in question. I know it doesn\u0027t look too interesting, but that is what I\u0027m wanting to put up.\u003C/p\u003E\n"},{"CreatedByName":"merlinux","CreatedById":83117,"CreatedDateTime":"2013-10-31T03:21:36Z","Content":"\n\u003Cp\u003EAs explained above your answer is aspargus design. A double stack of orange tanks with mainsails will get your contraption in orbit with heaps to spare... I believe its payload is somewhere around the 100t\u003C/p\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-10-31T03:26:22Z","Content":"\n\u003Cp\u003EThere\u0027s always the option of eating the elephant one spoonful at a time. My first instinct is to empty the tank and bring up the fuel later in increments.\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-10-31T03:29:25Z","Content":"\n\u003Cp\u003EI recently built a lifter for 30 ton payloads in career mode (skipper engines, no large probe core, no orange tanks available) and after many trial and error attempts I figured out that for large payloads you really need to start with actual lift and work backwards from there, as delta-v is simply a matter of fuel tanks and staging, but thrust and balance are much harder.\u003C/p\u003E\u003Cp\u003EFor instance if I use the same math and very simple staging I used for my 30t lifter to make a 54t lifter with main sails I quickly get this potential design:\u003C/p\u003E\u003Cp\u003E-Center stack consists of 1x orange tank and 2x X200-32 tanks on top of a main sail.\u003C/p\u003E\u003Cp\u003E-4 radial stacks each consisting of 3x orange tanks and 1x X200-32 tank on top of a main sail\u003C/p\u003E\u003Cp\u003ELifter has a total of 40320 L of fuel and 49280 L of oxidizer and delta-v at ground level of around 4600m/s (actual performance would be better) and \u0026gt;1.25 T/W for first and second stage, last stage is \u0026gt;1.1 T/W.\u003C/p\u003E\u003Cp\u003EThe 4 radial stacks are divided into 2 matching pairs. Fuel lines are arranged to move fuel from the first pair to the second pair and finally to the center. Staging is setup to drop the first pair once its fuel runs out, and then the second pair when its fuel runs out and run just on the center tank.\u003C/p\u003E\u003Cp\u003EI would suggest running struts between the radial tanks in both a square and X formation to make them structurally stable, and add at least one large reaction wheel in the center stack.\u003C/p\u003E\u003Cp\u003EHopefully my math is right, the lifter would be a bit tall with 3x orange tanks. You might mount 2 orange tanks radially to each radial stack, which would result in even more delta-v if they could be dropped.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/V8NJqxa.png\u0022 alt=\u0022V8NJqxa.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dave Kerbin","CreatedById":78777,"CreatedDateTime":"2013-10-31T03:32:18Z","Content":"\n\u003Cp\u003EOk, after posting I can see you\u0027ve added a screenshot.\u003C/p\u003E\u003Cp\u003EFor one thing you don\u0027t need to lift fuel tanks full, they can be refilled in orbit. Since the top and bottom are identically I would be tempted to just stick senior docking ports on them and launch them in identical flights, to be attached to the empty or full orange tank lifted on a previous launch (keep a probe core and solar panel attached to one of those smaller docking ports for station keeping until then).\u003C/p\u003E\n"},{"CreatedByName":"generalxanos","CreatedById":90697,"CreatedDateTime":"2013-10-31T04:13:51Z","Content":"\n\u003Cp\u003EI\u0027m really debating trying that with my cubic fuel station, the delivery design I had that had 2 orange tanks in orbit (tiny bit left over in aft tank, fore tank full) worked really well, but it was/is a complete pig for manouvering, and with that iteration, I couldn\u0027t separate the 2 tanks without losing the engine, and it didn\u0027t have a docking ring. Now, it\u0027s got the docking ring right behind the fore tank, but the engine doesn\u0027t get any fuel after adding a sepatron to it. Still scratching my head on that one, but oh well. I think 12 empty jumbo tanks would be a lot easier to plant in orbit/dock than 12 full ones.\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-10-31T04:29:19Z","Content":"\n\u003Cp\u003EPut the below file to your sub-assembly folder under the save.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/jy5725jvixi8ypr/Medium_Lifter_(50_Tons).craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/jy5725jvixi8ypr/Medium_Lifter_(50_Tons).craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOr you could spend a few days try to understand and build one yourself.\u003C/p\u003E\u003Cp\u003EThis is Medium lifter with 50~55 tons payload capacity. My heavy lifter categories are 150 tons payload..\u003C/p\u003E\n"},{"CreatedByName":"kelmv","CreatedById":90534,"CreatedDateTime":"2013-10-31T04:32:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirine\u0022 data-cite=\u0022Sirine\u0022\u003E\u003Cdiv\u003EPut the below file to your sub-assembly folder under the save.\u003Cp\u003E\u003Ca href=\u0022http://www./download/jy5725jvixi8ypr/Medium_Lifter_(50_Tons).craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/jy5725jvixi8ypr/Medium_Lifter_(50_Tons).craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOr you could spend a few days try to understand and build one yourself.\u003C/p\u003E\u003Cp\u003EThis is Medium lifter with 50~55 tons payload capacity. My heavy lifter categories are 150 tons payload..\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI will give this a shot and see how it all goes together.\u003C/p\u003E\u003Cp\u003EThanks everyone for the input.\u003C/p\u003E\n"},{"CreatedByName":"Meltro","CreatedById":78609,"CreatedDateTime":"2013-10-31T04:38:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Frederf\u0022 data-cite=\u0022Frederf\u0022\u003E\u003Cdiv\u003EThere\u0027s always the option of eating the elephant one spoonful at a time. My first instinct is to empty the tank and bring up the fuel later in increments.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis for ease. Heck, it might be as simple as sticking one single mainsail on the end of the station.\u003C/p\u003E\u003Cp\u003EThe larger problem that I see is that stack will start to fall apart. You\u0027ll need to attach struts to the rocko-64 cause those batteries, RCS tanks, and hitchhiker pods are all weak attachment points. \u003C/p\u003E\u003Cp\u003EAlternatively, those docking ports are promising attachment points in and of themselves. You might consider simply duplicating the whole shebang (alt-click) and adding a copy at each docking port, add a strut or two, remove the ends of it so you just have the rocko-64, and throwing some engines on those external tanks. Then asparagus stage the lot.\u003C/p\u003E\n"},{"CreatedByName":"kelmv","CreatedById":90534,"CreatedDateTime":"2013-10-31T05:25:14Z","Content":"\n\u003Cp\u003EStatus Update:\u003C/p\u003E\u003Cp\u003EThe Medium Lifter fell apart trying to launch that thing. However, there is good news:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZGaQ33j.png\u0022 alt=\u0022ZGaQ33j.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launcher after it has been airborn for a few moments. I felt fairly sure that the whole thing would make it at this point.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/msUu1qk.png\u0022 alt=\u0022msUu1qk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA look at how I connected the boosters. This was much easier than I had imagined, and with such a short rocket it was almost as stable as some of the small rockets I have put up. Other than a rotational problem after ditching the 1st stage (at roughly 11km), the launch couldn\u0027t have gone better.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/gw7NPLI.png\u0022 alt=\u0022gw7NPLI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA good view of how it all goes together once Stage 1 has been dropped. The extra boosters were to let me tweak my orbit once I was up since I wasn\u0027t 100% sure I\u0027d have the fuel for the 150k orbit I wanted.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rLmtTLf.png\u0022 alt=\u0022rLmtTLf.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m a lazy pilot. I\u0027ve dropped boosters and am now tweaking my orbit using the little thrusters on the sides via MechJeb.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/DKdWpgW.png\u0022 alt=\u0022DKdWpgW.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinal placement. ~190km up, and the orbit is directly above KSC. Pictured are the extra boosters being dumped. I made sure to transfer fuel from the 2nd stage boosters and orbital placement boosters into the main tank, so I have some fuel aboard now. Actually, the tanks are almost half fuel. Go figure.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/L7c0NFy.png\u0022 alt=\u0022L7c0NFy.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy orbital kerbal, a one Malcal Kerman, moving from his control pod into the hitchhiker.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FsA7efc.png\u0022 alt=\u0022FsA7efc.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe view of Kerbin from orbit from one set of windows in the Hitchhiker.\u003C/p\u003E\u003Cp\u003EOverall I feel good about this. Thanks for the guidance and the (admittedly obvious) way to mount the boosters. I couldn\u0027t be happier with this thing.\u003C/p\u003E\u003Cp\u003ENow to design another set of modules to add to this thing to make it more useful (though I don\u0027t know what else it could possibly need)\u003C/p\u003E\n"}]}