{"TopicId":51301,"ForumId":16,"TopicTitle":"Rescue mission possible?","CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-10-31T13:46:54Z","PageNum":1,"Articles":[{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-10-31T13:46:54Z","Content":"\n\u003Cp\u003EI wasn\u0027t sure if this should go here or in Gameplay Questions.\u003C/p\u003E\u003Cp\u003EHere is my problem.\u003C/p\u003E\u003Cp\u003EI have a ship about halfway to the Mun that is without power so I can\u0027t do the burn that will allow Mun capture. \u003C/p\u003E\u003Cp\u003EIs it possible to get another ship to them for rescue?\u003C/p\u003E\u003Cp\u003EIf they don\u0027t get shot into deep space can an intercept be done on a large elliptical orbit? I\u0027ve really only done intercepts on ships in nice circular orbits.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T10:09:45Z\u0022 title=\u002211/01/2013 10:09  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by dr_jt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-10-31T13:48:45Z","Content":"\n\u003Cp\u003EProbably should go under game play questions\u003C/p\u003E\u003Cp\u003EIf your ship is piloted and you have thrust vectoring, you can steer the ship that way by just applying a low amount of thrust until your pointed in the right direction, then fire up the engine.\u003C/p\u003E\u003Cp\u003EAlso, some engines recharge the battery when started up too.\u003C/p\u003E\n"},{"CreatedByName":"NASAFanboy","CreatedById":57300,"CreatedDateTime":"2013-10-31T13:51:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EProbably should go under game play questions\u003Cp\u003EIf your ship is piloted and you have thrust vectoring, you can steer the ship that way by just applying a low amount of thrust until your pointed in the right direction, then fire up the engine.\u003C/p\u003E\u003Cp\u003EAlso, some engines recharge the battery when started up too.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf there is no power, them you can\u0027t fire the engine.\u003C/p\u003E\u003Cp\u003EIs the SAS off?\u003C/p\u003E\u003Cp\u003EIf so, EVA a Kerbal and ram the ship, hopefully exposing the solar panels to the sun. That is, IF you out solar panels on it.\u003C/p\u003E\n"},{"CreatedByName":"jsfalconero","CreatedById":89120,"CreatedDateTime":"2013-10-31T13:54:42Z","Content":"\n\u003Cp\u003EIt\u0027s possible, just harder. The same basic principle holds as with docking in nice circular orbits, but you might have to wait a while longer than usual to generate a close approach. \u003C/p\u003E\u003Cp\u003EIt will also likely take a lot more dV than your original craft had because you will have to launch into one orbit (probably inside the orbit of the first) then set up your close approach (which will likely involve a burn at a sub-optimal time), then match velocities (also likely at a sub-optimal time).\u003C/p\u003E\u003Cp\u003EThen there\u0027s the added risk that Jeb will get impatient and get out and use his RCS pack to push the thing toward the retrograde whilst at apoapsis, thereby throwing of your intercept (and possibly rescuing himself, or throwing himself off into deep space, it\u0027s a tough call really \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-10-31T13:54:57Z","Content":"\n\u003Cp\u003EThis is the reason i place at least one RTG on every ship i launch - no matter how much batteries and solar panels it carries. Stuff happens all the time.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-10-31T13:59:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NASAFanboy\u0022 data-cite=\u0022NASAFanboy\u0022\u003E\u003Cdiv\u003EIf there is no power, them you can\u0027t fire the engine.\u003Cp\u003EIs the SAS off?\u003C/p\u003E\u003Cp\u003EIf so, EVA a Kerbal and ram the ship, hopefully exposing the solar panels to the sun. That is, IF you out solar panels on it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can fire the engine if there is no power, so long as the capsule is manned.\u003C/p\u003E\n"},{"CreatedByName":"-RanZ-","CreatedById":51892,"CreatedDateTime":"2013-10-31T14:04:48Z","Content":"\n\u003Cp\u003Ea rescue is always possible as long as the vehicle is in an orbit and not on a trajectory to crash\u003C/p\u003E\n"},{"CreatedByName":"boomerdog2000","CreatedById":57643,"CreatedDateTime":"2013-10-31T14:09:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EYou can fire the engine if there is no power, so long as the capsule is manned.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnless it\u0027s an ion engine, but yes all other engines can activate without power as long as there is a kerbal in the capsule.\u003C/p\u003E\n"},{"CreatedByName":"nadreck","CreatedById":89087,"CreatedDateTime":"2013-10-31T14:21:34Z","Content":"\n\u003Cp\u003EBeen there with unmanned craft and manned ones (no fuel either once). Rendezvous between LKO and an eccentric orbit is quite easy, between two different eccentric orbits is possible but trickier, I find the best bet is to adjust the orbits so that the inclination is the same first, then to perform a manneuver to adjust get a closest approach when the rescue craft is at a point in its orbit closest to the PE of the target craft. Go for the closest approach when the orbits almost match, not the first closest approach that comes up as you add prograde vector in the \u0022add manneuver mode\u0022.\u003C/p\u003E\n"},{"CreatedByName":"nadreck","CreatedById":89087,"CreatedDateTime":"2013-10-31T14:36:45Z","Content":"\n\u003Cp\u003EOops, just realized I didn\u0027t address the urgency of getting to it and rescuing despite the fact that it was bound for a Mun encounter that will send it out of the Kerbin SOI. There are two possibilities:\u003C/p\u003E\u003Cp\u003E1) wait for it to go, then treat it like a rendezvous with another planet\u003C/p\u003E\u003Cp\u003Eor if you are bold and have significant delta-V\u003C/p\u003E\u003Cp\u003Edo what I suggested above, but once on a course that is closely matching the target vehicles add a manneuver right in front of your craft and adjust the lateral and prograde velocities of that manneuver to be on a hyperbolic orbit with a rendezvous point before the Munar SOI, depending how far out the target vehicle is when you start you could do this with as little extra delta-V to kill as 500m/s at rendezvous.\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-10-31T14:38:44Z","Content":"\n\u003Cp\u003EThe problem came about because I forgot to extend the panels. I think the ship will crash into the Mun or slingshot off into space. so I can\u0027t wait until PE to intercept. So I guess the question is, can I intercept while the ship is halfway to the Mun and before it crashes or gets shot off into deep space? \u003C/p\u003E\u003Cp\u003EI\u0027m not really seeing any way that it could be done. The rescue ship would have to be a lot faster than the stranded ship and I don\u0027t see how to do the intercept if the rescue craft is in any kind of orbit. I also may be trapped in the \u0022box\u0022 which is why I asked the question. I was hoping for some outside the box ideas.\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-10-31T14:46:54Z","Content":"\n\u003Cp\u003EI was writing while you were so I didn\u0027t see your second post. I\u0027ve been thinking of seeing what orbit it will be in after it passes the Mun and then treat it as a planet intercept. The problem with that is it may crash into the Mun. If it looks like it will crash I\u0027ll attempt to have a kerbal push it and attempt to get out of Kerbin\u0027s SOI.\u003C/p\u003E\u003Cp\u003EI\u0027m not wedded to this mission and don\u0027t care if I just revert it back to the VAB. I just wondered if a rescue was possible before Mun encounter. I\u0027ll give it a rescue shot tonight and post what happen. Most likely it will be a crash into the Mun.\u003C/p\u003E\n"},{"CreatedByName":"-RanZ-","CreatedById":51892,"CreatedDateTime":"2013-10-31T14:49:57Z","Content":"\n\u003Cp\u003Eunlikely, you would have to have the rescue ship going much faster than the dead ship to intercept it in time and then slow down for a randevu... if you can pull that off I think Scott Manley would even be proud! If your PE is going to be a crash with the moon EVA the kerbal and see if you can nudge the ship enough to miss the moon and rescue it in the sun\u0027s orbit.\u003C/p\u003E\n"},{"CreatedByName":"EKG","CreatedById":38524,"CreatedDateTime":"2013-10-31T16:01:50Z","Content":"\n\u003Cp\u003EWait, if you can EVA a kerbal to get out and push couldn\u0027t the kerbal just extend the solar panels manually, or has that ability been removed? I haven\u0027t actually had to do it in quite a while.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-10-31T16:39:46Z","Content":"\n\u003Cp\u003EThere\u0027s something someone is missing. That someone may be me. Is this a manned ship? If so, even with no power, you can power up the engines (which may provide power) or you could just extend the solar panels (not even requiring an EVA). Both of these work in a manned ship with no power (just tested both to make sure it\u0027s still the case in 0.22). Neither work with an unmanned ship with no power.\u003C/p\u003E\u003Cp\u003EYou may have a mod enforcing power requirements for those activities (I\u0027m pretty sure that there\u0027s at least one of them).\u003C/p\u003E\u003Cp\u003EOther than that, it would be possible to catch up with the craft, but you\u0027d need a good bit more delta-v than the original craft had, and every rendezvous method I know of involves orbits instead of doing it in a single pass, so you\u0027d be winging the intercept. Possible, but not trivial, especially without practice doing so.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-10-31T17:36:49Z","Content":"\n\u003Cp\u003EI have done a deep space rescue. I don\u0027t ever want to do it again, it took forever. But the trick is timing the orbit right to match the orbit of what you are trying to rescue. And then making sure your rescue craft has the fuel to get there and back safely. The worst docking attempt I had was with a pod that had NO power and was tumbling in space. Again it is possible, it takes hours to do it.\u003C/p\u003E\n"},{"CreatedByName":"jklier","CreatedById":90653,"CreatedDateTime":"2013-10-31T17:38:21Z","Content":"\n\u003Cp\u003EI\u0027ve got a Kerbal in orbit around Kerbin right now with no fuel or power left. Ran out of fuel during my final retrograde burn after a visit to the Mun. I just finished constructing a unmanned rescue ship that has a \u0022net\u0022 built from structural girders and struts (I don\u0027t have any docking ports yet in career mode). I plan to send this ship up, sync orbits, then capture the capsule in the net and perform a retrograde burn with the rescue ship.\u003C/p\u003E\n"},{"CreatedByName":"jduchock","CreatedById":82906,"CreatedDateTime":"2013-10-31T19:25:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dr_jt\u0022 data-cite=\u0022dr_jt\u0022\u003E\u003Cdiv\u003EI wasn\u0027t sure if this should go here or in Gameplay Questions.\u003Cp\u003EHere is my problem.\u003C/p\u003E\u003Cp\u003EI have a ship about halfway to the Mun that is without power so I can\u0027t do the burn that will allow Mun capture. \u003C/p\u003E\u003Cp\u003EIs it possible to get another ship to them for rescue?\u003C/p\u003E\u003Cp\u003EIf they don\u0027t get shot into deep space can an intercept be done on a large elliptical orbit? I\u0027ve really only done intercepts on ships in nice circular orbits.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had a similar problem with Jeb and ended up sending a double capsule rig with Bill up to get him. Jeb had to EVA to get into the spare capsule and use it to get home, but it worked without much problem. I was also able to use the science points Jeb had gained to build Bill a better ship with batteries.\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-10-31T20:39:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EThere\u0027s something someone is missing. That someone may be me. Is this a manned ship? If so, even with no power, you can power up the engines (which may provide power) or you could just extend the solar panels (not even requiring an EVA). Both of these work in a manned ship with no power (just tested both to make sure it\u0027s still the case in 0.22). Neither work with an unmanned ship with no power.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EManned ship with one Kerbal. Does turning on the engine depend on which engine used? I know I\u0027ve started an engine before with no power but it didn\u0027t work with this one for some reason I\u0027m not sure of. I did an EVA to extend the panel but I didn\u0027t see the option to do so. I\u0027ve never tried it before. Do you need to be in the correct orientation and position?\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou may have a mod enforcing power requirements for those activities (I\u0027m pretty sure that there\u0027s at least one of them).\u003C/p\u003E\u003Cp\u003EOther than that, it would be possible to catch up with the craft, but you\u0027d need a good bit more delta-v than the original craft had, and every rendezvous method I know of involves orbits instead of doing it in a single pass, so you\u0027d be winging the intercept. Possible, but not trivial, especially without practice doing so.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo mods in this install. I have several installs with different mods. It\u0027s been so long since I\u0027ve used only stock parts and no mods that I wanted to see if I could still do it. I\u0027m not sure I could build something that could get out there and then slow down enough. The stranded ship is a little past half way to the Mun right now. I would have to have something with a really high delta v to even get out there before it hit the Mun and I really doubt I could accomplish the intercept in one shot and one shot would be all I would have time for.\u003C/p\u003E\u003Cp\u003EThis was really more of a theoretical brain game to see if anyone had any ideas that I hadn\u0027t come up with. I will take a quick look tonight but I really think this Kerbal is lost. I never managed to do a deep space rescue but this was the first time I\u0027ve run out of power half way to the Mun and I figured maybe somebody had done such a rescue. Maybe I\u0027ll just see if I can get the Kerbal into Mun orbit using RCS and then attempt to rescue him. I just wish the Nav ball was available to a Kerbal doing EVA.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-10-31T21:16:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022dr_jt\u0022 data-cite=\u0022dr_jt\u0022\u003E\u003Cdiv\u003EManned ship with one Kerbal. Does turning on the engine depend on which engine used?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt only matters if it\u0027s an ion engine, and I doubt you\u0027d try that. Do you have a fuel bar in the staging area for the engine, and does the throttle indicator next to the navball respond to left-shift and left-ctrl?\u003C/p\u003E\u003Cp\u003EIt really sounds more like you\u0027ve hit a bug that people have seen from time to time where for no apparent reason, a ship just becomes uncontrollable. You should be able to throttle up an engine no problem, and you shouldn\u0027t even have to EVA to extend the solar panels if it\u0027s a manned craft, regardless of the power situation. I think a save and reload might fix it if that\u0027s the case, it might actually take quitting the game and starting new.\u003C/p\u003E\u003Cp\u003EI hadn\u0027t heard about that bug much lately, and this is the first time I\u0027ve heard of it hitting someone running 0.22.\u003C/p\u003E\n"},{"CreatedByName":"Lazro","CreatedById":55825,"CreatedDateTime":"2013-10-31T22:06:41Z","Content":"\n\u003Cp\u003EGet up close to the panel. Right-click. \u0022Extend Panel\u0022 should come up.\u003C/p\u003E\n"},{"CreatedByName":"RexKramer","CreatedById":76862,"CreatedDateTime":"2013-11-01T01:24:17Z","Content":"\n\u003Cp\u003EI have another possible solution, with no guarantees of success.\u003C/p\u003E\u003Cp\u003EIt seems you have an upcoming encounter with Mun, with no ability to power the ship. In your case, the power seems to be lack of electric, for which others have posted possible solutions.\u003C/p\u003E\u003Cp\u003EAnother possible way to keep the Kerbalnaut from exiting Kerbins SOI would be to attempt to put him in orbit around Mun, without his craft. You would be surprised how much delta V you have from a jetpack. The problem here is the difficulty controlling and aiming your jetpack RCS bursts, but it can be done. If you manage to put him in orbit around Mun, his retrieval is likely going to be much easier than getting him back from outside Kerbins influence.\u003C/p\u003E\u003Cp\u003EI\u0027ve had success with a similar situation. Had a lander depart Mun, unfortunately ran out of fuel long before reaching orbit. The resulting unpowered descent would have been fatal, so there was nothing to lose by going on EVA and trying for orbit with the Jetpack. The orbit was far from circular, but the Kerbalnaut survived. Must have been a very long 5 days waiting for a rescue ship to come scoop him up, floating around in his space suit. \u003C/p\u003E\u003Cp\u003ETry very hard to save at least a tiny amount of jetpack RCS fuel so you can maneuver to the rescue ship\u0027 entry door...\u003C/p\u003E\n"},{"CreatedByName":"dr_jt","CreatedById":58149,"CreatedDateTime":"2013-11-01T10:08:44Z","Content":"\n\u003Cp\u003EWell it must have been a glitch. When I reloaded the saved game everything worked fine. Kerbal is now back on Kerbin chewing out the engineers for using electronics salvaged from old solar powered lawn ornaments. It was my first sandbox game in .22 so I thought they may have changed how things worked. \u003C/p\u003E\u003Cp\u003EThanks for all the suggestions.\u003C/p\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-07-22T15:30:19Z","Content":"\n\u003Cp\u003EIF and when your other ship is eccentric to kerbin after encountering the mun, Boost to match the ships periapsis height. Only AFTER you do that do you do your plane change. Either way your going to have to be at that orbit height, and it takes less fuel to plane change the higher you are in orbit. Once you do those two things, click on your orbit right at the targets peri node and play with delta V to figure out how much thrust you need to rendezvous with your target. This is all assuming the mun encounter doesn\u0027t whip your original ship out of Kerbins SOI.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T15:32:37Z\u0022 title=\u002207/22/2014 03:32  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by Talavar\u003C/strong\u003E\n\u003C/span\u003E\n"}]}