{"TopicId":51356,"ForumId":16,"TopicTitle":"Is it possible to land this on Tylo and get into orbit?","CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-10-31T22:18:21Z","PageNum":1,"Articles":[{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-10-31T22:18:21Z","Content":"\n\u003Cp\u003EI tried multiple times to land \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/6721960/2013/11-01-tylo/Tylo%20Lander%20E.craft\u0022 rel=\u0022external nofollow\u0022\u003Ethis craft\u003C/a\u003E from 50 km orbit, but I either hit the terrain, or slow down too high (4 km) and overuse my delta-v budget on soft landing.\u003C/p\u003E\u003Cp\u003EYou can\u0027t make a suicide burn with this, it will collide with terrain before you cancel out orbital velocity.\u003C/p\u003E\u003Cp\u003EIf someone can try and give me numbers to stick to, would be great!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/6721960/2013/11-01-tylo/screenshot256.jpg\u0022 alt=\u0022screenshot256.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/6721960/2013/11-01-tylo/Tylo%20Lander%20E.craft\u0022 rel=\u0022external nofollow\u0022\u003EDownload it\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(or suggest your lander, if it\u0027s within 15-18 tonnes)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-31T23:43:34Z\u0022 title=\u002210/31/2013 11:43  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 31, 2013\u003C/time\u003E by Kulebron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2013-10-31T22:59:39Z","Content":"\n\u003Cp\u003EFor a lander, replace the heavy LN-N with the far lighter LV-909. That will provide you with more Delta V for landing by eliminating the extra dead mess of 1.75 tons per engine. LV-N are better for interplanetary travel where you can squeeze up to twice the delta V for very long burns.\u003C/p\u003E\n"},{"CreatedByName":"Alistone","CreatedById":60032,"CreatedDateTime":"2013-10-31T23:21:27Z","Content":"\n\u003Cp\u003EI like to get periapsis of my orbit to be as low as possible; usually about 5000 meters (if you know the elevation your are landing you could even go closer.\u003C/p\u003E\u003Cp\u003EYou have your highest velocity at periapsis; so it is even more effective than a suicide burn because you get to do essentially all of it just 5000 meters above the ground. As you slow down your apoapsis will drop until it is no longer orbital. Continue burning; careful not to increase your altitude; pitch up just enough to have a slow descent while most of your thrust is further cancelling orbital velocity.\u003C/p\u003E\u003Cp\u003EWhen you cancel out your orbital velocity you will be \u0022hovering\u0022 at 5000 meters and can then descend the relatively short distance to the surface having performed what I believe to be the most efficient non-\u0022suicide burn\u0022 possible.\u003C/p\u003E\u003Cp\u003EThe trick is essentially to go full throttle to cancel your velocity as close to the surface as possible; BUT by doing this from an extremely low periapsis, during you do not crash into the surface if it take a long time because you control your altitude to keep it either level or as a slow descent. (At Periapsis you are just changing from losing altitude back to gaining altitude, so if you maintain that point then you aren\u0027t dangerously falling toward the surface because all your motion is horizontal; not vertical)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-31T23:24:58Z\u0022 title=\u002210/31/2013 11:24  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 31, 2013\u003C/time\u003E by Alistone\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-10-31T23:41:41Z","Content":"\n\u003Cp\u003E@Alistone: so you mean use the vertical speed that will start growing? Interesting idea.\u003C/p\u003E\u003Cp\u003E@SRV Ron: I tried to minimize the mass, because this one is already 15 tonnes, and the other model with LV909 that I built weighs 25 tonnes, with asparagus pipes going inside out everywhere.\u003C/p\u003E\u003Cp\u003EActually, I thought the problem was gravity losses and low TWR which makes you lose too much delta-V on hovering. I added the third engine, and with about the same delta-v of 5700 it landed loftly and took off.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-01T00:01:01Z","Content":"\n\u003Cp\u003EIf suicide burn makes you crash into the surface you need to burn slightly below retrograde to prevent gaining too much vertical speed. If the ship is strong enough to take off, it is able to do that, too.\u003C/p\u003E\u003Cp\u003EAnd yes, the most efficient approach is to bring your periapsis at the right height above the terrain and then brake at that periapsis.\u003C/p\u003E\n"},{"CreatedByName":"Alistone","CreatedById":60032,"CreatedDateTime":"2013-11-01T00:11:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003E@Alistone: so you mean use the vertical speed that will start growing? Interesting idea.\u003Cp\u003EActually, I thought the problem was gravity losses and low TWR which makes you lose too much delta-V on hovering. I added the third engine, and with about the same delta-v of 5700 it landed loftly and took off.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou do almost all your thrusting horizontal; you only point upward enough to prevent you from falling. At periapsis that you aren\u0027t actually falling; so you pitch just enough to maintain your altitude steady while your burn against your horizontal velocity. Your goal is to keep your vertical speed steady at about zero while you cancel out your horizontal. \u003C/p\u003E\u003Cp\u003EWhere burning against your velocity when you are traveling vertically leaves no margin for error; you either start too soon (end up at tens of thousands of feet or too late (crater). By doing it at a \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Econstant elevation\u003C/span\u003E while travelling horizontally (periapsis) you don\u0027t have to worry about accidentally doing it too soon or too late. Because you keep your altitude stable (adjust your pitch closer to the horizon if you begin to climb; adjust your pitch upward if you begin to descend) you can keep your elevation controlled and then engines at full throttle.\u003C/p\u003E\u003Cp\u003E... maybe I\u0027ll make a vid...\u003C/p\u003E\u003Cp\u003E... and you still have to do some sort of \u0022suicide burn\u0022 for the actual landing; but doign that from 5km is much easier than from 50km.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T00:14:20Z\u0022 title=\u002211/01/2013 12:14  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by Alistone\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-11-01T00:14:31Z","Content":"\n\u003Cp\u003EStarting the descent from a low orbit on Tylo is a suicide attempt. You simply don\u0027t do that because you don\u0027t have the time to cancel the lateral speed. Try 500 km, it worked for me.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-01T00:39:00Z","Content":"\n\u003Cp\u003EKeeping constant height is not optimal, you need to bring your height down slightly during the braking but stay in sufficient height for approach and landing.\u003C/p\u003E\u003Cp\u003EA great source of inspiration for me were moon landing studies I found.\u003C/p\u003E\u003Cp\u003EFor instance in \u003Ca href=\u0022http://www.agi.com/downloads/resources/white-papers/A-Comparison-of-Lunar-Landing-Trajectory-Strategies-Using-Numerical-Simulations.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ethis one\u003C/a\u003E you can take a look at least at pages 15-16 and page 30 (pages in acrobat, document pages are shifted).\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-11-01T01:52:09Z","Content":"\n\u003Cp\u003EHaven\u0027t tried this myself on Tylo specifically (maybe I should!), but the Apollo landers used a \u0022reverse gravity turn\u0022, where they basically burned retrograde during the entire descent with the goal of hitting zero altitude and velocity at the same time, with some safety margin built in. It\u0027s not really a suicide burn, where you wait till the last second to burn at max thrust. \u003C/p\u003E\u003Cp\u003EThe math for figuring out when to start your burn, how long to burn, and what rate of acceleration to use isn\u0027t coming to me intuitively though. I\u0027d figure decelerating at whatever rate corresponds to a TWR of around 2 would be reasonable, assuming your ship can do a little more than that in order to have a safety margin. Beyond that, Idunno? I just WAG it by looking at the map view. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://en.wikipedia.org/wiki/Gravity_turn#Descent_and_landing_procedure\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Gravity_turn#Descent_and_landing_procedure\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-01T10:37:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alistone\u0022 data-cite=\u0022Alistone\u0022\u003E\u003Cdiv\u003EYou do almost all your thrusting horizontal; you only point upward enough to prevent you from falling. At periapsis that you aren\u0027t actually falling; so you pitch just enough to maintain your altitude steady while your burn against your horizontal velocity. Your goal is to keep your vertical speed steady at about zero while you cancel out your horizontal.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHm, what you say fits landers with better TWR, this one has TWR lower than 1 at start, and can\u0027t hold vertical speed. An in the end being as high as 5km is a big problem with this high gravity.\u003C/p\u003E\u003Cp\u003EI tried this at 15, 20, 30 and 40 km, and it worked only at 50km. So your advice is fine for MÃƒÂ¼n or for a very powerful lander, but this one is very different.\u003C/p\u003E\u003Cp\u003EI know this can be solved as a differential equation, and studied them once, but don\u0027t have skills.\u003C/p\u003E\u003Cp\u003E@Kasuha: interesting, thanks!\u003C/p\u003E\u003Cp\u003E@Traches: this works fine if you have good TWR. This one has TWR about 1 (in Tylo gravity) at start and grows it to 1.5..1.7 at the moment of landing. It\u0027s very underpowered, and I did try burning retrograde, it leads to a crash, with vertical speed about 250 m/s.\u003C/p\u003E\u003Cp\u003EThe problem was not the trajectory, but that descending from 50 km it hovered too high (5 km) and spent 400 m/s of delta-V fighting gravity. I tried 3 engines instead of 2, and this worked, I could use the usual retrograde burn to land.\u003C/p\u003E\u003Cp\u003EAnyway, if someone wants to try, I can post a savefile.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T10:46:42Z\u0022 title=\u002211/01/2013 10:46  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by Kulebron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Moar Boosters","CreatedById":79218,"CreatedDateTime":"2013-11-01T10:56:36Z","Content":"\n\u003Cp\u003EI just downloaded the craft file. \u003C/p\u003E\u003Cp\u003ETBH that lander doesn\u0027t really look sufficient. You\u0027ve got 6k of delta v....... that\u0027s not really enough for tylo. \u003C/p\u003E\u003Cp\u003EAccording to the DV map it takes 3070 to take off from Tylo. It\u0027s always going to take a bit more than that to slow down because there\u0027s always inefficiency because you\u0027re fighting gravity to maintain a safe vertical speed.\u003C/p\u003E\u003Cp\u003EI think you need to redesign that thing, allowing yourself a bit more weight.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-01T11:27:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003EAnyway, if someone wants to try, I can post a savefile.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes please. This is definitely that kind of thing I\u0027d like to try.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-01T11:49:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Moar Boosters\u0022 data-cite=\u0022Moar Boosters\u0022\u003E\u003Cdiv\u003EI just downloaded the craft file. \u003Cp\u003ETBH that lander doesn\u0027t really look sufficient. You\u0027ve got 6k of delta v....... that\u0027s not really enough for tylo. \u003C/p\u003E\u003Cp\u003EAccording to the DV map it takes 3070 to take off from Tylo. It\u0027s always going to take a bit more than that to slow down because there\u0027s always inefficiency because you\u0027re fighting gravity to maintain a safe vertical speed.\u003C/p\u003E\u003Cp\u003EI think you need to redesign that thing, allowing yourself a bit more weight.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHm, I used \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/41652-A-more-accurate-delta-v-map\u0022 rel=\u0022external nofollow\u0022\u003Ethis dv map\u003C/a\u003E, and it says 2200 m/s. Maybe your one takes into account gravity losses. BTW, I managed to land and take off with 5700 m/s (with 3 NERVAs), no flying aids.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-01T12:06:08Z","Content":"\n\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/6721960/2013/11-01-tylo/quicksave.sfs\u0022 rel=\u0022external nofollow\u0022\u003ESavefile with both models\u003C/a\u003E in Tylo orbit. Lander E (2 engines, the one in the original post) is in 50km orbit, Lander G (3 engines) is in 30 km orbit.\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-01T12:16:07Z","Content":"\n\u003Cp\u003EVessel TyloLander G was not loaded because it had the following parts missing: EngineerChipFlight.\u003C/p\u003E\u003Cp\u003ESorry, no mods here.\u003C/p\u003E\u003Cp\u003EEdit: okay I edited chips out of the save and while TyloLander G was destroyed by that, TyloLander E survived. I was able to land with it with 231 fuel units left. Not sure if that would suffice for getting back to orbit as I didn\u0027t quicksave at that point and then crashed into a hill because I didn\u0027t ascend fast enough.\u003C/p\u003E\u003Cp\u003EI didn\u0027t do it in a very optimal manner, too. There\u0027s no chance for me to always watch if a fuel tank is empty while watching the velocity and looking for hills so I was notoriously staging them too late. Notice I staged the last tank only after landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/c93TKOM.png\u0022 alt=\u0022c93TKOM.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T13:07:00Z\u0022 title=\u002211/01/2013 01:07  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tavert","CreatedById":57383,"CreatedDateTime":"2013-11-01T14:52:22Z","Content":"\n\u003Cp\u003ELots of math on constant-altitude landing (and takeoff) here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/39812-Landing-and-Takeoff-Delta-V-vs-TWR-and-specific-impulse\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/39812-Landing-and-Takeoff-Delta-V-vs-TWR-and-specific-impulse\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe lower your initial altitude and vertical speed during the landing burn the better, gravity losses are your enemy at low TWR.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-01T15:13:29Z","Content":"\n\u003Cp\u003E@Kasuha, I must admit, I\u0027m bad at quick writing. The point was getting back into orbit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I did land it, but spent lots of fuel. Your results looks much better. I\u0027ll re-edit the file and remove the redux plugin part.\u003C/p\u003E\u003Cp\u003E@tavert: great info, thanks!\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-01T15:16:59Z","Content":"\n\u003Cp\u003EI made another attempt and this time I landed it directly from its 50 km orbit by burning about 5 degrees below retrograde (i.e. at about the upper edge of the retrograde marker on my navball; not from very beginning though, only after the height started dropping) - I stopped about 200 m above terrain and spent some fuel on that so I landed with only 196 fuel units left. I wasn\u0027t able to get back to orbit with that but I managed to establish a 10 km apoapsis trajectory so close to circular that I am pretty sure I would make it orbit if I had the 211 units I had with previous landing.\u003C/p\u003E\u003Cp\u003EI was also starting with landing legs still attached, that\u0027s not very good thing, it might have helped if these legs were on separate stage that could be left on the ground during takeoff. Or perhaps on the fuel tank just below that which was empty when I landed in both cases. Unless you intended takeoff without these landing legs and just the two remaining tanks.\u003C/p\u003E\u003Cp\u003ESo landing and taking off with it is very likely possible, it\u0027s just very on the edge.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T15:24:59Z\u0022 title=\u002211/01/2013 03:24  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-01T16:39:29Z","Content":"\n\u003Cp\u003EI found that the lander had a strut connected to redux chip. So here\u0027s the \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/6721960/2013/11-01-tylo/quicksave_no_redux.sfs\u0022 rel=\u0022external nofollow\u0022\u003Equicksave without those chips\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-01T18:46:37Z","Content":"\n\u003Cp\u003EOkay, my answer is definitive yes. First I waited to get to the dark side and reduced the periapsis to 7 km over flat terrain. Then I started braking at periapsis while keeping vertical descent low (had to avoid some terrain, too) and landed with it with 224 fuel units left. That was enough to get back to orbit. Not many screenshots here, though. There is some very small room for errors with this ship.\u003C/p\u003E\u003Cp\u003ENotice the distance between periapsis and the place where it landed.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/TRx3O\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-01T18:51:30Z\u0022 title=\u002211/01/2013 06:51  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 1, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2013-11-01T18:57:37Z","Content":"\n\u003Cp\u003EImpressive!\u003C/p\u003E\u003Cp\u003EI tried landing the bigger one, and it works fine (except that still you can\u0027t burn just retrograde, need to control vertical speed), but when I land, fuel is slightly overused, and I can get into orbit only if the central engine is dropped.\u003C/p\u003E\n"}]}