{"TopicId":51511,"ForumId":16,"TopicTitle":"Best way to go to Vall","CreatedByName":"merlinux","CreatedById":83117,"CreatedDateTime":"2013-11-02T05:12:57Z","PageNum":1,"Articles":[{"CreatedByName":"merlinux","CreatedById":83117,"CreatedDateTime":"2013-11-02T05:12:57Z","Content":"\n\u003Cp\u003EHello everyone,\u003C/p\u003E\u003Cp\u003EI have just sent my first Kerballed mission to the jool system in this save. My mission is to land and return from Vall. I packed a lot of delta v from past experience on Jool mission from past saves and successfully got there. Anyway I thought I had more than enough but it looks like I will just make it back home. The way I took to get there was to aerobrake on jool and set up my apoapsis at the same altitude as Vall\u0027s orbit and then brake and after I got a successful encounter with Vall I just burnt retrograde to orbit it. I spent 2300 of DV after the jool aerobrake manoeuver, 600 to correct my periapsis so that it was close to Vall and 1700 to orbit (went in prograde). Now I do not believe this is the most efficient way. \u003C/p\u003E\u003Cp\u003EI am tempted to try other things such as going into laythe orbit first by aerobraking and then go to Vall, not sure though if that would be more efficient... Or maybe trying to get a retrograde orbit instead of prograde... \u003C/p\u003E\u003Cp\u003EAny tips?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T07:04:12Z\u0022 title=\u002211/02/2013 07:04  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by merlinux\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"maccollo","CreatedById":72759,"CreatedDateTime":"2013-11-02T05:50:01Z","Content":"\n\u003Cp\u003EUse gravity assist to put yourself in a close orbit to Vall before you have your final encounter with it. This will reduce the deltaV required for your capture burn significantly.\u003C/p\u003E\u003Cp\u003EBecause of how easy it is to get encounters with the inner moons it doesn\u0027t really matter how you get captured around Jool, because as long as your apoapsis is within the SOI of Laythe you can use gravity assist to put your into any orbit.\u003C/p\u003E\u003Cp\u003EPersonally tho, I prefer to use gravity assist using Tylo to get captured. It\u0027s far more precise than aerocapture, and you can quite easily fine tune your orbit way before you enter the SOI of Jool to make sure you encounter Tylo the right way.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T05:53:28Z\u0022 title=\u002211/02/2013 05:53  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by maccollo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"merlinux","CreatedById":83117,"CreatedDateTime":"2013-11-02T06:40:22Z","Content":"\n\u003Cp\u003EOkie I will try that.\u003C/p\u003E\u003Cp\u003EI can get very precise aerobrake maneuvers on jool as I use the aerobrake calculator which is pretty much spot on but the low periapsis with Jool on the subsequent orbit doesnt really help. On the good side my Vall mission is a success, well I still have to get home but I have just docked back to my return craft after Jab and bill had some fun on the surface... And 2800DV is enough to go back to kerbin if I depart from Vall \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-02T06:45:07Z\u0022 title=\u002211/02/2013 06:45  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 2, 2013\u003C/time\u003E by merlinux\u003C/strong\u003E\n\u003C/span\u003E\n"}]}