{"TopicId":51544,"ForumId":16,"TopicTitle":"Can you clean unlinked parts off a ship?","CreatedByName":"Entelin","CreatedById":64822,"CreatedDateTime":"2013-11-02T13:24:33Z","PageNum":1,"Articles":[{"CreatedByName":"Entelin","CreatedById":64822,"CreatedDateTime":"2013-11-02T13:24:33Z","Content":"\n\u003Cp\u003ESome parts, after you are done with a previous stage leave part of themselves on your rocket. Things like struts, pipes, radial attachment points, etc.\u003C/p\u003E\u003Cp\u003EIs there a mod or program that can go through a launched ship and clean that stuff off? I\u0027d like to do so for visual \u0026amp; performance reasons (keeping part count to a minimum).\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2013-11-02T13:29:50Z","Content":"\n\u003Cp\u003EAs far as I recall... the last time this was thoroughly investigated, it was concluded that the \u0027nubs\u0027 left behind on ships are graphical-only; they do not function as parts at all.\u003C/p\u003E\u003Cp\u003EI\u0027ve not heard of a mod that\u0027ll clean them off, either. I\u0027m not 100% certain, but afaik the nubs disappear if you go to space centre and reload the ship and/or restart the game.\u003C/p\u003E\n"},{"CreatedByName":"Albert VDS","CreatedById":74055,"CreatedDateTime":"2013-11-02T14:05:37Z","Content":"\n\u003Cp\u003EYou can use \u003Ca href=\u0022forum.kerbalspaceprogram.com/threads/53134-Kerbal-Attachment-System-(KAS)-0-4-4-Struts-pipes-part-containers-and-more-(0-22)\u0022 rel=\u0022external nofollow\u0022\u003EKAS\u003C/a\u003E to remove and replace small parts from your craft.\u003C/p\u003E\u003Cp\u003EIt\u0027s also possible to make the bigger parts do the same.\u003C/p\u003E\n"},{"CreatedByName":"Maxander","CreatedById":61481,"CreatedDateTime":"2013-11-02T15:34:10Z","Content":"\n\u003Cp\u003EI think structural pylons leave nothing once its ejected and the struts points will be gone the next time you load if they were first attached to the ejected piece. \u003C/p\u003E\u003Cp\u003EI used this to make a space station without all the rcs points needed for docking as they were attached to the pylons and removed when everything was were its supposed to be.\u003C/p\u003E\u003Cp\u003ECreated lots of debrie but got me a really low part and clean station. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EUsing KAS for cleaning of most the stock radial attached stuff also work.\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2013-11-02T16:21:57Z","Content":"\n\u003Cp\u003EOne way to reduce this is to always place struts going from first stages to later stages. When you drop a stage with struts, they don\u0027t leave anything on the surfaces they were attached to, only the surface they were attached from.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-11-03T03:48:20Z","Content":"\n\u003Cp\u003ELeave the ship momentarily and go back to KSC, then resume the flight from the tracking station. If I recall correctly, everything except fuel line nubs will have vanished.\u003C/p\u003E\n"}]}