{"TopicId":51702,"ForumId":16,"TopicTitle":"Delta-V needed for orbit?","CreatedByName":"Affan","CreatedById":76236,"CreatedDateTime":"2013-11-03T14:02:32Z","PageNum":1,"Articles":[{"CreatedByName":"Affan","CreatedById":76236,"CreatedDateTime":"2013-11-03T14:02:32Z","Content":"\n\u003Cp\u003EHey, I just learnt the math of basic orbiting and I wanted to ask how much delta-v would be needed to take 1 unit of mass (kg or tonne) to a height of 100km above Kerbin\u0027s surface. I am unable to calculate the effects of gravity and drag on my craft. If I can find that out then I can calculate how much delta-v is needed to put a ship into oribt around kerbin.\u003C/p\u003E\u003Cp\u003EIf you could post the figure in m/s needed for 1kg or 1000kg to rise straight up to 100km above ground.\u003C/p\u003E\u003Cp\u003EThanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"toadicus","CreatedById":67745,"CreatedDateTime":"2013-11-03T14:08:26Z","Content":"\n\u003Cp\u003EIn the stock game, a clean ascent is about 4500 m/s. If you use Ferram Aerospace Research, it\u0027s more like 3600 m/s.\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-11-03T17:53:38Z","Content":"\n\u003Cp\u003EToadicus has it right, but here is some additional context:\u003C/p\u003E\u003Cp\u003EThe amount of delta-V required to get 1kg of mass into orbit is the same as what it takes to get 1000kg into orbit. \u003Cem\u003EThe amount of dV required to reach orbit doesn\u0027t really change based on mass.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIn fact, if you look at the Rocket Equation:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/math/9/4/5/945a66bb8ac5a46fd959ab6c12eebb00.png\u0022 alt=\u0022945a66bb8ac5a46fd959ab6c12eebb00.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESource: \u003Ca href=\u0022https://en.wikipedia.org/wiki/Rocket_equation\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://en.wikipedia.org/wiki/Rocket_equation\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou can see that this equation doesn\u0027t rely on how much mass your ship has, but the ratio of it\u0027s full to empty mass.\u003C/p\u003E\u003Cp\u003EWhat you are trying to solve is how much Propellant is required to get a 1kg mass into orbit - so, in your case you want to solve the Rocket Equation for M0, given a known dV, M1, and Isp.\u003C/p\u003E\n"},{"CreatedByName":"arq","CreatedById":71084,"CreatedDateTime":"2013-11-03T20:38:22Z","Content":"\n\u003Cp\u003ETo get 4500m/s of dV with an asparagus lifter usually yields a payload fraction of 14-16%. This means that your launcher should be 5-6 times heavier than your payload, assuming you\u0027ve tuned your TWR appropriately.\u003C/p\u003E\u003Cp\u003EEDIT: When I say \u0027asparagus,\u0027 I mean \u0027efficient\u0027. Some non-asparagus rockets can be \u0027efficient,\u0027 but this becomes increasingly difficult as the rocket gets larger.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-03T20:44:52Z\u0022 title=\u002211/03/2013 08:44  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 3, 2013\u003C/time\u003E by arq\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-11-03T22:07:16Z","Content":"\n\u003Cp\u003EExpounding on arq\u0027s post, a typical single-stage to orbit rocket usually has (my observation) a payload fraction of only about 4%; your booster needs to be 24 times as heavy as your payload. You also will need to adjust your throttle as you go with that kind of design (all that thrust you had at launch isn\u0027t necessary when you\u0027re further up and if you keep it at full throttle you\u0027ll pancake your stack). It\u0027s about as inefficient as you can get. The advantage is that construction is much simpler, but that\u0027s about it.\u003C/p\u003E\n"}]}