{"TopicId":51886,"ForumId":16,"TopicTitle":"Achieving a perfect orbit","CreatedByName":"A1catraz","CreatedById":90647,"CreatedDateTime":"2013-11-04T21:03:54Z","PageNum":1,"Articles":[{"CreatedByName":"A1catraz","CreatedById":90647,"CreatedDateTime":"2013-11-04T21:03:54Z","Content":"\n\u003Cp\u003EEvery time I launch a vessel into orbit, I can never get he Apoapsis and Perapsis perfectly matched, it\u0027s always a couple ten or hundred off. Is perfect orbit possible, if so, how is it achieved?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-08T14:11:23Z\u0022 title=\u002211/08/2013 02:11  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 8, 2013\u003C/time\u003E by A1catraz\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"jduchock","CreatedById":82906,"CreatedDateTime":"2013-11-04T21:09:27Z","Content":"\n\u003Cp\u003Ethe definition of peri and apo are \u0022closed\u0022 and \u0022farthest\u0022 from a given body, respectively...\u003C/p\u003E\u003Cp\u003EIf the peri and apo were the exact same number, they would cease to be peri- and apo- apsises...\u003C/p\u003E\u003Cp\u003Ethe apoapsis will always be a higher value than the periapsis...\u003C/p\u003E\n"},{"CreatedByName":"Pursuedtank","CreatedById":50078,"CreatedDateTime":"2013-11-04T21:09:53Z","Content":"\n\u003Cp\u003ERealistically an orbit with the same apoapsis and periapsis is very difficult to do, and as soon as you time warp or exit to space center it will change ever so slightly. Slightly off in a magnitude of a few tens of meters is perfectly fine. You don\u0027t need a perfect orbit usually anyway.\u003C/p\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-11-04T21:10:00Z","Content":"\n\u003Cp\u003EProbably not, considering KSP uses floating point numbers and that the Apoapsis and Perapsis markers start flipping out exponentially the closer they get.\u003C/p\u003E\u003Cp\u003EIf you \u003Cem\u003Ereally\u003C/em\u003E want a perfect orbit, you only real solution is to edit the persistence file. Unfortunately I cannot offer any advice on that subject.\u003C/p\u003E\u003Cp\u003EHope this helped. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-11-04T21:17:26Z","Content":"\n\u003Cp\u003EIn practice, \u002B/- a few percent is pretty good. More than good enough for anything you might want a circular orbit for.\u003C/p\u003E\u003Cp\u003EAs was said already, if you get the numbers really close (Like \u002B/- 500 meters out of 100km!) the markers glitch right the f*ck out due to floating point errors. This will not help you.\u003C/p\u003E\u003Cp\u003ESquad should bite the bullet and implement their own big number library already \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E stupid Unity engine...\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Seret","CreatedById":41409,"CreatedDateTime":"2013-11-04T21:28:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022A1catraz\u0022 data-cite=\u0022A1catraz\u0022\u003E\u003Cdiv\u003EIs perfect orbit possible, if so, how is it achieved?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAny orbit where you manage to not hit the big round bit in the middle is good enough IMO. You don\u0027t get any extra space points for perfection, close enough is close enough. It\u0027s up to how OCD you are about how perfect you want to try and get it. I generally consider any Kerbin orbit within about 2km variation to be circular enough for me.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-11-04T22:21:11Z","Content":"\n\u003Cp\u003EHell, I\u0027m pretty sure any orbit with a 2k variation is good enough for NASA...yeah, they don\u0027t get it exactly right either. That includes their geosynchronous satellites too, BTW; they occasionally require adjusting to keep them in the correct position tolerance.\u003C/p\u003E\u003Cp\u003EYou\u0027re okay if the two are within a klick of one another for pretty much anything you want to do. The only place I\u0027ve seen really close precision count has been in forum challenges (and not all that often).\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2013-11-04T22:42:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022A1catraz\u0022 data-cite=\u0022A1catraz\u0022\u003E\u003Cdiv\u003EEvery time I launch a vessel into orbit, I can never get he Apoapsis and Perapsis perfectly matched, it\u0027s always a couple ten or hundred off. Is perfect orbit possible, if so, how is it achieved?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESimple way is to \u0027chase\u0027 the apoapsis along your velocity vector when you have an ETA of 1 second, pushing your periapsis towards an equal value. It\u0027ll get you as close as possible. RCS will help you fine-tune.\u003C/p\u003E\u003Cp\u003EBut yeah, it\u0027s not desirable (or, by definition, achievable) due to the errors mentioned earlier, and it making maneuver placement difficult.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-04T22:44:32Z","Content":"\n\u003Cp\u003EWhen the orbit is too circular, weird things start happening. The game couldn\u0027t decide where AP/PA points are and you may have very hard time placing a maneuver on it. It\u0027s better to stick to very slightly elliptical orbits.\u003C/p\u003E\u003Cp\u003EApart of that, the less parts and the finer control your ship has the more precise you can make the orbit. I would imagine using a probe core, a large RCS tank and two RCS ports for positioning might allow you to make orbit circular within 1 m.\u003C/p\u003E\n"},{"CreatedByName":"ultimatevirus","CreatedById":79767,"CreatedDateTime":"2013-11-04T22:44:53Z","Content":"\n\u003Cp\u003EMy best was about \u0026lt;1 km accuracy. My only real advice would be use more then 1 or 2 burns, maybe like 5 or 6 using low thrust engines so that you can tune the level of thrust easily.\u003C/p\u003E\n"},{"CreatedByName":"ThirdHorseman","CreatedById":77825,"CreatedDateTime":"2013-11-04T23:31:07Z","Content":"\n\u003Cp\u003EAs everyone else said, it\u0027s pretty impossible. Which is tough, because I tried to setup two matching refuel stations around Kerbin, each at 150k and orbiting opposite each other. Of course since you cannot get an exactly circular orbit they tended to get closer and closer together over time so I abandoned that idea...\u003C/p\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-11-05T01:29:56Z","Content":"\n\u003Cp\u003EIt is possible to achieve a circular orbit, just very very difficult, and there is no benefit to doing so. In fact, you use a fair bit of propellant trying to tweak your orbit to get there. (An orbit who\u0027s Periapsis and Apoapsis are at the same distance is just a circle...)\u003C/p\u003E\n"},{"CreatedByName":"DisarmingBaton5","CreatedById":68576,"CreatedDateTime":"2013-11-05T01:38:45Z","Content":"\n\u003Cp\u003EPeople on this thread: The weird oscillations in your orbit about the apoapsis and periapsis are caused by the motion of your command pod. It is not random.\u003C/p\u003E\n"},{"CreatedByName":"Gnipu","CreatedById":83417,"CreatedDateTime":"2013-11-05T01:45:28Z","Content":"\n\u003Cp\u003ETo fine tune orbit: Go to an -apsis, align with it, hit Caps Lock and fire RCS forward og backwards and watch the opposite -apsis change.\u003C/p\u003E\n"},{"CreatedByName":"RadHazard","CreatedById":80815,"CreatedDateTime":"2013-11-05T01:51:33Z","Content":"\n\u003Cp\u003EIf you want to sync two or more satellite or station orbits so they stay roughly the same distance apart, it\u0027s easier to tweak the duration of each orbit than it is to make them perfect circles. You\u0027ll need a mod that displays more orbital info for that though.\u003C/p\u003E\n"},{"CreatedByName":"Mr. Entropy","CreatedById":66320,"CreatedDateTime":"2013-11-05T02:15:20Z","Content":"\n\u003Cp\u003EIf you can get the apoapsis and periapsis within 2 km of each other, that\u0027s good enough for government work.\u003C/p\u003E\n"},{"CreatedByName":"Zuni","CreatedById":85203,"CreatedDateTime":"2013-11-05T02:25:02Z","Content":"\n\u003Cp\u003EQuick answer: Mechjeb.\u003C/p\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-11-05T02:31:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Zuni\u0022 data-cite=\u0022Zuni\u0022\u003E\u003Cdiv\u003EQuick answer: Mechjeb.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot even Mechjeb can achieve a perfect orbit. I speak from experience. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-11-05T12:47:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DisarmingBaton5\u0022 data-cite=\u0022DisarmingBaton5\u0022\u003E\u003Cdiv\u003EPeople on this thread: The weird oscillations in your orbit about the apoapsis and periapsis are caused by the motion of your command pod. It is not random.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s absolutely true that applying torque tot he ship can cause the Ap/Pe points to jostle around a bit, but with orbits of very, very low eccentricity they will glitch out even with all reaction wheels and SAS disabled. Two different causes contributing to the same effect.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"basdxz","CreatedById":90956,"CreatedDateTime":"2013-11-05T13:02:58Z","Content":"\n\u003Cp\u003EThe most precise orbit in my experience can be achieved using ion engines. They produce very little thrust making them slow, but dead accurate.\u003C/p\u003E\n"},{"CreatedByName":"Kerbart","CreatedById":78303,"CreatedDateTime":"2013-11-05T13:13:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr. Entropy\u0022 data-cite=\u0022Mr. Entropy\u0022\u003E\u003Cdiv\u003EIf you can get the apoapsis and periapsis within 2 km of each other, that\u0027s good enough for government work.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think most of us have higher standards than that.\u003C/p\u003E\n"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2013-11-05T13:46:52Z","Content":"\n\u003Cp\u003EUse RCS Thrusters. They are fairly precise. I can get within 100-500 meters of equilibrium.\u003C/p\u003E\n"},{"CreatedByName":"Spyritdragon","CreatedById":70515,"CreatedDateTime":"2013-11-05T14:00:40Z","Content":"\n\u003Cp\u003EUse the blue thingumats on maneuver nodes. If youre right between apo and peri, one direction will increase apoapsis and decrease periapsis while the other does the opposite. But as said before, within 1km is usually good enough\u003C/p\u003E\n"},{"CreatedByName":"A1catraz","CreatedById":90647,"CreatedDateTime":"2013-11-05T14:21:53Z","Content":"\n\u003Cp\u003EDidn\u0027t really expect this many replies, anyway, thanks for the help, I just wanted to know if it was possible. It obviously is not. What could be the closest to a \u0022perfect orbit\u0022?\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-11-05T15:58:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022A1catraz\u0022 data-cite=\u0022A1catraz\u0022\u003E\u003Cdiv\u003EDidn\u0027t really expect this many replies, anyway, thanks for the help, I just wanted to know if it was possible. It obviously is not. What could be the closest to a \u0022perfect orbit\u0022?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I got it as perfect as possible in the game while building my Astraeus constellation:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BjokIqu.jpg\u0022 alt=\u0022BjokIqu.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe eccentricity of all those orbits is down to 0.0000XX according to flight engineer and the same is true for the relative inclinations. They all have a orbital period of exactly 1.5 hours. Each orbit contains 3 sats at 120 degree angles.\u003C/p\u003E\u003Cp\u003EAt this point the apoapsis, periapsis and ascending/descending node are jumping around like crazy. Every single timewarp or reload shifts your orbital parameters. Therefore I gave up trying to perfect it, it would be pointless as a single reload would mess it all up again.\u003C/p\u003E\u003Cp\u003ETo do this to this degree of accuracy you need some form of flight computer. I used the remotetech2 flight computer for this, but I\u0027m guessing Mechjeb or kOS works just fine too. You need the flight computer so you can exactly point your ship in any of the 6 directions. It is hard enough to get these numbers down without a burn on the inclination adjusting the period.\u003C/p\u003E\u003Cp\u003EIn general: Burn prograde/retrograde to increase/decrease period. try to cancel vertical speed at the halfway point between apo and peri to circularize and fix your inclination as you always would. When the numbers get low enough you start doing really small puffs of thrust, tap shift and tap x immediately afterwards. If you have access to a flight computer that can que engine commands it helps a lot to make some sort of macro that burn the engine for 0.01 sec at 1% thrust. Using these methods you can usually make the orbit perfect in about 2/3th of an orbit, just in time to deploy the next satellite if you\u0027re doing a constellation like mine.\u003C/p\u003E\n"}]}