{"TopicId":52958,"ForumId":16,"TopicTitle":"Is there an easier way to remove masses of struts?","CreatedByName":"TehUndeadMerc","CreatedById":92767,"CreatedDateTime":"2013-11-13T13:06:01Z","PageNum":1,"Articles":[{"CreatedByName":"TehUndeadMerc","CreatedById":92767,"CreatedDateTime":"2013-11-13T13:06:01Z","Content":"\n\u003Cp\u003EIn a desire to avoid the crafts breaking themselves apart during liftoff; the kerbal engineers have gone overzealous with using struts, to the point where it\u0027s starting to look like a spider web more than a rocket ship.\u003C/p\u003E\u003Cp\u003EIn fear of gathering dust and bugs to drag into space, despite the scientific possibilities, we need to have those removed. But is there an easier way to do it than one by one?\u003C/p\u003E\n"},{"CreatedByName":"M5000","CreatedById":57096,"CreatedDateTime":"2013-11-13T15:48:31Z","Content":"\n\u003Cp\u003EWell, there\u0027s no physics in the editor, so why not remove all those ugly struts and start from scratch? \u003C/p\u003E\u003Cp\u003EI can\u0027t really tell you specifically where to put struts since I have no picture of your craft, but I can offer these guidelines..\u003C/p\u003E\u003Cp\u003E-Triangles. Strut in triangles. \u003C/p\u003E\u003Cp\u003E-If you have a particularly long part, such as a tank attached to another tank, put two on the top, and two on the bottom to the main stack. As well as one more between tanks on top/bottom.\u003C/p\u003E\u003Cp\u003EBut to answer the core of your question, there\u0027s no way that I know of to remove all of one part at once, other than doing it all by hand.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2013-11-13T17:52:51Z","Content":"\n\u003Cp\u003EAnother tip for the future. Always start the struts from the stage that will Jettison. Don\u0027t place the strut on the center. Strut from the outside - in. This way when all your boosters stage it takes the struts with it. The end connection point always vanishes. Does wonders for post launch part count.\u003C/p\u003E\n"},{"CreatedByName":"toomuchbrew","CreatedById":57346,"CreatedDateTime":"2013-11-13T18:10:52Z","Content":"\n\u003Cp\u003EI think B9 has a strutless strut. It just has the ends but no bar and still functions as a strut\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2013-11-13T18:15:25Z","Content":"\n\u003Cp\u003Ebut that\u0027s not really the point... \u003C/p\u003E\u003Cp\u003E@OP I bet there\u0027s probably a mod somewhere on here you just have to find it\u003C/p\u003E\n"},{"CreatedByName":"el_coyoto","CreatedById":49292,"CreatedDateTime":"2013-11-13T18:36:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022briansun1\u0022 data-cite=\u0022briansun1\u0022\u003E\u003Cdiv\u003Ebut that\u0027s not really the point... \u003Cp\u003E@OP I bet there\u0027s probably a mod somewhere on here you just have to find it\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55657-0-22-Kerbal-Joint-Reinforcement-v1-0-Properly-Rigid-Part-Connections\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Joint-Reinforcement v1.0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESeems like a cool mod, but I haven\u0027t tried it for now.\u003C/p\u003E\u003Cp\u003EAnd, apart from editing the .craft file, I have no idea on how to remove all struts at once...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-13T18:39:48Z\u0022 title=\u002211/13/2013 06:39  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 13, 2013\u003C/time\u003E by el_coyoto\u003C/strong\u003E\n\u003Cbr\u003Ewords\n\u003C/span\u003E\n"},{"CreatedByName":"TehUndeadMerc","CreatedById":92767,"CreatedDateTime":"2013-11-13T20:07:54Z","Content":"\n\u003Cp\u003EAll right well thanks.\u003C/p\u003E\n"},{"CreatedByName":"Xzabath","CreatedById":66393,"CreatedDateTime":"2013-11-14T04:44:25Z","Content":"\n\u003Cp\u003EThe Kerbal Joint reinforcement works wonders saves a lot of struts.\u003C/p\u003E\n"},{"CreatedByName":"toolofdarkness","CreatedById":83074,"CreatedDateTime":"2013-11-14T17:54:02Z","Content":"\n\u003Cp\u003Ei can never understand you people who build the massive webs of struts the most struts ive used between two tanks was when i was building a ufo ssto that self stables and that number was 5. two to keep the tanks on the ship two to keep the engines on the tanks and one between the tank that im not too positive i needed. and i never use reenforcement mods. \u003C/p\u003E\u003Cp\u003Ebut to answer your question you need to remove the sections that all the struts start from and rebuild them this should not be to hard since its usualy whats being held to geather are the busters on an asparagus stage rocket\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-11-14T18:09:05Z","Content":"\n\u003Cp\u003EWith some patience you can actually select the base of the strut and remove it like any other part. It\u0027s a small target and often partially embedded in another part, but you can do it.\u003C/p\u003E\u003Cp\u003EAlternatively, edit the craft file and just delete all the struts.\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Andrew Hansen","CreatedById":82311,"CreatedDateTime":"2013-11-14T23:13:54Z","Content":"\n\u003Cp\u003ESince Kerbal Joint Reinforcement seems to make things a little bit \u003Cem\u003Etoo\u003C/em\u003E strong (in my opinion, a rocket the size of a skyscraper shouldn\u0027t stand as still as a pencil), another mod you might try is KW rocketry. They have some Medium and Heavy struts that are much heavier than the super-light stock ones, but are also WAY stronger. If you don\u0027t want to install the whole mod, just go into the Parts folder (or the equivalent) and remove all parts except for the struts.\u003C/p\u003E\u003Cp\u003EI use the heavy and medium struts all the time.\u003C/p\u003E\u003Cp\u003EOr, you could use Kerbal Joint Reinforcement. It just seems a bit overpowered to me.\u003C/p\u003E\n"},{"CreatedByName":"TehUndeadMerc","CreatedById":92767,"CreatedDateTime":"2013-11-14T23:37:20Z","Content":"\n\u003Cp\u003EWell I\u0027d rather first reach every planet in stock before I instal mods (granted I\u0027m using mechjeb because I\u0027m just sick of doing the adjustments, I like to make and watch stuff fly) and considering the furthest I\u0027ve gone is Minmus I don\u0027t think it\u0027s any time soon, I mean I can\u0027t bring a rover anywhere without having my rocket sitting on it!\u003C/p\u003E\n"}]}