{"TopicId":53004,"ForumId":16,"TopicTitle":"Fuel Crossfeed Capable","CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-13T20:26:07Z","PageNum":1,"Articles":[{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-13T20:26:07Z","Content":"\n\u003Cp\u003ESo, I\u0027ve been thinking of making an interplanetary mission (Thank you Brotoro for the inspiration) and was using the following tug design. (Again I blame Brotoro) But I was curious what Fuel Crossfeed Capable actually meant. I\u0027ve never really run into this (Except when clustering engines) I\u0027ve never tried using it as I am here. Will fuel flow from the center tank to the outer nacelles? (They are FL-T800\u0027s covered in heat shields) \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/s6GUfWo\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/s6GUfWo.png\u0022 alt=\u0022s6GUfWo.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-13T21:09:29Z\u0022 title=\u002211/13/2013 09:09  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 13, 2013\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2013-11-13T20:29:15Z","Content":"\n\u003Cp\u003EYup.\u003C/p\u003E\u003Cp\u003E10char.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-11-13T21:36:16Z","Content":"\n\u003Cp\u003EFuel crossfeed capable means fuel will freely flow through the part into wherever there is demand for fuel; To my knowledge fuel tanks only flow top to bottom. Parts like decouplers are not fuel crossfeed capable, meaning fuel above them will not flow to the engine below it, even though fuel runs top to bottom. Therefore fuel will no flow between stages. \u003C/p\u003E\u003Cp\u003EI recently edited (made a second one) a small cube strut to not be crossfeed capable so I could attach fuel lines to run behind some SRB\u0027s without the fuel flowing into the center stack.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-11-13T22:10:01Z","Content":"\n\u003Cp\u003ELook at any part\u0027s configuration file - unless there\u0027s a line in it that specifically says \u0022fuelCrossFeed = False\u0022, it will will allow fuel cross-feed. That\u0027s a sizable fraction of the parts in the game, incidentally.\u003C/p\u003E\u003Cp\u003EIn your design, you can indeed feed the outer nacelles from the central tank; I\u0027ve got that very phenomenon going on with my Thanatos Heavy 7 booster for the Constellation Challenge. You can also go the other direction, of course; it all depends on how you aim your fuel lines (stick them on the part you want the fuel to come \u003Cem\u003Efrom\u003C/em\u003E, connect them to the part you want to run fuel \u003Cem\u003Eto\u003C/em\u003E). It\u0027s part of the usual advice I give to people who are having problems with their early MÃƒÂ¼n landers (e.g. take that FL-T400 you\u0027re using and swap it out with four FL-T100s, put three of those tanks outboard and run fuel lines to the center, put your legs on the outer tanks and voila - you\u0027ve widened and shortened your stack so it\u0027s less likely to tip over while not sacrificing fuel or adding mass).\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-13T22:25:56Z","Content":"\n\u003Cp\u003ENo, fuel will not flow from a central tank to one that\u0027s been attatched radial to it. You\u0027ll need a fuel line for that.\u003C/p\u003E\n"}]}