{"TopicId":53121,"ForumId":16,"TopicTitle":"Mun","CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-11-14T20:44:58Z","PageNum":1,"Articles":[{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-11-14T20:44:58Z","Content":"\n\u003Cp\u003EI landed on the Mun, got into orbit, and realized I wasn\u0027t coming in at a good angle. (Far, deadly reentry) so i loaded my quick save on the surface of the Mun, and now my lander is BELOW the surface, and I can\u0027t click on anything on it, or even control it! \u003C/p\u003E\u003Cp\u003EHelp!\u003C/p\u003E\u003Cp\u003ENote:I already restarted and reloaded the quick save. I\u0027m willing to edit the save file of someone can tell me how.\u003C/p\u003E\u003Cp\u003EMods:\u003C/p\u003E\u003Cp\u003EFar\u003C/p\u003E\u003Cp\u003EDeadly reentry\u003C/p\u003E\u003Cp\u003Etac life support\u003C/p\u003E\u003Cp\u003EIntertstellar\u003C/p\u003E\u003Cp\u003EAnd KW rocketry\u003C/p\u003E\n"},{"CreatedByName":"WAS","CreatedById":42674,"CreatedDateTime":"2013-11-14T20:47:28Z","Content":"\n\u003Cp\u003EHave you tried going through near targets with [ ] keys? I\u0027ve seen similar with landing gear being sucked up by the Muns surface.\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-11-14T20:51:56Z","Content":"\n\u003Cp\u003ENo, I mean the ENtIRE lander is like 20 meters below the surface,\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-11-14T21:10:00Z","Content":"\n\u003Cp\u003EBefore advice: Make a backup of your save file just in case you accidentally make things worse.\u003C/p\u003E\u003Cp\u003EI don\u0027t have access to current game files at work, but if you peek inside the persistent file (or the quicksave), you can find a VESSEL{} module with name = [YourCraftNameHere] (use ctrl-f to find it quickly). Below it there should be a bunch of orbital stats, including I think \u0022alt\u0022 for altitude. I\u0027m not sure what setting you should put it at, but raising the value up some should get it above the terrain. I haven\u0027t messed with these too much, but so long as you leave \u0022landed = True\u0022, I believe it will set itself down on the surface on physics load. (but I could be wrong about that last bit!)\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-11-14T21:21:05Z","Content":"\n\u003Cp\u003EI got it above the surface.. But now I can\u0027t control it and physics doesn\u0027t affect it.\u003C/p\u003E\u003Cp\u003E.??\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-11-14T21:28:13Z","Content":"\n\u003Cp\u003EIt just floats there\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-11-14T21:36:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TechnicalK3rbal\u0022 data-cite=\u0022TechnicalK3rbal\u0022\u003E\u003Cdiv\u003EIt just floats there\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy first instinct is to laugh at the image of the poor Kerbal trying to figure out what\u0027s going on. Sorry for that!\u003C/p\u003E\u003Cp\u003EI don\u0027t know the best way to go about it, but I would next try setting the \u0022sit = ORBITING\u0022 and \u0022landed = False\u0022. Just understand that it may begin falling from whatever height you set.\u003C/p\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2013-11-14T21:41:13Z","Content":"\n\u003Cp\u003EAhh well. It was Jeb. I just terminated it, and he respawned. There went 130 science.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-14T21:41:48Z","Content":"\n\u003Cp\u003EI had to set up the \u0022hgt =\u0022 parameter correctly when I had similar problems with my landed ship on Eeloo. You may try that.\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-11-14T21:56:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EI had to set up the \u0022hgt =\u0022 parameter correctly when I had similar problems with my landed ship on Eeloo. You may try that.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh. Didn\u0027t remember there being a \u0022hgt\u0022 variable. That\u0027s what I get for trying to save file edit without the save file. (while simultaneously performing a data migration for business software... I think I\u0027ve reached a new level in nerd today).\u003C/p\u003E\n"},{"CreatedByName":"codepants","CreatedById":74088,"CreatedDateTime":"2013-11-14T22:11:05Z","Content":"\n\u003Cp\u003EI used to have a similar problem, no mods related, I believe. I had graphics setting turned down. I put them back to default and it solved the problem -- didn\u0027t have to make a new save, never happened again.\u003C/p\u003E\u003Cp\u003EIn my case, I think it has something to do with the way the terrain is loaded on lower graphics settings.\u003C/p\u003E\n"}]}