{"TopicId":53704,"ForumId":16,"TopicTitle":"Rescue Mission!!! Thoughts?","CreatedByName":"Neshma","CreatedById":93751,"CreatedDateTime":"2013-11-19T23:35:36Z","PageNum":1,"Articles":[{"CreatedByName":"Neshma","CreatedById":93751,"CreatedDateTime":"2013-11-19T23:35:36Z","Content":"\n\u003Cp\u003EHi everyone,\u003C/p\u003E\u003Cp\u003ESo I am planning a rescue mission in my KSP career game. You see in the beginning of our space program we may have miscalculated fuel requirements required to deorbit our good friend Jebediah. This has left Jeb on an elipsoid orbit with an apoapsis of about 250km for approximately....2 years.\u003C/p\u003E\u003Cp\u003EWith the presumption that he continues to have breathable air, food, water and waste disposal facilities I have been planning a mission to rescue Jeb from his infinitely stood up date with Kerbal.\u003C/p\u003E\u003Cp\u003EThe biggest challenge here is that he doesnt have any sort of docking post, just a Mk1 Command Pod with an Antennae (I dont think he even has power, hope he\u0027s got some blankets in there!). My plan is this. Build an unmanned intercept vehicle using lander legs to create a \u0022capture\u0022 cage such as a few people have done on various youtube videos. Ill get this vehicle up to rendezvous with Jeb, lightly capture his pod and then light my engines carefully to bring down our cumulative speed, hopefully to the point where his pod is successfully on a deorbit path.\u003C/p\u003E\u003Cp\u003EThen let him go, get out of his way and deorbit the rescue vehicle without its debris pummelling his small cold life boat from above.\u003C/p\u003E\u003Cp\u003EAny thoughts? Do you guys think a capture and burn will annihilate his pod?\u003C/p\u003E\u003Cp\u003ECheers everyone! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Scotius","CreatedById":57622,"CreatedDateTime":"2013-11-19T23:50:35Z","Content":"\n\u003Cp\u003ENo need for such convoluted op \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Do you have access to 3-man pod or Lander Can? If yes, build our rescue ship, use Crew Tab in VAB to remove one of kerbals, and then launch. Rendez-vous with Jeb\u0027s capsule, send him on EVA and just use jetpack to fly to rescue ship. Enter, deorbit burn, land - done \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E If you don\u0027t have multi-crew capsule yet, do not despair - just stick two Mk I pods together, removing kerbal from one of them before launch.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-19T23:54:31Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EMoving this to Gameplay Questions.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAlso, seconding Scotius\u0027s remarks: You don\u0027t need to build a \u0022grabber\u0022 to have an effective rescue craft. Since you\u0027ve mentioned you\u0027re thinking about building an unmanned craft, you could simply build a craft using a probe body as the root part, then add a crew capsule to that and build the rest of the rocket around that. Launch it empty, have it rendezvous with the stranded craft, and transfer Jeb over to the lifeboat. This way, you won\u0027t even have to worry about putting other crewmembers at risk.\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2013-11-20T00:16:21Z","Content":"\n\u003Cp\u003EThese sort of proposals have been floated around for a while and the long \u0026amp; short of it is, a capture cage wont work. Or rather they will work, but only until you try to warp, and then everything goes to hell. Something about un-attached things in that close of proximity, little bumps and nudges are magnified under any sort of warp and will tear your ships apart.\u003C/p\u003E\u003Cp\u003ESo unless the return trip is a real short one, without physics warp you\u0027ll be letting this mission run for days.\u003C/p\u003E\u003Cp\u003EMy recommendation is to fire off an empty pod, controlled by a probe box and make an EVA rescue and ditching the dead vessel.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-20T01:11:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Franklin\u0022 data-cite=\u0022Franklin\u0022\u003E\u003Cdiv\u003EThese sort of proposals have been floated around for a while and the long \u0026amp; short of it is, a capture cage wont work. Or rather they will work, but only until you try to warp, and then everything goes to hell. Something about un-attached things in that close of proximity, little bumps and nudges are magnified under any sort of warp and will tear your ships apart.\u003Cp\u003ESo unless the return trip is a real short one, without physics warp you\u0027ll be letting this mission run for days.\u003C/p\u003E\u003Cp\u003EMy recommendation is to fire off an empty pod, controlled by a probe box and make an EVA rescue and ditching the dead vessel.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the warp thing, you also can\u0027t use timewarp. That turns of the physics, and than the stranded craft will float right out of the cage.\u003C/p\u003E\u003Cp\u003EThough at a 250km orbit, it wouldn\u0027t only take a small nudge to get it back into atmosphere, and thus to crash (or land, if you have chutes).\u003C/p\u003E\u003Cp\u003EIt\u0027s still easier to just send up an empty seat, put Jeb in the seat, land the seat, and leave the debris though\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-11-20T01:30:15Z","Content":"\n\u003Cp\u003EIf you have a probe body of any kind, but not the 3-man capsule, you can send an empty Mk1 capsule instead. \u003Ca href=\u0022https://www.youtube.com/watch?v=k6v3n2_8X0A\u0022 rel=\u0022external nofollow\u0022\u003EThat\u0027s what I did in the exact same situation\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EOr if you\u0027re daring, you can get out and push. At Apoapsis your EVA pack has more than enough power to get your Periapsis into Kerbin\u0027s atmosphere and get you home. Just be careful not to run out of pack fuel or you\u0027ll never get back into your ship! (That would be especially bad if you\u0027ve successfully put yourself into a deorbit trajectory!)\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-20T01:53:24Z","Content":"\n\u003Cp\u003Ei assume you want all the science he\u0027s been collecting, so a grabber would do the trick, i have a misson report of a very similar situation. stuck around the mun with no fuel or power.\u003C/p\u003E\n"},{"CreatedByName":"Traches","CreatedById":79229,"CreatedDateTime":"2013-11-20T05:02:25Z","Content":"\n\u003Cp\u003EThere\u0027s a time honored \u0022cheaty\u0022 way to fix that problem--\u003C/p\u003E\u003Cp\u003EYou said your apoapse is at 250km, which means your periapse is a bit lower? Point your capsule retrograde when you get to apoapse, EVA with Jeb, and push! When you\u0027re almost out of jetpack fuel, get in the ship and get back out again. (For now) that\u0027ll top him back off. Rinse and repeat until your periapse is in the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"RavenX13","CreatedById":93174,"CreatedDateTime":"2013-11-21T13:36:48Z","Content":"\n\u003Cp\u003EMy space program faced the exact same problem. He can be rescued!\u003C/p\u003E\u003Cp\u003EOur rescue mission sent up an empty capsule and Jeb performed an EVA to reach the fueled return vehicle.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-11-21T15:04:06Z","Content":"\n\u003Cp\u003ENot much I can add here - your options are to A) send a craft with an available empty seat to rendezvous with Jeb and jetpack him over, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E send a ship to capture Jeb\u0027s pod (with the problem that you won\u0027t be able to warp without risking both craft, or C) get out and push. It really depends on if there\u0027s any science aboard the pod that you want to keep. I will note that if the ship has no power, you\u0027re probably going to have a tough time firing off its chutes; if it were me, I\u0027d bite the bullet and go with A).\u003C/p\u003E\n"},{"CreatedByName":"Soda Popinski","CreatedById":92416,"CreatedDateTime":"2013-11-21T16:04:24Z","Content":"\n\u003Cp\u003EI\u0027ve done the cage push method for both getting a kerbal into the atmosphere from an elliptical Kerbin orbit, and much harder from a heliocentric orbit (Jeb got sling-shot by the Mun\u0027s gravity outward).\u003C/p\u003E\u003Cp\u003EIt\u0027ll work, just don\u0027t use time warp. For your case, you only need to thrust at Apoapsis for a brief time until your periapsis hits the atmosphere. Once thrusting is done, allow your craft to separate (RCS?) a little bit, and let both reenter. Easy cheesy, and you get to keep the stowed science. The toughest part with be learning how to do the orbital rendezvous, if you don\u0027t already know how.\u003C/p\u003E\u003Cp\u003EI recommend launching right before Jeb is over the KSC. If you don\u0027t match then, match your periaps, angle of inclination (green tabs), set your target to Jeb, and apply thrust at periaps until the intercept nodes get close enough (ideally \u0026lt; 0.5 km) using a maneuver node. Once you\u0027ve thrusted and have it matched up, set up a maneuver node at the spot of intercept, to match Jeb\u0027s orbit, so when you intercept you burn just enough to match velocity (get relative / target velocity as close to 0 as you can), then use RCS or low thrust to get to Jeb. I use RCS translation (IJLK keys) to push the yellow prograde marker (in Target mode) to the center of the purple target. You can keep your speed down that way, instead of using the main engine to aim.\u003C/p\u003E\n"},{"CreatedByName":"Neshma","CreatedById":93751,"CreatedDateTime":"2013-11-22T04:51:33Z","Content":"\n\u003Cp\u003EI\u0027d like to thank all space agencies who collaborated with my own. We have finally recovered Jeb sans sanity and likely unable to walk for the rest of his life.\u003C/p\u003E\u003Cp\u003EOur astronaut discovered that using RCS to push a tumbling command pod is quite unhealthy but none the less he has been returned home safely! Thank you all and here is the mission report for your interest:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59190-The-daring-rescue-of-Jebediah-stranded-first-Kerbal-in-space%21-%28Pic-Heavy%29?p=795688#post795688\u0022 rel=\u0022external nofollow\u0022\u003EThe rescue of Jebediah Kerbal\u003C/a\u003E\u003C/p\u003E\n"}]}