{"TopicId":53953,"ForumId":16,"TopicTitle":"Can\u0026#039;t get things to connect in the VAB","CreatedByName":"Rabid_Monkey","CreatedById":93704,"CreatedDateTime":"2013-11-22T00:58:01Z","PageNum":1,"Articles":[{"CreatedByName":"Rabid_Monkey","CreatedById":93704,"CreatedDateTime":"2013-11-22T00:58:01Z","Content":"\n\u003Cp\u003EI\u0027ve been fighting with the interface quite a bit lately. I want to build things, but nothing seems to attach properly. For example, I\u0027d like to use some structural panels, but they won\u0027t connect to each other in any helpful way. I see that they have the green connect ball, but I can\u0027t attach them to each other by edges, and the ball itself doesn\u0027t seem to want to connect to anything other than a radial part (like a tank or engine). I\u0027ve also noticed the \u0022no no, I won\u0027t go\u0022 issue when using angle and symmetry modes. Sometimes turning off angle snap helps, but it seems to be mostly hit and miss. Any thoughts or suggestions?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-23T23:28:52Z\u0022 title=\u002211/23/2013 11:28  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 23, 2013\u003C/time\u003E by Rabid_Monkey\u003C/strong\u003E\n\u003Cbr\u003EAnswered\n\u003C/span\u003E\n"},{"CreatedByName":"Dogface","CreatedById":75396,"CreatedDateTime":"2013-11-22T02:25:46Z","Content":"\n\u003Cp\u003EIt doesnt sound like youre doing anything wrong. Some parts dont go together, or dont allow attachment to all areas. structural panels are the best example of that.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-11-22T09:29:43Z","Content":"\n\u003Cp\u003EPerhaps a picture would help here, so that we can see in what way you\u0027re trying to connect things.\u003C/p\u003E\n"},{"CreatedByName":"Mmmmyum","CreatedById":85231,"CreatedDateTime":"2013-11-22T09:38:36Z","Content":"\n\u003Cp\u003EI think it\u0027s because of your view. Try and adjust the camera so you can move the node into line with the other node and not the fuselage. It seems to jump around a bit when you\u0027re trying to put it near another part\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-11-22T09:45:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabid_Monkey\u0022 data-cite=\u0022Rabid_Monkey\u0022\u003E\u003Cdiv\u003Ethe ball itself doesn\u0027t seem to want to connect to anything other than a radial part\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, rotate (WASDQE) the structural panel so it is perpendicular to the direction in which you want to attach it. For instance when mounting it on top of a fuel tank, it must be rotated so it is flat with regards to the tank\u0027s top surface.\u003C/p\u003E\u003Cp\u003ESecond, rotate your view so your mouse is not pointing at any surface of the ship. The attach point you\u0027re using needs to be sticking out of the body of the ship.\u003C/p\u003E\u003Cp\u003EThen hover your mouse around that attach point. At correct position the panel will stick to it. Notice the panel has two attach points (one on each surface) and you need to use the right one or your panel will clip inside the part you\u0027re attaching it to.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabid_Monkey\u0022 data-cite=\u0022Rabid_Monkey\u0022\u003E\u003Cdiv\u003Ebut I can\u0027t attach them to each other by edges\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile holding the new panel on your mouse, zoom in on the panel you want to attach it to and point on the edge of the target panel. You need to point to the few pixels of its width to place another panel there.\u003C/p\u003E\n"},{"CreatedByName":"Rabid_Monkey","CreatedById":93704,"CreatedDateTime":"2013-11-22T21:36:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EWhile holding the new panel on your mouse, zoom in on the panel you want to attach it to and point on the edge of the target panel. You need to point to the few pixels of its width to place another panel there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh! That helped quite a bit, thanks Kasuha. I also figured out you can rotate the entire craft while you\u0027re working on it with WASD, which helped a lot with the specific issue I was having. \u003C/p\u003E\u003Cp\u003EFor those of you who replied, I\u0027m building a probe ship to carry 5 probes to Minmus for some juicy science. I have them rigged so one the ship is in orbit, I can drop them off one at a time when I see someplace that looks interesting. I leave the \u0022top\u0022 one attached for control and the other four are splayed around it perpendicularly. Once the last one leaves I start to de-orbit the remains of the \u0022mothership\u0022 so it will crash at some point. Onward to Minmus!\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-22T22:33:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rabid_Monkey\u0022 data-cite=\u0022Rabid_Monkey\u0022\u003E\u003Cdiv\u003EAh! That helped quite a bit, thanks Kasuha. I also figured out you can rotate the entire craft while you\u0027re working on it with WASD, which helped a lot with the specific issue I was having. \u003Cp\u003EFor those of you who replied, I\u0027m building a probe ship to carry 5 probes to Minmus for some juicy science. I have them rigged so one the ship is in orbit, I can drop them off one at a time when I see someplace that looks interesting. I leave the \u0022top\u0022 one attached for control and the other four are splayed around it perpendicularly. Once the last one leaves I start to de-orbit the remains of the \u0022mothership\u0022 so it will crash at some point. Onward to Minmus!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis plan would also be useful for the Mun, just land a probe in each crater.\u003C/p\u003E\n"}]}