{"TopicId":54141,"ForumId":16,"TopicTitle":"RemoteTech2 Relay Networks","CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-11-23T21:32:40Z","PageNum":1,"Articles":[{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-11-23T21:32:40Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003E As an avid fan of RemoteTech (I really enjoy setting up satellite networks), I was overjoyed to discover that it received an update and now has a much nicer interface and is a little less confusing.\u003C/p\u003E\u003Cp\u003E I managed to set up a lovely relay network around Kerbin; it is a network of 6 satellites in LKO, all with an antenna and satellite dish. The dishes are configured to point at the active vessel.\u003C/p\u003E\u003Cp\u003E My question is, how would I go about expanding this network? I want to build a Munar satellite constellation, but I\u0027m not sure how to make the dishes work. Since all the dishes point towards whichever ship is currently active, they would not work for a relay network, as they point at the active vessel, rather than the satellites in orbit. (i.e. for a base on the far side of the Mun, they would be useless)\u003C/p\u003E\u003Cp\u003E To help illustrate this, I\u0027ve tried to diagram what I want to happen below:\u003C/p\u003E\u003Cp\u003E Kerbin -\u0026gt; KerbinNetwork -\u0026gt; MunarNetwork -\u0026gt; Mun\u003C/p\u003E\u003Cp\u003E To the best of my knowledge, what\u0027s happening right now is this:\u003C/p\u003E\u003Cp\u003E Kerbin -\u0026gt; KerbinNetwork -\u0026gt; Active Vessel\u003C/p\u003E\u003Cp\u003E While I have considered setting the Kerbin Network\u0027s satellites to point at the Mun, I still want to preserve connections for any other craft in the Kerbin system. Is there a way I could make my grand plans work, or should I just launch another series of satellites around Kerbin?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-24T03:15:02Z\u0022 title=\u002211/24/2013 03:15  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 24, 2013\u003C/time\u003E by CalculusWarrior\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nud","CreatedById":94074,"CreatedDateTime":"2013-11-23T22:30:29Z","Content":"\n\u003Cp\u003EDoing some search, for satelites it\u0027s best if you have omnidirectional antenas, they will always have some sort of connection, so the best way to make a relay of connections is to have antenas on it, because they don\u0027t target, they receive and send through\u003C/p\u003E\n"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2013-11-23T23:20:46Z","Content":"\n\u003Cp\u003EMOAR DISHES.\u003C/p\u003E\u003Cp\u003ENo, really. Put more antennas on your relays, then target them to relay to each other as well as the active vessel. For instance, I currently have three relays in Kerbin-synchronous orbit; they\u0027ve each got four Comms DTS-M1 dishes, set to 1) Mission Control, 2) the relay in front of their orbit, 3) the relay behind in the orbit, and 4) the active vessel. This gives me coverage everywhere in Kerbin SOI except behind the two moons. My plan, when I expand out of Kerbin SOI, is to add more relays into this orbit, with two dishes bouncing sideways into the existing ring, and one or more large dishes targeting long-range targets.\u003C/p\u003E\u003Cp\u003EThe existing relays, then, will only have to be retargeted to bounce along the ring instead of bypassing the new relays, and their existing \u0022Active Vessel\u0022 dishes can stay put and communicate with whatever I\u0027m flying inside Kerbin SOI.\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2013-11-24T00:13:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Nud\u0022 data-cite=\u0022Nud\u0022\u003E\u003Cdiv\u003EDoing some search, for satelites it\u0027s best if you have omnidirectional antenas, they will always have some sort of connection, so the best way to make a relay of connections is to have antenas on it, because they don\u0027t target, they receive and send through\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI already have tons of antennae (seriously, I go overboard with them; the satellites look so cool), and while I would utilize them exclusively their range is not sufficient to reach the Mun, where I want to set up my Munar base.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DeMatt\u0022 data-cite=\u0022DeMatt\u0022\u003E\u003Cdiv\u003EMOAR DISHES.\u003Cp\u003ENo, really. Put more antennas on your relays, then target them to relay to each other as well as the active vessel. For instance, I currently have three relays in Kerbin-synchronous orbit; they\u0027ve each got four Comms DTS-M1 dishes, set to 1) Mission Control, 2) the relay in front of their orbit, 3) the relay behind in the orbit, and 4) the active vessel. This gives me coverage everywhere in Kerbin SOI except behind the two moons. My plan, when I expand out of Kerbin SOI, is to add more relays into this orbit, with two dishes bouncing sideways into the existing ring, and one or more large dishes targeting long-range targets.\u003C/p\u003E\u003Cp\u003EThe existing relays, then, will only have to be retargeted to bounce along the ring instead of bypassing the new relays, and their existing \u0022Active Vessel\u0022 dishes can stay put and communicate with whatever I\u0027m flying inside Kerbin SOI.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMOAR DISHES, eh? Hmm, that\u0027s another to add to my MOAR BOOSTERS and MOAR STRUTS mantra, I will give it a shot! I currently am avoiding the requirement of four dishes by having a bunch of satellites in LKO, but I may decide to add some kerbostationary (is that the correct word) dishes. Thanks so much!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-24T00:16:33Z\u0022 title=\u002211/24/2013 12:16  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 24, 2013\u003C/time\u003E by CalculusWarrior\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frederf","CreatedById":3844,"CreatedDateTime":"2013-11-24T01:13:15Z","Content":"\n\u003Cp\u003EMy method is going to be more of a branched network like a road network. There are local roads and highways. Local coverage is omni directional satellite arrays (2-4 per body) and then body-body communication is dedicated directional units that bridge the local zones together. So Kerbin surface to Mun surface might go through the LKO local sats to a Kerbin-Mun sat possibly in a high polar eccentric orbit then to a Mun-Kerbin sat in the same way. From there to a local LMO sat array to anywhere on the surface.\u003C/p\u003E\u003Cp\u003EMinmus, Duna, Jool, etc. all have their own dedicated pair from Kerbin (or possibly a manned station). What I\u0027m not sure of is if I need more than one highway \u0022bookend\u0022 sat per link to maintain 100% coverage or even if I need full coverage.\u003C/p\u003E\n"},{"CreatedByName":"WafflesToo","CreatedById":71736,"CreatedDateTime":"2013-11-24T02:40:13Z","Content":"\n\u003Cp\u003EI set my network up with six satellites up in GSO (KSO? anyway) each equipped with a Communotron-32 antenna. That gives me coverage over LKO. Two of the satellites are also equipped with a pair of 50Mm dishes; one pointed at Mun and one pointed at Minmus. When I get to it I\u0027ll be adding com satellites around each of those bodies; probably a ring of three satellites equally spaced around a 2Mm polar orbit (also geared with Communotron-32s) and a pair of satellites in a 2Mm equatorial orbit equipped with one Communotron and a single 50Mm dish antenna pointed back at Kerbin.\u003C/p\u003E\u003Cp\u003EThat\u0027s the plan anyway.\u003C/p\u003E\u003Cp\u003EI\u0027m not planing on expanding the network beyond Kerbin, instead I was going to take advantage of 6-kermins = a command station and set up localized nodes exploiting it that way.\u003C/p\u003E\n"}]}