{"TopicId":54525,"ForumId":16,"TopicTitle":"Terrific game, now I am stuck.","CreatedByName":"Razorforce7","CreatedById":94677,"CreatedDateTime":"2013-11-27T19:40:04Z","PageNum":1,"Articles":[{"CreatedByName":"Razorforce7","CreatedById":94677,"CreatedDateTime":"2013-11-27T19:40:04Z","Content":"\n\u003Cp\u003EAs you can see, this is my first post. And I\u0027m here to say that this sim is absolutely terrific, I love space and spaceflight. \u003C/p\u003E\u003Cp\u003ENever knew this sim existed, wish I had found it sooner.\u003C/p\u003E\u003Cp\u003EI\u0027ve played it for over a week now. I made suborbital rockets, spacewalks, full orbital rockets. I even made a 5 stage moon rocket that got one of my kerbals walking on mun and minmus and returned them back safely to the earth .... uhm Kerbal I mean ofcourse.\u003C/p\u003E\u003Cp\u003EThis is my moon rocket. \u003Ca href=\u0022http://imageshack.com/a/img818/5060/qhih.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imageshack.com/a/img818/5060/qhih.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ETo be completely honest. I havent yet learned how to properly navigate. I only have understanding about gravity and planetary orbits because I\u0027m fond of astronomy in the first place. So for that reason I have understanding of it. The way I got to the moon was orbiting kerbal in a way that the plane aligned to muns orbit and then I fired my rocket into a elliptical orbit roughly past the opposite side of kerbin. I wasn\u0027t always completely accurate so I sometimes had to retro burn speed in the hope that the mun would pull me into her orbit. \u003C/p\u003E\u003Cp\u003EI didn\u0027t fail a moon mission because my moon rocket is pretty decent and if I was innacurate in my aproach I knew usually what to use my fuel for in order to fix my aproach.\u003C/p\u003E\u003Cp\u003EBasically I\u0027m trying to say that I have no idea what instruments to calculate byforehand how to exactly insert my burn in a transmun injection transminmus injection. I basically just guess where I should posibly hit one of both and havent yet failed in my instinctive qualities.\u003C/p\u003E\u003Cp\u003EI\u0027m sure there are some necessary instruments, data that I can extract from tutorials assuming some would share them with me.\u003C/p\u003E\u003Cp\u003EI\u0027m actually not asking this because I want my mun, minmus missions perfected. \u003C/p\u003E\u003Cp\u003EThe thing is that I decided to take a sattelite trip to \u0022eve\u0022 with these newbysh poorly inaccurate transfer methods. Just guess only once how hard I failed? \u003C/p\u003E\u003Cp\u003EWell, actually not to bad. My understanding in getting to eve is to leave kerbals orbit in kerbals retrograde position around the sun when eve is still about 1/6th orbit behind kerbin. Or in other words when eves orbit inclination is so many degrees behind kerbin (how many must that be anyway?) By leaving kerbin in the correct position I lower my periapsis around the sun, hoping that this route closes down to the same position eve is about to at the moment I reach eve at my pea around the sun.\u003C/p\u003E\u003Cp\u003EI got close, very close. about 500,000,000m close. Obviously not close enough to be captured by eves gravity. Or to burn into his orbit with the fuel that I had left. \u003C/p\u003E\u003Cp\u003EOut of interest, I used this probe to get to eve that I mounted onto a modified version of my moon rocket. \u003Ca href=\u0022http://imageshack.com/a/img819/3186/p5um.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imageshack.com/a/img819/3186/p5um.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOh and this is the orbit chart to show you how I got my orbits worked out atm. \u003Ca href=\u0022http://imageshack.com/a/img69/4671/z6w9.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imageshack.com/a/img69/4671/z6w9.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EYou see that my path with eve might intersect.\u003C/p\u003E\u003Cp\u003EAnother navigational piece that I think I cannot deal with yet is that eves ecliptic (angle) around the sun is a little different then kerbins. And if not then the angle of my probes orbital plane does not match eves ones at all as you can see right here \u003Ca href=\u0022http://imageshack.com/a/img89/3494/zije.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imageshack.com/a/img89/3494/zije.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELong story short is that I don\u0027t know how to really perform interplanetary travel. I only basically (which is incompletely) know how to plan the course and perform it. I don\u0027t simply know to do a trans injection to any place.\u003C/p\u003E\u003Cp\u003ECan you guys help me with some reading material, or tips of any kind.\u003C/p\u003E\n"},{"CreatedByName":"Sternface","CreatedById":83299,"CreatedDateTime":"2013-11-27T20:43:06Z","Content":"\n\u003Cp\u003ESorry, no time for a proper response. I recommend using Mechjeb as a form of tutorial. Don\u0027t just click and go, but study what it does, and use it as a template. \u003C/p\u003E\u003Cp\u003ETravel in space is basically a game of changing orbits. As opposed to \u0022straight-line\u0022 travel. You always want to modify your orbit such that you intersect with your target\u0027s orbit, and at a time when the distance between is smallest. Then, at minimum distance, you match orbital velocities. Matching velocities is much easier when you are entering a target\u0027s gravitational sphere of influence. All you need to do is set your Pe as low as possible, and burn retrograde to reduce your eccentricity to below 1. Mechjeb and EngineerRedux will show you the data needed.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-27T21:00:54Z","Content":"\n\u003Cp\u003EWelcome. 500.000km is actually pritty close for a first noobish try on Eve after a week \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy first tip: That cockpit on your Mun rocket (it\u0027s the Mun here, not moon. Small details) is an airplane cockpit, not a rocket cockpit. Not to big a deal, but it looks silly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ESecond: The way you discribe failures sounds like you are not using manouvernodes. Click on the orbit (blue line) and it\u0027ll open a manouver node. Now drag one of the icons to simulate what would happen if you burned in that direction for that long. It\u0027ll draw a dotted line of your predicted orbit. Play with that until you get what you want (you can also drag the manouver node around by clicking in the center and dragging it) until you get what you want. Than excecute that node. This is how you get a Mun encounter.\u003C/p\u003E\u003Cp\u003EMake a node, drag prograde (in the direction you are traveling) until you get an encounter. Than excecute that node. Boom, mun encounter.\u003C/p\u003E\u003Cp\u003ESame thing for interplanetery. Firstly, get towards it. Burn towards either a prograde, or retrograde escape from Kerbin, depending on if you want to go to inner planets, or outer planets. While you plan the node, get the predicted orbit as close as you can. Than once you escaped Kerbin\u0027s SOI, put up another node and finetune the encounter. Do this a couple of times along the path, and you\u0027ll get an encounter.\u003C/p\u003E\u003Cp\u003EOn the different plane between Kerbin and Eve: Click on Eve and hit \u0027select as target\u0027 (or something like that. Not sure what it is as I\u0027m not in the game atm). If you have it as target, a node will open up along your orbit. That\u0027s the accending, or decending node. Mouse over it will tell you how much degrees you are off. That node is also the spot where you need to make a correction burn to get on the same plane. So put a manouver node on the accending, or decending node (just pick the one you get to first) and drag the purple icons to remove the difference. When you have the manouver node open, the accending/decending node number will you what it is AFTER you completed the manouver node. So just drag the purple icon until the node sais 0 (or something close to it). Excecute that node will get you MUCH closer to an encounter.\u003C/p\u003E\u003Cp\u003EThe mod Mechjeb will give you an autopilot that does all these things for you. If you let it do that for you, and watch how it does these things, you\u0027ll soon learn how to do them yourself (and how to do them better than Mechjeb. Cause it\u0027s far from perfect)\u003C/p\u003E\u003Cp\u003EFinally: Tuturials.\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/eVPMTQfOvYQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E This one is an awesome explantion on how to transfer to a moon. In this case Minmus, which is easier to land on than Mun\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/jiB2ywSM6i0?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E This one is an awesome explanation on how to get to other planets\u003Cp\u003EGood luck\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2013-11-27T21:05:11Z","Content":"\n\u003Cp\u003EHave you discovered maneuver nodes yet? Click somewhere on your orbit and an object comes up with 6 radial handles that you can drag on. The handles represent different vectors and when you manipulate them, you get a preview of what the resulting orbit will be. Handy for generating intercepts and flight plans ahead of time.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-11-27T21:12:13Z","Content":"\n\u003Cp\u003EHere\u0027s a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/25029-A-moon-rocket-and-moon-trip-walkthrough-for-newbies-(21-1)\u0022 rel=\u0022external nofollow\u0022\u003Ewalkthrough \u003C/a\u003Efor getting to the moons. Many of the mechanics for getting to other planets are similar. For the rest, try \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/16511-Tutorial-Interplanetary-How-To-Guide?highlight=interplanetary\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2013-11-27T21:47:11Z","Content":"\n\u003Cp\u003EFirst, welcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m going to second almost everything that\u0027s already been said. In addition, I\u0027m going to add a few more of my own recommendations:\u003C/p\u003E\u003Cp\u003EFirst: Once you\u0027ve read the Interplanetary How-To Guide (linked in Vanamonde\u0027s post), you may want to check out alexmoon\u0027s \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003EInterplanetary Launch Window Planner\u003C/a\u003E. It\u0027s slightly better than olex\u0027s calculator for many cases, since it calculates transfers based on the planets\u0027 actual orbits, not just idealized circular orbits at a given average altitude.\u003C/p\u003E\u003Cp\u003ESecond: One thing you can do to help prepare yourself for interplanetary missions is set up transfer missions back and forth between the Mun and Minmus. The principles involved are the same, just on a much smaller scale, so you don\u0027t need nearly as much time or delta-v as you would for an actual interplanetary mission. Once you can consistently transfer between those two bodies, you can apply what you\u0027ve learned doing that to your interplanetary missions. As Sternface says, ultimately everything in this game boils down to changing orbits to get the desired result.\u003C/p\u003E\u003Cp\u003EFinally, in addition to the tutorials already mentioned, feel free to check out those listed on the Drawing Board, which is linked in my signature.\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n"},{"CreatedByName":"Razorforce7","CreatedById":94677,"CreatedDateTime":"2013-11-27T21:50:52Z","Content":"\n\u003Cp\u003EAll wonderfull information I didn\u0027t yet know.\u003C/p\u003E\u003Cp\u003EThanks everybody, gonna check it all out.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2013-11-27T22:52:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022FenrirWolf\u0022 data-cite=\u0022FenrirWolf\u0022\u003E\u003Cdiv\u003EHave you discovered maneuver nodes yet? Click somewhere on your orbit and an object comes up with 6 radial handles that you can drag on. The handles represent different vectors and when you manipulate them, you get a preview of what the resulting orbit will be. Handy for generating intercepts and flight plans ahead of time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EExactly what I was wondering. If he\u0027s done everything he\u0027s done so far \u003Cem\u003Ewithout\u003C/em\u003E the use of maneuver nodes I\u0027d be very much impressed. I\u0027m not an awful pilot, but I couldn\u0027t even consider approaching, orbiting, landing and returning from any body without planner nodes.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-27T23:06:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Franklin\u0022 data-cite=\u0022Franklin\u0022\u003E\u003Cdiv\u003EExactly what I was wondering. If he\u0027s done everything he\u0027s done so far \u003Cem\u003Ewithout\u003C/em\u003E the use of maneuver nodes I\u0027d be very much impressed. I\u0027m not an awful pilot, but I couldn\u0027t even consider approaching, orbiting, landing and returning from any body without planner nodes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not to dificult once you know how orbits work. For example, start burning when you see the Mun come up on the horizon (while you are watching the rocket in Low Orbit), and you\u0027ll end up on a Mun encounter.\u003C/p\u003E\u003Cp\u003EStill impressive offcourse\u003C/p\u003E\n"},{"CreatedByName":"Lohan2008","CreatedById":80945,"CreatedDateTime":"2013-11-27T23:18:52Z","Content":"\n\u003Cp\u003EWhen you get to 10km tilt 30-45% to East / 90 on blue ball \u0026gt; at 120 km set up circle orbit once you hit 2200 m/s \u0026gt; line up Mun when it comes up to Kerbin\u0027s horizon and click on orbit to select thrust/pith/yaw with the orange star \u0026gt; pull green (thrust) til the path line intersect Mun = profit. \u003C/p\u003E\u003Cp\u003EDitto, use a command capsule as they can re-enter atmosphere if they haz parachute.\u003C/p\u003E\n"},{"CreatedByName":"Razorforce7","CreatedById":94677,"CreatedDateTime":"2013-11-28T00:12:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Franklin\u0022 data-cite=\u0022Franklin\u0022\u003E\u003Cdiv\u003EExactly what I was wondering. If he\u0027s done everything he\u0027s done so far \u003Cem\u003Ewithout\u003C/em\u003E the use of maneuver nodes I\u0027d be very much impressed. I\u0027m not an awful pilot, but I couldn\u0027t even consider approaching, orbiting, landing and returning from any body without planner nodes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe reason I might pull it off is despite knowing things about astronomy is that I play around with things like universe sandbox or orbiter spaceflight simulator once in a while (the latter not that much tbh) It might be ironic to some that I did land there (and got back) w/o using instruments and then come here to ask how to instruments work:sticktongue:\u003C/p\u003E\u003Cp\u003EMaybe I should make a non instrumental mun landing video then if I got spare time.\u003C/p\u003E\u003Cp\u003EMeanwhile I just watched the 2 aforementioned videos that explained those maneouvre nodes to me. It seems quite understandable and I\u0027ll try to practice with it tommorow. The Mechjeb and the protractor mod are a little in depth in terms of information and multitude of different options. Atleast I have new things to work on.\u003C/p\u003E\u003Cp\u003ESo far I think I have my question(s) answered so will the post status be. But if you have any additional comment, usefull information i.e. i\u0027d gladly hear it.\u003C/p\u003E\n"},{"CreatedByName":"obi_juan","CreatedById":89945,"CreatedDateTime":"2013-11-28T00:23:23Z","Content":"\n\u003Cp\u003EI think that you need a very interesting tutorials (in special rendezvous tutorial). These are in-game tutorials:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/rendezvous-tutorial/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/rendezvous-tutorial/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/docking-tutorial/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/docking-tutorial/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/49919-0-22-0-Moon-Travel-Tutorial-1-0-1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/49919-0-22-0-Moon-Travel-Tutorial-1-0-1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Emade by blizzy78 \u003C/p\u003E\u003Cp\u003EWith them you will learn how to be more precise to made interplanetary ships\u003C/p\u003E\n"},{"CreatedByName":"Razorforce7","CreatedById":94677,"CreatedDateTime":"2013-11-29T21:29:00Z","Content":"\n\u003Cp\u003EI just came back to reply that I got it. In fact I got the hang of these maneouvre nodes near to immediately after it was suggested by you guys. I thought I had to reply to it. I got to a encounter with eve. I even did a munar landing and a Minmus landing in the same mission and got back to kerbin with the aforementioned rocket. Discovering that my rocket was a bit to overdone. So I shrunk mine down to the bare minimum for a return munar mission. Know it\u0027s this one, alot smaller \u003Ca href=\u0022http://imageshack.com/a/img600/3342/1cpb.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imageshack.com/a/img600/3342/1cpb.jpg\u003C/a\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022obi_juan\u0022 data-cite=\u0022obi_juan\u0022\u003E\u003Cdiv\u003EI think that you need a very interesting tutorials (in special rendezvous tutorial). These are in-game tutorials:\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/rendezvous-tutorial/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/rendezvous-tutorial/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://kerbalspaceprogram.com/docking-tutorial/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/docking-tutorial/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/49919-0-22-0-Moon-Travel-Tutorial-1-0-1\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/49919-0-22-0-Moon-Travel-Tutorial-1-0-1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Emade by blizzy78 \u003C/p\u003E\u003Cp\u003EWith them you will learn how to be more precise to made interplanetary ships\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd thank to you for your share of information.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-11-30T10:08:33Z","Content":"\n\u003Cp\u003ELike like a fine rocket. No fuel lines though?\u003C/p\u003E\u003Cp\u003EIf you use fuel lines to drain the fuel from the outer tanks into the inner one, you can drop the outer tanks with the inner still being full, even though all 3 engines were on. This improves your deltaV without adding any fuel\u003C/p\u003E\u003Cp\u003EYou also forgot the lander legs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"harald705","CreatedById":93266,"CreatedDateTime":"2013-11-30T13:50:06Z","Content":"\n\u003Cp\u003EWhen i first started, Scott Manleys tutorials really helped me out. Here is some of the tutorials i have found useful\u003C/p\u003E\u003Cp\u003EBeginners guide:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/tgPr4q5tj-Q?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EGoing to mun and minmus:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/cmAMGJm-bwU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EAnd here is some aircraft tutorials:\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/R-TFRnVyjso?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E,\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/uo1C3lODTJU?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E,\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/TxUULv9B5xQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EHopefully this will keep you busy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr.Rocket","CreatedById":80241,"CreatedDateTime":"2013-12-01T00:42:37Z","Content":"\n\u003Cp\u003EI would recommend playing around with maneuver nodes until you see eve ecounter, that way, you don\u0027t waste any fuel experimenting. Also, if you like mods, use kerbal alarm clock and you can set a timer to the best time to go to Eve.\u003C/p\u003E\n"},{"CreatedByName":"Razorforce7","CreatedById":94677,"CreatedDateTime":"2013-12-03T13:40:24Z","Content":"\n\u003Cp\u003E@harold705\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003E@sirrobert. \u003C/p\u003E\u003Cp\u003EI know i know. The reason i didn\u0027t use fuel lines and landing gear is because i play carreer mode. I just didn\u0027t yet unlocked one of both. I have NOw though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-03T13:42:25Z\u0022 title=\u002212/03/2013 01:42  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 3, 2013\u003C/time\u003E by Razorforce7\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"EtherDragon","CreatedById":82405,"CreatedDateTime":"2013-12-03T17:52:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Razorforce7\u0022 data-cite=\u0022Razorforce7\u0022\u003E\u003Cdiv\u003E@harold705\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003E@sirrobert. \u003C/p\u003E\u003Cp\u003EI know i know. The reason i didn\u0027t use fuel lines and landing gear is because i play carreer mode. I just didn\u0027t yet unlocked one of both. I have NOw though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why I love career mode, actually - \u0022How do I do that without these parts???\u0022\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2013-12-03T23:14:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022EtherDragon\u0022 data-cite=\u0022EtherDragon\u0022\u003E\u003Cdiv\u003EThat\u0027s why I love career mode, actually - \u0022How do I do that without these parts???\u0022\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s how I learned to do things without mainsail and nerva engines \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ETurns out it\u0027s pritty easy\u003C/p\u003E\n"},{"CreatedByName":"little square dot","CreatedById":42920,"CreatedDateTime":"2013-12-03T23:58:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Franklin\u0022 data-cite=\u0022Franklin\u0022\u003E\u003Cdiv\u003EIf he\u0027s done everything he\u0027s done so far \u003Cem\u003Ewithout\u003C/em\u003E the use of maneuver nodes I\u0027d be very much impressed. I\u0027m not an awful pilot, but I couldn\u0027t even consider approaching, orbiting, landing and returning from any body without planner nodes.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe only difference is more effiecient dV use and fewer orbits before encounters, but the mechanics are exactly the same.\u003C/p\u003E\n"}]}