{"TopicId":54553,"ForumId":16,"TopicTitle":"What should every space station and space base have?","CreatedByName":"jamgoth","CreatedById":93845,"CreatedDateTime":"2013-11-28T01:39:44Z","PageNum":1,"Articles":[{"CreatedByName":"jamgoth","CreatedById":93845,"CreatedDateTime":"2013-11-28T01:39:44Z","Content":"\n\u003Cp\u003EI\u0027m going to launch a new game called \u0022Kerbal Colonization Project,\u0022 which essentially means I\u0027m going to fill the world with a bunch of space stations and bases, but since I haven\u0027t done anything like this before I was wondering exactly what constitutes a space station/base?\u003C/p\u003E\u003Cp\u003EAlso, while I know how to dock, I\u0027m not sure how to get a permanent structure or a rover onto a planet or moon. What are some ways I can accomplish that?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T01:54:02Z\u0022 title=\u002211/28/2013 01:54  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by jamgoth\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-11-28T02:50:24Z","Content":"\n\u003Cp\u003ESomeplace for the Kerbals to live, Solar panels (Or RTGs) for power, maybe some lights, and that\u0027s about it.\u003C/p\u003E\u003Cp\u003EMy Mun base: (The one on the left is a science module(Not for actual science))\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dypqG0xh.png\u0022 alt=\u0022dypqG0xh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor more on how they got there here\u0027s the \u003Ca href=\u0022http://imgur.com/a/n72rJ\u0022 rel=\u0022external nofollow\u0022\u003Ealbum\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-11-28T02:56:20Z","Content":"\n\u003Cp\u003EA station is simply a ship without engines.\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2013-11-28T03:48:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jamgoth\u0022 data-cite=\u0022jamgoth\u0022\u003E\u003Cdiv\u003Ebut since I haven\u0027t done anything like this before I was wondering exactly what constitutes a space station/base?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EConcerning space stations I have just a single hint: \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Parts#Docking\u0022 rel=\u0022external nofollow\u0022\u003EDocking ports\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI keep my stations as modular as possible, because I don\u0027t know at the beginning what I will put into them.\u003C/p\u003E\u003Cp\u003EHere is my central station.\u003C/p\u003E\u003Cp\u003EAlone in the central axis there are 14 senior docking ports. Meaning that if I ever want to change anything, I can.\u003C/p\u003E\u003Cp\u003EAnd keep a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/56124?p=745601\u0026amp;viewfull=1#post745601\u0022 rel=\u0022external nofollow\u0022\u003Efew tugs\u003C/a\u003E there for maneuvering.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/csIjT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"tal2410","CreatedById":90189,"CreatedDateTime":"2013-11-28T14:16:37Z","Content":"\n\u003Cp\u003E@mhoram what are the white and light-green parts between the kethane converters and the lab module?\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-28T14:42:42Z","Content":"\n\u003Cp\u003EHere\u0027s how I landed my Duna Command Center. Stations should have docking ports and spare fuel, also a lander to carry Kerbals from orbit to the surface. A base is really just a place to hangout while on the surface, usually store Kerbals.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/XaAzmvp1BdE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-3.steampowered.com/ugc/1046252431431388176/A495C0FF657CDD65F8BC5D563C3C3B79DD41F916/\u0022 alt=\u0022A495C0FF657CDD65F8BC5D563C3C3B79DD41F916\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2013-11-28T14:59:55Z","Content":"\n\u003Cp\u003EEscape pods. You must have room for every kerbal that your station has room for, plus some more for redundancy. You must always have at least two escape pods per base/station. For base escape pods, they must be to return to Kerbin, WITHOUT docking in orbit, as that will make the process more complicated, and thus more likely to fail. You can use almost anything for escaping from a station around Kerbin, but you might need to add some more stuff to be able to escape from munar orbit station - unless you choose to just escape to a base on the mun.\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2013-11-28T15:00:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tal2410\u0022 data-cite=\u0022tal2410\u0022\u003E\u003Cdiv\u003E@mhoram what are the white and light-green parts between the kethane converters and the lab module?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThey are the \u00223D Printer\u0022 parts of the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/26482-0-21-OrbitalConstruction-Redux-4-2-%28Kethane-EL-Compatibility-Update%29\u0022 rel=\u0022external nofollow\u0022\u003EOrbital Construction Redux\u003C/a\u003E Mod, that works with Kethane.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-28T15:16:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jamgoth\u0022 data-cite=\u0022jamgoth\u0022\u003E\u003Cdiv\u003EI was wondering exactly what constitutes a space station/base?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnything you want. It all depends on the purpose you build it for. If it\u0027s a fuel depot, then you need fuel tanks and docking prots or other means of getting the fuel into other vehicles. If it\u0027s a Kethane refinery, then you need the parts for that. If it\u0027s a science platform, then you need science parts. If it\u0027s a place you want Kerbals to live, or to store them until another ship arrives, then you need housing units. So first is decide the purpose, then you know what parts.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAlso, while I know how to dock, I\u0027m not sure how to get a permanent structure or a rover onto a planet or moon. What are some ways I can accomplish that?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPermanent ground units and rovers are just landers only without the need to come home. No real trick there, especially with the permanent structures. Just build a big lander with enough fuel to land and that\u0027s that. Rovers can be a bit trickier, depending on how big they are. But in general, it\u0027s a good idea to have them land on legs to protect the tires and keep them from rolling down hills, then set down onto the tires after landing.\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2013-11-28T22:01:16Z","Content":"\n\u003Cp\u003EFrankly a station should have a specific focus and function. A gas station, a Kethane storage station, a research station, a low-orbit rescue hub. If you try to make a single station a catch-all unit, it\u0027s going to end up huge and unwieldy and not \u003Cem\u003Egreat\u003C/em\u003E at any one particular use.\u003C/p\u003E\u003Cp\u003EWord from the wise, though: use senior-sized docking ports wherever possible. They\u0027re far less flimsy than regular or junior-sized ones, and while their \u0027flex\u0027 isn\u0027t apparent with just two modules docked, once you get your base up to 6-12 modules all docked together at odd angles, you\u0027ll be begging for more stability.\u003C/p\u003E\u003Cp\u003Eedit: But I guess the definitive answer is: a tug. A little [typically] RCS-powered probe unit that you can couple/decouple from the station whenever you need it to go fetch and move around the modules and in-bound ships. It\u0027s really vital on stations that see a lot of attention or are too big to move on their own.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-28T22:08:36Z\u0022 title=\u002211/28/2013 10:08  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 28, 2013\u003C/time\u003E by Franklin\u003C/strong\u003E\n\u003C/span\u003E\n"}]}