{"TopicId":55070,"ForumId":16,"TopicTitle":"Maximized Docking","CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2013-12-03T13:59:45Z","PageNum":1,"Articles":[{"CreatedByName":"Lighthawk","CreatedById":93927,"CreatedDateTime":"2013-12-03T13:59:45Z","Content":"\n\u003Cp\u003EI\u0027m looking for ways to get the strongest possible connection while docking. I\u0027ve heard that the big ports are stronger than the small ones, but how much stronger? Should I use a big port, or go with four small on a quad adapter for maximum strength? Does the Kerbal Joint Reinforcement mod affect docking strength? Any other ways to prevent docking ports from causing a rapid, unplanned disassemble of my work?\u003C/p\u003E\n"},{"CreatedByName":"Saaur","CreatedById":4298,"CreatedDateTime":"2013-12-03T14:10:04Z","Content":"\n\u003Cp\u003EDocking ports will never \u003Cem\u003Ecause\u003C/em\u003E disassembly, but they may allow it. Or is this happening during launch? In that case, you should know that you don\u0027t need two docking ports during liftoff. Keep a docking port wherever you want one on the final orbital object, but the lifter doesn\u0027t need them.\u003C/p\u003E\n"},{"CreatedByName":"Smidge204","CreatedById":89677,"CreatedDateTime":"2013-12-03T17:19:37Z","Content":"\n\u003Cp\u003EDepends on what point the docking ports are breaking. If they break during launch then you can strut them up - the struts will break when decoupling but at that point you should be in spaaaaaace.\u003C/p\u003E\u003Cp\u003EIf you want stronger connections after orbital assembly, there aren\u0027t really any options. Multiple ports are a gamble at best. If you\u0027re allowing yourself to use mods, then Kerbal Attachment System lets you add struts while on EVA. Perhaps you just need to be more gentle with your craft?\u003C/p\u003E\u003Cp\u003E=Smidge=\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2013-12-03T20:52:53Z","Content":"\n\u003Cp\u003EPulling instead of pushing might be an option and less dV. Also there is a mod allowing to add normal struts (not quantum) out of the VAB.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-03T21:03:13Z","Content":"\n\u003Cp\u003EWhen your ship is under stress, docking rings failing is a relatlvely minor threat. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oCGhctH.png\u0022 alt=\u0022oCGhctH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Botched aerobraking attempt.) Nothing broke off of that ship until it hit the water. \u003C/p\u003E\u003Cp\u003EThere are two things you need to watch out for. 1) Rings are much weaker under compression than torque or tension. If the weight of the ship on the pad doesn\u0027t crush the docking rings, they will probably make it through any compression force flight may put on them. 2) If you have more than one pair of docking rings linking the same two parts, only one pair of rings is the official, full-strength link, and the other may part under stress, even if it still says it is docked on the right-click menu.\u003C/p\u003E\n"}]}