{"TopicId":55668,"ForumId":16,"TopicTitle":"RCS and multi-part craft.","CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-12-09T20:54:56Z","PageNum":1,"Articles":[{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-12-09T20:54:56Z","Content":"\n\u003Cp\u003EI have plans for multi-part ships, that may well require docking them as multiple parts.\u003C/p\u003E\u003Cp\u003EIf each individual ship in the docked-together chain has RCS blocks on it\u0027s center of mass, will that work as effectively as RCS blocks in the common center of mass?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-09T21:00:26Z\u0022 title=\u002212/09/2013 09:00  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 9, 2013\u003C/time\u003E by Skorpychan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2013-12-09T20:59:50Z","Content":"\n\u003Cp\u003Eyes.\u003C/p\u003E\u003Cp\u003EHow do you use ten characters to say that??\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-12-09T21:02:59Z","Content":"\n\u003Cp\u003EThank you.\u003C/p\u003E\u003Cp\u003ENow to go design this stuff.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-12-09T22:56:59Z","Content":"\n\u003Cp\u003EAs long as your ship is symmetrical and you have RCS balanced for each part, then the craft as a whole should have it\u0027s RCS balanced as well.\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2013-12-10T01:29:35Z","Content":"\n\u003Cp\u003EI\u0027m going to disagree. Having each part be individually balanced is probably a good starting point, but unless all the parts are the same mass, size, and RCS thrust, there will probably be imperfections in the RCS balance of the joined craft, and it\u0027s possible for the imbalance to be more than slight.\u003C/p\u003E\u003Cp\u003EAs an example, imagine a craft that is the size and mass of a Rockomax 200-16 fuel tank, and you\u0027ve got four RCS quads mounted around its center of mass. Dock this end-to-end to another craft the same and mass of a Rockomax 200-32 fuel tank, also with four RCS quads mounted around its center of mass. You\u0027ve now got two craft that individually are perfectly balanced but when docked, the center of mass and center of RCS thrust are no longer in the same place. The center of mass would be a meter towards the larger craft from the docking point, but the center of RCS thrust would be half a meter from the same point in the same direction.\u003C/p\u003E\u003Cp\u003ENow, if the larger craft had twice the RCS thrust of the lighter one, then the center of mass and center of RCS thrust would stay together as the craft is joined. However, it will get harder and harder to maintain this as you connect multiple parts all with different masses, as RCS thrust isn\u0027t very flexible.\u003C/p\u003E\u003Cp\u003EOn the other hand, if you turn on fine control (caps-lock), there\u0027s a very simple RCS balancer that kicks in that should help the craft be closer to balanced.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2013-12-10T15:13:59Z","Content":"\n\u003Cp\u003EAlso, while I have a thread up, does anyone know when the docking/rendezvous autopilots are unlocked on MechJeb?\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2013-12-10T15:23:03Z","Content":"\n\u003Cp\u003EHad to think about it, but Eric S is right. Thrust/Mass ratio being different on various segments will cause them to move at different speeds when RCS fires, causing rotation when attempting to translate the combined vessel. Then again, keep in mind that you should be docking via control of the smaller vessel anyway, and that it is usually not important for the more massive end result vehicle to be able to translate.\u003C/p\u003E\u003Cp\u003EWhen planning these combos and you need the result to be balanced, it\u0027s helpful to build the combined vessel in the VAB to simulate. Find the RCS balancer mod (a simple plugin), if you\u0027re interested, as it will give you a visual representation of the RCS balance right in the VAB. If you don\u0027t want to install a mod, you can use the cheat menu to disable gravity and test your combined vessel right off the launchpad for RCS balance.\u003C/p\u003E\u003Cp\u003EA final note: beware of what happens when fuel and RCS tanks lose mass as fuel is burned. Balance can easily go out the window when fuel is draining only from one end of the ship.\u003C/p\u003E\n"},{"CreatedByName":"3mon","CreatedById":83138,"CreatedDateTime":"2013-12-10T15:47:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Skorpychan\u0022 data-cite=\u0022Skorpychan\u0022\u003E\u003Cdiv\u003EAlso, while I have a thread up, does anyone know when the docking/rendezvous autopilots are unlocked on MechJeb?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you have to unlock the \u0022Advanced Unmanned Tech\u0022 node for that. Its Tier 8 and costs 550 science according to the wiki.\u003C/p\u003E\n"},{"CreatedByName":"kurja","CreatedById":66303,"CreatedDateTime":"2013-12-10T21:22:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JumpsterG\u0022 data-cite=\u0022JumpsterG\u0022\u003E\u003Cdiv\u003EHad to think about it, but Eric S is right. Thrust/Mass ratio being different on various segments will cause them to move at different speeds when RCS fires, causing rotation when attempting to translate the combined vessel. Then again, keep in mind that you should be docking via control of the smaller vessel anyway, and that it is usually not important for the more massive end result vehicle to be able to translate.\u003Cp\u003EWhen planning these combos and you need the result to be balanced, it\u0027s helpful to build the combined vessel in the VAB to simulate. Find the RCS balancer mod (a simple plugin), if you\u0027re interested, as it will give you a visual representation of the RCS balance right in the VAB. If you don\u0027t want to install a mod, you can use the cheat menu to disable gravity and test your combined vessel right off the launchpad for RCS balance.\u003C/p\u003E\u003Cp\u003EA final note: beware of what happens when fuel and RCS tanks lose mass as fuel is burned. Balance can easily go out the window when fuel is draining only from one end of the ship.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Edang, that\u0027s right.\u003C/p\u003E\u003Cp\u003Eso - answer is \u0022yes\u0022, if all part are of similar size.\u003C/p\u003E\u003Cp\u003Eisn\u0027t rcs thrust automagically balanced if you switch to fine control mode?\u003C/p\u003E\n"},{"CreatedByName":"Murph","CreatedById":90837,"CreatedDateTime":"2013-12-10T21:33:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kurja\u0022 data-cite=\u0022kurja\u0022\u003E\u003Cdiv\u003Eso - answer is \u0022yes\u0022, if all part are of similar size.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESize \u003Cstrong\u003Eand mass\u003C/strong\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kurja\u0022 data-cite=\u0022kurja\u0022\u003E\u003Cdiv\u003Eisn\u0027t rcs thrust automagically balanced if you switch to fine control mode?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not certain, but I find RCS control of with less than perfect balance to basically be ok with both SAS and fine-control active. If SAS isn\u0027t on, any imbalance in RCS thrust can quite easily add some rotational velocity, but SAS does a reasonable job of cancelling it out.\u003C/p\u003E\u003Cp\u003EOr, to put it another way, I don\u0027t put any real effort into balancing RCS, and seem to manage just fine. I do use the RCS balance visualisation mod, however, just not for balancing RCS, but to see the dry CoM.\u003C/p\u003E\n"}]}