{"TopicId":56011,"ForumId":16,"TopicTitle":"interplanetary transfers","CreatedByName":"Lar-E","CreatedById":78160,"CreatedDateTime":"2013-12-13T11:42:59Z","PageNum":1,"Articles":[{"CreatedByName":"Lar-E","CreatedById":78160,"CreatedDateTime":"2013-12-13T11:42:59Z","Content":"\n\u003Cp\u003EOK, I am going to reveal the depth of my ignorance here:\u003C/p\u003E\u003Cp\u003EWhen traveling between heavenly bodies (I\u0027m not using MechJeb or anything of the sort, just winging it), I generally get an encounter and coast into it. When I enter the planet\u0027s sphere of influence, my trajectory is usually something very close to a straight line; with a periapsis at midpoint and an escape at the far end.\u003C/p\u003E\u003Cp\u003EIs the proper course of action at this point to: (a) start a retrograde burn right away until one establishes orbit? (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E burn retro only until one has a decent periapsis; then adjust accordingly on the way up and out? © perform a radial burn to get a decent periapsis and use gravity/airbraking to achieve orbit or (d) something else?\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-12-13T11:58:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lar-E\u0022 data-cite=\u0022Lar-E\u0022\u003E\u003Cdiv\u003EOK, I am going to reveal the depth of my ignorance here:\u003Cp\u003EWhen traveling between heavenly bodies (I\u0027m not using MechJeb or anything of the sort, just winging it), I generally get an encounter and coast into it. When I enter the planet\u0027s sphere of influence, my trajectory is usually something very close to a straight line; with a periapsis at midpoint and an escape at the far end.\u003C/p\u003E\u003Cp\u003EIs the proper course of action at this point to: (a) start a retrograde burn right away until one establishes orbit? (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E burn retro only until one has a decent periapsis; then adjust accordingly on the way up and out? © perform a radial burn to get a decent periapsis and use gravity/airbraking to achieve orbit or (d) something else?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EB Thanks to the Oberth effect. The physics takes a bit of time to explain but it is cheapest to get your periapsis as low as you dare via small correction burns and then burn retrograde when you hit periapsis. It is cheapest to do those correction burns as far out as possible (before even entering the SOI) but it requires you to be more accurate and time warp tends to shuffle it up a bit. I tend to try and get the periapsis as close to 0 as possible right after my exit burn from Kerbin, again about halfway through the trip and then some fine adjustments as I enter the SOI.\u003C/p\u003E\n"},{"CreatedByName":"maltesh","CreatedById":17144,"CreatedDateTime":"2013-12-13T12:05:54Z","Content":"\n\u003Cp\u003Ea really, really useful thing to do is to open up the games settings.cfg file, and find the line that says\u003C/p\u003E\u003Cp\u003ECONIC_PATCH_DRAW_MODE = 3\u003C/p\u003E\u003Cp\u003EAnd change it to say\u003C/p\u003E\u003Cp\u003ECONIC_PATCH_DRAW_MODE = 0\u003C/p\u003E\u003Cp\u003EWhen you do this, instead of getting weird squiggly lines of dubious value when your future path passes through a world\u0027s SOI, the patch will be drawn in the frame of reference of the object (So it looks like a normal hyperbola) and at the current position of the object (So you can hit Tab a few times and center on it for a really close view.)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/4057920/Kerbal%20Space%20Program/v0.18/Screenshots/screenshot259.png\u0022 alt=\u0022screenshot259.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe result being that, weeks or months before you reach your destination, you can pop a maneuver node a few hours ahead of your ship, run your time accel up to 5x so things stop jumping around, center the map screen on your destination, and spend a few minutes finessing the maneuver node that will move your periapse and arrival trajectory close to where you want them, and spend maybe a 10-15 m/s of delta-V doing it.\u003C/p\u003E\u003Cp\u003EIt also makes it a hell of a lot easier to plot circularization nodes inside the SOI before you reach it, if that\u0027s something you want to do.\u003C/p\u003E\u003Cp\u003EIf you use Mechjeb, the Maneuver Node editor allows you to change CONIC_PATCH_DRAW_MODE in-game, and there are a couple other mods that do the same thing, but personally, I change it in the settings.cfg as soon as I install a new version, as I have no use for any other mode than Mode 0.\u003C/p\u003E\u003Cp\u003EIf you /have/ waited until you just crossed the SOI boundary, and your periapse is reasonably close to the planetary surface, Then the thing to do is to perform a Radial- burn to put your periapse where you want it to be, and do your aerobraking or engine braking there. If your periapse was reasonably close to the surface to begin with, in most cases where you\u0027ve just crossed the SOI boundary, the angular distance you have to move it will be small, and the cost of the burn will be low.\u003C/p\u003E\u003Cp\u003EBurning retrograde when near the SOI boundary on a hyperbolic trajectory to reduce periapse gets expensive quickly. It can be useful for fine-tuning a periapse altitude, but in most cases, should be avoided.\u003C/p\u003E\u003Cp\u003EAnd a retrograde burn to capture just after you cross the SOI boundary winds up being more expensive than that.\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2013-12-13T12:06:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ralathon\u0022 data-cite=\u0022Ralathon\u0022\u003E\u003Cdiv\u003EIt is cheapest to do those correction burns as far out as possible\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is exactly why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E is the wrong answer and c) is correct. You will always want to lower your periapsis by doing a radial burn, then when you get to periapsis, burn retrograde. The low periapsis maximizes the use of the Oberth effect, as you pointed out correctly.\u003C/p\u003E\n"},{"CreatedByName":"Ralathon","CreatedById":71537,"CreatedDateTime":"2013-12-13T14:06:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EWhich is exactly why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E is the wrong answer and c) is correct. You will always want to lower your periapsis by doing a radial burn, then when you get to periapsis, burn retrograde. The low periapsis maximizes the use of the Oberth effect, as you pointed out correctly.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI was considering C, but it also implies the use of gravity assists or aerocapture to slow down instead of burning at periapsis. While aerocapture certainly helps a lot it might give him the idea that lowering periapsis isn\u0027t important on airless worlds. So i thought B was the most correct answer given the options available since it had the correct procedure via the wrong method.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-13T14:16:59Z","Content":"\n\u003Cp\u003EDoing corrections before you enter the SOI to get decent periapsis is right. But if you fail to do that, the best approach is to put a maneuver to the periapsis you have, pull retrograde to circularize or to set whatever orbit you want to transfer lower, and execute that maneuver the standard way, i.e. start burning half the estimated burn time ahead.\u003C/p\u003E\u003Cp\u003EIt costs more dv to brake this way (than to brake at already low periapsis) because of Oberth effect, but in most cases that difference is not very significant.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-13T14:19:29Z\u0022 title=\u002212/13/2013 02:19  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 13, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-13T19:41:56Z","Content":"\n\u003Cp\u003EAdditional point: after oh so carefully setting your approach while still in interplanetary space, slow to 10x warp or less for the transition to the target\u0027s SOI to avoid that bug which throws your periapsis wildly out of position.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2013-12-13T19:51:40Z","Content":"\n\u003Cp\u003EThe easiest way to establish orbit is by burning east or west, in the case that will enable you to push your periapsis towards or away from the surface. This is ideal for aerobraking. In the case that there is no atmosphere (note aerobrake if you can, saves tons of dV) Then it is most efficient and neat to burn at periapsis.\u003C/p\u003E\n"}]}