{"TopicId":57413,"ForumId":16,"TopicTitle":"so there is a limit to how much sci a pod can take, but what is it?","CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-12-23T07:27:38Z","PageNum":1,"Articles":[{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-12-23T07:27:38Z","Content":"\n\u003Cp\u003ESorry if this is something that everyone already knows, I\u0027ve been a bit out of touch lately (lack of net) so I might have missed it being mentioned. I sort of assumed that there must be a limit to how many experiments you can store in a pod, but I\u0027ve not noticed it as a stat on the pods and having never hit a limit I\u0027d begun to think that maybe there wasn\u0027t. Turns out there is, but I\u0027m not sure exactly what the limit is.\u003C/p\u003E\u003Cp\u003EI just ran a rather manic mission to Mun with an orbital lab and many, many landings and ended up with 107 experiments stored in the lab. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/Xb9vJSX\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Xb9vJSXl.jpg\u0022 alt=\u0022Xb9vJSXl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhen I came to transfer all my lovely results to the homeward bound pod it gave me a (not entirely clear) message that they couldn\u0027t be collected on the pod, but didn\u0027t give a reason like when you try to store a duplicate experiment. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/QZw3H8P\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/QZw3H8Pl.jpg\u0022 alt=\u0022QZw3H8Pl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWhat I found was that if I boarded the pod most of the results got transferred but some where lost forever. So I reloaded and tried again, this time I hit cancel and it transferred what results it could and left Jeb outside the pod with 12 experiments that didn\u0027t want to transfer. So I was able to put those results back into the lab. In the end I transmitted those 12, but I guess I could also have sent a courier craft to pick them up. \u003C/p\u003E\u003Cp\u003EI also tried pruning the 12 least valuable results and tried to transfer the rest, but that didn\u0027t work, so it wasn\u0027t a cap on the total number. So I can only presume that there is a cap on the total data size that can be stored on a pod (which does make sense). But I don\u0027t know what that cap is (short of sitting there and adding up 90\u002B results\u0027 data sizes which I can\u0027t be bothered to do!).\u003C/p\u003E\u003Cp\u003EAnyone know what the exact cap is? I\u0027d presume that it should be different for different size pods and I guess the lab would also have a cap, but I didn\u0027t hit that on this mission. Anyone else run into storage limits during their missions.\u003C/p\u003E\u003Cp\u003EAnyway mission was a success although quite exhausting doing 15 landings and rendezvous in a row, I got 5485 points from it (3rd mission in this career), but I was 1400 short of completing the tech tree, darn it! Was hoping to unlock it in 3 missions.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-12-23T07:38:49Z","Content":"\n\u003Cp\u003EThere is no limit whatsoever to how much science a given pod can hold, at least at this point. I ran a Mun mission that tackled all 15 biomes for as many experiments as will work on the Mun, and came home with over 120 experiments in the command pod. You just can\u0027t store repeat experiments in the same pod. Incidentally, your science lander there looks a lot like the one I used!\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-12-23T07:47:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EThere is no limit whatsoever to how much science a given pod can hold, at least at this point. I ran a Mun mission that tackled all 15 biomes for as many experiments as will work on the Mun, and came home with over 120 experiments in the command pod. You just can\u0027t store repeat experiments in the same pod. Incidentally, your science lander there looks a lot like the one I used!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eah, that\u0027s interesting. You reckon the difference was because of repeat experiments, I guess that could be it. All results where stock piled in the lab first and that didn\u0027t complain about any thing being repeated. Can you store repeat results in the lab I wonder. \u003C/p\u003E\u003Cp\u003ESci lander snap, lols! There\u0027s a smaller unmanned one there too, which was used for sites I\u0027d already been to before on lower tech missions but I still needed the sensor data from them.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-12-23T07:52:17Z","Content":"\n\u003Cp\u003EThe lab has no compunctions about repeat experiments stored in it, for whatever reason. Probably so you can store multiple crew reports, since by default pods can only carry 1 of those (thank goodness they have 100% transmission efficiency!). Now I\u0027m interested to know what your mission tactic was for getting the tech tree done in 3 missions... My own profile looked like this:\u003C/p\u003E\u003Cp\u003EMission 1: Minmus \u002B Mun fly-by (~350 science; unlocked struts, fuel lines, science parts, photovoltaic panels)\u003C/p\u003E\u003Cp\u003EMission 2: Minmus biome exploitation (~2500 science; unlocked all the remaining science parts, docking ports, heavier rocketry, lighter command pods)\u003C/p\u003E\u003Cp\u003EMission 3: Mun biome exploitation (~9000 science; everything unlocked)\u003C/p\u003E\n"},{"CreatedByName":"Grover","CreatedById":11972,"CreatedDateTime":"2013-12-23T12:23:11Z","Content":"\n\u003Cp\u003Epods can hold as many science reports as you can gather, but absolutely no duplicates (not great for the experiments that only give 80% cap on return) but there is a \u003Ca href=\u0022http://kerbalspaceprogram.com/radial-experiment-storage-container/\u0022 rel=\u0022external nofollow\u0022\u003Esolution\u003C/a\u003E: just bolt a few of these on (one for each biome to take a set of duplicates that need them) to your lab and/or return craft and you\u0027re happy as Larry... Kerman \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-12-23T12:33:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EThe lab has no compunctions about repeat experiments stored in it, for whatever reason. Probably so you can store multiple crew reports, since by default pods can only carry 1 of those (thank goodness they have 100% transmission efficiency!). \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, if the lab can hold repeats then that\u0027s most likely what happened. I\u0027d assumed it wouldn\u0027t\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ENow I\u0027m interested to know what your mission tactic was for getting the tech tree done in 3 missions... My own profile looked like this:\u003C/p\u003E\u003Cp\u003EMission 1: Minmus \u002B Mun fly-by (~350 science; unlocked struts, fuel lines, science parts, photovoltaic panels)\u003C/p\u003E\u003Cp\u003EMission 2: Minmus biome exploitation (~2500 science; unlocked all the remaining science parts, docking ports, heavier rocketry, lighter command pods)\u003C/p\u003E\u003Cp\u003EMission 3: Mun biome exploitation (~9000 science; everything unlocked)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice 1! That\u0027s a good approach.\u003C/p\u003E\u003Cp\u003EI\u0027ve filmed my missions and after xmass I\u0027m planning to make a vid of it. Keeping the mission count low is part of my goal, but my primary goal is to do it in the fewest in game days. \u003C/p\u003E\u003Cp\u003EAnyway, approach was;\u003C/p\u003E\u003Cp\u003EM1; Minmus and Mun fly by (snap!) - 407 sci. \u003Ca href=\u0022http://i.imgur.com/bHDizU3.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eparts unlocked\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EM2; 9 manned landers launched as one craft deployed to Mun - 3080 sci. each lander had materials and goo but no sensors \u003Ca href=\u0022http://i.imgur.com/W0udzsz.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eparts unlocked\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe return from that mission was v cool, I posted a pic of it in awesome pics, \u003Ca href=\u0022http://i.imgur.com/l10fmrv.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ebut here it is again\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EM3; science lab to Mun to complete Mun study - 5847 sci. probe to get the sensor readings from the previous landing sites, manned lander to land in all other sites. probe just had the sensors, lander had full array. \u003Ca href=\u0022http://i.imgur.com/t2Evaj5.jpg\u0022 rel=\u0022external nofollow\u0022\u003Eparts unlocked\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI think your approach is better, I\u0027ve ended up 1400 short of completion after the third mission. I think going to Minmus on M2 makes more sense. In 0.22 I was able to get full unlock from just Mun, maybe I missed some data from there, Might go back to that mission and be more thorough. Or has the value of Mun gone down in 0.23?\u003C/p\u003E\u003Cp\u003EAnyway, congrats on your 3 mission unlock!\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-12-23T17:04:10Z","Content":"\n\u003Cp\u003EThe Mun does technically have enough science to unlock everything on its own, but you\u0027d have to get gravity scans from all of the \u0022high over\u0022 biome spaces as well as \u0022space near\u0022 and \u0022landed at\u0022. I think I might have spotted a slight error in your tactics, incidentally: you don\u0027t have to unlock all listed prerequisites for a lot of the tech nodes (ie. General Construction only requires General Rocketry or Stability, not both; same goes for the prereqs for Electrics and Fuel Lines). This is especially key in unlocking the Negative Gravioli Detector, since it would otherwise require an absurd amount of science to reach.\u003C/p\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2013-12-24T13:19:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EThe Mun does technically have enough science to unlock everything on its own, but you\u0027d have to get gravity scans from all of the \u0022high over\u0022 biome spaces as well as \u0022space near\u0022 and \u0022landed at\u0022. I think I might have spotted a slight error in your tactics, incidentally: you don\u0027t have to unlock all listed prerequisites for a lot of the tech nodes (ie. General Construction only requires General Rocketry or Stability, not both; same goes for the prereqs for Electrics and Fuel Lines). This is especially key in unlocking the Negative Gravioli Detector, since it would otherwise require an absurd amount of science to reach.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s what I missed, doh! Didn\u0027t do gravity scans in \u0027space near\u0027, got the landed and most of the high ones. I\u0027m going to redo that mission I think. What\u0027s the altitude you need to be at for space near? \u003C/p\u003E\u003Cp\u003EI did know about not needing all prerequisites, the reason I unlocked in the way I did after the first mission was I needed something\u0027s from each of the four preceding nodes to make my 9 manned lander craft and I decided not to go for any of the sensors on that mission as I\u0027d need to follow up with the other sensors anyway. \u003C/p\u003E\u003Cp\u003EHave u posted any of your craft from your 3 mission unlock? Would be interested to see your designs. I\u0027ll post mine once I\u0027ve done it and made a vid of it. But now I have to go and dock with a bottle of port, so I won\u0027t be much good at piloting anything other than a couch! Have a good Xmas SkyRender!\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2013-12-24T13:36:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Grover\u0022 data-cite=\u0022Grover\u0022\u003E\u003Cdiv\u003Epods can hold as many science reports as you can gather, but absolutely no duplicates (not great for the experiments that only give 80% cap on return) but there is a \u003Ca href=\u0022http://kerbalspaceprogram.com/radial-experiment-storage-container/\u0022 rel=\u0022external nofollow\u0022\u003Esolution\u003C/a\u003E: just bolt a few of these on (one for each biome to take a set of duplicates that need them) to your lab and/or return craft and you\u0027re happy as Larry... Kerman \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUse \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54998-FScience-Science-Data-Transfer-v0-1?p=865565\u0026amp;viewfull=1#post865565\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E too, and you only need one of the containers, actually you can move everything into a pod - crew reports might be different though.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2013-12-24T13:50:22Z","Content":"\n\u003Cp\u003EMy plan for Minmus is to visit all the biomes with equipment from my base, load as much as possible into a few manned pods, then send them to kerbin unmanned for recovery. It\u0027s a strange thought, landing pods full to the brim with samples. I guess they need to be sent back in something capable of safe reentry.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2013-12-25T02:04:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWhat\u0027s the altitude you need to be at for space near? \u003C/div\u003E\u003C/blockquote\u003EI believe it\u0027s \u0026lt;30,000m.\n"}]}