{"TopicId":58050,"ForumId":16,"TopicTitle":"Science Value not 100% upon retrieval","CreatedByName":"enzo1291","CreatedById":53138,"CreatedDateTime":"2013-12-28T21:00:41Z","PageNum":1,"Articles":[{"CreatedByName":"enzo1291","CreatedById":53138,"CreatedDateTime":"2013-12-28T21:00:41Z","Content":"\n\u003Cp\u003EI have been going to the mun lately for science research.\u003C/p\u003E\u003Cp\u003EA one man pod, all the science modules there are, and enough juice to get them out there and home again.\u003C/p\u003E\u003Cp\u003ENow i happened to notice that whenever they get back, some studies aren\u0027t a full 100%.\u003C/p\u003E\u003Cp\u003EThis, for example, happens with \u0022materials study\u0022.\u003C/p\u003E\u003Cp\u003EIs this due to the 0.23 update?\u003C/p\u003E\u003Cp\u003EI believed that upon return to kerbin, everything would be granted 100% scientific value.\u003C/p\u003E\u003Cp\u003EWhat am i missing and what should i do to get the full 100%?\u003C/p\u003E\n"},{"CreatedByName":"flightmaster","CreatedById":32617,"CreatedDateTime":"2013-12-28T21:42:10Z","Content":"\n\u003Cp\u003EI\u0027m not very good with science but is it because you\u0027ve run the experiments before? E.g., if you run 3 experiments of the same thing, it\u0027ll give you less and less science each time. This prevents people constantly just running to the Mun and back for infinite science. \u003C/p\u003E\u003Cp\u003EApart from that I\u0027m not really sure mate\u003C/p\u003E\n"},{"CreatedByName":"enzo1291","CreatedById":53138,"CreatedDateTime":"2013-12-28T22:57:54Z","Content":"\n\u003Cp\u003EThat was the case under 0.22, while sending science back by transmission.\u003C/p\u003E\u003Cp\u003EOn these missions, i go for the mun, land, do my science, take-off, land at kerbin and retrieve the vessel.\u003C/p\u003E\u003Cp\u003EFor a lot of experiments, this grants the full 100% science reward. \u003C/p\u003E\u003Cp\u003ESome just don\u0027t...\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2013-12-28T23:04:35Z","Content":"\n\u003Cp\u003ESome things just don\u0027t give 100% science on the first return. They give a much larger percentage than if you transmitted (and in the case of the materials bay and Goo can can be reused) but you have to repeat experiments multiple times to get all the science points\u003C/p\u003E\n"}]}