{"TopicId":58094,"ForumId":16,"TopicTitle":"Transferring to Moho","CreatedByName":"theoracle09","CreatedById":97436,"CreatedDateTime":"2013-12-29T03:34:22Z","PageNum":1,"Articles":[{"CreatedByName":"theoracle09","CreatedById":97436,"CreatedDateTime":"2013-12-29T03:34:22Z","Content":"\n\u003Cp\u003EHello all, been reading the forums for ages now and just decided I needed some help. I\u0027ve mainly followed tutorials on here and youtube, but can\u0027t seem to get transferring to Moho right. The ship is Apollo-esque, having a lander and drive stage docked together. The drive stage is powered by a single nuclear engine. I use Alexmoon\u0027s Launch Window Planner for all the angles and times. I seem to be on track until I go to burn normal or anti-normal to match planes...the burn is something like 29 minutes to get my ascending and descending nodes to 0*. Now, I finally get an encounter, I\u0027m stoked because I FINALLY have gotten caught by Moho, until I start pulling on the retrograde handle after entering the SoI. I\u0027m thinking it\u0027s a bug, because it wasn\u0027t circularizing...until I see my orbital velocity. Nope, not landing on Moho tonight, and I doubt I can get these guys back to Kerbin because I\u0027m lacking the skill. *sigh* Anyone have any pointers on transferring, or can someone point me in the direction of a video or something that helped them? Thanks.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/eVHeZ6b\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/eVHeZ6b\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-29T21:24:43Z\u0022 title=\u002212/29/2013 09:24  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 29, 2013\u003C/time\u003E by theoracle09\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Scorched","CreatedById":84320,"CreatedDateTime":"2013-12-29T04:38:31Z","Content":"\n\u003Cp\u003EWhoa. You are coming extremely fast. I would be surprised if you had the fuel to even get into an orbit and return to kerbin.\u003C/p\u003E\u003Cp\u003EIf you want to try and orbit anyways, I would have started to burn maybe 10-15 minutes before periapsis.\u003C/p\u003E\n"},{"CreatedByName":"codepants","CreatedById":74088,"CreatedDateTime":"2013-12-29T04:46:27Z","Content":"\n\u003Cp\u003EOperationDX is my go-to for tutorials, or just videos of doing awesome stuff really well. I know for sure he has at least two round trips to Moho on his Youtube channel.\u003C/p\u003E\u003Cp\u003EBut yea, like Scorched said, you\u0027re coming in fast for whatever reason. I don\u0027t know the mass of your ship but the last single nuke ship I sent to Moho had a 9 minute ascending burn.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2013-12-29T15:03:29Z","Content":"\n\u003Cp\u003EMoho is a stone-cold ***** to get to and return from; the low orbit means a very fast heliocentric velocity; it\u0027s got a small SOI, and the high inclination just means more dV is needed on top of everything else. I\u0027ve never landed a crew there but I\u0027ve been able to land a probe and orbit a crewed mission and return (but only by sending an unmanned tanker to refuel the expedition ship). It seems like I need about 1,400 m/s to get on the right general trajectory, a few hundred meters per second more to tweak the close-approach distance once I\u0027m out of Kerbin\u0027s SOI, and then as much as 3,700 m/s more to brake and enter orbit once I get there. And then a few thousand more m/s to get home again!\u003C/p\u003E\u003Cp\u003ESo here are some things to try: build bigger than you\u0027re used to. Nukes have great ISP but lousy thrust so cluster 3 or 4 of them radially around your transfer stage; add drop tanks that feed the core. You can drop them once they\u0027re empty to save the mass. If you\u0027re willing to take the time, stage an unmanned fuel tanker ahead of time; use that tanker as a practice run and source of fuel to help refuel for the run home. As soon as you\u0027ve left Kerbin\u0027s SOI, play around with maneuver nodes along your projected trajectory to tweak your approach. \u003C/p\u003E\u003Cp\u003EIt\u0027s hard but it can be done!\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-29T15:18:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theoracle09\u0022 data-cite=\u0022theoracle09\u0022\u003E\u003Cdiv\u003EI use Alexmoon\u0027s Launch Window Planner for all the angles and times.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn this case you apparently used it wrong. I would assume you did not specify the target orbit, so it gave you an approach optimized for reaching the system, but not optimized for braking in the system.\u003C/p\u003E\u003Cp\u003EWhen used normally, I am getting something like 3500 m/s insertion dv. It\u0027s still a lot, but it\u0027s way less than in your case. Or you did not set up your ejection parameters correctly. It took me a while to learn how to do it manually but since you\u0027re apparently using mods I\u0027d expect these to just accept numeric values?\u003C/p\u003E\u003Cp\u003EThere\u0027s also that option where you don\u0027t use the window planner at all. Instead, you launch at the point opposite to the Moho\u0027s periapsis, reduce your periapsis to match Moho\u0027s, then at that periapsis perform a correction (lower your apoapsis) to get a Moho intercept in an orbit or two. That\u0027s the way how to get to Moho with the least dv possible - even less than what the transfer planner will tell you. It takes a few orbits, though.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-29T15:23:41Z\u0022 title=\u002212/29/2013 03:23  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 29, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2013-12-29T15:58:53Z","Content":"\n\u003Cp\u003EMoho is the most difficult planet to get an accurate Hohmann transfer to because it just moves so damn fast and being just hours off the ideal time means that you will spend much more dV to get a successful orbit insertion than you planned. \u003C/p\u003E\u003Cp\u003EAll plugins and tools that calculate time to launch seem to give you a slightly different time to launch.\u003C/p\u003E\u003Cp\u003E The most accurate one I have seen yet is the Kerbal Alarm Clock\u0027s \u0027Model\u0027 method. I was able to land a probe on Moho today, and when I entered Moho\u0027s SOI, I needed around 2800 dV to circularize.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2013-12-29T16:03:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theoracle09\u0022 data-cite=\u0022theoracle09\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/eVHeZ6b.jpg\u0022 alt=\u0022eVHeZ6b.jpg\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFrom that picture you should have started your retro burn around 1hr 4s ago. And from your KER you don\u0027t have the fuel to do it anyway. You only have 3000m/s d/v left, you are going to need AT LEAST 7600m/s. \u003C/p\u003E\u003Cp\u003EMoho is one of the hardest planets to get to, because of its lower gravitational SOI, lack of atmosphere for aerobraking, and proximity to the sun or more importantly distance from Kerbin. \u003C/p\u003E\u003Cp\u003EYour best bet with that craft is to do a return burn to Kerbin, you probably have enough fuel for that. Then build a new craft and try again on the next launch window.\u003C/p\u003E\n"},{"CreatedByName":"theoracle09","CreatedById":97436,"CreatedDateTime":"2013-12-29T21:24:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Hodo\u0022 data-cite=\u0022Hodo\u0022\u003E\u003Cdiv\u003EFrom that picture you should have started your retro burn around 1hr 4s ago. And from your KER you don\u0027t have the fuel to do it anyway. You only have 3000m/s d/v left, you are going to need AT LEAST 7600m/s.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight as I entered Moho\u0027s SoI I set up the node to circularize, and realized it was impossible. I just came in way too fast. \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIn this case you apparently used it wrong. I would assume you did not specify the target orbit, so it gave you an approach optimized for reaching the system, but not optimized for braking in the system.\u003Cp\u003EWhen used normally, I am getting something like 3500 m/s insertion dv. It\u0027s still a lot, but it\u0027s way less than in your case. Or you did not set up your ejection parameters correctly. It took me a while to learn how to do it manually but since you\u0027re apparently using mods I\u0027d expect these to just accept numeric values?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m only using mods to show statistics, nothing to automate. I don\u0027t think it\u0027s an issue with me using the calculator, I\u0027m getting the same value for insertion dv as you are. I\u0027m using Kerbal Alarm Clock to manage the phase angle and PreciseNode to place my node at the correct ejection angle. \u003C/p\u003E\u003Cp\u003EI\u0027ll mess with building bigger, and do more reading. Thanks for the tips though, it got me thinking in the right direction I think. I\u0027ve also not read about engine clusters, and am starting to see this set up popping up.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-29T22:01:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022theoracle09\u0022 data-cite=\u0022theoracle09\u0022\u003E\u003Cdiv\u003EI\u0027ve also not read about engine clusters, and am starting to see this set up popping up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMore engines means more TWR and less delta-v. You don\u0027t need more engines for Moho. You need more efficient engines.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-12-30T02:51:38Z","Content":"\n\u003Cp\u003EThe topic of making a successful transfer to Moho was brought up not too terribly long ago, actually. Maccollo had the most useful piece of advice, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61478-Oh-bugger-Injection-burn-at-Moho?p=835667\u0026amp;viewfull=1#post835667\u0022 rel=\u0022external nofollow\u0022\u003Ea way to get to Moho for ~4,000 m/s of delta-V total\u003C/a\u003E. Helped me replace the Impactor instrument on my Moho ribbon with something a bit more honorable. Never did get an actual calendar date pinned down for that first transfer; still working on that. My own transfer wound up taking about ~8,000.\u003C/p\u003E\n"},{"CreatedByName":"theoracle09","CreatedById":97436,"CreatedDateTime":"2013-12-30T04:33:50Z","Content":"\n\u003Cp\u003Ecapi, that is perfect and is exactly what I was looking for! Thank you! Seemingly exactly on the same line as what you were saying, Kasuha, I just didn\u0027t fully grasp it until I saw pictures. Do\u0027h. Thanks again guys for the help.\u003C/p\u003E\n"},{"CreatedByName":"TheDarkStar","CreatedById":37056,"CreatedDateTime":"2013-12-30T04:42:38Z","Content":"\n\u003Cp\u003ELooking at that image, it looks like your problem might have been that you intercepted it from a retrograde orbit relative to Moho\u0027s, or you had to lower your orbit extremely close to Kerbol to get that intercept. To fix this, remember that lowering your periapsis below Moho\u0027s means that you have to undo that when decelerating around Moho. Once you get your inclination (and make sure it is 0, not \u002B/- 180) and periapsis correct, you really only want to lower your apoapsis; otherwise, you are mostly wasting fuel.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2013-12-30T04:59:59Z","Content":"\n\u003Cp\u003EMoho is hard to get to because of the braking delta-V required, not so much the transfer. If using Alex Moon\u0027s planner I can tell you from experience that you\u0027ll want roughly 6km/s delta-V for a one-way trip. That will cover pretty much every launch window it will give you plus corrections (you\u0027ll need them) and a safety margin (you\u0027ll want it). You can shave off some for the return by aerobraking at Kerbin (unless using DRE), but a 12km/s tug \u002B 20 ton lander is very much in the realm of possibility in KSP, especially if you use drop-tanks and dump the lander before returning. Either way, a two-way trip to Moho is not an easy undertaking.\u003C/p\u003E\u003Cp\u003EAlso, remember that when transfering to Moho you need to burn retrograde at Kerbin; if you\u0027re using PreciseNode you need to find your transfer angle when it\u0027s negative (which is the positive angle from retrograde.)\u003C/p\u003E\n"},{"CreatedByName":"Iansoreta","CreatedById":23122,"CreatedDateTime":"2014-04-28T22:35:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EMore engines means more TWR and less delta-v. You don\u0027t need more engines for Moho. You need more efficient engines.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s great, but I don\u0027t want to sacrifice TWR, so for bigger fuel tanks, it requires clustered LVN.\u003C/p\u003E\n"}]}