{"TopicId":59275,"ForumId":16,"TopicTitle":"Space Stations and CoM","CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-01-08T09:18:48Z","PageNum":1,"Articles":[{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-01-08T09:18:48Z","Content":"\n\u003Cp\u003EWhile building \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/22251-Showcase-SPACE-STATIONS%21-Post-your-pictures-here?p=895323\u0026amp;posted=1#post895323\u0022 rel=\u0022external nofollow\u0022\u003Emy station\u003C/a\u003E, I ran into a question. Namely, would a large mass (say, multiple orange tanks of fuel) unbalance a station in orbit?\u003C/p\u003E\u003Cp\u003EOn either side of the refueling boom there are two packs of 5 jumbo orange tanks. All told, they\u0027ll hold 320t of fuel. The station itself is a whole 154t (dry). If I fill the tanks to capacity (they\u0027re currently empty), might it cause my station to become unbalanced? Also, if I fill the tanks non-symmetrically (say, fill the left before the right), might that cause issue? And finally, would the standard Clamp-o-Trons attaching them to the boom handle the mass?\u003C/p\u003E\u003Cp\u003EI suspect there shouldn\u0027t be any problems, but I want to be sure before I load them up. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2014-01-08T09:27:51Z","Content":"\n\u003Cp\u003EMy opinion: no.\u003C/p\u003E\u003Cp\u003ECenter of Mass is only relevant when forces are acting on the object; the space station is station-ary (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E), therefore any changes in its center of mass are irrelevant.\u003C/p\u003E\u003Cp\u003ENow, if you needed to move or rotate the station, then the fuel tanks\u0027 position would be a problem...\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2014-01-08T11:15:09Z","Content":"\n\u003Cp\u003EYou\u0027ll be fine as long as you don\u0027t pilot the station while refueling it. After it\u0027s fueled, you might have issues trying to move it. As long as this is a stationary station that isn\u0027t going anywhere, there should be no problem. Everything looks symmetrical, when refueling it, try to refuel it symmetrically to avoid potential issues. The SAS systems may cause a Kraken issue otherwise.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-01-08T11:33:57Z","Content":"\n\u003Cp\u003EI suggest getting TAC fuel balancer to help with the symmetrical filling. You can dock your ship to the end of the boom to fuel your station, then using the fuel balancer set that tank to transfer out, thus filling all tanks on the station at the same time.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-08T11:38:28Z","Content":"\n\u003Cp\u003EYou don\u0027t need to worry about the station\u0027s balance as long as you\u0027re not going to apply thrust on it.\u003C/p\u003E\u003Cp\u003EWhat might happen, though, is that if your station is wobbly (big weights at ends of long weak levers) it may have all sorts of problems with resonance not only when you\u0027re trying to turn it around, but also just from weak phantom forces caused by inaccuracies in physics simulation.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-01-09T05:23:57Z","Content":"\n\u003Cp\u003EAs long as you don\u0027t move it, the layout of a station doesn\u0027t matter. This is an interplanetary ship docked to a station during construction. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HAest.png\u0022 alt=\u0022HAest.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt never so much as quivered.\u003C/p\u003E\n"}]}