{"TopicId":59284,"ForumId":16,"TopicTitle":"Bootlegger Reverse","CreatedByName":"Lar-E","CreatedById":78160,"CreatedDateTime":"2014-01-08T10:59:20Z","PageNum":1,"Articles":[{"CreatedByName":"Lar-E","CreatedById":78160,"CreatedDateTime":"2014-01-08T10:59:20Z","Content":"\n\u003Cp\u003ESo, after a successful Gilly landing, I find myself in a dilly of a pickle.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/3EykqpE\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/3EykqpE.png\u0022 alt=\u00223EykqpE.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe Ostrich I (white) is orbiting Eve clockwise. Bill in the returning rover is in an anti-clockwise orbit.\u003C/p\u003E\u003Cp\u003EWhat is the best/most fuel efficient way to get them both orbiting in the same direction so that they can dock?\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2014-01-08T11:07:34Z","Content":"\n\u003Cp\u003EYou would have to reverse the orbit of one of them so you\u0027re orbiting in the same direction. This is best done at AP. I would have the rover change orbit at AP and reverse since it\u0027s the furthest orbit. Other than that, you have a lot of maneuvers you\u0027ll have to do in order to get an intercept. Which ever one has the least mass and the most TWR, that\u0027s the one you should pilot to get the intercept. You\u0027ll also have to get your ship to match the same orbital shape as the rover in order to help matters.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-08T11:09:47Z","Content":"\n\u003Cp\u003EI\u0027d probably do it in these steps with the active ship in the picture:\u003C/p\u003E\u003Cp\u003E1/ (optional, but may improve dv) get to apoapsis and lower the periapsis all the way down just to Eve\u0027s atmosphere.\u003C/p\u003E\u003Cp\u003E2/ (optional, but may improve dv) get to periapsis and raise apoapsis all the way up to SOI boundary\u003C/p\u003E\u003Cp\u003E3/ get to apoapsis and (preferably in single maneuver):\u003C/p\u003E\u003Cp\u003E- switch orbit direction\u003C/p\u003E\u003Cp\u003E- raise the periapsis so the other ship\u0027s orbit is completely inside it and they touch in single point\u003C/p\u003E\u003Cp\u003E- set up inclination so the inclination marker is in the point where the two orbits touch\u003C/p\u003E\u003Cp\u003E4/ get to the point where the two orbits touch and burn retrograde to get a rendezvous the next orbit\u003C/p\u003E\u003Cp\u003EYou may start at step 1, step 2, or step 3, but if you start with step 1 then don\u0027t skip step 2.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-08T11:35:17Z\u0022 title=\u002201/08/2014 11:35  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 8, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"}]}