{"TopicId":59509,"ForumId":16,"TopicTitle":"Orbital period vs Peri/Apoapsis on Geostationary Satellite?","CreatedByName":"Exosphere","CreatedById":98328,"CreatedDateTime":"2014-01-10T06:53:44Z","PageNum":1,"Articles":[{"CreatedByName":"Exosphere","CreatedById":98328,"CreatedDateTime":"2014-01-10T06:53:44Z","Content":"\n\u003Cp\u003EWhile setting up my geostationary communications network, I noticed something interesting -- I set each satellite\u0027s final orbital period to 23 hours, 56 minutes, and 4 seconds exactly (yes, I know it isn\u0027t completely exact, but it\u0027s correct to within a second according to MechJeb), because I\u0027m using the Real Solar System mod. According to most websites I\u0027ve seen on the subject, a geostationary orbit has an altitude of 35,786 kilometers above the ground. However, even after fine-tuning all of my orbits so they were at the correct period to be geostationary, I noticed that neither my apoapsis nor my periapsis on any of my satellites was equal to 35,786 kilometers. My orbital period was right on target, my inclination was zero degrees, and my eccentricity was 0.000 (according to MechJeb), so it would seem like I was in about as good of a geostationary orbit as I could get, but my apo/periapsis was never on target. It would be close -- within a few kilometers (my periapsis would be a few kilometers lower, and my apoapsis would be a few kilometers higher), but not exact. So, is the figure I\u0027ve been seeing for a geostationary orbit (35,786 kilometers above ground level) an approximation? Was it an average between the periapsis and apoapsis of a standard geostationary satellite? Or am I doing something wrong?\u003C/p\u003E\n"},{"CreatedByName":"Roastduck","CreatedById":98490,"CreatedDateTime":"2014-01-10T07:00:17Z","Content":"\n\u003Cp\u003EGround level is not sea level. You might have just been over a mountain or something.\u003C/p\u003E\n"},{"CreatedByName":"DeMatt","CreatedById":90539,"CreatedDateTime":"2014-01-10T07:01:52Z","Content":"\n\u003Cp\u003EI think the \u0022it\u0027s THE average of apoapsis and periapsis\u0022 option is the easiest way of describing it to you. Try reading up on the definition of \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Semi-major_axis#Semi-major_axis\u0022 rel=\u0022external nofollow\u0022\u003Esemi-major axis\u003C/a\u003E and see if that helps.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-10T07:08:01Z\u0022 title=\u002201/10/2014 07:08  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 10, 2014\u003C/time\u003E by DeMatt\u003C/strong\u003E\n\u003Cbr\u003EThe KSPWiki\u0026#039;s better than Wikipedia, here.\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-01-10T07:27:55Z","Content":"\n\u003Cp\u003EOrbits are never perfect circles. The average between your peri and apoapsis is the radius of your orbit (kinda. It\u0027s actually a bit wonky because those are over sea level, not over the center of Kerbin).\u003C/p\u003E\u003Cp\u003EPlus, altitude doesn\u0027t matter. Period does. If you\u0027ve got the right period and low eccentricity (which you have) then they\u0027re stationary. The altitude you\u0027re at is a function of your orbit and not actually required to be any specific value.\u003C/p\u003E\n"},{"CreatedByName":"draeath","CreatedById":25709,"CreatedDateTime":"2014-01-10T07:33:52Z","Content":"\n\u003Cp\u003ESpin the ship around and watch the apsides flutter around. It\u0027s an odd interaction between \u003Ca href=\u0022http://docs.oracle.com/cd/E19957-01/806-3568/ncg_goldberg.html\u0022 rel=\u0022external nofollow\u0022\u003Efloating point imprecision\u003C/a\u003E and your vessel\u0027s center-of-mass.\u003C/p\u003E\n"},{"CreatedByName":"Exosphere","CreatedById":98328,"CreatedDateTime":"2014-01-10T07:59:35Z","Content":"\n\u003Cp\u003EWell, as long as they\u0027re stationary (or at least as stationary as they can be), that\u0027s fine by me. Just to get a feel for what other people are doing with comms relays -- would Molniya orbits or polar geosynchronous orbits be better for polar coverage? It would seem like Molniya orbits would require less dV to reach (as only one side of the orbit must be extended to a very high altitude), but that polar geosynchronous orbits get better coverage with the lowest number of satellites, as a single group of three satellites can cover 360 degrees, instead of one section of Kerbin. So it seems like both methods have advantages and disadvantages. I\u0027m pretty sure I\u0027m just going to go with a polar geosynchronous orbit, for a few reasons...\u003C/p\u003E\u003Cp\u003E1) My launcher has enough dV to get the satellites into polar geosynchronous orbits\u003C/p\u003E\u003Cp\u003E2) I can have the fewest number of launches (with Real Solar System and a launcher with a starting TWR of 1.13, getting into orbit takes \u003Cem\u003Eages\u003C/em\u003E!!!!\u003C/p\u003E\u003Cp\u003E3) With polar and equatorial geosynchronous orbits with a core of GNS satellites in GPS-style orbits, my Kerbin orbital map-thingie looks kinda like a gyroscope. Or an atom. Or some other science-y thing. So yeah... FOR SCIENCE! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"wmheric","CreatedById":101012,"CreatedDateTime":"2014-01-16T14:36:32Z","Content":"\n\u003Cp\u003EHi there,\u003C/p\u003E\u003Cp\u003EThis is indeed a very interesting question, and the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Keplers_laws_of_planetary_motion#Third_law\u0022 rel=\u0022external nofollow\u0022\u003EKepler\u0027s Third Law\u003C/a\u003E is your answer. I don\u0027t know about your science background, but to put it in simpler wording for the context here: the orbital period of an orbiting object depends solely on the semi-major axis of the orbit (which is the average of the periapsis and the apoapsis; notice that the \u003Cem\u003Ealtitude\u003C/em\u003E is displayed in-game instead). So, as long as the semi-major axis of the orbit of your satellite is equal to \u002235,786 km \u002B the radius of the planet\u0022, the orbital period will be the same as the rotation period of the planet, thus the term geo\u003Cstrong\u003Esynchronous\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003EAlthough the rotation periods are the same, the position of the satellite as seen from the ground will change over time in a day (a complete rotation of the planet), depending on the eccentricity and the inclination of the orbit. If you want the satellite to stay in an exact direction in the sky, thus the term geo\u003Cstrong\u003Estationary\u003C/strong\u003E, you have to put it in a \u003Cem\u003Ecircular\u003C/em\u003E orbit \u003Cem\u003Edirectly over the equator\u003C/em\u003E. There is one and only one (provided that it stays in the SOI...) such orbit -- \u003Cem\u003Ethe\u003C/em\u003E geostationary orbit.\u003C/p\u003E\u003Cp\u003EI would say that a Molniya orbit is more practical for communications than a synchronous orbit, because having a highly eccentric orbit allows the satellite to spend most of the time above the polar regions. If you already have a geostationary communication network, the time that the polar satellite spends near the equator seems \u0022wasted\u0022. Plus for a Molniya orbit you can bring less battery onboard because the duration of a solar eclipse is shorter as the satellite moves faster near the periapsis.\u003C/p\u003E\u003Cp\u003EFor surface scanning (like Kethane or MapSat) though, notice that the altitude matters, so you might want to consider deploying two separate groups of satellites, one in eccentric Molniya orbits for communication, one in low-Kerbin orbit for survey missions.\u003C/p\u003E\u003Cp\u003EHope it does more help than confusion \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"}]}