{"TopicId":59977,"ForumId":16,"TopicTitle":"I want sample transfer","CreatedByName":"Drethon","CreatedById":100831,"CreatedDateTime":"2014-01-14T20:59:47Z","PageNum":1,"Articles":[{"CreatedByName":"Drethon","CreatedById":100831,"CreatedDateTime":"2014-01-14T20:59:47Z","Content":"\n\u003Cp\u003EBeing my first post here I want to qualify I\u0027m not really posting just to gripe. I love this game and will keep playing regardless. That being said...\u003C/p\u003E\u003Cp\u003EAfter starting a couple careers to get a hang of this game, I decided I wanted to set up a science pipeline in Kerbin space. The idea being a refueling station over Kerbin and one over the Mun. The Mun station would have a lander and the Kerbin station would have a tug. Then the only launches from Kerbin would be a minimal personnel lifter and a tanker (combined if one didnt happen more than the other).\u003C/p\u003E\u003Cp\u003EBut then I realized how much science I would be losing because the lander can only transmit back results. Now there is plenty of science out there and maybe I should just shut up and do it my way but I just feel like it would be nice if the game better supported this style of gathering science. Maybe I\u0027m the only one.\u003C/p\u003E\u003Cp\u003EAnyway, Kerbal on!\u003C/p\u003E\n"},{"CreatedByName":"CalculusWarrior","CreatedById":58313,"CreatedDateTime":"2014-01-14T21:54:34Z","Content":"\n\u003Cp\u003EThat would have been true in 0.22, but 0.23 adds in plenty of new functionality to the science system. If you send a kerbal down with the Munar lander, when you get back to the station you can send them on EVA, right click all your science parts which took experiments down on the Mun\u0027s surface, and collect them all. Now you can have the kerbal carry these experiments into the space tug when it returns to Kerbin, then can transfer them again to a reentry vehicle, bringing all the science back safely to the planet Kerbin\u0027s surface.\u003C/p\u003E\n"},{"CreatedByName":"Sof","CreatedById":65663,"CreatedDateTime":"2014-01-14T21:58:48Z","Content":"\n\u003Cp\u003EErm, you can science transfer now. \u003C/p\u003E\u003Cp\u003EThe Kerbals need to do it manually AFAIK but you can now.\u003C/p\u003E\n"},{"CreatedByName":"Drethon","CreatedById":100831,"CreatedDateTime":"2014-01-14T22:44:24Z","Content":"\n\u003Cp\u003EHmm, I had not found this ability before (sticks up a sign that says \u0022I suck at searching forums\u0022). Perhaps I should do more release note reading. I will try this out.\u003C/p\u003E\n"}]}