{"TopicId":61553,"ForumId":16,"TopicTitle":"Spaceplane SSTO tips?","CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-01-30T02:32:26Z","PageNum":1,"Articles":[{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-01-30T02:32:26Z","Content":"\n\u003Cp\u003EI cant for the life of me get enough speed during 10k-22k flight. I am only able to 470 m/s. Somehow my prograde vector is too low compared to the plane\u0027s Angle of attack. My plane is basically a remade of Aeris. Please help me, I remembered flying to be easier...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/s/g9ie99faflzux1l/screenshot9.png\u0022 alt=\u0022screenshot9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropbox.com/s/wa3x5fuo73h8zt3/screenshot10.png\u0022 alt=\u0022screenshot10.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T02:48:23Z\u0022 title=\u002201/30/2014 02:48  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by m4rt14n\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T02:46:26Z","Content":"\n\u003Cp\u003EIn order of priority:\u003C/p\u003E\u003Cp\u003E1) Upgrade your basic jet engines to TurboJets.\u003C/p\u003E\u003Cp\u003E2) Add more wing area. Maybe about double what you have.\u003C/p\u003E\u003Cp\u003E3) Possibly add another ram intake for each engine. More is better, but three per engine should be enough.\u003C/p\u003E\u003Cp\u003EEDIT: On second look, you probably have enough inlets. The picture of the underside was dark and I didn\u0027t notice the scoops. Rams are better, but scoops work okay when you get going fast enough.\u003C/p\u003E\n"},{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-01-30T02:47:35Z","Content":"\n\u003Cp\u003ELOL nevermind... I just figured out I used the regular jet engine, instead of turbojet ones.... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T02:49:11Z","Content":"\n\u003Cp\u003EThere you go, glad you figured it out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-01-30T02:49:29Z","Content":"\n\u003Cp\u003EYea I dont really like having too many ram intakes, just make the plane looks really weird..\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T03:17:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022m4rt14n\u0022 data-cite=\u0022m4rt14n\u0022\u003E\u003Cdiv\u003EYea I dont really like having too many ram intakes, just make the plane looks really weird..\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI feel the same way. I usually aim for about three intakes per engine but it all depends.\u003C/p\u003E\u003Cp\u003EHere\u0027s one alternative to the \u0022bandaid\u0022 approach of plastering on intakes.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/uMABEpJ.jpg\u0022 alt=\u0022uMABEpJ.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"jedensuscg","CreatedById":76475,"CreatedDateTime":"2014-01-30T03:21:37Z","Content":"\n\u003Cp\u003EI am coming to the conslusion fast that if I want to build a usable and decent looking SSTO space plane, I am going to have to do away with my aversion to enabling clipping.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2014-01-30T03:25:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jedensuscg\u0022 data-cite=\u0022jedensuscg\u0022\u003E\u003Cdiv\u003EI am coming to the conslusion fast that if I want to build a usable and decent looking SSTO space plane, I am going to have to do away with my aversion to enabling clipping.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v338/sumpca/Kerbal%20Space%20Project/KSP_Arro_Flechette_zps07ba76f4.jpg\u0022 alt=\u0022KSP_Arro_Flechette_zps07ba76f4.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou don\u0027t \u003Cem\u003Ehave\u003C/em\u003E to; I make liberal use of the radial intakes to \u0022supercharge\u0022 the jets on my SSTOs and get good results that way without clipping.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T03:36:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022jedensuscg\u0022 data-cite=\u0022jedensuscg\u0022\u003E\u003Cdiv\u003EI am coming to the conslusion fast that if I want to build a usable and decent looking SSTO space plane, I am going to have to do away with my aversion to enabling clipping.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree with Anton. Also, my design above did NOT use Alt-F12 clipping. I don\u0027t frown upon using it, but it\u0027s not my style. I only use what the editor allows me to do.\u003C/p\u003E\u003Cp\u003EIn reality, an intakes are often partially inside the fuselage. Maybe not fully inside (like you can achieve with full clipping), but my radial intake stack isn\u0027t completely absurd in reality. Ironically, I don\u0027t actually use that intake stack anymore as I found it isn\u0027t necessary.\u003C/p\u003E\u003Cp\u003EEDIT: Here you go. I dug up an early design. I went for a minimalist approach. It was meant for crew swapping my poor kerbals from a space station, but it doesn\u0027t even dock. In any case, you can see how you don\u0027t need much RCS, doesn\u0027t F12 part clip, and it doesn\u0027t even use ram intakes. But it still got up to 100km orbit to swap kerbals.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YraYdGl.jpg\u0022 alt=\u0022YraYdGl.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd it\u0027s cousin.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/t85gbjL.jpg\u0022 alt=\u0022t85gbjL.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T04:17:53Z\u0022 title=\u002201/30/2014 04:17  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-30T13:06:46Z","Content":"\n\u003Cp\u003EClipping isn\u0027t necessary -\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/EYfpK\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThough it does help.\u003C/p\u003E\u003Cp\u003EBeen trying to use stacked intakes on the redesigned Auk II, BTW Claw. I\u0027m thinking I probably should\u0027ve left all the engines on it though the numbers said I had more thrust than I needed. Do have a particular way of assigning individual intakes to action groups? I\u0027ve been missing them here and there.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T13:15:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003EBeen trying to use stacked intakes on the redesigned Auk II, BTW Claw. I\u0027m thinking I probably should\u0027ve left all the engines on it though the numbers said I had more thrust than I needed. Do have a particular way of assigning individual intakes to action groups? I\u0027ve been missing them here and there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI use one engine per 12ish tons, which is less than the 15tons numerobis uses, but it\u0027s all in how you want to design. As for the intakes, sometimes the overlap causes difficulty selecting. If you zoom in enough sometimes that helps. I also find that viewing from close to head on helps out a little in selection. However, the way I tell that I actually got them all into the action group is simply counting them. If that doesn\u0027t work for you, you could add them to the action group as you build.\u003C/p\u003E\u003Cp\u003EGood luck\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-30T14:42:31Z","Content":"\n\u003Cp\u003EYeah, adding them to action groups as I went along was how I eventually worked it out. I was just seeing if there was another / a better option.\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-01-30T16:12:53Z","Content":"\n\u003Cp\u003EIf you build a stack and set the action groups for just that stack and save it as an assembly.. then every time you place the assembly they automatically go into the action groups.\u003C/p\u003E\u003Cp\u003EIf you end up placing a stack in symmetry then the action group list is still populated you just have to reset them. Kinda tedious still but you don\u0027t have to try and click them all on the model\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-01-30T17:03:16Z","Content":"\n\u003Cp\u003EPossibly off-topic and I don\u0027t want to hijack the thread but don\u0027t think this deserves its own either:\u003C/p\u003E\u003Cp\u003EI have several game days to wait for a transfer window and have been spending the time learning to fly spaceplanes instead of just warping. From a 100% failure rate I\u0027ve progressed to reliably being able to design, build and fly high and fast, orbit with just a rocket nudge, re-enter* and land-ish**. So here\u0027s the questions -\u003C/p\u003E\u003Cp\u003E* re-entry and transition back to flying, rather than falling, has been tricky because all my ram intakes line the front of the wings, giving the planes too much drag at the front. Solved by holding prograde until speed (and height) are \u003Cem\u003Ereally\u003C/em\u003E low, but what are your tips for intake placement - preferably without special clipping? (I am using 3 or maybe 4 per engine and, yes, I\u0027ve found about 1 engine per 12 - 15 tonnes)\u003C/p\u003E\u003Cp\u003E** landing-ish, erm ... probably only 1 in 5 is survivable at the moment ^^. Practice makes perfect and all that but I think I\u0027m probably using a bad approach plan - too low, too early. Instead of going off and reading a flight-sim manual, while you\u0027re here - what are your landing tips?\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T18:10:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cerberus738\u0022 data-cite=\u0022Cerberus738\u0022\u003E\u003Cdiv\u003EIf you build a stack and set the action groups for just that stack and save it as an assembly.. then every time you place the assembly they automatically go into the action groups.\u003Cp\u003EIf you end up placing a stack in symmetry then the action group list is still populated you just have to reset them. Kinda tedious still but you don\u0027t have to try and click them all on the model\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis doesn\u0027t always work because of some bugs in the symmetry mode. I find that sometimes a few of my mirrored parts do not actually tie to the action group. Especially if you move them around after setting up the action group.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-30T18:10:32Z","Content":"\n\u003Cp\u003E@Pecan - for a KSC landing, you want to put your periapsis on the next continent over - not the little peninsula on the same continent, but the next actual land mass - as close to the ground as you can manage. Open your intakes and come on in. Do not, however, attempt to activate your jets until you\u0027re below 400 m/s and or 10,000 m. When you do that, close your intakes and mind your vertical speed. Ideally when you get to the tarmac you want to be going no faster than about 10 m/s vertically. Bring your nose up to about 5 degrees above the horizon to flare out (make contact with the back wheels first). Throttle back on the approach too - 100 m/s is a pretty good surface speed for final.\u003C/p\u003E\u003Cp\u003EBeacons help too. Build you an automated rover or two and set them out on the runway,and give them the ability to drop probes. When you drop a probe, rename it as a base. Set one at the far end of the runway, at the near end, at 1 klick then at 5, 10, 15, 20, 25 and 30 klicks, keeping as close to a straight course as you can. Instant ILS - you can see how I used it in the Auk IV-A example I posted earlier on this thread; damn beacons were off and I still managed a near-perfect landing on the strip by using it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T18:12:57Z\u0022 title=\u002201/30/2014 06:12  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T18:17:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EPossibly off-topic and I don\u0027t want to hijack the thread but don\u0027t think this deserves its own either:\u003Cp\u003EI have several game days to wait for a transfer window and have been spending the time learning to fly spaceplanes instead of just warping. From a 100% failure rate I\u0027ve progressed to reliably being able to design, build and fly high and fast, orbit with just a rocket nudge, re-enter* and land-ish**. So here\u0027s the questions -\u003C/p\u003E\u003Cp\u003E* re-entry and transition back to flying, rather than falling, has been tricky because all my ram intakes line the front of the wings, giving the planes too much drag at the front. Solved by holding prograde until speed (and height) are \u003Cem\u003Ereally\u003C/em\u003E low, but what are your tips for intake placement - preferably without special clipping? (I am using 3 or maybe 4 per engine and, yes, I\u0027ve found about 1 engine per 12 - 15 tonnes)\u003C/p\u003E\u003Cp\u003E** landing-ish, erm ... probably only 1 in 5 is survivable at the moment ^^. Practice makes perfect and all that but I think I\u0027m probably using a bad approach plan - too low, too early. Instead of going off and reading a flight-sim manual, while you\u0027re here - what are your landing tips?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELots of questions here, and it\u0027s no problem to start your own thread. This one has wandered a bit from the original.\u003C/p\u003E\u003Cp\u003EAs for reentry, if you don\u0027t have enough wing or tail area it might flip around because of drag. It depends a lot on your design. A picture would help. I typically reenter at about 30-40 deg nose high for realism and to burn off speed.\u003C/p\u003E\u003Cp\u003ELanding takes some practice. Realize you do not have to land on the runway. You can practice on the grass next to the KSC complex. There are lots of techniques, but I try to come in a bit flat (3 degree descent) till getting close to the ground. Then flatten it out so you are almost flying level just above the ground and slowly reduce the throttle. Disable braking on your nosewheel (in the SPH) and turn on your brakes before you land or right after you touchdown. Sometimes turning off SAS at landing helps, and sometimes not.\u003C/p\u003E\u003Cp\u003EEDIT: Also don\u0027t forget to check your CoM in the SPH for your reentry and landing fuel weights. Remove the landing gear when you check as the landing gear causes the SPH CoM to lie to you.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-01-30T18:49:26Z","Content":"\n\u003Cp\u003EThank you both - I tend to do my deorbit so I come in East of the mountains, ~20km West of KSC so I have plenty of time to align heading. Horizontally, I\u0027m good *grin*, Bill got out and planted a flag at the start of the runway and I set that as target, knowing I have to land just after it. Usually I come in within a few degrees and can easily correct that by the time I\u0027m 5 - 10km out. Altitude is a different matter - I find I\u0027m having to fight a bit to lose height but that makes my sink rate something horrendous like -50m/s, which is too much to correct with flare (pun intended). Reducing that to a more reasonable -20m/s (so I can flare it down to \u0026lt;10m/s) my planes just float serenly over KSC and it\u0027s time for more circuits and bumps :-( Obviously, I need to get between these two - I\u0027m using about 5 different designs from 13 tonnes to 50-ish and generally landing them heavy because I\u0027m just taking them up, \u0027round and down for practice.\u003C/p\u003E\u003Cp\u003EGiven that all these designs fly quite nicely (as long as I don\u0027t try to recover them too high/fast), tend to go where I point them (\u002B5 degrees pitch \u002B throttle tweaks) and aligning heading is not a problem - what is your vertical approach like? Constant -3 degrees until flare? High then stoop (before flare)? Low and fast (coming in hot)? Altitudes and distances?\u003C/p\u003E\u003Cp\u003E[Or just ignore me - I need to get to know each plane individually and should stop wittering here and practice more, lol!]\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-01-30T19:19:27Z","Content":"\n\u003Cp\u003EI shoot for 100 meters altitude per kilometer from the end of the runway. Keeping yourself slow gives you time to adjust, generally 100-120 m/s or so is good; fast enough to prevent stalling, slow enough that you have time to make adjustments. \u003C/p\u003E\u003Cp\u003ERule of thumb - don\u0027t start in on the 100 meters per kilometer until after you\u0027re clear of the mountains. Those are maybe 40-50 kilometers or so west of KSC, of course, and you definitely don\u0027t want to be at 4000-5000 meters elevation at that point.\u003C/p\u003E\u003Cp\u003EIt does take practice, and it\u0027s like landing on the MÃƒÂ¼n successfully for the first time - one of those awesome milestone achievements.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-30T19:22:44Z\u0022 title=\u002201/30/2014 07:22  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 30, 2014\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-01-30T19:38:38Z","Content":"\n\u003Cp\u003EYep, thanks again. Since it\u0027s only 2 or 3 days since I couldn\u0027t get an existing spaceplane into orbit I\u0027m pretty happy to be taking my own designs there and more-or-less back. Landing consistently, instead of 1 in 5 - even if not always on the runway - is the final step but at least it\u0027s one I know I\u0027ll be able to do with practice.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-01-30T22:16:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EGiven that all these designs fly quite nicely (as long as I don\u0027t try to recover them too high/fast), tend to go where I point them (\u002B5 degrees pitch \u002B throttle tweaks) and aligning heading is not a problem - what is your vertical approach like? Constant -3 degrees until flare? High then stoop (before flare)? Low and fast (coming in hot)? Altitudes and distances?\u003Cp\u003E[Or just ignore me - I need to get to know each plane individually and should stop wittering here and practice more, lol!]\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tend to come in high. Something like 20km over the mountains also as I like to maintain a lot of altitude in case I make a mistake. However, I descent pretty steeply (10-15 degrees nose low) to capture that 3-5 degree approach path. I like to be set up 3-5 degrees about 5km out and I hold that until the flare. Because I don\u0027t use a joystick, I mostly control my descent rate by adjusting the throttle a little bit. This also helps control airplanes that like to get a little squirrely when making small adjustments. I try not to come in faster than 100 m/s, but that speed really depends a lot on the craft.\u003C/p\u003E\n"}]}