{"TopicId":61767,"ForumId":16,"TopicTitle":"How can i make engine suck fuel from whole craft, like rcs or ion engine?","CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-02-01T01:08:01Z","PageNum":1,"Articles":[{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-02-01T01:08:01Z","Content":"\n\u003Cp\u003EI attached some engines on orbit to my ship using KAS.\u003C/p\u003E\u003Cp\u003EBut they detect no fuel, right click shows \u0022flameout, oxidiser deprived\u0022. \u003C/p\u003E\u003Cp\u003EI guess that while engines are in vab, placing them directly below tank connects them to it.\u003C/p\u003E\u003Cp\u003EKAS seems to ommit that.\u003C/p\u003E\u003Cp\u003ESo, only thing i can think about is somehow making these engines into using fuel from whole craft, not only tank they are attached to, like ion engines or rcs.\u003C/p\u003E\u003Cp\u003EWhat have i edit/add to config file?\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-02-01T01:11:08Z","Content":"\n\u003Cp\u003EKasuha wrote a good long segment about the fuel flow logic in KSP. IIRC, it\u0027s over in tutorials somewhere. The short version is that KSP is very finicky with fuel flow already and adding KAS adds additional complications to an already overly complicated logic.\u003C/p\u003E\u003Cp\u003EMy first guess is that because they are still technically two ships, so no fuel transfer. Are you using the winches or pipes? I\u0027m no KAS expert but that might make a difference.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-02-01T01:17:34Z","Content":"\n\u003Cp\u003EI used radial attachment point from near future propulsion pack (fuel can flow through it) and attached engine on it.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/WINoUWL\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/WINoUWL\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo game treats main ship and attached parts using KAS as different vessels?\u003C/p\u003E\u003Cp\u003EWell, if i attach rcs thrusters they work ok.\u003C/p\u003E\u003Cp\u003EWell i might use try use some fuel lines.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2014-02-01T01:34:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EI used radial attachment point from near future propulsion pack (fuel can flow through it) and attached engine on it.\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/WINoUWL\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/WINoUWL\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo game treats main ship and attached parts using KAS as different vessels?\u003C/p\u003E\u003Cp\u003EWell, if i attach rcs thrusters they work ok.\u003C/p\u003E\u003Cp\u003EWell i might use try use some fuel lines.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERCS does not obey the same fuel rules as liquid fuel and oxidizer do. It can go anywhere. That\u0027s why that works. I\u0027d first suggest trying this again with the KAS pipes instead of winches. If that does not work, I cannot help you.\u003C/p\u003E\n"},{"CreatedByName":"PUNiSH3R","CreatedById":102377,"CreatedDateTime":"2014-02-01T01:50:37Z","Content":"\n\u003Cp\u003EIn my experience, KAS pipes with LFO are not what you\u0027d think they would be. They will allow you to do a resource transfer (right-click, alt right-click) when connected, but won\u0027t automatically pull fuel from tank to tank for a running engine. So, what I\u0027ve done is burn up all the fuel in the primary tank, shutdown the engines, resource transfer LFO from secondaries into primaries, restart engines. Monopropellant, Xenon and Kethane all pull automagically once they\u0027re piped together however. My example would be at my Kethane fuel farm on the Mun:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/jW4nVCS.png\u0022 alt=\u0022jW4nVCS.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EKethane flows freely through all three modules, and the driller module\u0027s converter unit will fill the appropriate silo tanks with both monopropellant and xenon without issue. However, they won\u0027t refine LFO into the Jumbo-64s at the top, pipe or not. So, there\u0027s a second converter at the top of the silos that just processes Kethane into LFO. BUT...It won\u0027t fill any LFO tanks except the central one. So, from there, it\u0027s manual resource transfer one tank at a time, until all five are full. Same thing when I send a ship in for refueling: hook up and resource transfer one tank at a time.\u003C/p\u003E\n"},{"CreatedByName":"BubbaWilkins","CreatedById":57993,"CreatedDateTime":"2014-02-01T01:59:01Z","Content":"\n\u003Cp\u003ESimple rule for KAS.\u003C/p\u003E\u003Cp\u003EIn order to transfer fuel using KAS, all fuel flow is backwards through components and fuel lines.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-02-01T03:39:24Z","Content":"\n\u003Cp\u003EDidnt worked using pipes ;/\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/IwrP9bX.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/IwrP9bX.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnd i was planning to have such a cool mission, send lander by shuttle to orbit, assembley it there because it final version is too vide for shuttle cargo bay, land on moon, return, put lnder in cargo bay and land shuttle on earth. Ah well.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sfGSIaQ.png\u0022 alt=\u0022sfGSIaQ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/C1dLoHb.png\u0022 alt=\u0022C1dLoHb.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-01T13:34:16Z","Content":"\n\u003Cp\u003EI find KAS is best suited to either putting things together on the surface, or docking to craft without a docking port. (using the radial winches and grappling hooks), though being able to carry the box around in space is awesome! whist building the drive section of my large interplanetary transfer vessel i had to add struts, so i would carry the box with me to where I needed it \u0022drop\u0022 it (which resulted in it floating nearby) and then pull whatever I needed out of it. \u003C/p\u003E\u003Cp\u003Enow, for what OP is trying to do, you might be able to use docking ports. Put one on your engine and the other on your fuel tank, then dock them in space (thats the tricky part), then use the KAS truts to reninforce the connection. \u003C/p\u003E\u003Cp\u003EAlternatively you could edit the config to allow the tiny radial engines to be grabbable so you can put them directly onto your tank, but then you migt have asymetric thrust (easily countered wit-h reaction wheels)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-01T13:36:45Z\u0022 title=\u002202/01/2014 01:36  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 1, 2014\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-02-01T15:02:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EAlternatively you could edit the config to allow the tiny radial engines to be grabbable so you can put them directly onto your tank, but then you migt have asymetric thrust (easily countered wit-h reaction wheels)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo you can add functional engines by KAS after all?\u003C/p\u003E\u003Cp\u003EMaybe i just have to make mine radial then?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-02-01T15:08:33Z","Content":"\n\u003Cp\u003EThe fuel flow/draw tutorial is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64362-Fuel-Flow-Rules-%280-23%29\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. I have no experience with KAS or other mods but from what I have seen KAS probably supports radial attachments and then I would assume standard rules should be applied on fuel drawing. The key question is what are properties of the part you\u0027re attaching there because if it\u0027s welded from multiple parts, it\u0027s possible it has lost its fuel crossfeed capability.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-01T16:00:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003ESo you can add functional engines by KAS after all?\u003Cp\u003EMaybe i just have to make mine radial then?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can, and I just used the Radial Engines as an example because they are small enough for a Kerbal to hold while not being ridiculous (you could theoretically add the LV-T 45 to the list, but that\u0027s a tad unrealistic) Keep in mind I have never tried adding engines like this, so it may not work, but I see no reason it shouldn\u0027t.\u003C/p\u003E\n"}]}