{"TopicId":63573,"ForumId":16,"TopicTitle":"Calculating dV for De-orbit","CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-18T08:40:57Z","PageNum":1,"Articles":[{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-18T08:40:57Z","Content":"\n\u003Cp\u003ESo, I have an interplanetary mission to Duna coming up and I need to know how much dV I need to perform what is essentially one half of a Hohmann Transfer. The basic mission plan is to haul a manned lander to Duna, land on the surface, and return. The only issue is I don\u0027t have a lot of RCS to perform the deorbit maneuver, and my engine will be covered with a heat shield, rendering it useless. The plan was to have a small fuel tank and engine on top of the lander to perform the deorbit, then jettison the dead weight once the maneuver is complete. \u003C/p\u003E\u003Cp\u003EI would like to know how to figure out the dV needed to perform the initial deorbit (Once I hit the atmosphere I will be decelerating with parachutes) so that I can use the smallest tank available so that I\u0027m not hauling a massive amount of what will essentially be dead weight.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-18T13:20:27Z\u0022 title=\u002202/18/2014 01:20  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 18, 2014\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-02-18T08:49:07Z","Content":"\n\u003Cp\u003EDeorbiting on your return to Kerbin? Or deorbiting to land on Duna?\u003C/p\u003E\u003Cp\u003EIn both cases: have you considered aerobraking from the transfer directly into the landing? Even if you have a lander that needs to decouple from the mothership, just decouple it after aerobraking but before the mothership circularizes. It will remain in an orbit in which it will return to the atmosphere again on the next loop.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-18T08:51:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EDeorbiting on your return to Kerbin? Or deorbiting to land on Duna?\u003Cp\u003EIn both cases: have you considered aerobraking from the transfer directly into the landing? Even if you have a lander that needs to decouple from the mothership, just decouple it after aerobraking but before the mothership circularizes. It will remain in an orbit in which it will return to the atmosphere again on the next loop.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpecifically Deorbiting to land on Duna, and I hadn\u0027t thought of that. Would save both weight and hassle. Thanks for the idea.\u003C/p\u003E\n"},{"CreatedByName":"m4rt14n","CreatedById":101179,"CreatedDateTime":"2014-02-18T11:28:31Z","Content":"\n\u003Cp\u003EAre you doing an appolo mission type undock land and dock back in?\u003C/p\u003E\u003Cp\u003EA nice trick is to aerobrake at duna. Check out ksp areobrake calculator(google it), to find the right periapsis to hit. Then you can just circularize at the desired apo.\u003C/p\u003E\u003Cp\u003EIf appolo style, right before you circularize, undock the lander and let it fall gradually. This saves dV to deorbit. Then you can use chutes(drogue and radials) to descent.\u003C/p\u003E\n"}]}