{"TopicId":64107,"ForumId":16,"TopicTitle":"Transmission oddity","CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2014-02-23T21:08:50Z","PageNum":1,"Articles":[{"CreatedByName":"Jodo42","CreatedById":68895,"CreatedDateTime":"2014-02-23T21:08:50Z","Content":"\n\u003Cp\u003EI\u0027m trying to transmit a surface sample, but I don\u0027t have enough electric charge to do it all at once. It sends 10 data, and I get 10 science from that. Then it pauses as I recharge, and starts sending it back 2 data at a time. The first time it does this it gives me 1.5 science, but the rest of the times it says I\u0027m getting 0.0.\u003C/p\u003E\u003Cp\u003EOther than giving it a more reliable source of electricity, is there any way to fix this? Is this intended? Am I getting science from it even though it says 0.0? Or should I just cancel transmission after the second packet is sent?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-02-23T22:35:41Z\u0022 title=\u002202/23/2014 10:35  PM\u0022 data-short=\u002210 yr\u0022\u003EFebruary 23, 2014\u003C/time\u003E by Jodo42\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-02-23T22:26:56Z","Content":"\n\u003Cp\u003EThere is not a way to fix it except by adding more batteries or bigger solar panels. It is intended behavior. You are still getting science even though it says 0.0\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-02-23T22:31:16Z","Content":"\n\u003Cp\u003EI\u0027d say especially more batteries ... more solar panels might give you better throughput, but it\u0027s probably easier to wait for recharge between transmissions than put up with broken-up transmissions.\u003C/p\u003E\u003Cp\u003EOh, and the 200 and 1k batteries are easy enough to attach to the Mk 1 command pod (200 right above and parachute doesn\u0027t seem to mind, 1k below and likely under a decoupler).\u003C/p\u003E\n"},{"CreatedByName":"Starstrider42","CreatedById":104043,"CreatedDateTime":"2014-02-24T00:11:29Z","Content":"\n\u003Cp\u003EThere\u0027s a trick you can use if you\u0027ve already designed your ship, though I think it might be a bug rather than intended behavior. Start your transmission, then turn on time warp. The rate of power generation will scale up, but the speed at which the antenna is transmitting won\u0027t. Unless you\u0027ve got way too few solar panels, going up to 5x or 10x should slow the transmission speed enough that your ship can keep up.\u003C/p\u003E\n"}]}