{"TopicId":64851,"ForumId":16,"TopicTitle":"Fuel Lift concepts","CreatedByName":"milosh","CreatedById":104352,"CreatedDateTime":"2014-03-04T09:49:35Z","PageNum":1,"Articles":[{"CreatedByName":"milosh","CreatedById":104352,"CreatedDateTime":"2014-03-04T09:49:35Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EI thought first to post this as a challenge, but as I\u0027m not able todo it myself yet, I rather post it in here. I\u0027m looking for a way to bring 5 orange tanks with an RCS tanks attached to each of them into an orbit above 600km efficiently - with stock parts only. My station has 10 designated fuel ports and I want to be able to completely refuel it with a maximum of 2 launches. So far I\u0027m able to bring 3 orange tanks up, with 5 I cannot get beyond 45km. I tried several setups with asparagus or (what I prefer) simple onion routing but it always ends the same way, around 40km I reach the final stage which has too low TWR for athmospheric flights. I feel like I\u0027m pretty close but after at least 5 different designes I still cannot escape Kerbals gravity.\u003C/p\u003E\u003Cp\u003ESo if you have a fuel lift that can bring 5 (or more) orange tanks into orbit, please post a pic and maybe write something about the concept behind like, stage 1 boosters, stage 2 asparagus, stage 5 space flight and so on. I\u0027m not looking for a craft file to use 1:1, only for some inspiration so I (and maybe others) can come up with something that actually works too.\u003C/p\u003E\u003Cp\u003Ehave fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-04T10:13:30Z\u0022 title=\u002203/04/2014 10:13  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 4, 2014\u003C/time\u003E by milosh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Highlad","CreatedById":64590,"CreatedDateTime":"2014-03-04T10:27:07Z","Content":"\n\u003Cp\u003EFive is quite a push, sometimes you just have to settle for more launches.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-04T10:31:19Z","Content":"\n\u003Cp\u003EAbout the best payload fraction you can get when getting things to orbit is 20%. That means efficient engines (no mainsails) and smart steering.\u003C/p\u003E\u003Cp\u003ETherefore you need at least four but likely more orange tanks of fuel to get one orange tank of fuel to orbit. If your machine can handle it, you can just build your lifters side by side and launch them all at once.\u003C/p\u003E\u003Cp\u003EHere\u0027s a flat one-orange-tank-to-orbit lifter of mine, you can perhaps stack them. But different design might probably be better.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ulpxH99.png\u0022 alt=\u0022ulpxH99.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-04T10:34:36Z\u0022 title=\u002203/04/2014 10:34  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 4, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"kelmv","CreatedById":90534,"CreatedDateTime":"2014-03-04T11:51:47Z","Content":"\n\u003Cp\u003EI don\u0027t see why 4 orange tanks would be that hard to lift. I believe 2 is fairly common, so I\u0027d imagine that the issue would revolve around not how hard is it to lift, but can your computer handle the partcount needed to do that.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-03-04T12:03:31Z","Content":"\n\u003Cp\u003ESo much easier to launch up one at a time with capability to return the booster and fuel can for reuse.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0x77eoW.jpg\u0022 alt=\u00220x77eoW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HfUTTmt.jpg\u0022 alt=\u0022HfUTTmt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd, if you don\u0027t wish to return them, one can even be sent to Mun as in this older design using some mods.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pg7ZOax.jpg\u0022 alt=\u0022pg7ZOax.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-03-04T12:05:44Z","Content":"\n\u003Cp\u003EThe lifter I used in my Jool lander project worked well even if it looks weird, it lifted 5 orange tanks into orbit but only 80 km. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/CMq56W8\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/CMq56W8.jpg\u0022 alt=\u0022CMq56W8.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KNJuX8n.png\u0022 alt=\u0022KNJuX8n.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/dahmU#3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/dahmU#3\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EReplacing the central mainsail with four LV-N might improve reach but will lower TWR, its an four stage asparagus with two sets of SRB, Drops the highest boosters first, then the other expanded and continues.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-03-04T12:48:22Z","Content":"\n\u003Cp\u003EYou\u0027re asking for a lot:\u003C/p\u003E\u003Cp\u003E5 orange tanks are quite massive (literally), weighing 180? tons. So that\u0027s quite a payload.\u003C/p\u003E\u003Cp\u003E600 Km is pretty high up. Considering you have a massive payload, that is going to require a lot of fuel.\u003C/p\u003E\u003Cp\u003EThe best thing to do would be to design the orange tanks so they can be docked together in orbit. I can get pictures, but I\u0027ll explain. Make a new ship with the root part NOT the orange tank. With the \u0022BZ-52 Radial Attachment Point\u0022, using 4x symmetry, make 4 sets of attachment points. Then place normal docking ports on the attachment points. The reason for the attachment points is so the outer tanks do not have to have docking ports on the outside (Otherwise you would have to risk skewing up the alignment changing the symmetry.) Dock and enjoy.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vC31qqN.jpg\u0022 alt=\u0022vC31qqN.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-04T12:52:52Z\u0022 title=\u002203/04/2014 12:52  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 4, 2014\u003C/time\u003E by Tank Buddy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"psyper","CreatedById":90641,"CreatedDateTime":"2014-03-04T13:01:35Z","Content":"\n\u003Cp\u003EI built a fuel station with 12 senior docking ports (3x4 radially) and then sent up 4 empty tanks in 3 trips - took an age. Then I sent an kethane miner, converter and fuel transporter and got the fuel needed from minmus - more work? probably, more hours of gameplay? most definitely, more fun? totally.\u003C/p\u003E\u003Cp\u003EI\u0027ll do some screenshots when I get home.\u003C/p\u003E\n"},{"CreatedByName":"Alpheratz","CreatedById":99633,"CreatedDateTime":"2014-03-04T15:44:18Z","Content":"\n\u003Cp\u003EOk, I don\u0027t have access to the launcher data, but I can get this in a 400km orbit, which is 5 1/2 tanks:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/osFSUo0.png\u0022 alt=\u0022osFSUo0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe launcher is made out of a simple asparagus staged rocket with 24 boosters. Boosters are made out of 2 orange tanks \u002B a mainsail. Asparagus is designed so that 2 symmetric boosters are jettisoned at a time. Yeah, this means lots of staging! And you must add lots and lots of well placed struts, especially X between adjacent boosters. Here is an image of a smaller version of the rocket:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nebBeMn.png\u0022 alt=\u0022nebBeMn.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd expect some lagg...\u003C/p\u003E\n"},{"CreatedByName":"milosh","CreatedById":104352,"CreatedDateTime":"2014-03-04T18:48:18Z","Content":"\n\u003Cp\u003EWow lots of different ideas \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Alpheratz I think that your design comes closest to what I\u0027m trying to build. \u003C/p\u003E\u003Cp\u003EBut first, now that I\u0027m at home I can post a pic of the payload I\u0027m trying to get into orbit, 216t:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zNRNKTF.jpg\u0022 alt=\u0022zNRNKTF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt turns out that the old saying \u0022just add more\u0022 does help indeed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E After looking at what you guys came up with I did some thinking and went back to my first design that was able to reach 45km. I just added another stage and guess what, I finally could escape Kerbins gravity. I raised my apo to 400km then I\u0027ve killed the flight, because I\u0027ve only reached 68km with the final lifter stage, then I had to turn on the poodles of the payload. I would still end up with 9/10 of each tank full I think but I want to get to 600km without the need of a single drop of fuel from the payload. \u003C/p\u003E\u003Cp\u003EAnyways, this 1300t beast seems to do the job, just some finetuning needed (don\u0027t mind the left over holding port, I\u0027ve fixed that already):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nruvYxy.jpg\u0022 alt=\u0022nruvYxy.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEvery stage consists of four engines with two orange tanks that are fuel linked to the tanks of the next stage (onion, not asparagus). It might be enough to asparagus the second stage as it has enough left-over TWR or I just add another stage \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut I probably wont be able to improve it today as I\u0027m going to watch now Gravity in 3D with my wife \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2014-03-04T18:52:57Z","Content":"\n\u003Cp\u003EMy interplanetary transport/refueling stations have a 7 orange tank version that can get to 75km, which should be enough to get 5 tanks with RCS to 600km. Just be warned, it\u0027s 1114 parts on the ground so get ready for some slow launches.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58885-Interplanetary-Transport-Refueling-Station-X0-%2846t%29-X3-%28176t%29-and-X6-%28308t%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/58885-Interplanetary-Transport-Refueling-Station-X0-%2846t%29-X3-%28176t%29-and-X6-%28308t%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-04T19:27:49Z","Content":"\n\u003Cp\u003EThat\u0027s an awful lot of monopropellant, are you sure you will need it all? My whole Jool-5 mission was alright with just one such container and it even deorbited the tug with quite a few monopropellant still in it.\u003C/p\u003E\n"},{"CreatedByName":"psyper","CreatedById":90641,"CreatedDateTime":"2014-03-04T19:52:28Z","Content":"\n\u003Cp\u003EMy fuel depot in low kerbin orbit. Its got auto-fuel transfer set up so as soon as I dock it starts draining equal amounts of fuel from all the tanks inc monoprop. I sent it up with empty tanks and then filled them up from a kethane mine on minmus.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/xzGFY\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"milosh","CreatedById":104352,"CreatedDateTime":"2014-03-04T20:26:22Z","Content":"\n\u003Cp\u003Ethat\u0027s a nice concept you have there psyper even if it doesn\u0027t quite solve my problem. I haven\u0027t played around with kethane mining as I\u0027m still pretty new to Kerbal but I might use this technique for my next station.\u003C/p\u003E\u003Cp\u003EHow do you setup auto-fuel transfer, can you do that without any mods? Manually refueling can get quite annoying with several tanks, a way to automate it would help alot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jart","CreatedById":101732,"CreatedDateTime":"2014-03-04T22:53:16Z","Content":"\n\u003Cp\u003ECertainly not my original idea but the importance of getting the fuel tanks up that are full is way overrated . If you are really going to be using a fuel station then you are going to be around it a lot. Get the tanks up there empty is fine and very easy. Dump all your excess fuel into it from missions returning to Kerbin. Never come down with fuel. You spent too much getting every last drop up there.\u003C/p\u003E\u003Cp\u003EAn example with t-800...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/QZhAHIh.png\u0022 alt=\u0022QZhAHIh.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESame principle to be done with orange tanks ( I do not have them yet). If you really need to get them filled for a particular purpose, make an easy lifter to get one or two full tanks up which can be repeated with ease and very quickly with very little real life game time invested. For me, anyways, getting a lot of full tanks up was wasted playing time in the long run.\u003C/p\u003E\n"},{"CreatedByName":"Greenspan","CreatedById":101644,"CreatedDateTime":"2014-03-04T23:31:58Z","Content":"\n\u003Cp\u003ESuggest you see my topic:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69854-Launching-Multiple-Orange-Tanks\u0022 rel=\u0022external nofollow\u0022\u003ELaunching Multiple Orange Tanks\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI asked pretty much the exact same question, there was a lot of good feedback from the community. This is what I resulted with:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/G2LprUm.jpg?1\u0022 alt=\u0022G2LprUm.jpg?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt aint pretty but it works! Gets 5 Orange to Orbit along with 4x FL-T800 4xNERVAs and 4x LVT-30s, plus misc torque/docking/monoprop. I generally just try to get to 100km, but it should be easy to add a little more fuel and get up to 600km.\u003C/p\u003E\n"},{"CreatedByName":"milosh","CreatedById":104352,"CreatedDateTime":"2014-03-05T00:23:47Z","Content":"\n\u003Cp\u003EYes I did it!!! As I said, just add more \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E It\u0027s quite a straightforward design, layer after layer is peeled away until the final stage takes it to orbit, onion\u0027s the way to go \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the 1773t monster sitting on the launch pad:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LEhZrjp.jpg\u0022 alt=\u0022LEhZrjp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst stage gone:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GZE9suW.jpg\u0022 alt=\u0022GZE9suW.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOne stage later:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/YVWcTHE.jpg\u0022 alt=\u0022YVWcTHE.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EUp up you go:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ODHUeJi.jpg\u0022 alt=\u0022ODHUeJi.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ELast lifter stage:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/S7iO9uk.jpg\u0022 alt=\u0022S7iO9uk.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was still missing 22 DeltaV for a 0.0001 ecc orbit so I took some drops from the payload:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/k8Kdajn.jpg\u0022 alt=\u0022k8Kdajn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut honestly, who cares - had the wind blown in a different directions I\u0027d have had maybe those 22 Dv left \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll post some pictures tomorrow of the complete station, need to go to bed now...\u003C/p\u003E\u003Cp\u003EThanks again for sharing your work and providing lots of inspiration. There\u0027s another thread asking if KSP is deserving it\u0027s hype - I say, damn sure yes, fantastic community and the grin on my face when reaching 600 wont vanish that quickly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E[EDIT]: just realized my final inclination is quite a bit off, it should\u0027ve been 0.015 - so there are my 22 Dv \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-05T00:26:35Z\u0022 title=\u002203/05/2014 12:26  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 5, 2014\u003C/time\u003E by milosh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Greenspan","CreatedById":101644,"CreatedDateTime":"2014-03-05T07:50:54Z","Content":"\n\u003Cp\u003ECongrats! Just strap some SRB\u0027s or Jet Engines on the side, that should make up for the 22 m/s and then some.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-03-05T13:38:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EAbout the best payload fraction you can get when getting things to orbit is 20%. \u003Ca href=\u0022http://i.imgur.com/ulpxH99.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/ulpxH99.png\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWise words. Realistically, unless you are among the elite, the likes of Manley or Kasuha here, you need to bargain on about 12.5% mass fraction. And that is to low orbit.\u003C/p\u003E\u003Cp\u003EYou want 600Km, and an accurate intercept? Throw away another 20% of efficiency.\u003C/p\u003E\u003Cp\u003ESo your 5-orange goal will need about 50-orange at ground launch. or 25 each, for 2 launches.\u003C/p\u003E\u003Cp\u003ECan be done. I advise struts. Lots of struts. And dry ice.\u003C/p\u003E\u003Cp\u003EThe ice is to keep your CPU from meltdown. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI will post my \u0022solution\u0022 later today, assuming i manage it. But as I\u0027ve managed to put 72 half-oranges in LKO in one launch, it should be doable .\u003C/p\u003E\u003Cp\u003EP.S.\u003C/p\u003E\u003Cp\u003EWould you mind if the design uses half-oranges, instead or orange tanks? oranges are more delicate than double-stacked halves.\u003C/p\u003E\n"},{"CreatedByName":"milosh","CreatedById":104352,"CreatedDateTime":"2014-03-05T15:11:47Z","Content":"\n\u003Cp\u003EMarvin as you can see from two posts above I have already a working modell that can reach 600km with \u0022only\u0022 44 orange tanks if I counted correctly (41 orange tanks \u002B the grey ones which add up to 3 orange tanks). I used 4 struts per tank though I\u0027m not sure if I\u0027d really need them all, I just wanted to be sure \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs some have suggested different techniques for my \u0022problem\u0022, like kethan mining or putting empty tanks into orbit I need to clarify maybe what I intend to do with them. Which is not per se refueling my SSTOs or similar but to populate the system. I want to put a station around every planet and the Kerbin station is the launching port for it. So next I\u0027ll fly up a small station, get one or two orange tanks from my Kerbin station and then continue to Eve or Duna. Then most of these tanks go to Duna and I continue on to the next planet like wise. That\u0027s why I need (want) to bring as many tanks with as little launches to my station. Once I\u0027ve done that I will think about optimizing my stations by kethane mining or similar, but I\u0027m still new to KSP and want to progress with baby steps \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThat\u0027s not to say you should stop posting your ideas, please do so, I\u0027m always happy to learn new things or get inspired. When I started this thread I thought this to be a common problem that all veterans here have solved already, which, given the responsens in this thread, is not the case, there is no \u0022golden\u0022 way. But for now I will stick to my design, I\u0027ve put to much thinking and try-and-error-ing into it to just go with a completely different approach. I\u0027m now in the tweaking phase but the basic concept I came up with under the shower, works \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-05T17:52:14Z\u0022 title=\u002203/05/2014 05:52  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 5, 2014\u003C/time\u003E by milosh\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-03-08T02:45:47Z","Content":"\n\u003Cp\u003EOne SAS ring, One mono prop tank, Five full orange fuel cans. 1452 ton launcher with onion staging and 21 Mainsail Engines.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UgECGod.jpg\u0022 alt=\u0022UgECGod.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFive full fuel cans in orbit with core engine and fuel enough to push to higher orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JspCvuz.jpg\u0022 alt=\u0022JspCvuz.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-03-08T04:29:09Z","Content":"\n\u003Cp\u003EIf that is meant to dock to something then decouple the last Mainsail, might you be better off to put the probe in the stack under the decoupler? This might allow you to deorbit that last can, too, depending on fuel remaining.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-03-08T12:07:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryxal\u0022 data-cite=\u0022Kryxal\u0022\u003E\u003Cdiv\u003EIf that is meant to dock to something then decouple the last Mainsail, might you be better off to put the probe in the stack under the decoupler? This might allow you to deorbit that last can, too, depending on fuel remaining.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis was a concept design to see if it could be done without building an overly complex launcher. It has a Sr docking collar and thruster set for docking the five full fuel cans. The thruster fuel, if not used excessively during docking, can deorbit the empty five fuel cans. \u003C/p\u003E\u003Cp\u003EThere is room to add the controller to the booster below for deorbiting back to Kerbal as was done in this single can rocket.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HfUTTmt.jpg\u0022 alt=\u0022HfUTTmt.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/PKejhIq.jpg\u0022 alt=\u0022PKejhIq.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VLYGITg.jpg\u0022 alt=\u0022VLYGITg.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2014-03-08T12:30:03Z","Content":"\n\u003Cp\u003EI would suggest being a little more thoughtful with the engines you use. Just slapping more fuel and more Mainsails on your rocket might work, but it certainly isn\u0027t very realistic or efficient. Once you\u0027re lifting truly massive payloads, a single Mainsail on your core stage simply doesn\u0027t have enough thrust. Additionally, the Mainsail is a very inefficient engine and you\u0027re firing the one on the core for the entire duration of the flight.\u003C/p\u003E\u003Cp\u003EMy recommendation is to look into engine clustering on your core stage. A cluster of 8 LV-T30s with 4 LV-T45s in the middle gives you 70% more thrust than a Mainsail with a specific impulse of 370s instead of a measly 330.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-03-08T13:23:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MockKnizzle\u0022 data-cite=\u0022MockKnizzle\u0022\u003E\u003Cdiv\u003EI would suggest being a little more thoughtful with the engines you use. Just slapping more fuel and more Mainsails on your rocket might work, but it certainly isn\u0027t very realistic or efficient. Once you\u0027re lifting truly massive payloads, a single Mainsail on your core stage simply doesn\u0027t have enough thrust. Additionally, the Mainsail is a very inefficient engine and you\u0027re firing the one on the core for the entire duration of the flight.\u003Cp\u003EMy recommendation is to look into engine clustering on your core stage. A cluster of 8 LV-T30s with 4 LV-T45s in the middle gives you 70% more thrust than a Mainsail with a specific impulse of 370s instead of a measly 330.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere was a cluster of four orange tanks and mainsails onion staged to that single one. Those got the payload to apogee with fuel left for 2/3rds of the final insertion burn. The single mainsail finished the job. Actually, five LV-T45 would be enough for the core as any more would interfere with staging.\u003C/p\u003E\u003Cp\u003EThe Novapunch and KWRocketry gives a much better performance level overall without creating frame rate killing additions of all the engine clusters. This 110 tons to orbit example shows that better efficiency even with SRBs\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1Bsfv67.jpg\u0022 alt=\u00221Bsfv67.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cxeADtM.jpg\u0022 alt=\u0022cxeADtM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyhow, it was a first effort to see if it could be done. I did this in stages. First was the test of the core and four boosters onion stage. Then, the second ring to a suborbital test to work out the bugs in bracing and fuel line placement. Finally, the outer ring to push this into orbit and having to fix issues with lost braces and boosters falling off on the pad. Final fix to brace the decoupler under the payload which broke during the insertion to orbit burn. Once done, a good launch to orbit.\u003C/p\u003E\u003Cp\u003EWant to talk about inefficient, check some of the other designs being used to place the same payload into orbit. In most, there is way too much fuel being thrown into lifting the payload into orbit with the results of launchers being way too big and inefficient.\u003C/p\u003E\u003Cp\u003ELast night\u0027s flight, at 1,452 tons during launch, placed 216 tons into 100\u002BK orbit. That is a ratio of 6.7 to 1. If aimed at the payload of 185 tons to a 100k orbit, I am sure that this ratio can be brought down to six to one or less.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-08T13:38:06Z\u0022 title=\u002203/08/2014 01:38  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 8, 2014\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"}]}