{"TopicId":65093,"ForumId":16,"TopicTitle":"Optimization","CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-03-07T09:00:42Z","PageNum":1,"Articles":[{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-03-07T09:00:42Z","Content":"\n\u003Cp\u003EHello all, I am currently playing KSP on a bog standard Toshiba satellite laptop, I can\u0027t quite remember the model number but it only has 4GB of RAM, and a poor 1.8 dual core CPU and onboard graphics, The specifics elude me at the moment, partly due to shame, and partly due to me being at work and unable to check. But basically it falls just below the minimum requirements of KSP. Now it runs the game admirably on low settings and slogs on like a little trooper at between 30 and 20 FPS during normal single ship missions. Problem comes when I try running more than 150 or so parts on a ship, or when I\u0027m docking two ships in orbit. Typically when docking my frame rate can drop as low as 2-10 FPS and when I launch a large complex rocket my craft occasionally just disintegrates at around 15km. Also when handling large rockets the game occasionally crashes to desktop when I try jumping in and out of the VAB (probably due to my little laptop cooking its CPU or lack of memory) \u003C/p\u003E\u003Cp\u003ENow I\u0027ve like to be able to perform big interplanetary surveys and whatnot, but I\u0027m aware that this probably lies outside of the realms of possible with my hardware. What I would like to know is whether there is any means of improving the optimization and performance through a MOD or any other means to try and squeeze more power out of my sorry excuse for a laptop (sorry laptop) while I have reasonable computer skills I\u0027m not as knowledgeable as I would like to be so any suggestions, even simple pointers might help \u003C/p\u003E\u003Cp\u003ERight now I\u0027m playing the vanilla game on almost minimum settings, but I recently installed Mechjeb just to try it (although I don\u0027t need it to succeed) and I have Scansat installed which I keep meaning to remove.\u003C/p\u003E\u003Cp\u003EI\u0027m aware that future updates might improve optimization but they also might end up adding more memory demanding features too so in the long run I will need a more up to date machine. \u003C/p\u003E\u003Cp\u003EAny advise would be greatly appreciated and could vastly improve my enjoyment of KSP \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-07T09:04:18Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59005-0-23-Release-2-15-Active-Texture-Management-Save-RAM-without-reduction-packs%21?highlight=Active\u002BTexture\u002BReduction\u0022 rel=\u0022external nofollow\u0022\u003EThis mod should help.\u003C/a\u003E As will the\u003Ca href=\u0022http://kerbalspaceprogram.com/shrinkalater-0-21-1a-stock/\u0022 rel=\u0022external nofollow\u0022\u003E Squad Texture Redux\u003C/a\u003E your parts will look crappy, but your performance will go up.\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-07T09:19:51Z","Content":"\n\u003Cp\u003EYou only need memory footprint reduction mods if you\u0027re having problems with memory, e.g. if your problem is swapping memory blocks to the swap file. Stock game does not use more than about 2 GB of RAM (beside memory leaks which will be hopefully fixed in future releases) and that should fit into the 4 GB you have.\u003C/p\u003E\u003Cp\u003EDisintegration of your ship at 15 km is probably caused by too much stress on the construction - as your fuel tanks become emptier, engines are applying more force on connections above them.\u003C/p\u003E\u003Cp\u003EJust make sure your maximum physics time step is not set to too high value in settings. Low FPS is a problem, but as long as the physics is applied in sufficiently small steps on your ships, they should behave normally (i.e. not spontaneously break) although you\u0027re watching them in slow motion.\u003C/p\u003E\n"},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2014-03-07T10:07:44Z","Content":"\n\u003Cp\u003EThe crash to desktop when moving in and out of VAB (or when handling very large sub-assemblies within the VAB) is definately a RAM issue, and one I saw myself on my 2Gig lappy. The texture reduction fix posted by Taki117 should help with that.\u003C/p\u003E\u003Cp\u003EOtherwise Kasuha is right in that the stock game cannot pull more than a certain amount of RAM (though I personally always thought it was 3.5G). It\u0027s worth taking a look at your background processes through the task manager (assuming Win) to see what else might be idling away your Memory. A surprising amount can disappear this way, I always forgot to axe chrome when gaming and browsers are pretty heavy footprint-wise.\u003C/p\u003E\u003Cp\u003EHaving SCANSat installed and not using it will be tying up a bit of RAM, though not too much, and MechJeb will be also negligible impact. Mods demand RAM mainly as the game starts, and the amount they suck depends pretty much entirely on the number of parts they add to the game (alongwith the size of the textures for those parts). This means MechJeb has a tiny footprint with just a couple of small parts, SCANSat also adds smallish parts, though a few more than MechJeb. Neither is particularly heavy, stay well away from packs like KW Rocketry/KSPInterstellar/NovaPunch, as each adds dozens of big parts.\u003C/p\u003E\u003Cp\u003EYour best hope to increase playability is going to be the texture reduction mods.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-07T10:16:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022celem\u0022 data-cite=\u0022celem\u0022\u003E\u003Cdiv\u003EOtherwise Kasuha is right in that the stock game cannot pull more than a certain amount of RAM (though I personally always thought it was 3.5G).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe game cannot use more than 3.5 GB of memory, whatever mods you have installed. Except on Linux. It\u0027s because the game is 32-bit application and that is in turn because Windows release of Unity is unstable in 64 bits.\u003C/p\u003E\u003Cp\u003EBut the stock unmodded game usually uses way less than this limit. Especially if your machine limits you in other ways (low resolution of textures, low part counts etc).\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-03-07T10:58:39Z","Content":"\n\u003Cp\u003EThanks guys I\u0027m sure these will help, I also read somewhere else in the forum that I can edit the Settings.cfg file to reduce ocean load distances and subdivisions which may help a little more. I will also kill some background processes while playing, disconnect my internet and turn off my anti virus then boosting KSP to an above normal processor priority in task man \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: is there any good part welding mods for 0.23 you can recommend, and what\u0027s the pros and cons of using them?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-07T11:00:50Z\u0022 title=\u002203/07/2014 11:00  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 7, 2014\u003C/time\u003E by FREEFALL1984\u003C/strong\u003E\n\u003C/span\u003E\n"}]}