{"TopicId":65115,"ForumId":16,"TopicTitle":"Living areas","CreatedByName":"Macko939","CreatedById":104789,"CreatedDateTime":"2014-03-07T18:17:11Z","PageNum":1,"Articles":[{"CreatedByName":"Macko939","CreatedById":104789,"CreatedDateTime":"2014-03-07T18:17:11Z","Content":"\n\u003Cp\u003EHello\u003C/p\u003E\u003Cp\u003EAm I missing something or I don\u0027t have all parts in my game? It is full steam version, I didn\u0027t pirate it. \u003C/p\u003E\u003Cp\u003EI am looking for items that I\u0027ve seen in Scott Manley\u0027s videos when he built a ISS replica, but I can\u0027t find the part where the crew can live.\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2014-03-07T18:34:18Z","Content":"\n\u003Cp\u003EI haven\u0027t seen the particular video (and am at work, so don\u0027t have time to search for and view it), so I don\u0027t know if he was using mod parts. (If that\u0027s the case, check out the spaceport or this forum\u0027s mod release subforum for all kinds of good stuff).\u003C/p\u003E\u003Cp\u003EIf it\u0027s the standard 4-kerbal Hitchhiker module you are looking for, it\u0027s located in the utility category by default rather than the Pods category (it cannot be used to control a ship). There\u0027s also the 2-kerbal science lab now in the game, which is a bit bigger and looks pretty cool also, tucked into the science category.\u003C/p\u003E\u003Cp\u003EAlso take note that you have to unlock the parts in career mode through the research building, in case that wasn\u0027t obvious. Sandbox gives access to everything right away.\u003C/p\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2014-03-07T18:34:34Z","Content":"\n\u003Cp\u003EScott uses a lot of mods. Currently, the only stock part in KSP that allows for \u0022Living Quarters\u0022 is the Hitchhiker part.\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003ENinja\u0027d!\u003C/p\u003E\n"},{"CreatedByName":"KvickFlygarn87","CreatedById":76314,"CreatedDateTime":"2014-03-07T18:38:29Z","Content":"\n\u003Cp\u003EMods. You have no mods.\u003C/p\u003E\u003Cp\u003EDouble ninjas.\u003C/p\u003E\n"},{"CreatedByName":"Macko939","CreatedById":104789,"CreatedDateTime":"2014-03-07T18:46:50Z","Content":"\n\u003Cp\u003EAh makes sense, I think that one stock thing should be enough tho, at least for the start. \u003C/p\u003E\u003Cp\u003EAnd 1 more thing, what part do I use to connect things to my station? I have the core with hubs, but don\u0027t know what is the \u0022Male\u0022 part\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-07T18:49:15Z","Content":"\n\u003Cp\u003EThere is no male and female, just about any part can connect to any other part.\u003C/p\u003E\n"},{"CreatedByName":"Greenfire32","CreatedById":36705,"CreatedDateTime":"2014-03-07T18:50:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Macko939\u0022 data-cite=\u0022Macko939\u0022\u003E\u003Cdiv\u003EAh makes sense, I think that one stock thing should be enough tho, at least for the start. \u003Cp\u003EAnd 1 more thing, what part do I use to connect things to my station? I have the core with hubs, but don\u0027t know what is the \u0022Male\u0022 part\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDocking ports. There aren\u0027t really a male to female set of parts you need. Just make sure you use the same size docking port or you won\u0027t have compatible parts. Also, the space station hub \u003Cstrong\u003Edoes not\u003C/strong\u003E have its own docking ports. You have to add them.\u003C/p\u003E\u003Cp\u003ESo many times I\u0027ve gotten into orbit only to realize this...\u003C/p\u003E\u003Cp\u003EEdit: Ninja\u0027d \u003Cstrong\u003Eagain\u003C/strong\u003E!\u003C/p\u003E\n"}]}