{"TopicId":65816,"ForumId":16,"TopicTitle":"Gauging height to the ground (relative to docks and parts on your vehicle).","CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-03-15T00:32:42Z","PageNum":1,"Articles":[{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-03-15T00:32:42Z","Content":"\n\u003Cp\u003EI\u0027ve always wanted to build big elaborate bases like I\u0027ve seen others do on the forum and on Google Images. Big crazy projects with as much thought put into the aesthetic as on the functionality of all the parts. One thing always blocks me completely... determining how high the object will be relative to the ground, or relative to the created surface it\u0027s standing on (in case it wants to stand on a nice big platform you\u0027ve built).\u003C/p\u003E\u003Cp\u003ETake this thing for example. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/VdEDNAi.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/VdEDNAi.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/Wda49N4.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/Wda49N4.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI want to build a deployable hanger for use in future bases. A nice little shelter to protect my vehicles and my rovers from imaginary bad weather. Also I can cover the roof with solar panels and use it as a re-charging station for my rovers. But right away you can see my problem, how high do I make that docking port. It has to be exactly the same height as it will be on the rovers or they won\u0027t \u0022snap\u0022 together.\u003C/p\u003E\u003Cp\u003EI\u0027ve been running into the same problem with another project where I want to create a \u0022wagon train\u0022 base, with lots of cars connected to one another. I was thinking of putting a kethane mining assembly on it and going off into the munar wilderness, travelling from one deposit to the next. But the only way for that to work is if all of my cars are essentially identical, because if there\u0027s any variation in height, again... the docks won\u0027t line up and click. \u003Ca href=\u0022http://i.imgur.com/t30YrWL.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/t30YrWL.png\u003C/a\u003E It does work, but it kind of limits the possible diversity I would be able to put into the train. And I can\u0027t change any of the configuration in the future or the height changes and the cars aren\u0027t compatible with one another anymore.\u003C/p\u003E\u003Cp\u003EIs there some way to determine the height-to-ground while still in the assembly hangar? Or a mod someone might have made? The only other way I can imagine it could work is with trial-and-error, and that means I might have to create full-scale replicas on Kerbin for any base I want to put on Duna or on the Mun if they want to use that kind of docking.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-22T18:29:15Z\u0022 title=\u002203/22/2014 06:29  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 22, 2014\u003C/time\u003E by PTNLemay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TimePeriod","CreatedById":74336,"CreatedDateTime":"2014-03-15T01:05:49Z","Content":"\n\u003Cp\u003ENot sure if we could hand a kerbal a laser rangefinder without having half the damn population of kerbals go blind.\u003C/p\u003E\u003Cp\u003EMy best advice would be go with a default hight set by a certain number of parts. Like a set of wheels and a specific fuel tank.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-03-15T01:11:09Z","Content":"\n\u003Cp\u003EThe problem with your train is that the different parts have different weight, and thus the heavier ones are pulled down further than the lighter ones.\u003C/p\u003E\u003Cp\u003EAnd on different worlds with different gravity, this difference is... different.\u003C/p\u003E\u003Cp\u003EOn Minmus, there\u0027d probably be no difference, as the suspention of the wheels can keep them all at max height, even the heaviest ones, but on Kerbal there\u0027d be a difference due to difference in weight\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-03-16T20:15:42Z","Content":"\n\u003Cp\u003E@ TimePeriod\u003C/p\u003E\u003Cp\u003EI can do that, but that means anything that will be compatible will be limited to a very specific set of parts, hence the train I ended up with made up of cars that all look identical. It\u0027s probably the solution I\u0027ll go with for lack of anything better, I just find it surprising that I\u0027m the only one really bothered by this.\u003C/p\u003E\u003Cp\u003E@ Sirrobert\u003C/p\u003E\u003Cp\u003EOh I\u0027m not too worried about that, the variations in gravity should affect different structures similarly if they\u0027re all on the same world, plus the gravity sag is very minor. I should be able to wiggle them in one way or another. The problem is really getting the structures and docks to line up in the first place.\u003C/p\u003E\n"},{"CreatedByName":"khearn","CreatedById":48405,"CreatedDateTime":"2014-03-16T20:40:15Z","Content":"\n\u003Cp\u003EYou can put your docking ports on adjustable rails from \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/37707-0-23-Techtree-Magic-Smoke-Industries-Parts-Infernal-Robotics-0-12-%281-30-2014%29?highlight=infernal\u002Brobotics\u0022 rel=\u0022external nofollow\u0022\u003EInfernal Robotics\u003C/a\u003E so you can move them up and down to get them to align, even if they aren\u0027t perfect.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-03-16T21:13:59Z","Content":"\n\u003Cp\u003EWith the train, I suggest you take inspiration from real trains. Use a common chassis, but add different stuff on it. Eyeball the weights, and move fluids around to compensate, but you can use identical chassis-es for things and still have variation. You just need the bottom and ends to be the same.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-03-16T21:18:34Z","Content":"\n\u003Cp\u003EThat\u0027s sort of a neat idea ... ballast tanks for rovers!\u003C/p\u003E\u003Cp\u003EYou know, that might actually benefit rovers so they can shift their CoM and be better able to accelerate or decelerate.\u003C/p\u003E\n"},{"CreatedByName":"WhiteWeasel","CreatedById":59171,"CreatedDateTime":"2014-03-16T21:45:58Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/48876-The-art-of-modular-base-building\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/48876-The-art-of-modular-base-building\u003C/a\u003E\n"},{"CreatedByName":"MKI","CreatedById":77241,"CreatedDateTime":"2014-03-17T01:24:24Z","Content":"\n\u003Cp\u003EWhitewessel\u0027s link is what you should follow, it is what I used to build my bases.\u003C/p\u003E\u003Cp\u003EMostly its hit or miss and a lot of testing near the launch pad. Good luck!\u003C/p\u003E\n"},{"CreatedByName":"PUNiSH3R","CreatedById":102377,"CreatedDateTime":"2014-03-17T02:34:27Z","Content":"\n\u003Cp\u003ETemstar\u0027s tutorial is where i started too, however I put a IR twist on it as khearn mentioned above:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ogPxI\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-03-22T18:28:58Z","Content":"\n\u003Cp\u003E@ Whitewessel\u003C/p\u003E\u003Cp\u003EHuh... that does indeed look like exactly what I need. Quite thorough.\u003C/p\u003E\u003Cp\u003EThanks a lot, I\u0027ll give it a look.\u003C/p\u003E\n"}]}