{"TopicId":65865,"ForumId":16,"TopicTitle":"thrust vectoring ahead of center of mass - does it work?","CreatedByName":"ripvanlemon","CreatedById":92617,"CreatedDateTime":"2014-03-15T12:59:05Z","PageNum":1,"Articles":[{"CreatedByName":"ripvanlemon","CreatedById":92617,"CreatedDateTime":"2014-03-15T12:59:05Z","Content":"\n\u003Cp\u003EI\u0027m working on an interplanetary tanker in a pull configuration. Basically what I have at this point, assembled in orbit, is a ring of LV-Ns sitting on top of three orange tanks. Problem is, when I fire the engines, the whole thing starts to rock side to side. It\u0027s not wobbly, it\u0027s just... veering off to one side, then overcorrecting, then veering off the other way.\u003C/p\u003E\u003Cp\u003EI *think* I remember seeing something about thrust vectoring working backwards if the engines are placed ahead of the center of mass. Is that still the case? Am I remembering correctly? And, if so, is there a workaround, or do I just need to lock gimbal?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-15T13:22:08Z\u0022 title=\u002203/15/2014 01:22  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 15, 2014\u003C/time\u003E by ripvanlemon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-03-15T13:03:44Z","Content":"\n\u003Cp\u003EYou\u0027re remembering correctly, engine gimbals assume the engine is behind the center of mass. If you\u0027re placing engines ahead of it, you should lock the gimbals via the right click menu or the craft will be difficult to control.\u003C/p\u003E\u003Cp\u003EHopefully this will be addressed in some future update, as large orbital craft seem to be more stable in a pull configuration vs a push configuration.\u003C/p\u003E\n"},{"CreatedByName":"RedDevilEA","CreatedById":101034,"CreatedDateTime":"2014-03-15T13:04:39Z","Content":"\n\u003Cp\u003EWithout seeing a pic, how is it connected? It could be that the connection is weak.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-03-15T13:13:00Z","Content":"\n\u003Cp\u003EWhat Red Iron Crown said.\u003C/p\u003E\n"}]}