{"TopicId":66726,"ForumId":16,"TopicTitle":"My orbit (blue line) doesn\u0026#039;t change","CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2014-03-25T15:28:55Z","PageNum":1,"Articles":[{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2014-03-25T15:28:55Z","Content":"\n\u003Cp\u003EI\u0027m trying to transition from Kerbin orbit to Mun orbit. I get a blue line when I get close enough to the Mun. I try to wrap that blue line around the Mun by applying thrust but no matter what direction, no matter how much thrust I apply the blue line doesn\u0027t wrap. I rode the line to the Periapsis on it before applying thrust. Why isn\u0027t the line bending?\u003C/p\u003E\n"},{"CreatedByName":"Nathair","CreatedById":102894,"CreatedDateTime":"2014-03-25T16:33:04Z","Content":"\n\u003Cp\u003EAre you sure your engine is thrusting? Is there a decoupler or shroud stuck to the engine or something else blocking it? A quick test is to see if the g meter on the side of the navball moves when you fire/cut the engine.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-03-25T16:36:26Z","Content":"\n\u003Cp\u003ESome screenshots might help. Either you\u0027re not thrusting at all, or you are thrusting but the Mun is not at the place where you have set up your trajectory at the time when you are there.\u003C/p\u003E\n"},{"CreatedByName":"6.forty","CreatedById":97939,"CreatedDateTime":"2014-03-25T16:37:30Z","Content":"\n\u003Cp\u003EAnother quick thing to check is that you aren\u0027t trying to throttle up in map view with the navball hidden. And that you aren\u0027t accidentally in docking mode.\u003C/p\u003E\n"},{"CreatedByName":"Awaras","CreatedById":15671,"CreatedDateTime":"2014-03-25T16:39:33Z","Content":"\n\u003Cp\u003EStupid question, but are you pointing the \u0027blue line\u0027 directly at the Mun? \u003C/p\u003E\u003Cp\u003EBecause you should aim about a quarter orbit AHEAD of the Mun, at which point you should get a yellowish line that wraps around the Mun, kinda like this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img.photobucket.com/albums/v516/MAIFrcrft2000/Kerbal%20Space%20Program/OrcaMoonintercept.png\u0022 alt=\u0022OrcaMoonintercept.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe easiest way to get an intercept is to get into a circular orbit around Kerbin, create a maneuver node anywhere on your path, increase prograde velocity of the node until the projected path touches the line of the mun\u0027s orbit and then grab the maneuver node by left clicking and holding on it\u0027s center and move it around until you get an intercept.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-25T16:44:08Z\u0022 title=\u002203/25/2014 04:44  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 25, 2014\u003C/time\u003E by Awaras\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"diomedea","CreatedById":93700,"CreatedDateTime":"2014-03-25T16:44:32Z","Content":"\n\u003Cp\u003EIf I understand you correctly, you want to establish a close orbit (eccentricity \u0026lt; 1) around Mun after a transfer orbit from Kerbin. The blue line (continuous) is your current orbit. If you burned correctly for a transfer to Mun, that orbit will bring your spaceship within the sphere of influence (SoI) of Mun; but the orbit within the SoI of Mun is another conic (a hyperbolic orbit), colored orange. If you burn before entering Mun\u0027s SoI you can change that hyperbolic orbit, but you won\u0027t be able to reduce eccentricity below 1 (or, that orbit will remain hyperbolic). You have to wait after the transition within Mun\u0027s SoI (than, the blue orbit becomes the hyperbolic one), and that apply burn retrograde to reduce eccentricity enough. The best point to burn retrograde for reducing eccentricity is also the point that best effects the apoapsis altitude: where the periapsis is.\u003C/p\u003E\u003Cp\u003EBut, if what you mean is that you apply throttle to your engines but the orbit doesn\u0027t change, that means no thrust is actually applied. Either your engines are off, your fuel is depleted, your engines thrust is extremely small compared to the mass of your ship, or the ship mounts engines that burn in opposite directions (for a null net result). Or else that I can\u0027t figure.\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-03-25T17:22:29Z","Content":"\n\u003Cp\u003EAre you using a maneuver node to circularize? it sounds like you\u0027re not otherwise it would be obvious which way you needed to burn.\u003C/p\u003E\n"},{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2014-03-25T17:36:26Z","Content":"\n\u003Cp\u003EAs it turns out I had an SAS stuck on after the engine so the engine was thrusting against itself. Taking the SAS off fixed that problem. This also explains why I was able to use engines on earlier stages to navigate as they weren\u0027t blocked. Thanks for your concern.\u003C/p\u003E\u003Cp\u003ENow why does my parachute deploy on launch?\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-25T17:41:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chik Sneadlov\u0022 data-cite=\u0022Chik Sneadlov\u0022\u003E\u003Cdiv\u003EAs it turns out I had an SAS stuck on after the engine so the engine was thrusting against itself. Taking the SAS off fixed that problem. This also explains why I was able to use engines on earlier stages to navigate as they weren\u0027t blocked. Thanks for your concern.\u003Cp\u003ENow why does my parachute deploy on launch?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Parachute Deployment on launch sounds like a staging issue. Check your staging before you launch. Your parachute should be at the top of the list. (The stage numbers in KSP are backwards, with higher numbers firing first.) The list works from bottom to top.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-03-25T17:41:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Chik Sneadlov\u0022 data-cite=\u0022Chik Sneadlov\u0022\u003E\u003Cdiv\u003ENow why does my parachute deploy on launch?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027ve probably got it mapped to the same stage as your engines. You can fix that by going into the VAB, adding a new stage to the staging sequence, dragging the parachute into the new, empty stage, then dragging the stage to the top of the sequence if it isn\u0027t there already.\u003C/p\u003E\u003Cp\u003EEDIT: Ninja\u0027d again!\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-03-25T18:02:39Z","Content":"\n\u003Cp\u003EYeah, the staging for many items is applied in the order they\u0027re added, sounds like you added you chute on last and its triggering on launch, drag the parachute symbol to the top stage on your staging bar (right side in VAB and left side on launch pad) this should either be above or on the last decoupler.\u003C/p\u003E\n"},{"CreatedByName":"Starstrider42","CreatedById":104043,"CreatedDateTime":"2014-03-25T18:41:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Specialist290\u0022 data-cite=\u0022Specialist290\u0022\u003E\u003Cdiv\u003EYou\u0027ve probably got it mapped to the same stage as your engines. You can fix that by going into the VAB, adding a new stage to the staging sequence, dragging the parachute into the new, empty stage, then dragging the stage to the top of the sequence if it isn\u0027t there already.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s a faster way: click the RESET button under the staging list. As long as you\u0027re not doing anything too exotic with your staging it will work fine.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-03-26T02:34:25Z","Content":"\n\u003Cp\u003EYou can do a quick staging change on the pad, but to make it permanent the change has to be done in the VAB\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-03-26T03:05:26Z","Content":"\n\u003Cp\u003EYou can also give the commands manually, I\u0027ve had a few times where I seriously misjudged delta-v for something which had radially-placed nukes higher up, started the nuked, shut down the (probably) skipper, and just treated that stage as a drop tank...\u003C/p\u003E\n"}]}