{"TopicId":66851,"ForumId":16,"TopicTitle":"How to get to Eve.","CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2014-03-26T20:41:51Z","PageNum":1,"Articles":[{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2014-03-26T20:41:51Z","Content":"\n\u003Cp\u003EI don\u0027t know how to get there(Eve). I can get to Duna and stuff but not Eve. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E. Plz tell me how,maybe some Pics? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EP.S (i have Mechjeb) P.S.S (It\u0027s answered i don\u0027t how to change it to answered)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-27T00:37:52Z\u0022 title=\u002203/27/2014 12:37  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 27, 2014\u003C/time\u003E by Dfthu\u003C/strong\u003E\n\u003Cbr\u003Eupdate\n\u003C/span\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2014-03-26T21:55:04Z","Content":"\n\u003Cp\u003EThe big difference is that Eve is inclined, so it\u0027s harder to do with one node. What you want to do is put your periapsis about the same distance as Eve\u0027s and then add another maneuver node at the ascending/descending node to match inclination. You\u0027ll have to be careful here that you come in on the outside of Eve (with multiple nodes it\u0027s easier to screw this up) and not the inside, where you\u0027d be orbiting the wrong way. What can be easier but less efficient is to do it in steps. First break Kerbin\u0027s SoI in the right direction (periapsis below Kerbin\u0027s), then match inclination at the ascending/descending node, and finally do your transfer to Eve.\u003C/p\u003E\u003Cp\u003EI just did a transfer and I\u0027ll include a picture, but note that I\u0027m using a couple modded things here:\u003C/p\u003E\u003Cp\u003E1. MechJeb node editor so I can tweak my nodes much more easily, it can suck zooming in and out to activate your maneuver node when it \u0022closes\u0022.\u003C/p\u003E\u003Cp\u003E2. CONIC_PATCH_DRAW_MODE 0, which draws your future orbit around Eve where it is now instead of where it will be. This can be useful because you can focus Eve and zoom in to see the orbit, whereas it\u0027s really hard to zoom in on otherwise. Again be careful here because it doesn\u0027t flip the orbit (usually Eve will be on the other side of the sun from where it will be when you encounter it) so you need to watch that you don\u0027t come in on the wrong side.\u003C/p\u003E\u003Cp\u003EEdit 2: I may be wrong on my counting, it may actually be new kerbin orbit after maneuver node (1), sun orbit (2), new sun orbit after maneuver node (3), eve orbit (4), sun orbit after eve encounter (5). In which case you\u0027ll need at least 4 to set up all nodes before leaving kerbin. If anybody knows for sure, let me know.\u003C/p\u003E\u003Cp\u003E3. CONIC_PATCH_LIMIT 5, which I don\u0027t think is actually necessary and 2 or 3 may do it, I don\u0027t know what the default is. It just defines how many orbits are predicted. I\u0027m assuming all you need is 3 for this (Kerbin orbit, Sun orbit, Eve orbit) or even 2 if your current orbit isn\u0027t counted.\u003C/p\u003E\u003Cp\u003EThe conic stuff is in the settings.cfg file in your KSP directory, you can search to find more information about it.\u003C/p\u003E\u003Cp\u003EAnd sidenote: I\u0027d recommend sending a probe the first time or a Kerbal that\u0027s gonna stay there for a while. Planning a return trip from Eve is a massive undertaking (getting off Kerbin is 4500 m/s dV, getting off Eve is at least 8000 and that\u0027s after you get down there).\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W7wVeMF.jpg\u0022 alt=\u0022W7wVeMF.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: so in the image you can see the orange maneuver node at Kerbin, the green maneuver node for inclination change, and that the Eve orbit is shown around the current position of eve (the red periapsis marker).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-26T22:03:03Z\u0022 title=\u002203/26/2014 10:03  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 26, 2014\u003C/time\u003E by ScottyDoesKnow\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2014-03-26T22:37:34Z","Content":"\n\u003Cp\u003EThanks i got my Science craft on it\u0027s way there.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Rusty6899","CreatedById":85172,"CreatedDateTime":"2014-03-26T22:42:35Z","Content":"\n\u003Cp\u003EIt\u0027s difficult to tell what you are doing wrong without knowing what you are trying. The main difference between getting to inner planets (Eve and Moho) and outer ones (Duna, Dres, Jool and Eeloo) is that if you are on a prograde orbit you want to burn during the day to get to inner planets and at night to get to outer planets. The exact time to burn depends on which planet you want to reach, but generally it will be up to an hour before midday/midnight to encounter most planets.\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2014-03-26T23:10:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Dfthu\u0022 data-cite=\u0022Dfthu\u0022\u003E\u003Cdiv\u003EP.S (i have Mechjeb)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you\u0027re using MechJeb to create maneuver nodes, just do a normal planet transfer to Eve. Once you\u0027re out of Kerbin\u0027s SoI and into the Sun\u0027s, do a \u0027fine tune closest approach to target\u0027 and you should have an encounter.\u003C/p\u003E\u003Cp\u003EEdit: just noticed you already got there. Glad I could help.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-26T23:15:27Z\u0022 title=\u002203/26/2014 11:15  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 26, 2014\u003C/time\u003E by ScottyDoesKnow\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dfthu","CreatedById":80296,"CreatedDateTime":"2014-03-27T00:30:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ScottyDoesKnow\u0022 data-cite=\u0022ScottyDoesKnow\u0022\u003E\u003Cdiv\u003EIf you\u0027re using MechJeb to create maneuver nodes, just do a normal planet transfer to Eve. \u003C/div\u003E\u003C/blockquote\u003E \u003Cp\u003EI did\u0027t know how to do that with mechjeb. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2014-03-27T00:42:32Z","Content":"\n\u003Cp\u003Ein the mechjeb toolbar, select the maneuver planner, cycle to the \u0022Transfer to another planet\u0022 page, select eve as your target in the map screen and click create and execute. One thing you should know about landers on Eve, it has very high gravity, high enough to break any solar panel, even when retracted, I suggest that you attempt no landings there until you have the RTG unlocked.\u003C/p\u003E\n"},{"CreatedByName":"ScottyDoesKnow","CreatedById":70796,"CreatedDateTime":"2014-03-27T00:50:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Capt. Hunt\u0022 data-cite=\u0022Capt. Hunt\u0022\u003E\u003Cdiv\u003Ein the mechjeb toolbar, select the maneuver planner, cycle to the \u0022Transfer to another planet\u0022 page, select eve as your target in the map screen and click create and execute. One thing you should know about landers on Eve, it has very high gravity, high enough to break any solar panel, even when retracted, I suggest that you attempt no landings there until you have the RTG unlocked.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIs this with deadly reentry or something? I\u0027ve never had a retracted solar array break, even when landing from interplanetary speeds.\u003C/p\u003E\n"},{"CreatedByName":"Capt. Hunt","CreatedById":97860,"CreatedDateTime":"2014-03-27T01:17:39Z","Content":"\n\u003Cp\u003EI\u0027ve yet to attempt this myself, as I haven\u0027t unlocked RTGs, I had heard that somewhere here on the forum. Maybe it\u0027s with an earlier version.\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-03-27T01:18:45Z","Content":"\n\u003Cp\u003EEven in stock aerodynamics, solar panels can break when your craft is moving through an atmosphere while they\u0027re open. It usually only happens at high speeds, but on Eve the lower atmosphere is thick enough to break them even at the speeds a fully open parachute slows you down to.\u003C/p\u003E\n"}]}