{"TopicId":66935,"ForumId":16,"TopicTitle":"My burns take a lot longer than what the maneuver node calculates.","CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2014-03-27T17:30:26Z","PageNum":1,"Articles":[{"CreatedByName":"Chik Sneadlov","CreatedById":68474,"CreatedDateTime":"2014-03-27T17:30:26Z","Content":"\n\u003Cp\u003EI pull the maneuver node things and set up an orbit. At the bottom of the screen it tells me how long the burn will last but I always end up burning for a lot longer. When I do the burn I roll the navball to the blue pip that looks like three T\u0027s with the bottom of each T pointing at the center of the pip. Is that right way to do it?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-31T16:51:32Z\u0022 title=\u002203/31/2014 04:51  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 31, 2014\u003C/time\u003E by Chik Sneadlov\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-03-27T17:37:15Z","Content":"\n\u003Cp\u003EIt is, but the calculation uses your last thrust, so if you had a really powerful engine when you set up the node, and then dropped it for a more efficient engine, the times are going to be different. The best way to do things is get lined up and then about a minute before the burn perform a very short \u0022Test Burn\u0022 to reset the timer.\u003C/p\u003E\u003Cp\u003EAlso if your more efficient engine is significantly less powerful you might not have a very high TWR, in which case your burns will be very long. Another thing to consider is to make sure that there is not a decoupler blocking the thrust of your engine. This ensures that your engine is actually providing thrust (And the effects are not just showing up) and that you are actually performing the burn.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-27T17:39:39Z\u0022 title=\u002203/27/2014 05:39  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 27, 2014\u003C/time\u003E by Taki117\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HoustonDave","CreatedById":102118,"CreatedDateTime":"2014-03-27T17:41:52Z","Content":"\n\u003Cp\u003EWhen doing your burn, make sure you time it so half is before and half after the node. \u003C/p\u003E\u003Cp\u003ESo if the calculated burn is 50 seconds, start it 25 seconds before the node and finish 25 seconds after the node.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2014-03-27T18:40:23Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/40053-Estimate-the-duration-of-a-burn\u0022 rel=\u0022external nofollow\u0022\u003Euse this\u003C/a\u003E. Works like a charm - there is a reply a few posts down with a link to a Google or Wolfram equation you can just plug new numbers into. Just don\u0027t forget to re-calculate each burn with the new weight \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E You can use \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/54533-0-23-VOID-Vessel-Orbital-Informational-Display\u0022 rel=\u0022external nofollow\u0022\u003EVOID\u003C/a\u003E to get vessel weight, right-clicking on an engine will give you the ISP but you should note the max thrust in the VAB/SPH prior to the flight\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-03-27T22:01:14Z","Content":"\n\u003Cp\u003EGenerally, the burn time is based upon 100% thrust of the last burn measured. If you end up staging during the burn, the time will change. Practice will determine how best to set up when to start a burn when you know you will have to stage. Watch the orbit as it changes and cut power with the X key when you have achieved the desired result. You can also reduce thrust when nearing the capture or desired path for more precise cutoff.\u003C/p\u003E\u003Cp\u003EThe mod tools do help but in the long run, it will be your experience that will help in planning when to start the burn with the ship you are flying after setting up the maneuver.\u003C/p\u003E\n"},{"CreatedByName":"SofusRud","CreatedById":59276,"CreatedDateTime":"2014-03-27T22:09:40Z","Content":"\n\u003Cp\u003EAlso remember that the maneuver node assumes that you make your delta-v change instantaneously, and since you can\u0027t do that, the longer your burn needs to be the more inefficient it will be and that adds an inaccuracy\u003C/p\u003E\n"}]}