{"TopicId":67847,"ForumId":16,"TopicTitle":"Asteroids, Center of Mass and All That","CreatedByName":"Keramane","CreatedById":65995,"CreatedDateTime":"2014-04-03T14:28:22Z","PageNum":1,"Articles":[{"CreatedByName":"Keramane","CreatedById":65995,"CreatedDateTime":"2014-04-03T14:28:22Z","Content":"\n\u003Cp\u003ESo, hi, I\u0027ve successfully snagged my first asteroid (named it Hostage One)! However, I want to try and set it into a kerbal orbit. I have a huge engine that gives large Delta-V, half a medium Kerbodine tank for gas and the asteroid is a Class C (so big, but not that big). However, I want to pivot to ideally hit the center of mass. I right clicked the asteroid and hit \u0022Target Center of Mass\u0022 but I didn\u0027t notice a change. Is that the pink mark now? Do I just orient to that and poof, golden?\u003C/p\u003E\u003Cp\u003ENext, I assume the asteroid becomes part of my ship at that point. By reorienting the thing to Retrograde, that takes into account the new asteroid weight, right? just wanna check before I fire (I\u0027ve three kerbals aboard, I don\u0027t wanna quicksave with their lives on the line XD)\u003C/p\u003E\n"},{"CreatedByName":"moonboy13","CreatedById":106787,"CreatedDateTime":"2014-04-03T14:31:01Z","Content":"\n\u003Cp\u003EFrom what I\u0027ve seen from the videos I believe you\u0027re right. Haven\u0027t gotten to the point where I can do that yet since I\u0027m trying to play through on a new career mode so I don\u0027t have any actual experience trying to capture an asteroid.\u003C/p\u003E\n"},{"CreatedByName":"Keramane","CreatedById":65995,"CreatedDateTime":"2014-04-03T14:44:58Z","Content":"\n\u003Cp\u003EMm, well, I\u0027ve unlocked the pivot, adjusted to that point and such. However, once I\u0027m there, I lose my prograde/retrograde markers. How do I get those back? I fluked into getting them once but I can\u0027t get them again \u0026gt;_\u0026gt;\u003C/p\u003E\u003Cp\u003EAlso, when I burn retrograde with any real force, even though I\u0027m locked dead center on the center of mass, the ship started to spin the asteroid, making my retrograde a wonky roller-coaster (my ship is pretty huge, since Class C and all). Is there a cleaner way to burn so that I don\u0027t spiral?\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-03T15:22:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Keramane\u0022 data-cite=\u0022Keramane\u0022\u003E\u003Cdiv\u003E*snip* I have a huge engine that gives large Delta-V, half a medium Kerbodine tank for gas and the asteroid is a Class C (so big, but not that big). \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not the size of the engine that gives you large delta-V, but the engine\u0027s Isp (not related to size) and amount of fuel. I think you mean TWR.\u003C/p\u003E\n"},{"CreatedByName":"Keramane","CreatedById":65995,"CreatedDateTime":"2014-04-03T15:33:29Z","Content":"\n\u003Cp\u003ETrue true, mixed my terms up. Still, I\u0027ve huge thrust and enough fuel to set the thing into the approximate orbit of Minmus, if I don\u0027t keep spiralling around when I give\u0027er sum gas! Aside for reattaching at the literal center as best I can, is there any other way to ensure a lack of spiral?\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EInteresting Factoid\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIf your asteroid hits another orbit en route, you get another source of sample. I just slingshotted the Mun en route to Kerbin and got a new sample =D\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-03T15:43:41Z\u0022 title=\u002204/03/2014 03:43  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 3, 2014\u003C/time\u003E by Keramane\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-04-03T15:45:15Z","Content":"\n\u003Cp\u003EI\u0027m going to suggest something a bit odd, the greatest separation between engines you can manage. If you have 3-4 engines you can throttle some down and adjust your angular momentum by trial and error.\u003C/p\u003E\n"},{"CreatedByName":"JumpsterG","CreatedById":63396,"CreatedDateTime":"2014-04-03T15:45:37Z","Content":"\n\u003Cp\u003EI need to actually play with the update (curse you, 9-to-5 job and personal responsibilities!), but I expect it\u0027s a good idea to go heavy on SAS and/or RCS to help maintain heading during your burns when towing an asteroid. Even pointing as best as you can at the center of mass, there will be some error, and with the very large mass asteroids bring to the table, I would think that even a very small error will result in rotation you\u0027ll need to fight against.\u003C/p\u003E\u003Cp\u003EOr there\u0027s a bug in there somewhere. But I\u0027d guess the first point before thinking it\u0027s a bug. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Keramane","CreatedById":65995,"CreatedDateTime":"2014-04-03T18:26:02Z","Content":"\n\u003Cp\u003EHm, spiral remains my biggest concern...\u003C/p\u003E\u003Cp\u003EHowever! I have an adventure of daring do to brag about!\u003C/p\u003E\u003Cp\u003ESo, I design my ship, 3-man pod, buncha rockets, RCS etc, with a separator on the pod for re-entry. Fly up, nab the asteroid (on try 12) and set it into an oval orbit around kerbin (low side, 129km, high side 500km) when oh no! They run out of fuel! Stranding our heroic trio on the rock. Don\u0027t fear though! I made a 3-landing-pod-ed science explorer to come up! Sceinced like mad, lab, everything. However, like a fool, I didn\u0027t check for stowaways and there is Bath Kerbal flying the thing (didn\u0027t uncrew it :V). Okay, well, whatever. Up it soars, rendezvous with the rock, latches on! Science!!.... yields squat. Seems you can only get samples from the thing. Sadness. Well, I transfer the rescued three over to the three lander pods and sentence Bath to sit in the original pod.. That is when Jeb has the genius idea of using the claw to latch onto the pod and carry Bath home to freedom!\u003C/p\u003E\u003Cp\u003EReoriented, attached the claw to the pod, released the pod\u0027s claw from the rock, adjust orbit to skim atmo, bingo bango, everyone gets home safe! Deployed the pod\u0027s chutes in atmo, releasing the pod a bit before they fully deployed so that everyone lands ideally and close together. Well done all!\u003C/p\u003E\n"},{"CreatedByName":"jmiki8","CreatedById":94688,"CreatedDateTime":"2014-04-03T18:45:09Z","Content":"\n\u003Cp\u003EWhen you target the CoM of the asteroid, the CoM will be marked with the pink-ish marker. After this, you have to click on the Claw and you\u0027ll find a button which unlocks the gimbal, making you able to rotate your craft with RCS and reaction wheels into the right position. When you are done, you have to click on the Claw again, and press the button with the \u0022lock\u0022 sign, and the asteroid-ship combo will become rigid again, allowing you to fire up the pusher rockets.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-03T19:46:55Z","Content":"\n\u003Cp\u003EI think \u0022Target Center Of Mass\u0022 is to re-target the asteroid once you\u0027ve grabbed it. Like, if you target something else, then realize you\u0027re off center. Once you\u0027re not targeting the asteroid any more, you can\u0027t re-target it any other way because it\u0027s part of your ship.\u003C/p\u003E\n"},{"CreatedByName":"kgries3","CreatedById":107793,"CreatedDateTime":"2014-04-06T07:27:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Keramane\u0022 data-cite=\u0022Keramane\u0022\u003E\u003Cdiv\u003EMm, well, I\u0027ve unlocked the pivot, adjusted to that point and such. However, once I\u0027m there, I lose my prograde/retrograde markers. How do I get those back? I fluked into getting them once but I can\u0027t get them again \u0026gt;_\u0026gt;\u003Cp\u003EAlso, when I burn retrograde with any real force, even though I\u0027m locked dead center on the center of mass, the ship started to spin the asteroid, making my retrograde a wonky roller-coaster (my ship is pretty huge, since Class C and all). Is there a cleaner way to burn so that I don\u0027t spiral?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo get your prograde/retrograde markers back on your nav ball, you have to click on the top of the nav ball where it says \u0022target\u0022 or \u0022orbit\u0022 or surface\u0022 in order to toggle it back to Orbit mode. Once you do that it will bring up your prograde/retrograde markers again. The pink marker indicating the asteroid\u0027s center of mass should stay on there I believe.\u003C/p\u003E\u003Cp\u003EBurning your engine(s) while attached to an asteroid as large as a class C will be difficult. You\u0027ll want to manually line your craft up with the asteroid\u0027s center of mass as closely as you can using the pink marker on your nav ball and get that sucker locked down once you get it. The closer you get it to center, the more thrust you\u0027ll be able to apply with your main engine(s). Then keep your SAS engaged to allow the spacecraft to resist rotation. Even still though, even moderate amounts of thrust can overcome your SAS\u0027s abilities to resist rotation, so you have to play with the amount of thrust you use when doing your burns. Too much, and you will start to rotate again. Increase thrust gradually and watch that pink marker on your nav ball. The farther that pink marker gets from center, the more torque there is on the asteroid and the closer you are to spinning.\u003C/p\u003E\u003Cp\u003EHere\u0027s a visual for you to consider. Think of three points: the asteroid\u0027s center of mass, the rocket\u0027s center of thrust, and the point between them where the AGU (the claw) is actually grabbed onto the asteroid. Draw a line from the asteroid\u0027s center of mass to the AGU claw. Then draw another line from the AGU claw to the rocket\u0027s center of thrust. Ideally, if the angle between those two lines (we\u0027ll call it the \u0022attachment angle\u0022) is exactly 180 degrees (i.e. the two lines make one straight line) then you can apply all the thrust you want and no torque will be invovled. If the attachment angle is not exactly 180 degrees, then you get torque. The farther you are from 180 degrees, the more torque you get. That attachment angle is what is represented on your nav ball by the pink marker. Having the pink marker perfectly centered on your nav ball represents an attachment angle of 180 degrees. If you see it drift from center, you\u0027ll know your angle not perfect. The more it drifts from center, the farther your attachment angle is from 180 degrees (and the harder your SAS is having to work to pull it back). When you\u0027re doing your burn, keep any eye on it and get a feel for how far you can let it drift from center and still maintain control.\u003C/p\u003E\u003Cp\u003EIf you want more control I would recommend adding more reaction wheels and/or RCS thrusters.\u003C/p\u003E\n"},{"CreatedByName":"Tordan69","CreatedById":98506,"CreatedDateTime":"2014-04-07T07:45:26Z","Content":"\n\u003Cp\u003EKgries, just want to check if the images I see in my head works. Oh, agree with the person earlier cursing 9-5 jobs and all that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI imagine an 2D drawing of an asteroid with a number of flat surfaces forming a circle, think of a dodecahedron with different angles, and its center of mass near the center. As I grab onto the asteroid the claw will do so at 90 degrees to the surface, i.e. the ships centreline is most likely not pointing at the center of mass. So, thrusting in this configuration will cause spin due to off center thrust. Now, unlock the claw gimbal and rotate the ship to center the pink marker. Lock the gimbal. This means that the thrust points directly at the center of mass, therefore not causing the asteroid/ship combo to start spinning? ThatÃ‚Â´s your \u0022attachment angle\u0022 zeroed out?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-07T07:47:38Z\u0022 title=\u002204/07/2014 07:47  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 7, 2014\u003C/time\u003E by Tordan69\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-04-07T08:25:52Z","Content":"\n\u003Cp\u003EI could be wrong here, and would be happy to be corrected if that\u0027s the case.\u003C/p\u003E\u003Cp\u003EAs I see it, if you\u0027ve had to tilt your ship (by unlocking the claw\u0027s pivot) to line up with the asteroid\u0027s CoM, you\u0027re still going to get some spin.\u003C/p\u003E\u003Cp\u003EThe reason is that you\u0027re not applying thrust perpendicular to the surface of the asteroid. This means that some component of the thrust is being applied tangentially, and is going to tend to cause spin.\u003C/p\u003E\u003Cp\u003ESolutions would be to add more SAS, dock some RCS thrusters to the asteroid, and limit the degree of pivot required to point at the CoM, possibly by redocking in a more advantageous position.\u003C/p\u003E\n"},{"CreatedByName":"HelmyJune","CreatedById":104897,"CreatedDateTime":"2014-04-09T17:39:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexinTokyo\u0022 data-cite=\u0022AlexinTokyo\u0022\u003E\u003Cdiv\u003EI could be wrong here, and would be happy to be corrected if that\u0027s the case.\u003Cp\u003EAs I see it, if you\u0027ve had to tilt your ship (by unlocking the claw\u0027s pivot) to line up with the asteroid\u0027s CoM, you\u0027re still going to get some spin.\u003C/p\u003E\u003Cp\u003EThe reason is that you\u0027re not applying thrust perpendicular to the surface of the asteroid. This means that some component of the thrust is being applied tangentially, and is going to tend to cause spin.\u003C/p\u003E\u003Cp\u003ESolutions would be to add more SAS, dock some RCS thrusters to the asteroid, and limit the degree of pivot required to point at the CoM, possibly by redocking in a more advantageous position.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ekgries3 got it spot on. You can literally hook on to an asteroid anywhere as long as you can pivot enough to line your attitude indicator up with the asteroid\u0027s CoM. As long is your ship\u0027s CoT is lined up with up the asteroids CoM you will fly straight. \u003C/p\u003E\u003Cp\u003EI just captured my first asteroid outside of the scenarios yesterday. When I hooked up to the asteroid I had to pivot about 30 degrees to line my CoT with the CoM of the asteroid. It was a class C but I was still able to apply full thrust without any drift. My first attempt at capturing an asteroid in the scenario was veeeerry slow but successful considering I didn\u0027t know you could target the asteroid\u0027s CoM. I could only apply about 5-10% throttle without spinning out of control.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-09T22:58:16Z\u0022 title=\u002204/09/2014 10:58  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 9, 2014\u003C/time\u003E by HelmyJune\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Koltronn","CreatedById":103348,"CreatedDateTime":"2014-04-09T17:57:03Z","Content":"\n\u003Cp\u003ETo line up with the center of mass I will switch to free pivot and then pull backwards on the asteroid with RCS, the COM will swing in front of the craft and then I can lock and begin pushing. (admittedly this will probably work best on smaller asteroids)\u003C/p\u003E\n"},{"CreatedByName":"kgries3","CreatedById":107793,"CreatedDateTime":"2014-04-12T05:29:14Z","Content":"\n\u003Cp\u003EI have been working on fixing this whole debacle by designing a ship that can pull an asteroid instead of push it. If you can attach your ship to an asteroid, set the claw to \u0022free pivot,\u0022 and then pull it, the rock will just follow you like a trailer on a hitch. Then ideally you can just fire up your engines as much as you want and won\u0027t have to worry about spinning out of control.\u003C/p\u003E\u003Cp\u003EI have attached the engines out away from the rocket on girders reinforced with struts to minimize wobbling and angled them outward so that the exhaust flies out clear of the asteroid. Works like a charm, like a tugboat.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tordan69\u0022 data-cite=\u0022Tordan69\u0022\u003E\u003Cdiv\u003EKgries, just want to check if the images I see in my head works. Oh, agree with the person earlier cursing 9-5 jobs and all that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cp\u003EI imagine an 2D drawing of an asteroid with a number of flat surfaces forming a circle, think of a dodecahedron with different angles, and its center of mass near the center. As I grab onto the asteroid the claw will do so at 90 degrees to the surface, i.e. the ships centreline is most likely not pointing at the center of mass. So, thrusting in this configuration will cause spin due to off center thrust. Now, unlock the claw gimbal and rotate the ship to center the pink marker. Lock the gimbal. This means that the thrust points directly at the center of mass, therefore not causing the asteroid/ship combo to start spinning? ThatÃ‚Â´s your \u0022attachment angle\u0022 zeroed out?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe claw doesn\u0027t necessarily have to be 90 degrees to the surface, the angle to the surface is irrelevant. But yes, you\u0027re correct, when the thrust \u0022points\u0022 directly at the center of mass, there will be no spinning, the attachment angle is zeroed out (more accurately, it is exactly 180 degrees).\u003C/p\u003E\n"},{"CreatedByName":"kgries3","CreatedById":107793,"CreatedDateTime":"2014-04-12T06:01:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexinTokyo\u0022 data-cite=\u0022AlexinTokyo\u0022\u003E\u003Cdiv\u003EI could be wrong here, and would be happy to be corrected if that\u0027s the case.\u003Cp\u003EAs I see it, if you\u0027ve had to tilt your ship (by unlocking the claw\u0027s pivot) to line up with the asteroid\u0027s CoM, you\u0027re still going to get some spin.\u003C/p\u003E\u003Cp\u003EThe reason is that you\u0027re not applying thrust perpendicular to the surface of the asteroid. This means that some component of the thrust is being applied tangentially, and is going to tend to cause spin.\u003C/p\u003E\u003Cp\u003ESolutions would be to add more SAS, dock some RCS thrusters to the asteroid, and limit the degree of pivot required to point at the CoM, possibly by redocking in a more advantageous position.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou are incorrect. Your claw\u0027s angle to the surface of the rock is irrelevant. What\u0027s important is the center of mass. The amount and direction of induced spin from firing your engines while attached to the asteroid is dictated by the \u0022attachment angle\u0022 as explained above, not the angle with the asteroid\u0027s surface.\u003C/p\u003E\n"},{"CreatedByName":"kgries3","CreatedById":107793,"CreatedDateTime":"2014-04-13T18:39:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kgries3\u0022 data-cite=\u0022kgries3\u0022\u003E\u003Cdiv\u003EI have been working on fixing this whole debacle by designing a ship that can pull an asteroid instead of push it. If you can attach your ship to an asteroid, set the claw to \u0022free pivot,\u0022 and then pull it, the rock will just follow you like a trailer on a hitch. Then ideally you can just fire up your engines as much as you want and won\u0027t have to worry about spinning out of control.\u003Cp\u003EI have attached the engines out away from the rocket on girders reinforced with struts to minimize wobbling and angled them outward so that the exhaust flies out clear of the asteroid. Works like a charm, like a tugboat.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-4.steampowered.com/ugc/598159759983703705/3F4EB54ACB1801836B0FFCF7ED2E0ADF9D8694E0/\u0022 alt=\u00223F4EB54ACB1801836B0FFCF7ED2E0ADF9D8694E0\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-13T18:59:01Z","Content":"\n\u003Cp\u003EIf you leave enough space between your engines and the asteroid, you can pull it by burning exactly towards it and the asteroid won\u0027t block the thrust. I think length of three or four jumbo tanks between the engine and the asteroid is sufficient.\u003C/p\u003E\u003Cp\u003EHowever ... I have rather bad experience with trying to pull an asteroid (yes I tried it). In the end I think the right solution is to use several torque probes attached to the asteroid (to rotate the asteroid as a whole instead of trying to do that from the ship) and to push with sufficiently long rocket so engine gimbal can make up for eccentricity of the ship-asteroid combo.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-13T19:01:54Z\u0022 title=\u002204/13/2014 07:01  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 13, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"juanml82","CreatedById":105344,"CreatedDateTime":"2014-04-13T22:33:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIf you leave enough space between your engines and the asteroid, you can pull it by burning exactly towards it and the asteroid won\u0027t block the thrust. I think length of three or four jumbo tanks between the engine and the asteroid is sufficient.\u003Cp\u003EHowever ... I have rather bad experience with trying to pull an asteroid (yes I tried it). In the end I think the right solution is to use several torque probes attached to the asteroid (to rotate the asteroid as a whole instead of trying to do that from the ship) and to push with sufficiently long rocket so engine gimbal can make up for eccentricity of the ship-asteroid combo.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo if I get it right, you\u0027re thinking of basically putting 4/6 small probes in an Asteroid Hunter ship - maybe ion engines with SAS, RCS and one claw (or just RCS) - so you attach your main ship and then you fire off the small probes and also attach them, via the claw, to the asteroid?\u003C/p\u003E\u003Cp\u003EI just did my first intercept - a class C - with a somewhat conventional ship and I\u0027ve abandoned it after I couldn\u0027t control it, so I\u0027m trying to plan my next try. I have a Class B entering Kerbin\u0027s SOI in a few days but, alas, I also have a Jool-Kerbin transfer window and I need to send my ships at Jool back home. I still think I can squeeze launching a new ship to catch that Class B.\u003C/p\u003E\n"},{"CreatedByName":"kgries3","CreatedById":107793,"CreatedDateTime":"2014-04-13T23:13:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIf you leave enough space between your engines and the asteroid, you can pull it by burning exactly towards it and the asteroid won\u0027t block the thrust. I think length of three or four jumbo tanks between the engine and the asteroid is sufficient.\u003Cp\u003EHowever ... I have rather bad experience with trying to pull an asteroid (yes I tried it). In the end I think the right solution is to use several torque probes attached to the asteroid (to rotate the asteroid as a whole instead of trying to do that from the ship) and to push with sufficiently long rocket so engine gimbal can make up for eccentricity of the ship-asteroid combo.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI just used a slightly modified version of the pictured ship to capture and circularize a class E at 2.5 million meters with ease. The key was to take all those RCS thrusters off of the tanks and put them out on those girders instead, farther away from the CoM. This way they have the most amount of possible torque on the asteroid (torque = perpendicular force * distance from CoM). With the claw attached and locked, I used the RCS thrusters to slowly turn the asteroid to get my engines facing the correct direction for the burn. Then I set the claw to free pivot, made sure RCS and SAS were both activated, and burned away. I could burn at full thrust for however long I needed with no problems. The asteroid just followed along behind like a giant trailer.\u003C/p\u003E\u003Cp\u003EAfter multiple asteroid captures, I can say that pulling is FAR better than pushing.\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-04-14T00:00:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kgries3\u0022 data-cite=\u0022kgries3\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://cloud-4.steampowered.com/ugc/598159759983703705/3F4EB54ACB1801836B0FFCF7ED2E0ADF9D8694E0/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://cloud-4.steampowered.com/ugc/598159759983703705/3F4EB54ACB1801836B0FFCF7ED2E0ADF9D8694E0/\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe angled engines are unnecessary, and you are just wasting a ton of fuel because of it. The distance required between the back of the engine and any obstruction is only about the length of the exhaust plume.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/fTvaJDm.png\u0022 alt=\u0022fTvaJDm.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ktqRJQU.png\u0022 alt=\u0022ktqRJQU.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-14T00:02:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIf you leave enough space between your engines and the asteroid, you can pull it by burning exactly towards it and the asteroid won\u0027t block the thrust. I think length of three or four jumbo tanks between the engine and the asteroid is sufficient.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt that distance, you could (or pretend that you did) just flare the engines out a few degrees and miss the asteroid altogether.\u003C/p\u003E\u003Cp\u003EAssuming an asteroid is 1 jumbo tank wide (I think the As are about that? Maybe the Bs?) you\u0027d \u0022only\u0022 have to flare out 10 degrees to miss it.\u003C/p\u003E\n"},{"CreatedByName":"kgries3","CreatedById":107793,"CreatedDateTime":"2014-04-14T02:13:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xaiier\u0022 data-cite=\u0022Xaiier\u0022\u003E\u003Cdiv\u003EThe angled engines are unnecessary, and you are just wasting a ton of fuel because of it. The distance required between the back of the engine and any obstruction is only about the length of the exhaust plume.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid not know that, thanks for sharing.\u003C/p\u003E\n"},{"CreatedByName":"Lukaszenko","CreatedById":95776,"CreatedDateTime":"2014-04-14T15:49:03Z","Content":"\n\u003Cp\u003EI find that even if the thrust perfectly lines up with the COM of the asteroid, the rocket starts bending once the engines fire, and the asteroid starts spinning. This is a function of how long and thin the rocket is, and how much thrust you\u0027re applying. Reducing thrust is probably the simplest way to avoid the rocket buckling. \u003C/p\u003E\u003Cp\u003EOf course pulling the rocket apparently seems to work, but it doesn\u0027t seem realistic. I\u0027m sure there\u0027s a distance by which the exhaust will disperse enough not to matter, but I\u0027ll also surmise that it\u0027s much longer than the exhaust plume.\u003C/p\u003E\n"}]}