{"TopicId":68278,"ForumId":16,"TopicTitle":"Can\u0026#039;t grab asteroids","CreatedByName":"Bearsh","CreatedById":107549,"CreatedDateTime":"2014-04-05T20:28:42Z","PageNum":1,"Articles":[{"CreatedByName":"Bearsh","CreatedById":107549,"CreatedDateTime":"2014-04-05T20:28:42Z","Content":"\n\u003Cp\u003EI use the ARM when i go in to grab it, I either bounce off or explode. What\u0027s up with that?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-05T20:33:39Z","Content":"\n\u003Cp\u003EPicture would help but you either did not arm it or approached the asteroid too fast. Pack some RCS and come in slow as if you\u0027re docking.\u003C/p\u003E\n"},{"CreatedByName":"Bearsh","CreatedById":107549,"CreatedDateTime":"2014-04-05T20:43:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EPicture would help but you either did not arm it or approached the asteroid too fast. Pack some RCS and come in slow as if you\u0027re docking.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve never docked actually, But i\u0027m better with asteroids than i am with docking, 1 question. How to thrust forward and backwards with RCS?\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2014-04-05T20:48:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bearsh\u0022 data-cite=\u0022Bearsh\u0022\u003E\u003Cdiv\u003EHow to thrust forward and backwards with RCS?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis page should help you with your question:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Key_bindings\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Key_bindings\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-04-05T20:58:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bearsh\u0022 data-cite=\u0022Bearsh\u0022\u003E\u003Cdiv\u003EI\u0027ve never docked actually, But i\u0027m better with asteroids than i am with docking, 1 question. How to thrust forward and backwards with RCS?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe H \u0026amp; N keys are usually translate forward \u0026amp; backward, respectively.\u003C/p\u003E\n"},{"CreatedByName":"RW-1","CreatedById":107278,"CreatedDateTime":"2014-04-06T12:14:22Z","Content":"\n\u003Cp\u003EInteresting, I captured a roid yesterday, but al;wo placed the claw on a ship to go grab another ship in orbit that has run out of fuel.\u003C/p\u003E\u003Cp\u003EApproached and matched speeds, then moved in at 0.3 m/s, they only bumped, claw was armed....\u003C/p\u003E\n"},{"CreatedByName":"Skyrunner27","CreatedById":64031,"CreatedDateTime":"2014-04-06T12:29:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RW-1\u0022 data-cite=\u0022RW-1\u0022\u003E\u003Cdiv\u003EInteresting, I captured a roid yesterday, but al;wo placed the claw on a ship to go grab another ship in orbit that has run out of fuel.\u003Cp\u003EApproached and matched speeds, then moved in at 0.3 m/s, they only bumped, claw was armed....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDid you kill out all lateral velocity with the vessel. I haven\u0027t actually used the claw on any vessel besides an asteroid but it appears to be more fickle than a docking port when it comes to making contact, but I noticed that killing out lateral velocity seems most important.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-06T13:10:29Z","Content":"\n\u003Cp\u003EThe claw has to hit the roid more or less perpendicular to its surface to stick. Because roids have very irregular surfaces, when usually happens is that as the ship comes in perpendicular to the roid\u0027s center of mass, the surface there is very sloped so only 1 corner of the claw will touch the roid and it won\u0027t grab if you stop the ship at this point. You usually have to rotate the ship to bring the whole face of the claw into contact with the sloping roid surface. This of course throws the ship out of line with the CoM, but that\u0027s why you have the pivot. Once grabbed, unlock the pivot, rotate the ship back to line up with the CoM, then lock the pivot.\u003C/p\u003E\n"},{"CreatedByName":"Anton P. Nym","CreatedById":73533,"CreatedDateTime":"2014-04-06T15:06:39Z","Content":"\n\u003Cp\u003EYou have to remember when grabbing an asteroid to \u0022arm\u0022 the Claw before touching the asteroid; when it\u0027s armed you can see hooks coming out of it, when it\u0027s disarmed the hooks are shrouded like they are in the VAB. In order to let go of an asteroid you\u0027ve grabbed onto, you have to disarm the Claw.\u003C/p\u003E\u003Cp\u003EYou can arm and disarm the Claw by right-clicking on it and selecting the option in the pop up menu, or you can set an action group key to toggle between armed and disarmed.\u003C/p\u003E\u003Cp\u003E -- Steve\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-06T18:24:57Z","Content":"\n\u003Cp\u003EYou have to be pretty gentle with it. Your target speed at contact should be around 0.1m/s or you\u0027ll bounce off or have other problems.\u003C/p\u003E\n"},{"CreatedByName":"stevism","CreatedById":90744,"CreatedDateTime":"2014-04-06T18:39:40Z","Content":"\n\u003Cp\u003Eyou don\u0027t have to be that gentle. i think it\u0027s more important that the claw itself is going to hit perpendicular to a flatish surface on the asteroid...\u003C/p\u003E\u003Cp\u003Ei went straight into a flat side of one with the arm at 1.5-2.0 m/s and it worked flawlessly. \u003C/p\u003E\u003Cp\u003Ehowever another time i was a bit sideways going at 0.2 m/s and my craft just went out of control.\u003C/p\u003E\u003Cp\u003Eymmv\u003C/p\u003E\n"},{"CreatedByName":"Georodin","CreatedById":55325,"CreatedDateTime":"2020-07-31T11:29:39Z","Content":"\n\u003Cp\u003E\nSo I did a fresh install of 1.8.1 with just a few mods. Spend all morning designing a refuelstation. Fist mechJeb broke no maneuvers no warping, only node creation worked partwise, secondly I could not click my own orbital path to create maneuvers. And last point, my armed grabbing unit just goes through the 1st meter of the astroid at 0.3ms forward directed velocity only and then bounces back. I gonna uninstall from my laptop again hahaha (dont worry still have it on my Desktop PC)\u003Cbr\u003E\nNVM worked in the end\n\u003C/p\u003E\n"},{"CreatedByName":"Gargamel","CreatedById":64714,"CreatedDateTime":"2020-07-31T12:13:03Z","Content":"\n\u003Cp\u003E\nSeeing how most of this is answered in other threads, and the Klaw has had a few bugs fixed since this thread was originated, we\u0027ll just lock this one down.   If you have fresh issues with more recent versions, it\u0027s probably best to start a new thread. \n\u003C/p\u003E\n"}]}