{"TopicId":68471,"ForumId":16,"TopicTitle":"how do you use radial solid boosters","CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-04-06T23:49:55Z","PageNum":1,"Articles":[{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-04-06T23:49:55Z","Content":"\n\u003Cp\u003EDo you just burn them with central liquid engine off , jettison and that turn on central liquid engine? Well thats not how real life rockets do it.\u003C/p\u003E\u003Cp\u003EOr do you burn them along with central engine throttled down (to keep velocity velow terminal), and throttle up after their separation?\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-04-06T23:51:40Z","Content":"\n\u003Cp\u003EDepends on the payload and how easy the rocket is to control. I usually have the main burning so I have some control over the rocket.\u003C/p\u003E\n"},{"CreatedByName":"Boomerang","CreatedById":92198,"CreatedDateTime":"2014-04-06T23:55:40Z","Content":"\n\u003Cp\u003EGenerally speaking, I do the later, igniting first stage SRB and LOX engines together, throttling back the later as necessary to stay right around terminal velocity. \u003C/p\u003E\u003Cp\u003EPlenty of exceptions to that, if I\u0027m just playing around or if for some reason my TWR at liftoff is just about ideal on only SRB, then sure, I\u0027ll use them separately.\u003C/p\u003E\n"},{"CreatedByName":"kiwiak","CreatedById":82796,"CreatedDateTime":"2014-04-07T00:17:22Z","Content":"\n\u003Cp\u003Eby the way, what about liquid boosters, but without aspargus (fuel crossfeed)?\u003C/p\u003E\u003Cp\u003Elets take soyuz, after it jettisons radial boosters, central stage still burns. but without radial boosters rockets twr is much lower. or maybe central stage burned so much fuel that twr is not that low after all? or it was throttled down before?\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-04-07T01:02:37Z","Content":"\n\u003Cp\u003EI very rarely asparagus stage, and for me it depends on the TWR. If it\u0027s around 1.5, I go with just them so I don\u0027t waste a bunch of Dv from the main rocket on drag.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-04-07T04:03:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EDo you just burn them with central liquid engine off , jettison and that turn on central liquid engine? Well thats not how real life rockets do it.\u003Cp\u003EOr do you burn them along with central engine throttled down (to keep velocity below terminal), and throttle up after their separation?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor me, the best use of SRB is to assist a rocket that has good ISP, but low TWR, to get up to a decent climbing speed.\u003C/p\u003E\u003Cp\u003EMy bigger ships typically have a ground TWR of 1.4 or so, thus would take a few eternities to get up to terminal velocity.(ok, 45 seconds feels like an eternity)\u003C/p\u003E\u003Cp\u003EBy augmenting my thrust in the first 30-60 seconds using SRBs, I get the whole thing up to 120m/s climb rate more quickly, after which the core\u0027s by then 1.5 TWR is just right to ride the terminal velocity curve without any throttling down.\u003C/p\u003E\u003Cp\u003EOf course, the core engines are burning too. Full thrust!\u003C/p\u003E\u003Cp\u003EANY engine not burning at full, is an engine pretending to be payload.\u003C/p\u003E\u003Cp\u003EAnd yes, this is *exactly* what SRBs are use for in real life, too. Get off the pad, get through the first 8km of soup-called-air, then allow the efficient orbital engines to do their thing.\u003C/p\u003E\n"},{"CreatedByName":"KerikBalm","CreatedById":91917,"CreatedDateTime":"2014-04-07T07:31:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003EANY engine not burning at full, is an engine pretending to be payload.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t you mean a payload pretending to be an engine?\u003C/p\u003E\n"},{"CreatedByName":"KerbMav","CreatedById":70338,"CreatedDateTime":"2014-04-07T08:26:11Z","Content":"\n\u003Cp\u003EAs soon as the atmosphere is thin enough for terminal velocity to be ridiculously high (and to not play dirty drag tricks on the rocket) all engines can burn as powerful as they can.\u003C/p\u003E\u003Cp\u003EBefore that drag can get so high at high speeds that you simply waste fuel, so it can even make sense to lower the thrust of the SRBs during construction.\u003C/p\u003E\u003Cp\u003EA central engine (with gimbals) helps controlling and steering the rocket, especially in thinner atmosphere where fins wont work anymore.\u003C/p\u003E\u003Cp\u003EI think it is mostly up to personal taste if you counter exceeding terminal velocity by lower thrust or not burning all engines?\u003C/p\u003E\n"},{"CreatedByName":"wasmic","CreatedById":64885,"CreatedDateTime":"2014-04-07T08:34:53Z","Content":"\n\u003Cp\u003ESince I use FAR, terminal velocity isn\u0027t much of an issue - I hardly ever reach it during ascent, unless I have a very un-aerodynamic vehicle. I almost always take off with full throttle at both central stack and radial boosters, and then I throttle down to keep my acceleration below 30 m/s\u003Csup\u003E2\u003C/sup\u003E. I do sometimes thrust-limit my SRBs, though.\u003C/p\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-04-07T08:48:09Z","Content":"\n\u003Cp\u003ESolid boosters or any boosters without crossfeed has two effects, they let you get up in speed fast, for this the trashcans are nice increasing twr from 1.4 to 1.7. \u003C/p\u003E\u003Cp\u003EThe second effect, they let you burn off part of the fuel, say your TWR without boosters is 1, with boosters its 1.7 at the time the boosters has run out your TWR is 1.5 and you are golden, in this setting you want booster who burn longer. This is common in real world too. \u003C/p\u003E\u003Cp\u003EYou fire them together with the first stage and reduce trust to keep at terminal speed. here solids has an benefit as you can not reduce trust on only main stage efficiently.\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-04-07T10:11:08Z","Content":"\n\u003Cp\u003EI dont, I avoid SRBs at all costs since I find it makes my rockets borderline uncontrollable. Instead I use a single standard Jet engine attached to an FL-T200 tank with its oxidizer and most of the fuel removed and a single radial intake all attached to my rocket with a radial decoupler. About 12 of these will lift 180 tonnes up to 12km without any assistance from the engines at a leisurely 50m/s and when you jettison them they always fly outwards due to the drag caused by the intake. That makes it so that you\u0027re essentially lifting your launchpad up to 12km, so its almost like taking off from laythe \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-07T11:04:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022kiwiak\u0022 data-cite=\u0022kiwiak\u0022\u003E\u003Cdiv\u003EDo you just burn them with central liquid engine off , jettison and that turn on central liquid engine? Well thats not how real life rockets do it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpace shuttle definitely used both.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://ayay.co.uk/backgrounds/science/space/Other-Space-Shuttle-Launch.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ayay.co.uk/backgrounds/science/space/Other-Space-Shuttle-Launch.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor my own ships I use whatever is needed to reach TWR of approximately 2. If SRBs are too weak, I add some engine thrust. If they are stron enough, the engine sleeps till they decouple.\u003C/p\u003E\n"},{"CreatedByName":"Aedile","CreatedById":104353,"CreatedDateTime":"2014-04-07T18:32:27Z","Content":"\n\u003Cp\u003EThere are few conflicting things. I wings and jet engines aside,\u003C/p\u003E\u003Cp\u003EFrom one side - \u003C/p\u003E\u003Cp\u003EDrag - more speed more drag - always. With stock ksp this is linear, with FAR depends on many factors.\u003C/p\u003E\u003Cp\u003Eif you use FAR atmosphere is gets thinner faster, however you have to be more careful with the gravity turn, higher AoA higher drag, especially if you stall, control becomes harder with higher speed.\u003C/p\u003E\u003Cp\u003EGravity turn, if you are going for equatorial orbit, this is almost an art. You don\u0027t want to burn far from pro grade. If you boost too much vertically, you will burn once to fight the planet rotation, and once to compensate. Generally you don\u0027t want your orbit pro-grade to go over 45. \u003C/p\u003E\u003Cp\u003EFrom the other side - \u003C/p\u003E\u003Cp\u003EEngine ISP - the faster you gain altitude, the better.\u003C/p\u003E\u003Cp\u003EWeight - The faster you lose weight, the less you need to carry the rest of the way. Generally you don\u0027t want to be carrying dead weight such as half empty tanks, idle engines, structural elements. The faster you get rid of fuel as well, the better. Smaller and lighter rocket is easier to control (so you can go with less control fins torque rcs). on the other hand, decouplers and struts weigh as well so over-engineering staging might not be great.\u003C/p\u003E\u003Cp\u003EDrag - the faster you stage, the better. The faster you go in thin atmosphere the better.\u003C/p\u003E\u003Cp\u003ETo the questions about SRBs. \u003C/p\u003E\u003Cp\u003EIn RL thrust changes with isp, so lots of rockets wont make it without boosters. If you use a mod which changes isp from fuel burn to trust, you\u0027ll really appreciate this fact. Depends on your rocket engine.\u003C/p\u003E\u003Cp\u003EOne of the things, which does not matter yet and they excel in - cost.\u003C/p\u003E\u003Cp\u003EThe second thing - TWR, while they have pretty poor ISP, they are pretty good at ASL.\u003C/p\u003E\u003Cp\u003EAnyway, in my experience, burn boosters at full power, or 75%. Burn first stage engine as well. You basically want a TWR between 1.25 and 2.\u003C/p\u003E\u003Cp\u003ESo basically, boost from 1.5 ish - this increases until you drop boosters. Ideally you\u0027ll drop SRBs when you begin main part of your gravity turn. Here is good to have TWR around 1.25, as you might need gravity to bring your pro grade down a little. Then generally you want to boost pro-grade, with apoaps staying some 20-30 seconds away.\u003C/p\u003E\u003Cp\u003EThere is of course a case where you might want not to use a first stage engine, so you might want SRBs to boost you to acceptable altitude\u003C/p\u003E\n"},{"CreatedByName":"Hyomoto","CreatedById":64780,"CreatedDateTime":"2014-04-07T18:42:22Z","Content":"\n\u003Cp\u003EI usually burn out my SRB\u0027s as a \u0027free lift\u0027 before my liquid rockets. The problem with burning fuel is that, depending on design, it feels like a waste. I can either put enough SRB\u0027s to push me 9k\u002B and then activate my liquid boosters OR burn fuel the whole flight. Since SRB\u0027s are lighter and cheaper per ton than regular engines, they tend to be my work horse. I\u0027ve been really having fun with the new SRB since you can put a craft on top of it, tilt the launch section and not have to activate your liquid engines until you get into space!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i109.photobucket.com/albums/n48/Hyomoto/2014-04-07_00001_zps94841db4.jpg~original\u0022 alt=\u00222014-04-07_00001_zps94841db4.jpg~original\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-09T19:18:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003ESpace shuttle definitely used both.\u003Cp\u003E\u003Ca href=\u0022http://ayay.co.uk/backgrounds/science/space/Other-Space-Shuttle-Launch.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ayay.co.uk/backgrounds/science/space/Other-Space-Shuttle-Launch.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EIt\u0027s an unusual case though. The Shuttle would need its main engines firing to stay balanced.\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-09T20:25:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EIt\u0027s an unusual case though. The Shuttle would need its main engines firing to stay balanced.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThen... Titan V?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://aerospace.firetrench.com/wp-content/uploads/2011/09/titaniv.jpg\u0022 alt=\u0022titaniv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOr SLS? (sure, that\u0027s just artistic license)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.aero-news.net/images/content/aerospace/2011/NASA-SLS-0911c.jpg\u0022 alt=\u0022NASA-SLS-0911c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EActually I have problems finding that \u0022usual case\u0022.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-04-09T20:41:31Z","Content":"\n\u003Cp\u003ESome real SRBs are steerable using graphite fins in the exhaust nozzle. Some mod SRBS can be vectored. The new one responds well to a reaction wheel mounted on top or to fins at the base.\u003C/p\u003E\u003Cp\u003EThe shuttle is a different story given how far from the COM its main fuel tank is located along with the ever changing GOM of fuel burned by the SRB and the main fuel tank. It has to correct for that by gymboling its main three engines all during the flight.\u003C/p\u003E\u003Cp\u003EThe LADEE challenge to place a satellite around Mun is requiring the new SRB for the first stage. Tweakable thrust is really making SRBs quite useful.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-09T23:30:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EThen... Titan V?\u003Cp\u003EOr SLS? (sure, that\u0027s just artistic license)\u003C/p\u003E\u003Cp\u003EActually I have problems finding that \u0022usual case\u0022.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003EPoint taken. I was meaning rather that the Shuttle was unusual in being off-balanced, not in using the core and boosters in parallel.\u003Cp\u003EAs for KSP, well I think - but haven\u0027t proven - the answer is simple:\u003C/p\u003E\u003Cp\u003EIf your core has good TWR and you\u0027re using the boosters to give you more delta-V, you should let the boosters burn out before igniting the main engine. That way you\u0027re using your low Isp boosters to lift your higher Isp core.\u003C/p\u003E\u003Cp\u003EIf your core has low TWR and you\u0027re using the boosters to give you more thrust, then you should ignite the core and boosters together. Otherwise when the boosters burn out the core STILL has low TWR since it hasn\u0027t burnt up any fuel and you\u0027ll start losing speed.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-04-11T01:16:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EIf your core has good TWR and you\u0027re using the boosters to give you more delta-V, you should let the boosters burn out before igniting the main engine. That way you\u0027re using your low Isp boosters to lift your higher Isp core.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI tend to put fuel tanks on top of my bootsers(w/ fuel lines into core) so that I can use my core off the launch pad. They are configured to run dry just as the SRBs finish.\u003C/p\u003E\u003Cp\u003EI use boosters a lot. It makes your rocket designs more flexible in their payload capabilities. The \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75592-Beaver-ARM-Craft-Launcher\u0022 rel=\u0022external nofollow\u0022\u003Elifter to this craft\u003C/a\u003E is a good example of the fuel tanks on top of bootsers strategy I use.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-11T02:56:51Z","Content":"\n\u003Cp\u003EI don\u0027t use SRBs that much, as they burn out too soon to be practical in most cases.\u003C/p\u003E\u003Cp\u003EJust before 0.23.5 came out, I was building a bigger Eve lander capable of launching from sea level. Because it had 18 asparagus boosters, its TWR went down too fast if I didn\u0027t drop the spent stages, making it unable to reach the orbit from Kerbin. The simplest solution was to use 12 Rockomax SRBs as the first stage, before starting the main engines.\u003C/p\u003E\u003Cp\u003ENow I\u0027m using SRBs mostly for light payloads, replacing the jet boosters that I find too silly. This is my current crew shuttle, capable of reaching 600 km orbit and returning back to Kerbin:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://www.cs.helsinki.fi/u/jltsiren/ksp/crew_shuttle.jpg\u0022 alt=\u0022crew_shuttle.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI first tried throttling the main engine down when the boosters were attached, but I found that too inefficient. The rocket basically hit a wall when the boosters burned out, as the main engine did not have enough thrust to maintain the ascent rate. It was better to throttle the boosters down, giving the main engine more time to reduce the load, before it has to propel the rocket on its own.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-11T02:59:00Z\u0022 title=\u002204/11/2014 02:59  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 11, 2014\u003C/time\u003E by Jouni\u003C/strong\u003E\n\u003C/span\u003E\n"}]}