{"TopicId":69029,"ForumId":16,"TopicTitle":"Why are parking orbits more efficient?","CreatedByName":"klappertjes","CreatedById":83227,"CreatedDateTime":"2014-04-11T20:31:08Z","PageNum":1,"Articles":[{"CreatedByName":"klappertjes","CreatedById":83227,"CreatedDateTime":"2014-04-11T20:31:08Z","Content":"\n\u003Cp\u003EI have a question about correct/efficient ways to go places. I\u0027m taking going to the Mun as an example here because it\u0027s straightforward for what I\u0027m asking but this can, I assume, be applied to pretty much any destination.\u003C/p\u003E\u003Cp\u003EI see three ways to do this:\u003C/p\u003E\u003Cp\u003E1) Launch. Get into ~80-100km parking orbit. Fumble with manouever nodes until you get a nice encounter with the Mun with low peri and use it.\u003C/p\u003E\u003Cp\u003E2) Wait until the Mun is in the right place of the sky (25 degrees above the horizon?). Launch. Fly straight into your Munar transfer.\u003C/p\u003E\u003Cp\u003E3) Wait until the Mun is somewhere suitable. Launch straight up to apo at 11Mm = Mun encounter\u003C/p\u003E\u003Cp\u003EI tend to use number 1), because I\u0027ve been told (mostly by Scott Manley videos) that this is the most efficient way to do it. Sometimes Manley will do it differently, and remark that [imagine Scottish accent] \u0022... this is of course very inefficient\u0022. I trust his judgment. But I don\u0027t understand why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EIf I get the Oberth effect correctly, you want to burn close to the planet as much as you can. Then surely, merging orbital insertion and Munar transfer (number 2) means you\u0027re doing most of the burning while still ascending, thus burning close to the surface and using Oberth to its fullest.\u003C/p\u003E\u003Cp\u003ESimilarly, using method 3 would do this even more, in my head. Maybe it\u0027s a little silly for the Mun, but certainly for interplanetary transfers, launching straight up at sunset or sunrise makes sense to me. Why waste fuel getting in orbit first?\u003C/p\u003E\u003Cp\u003EI\u0027m almost certain I\u0027m wrong in both cases. Could someone explain to me what I\u0027m missing here and help out a troubled soul? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T10:22:30Z\u0022 title=\u002204/12/2014 10:22  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by klappertjes\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-11T20:37:59Z","Content":"\n\u003Cp\u003EUnfortunately, it\u0027s not \u0022close to the planet\u0022 you want, it\u0027s \u0022at highest velocity.\u0022\u003C/p\u003E\u003Cp\u003ECombining Munar transfer with orbital insertion means you\u0027re fighting kerbin\u0027s gravity the whole time you\u0027re making the transfer burn, and you\u0027re making the transfer burn while at lower velocity.\u003C/p\u003E\u003Cp\u003EBy waiting until you\u0027ve made orbit, you can burn sideways, ignoring kerbin gravity, while oberthing at kerbin orbital velocity.\u003C/p\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2014-04-11T20:38:11Z","Content":"\n\u003Cp\u003ELaunching straight up and burning continuously without doing a gravity turn (which is what I \u003Cem\u003Ethink\u003C/em\u003E you mean by 3) means you\u0027re constantly fighting gravity. Going into a parking orbit first means you can use the momentum you\u0027ve already built up and you needn\u0027t fight gravity for the remainder of the burn, making it more efficient. \u003C/p\u003E\u003Cp\u003EI\u0027d need to do math to prove that, but I haven\u0027t slept all night, so I\u0027ll leave it up to another to either correct me or back me up as necessary. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-04-11T20:38:56Z","Content":"\n\u003Cp\u003EThe Oberth effect is not about making your transfer as close to the planet as possible. It is making your transfer when you\u0027re traveling the fastest. As it happens you\u0027re traveling the fastest when you\u0027re in a low orbit, close to the planet. In a low orbit you\u0027re often traveling faster then when you were during launch.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000CD;\u0022\u003EEdit: Double ninja\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"PUNiSH3R","CreatedById":102377,"CreatedDateTime":"2014-04-11T20:40:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022klappertjes\u0022 data-cite=\u0022klappertjes\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI see three ways to do this:\u003C/p\u003E\u003Cp\u003E1) Launch. Get into ~80-100km parking orbit. Fumble with manouever nodes until you get a nice encounter with the Mun with low peri and use it.\u003C/p\u003E\u003Cp\u003E2) Wait until the Mun is in the right place of the sky (25 degrees above the horizon?). Launch. Fly straight into your Munar transfer.\u003C/p\u003E\u003Cp\u003E3) Wait until the Mun is somewhere suitable. Launch straight up to apo at 11Mm = Mun encounter\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1. Parking orbit is more efficient if you\u0027re not computing transfer angles; you can brute force an encounter, but you\u0027ll burn massive dV depending on the angles. Parking orbit is a compromise position; technically you don\u0027t need the \u0026gt;72km periapsis to get there, but it makes transfers easier once you\u0027re used to it and you\u0027re automatically moving faster, so the Oberth is more pronounced.\u003C/p\u003E\u003Cp\u003E2. Mun in the \u0027right place\u0027 is on the horizon (90 degree intercept angle). This is what I usually do. Makes a gravity assist off the Mun for interplanetary transfers way easy as well.\u003C/p\u003E\u003Cp\u003E3. Declines any benefit of the Oberth Effect, see Vexx above.\u003C/p\u003E\u003Cp\u003EEDIT: Holy guac, QUAD LASER NINJA...\u003C/p\u003E\u003Cp\u003E[No one can defeat the quad laser...]\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-11T20:44:16Z\u0022 title=\u002204/11/2014 08:44  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 11, 2014\u003C/time\u003E by PUNiSH3R\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-04-11T20:41:52Z","Content":"\n\u003Cp\u003EWith Method 3 you are using much more dV fighting gravity. As soon as you stop firing your engines, if you don\u0027t have any horizontal velocity, will result in you falling back to Kerbin. If you do manage to get a Munar Encounter you still need to have enough fuel to land and get back.\u003C/p\u003E\u003Cp\u003EWith Method 2, if you miss your launch window you have to wait until the next launch window, which wouldn\u0027t be for another Kerbin month.\u003C/p\u003E\u003Cp\u003EWith Method 1, if you miss your launch window it is a very short wait (No more than about 30 earth minutes depending on altitude) not to mention you aren\u0027t wasting lots of dV fighting gravity and aerodynamics.\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-04-11T20:46:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022PUNiSH3R\u0022 data-cite=\u0022PUNiSH3R\u0022\u003E\u003Cdiv\u003E...\u003Cp\u003EEDIT: Holy guac, QUAD LASER NINJA...\u003C/p\u003E\u003Cp\u003E[No one can defeat the quad laser...]\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t worry, it wasn\u0027t a quad ninja. It was just a triple ninja. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003E...\u003Cp\u003EWith Method 2, if you miss your launch window you have to wait until the next launch window, which wouldn\u0027t be for another Kerbin month.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t you mean a Kerbin day, a mere six hours?\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-04-11T20:52:17Z","Content":"\n\u003Cp\u003EThe most efficient way is probably to ascend normally, but continue burning prograde until you get the apoapsis high enough. The timing is hard to get exactly right, so in practice it may be more efficient to first circularize to a low orbit, and then do another burn at the right time to the right direction.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-11T20:52:56Z","Content":"\n\u003Cp\u003EA parking orbit is NOT more efficient. It\u0027s just a heck of a lot easier to do the math. (I use them a lot in my kOS missions for that reason).\u003C/p\u003E\u003Cp\u003EOf your three options, #2 is the most efficient (although your figure of 25 degrees is way off. You want the angle between the longitude of the KSC laucnhpad and the longitude of Mun (if you draw a line from Mun down to Kerbin and imagine the logitude where that hits Kerbin) of about 110 to 120 degrees at T zero of your launch. It\u0027s hard to be more precise than \u0022110 to 120 degrees\u0022 because the exact number depends on your choice of how you pilot your ship into orbit. Usually if you start at 110 to 120 degrees, then you\u0027ll be hitting the transfer point at about 90 to 100 degrees, which is the right spot.\u003C/p\u003E\u003Cp\u003E(EDIT: The boldface bit below is the real reason parking orbits are usually less efficient.)\u003C/p\u003E\u003Cp\u003EWhat is more efficient is to act \u0022as if\u0022 you were going to do a parking orbit, but instead of \u003Cstrong\u003Ethat bit where you shut off the engines at an altitude of about 50-60km and coast to apoapsis\u003C/strong\u003E and then turn them on again to finish circularizing, you just keep burning anyway, raising your apoapsis very high on the other side, stretching it up to the Mun. The result is an elliptical transfer orbit who\u0027s periapsis behind you can be low enough to actually dip into Kerbin\u0027s atmosphere. That\u0027s what makes it more efficient. If you go to a parking orbit first, then you can\u0027t get a transfer orbit with a periapsis that low. An orbit with apoapsis at 12 million meters and a peirapsis at 80000 meters takes more energy to achieve than one with an apoapsis of 12 million meters but a periapsis of 50000 ro 70000 meters.\u003C/p\u003E\u003Cp\u003EDon\u0027t aim TOO low because then you\u0027re still fighting atmosphere, but your speed at a circular orbit of 60000m is higher than your speed at a circular orbit of about 80000m. By aiming to go from 60000m to the Mun, as opposed to going from 80000m to the Mun, you are aiming to use a higher speed at your transfer point, thus taking advantage of the oberth effect, which is strong enough to more than compensate for the small drag caused by the thin air of 60000m.\u003C/p\u003E\u003Cp\u003EThe reason real space programs use parking orbits is because the loss of efficiency of that versus a direct burn isn\u0027t *that* large, but a parking orbit gains you the ability to run tests and diagnostic checks before you pass the point of no return and leave Earth orbit. i.e. For Apollo it allowed time to make sure the craft was set up right and configured properly before pushing on to the moon. Also, it puts you more in control with the precision to decide when to make the burn.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-11T21:05:08Z\u0022 title=\u002204/11/2014 09:05  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 11, 2014\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Amaroq","CreatedById":57607,"CreatedDateTime":"2014-04-11T22:10:53Z","Content":"\n\u003Cp\u003EThe \u0022most efficient\u0022 approach is to burn while at periapsis. Which means, a very short prograde burn at periapsis, shut off, loop around, do it again .. until eventually, many orbits later, you\u0027d have your intercept (or escape). Nobody does that -- KSP players because it would be terribly boring, and real programs because the mass required for the extra life support would exceed the gain.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-11T22:47:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Amaroq\u0022 data-cite=\u0022Amaroq\u0022\u003E\u003Cdiv\u003EThe \u0022most efficient\u0022 approach is to burn while at periapsis. Which means, a very short prograde burn at periapsis, shut off, loop around, do it again .. until eventually, many orbits later, you\u0027d have your intercept (or escape). Nobody does that -- KSP players because it would be terribly boring, and real programs because the mass required for the extra life support would exceed the gain.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s also impossible to achieve that optimization. The optimal use of the method you\u0027re talking about would require dividing the burn into an infinite number of individual burns of duration zero seconds each, which is obviously impossible. So how close to that do you want to get? 60 orbits of 10 second burns each? 30 orbits of 20 second burns each, 10 orbits of 60 seconds each? 1 burn of 5 minutes? It\u0027s not just KSP players that refuse to optmize it all the way. EVERYone does because it\u0027s not practical to take an infinite number of orbits to accomplish the burn. It\u0027s always a trade off between boredom and practicality versus efficiency, even in real space programs. Even the recent probe from India that uses this technique only does it to the extent of using 4 iterations of the method, rather than say 10 or 20 or so.\u003C/p\u003E\n"},{"CreatedByName":"Mesons","CreatedById":76697,"CreatedDateTime":"2014-04-11T23:24:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EA parking orbit is NOT more efficient. It\u0027s just a heck of a lot easier to do the math. (I use them a lot in my kOS missions for that reason).\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EWhat is more efficient is to act \u0022as if\u0022 you were going to do a parking orbit, but instead of \u003Cstrong\u003Ethat bit where you shut off the engines at an altitude of about 50-60km and coast to apoapsis\u003C/strong\u003E and then turn them on again to finish circularizing, you just keep burning anyway, raising your apoapsis very high on the other side, stretching it up to the Mun. The result is an elliptical transfer orbit who\u0027s periapsis behind you can be low enough to actually dip into Kerbin\u0027s atmosphere. That\u0027s what makes it more efficient. If you go to a parking orbit first, then you can\u0027t get a transfer orbit with a periapsis that low. An orbit with apoapsis at 12 million meters and a peirapsis at 80000 meters takes more energy to achieve than one with an apoapsis of 12 million meters but a periapsis of 50000 ro 70000 meters.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECouldn\u0027t have said it better myself. One thing to keep in mind, though, is that when you have a lower periapsis, your orbital speed at apoapsis is less. This affects how much dV you will need to reduce your velocity in the Mun\u0027s SOI if that is your plan. The speed at apoapsis and a non-instantaneous burn are the reasons why your option #3 (burn radially the whole way) is less efficient. Even if you could do your burn very fast once you\u0027re above most of the atmosphere, when you reach apoapsis near the Mun, you will enter the Mun\u0027s SOI with its orbital speed, whereas if you had an easterly orbit your entering speed will be lower since you\u0027re moving the same direction as the Mun.\u003C/p\u003E\u003Cp\u003EFor interplanetary burns, if you can do your whole transfer burn high in the atmosphere in a matter of seconds, option #3 is the most efficient because no energy is wasted on gaining angular momentum. Launching at just before sunrise or just after sunset would be optimal (since you will have some small amount of angular momentum thanks to Kerbin\u0027s rotation). Unfortunately, since interplanetary transfer burns tend to take orders of magnitude longer than a second, option #3 is virtually never the best choice. The problem is you are continually losing kinetic energy as you move farther out from Kerbin\u0027s surface, so your benefits from the Oberth effect are continually decreasing. You would need to finish your whole burn before reaching your high atmosphere end-burn altitude (from option #2) in order to gain an advantage out of choosing this launch option.\u003C/p\u003E\u003Cp\u003EPersonally, I always choose to go with parking orbits because I can\u0027t bear to look up or calculate great launch windows. I work all day, I don\u0027t want to have to work to play Kerbal too, and the extra dV I can just engineer into my rockets and deal with the extra encumbrance of flying unwieldy rockets.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-11T23:25:18Z\u0022 title=\u002204/11/2014 11:25  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 11, 2014\u003C/time\u003E by Mesons\u003C/strong\u003E\n\u003Cbr\u003EWebsite problem caused double-post\n\u003C/span\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2014-04-11T23:33:04Z","Content":"\n\u003Cp\u003EOptions #1 and #2 aren\u0027t as far apart as people tend to think if you\u0027re doing them efficiently. Because of the way orbital mechanics work, you\u0027re going to get the most efficiency if you focus on horizontal velocity rather than vertical velocity once you\u0027re far enough out of the atmosphere. This is the point of the gravity turn. Now, if you\u0027re doing that, at some point you\u0027re going to be in LKO even if you don\u0027t aim for it because you\u0027ll be moving at the right speed to be in an orbit. The biggest difference is that #2 is going to have a lower periapsis since the periapsis doesn\u0027t have to be out of the atmosphere, but not hugely so because if you have too low of a periapsis, you\u0027re running into the gravity losses of #3. If you\u0027re minimizing your gravity losses, the periapsis will be in the mid to upper atmosphere at the lowest.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-12T02:40:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EOptions #1 and #2 aren\u0027t as far apart as people tend to think if you\u0027re doing them efficiently. Because of the way orbital mechanics work, you\u0027re going to get the most efficiency if you focus on horizontal velocity rather than vertical velocity once you\u0027re far enough out of the atmosphere. This is the point of the gravity turn. Now, if you\u0027re doing that, at some point you\u0027re going to be in LKO even if you don\u0027t aim for it because you\u0027ll be moving at the right speed to be in an orbit. The biggest difference is that #2 is going to have a lower periapsis since the periapsis doesn\u0027t have to be out of the atmosphere, but not hugely so because if you have too low of a periapsis, you\u0027re running into the gravity losses of #3. If you\u0027re minimizing your gravity losses, the periapsis will be in the mid to upper atmosphere at the lowest.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s true that the optimal way puts your periapsis in the upper atmosphere not the lower atmosphere, but that\u0027s got nothing to do with gravity losses. It\u0027s because of drag losses. Go somewhere without air and the most efficient takeoff is one that is as low as possible, just barely enough to clear the terrain. The most effecient trip to orbit from the Mun, for example, is to make an orbit of only 8km, skimming along the ground just above the highest mountain peak. The primary reason not to do that in game is purely the boredom problem that the game won\u0027t let you time warp very fast when you\u0027re low to the ground.\u003C/p\u003E\n"},{"CreatedByName":"klappertjes","CreatedById":83227,"CreatedDateTime":"2014-04-12T10:21:40Z","Content":"\n\u003Cp\u003EWhoa. Never had this much response to a question before \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\u003Cp\u003EYou all had me on \u0022Oberth effect is not about close to the planet, but at high speed\u0022 but the rest has definitely been an interesting and enlightening read. I\u0027ll dismiss method 3 (by which I meant what Vexx32 said) as the nonsense it is, and proceed to do 1, or 2 if I\u0027m feeling good about my timing.\u003C/p\u003E\u003Cp\u003EThanks a lot everyone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T10:23:55Z\u0022 title=\u002204/12/2014 10:23  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by klappertjes\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2014-04-12T18:40:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EIt\u0027s true that the optimal way puts your periapsis in the upper atmosphere not the lower atmosphere, but that\u0027s got nothing to do with gravity losses. It\u0027s because of drag losses. Go somewhere without air and the most efficient takeoff is one that is as low as possible, just barely enough to clear the terrain. The most effecient trip to orbit from the Mun, for example, is to make an orbit of only 8km, skimming along the ground just above the highest mountain peak. The primary reason not to do that in game is purely the boredom problem that the game won\u0027t let you time warp very fast when you\u0027re low to the ground.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I didn\u0027t explain the point there very clearly.\u003C/p\u003E\u003Cp\u003EThe comment about gravity losses was dealing with the case of \u0022don\u0027t raise your periapsis, just put your apoapsis at the height of the moon.\u0022 Unless you\u0027ve got an insanely high thrust, this usually involves focusing on vertical or prograde thrust by following a very weak gravity turn.\u003C/p\u003E\u003Cp\u003ELet\u0027s see if I can explain it better.\u003C/p\u003E\u003Cp\u003EFor the \u0022efficient direct ascent\u0022 Munar transfer, you\u0027d start off with a regular gravity turn, and when you are building horizontal velocity, rather than stopping when you\u0027ve got an apoapsis in the LKO orbital range, you continue until your apoapsis is at Munar height. My main point there is that if you\u0027re doing it efficiently, at some point before you achieve an apoapsis at Munar height, your apoapsis is at LKO height and your periapsis will probably be above (or at) the surface rather than below the surface of the planet.\u003C/p\u003E\u003Cp\u003EThe upper vs lower atmosphere comment was more about the fact that I generally find that if my periapsis is still below the upper atmosphere when I\u0027m raising my apoapsis for a transfer then something is wrong, because I should be raising my periapsis until it becomes my apoapsis in that case. If I\u0027m ahead of my periapsis approaching my apoapsis and burning for a transfer to the Mun, then the drag losses I\u0027ll encounter at my periapsis won\u0027t matter since my orbit will be changing before I get there.\u003C/p\u003E\u003Cp\u003EI can actually explain the point using an \u0022efficient return from the Mun\u0022 type mission, which doesn\u0027t involve drag losses, where the goal is to go directly from the Munar surface to a transfer orbit back to Kerbin without making a Munar orbit. Without atmospheric drag losses, the most efficient ascent is, as you said, just enough vertical thrust to keep you from colliding with the terrain. So at first, you\u0027re building up vertical velocity. This doesn\u0027t last long, I\u0027m usually starting my gravity turn as soon as I have vertical motion. Then you\u0027re applying just enough vertical thrust to maintain your apoapsis while you raise your periapsis. At some point, you\u0027ll have raised your periapsis to the point it becomes the apoapsis and your current position becomes the periapsis. Even though you\u0027re not stopping there, you\u0027re now in orbit of the Mun. \u003C/p\u003E\u003Cp\u003EIf you were to stop there, orbit, then continue raising your apoapsis when you arrive back at your periapsis, you have not cost yourself any efficiency. You were already in an orbital trajectory, so it cost nothing to orbit.\u003C/p\u003E\u003Cp\u003EI think the point I\u0027m trying to focus on is that even with a gravity turn, a direct ascent via raising your apoapsis without raising your periapsis isn\u0027t going to be efficient due to gravity losses, whereas raising your periapsis until it becomes your apoapsis and then continuing to raise it until it reaches a Munar transfer orbit passes through the point of being a low kerbin orbit, so it isn\u0027t necessarily more efficient than a launch to orbit then do a transfer burn. All you\u0027re really doing is combining your circularization burn with your transfer burn. You can save a little delta-v by having this circularization point being in the upper atmosphere since you won\u0027t be there long enough to accumulate significant aerodynamic drag losses, but having the circularization point in the lower atmosphere means you\u0027d have more aerodynamic drag losses which would nullify the benefit of not raising your periapsis higher (in this case, you\u0027re right, it would be because of the atmospheric drag).\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-13T08:10:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003ESorry, I didn\u0027t explain the point there very clearly.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou did. I just don\u0027t think you\u0027re correct. The atmospheric drag is small enough in the upper atmosphere that aiming to circularize at, say, 55000m instead of 70000m gives better results. Granted, you can\u0027t maintain that circular orbit at 55000m because even the thin atmosphere is enough to slowly degrade the orbit, but that\u0027s sort of my point. If you\u0027re doing a direct burn you don\u0027t have to maintain it circularized. You only have to if you\u0027re going to establish a stable parking orbit first. If you\u0027re doing a direct burn then you\u0027re only going to circularize temporarily. As you continue to push through circularization - periapsis swaps with apoapsis and you don\u0027t stop burning, you keep going to push the apopasis all the way up to the Mun. Thus you have a transfer ellipse drawn from 55000m to 12 million meters instead of one drawn from 70000m up to 12 million meters.\u003C/p\u003E\u003Cp\u003EWhat the lack of parking orbit buys you is the ability to circularize while still at a lower altitude because you don\u0027t need that circularized state to be stable. You\u0027ll push right past circularization and into transferring, which will pull you up out of the atmosphere very soon anyway. A parking orbit demands you be higher than that at the point you begin your transfer burn, and therefore you\u0027re doing it from a slower starting velocity.\u003C/p\u003E\n"},{"CreatedByName":"Aedile","CreatedById":104353,"CreatedDateTime":"2014-04-13T10:19:31Z","Content":"\n\u003Cp\u003EThe only thing number 3 is good for, is saving on mission time, really lousy way to do things.\u003C/p\u003E\u003Cp\u003EOnly time I do vertical launches, is return from my mun base, which is nicely positioned to point retrograde (tidally locked Mun, kethane rifinery), and is manly for the ease of use(no MJ).\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2014-04-13T19:49:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EYou did. I just don\u0027t think you\u0027re correct.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I\u0027m still failing to communicate in some manner, because every point you made there is not only something I agree with but something I said (or at least tried to say).\u003C/p\u003E\u003Cp\u003EIf you have a lower atmosphere periapse that you\u0027re not raising, then you\u0027re either burning at the horizon doing the #2 launch low enough that atmospheric drag will play a major role (which is what I think you\u0027re thinking I\u0027m talking about), or you\u0027re burning prograde higher than the horizon, at which point you\u0027re doing a #3 launch, which will involve heavy gravity losses (which is what I was trying to say).\u003C/p\u003E\u003Cp\u003EOr maybe I\u0027m not making my original disagreement clear enough, because the point I was trying to make isn\u0027t contradicting anything brought up explicitly in this thread. Of all the people that I\u0027ve seen talk about the efficiency of the #2 launch style, you\u0027re the first one to acknowledge that the savings come from the fact that you\u0027re possibly effectively circularizing at a lower altitude, one that wouldn\u0027t be maintainable (for long) with a #1 style launch. The people I\u0027ve seen previously discuss the efficiency of this launch style seem to think the improved efficiency comes from them not circularizing, which they still are if they\u0027re doing this right, they\u0027re just not stopping the burn once they\u0027ve circularized. \u003C/p\u003E\u003Cp\u003EI\u0027m not saying that it isn\u0027t more efficient, I\u0027m disagreeing (with them) on why it\u0027s more efficient, and in some cases, the amount of delta-v that would be saved this way. I haven\u0027t done the math, but I think you\u0027d be hard pressed to save more than 100 delta-v on this, and only about 30-40 m/s of that will be post-circularization transfer burn. I\u0027ve seen people that think this method saves them however much delta-v it takes them to circularize and that just isn\u0027t the case for \u0022typical\u0022 launch profiles.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-13T20:08:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EWell, I\u0027m still failing to communicate in some manner, because every point you made there is not only something I agree with but something I said (or at least tried to say).\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI\u0027m not saying that it isn\u0027t more efficient, I\u0027m disagreeing (with them) on why it\u0027s more efficient\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETHAT is what you didn\u0027t communicate. Up until now you kept saying that the people saying #2 is most efficient were incorrect. At no point did you (A) mention that they were correct but for the wrong reason, or (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E mention that you were arguing with other people\u0027s explanations rather than mine. As the original proponent of that position in this thread was me, that\u0027s kind of a necessary distinction to make.\u003C/p\u003E\u003Cp\u003EAnd the reason I didn\u0027t mention that you push past circularization to get to a transfer orbit at the start is that I wasn\u0027t assuming people didn\u0027t already know this. It\u0027s obvious.\u003C/p\u003E\u003Cp\u003EI think you were being unnecessarily condescending of people because the explanation you\u0027re claiming you were arguing against is one I haven\u0027t seen anyone arguing for.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-13T20:14:20Z\u0022 title=\u002204/13/2014 08:14  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 13, 2014\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-04-14T08:51:01Z","Content":"\n\u003Cp\u003EIn my opinion the most efficient method would be to launch, perform a perfect gravity turn and keep burning horizontally to kerbin until your perfectly timed intercept. That would be the most time efficient (time in space, not time in waiting on the pad for the correct launch time) but it wouldn\u0027t be any more fuel efficient than entering a parking orbit and waiting for the right window.\u003C/p\u003E\n"},{"CreatedByName":"Mesons","CreatedById":76697,"CreatedDateTime":"2014-04-14T17:01:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Aedile\u0022 data-cite=\u0022Aedile\u0022\u003E\u003Cdiv\u003EThe only thing number 3 is good for, is saving on mission time, really lousy way to do things.\u003Cp\u003EOnly time I do vertical launches, is return from my mun base, which is nicely positioned to point retrograde (tidally locked Mun, kethane rifinery), and is manly for the ease of use(no MJ).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery clever! That\u0027s a great idea!\u003C/p\u003E\n"},{"CreatedByName":"Eric S","CreatedById":57117,"CreatedDateTime":"2014-04-14T19:03:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EAnd the reason I didn\u0027t mention that you push past circularization to get to a transfer orbit at the start is that I wasn\u0027t assuming people didn\u0027t already know this. It\u0027s obvious.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EObvious to you and to me, but like I said, I\u0027ve seen more people try to justify the efficiency of this launch profile by stating that you\u0027re not wasting delta-v circularizing than that actually understood where the efficiency comes from. Then again, there are people that have argued that it\u0027s obvious that #3 should be the most efficient launch profile. Orbital mechanics aren\u0027t intuitive to most people, so the term obvious may not fit as well as it does in everyday life.\u003C/p\u003E\u003Cp\u003EI never said you couldn\u0027t save delta-v doing this. I did say that it wasn\u0027t necessarily more efficient (if your point of circularization is above the atmosphere being the exception to improved efficiency) and that the difference between the two wasn\u0027t as strong as I\u0027ve seen argued.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-04-17T11:07:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Eric S\u0022 data-cite=\u0022Eric S\u0022\u003E\u003Cdiv\u003EObvious to you and to me, but like I said, I\u0027ve seen more people try to justify the efficiency of this launch profile by stating that you\u0027re not wasting delta-v circularizing than that actually understood where the efficiency comes from. Then again, there are people that have argued that it\u0027s obvious that #3 should be the most efficient launch profile. Orbital mechanics aren\u0027t intuitive to most people, so the term obvious may not fit as well as it does in everyday life.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI said it was obvious because you don\u0027t need to know one bit of orbital mechanics. Just the basic geometric picture shows it. If you imagine a hoop of of weak bendy metal in the shape of an ellipse, and you grab it by the short axis and pull it apart to make it stretch the other way, clearly it\u0027s going to pass through circular on the way there.\u003C/p\u003E\n"}]}