{"TopicId":69064,"ForumId":16,"TopicTitle":"Attempting to build a rover, but I keep losing control while flying it","CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2014-04-12T01:35:28Z","PageNum":1,"Articles":[{"CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2014-04-12T01:35:28Z","Content":"\n\u003Cp\u003EWell I finally unlocked some wheels (I\u0027m extremely slow) and so attempted to build a rover. After looking a little around found out that some people don\u0027t build rovers separately, but as part of the lander. So I went to try it in an attempt to maybe save some time in a trip to Minmus and the result is this monstrosity that we\u0027ll call a rover to give it some sort of denomination.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/KsHCcc3\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/KsHCcc3l.jpg\u0022 alt=\u0022KsHCcc3l.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/NkYY1AM\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/NkYY1AMl.jpg\u0022 alt=\u0022NkYY1AMl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/gLjyZav\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/gLjyZavl.jpg\u0022 alt=\u0022gLjyZavl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor now ignore the parachutes and the ladder, I placed those to do some testing in Kerbin.\u003C/p\u003E\u003Cp\u003ENow I went to try it out so in case of emergency I don\u0027t leave a Kerbal stranded in Minmus. When I turn on the engines the rover lifts of (success). However even with SAS on it tends to tilt a little to the front (maybe its because of the position of the center of mass?), but thats ok, its not biggie. The problem comes when I try to correct that tilt or even turn. I pretty much lose control of the rover and have to use rcs to regain it, which tends to be a little expensive. Since I will need that mono propellant in order to reunite with the main body.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/WXnIpKo\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/WXnIpKol.jpg\u0022 alt=\u0022WXnIpKol.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/JWRKwTE\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/JWRKwTEl.jpg\u0022 alt=\u0022JWRKwTEl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAny ideas of how to fix this loss of control?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-12T03:51:08Z\u0022 title=\u002204/12/2014 03:51  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 12, 2014\u003C/time\u003E by Jofe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2014-04-12T01:49:48Z","Content":"\n\u003Cp\u003EAs well as the CoM marker, you can also get a Centre Of Thrust marker. Try lining the two up by moving the engines a bit.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-04-12T02:03:38Z","Content":"\n\u003Cp\u003EAdditionally, I don\u0027t see your navball but I would say that sometimes the orientation of your controlling part can lead to the craft interpreting your inputs differently than you intended.\u003C/p\u003E\u003Cp\u003ETake this VTOL for example:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZIw7AfM.jpg\u0022 alt=\u0022ZIw7AfM.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe heading shows 135, which is definitely not the direction this craft is pointing. (Just trust me on that.) And having the navball oriented this way makes it difficult to control since control will be in an inconvenient axis. If the craft starts to tip over, yawing or pitching will actually cause it to roll around sort of flat.\u003C/p\u003E\u003Cp\u003ENow look at the same craft. I selected \u0022control from here\u0022 on the probe core on top.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Z0g5Kdz.jpg\u0022 alt=\u0022Z0g5Kdz.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow if I yaw or pitch the craft, the flat plate design will actually tip in different directions. If I roll, it will roll around the center of the circle (looking straight down in the picture).\u003C/p\u003E\u003Cp\u003EIf you already have all that sorted out, the other thing it might be is that the SAS is just barely able to control your craft. (Again, I can\u0027t see your trim indicators.) When you put just a little input in, the barely in control SAS stops providing input and then takes a second to catch up once you stop giving input. So your craft tips off further and the SAS isn\u0027t able to catch up. That\u0027s why turning on the RCS helps out, because it gives enough added authority to fix the problem.\u003C/p\u003E\u003Cp\u003ESo...\u003C/p\u003E\u003Cp\u003E1) Fix your CoT so that it\u0027s directly below your CoM. Or at least in a good enough spot over the range of CoM movement.\u003C/p\u003E\u003Cp\u003E2) Add another reaction wheel.\u003C/p\u003E\u003Cp\u003EAlso, be advised that rovers tend to be difficult to control on Minmus because of the low gravity. Also, if your craft has enough thrust to lift off of Kerbin, you might find yourself accidentally in orbit around Minmus more often than you\u0027d like.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-04-12T02:13:53Z","Content":"\n\u003Cp\u003EI suggest \u003Ca href=\u0022http://kerbalspaceprogram.com/rcs-build-aid-v0-2/\u0022 rel=\u0022external nofollow\u0022\u003ERCS Build Aid\u003C/a\u003E, it can show you your Dry CoM, your Wet CoM, as well as your engines and the torque they produce on your craft, allowing you to get the perfect VTOL.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-04-12T02:36:38Z","Content":"\n\u003Cp\u003EJust realize that fully dry CoM and fully wet CoM might not be your worst case shift in the CoM. Especially with that fuel tank stacked below the science jr (however it is you feed that one out).\u003C/p\u003E\n"},{"CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2014-04-12T02:53:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003ESnip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESuccess! (or so it seems so far). I followed yours and RedDwarfIV advise and now it flies straight (mostly). I added a probe (not pictured because apparently I uploaded the wrong image) to be able to orientate the navball properly for flight and I think it shifts the weight a little to the side but its not very noticeable.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/ld0Txzy\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/ld0Txzyl.jpg\u0022 alt=\u0022ld0Txzyl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso had some trouble balancing the CoM around the CoT. As noted on the image had to reduce the quantities of fuel and oxidizer and then lock them to not risk having the CoM moving when its consumed.\u003C/p\u003E\u003Cp\u003EAlso added a reaction wheel and extremely easy to control when compared to what I had previously.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/Rq5q4sJ\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Rq5q4sJl.jpg\u0022 alt=\u0022Rq5q4sJl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/4csrIBI\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/4csrIBIl.jpg\u0022 alt=\u00224csrIBIl.jpg\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso on the last point. How effective would be to limit thrusters so I don\u0027t fly to orbit when barely using them. Its just that I don\u0027t want a stranded Kerbal. So I just usually overshoot it to not risk it.\u003C/p\u003E\u003Cp\u003EThanks for the help.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-04-12T03:13:48Z","Content":"\n\u003Cp\u003EOne does not simply fly a rover...\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-04-12T11:27:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jofe\u0022 data-cite=\u0022Jofe\u0022\u003E\u003Cdiv\u003ESuccess! \u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EAlso on the last point. How effective would be to limit thrusters so I don\u0027t fly to orbit when barely using them. Its just that I don\u0027t want a stranded Kerbal. So I just usually overshoot it to not risk it.\u003C/p\u003E\u003Cp\u003EThanks for the help.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome! Glad it worked out for you. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI don\u0027t have much experience with flying rovers on Minmus, but it\u0027s effectiveness really depends on how you plan to drive/fly it. If the rockets are there mainly to land it, rescue itself from inadvertent orbit, and suborbital hops then tweaking the thrust will probably work out well. If you\u0027re going to use rockets for all matter of fine tuning, then it might be tougher and you\u0027ll likely want to really reduce the thrust.\u003C/p\u003E\u003Cp\u003EDriving rovers on Minmus can be tricky too. They bounce a lot and sometimes send you hopping along higher/further along than you want. Some people simply use RCS to help with that. Some even fire RCS straight up (so it\u0027s pushing the craft down) to keep it planted on the ground.\u003C/p\u003E\u003Cp\u003EThere are lots of options, but the only truly useful advice is to build something and go give it a try! Then tweak your design to do what you want. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jofe","CreatedById":101640,"CreatedDateTime":"2014-04-12T20:36:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Clockwork13\u0022 data-cite=\u0022Clockwork13\u0022\u003E\u003Cdiv\u003EOne does not simply fly a rover...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDoesn\u0027t matter. Will try anyway \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/r65l4dw\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/r65l4dwl.png\u0022 alt=\u0022r65l4dwl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E(Not the best image since its against the light but it makes it a little more dramatic)\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003ESnip\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELanding wasn\u0027t very difficult. The rockets worked very well even without limiting them. Just gave them a little thrust and that was enough to reduce my vertical speed without making me go the other way. One funny thing that happened was that I got distracted on an attempt and landed too fast. The rover didn\u0027t explode but it lost all the wheels. Normally this isn\u0027t a problem, but due to the low gravity repairing a single one would send it flying halo tank flipping style.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/R7nQufd\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/R7nQufdl.png\u0022 alt=\u0022R7nQufdl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAnother weird (well comparing it to normal circumstances) was that the back wheels would tend to lift just from going down a hill, they wouldn\u0027t go down even with rcs. I had to lift of a little (a couple of meters) in order to touch the ground with the four wheels again. (Landed on the dark side so had to tweak the image a little or it was just barely visible)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/CPNn8od\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/CPNn8odl.png\u0022 alt=\u0022CPNn8odl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELifting up and making into orbit was easy and in a couple of hours the rover was reunited with the main ship with a lot of fuel to spare.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/Dwhktus\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Dwhktusl.png\u0022 alt=\u0022Dwhktusl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/Qn2KEHW\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Qn2KEHWl.png\u0022 alt=\u0022Qn2KEHWl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/jmj6uH2\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/jmj6uH2l.png\u0022 alt=\u0022jmj6uH2l.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThanks again.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-04-12T23:51:34Z","Content":"\n\u003Cp\u003ESweet! I\u0027m always excited to see people hit their goals. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ETwo thumbs up and thanks for sharing!\u003C/p\u003E\u003Cp\u003EBy the way, that VTOL I posted earlier also went to Minmus and back with four of those small radially mounted rockets as an SSTO. (Although it\u0027s not a rover.) They aren\u0027t great on the gas mileage but they sure are small.\u003C/p\u003E\n"}]}