{"TopicId":69661,"ForumId":16,"TopicTitle":"Dres (NO MODS)","CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-17T17:54:32Z","PageNum":1,"Articles":[{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-17T17:54:32Z","Content":"\n\u003Cp\u003EI am tryin to fly to dres, land, and return. I was able to get there but it would take so much delta v to get a good orbit around dres to drop my lander and keep my tug in the orbit that i would have no fuel left to get back. I have to atomic motors and it said it would take me 4200 delta v (46min) to get my orbit. Im lookin for any advice and pic are really appreciated. ( NO MODS PLZ).\u003C/p\u003E\u003Cp\u003EThank you\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-19T00:56:31Z\u0022 title=\u002204/19/2014 12:56  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 19, 2014\u003C/time\u003E by Billyk88\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-17T18:14:27Z","Content":"\n\u003Cp\u003EIf the destination is an airless world (no aerobraking) without moons (no gravity assists), there aren\u0027t any fancy flight techniques you can use, and it\u0027s almost entirely a matter of ship design. If that\u0027s what you\u0027re asking about, here\u0027s a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/48610-My-roundtrip-ships-for-download\u0022 rel=\u0022external nofollow\u0022\u003Eship you can download \u003C/a\u003Ewhich has made several interplanetary trips while hauling significant cargoes, and it is capable of \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57562-Breaking-News-from-Dres-Mission%21\u0022 rel=\u0022external nofollow\u0022\u003Evisiting Dres\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-04-17T18:22:31Z","Content":"\n\u003Cp\u003EI usually use two ships docked together: a Mun-capable lander with some RCS, and a larger transfer stage with NERVA engines. Once you burn into orbit, detach the lander and touch down on Dres. When you\u0027re done there, return to orbit and re-dock with the transfer stage for the trip home.\u003C/p\u003E\n"},{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-17T18:45:17Z","Content":"\n\u003Cp\u003EDo any of those moded? Can u post some pics plz\u003C/p\u003E\n"},{"CreatedByName":"ScallopPotato","CreatedById":98794,"CreatedDateTime":"2014-04-17T18:58:37Z","Content":"\n\u003Cp\u003ENone of them look like they have any mods installed.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-17T18:59:38Z","Content":"\n\u003Cp\u003EIf you are asking about mine, I am a stock-only purist. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E No mods at all. And the links are picture-iffic.\u003C/p\u003E\n"},{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-17T19:05:53Z","Content":"\n\u003Cp\u003EOk kool can yall post pics of ur ships plz\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-17T19:12:24Z","Content":"\n\u003Cp\u003EIf your orbital insertion needs that much delta-v, you might have to be content with a flyby for now. Get them back home and see if you can get a better intercept next time?\u003C/p\u003E\n"},{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-17T19:33:13Z","Content":"\n\u003Cp\u003EMy intercept perapsis was 433,000m which aint the greatest but could of been way worse.\u003C/p\u003E\n"},{"CreatedByName":"FenrirWolf","CreatedById":72121,"CreatedDateTime":"2014-04-17T19:45:08Z","Content":"\n\u003Cp\u003ERight, but it\u0027s more the timing of your Kerbin departure and phase angle that determine how fast you\u0027ll be going when you intercept another planet. When I encountered Dres on my last mission I only had to slow down by around 2000m/s instead of 4000\u003C/p\u003E\n"},{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-17T22:36:47Z","Content":"\n\u003Cp\u003EOh ok i really need to learn more about kerbin depart and phase angles. Thank you everyone\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-04-18T00:06:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Billyk88\u0022 data-cite=\u0022Billyk88\u0022\u003E\u003Cdiv\u003EOh ok i really need to learn more about kerbin depart and phase angles. Thank you everyone\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGive \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003Ethis\u003C/a\u003E a try. It was a life saver for me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-04-18T00:17:52Z","Content":"\n\u003Cp\u003EWhenever I go to another planet, I send two things: the tug/lander combo (the tug has a lab, 4 NERVAs and enough fuel to get into a stable orbit around the destination) and a refuelling ship (terribly simple - one probe core, a large SAS (buffed with TweakableEverything to have more power), a couple of RTGs to power it (so no batteries or panels), and two KAS pipe connectors. The same amount of fuel as the tug, but with the lander and lab\u0027s weight in fuel too, with a bit extra gives about 10km/s of dV). Send both off and when I get there, rendezvous, transfer fuel across (I could do it by docking of course but after so long spent in the ship, I like to give the little guys some time to stretch their legs) and I have enough fuel to get home. I usually don\u0027t bother getting a stable orbit around Kerbin - the lander has space for 3, but only one pilot. The lab guys get in the capsule and when I get close to Kerbin encounter , I put the periapsis basically on the ground (hooray for no DRE!) and decouple. \u003C/p\u003E\u003Cp\u003EAll completely doable without mods but they do make things easier (launching the 40t refueller or lab/tug in one go, for instance, is a lot quicker with KW Rocketry).\u003C/p\u003E\u003Cp\u003EIn fact, as I type this, I have a couple of guys that were going to go to Dres with this exact method. Turns out Jool was in the way so we\u0027re taking a detour, which\u0027ll be fun. I\u0027ve only ever done a few flybys of Jools moons, would be nice to land on one for the first time.\u003C/p\u003E\n"},{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-18T02:35:14Z","Content":"\n\u003Cp\u003EYea thank you for the calculator. Im not quite sure how to use it but i will figure it out. Ok kool i will see what i can come up with thank u\u003C/p\u003E\n"},{"CreatedByName":"Nemecle","CreatedById":107534,"CreatedDateTime":"2014-04-18T10:06:30Z","Content":"\n\u003Cp\u003EThe only advice I can give you is to be careful about the way you enter the SOI : be sure to be in the same way of the planet\u0027s surface : landings and take off will be less DeltaV expensive\u003C/p\u003E\n"},{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-18T12:47:58Z","Content":"\n\u003Cp\u003EThank you for your advice\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-04-18T15:55:05Z","Content":"\n\u003Cp\u003ESomething I use for finding the \u0022best angle is a mod called Protractor, you just attach it to the ship and you can see when the best time to leave is relative to what planet you are at currently. I normally put a small satellite around Kerbin so I can get the angle I need. It has it set so you can switch between angle or time, I usually use the time function to make it easier. You will want one on the ship going to Dres as well so you can plan your return with it as well.\u003C/p\u003E\n"},{"CreatedByName":"Billyk88","CreatedById":102725,"CreatedDateTime":"2014-04-19T00:57:50Z","Content":"\n\u003Cp\u003EThank you but i refuse to use mods.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-04-19T01:14:33Z","Content":"\n\u003Cp\u003EThe game doesn\u0027t give you the tools to do this with any finesse, and you don\u0027t want to install mods that will allow you to finesse it, so I suggest building the hugest ship you can launch into orbit and just brute force your way there.\u003C/p\u003E\u003Cp\u003EPrepare to send refuelers as well, and for the mission to take decades \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Liowen","CreatedById":94498,"CreatedDateTime":"2014-04-19T04:10:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Billyk88\u0022 data-cite=\u0022Billyk88\u0022\u003E\u003Cdiv\u003EThank you but i refuse to use mods.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can always use a real protractor and do the math yourself. I do not like to use mods either, however when you reach the limits of what is offered in game using a mod to help, not do the item in question for you, out is not a terrible thing. There are websites that will tell you, but you have to enter in information to make them work.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-04-19T04:31:32Z","Content":"\n\u003Cp\u003EYou can keep fuel budgets under control without mods or complicated math :\u003C/p\u003E\u003Cp\u003E1. Put a probe outside of Kerbin\u0027s soi that remains in the same solar plane as Kerbin. Then set Dres as target. This will allow you to see the ascending and descending nodes with Dres.\u003C/p\u003E\u003Cp\u003E2. Time the launch of your Dres ship so that it coincides with Kerbins arrival at one of the nodes. This will allow you to get closest approach indicators when you\u0027re ships projected path intersects with Dres\u0027s orbit.\u003C/p\u003E\u003Cp\u003E3. Time warp until you are just past the first closest approach. You can now burn either retrograde or prograde until you get a Dres intercept. Use your manuever nodes to figure out which. It would be preferable to set yourself up for a prograde burn as this will reduce the delta-v needed to get a Dres capture. You may have to go around more than once to get into a good position.\u003C/p\u003E\u003Cp\u003EUsing Alexmon\u0027s launch planner will give you the most efficient launch times, but the method I just tried to describe here will get you there in pretty good shape too, without mods.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-19T04:45:16Z\u0022 title=\u002204/19/2014 04:45  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 19, 2014\u003C/time\u003E by Otis\u003C/strong\u003E\n\u003C/span\u003E\n"}]}