{"TopicId":69873,"ForumId":16,"TopicTitle":"Kerbal Engineer Longitude","CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-04-19T18:21:45Z","PageNum":1,"Articles":[{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-04-19T18:21:45Z","Content":"\n\u003Cp\u003EThis came up when I was trying to put a constellation of satellites on geostationary orbit around Kerbin.\u003C/p\u003E\u003Cp\u003ESo the problem is - I use Kerbal Engineer (with the latest of Padishar\u0027s versions) and I can\u0027t seem to understand what is wrong with its longitude indicator.\u003C/p\u003E\u003Cp\u003EInstead of getting a normal 0-360 degrees or 0-180- -179-0 indications, it gets strange indications which seem to be dependent on something entirely different.\u003C/p\u003E\u003Cp\u003EI observed the longitude shown by KER for a few orbits - it seems to reset at random numbers, and then starts always from a larger degree than the last orbit.\u003C/p\u003E\u003Cp\u003EFirst time it reset at -468 degrees, and went to -7. Next orbit it reset at -150 and started again from -501 degrees.\u003C/p\u003E\u003Cp\u003ESomething is wrong with it and I can\u0027t figure out why or how to use it(if it just requires some math and is not broken by default).\u003C/p\u003E\u003Cp\u003EI know MJ works perfectly, but I don\u0027t really want MJ. I was also wondering about the VOID mod, but it seems to be awfully unpopular and I don\u0027t even know if it provides VAB information like KER or MJ.\u003C/p\u003E\u003Cp\u003EAny assistance on the matter would be appreciated.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-04-19T22:07:43Z","Content":"\n\u003Cp\u003EYour best bet would be to ask in the KER thread. Or just get MJ you aren\u0027t forced to use the autopilot features.\u003C/p\u003E\n"},{"CreatedByName":"smunisto","CreatedById":57789,"CreatedDateTime":"2014-04-20T06:56:20Z","Content":"\n\u003Cp\u003EI did ask in the KER thread, but as far as this goes - it will take a while to get a response.\u003C/p\u003E\u003Cp\u003EI posted a new thread, because some person in a completely different thread that KER works with some formula when showing the Longitude and Latitude degrees. \u003C/p\u003E\u003Cp\u003EHowever I could not find the thread and wanted to know if any other math savvy player has figured it out.\u003C/p\u003E\u003Cp\u003EAnd yes - MJ bothers me, because if I install it I will get the urge to use the guidance systems. Besides, last time I installed it (now, don\u0027t laugh) - around 0.18, it included a bonus feature of completely usurping the main thread of the CPU, thus causing ridiculous micro-stutter in the game.\u003C/p\u003E\u003Cp\u003EI did install it now though and I will give it a try.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-04-20T08:57:06Z","Content":"\n\u003Cp\u003EYou can disable various mechjeb modules that you don\u0027t want I don\u0027t know the exact syntax but I believe it\u0027s Blacklist = (module names go here) but I could be wrong.\u003C/p\u003E\n"}]}