{"TopicId":70163,"ForumId":16,"TopicTitle":"Command Pod Deletion of entire project stifles creativity. Navigation aid mods?","CreatedByName":"BoogieMan","CreatedById":109275,"CreatedDateTime":"2014-04-22T17:40:36Z","PageNum":1,"Articles":[{"CreatedByName":"BoogieMan","CreatedById":109275,"CreatedDateTime":"2014-04-22T17:40:36Z","Content":"\n\u003Cp\u003EHi there, so far I am immensely enjoying this game but there is one nagging issue where if you delete the first placed command module, it just up and deletes the entire project. I should be able to change that half way through without that occurring.. Also, sometimes - especially in career mode without a lot of parts - you have to get creative with how you connect things together. Sometimes you just need to move objects away from the command pod to make changes at how they link up, but unless a part is connected in some fashion to the command pod, you can\u0027t do anything but move the blueprint around. These mechanics seem like they should exist. Is there a mod to stop that from occurring?\u003C/p\u003E\u003Cp\u003EAnd I was also curious if someone is aware of any aid type mods, that make it easier to navigate around?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-23T16:55:31Z\u0022 title=\u002204/23/2014 04:55  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 23, 2014\u003C/time\u003E by BoogieMan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-04-22T22:25:28Z","Content":"\n\u003Cp\u003EThe first placed \u0027command module\u0027 (can be some other things as well) is the \u0022root\u0022 part that everything else has to connect to. There is a mod (Select Root) that allows you to choose and change which part is the root but there always has to be exactly one. The (logical) \u0027tree structure\u0027 of parts in KSP means every part except the root must connect, first, to exactly one \u0027parent\u0027 part that is already placed - so the second part can only connect to the root, the third can connect to the root or second, etc. Immediately that gives you the \u0027stack\u0027 of a rocket, with one thing one top of another. Any number of \u0027child\u0027 parts that fit can connect to the same \u0027parent\u0027 however - so you can have a quad-connector with four stacks beneath it, for instance.\u003C/p\u003E\u003Cp\u003EThis arrangement is easy for the computer to deal with but it does have some limitations. It is so fundamental to the way KSP works though that trying to change it would basically mean starting again.\u003C/p\u003E\u003Cp\u003EThere are many, many mods - what is it that you want to navigate around (parts and construction or space itself) and what problems are you having at the moment?\u003C/p\u003E\n"},{"CreatedByName":"federally","CreatedById":105086,"CreatedDateTime":"2014-04-22T22:32:48Z","Content":"\n\u003Cp\u003EIf you want to change your root part you can remove everything attached by grabbing the part next in line. Release is in the vab so it stays there but red and semi transparent. Then get rid of your root part, pick another one and reattach the other parts to the new root.\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2014-04-23T04:05:51Z","Content":"\n\u003Cp\u003EWhat federally said.\u003C/p\u003E\u003Cp\u003EYou can set a part down not attached to the rocket. Just set your rocket down not attached to your command pod.\u003C/p\u003E\u003Cp\u003EAs for navigation aid, it depends on what you need help with specifically. You can use MechJeb to automatically fly your rocket in certain ways, such as entering and/or circularizing an orbit. If you want tips on getting to other places, you just need to learn how to read and use the navball. Try watching some Scott Manley videos on youtube.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-23T04:08:50Z\u0022 title=\u002204/23/2014 04:08  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 23, 2014\u003C/time\u003E by thereaverofdarkness\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BoogieMan","CreatedById":109275,"CreatedDateTime":"2014-04-23T16:56:01Z","Content":"\n\u003Cp\u003EThanks for the insight! Now I\u0027m just having wibbly wobbly rocket issues, even when they are affixed to supports along the length.\u003C/p\u003E\n"}]}