{"TopicId":70366,"ForumId":16,"TopicTitle":"Perfect Equatorial Orbits with STOCK KSP","CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T17:55:25Z","PageNum":1,"Articles":[{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T17:55:25Z","Content":"\n\u003Cp\u003EWhat is the best and most accurate way to get a perfectly equatorial orbit around a celestial body without referencing another object besides what you\u0027re orbiting? I would like to place equatorial orbits around things like Dres but don\u0027t have a good point of reference.\u003C/p\u003E\u003Cp\u003EOne other question - how do I enter a \u0022Thread Prefix\u0022? I would have loved to place this in the Questions forum where it belongs.\u003C/p\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-04-24T17:56:43Z","Content":"\n\u003Cp\u003EIt\u0027s not possible without referencing another object.\u003C/p\u003E\u003Cp\u003EWhy are you trying to get a perfect equatorial orbit around Dres?\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-04-24T18:01:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Camaron\u0022 data-cite=\u0022Camaron\u0022\u003E\u003Cdiv\u003EOne other question - how do I enter a \u0022Thread Prefix\u0022? I would have loved to place this in the Questions forum where it belongs.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen you post in the questions forum, where this belongs, you get the option to use a pre-defined thread prefix.\u003C/p\u003E\u003Cp\u003ERegarding your question, it\u0027s pretty much impossible with stock KSP. Around Kerbin you can reference the Mun... You might even be able to reference Kerbin around another body because it has no inclination of eccentricity but other than that it\u0027s not really worth bothering since you\u0027ll have to make an inclination change for rendezvous on entering a new SOI \u003Cem\u003Eanyway\u003C/em\u003E. I assume that\u0027s why you want a \u0022perfect\u0022 equatorial orbit?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-24T18:04:07Z\u0022 title=\u002204/24/2014 06:04  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 24, 2014\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-04-24T18:07:19Z","Content":"\n\u003Cp\u003ECamaron, I moved your post for you. To add a prefix, click to edit the first post in the thread, and then \u0022go advanced\u0022 in the editor. You\u0027ll see a little menu box for prefixes there.\u003C/p\u003E\n"},{"CreatedByName":"Camaron","CreatedById":100218,"CreatedDateTime":"2014-04-24T18:27:15Z","Content":"\n\u003Cp\u003EI like equatorial orbits, because from the ground, I can easily reference equatorial takeoffs with the Gimbal, So I was hoping there would be an easy way for carrier ships to be parked more accurately for the exit rendezvous. Problem is if you take off from somewhere away from the equator, that gets bent out of whack as well. Also, I pretty much never match orbit planes before jumping into planets\u0027 SOI\u0027s so I come in at all kinds of whacked out angles. Without a reference, leveling them out can be really geusswork-ish. \u003C/p\u003E\u003Cp\u003EAs for the Quick/Advanced thing. Might I suggest that whoever runs this forum noted that in the error alert? Something like \u0022If you\u0027re in Quick Reply mode, switch to Advanced\u0022. If they can, anyway.\u003C/p\u003E\u003Cp\u003EJust a note, I knew the Mun trick. My Kerbin looks like Saturn right now because all 7 million orbits are flawlessly equatorial. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The challenge is equator-ing an orbit around something which doesn\u0027t have an even reference. (Pretty much everywhere else) \u003C/p\u003E\u003Cp\u003EIs there any simple mod I could try on? Not looking for mechjeb, really just something that can help me see orbit alignment.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-04-24T21:06:27Z","Content":"\n\u003Cp\u003EIf you\u0027re adverse to using MechJeb but don\u0027t mind mods, you can also check out Kerbal Engineer Redux. It will give orbital information among a lot of other useful stuff. (It doesn\u0027t include the autopilot like MechJeb.) You\u0027ll have to add a part to your craft.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/18230-0-23-Kerbal-Engineer-Redux-v0-6-2-3\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/18230-0-23-Kerbal-Engineer-Redux-v0-6-2-3\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Amaroq","CreatedById":57607,"CreatedDateTime":"2014-04-24T21:28:06Z","Content":"\n\u003Cp\u003EI highly recommend \u003Cstrong\u003EKerbal Engineer Redux\u003C/strong\u003E as well - it gives you accurate readings, including orbital inclination, without adding any kind of \u0022changes\u0022 to the game play.\u003C/p\u003E\u003Cp\u003EIf you look through that thread, there\u0027s a Module Manager configuration for simply adding KER to each command module, rather than having to install a part for it.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-04-24T23:31:46Z","Content":"\n\u003Cp\u003EVOID is another mod that can do it. I\u0027ve not used it but it looks pretty good, puts the info in a nice display around the altimeter.\u003C/p\u003E\u003Cp\u003EAs for a purely stock way, check the orbital parameters for your ship in the quicksave or persistence file. The inclination and longitude of the ascending node are easily seen, though to actually get a specific inclination this way will require trial and error or complicated maths.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Orbit#Orbits_in_the_save_file\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Orbit#Orbits_in_the_save_file\u003C/a\u003E\u003C/p\u003E\n"}]}