{"TopicId":70587,"ForumId":16,"TopicTitle":"Eve","CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2014-04-26T10:56:06Z","PageNum":1,"Articles":[{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2014-04-26T10:56:06Z","Content":"\n\u003Cp\u003EHi.\u003C/p\u003E\u003Cp\u003EI was trying to make a good ship which will be able to get my kerbal to Eve and back to Kerbin.\u003C/p\u003E\u003Cp\u003EI can land on Eve but i can\u0027t get back to Kerbin because i never have enough fuel left (just 1 barrel though and LV-909 liquid engine).\u003C/p\u003E\u003Cp\u003EHere are some photos of my ship:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://zaslike.com/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://zaslike.com/files/iv466wycictfpgquoxo0.png\u0022 alt=\u0022iv466wycictfpgquoxo0.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://zaslike.com/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://zaslike.com/files/f69ndea8mgdn2pevpzh0.png\u0022 alt=\u0022f69ndea8mgdn2pevpzh0.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://zaslike.com/\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://zaslike.com/files/micvinvg3ne9145azorn.png\u0022 alt=\u0022micvinvg3ne9145azorn.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAlso, few seconds after launch it starts spining and rotating so much that i can barely control it.\u003C/p\u003E\u003Cp\u003EWhen i get into Eve encounter i got just 2 barrels left, 1 with atomic engine and one with lv909.\u003C/p\u003E\u003Cp\u003ESo i really need help, can someone give me the ship that can go to eve and back or can someone just edit my ship and send me the file or just tell me what to do?\u003C/p\u003E\u003Cp\u003EHere is the ship:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/bcs4ce3b0g4tioc/Cannon\u002Bv2.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./download/bcs4ce3b0g4tioc/Cannon\u002Bv2.craft\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Frank_Black","CreatedById":103689,"CreatedDateTime":"2014-04-26T14:21:22Z","Content":"\n\u003Cp\u003EI am also interested to figure out some ways to land and get back from Eve. Since Eve has a fairly thick and dense atmosphere plus a really high escape velocity, It is extremely hard to come back once we land on it.\u003C/p\u003E\u003Cp\u003EI think maybe your rocket\u0027s structure is not strong enough, which caused unstable performances especially when you get high acceleration rate.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-26T14:24:34Z\u0022 title=\u002204/26/2014 02:24  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 26, 2014\u003C/time\u003E by Frank_Black\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-04-26T15:25:29Z","Content":"\n\u003Cp\u003EWelcome to the Forums. \u003C/p\u003E\u003Cp\u003ELanding on Eve and returning to Kerbin is one of the most difficult feats in KSP. I would not recommend attempting it, especially if you don\u0027t have much experience with Delta V and such.\u003C/p\u003E\u003Cp\u003EWhen creating an Eve Ascent Vehicle, you need to minimize unnecessary mass. You also need to have a ship with 10,000-12,000 m/s of DV in order to get into orbit. You can search for threads on Eve Takeoffs.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-26T15:27:56Z\u0022 title=\u002204/26/2014 03:27  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 26, 2014\u003C/time\u003E by Tank Buddy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2014-04-26T15:32:36Z","Content":"\n\u003Cp\u003EThanks.\u003C/p\u003E\u003Cp\u003EI have a little bit experience though, i landed on mun and minimus and returned back.\u003C/p\u003E\u003Cp\u003EI just can\u0027t get back from Eve.\u003C/p\u003E\u003Cp\u003ECan you give me the link for good ships which will be able to get back?\u003C/p\u003E\u003Cp\u003EI was searching on google and didn\u0027t find anything good.\u003C/p\u003E\u003Cp\u003EOr can you upload yours or i don\u0027t know?\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-04-26T18:48:04Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43291-So-I-took-an-asparagus-lander-to-EVE\u0022 rel=\u0022external nofollow\u0022\u003ELoads of landers in this thread.\u003C/a\u003E\n"},{"CreatedByName":"GoatRider","CreatedById":103681,"CreatedDateTime":"2014-04-26T18:50:31Z","Content":"\n\u003Cp\u003EEve is a HUGE step up from Mun and Minmus. I\u0027ve landed and returned from pretty much everywhere except Eve. I\u0027ve landed a probe there, but that\u0027s easy, just use a parachute.\u003C/p\u003E\u003Cp\u003ETry Duna next.\u003C/p\u003E\n"},{"CreatedByName":"tutrakan4e","CreatedById":100818,"CreatedDateTime":"2014-04-26T18:57:04Z","Content":"\n\u003Cp\u003EI have a question: I usually tend to overbuild things. For instance I made a 5-stage Duna ascent vehicle (it actually did its purpose with spare fuel left, what a surprise!). I can use asparaguss staging fairly well. And when I saw Scott Manley\u0027s Eve ascent vehicle I giggled (it was tiny). Does that mean that if I made some sort of aerospike-aspraguss staging abomination with the landing gear falling off, I\u0027ll be able to take off from Eve?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-04-26T20:08:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tutrakan4e\u0022 data-cite=\u0022tutrakan4e\u0022\u003E\u003Cdiv\u003EDoes that mean that if I made some sort of aerospike-aspraguss staging abomination with the landing gear falling off, I\u0027ll be able to take off from Eve?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGenerally yes. If you give it enough (atmospheric) dv, there\u0027s no reason why it shouldn\u0027t go off Eve. Amount of fuel you need depends a lot on the altitude at which you start. If you start at sea level, you need a LOT more fuel than if you start from highest peaks like Scott Manley did.\u003C/p\u003E\n"},{"CreatedByName":"Cannon","CreatedById":109645,"CreatedDateTime":"2014-04-26T22:50:48Z","Content":"\n\u003Cp\u003Ei\u0027ve been trying to make as same ship as scott manley did and i\u0027m almost done, need to add few fuel pipes and that\u0027s it, i hope it\u0027s gonna work this time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpenSpaceCorp","CreatedById":98977,"CreatedDateTime":"2014-04-26T23:38:08Z","Content":"\n\u003Cp\u003EI have been playing KSP for about a year now, and I have not even attempted a return trip from Eve - I\u0027ve landed on every other body (including Jool when it was possible to \u0022land\u0022 on it). Try attempting to conquer more bodies then attempt an Eve return trip after a lot of experience.\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2014-04-27T02:58:36Z","Content":"\n\u003Cp\u003ESo I did an Eve mission as part of my challenge that I\u0027m running. People have used some crazy contraptions to get off of Eve from sea level. You\u0027re going to need to eject all of the landing gear, parachutes, and any excess weight before or at launch from the surface. The best spot on Eve to land is on top of a huge mountain that has the highest point on the planet, it will be a lot easier to get back into orbit from there. You can find it on the kerbal maps. Scott Manely also landed on this mountain when he went to Eve and back. Generally, I would recommend doing two missions out to Eve. The first mission would bring your primary ship and the initial small lander. Land on the mountain with the small lander and plant your flag. Then launch a second ship out to Eve carrying the return to orbit vehicle and send that down to the surface. Get your crew into it and launch it back up to your orbiting ship, then take your Kerbals home in that ship. You might need a refueling ship if you don\u0027t pack enough during the first mission.\u003C/p\u003E\u003Cp\u003EI used a mix of aerospikes and the 215 power engines. The outer stages are used getting through the thick atmosphere, then the mid atmosphere uses up the aerospikes. I also had one small SRB at the top to give the final punch through the rest of the atmosphere and almost achieve orbit. Then the last stage is a tiny engine that uses up all of the remaining fuel to achieve orbit. Throttle control is key when you\u0027re getting off of Eve otherwise you run out of fuel early. If you use a lot of landing gear, you can absorb the impact from the landing of your ship and it won\u0027t be destroyed. You really need to also find the most level terrain possible to land these things on so they don\u0027t launch at an angle, otherwise you waste fuel trying to correct. I don\u0027t even think I started the gravity turn until after I was past 45,000 meters from the surface.\u003C/p\u003E\u003Cp\u003EHere is the ship that took my Eve ascent vehicle to Eve.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/v3aOU3n.jpg\u0022 alt=\u0022v3aOU3n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere it is landed safely on the surface.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/LxzlvLH.jpg\u0022 alt=\u0022LxzlvLH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere\u0027s the crew safely in orbit and out of fuel.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cj7jKFq.jpg\u0022 alt=\u0022cj7jKFq.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Clockwork13","CreatedById":100102,"CreatedDateTime":"2014-04-27T18:40:44Z","Content":"\n\u003Cp\u003EIt\u0027s extremely hard to land from the surface of Eve and come up alive. I\u0027m not even sure if Scott Manley has ever done it. However, it\u0027s a lot easier to land on the highest mountain of Eve and take off from there.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-27T19:16:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Clockwork13\u0022 data-cite=\u0022Clockwork13\u0022\u003E\u003Cdiv\u003EIt\u0027s extremely hard to land from the surface of Eve and come up alive. I\u0027m not even sure if Scott Manley has ever done it. However, it\u0027s a lot easier to land on the highest mountain of Eve and take off from there.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s definitely possible, several posters here have ascended from sea level successfully.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-27T19:19:26Z\u0022 title=\u002204/27/2014 07:19  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 27, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"}]}