{"TopicId":71147,"ForumId":16,"TopicTitle":"At a wall with docking, honestly depressed about it.","CreatedByName":"Locklear308","CreatedById":12370,"CreatedDateTime":"2014-05-01T17:22:00Z","PageNum":1,"Articles":[{"CreatedByName":"Locklear308","CreatedById":12370,"CreatedDateTime":"2014-05-01T17:22:00Z","Content":"\n\u003Cp\u003EAt the moment...I\u0027ve hit a wall and I can no longer proceed in the game. I can NOT...for the life of me... dock in space. \u003C/p\u003E\u003Cp\u003EI mean I\u0027ve spent hours apon hours flying around and around and around just to always fly past it or barely get close...\u003C/p\u003E\u003Cp\u003EI don\u0027t know anything else to do to get science... and I\u0027ve failed at landing on anything other than Duna. Even that was a semi failure... :/\u003C/p\u003E\u003Cp\u003EI\u0027m just really needing some training/ideas. Anyone?\u003C/p\u003E\n"},{"CreatedByName":"Ikaneko","CreatedById":109214,"CreatedDateTime":"2014-05-01T17:31:05Z","Content":"\n\u003Cp\u003EDon\u0027t worry! I had the same problem. In order to dock you\u0027ve got to cancel out your relative velocity. You do this by firing in the opposite direction to your current direction relative to the target. Next you\u0027ve got to maneuvre towards your target by translating with your RCS. The you just kinda... dock.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-05-01T17:58:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Locklear308\u0022 data-cite=\u0022Locklear308\u0022\u003E\u003Cdiv\u003EAt the moment...I\u0027ve hit a wall and I can no longer proceed in the game. I can NOT...for the life of me... dock in space. \u003Cp\u003EI mean I\u0027ve spent hours apon hours flying around and around and around just to always fly past it or barely get close...\u003C/p\u003E\u003Cp\u003EI don\u0027t know anything else to do to get science... and I\u0027ve failed at landing on anything other than Duna. Even that was a semi failure... :/\u003C/p\u003E\u003Cp\u003EI\u0027m just really needing some training/ideas. Anyone?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, download the docking alignment mod. It gives you an overlay that you can watch and understand while you are trying to maneuver that\u0027s much easier than trying to use the navball. First you set the rotation as shown on the GUI, then you translate to line up the ports, then you translate to close. Read the thread because it gives precise instructions on how to read the alignment indicator. \u003C/p\u003E\u003Cp\u003ERemap your RCS translation to the keypad. I use 4-6 for left right, 2-8 for up/down, and 7-1 for forward/backward.\u003C/p\u003E\u003Cp\u003ENow, Download Mechjeb, and follow these instructions:\u003C/p\u003E\u003Cp\u003E1) Build 2 ships with probe, docking ports, SAS, plenty of RCS fuel, electricity, and enough Dv to achieve 150k orbit. Make the final stage small enough to maneuver quickly and easily with just SAS. It should translate evenly (ie, the RCS thrusters don\u0027t rotate your ship when you translate up/down/left/right). Lights on each ship pointing at the docking port also help.\u003C/p\u003E\u003Cp\u003E2) Launch the first ship to an orbit of 150k circular with zero inclination.\u003C/p\u003E\u003Cp\u003E3) Launch the second ship to a 75k circular orbit with zero inclination. (or match the inclination of the first ship)\u003C/p\u003E\u003Cp\u003E4) You are going to dock the second ship to the first ship, so set the first ship as target. Use the maneuver planner to create a Hohmann transfer to target. Make the burn.\u003C/p\u003E\u003Cp\u003E5) In the maneuver node planner, use the \u0022fine tune closest approach\u0022 set to 200 meters.\u003C/p\u003E\u003Cp\u003E6) Check the target distance markers, confirm that 200 meters is the actual closest approach. If not, use fine tune again.\u003C/p\u003E\u003Cp\u003E7) In the maneuver node planner, use the \u0022match target velocity\u0022 set to \u0022at closest approach\u0022 and execute.\u003C/p\u003E\u003Cp\u003E8) After the burn at step 7, you should be 200 meters from the first ship with very low relative velocity. QUICKSAVE.\u003C/p\u003E\u003Cp\u003E9) Use the \u0022]\u0022 key to switch to the first ship and change your control point to the docking port. (Right click the port, control from here), and set SMARTASS to prograde or retrograde.\u003C/p\u003E\u003Cp\u003E10) Use the \u0022]\u0022 key to switch back to the second ship, change your control point to the docking port. (Right click the port, control from here) and begin making very small approach translations. Use SMARTASS set to \u0022Target\u0022 \u0022TGT \u002B\u0022. Again, it\u0027s very important to keep the relative velocity low, under 10 m/s. \u003C/p\u003E\u003Cp\u003E11) At about 100 meters, kill your relative velocity. Less than 1.0 M/S. Set your target to the first ships docking port. At this point, the docking port alignment GUI should pop up. TURN OFF SMARTASS on the second ship. ALT-F5 and name the new quicksave.\u003C/p\u003E\u003Cp\u003E12) Set rotation on the Docking Alignment. \u003C/p\u003E\u003Cp\u003E13) Set ship alignment.\u003C/p\u003E\u003Cp\u003E14) Translate left/right until the indicator is centered.\u003C/p\u003E\u003Cp\u003E15) Translate up/down until the indicator is centered.\u003C/p\u003E\u003Cp\u003E16) Translate forward keeping your relative velocity to less than 5 m/s. At 20 meters distance, change your relative velocity to 2 m/s. At 10 meters change it to 1. At 5 meters change it to .5.\u003C/p\u003E\u003Cp\u003E17) You should dock.\u003C/p\u003E\u003Cp\u003EReload the quicksaves and keep doing it until it\u0027s smooth and makes sense.\u003C/p\u003E\u003Cp\u003EThen do it from the Launchpad without using Mechjeb.\u003C/p\u003E\u003Cp\u003EEDIT: Don\u0027t forget to turn off your main engine!! Nothing sucks more than accidentally hitting lft-shift when you are 8 meters from docking.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-01T18:10:59Z\u0022 title=\u002205/01/2014 06:10  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 1, 2014\u003C/time\u003E by xcorps\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-05-01T17:59:42Z","Content":"\n\u003Cp\u003ETwo things that are guaranteed to make docking simple for you:\u003C/p\u003E\u003Cp\u003ENavyFish\u0027s \u003Ca href=\u0022http://kerbalspaceprogram.com/dock-align-indicator/\u0022 rel=\u0022external nofollow\u0022\u003EDocking Port Alignment Indicator \u003C/a\u003E- you do not need an autopilot, it\u0027s merely a visual aid that makes docking dead simple. I wrote a \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43901-0-23-5-Docking-Port-Alignment-Indicator-(Version-3-0-Updated-12-18-13)/page22?p=626892\u0026amp;viewfull=1#post626892\u0022 rel=\u0022external nofollow\u0022\u003Every brief tutorial \u003C/a\u003Ein the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43901-0-23-5-Docking-Port-Alignment-Indicator-(Version-3-0-Updated-12-18-13)\u0022 rel=\u0022external nofollow\u0022\u003Eforum thread\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EPebbleGarden\u0027s brilliant \u003Ca href=\u0022https://www.youtube.com/watch?v=5ciFCKgyx48\u0026amp;index=4\u0026amp;list=FLZepMlCTi5XzaFF-_dKk-mQ\u0022 rel=\u0022external nofollow\u0022\u003Etutorial video \u003C/a\u003Eon intercept, rendezvous and docking. The \u0022pushing the marble\u0022 technique makes it so easy to accomplish.\u003C/p\u003E\u003Cp\u003ESo I strongly urge you to pick up the plugin and watch the video. I guarantee you\u0027ll find docking easy if you do. In no time, you\u0027ll be doing things like direct ascents to dock (who needs parking orbits?)\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-05-01T18:02:01Z","Content":"\n\u003Cp\u003EI grew up on\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/gT1Fcxxq5lw?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E but there\u0027s plenty of other very good ones. The main point is, you need to not only match the place in the space, you need also to match your speeds. Only then you will find yourself at rest relative to the other ship.\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-01T18:07:23Z\u0022 title=\u002205/01/2014 06:07  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 1, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Frank_Black","CreatedById":103689,"CreatedDateTime":"2014-05-01T18:04:53Z","Content":"\n\u003Cp\u003EHi buddy, although I do not know exactly what wall you have hit, I got some ideas:)\u003C/p\u003E\u003Cp\u003E1. As for docking, may I ask whether you have used RCS or not? If you have not used it yet, it is quite normal that you have missed your target again and again. RCS can provide accurate and convenient momentum modification when your ship is close enough to your target. Here is my step to dock with another ship. (I do not have any other mods to help me dock, I just use the original parts to finish it.)\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E 1.1 Firstly, it is quite convenient and better to make the target ship at a circular orbit but not an elliptical orbit.\u003C/p\u003E\u003Cp\u003E 1.2 Launch the docking ship, do normal gravity turn and raise the Apo. to a suborbital, and shut down engine when the Apo. just reached the orbit of the target ship. That means their orbits encounter at one point.\u003C/p\u003E\u003Cp\u003E 1.3 When the docking ship reached the Apo, do an acceleration, make the orbit to an elliptical one. In reality we calculate the cycle period of each ship, and make the two ships meet the next time the docking ship comes to this point. In this game, it is much easier since we can see the target\u0027s position when the docking ship intersect. You can just shut down engine when the two labels are close enough, usually less than 10 km.\u003C/p\u003E\u003Cp\u003E 1.4 Wait until the two ship reach the intersection, then decelerate the docking ship to 0m/s relative to the target. then accelerate to target ship at a low speed(usually at 100m/s at 10km, 50m/s at 6km, 30m/s at 4km, 10m/s at 1km). if you find your speed deviate from the target, just decelerate to 0m/s, then accelrate towards the target. Repeat this procedure again and again, finally you can reach the target.\u003C/p\u003E\u003Cp\u003E 1.5 When you are 300m away from the target, decelerate to 0m/s the last time with the engines. Go to docking mode, use RCS to slowly approach the target. select a port as \u0027target\u0027, approach it.\u003C/p\u003E\u003Cp\u003E 1.6 When your ship is 70m away from the target docking port, align your ship with the docking port, kill all side way speed, just approach directly to the port.\u003C/p\u003E\u003Cp\u003E 1.7 Final speed of docking depends on the mass of your ship. The heavier it is, the slower you\u0027d better be. \u003C/p\u003E\u003Cp\u003E2. As for landing, it is important to design a lander with enough fuel and enough thrust power. I do not know what your lander looks like, but it is quite easier to try landing on Mun firstly. Good luck~\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-05-01T18:08:40Z","Content":"\n\u003Cp\u003EWhich bit are you stuck on? The closing to the target with engines or the final docking approach wih RCS?\u003C/p\u003E\n"},{"CreatedByName":"benschwab","CreatedById":108516,"CreatedDateTime":"2014-05-01T18:40:57Z","Content":"\n\u003Cp\u003EThere are plenty of tutorials in the Drawling Board: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/28352-The-Drawing-Board-A-library-of-tutorials-and-other-useful-information\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/28352-The-Drawing-Board-A-library-of-tutorials-and-other-useful-information\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThe wiki has three relevant pages: \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Docking\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Docking\u003C/a\u003E \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Basic_Maneuvers#Docking_.2F_Rendezvous\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Basic_Maneuvers#Docking_.2F_Rendezvous\u003C/a\u003E \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Tutorial:Basic_Docking\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Tutorial:Basic_Docking\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve read through the wiki and have have docked several times.\u003C/p\u003E\u003Cp\u003EThe relevant speed you need to pay attention to is your speed relative to your target. The various guides can tell you what this should approximately be but once you get close enough to use RCS and have matched speeds pretty closely forget about everything else except the craft that need to dock.\u003C/p\u003E\u003Cp\u003EI don\u0027t succeed in every attempt but with practice I am getting better. Sometimes it seams that I just cannot close the last 10 meters or so but as long as fuel capacity holds out, persistence can pay off.\u003C/p\u003E\u003Cp\u003ERemember this game teaches you about rocket science, orbital mechanics, and other space junk by teaching you what not to do. Keep trying and with patience you will learn how to do what you want to do.\u003C/p\u003E\n"},{"CreatedByName":"Citherly","CreatedById":66129,"CreatedDateTime":"2014-05-01T19:07:27Z","Content":"\n\u003Cp\u003EWhen you get close to the actual docking (\u0026gt;75meters)...learn the translation controls while using RCS. This helped me to not go crazy when getting so close and screwing up the whole docking attempt. Using these controls in combination with using the CHASE cam view (press V until it says chase) was amazing help for me.\u003C/p\u003E\u003Cp\u003EH - RCS thrust translate forward \u003C/p\u003E\u003Cp\u003EN - RCS thrust translate backward \u003C/p\u003E\u003Cp\u003EI - RCS thrust translate down \u003C/p\u003E\u003Cp\u003EJ - RCS thrust translate left \u003C/p\u003E\u003Cp\u003EK - RCS thrust translate up \u003C/p\u003E\u003Cp\u003EL - RCS thrust translate right\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-01T19:26:53Z\u0022 title=\u002205/01/2014 07:26  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 1, 2014\u003C/time\u003E by Citherly\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-05-01T19:20:58Z","Content":"\n\u003Cp\u003EMake sure your navball is in target mode when you rendezvous with the target. This will give you your speed and direction relative to your target. You probably are in orbit mode, which makes it pretty much impossible.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-05-01T19:37:41Z","Content":"\n\u003Cp\u003EI can\u0027t recommend Navyfish\u0027s Docking camera plugin, it is great on so many levels and should be integrated into the stock game.\u003C/p\u003E\n"},{"CreatedByName":"RW-1","CreatedById":107278,"CreatedDateTime":"2014-05-01T20:00:09Z","Content":"\n\u003Cp\u003E\u0022I mean I\u0027ve spent hours apon hours flying around and around and around just to always fly past it or barely get close...\u0022\u003C/p\u003E\u003Cp\u003ELet\u0027s start there: How close have you been to your intended target?\u003C/p\u003E\u003Cp\u003EI want to start this supposition/methodology with you have following most of the above information. Perhaps in my rambling a light will appear, don\u0027t go into it, just let it turn on above you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFirst off, any type of rendezvous will be screwy if you are off plane, early on you need to match the target\u0027s orbital inclination, otherwise you WILL drift off north or south after coming close, adding to your frustration.\u003C/p\u003E\u003Cp\u003ESo let\u0027s say you get to a close distance to your target (say under 10k), and are in plane, this means you are either above or below your target, or by chance your paralleling it. no matter.\u003C/p\u003E\u003Cp\u003EFor beginner docking, at this point, IMO, you need to make small steps. \u003C/p\u003E\u003Cp\u003ESwitch to target on the navball, (and to do that, you need to have selected the other craft as the target in map mode...) look at your m/s, and you null that out by burning retrograde to match the target speed.\u003C/p\u003E\u003Cp\u003ENow if successful, you are for the moment matched - you\u0027re not getting closer, or farther (this won\u0027t last - but to tell you have to look at your orbit and compare to the targets, eventually when in this position having matched speeds BASED on using the target as a reference, your orbits should be nearly identical).\u003C/p\u003E\u003Cp\u003EYou now point to the target and make a small burn - 10-20M/s depending, closer you are , lower the rate. \u003C/p\u003E\u003Cp\u003EAs you are making these burns, you are changing your orbit temporarily - and as you get nearer you then have to cancel it out again, which will bring your orbit back as you match speeds.\u003C/p\u003E\u003Cp\u003EThe prograde symbol should be near the target indicator, and you can control it somewhat by switching to translation as you drift to it, making linear corrections - by looking at the prograde marker and the target symbol, you can even adjust your course to the left right up down to position yourself whre the targets docking port is.\u003C/p\u003E\u003Cp\u003EAnother note, if the prograde symbol drifts constantly on the approach - it can be from differences in your two orbits, that can be minimized by being in plane, as for above or below - can\u0027t help that, that\u0027s what is making you get near or further from the target - you adjust to fly lower and get nearer, just on a way smaller scale as you get close, but the mechanics don\u0027t change.\u003C/p\u003E\u003Cp\u003EIf you are close to begin with, you do this again and again in small steps, and you reach it, at which time you select a docking port instead of the craft itself.\u003C/p\u003E\u003Cp\u003EI believe the training scenarios have docking, or at least you can load the mun landing one, separate the two craft, then play with it ....\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-05-01T20:16:53Z","Content":"\n\u003Cp\u003EAlso, Blizzy has an interactive in-game docking tutorial scenario, but I\u0027m not sure if it still works in 23.5.\u003C/p\u003E\n"},{"CreatedByName":"Rosco P. Coltrane","CreatedById":61065,"CreatedDateTime":"2014-05-01T20:18:33Z","Content":"\n\u003Cp\u003EAnother receipt for rendezvous, these are the basics that you need to know really, the rest is candy coating:\u003C/p\u003E\u003Cp\u003E1- Put ship on a bigger/smaller orbit than the one of the target vessel (say target is at 100Km, you go to 150-200 km). Preferably circular (it could be done even if not circular, but to begin...).\u003C/p\u003E\u003Cp\u003E2 - Align planes: create node at the An or Dn and move \u0022up\u0022 or \u0022down\u0022 normal and anti-normal handles (mouse over the An or Dn markers to see how many degrees off you\u0027ll be). Execute said node.\u003C/p\u003E\u003Cp\u003E3- Add node somewhere (anywhere really) to reduce/expand orbit until it touches the target\u0027s.\u003C/p\u003E\u003Cp\u003E4- Check position of encounter markers (little red and orange thingies on the orbit) to see if you arrive at the encounter before or after the target. The one that says \u0022target position...\u0022 represents the target vessel, and the other one is you. Don\u0027t pay attention to the colors for now, just get two of the same color close to each other.\u003C/p\u003E\u003Cp\u003E5- Move node around (might be several orbits into the future) until either your 2 red or your 2 orange markers get close enough, say 5 Km (but bigger is not a problem). \u003C/p\u003E\u003Cp\u003E6- Execute node.\u003C/p\u003E\u003Cp\u003E7- Wait until the encounter. Click the navball to put it on target mode. At closest approach, burn retrograde until speed is 0.\u003C/p\u003E\u003Cp\u003E8- Point towards target prograde (pink round symbol with a dot in the middle) and burn a little to increase speed (say 5 m/s, better slowly than screw up). You want your velocity vector to be aligned with it, so you burn opposite. Ie, if your VV is at the right of the pink marker, you point to the left and burn SLOWLY so the VV moves left.\u003C/p\u003E\u003Cp\u003E9- You should now have a new encounter in the near future, whether red or orange doesn\u0027t matter. Wait for that an repeat from step 7.\u003C/p\u003E\u003Cp\u003E10- Don\u0027r rush, just keep doing this and at some point your encounters will be close enough, say 200 mts. Then you burn retrogade to get to 0 m/s and switch to RCS and dock.\u003C/p\u003E\u003Cp\u003EAVOID THINKING ON ANYTHING ELSE. Seriously, forget about anything else, those steps are all you need. Over-thinking is what made me fail at rendezvous at first.\u003C/p\u003E\u003Cp\u003EIt just requires patience and our friends F5/F9 just in case. Remember that Alt-F5 lets you save more than one quicksave. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EDocking, as others said, better with a camera like LazCam or the alignement indicator, but visually is fine too if the ships are simple.\u003C/p\u003E\n"},{"CreatedByName":"Amagi82","CreatedById":43131,"CreatedDateTime":"2014-05-01T20:53:59Z","Content":"\n\u003Cp\u003EOne thing I don\u0027t think has been mentioned that can help you at first is to build ships on the smaller end. The larger a ship is, the more of a pain it is to maneuver it and spin it around in space. Perhaps launch a ship that consists of nothing but a probe body and a docking port adapter, with docking ports on 5 sides for your practice ship, and then launch a rendezvous ship that is nice and small and maneuverable, and has RCS nozzles balanced around the center of mass (like 4 symmetrical at the top and bottom of a small craft). Be patient setting up your rendezvous, and get \u0026lt;2km closest approach before burning toward the ship and making your attempt. The most important thing to pay attention to is the retrograde indicator, which when you have the target selected, and you are close, will stop you relative to the other vessel. You can then spend all the time you need fiddling with getting close and aligned.\u003C/p\u003E\n"},{"CreatedByName":"ArmchairGravy","CreatedById":78526,"CreatedDateTime":"2014-05-01T20:56:31Z","Content":"\n\u003Cp\u003EYou may want to check the tutorial in my signature. You want to have fairly close (5-10k difference) orbits, which makes rendezvous easier. If you have a good rendezvous, docking itself becomes fairly simple.\u003C/p\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2014-05-01T21:26:48Z","Content":"\n\u003Cp\u003EPractice docking a small ship. It makes everything so much easier.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-05-01T21:58:23Z","Content":"\n\u003Cp\u003EThese are all very good tuturials, and I suggest trying them out\u003C/p\u003E\u003Cp\u003ENow to throw in my own suggestion: Launch a ship, that has a small probe (with RCS) attatched to it with docking ports.\u003C/p\u003E\u003Cp\u003EOnce you are in space, undock the probe, and practice flying it around with RCS (translation with RCS, H forward, N backward, IJKL for up, left, down, right).\u003C/p\u003E\u003Cp\u003EQUICKSAVE before you practice, and switch the cammera to CHASE mode (hit V a few times).\u003C/p\u003E\u003Cp\u003EWhen you are in chase mode, up is also visually up, rather than just up on the navball.\u003C/p\u003E\u003Cp\u003ENow just practice flying around the original ship and redocking. If you fail, quickload and try again. Repeat as long as needed\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-05-01T23:38:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003EAlso, Blizzy has an interactive in-game docking tutorial scenario, but I\u0027m not sure if it still works in 23.5.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERight, I\u0027m a bit behind checking both the docking and the rendezvous tutorials. I *think* they should work without me updating them. OP could just try them.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-05-02T00:54:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003ERight, I\u0027m a bit behind checking both the docking and the rendezvous tutorials. I *think* they should work without me updating them. OP could just try them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere\u0027s no reason they shouldn\u0027t. the Scenarios already included go back to like .18 (except the ARM one of course)\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-05-02T01:52:20Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/25425-Help-with-Docking-A-Trainer-Ship-for-Newbies\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s \u003C/a\u003Ea ship which launches two orbital craft at once. Undock them and practice bringing them back together from longer and longer distance.\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-05-02T02:26:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Vanamonde\u0022 data-cite=\u0022Vanamonde\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/25425-Help-with-Docking-A-Trainer-Ship-for-Newbies\u0022 rel=\u0022external nofollow\u0022\u003EHere\u0027s \u003C/a\u003Ea ship which launches two orbital craft at once. Undock them and practice bringing them back together from longer and longer distance.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne should do that to get practice with actual docking. Later, they need to practice with two separately launched ships.\u003C/p\u003E\u003Cp\u003EFuel can and its booster stage doing practice docking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9DMzE73.jpg\u0022 alt=\u00229DMzE73.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMun orbiter flying in formation with lander.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/XNbdVIj.jpg\u0022 alt=\u0022XNbdVIj.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/A4qmZBH.jpg\u0022 alt=\u0022A4qmZBH.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe main key is patience, using small maneuvers, and observing what those small maneuvers do.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-05-02T02:32:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Locklear308\u0022 data-cite=\u0022Locklear308\u0022\u003E\u003Cdiv\u003EAt the moment...I\u0027ve hit a wall and I can no longer proceed in the game. I can NOT...for the life of me... dock in space. \u003Cp\u003EI mean I\u0027ve spent hours apon hours flying around and around and around just to always fly past it or barely get close...\u003C/p\u003E\u003Cp\u003EI don\u0027t know anything else to do to get science... and I\u0027ve failed at landing on anything other than Duna. Even that was a semi failure... :/\u003C/p\u003E\u003Cp\u003EI\u0027m just really needing some training/ideas. Anyone?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt sounds like you\u0027re having trouble with rendezvous, which is getting both ships in the same place at the same time going the same speed.\u003C/p\u003E\u003Cp\u003EBefore going to mods and other ships, are you familiar with the target mode and pink indicators on the NavBall?\u003C/p\u003E\n"},{"CreatedByName":"Locklear308","CreatedById":12370,"CreatedDateTime":"2014-05-02T03:00:06Z","Content":"\n\u003Cp\u003EOh my goodness, thank you guys for all the great posts. Honestly earlier today I was just getting ready to quit the game. I\u0027ve just failed at learning anything past Mun/Minmus Landings and Returns.\u003C/p\u003E\u003Cp\u003EI\u0027ll spend some time checking these things out. Thank you all. I\u0027ll post back when I\u0027ve made some progress \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Amaroq","CreatedById":57607,"CreatedDateTime":"2014-05-02T03:39:08Z","Content":"\n\u003Cp\u003EHey - just remember, we\u0027ve \u003Cstrong\u003Eall\u003C/strong\u003E been there! I swear, my very first docking attempt I didn\u0027t know anything about \u0022orbital inclination\u0022, so my orbits were some 135 degrees off from each other -- it would have cost more delta-V to equalize than to launch from the launch pad \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI spent a good long while at the \u0022I can get within about ten meters, but can\u0027t dock\u0022 stage, before finally bumping and clumping my way to my first success -- its one of the great milestones along the way to mastering the game, and you\u0027ll feel like screaming and waking the entire house if it happens at two am... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}