{"TopicId":71526,"ForumId":16,"TopicTitle":"Delta V.. What do I look at?","CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2014-05-06T01:10:15Z","PageNum":1,"Articles":[{"CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2014-05-06T01:10:15Z","Content":"\n\u003Cp\u003EI\u0027ve decided Its time I really start learning whats what, down too the nitty gritty. I\u0027ve asked a few questions in the past, and I\u0027ve learned. I\u0027ve made a ship capable of reaching all planets, but never one that\u0027s capable of landing on any and returning except the smaller moons. \u003C/p\u003E\u003Cp\u003EI\u0027m using MechJeb to check my ships Delta V as last I heard that\u0027s what I should be looking at. I\u0027ve also learned its extremely hard, if not impossible to create a ship that could land on any planet and return, due to the differences of each planet and reaching them. \u003C/p\u003E\u003Cp\u003ESo my question is ultimately, as I\u0027m building each stage of my rocket, and particularly the first stage (the lander), what do I look at to determine how much delta V and or lift my lander needs to land on any given planet and how do I check how much each planet is gonna need? \u003C/p\u003E\u003Cp\u003EI\u0027d really like to start building specialized ships for each planet, and or Moon.\u003C/p\u003E\u003Cp\u003EHere is a picture just as an example, if someone could base their examples, and explanation off of this so I have a visual \u003Ca href=\u0022http://cloud-3.steampowered.com/ugc/615049894329104112/01A50EB206158E580C8BE8919EDC6A7C23FBBBFF/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://cloud-3.steampowered.com/ugc/615049894329104112/01A50EB206158E580C8BE8919EDC6A7C23FBBBFF/\u003C/a\u003E Thanks ^.^\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-05-06T01:16:33Z","Content":"\n\u003Cp\u003EThis \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Cheat_Sheet\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Cheat_Sheet\u003C/a\u003E tell you all you need to know about how much Dv you need.\u003C/p\u003E\u003Cp\u003EMore over, It is recommended that you took that MechJeb \u0022off\u0022 until you fully understand the NavBall, and Yeah the NavBall is more important than the Dv.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-05-06T01:24:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LadyAthena\u0022 data-cite=\u0022LadyAthena\u0022\u003E\u003Cdiv\u003EI\u0027ve decided Its time I really start learning whats what, down too the nitty gritty. I\u0027ve asked a few questions in the past, and I\u0027ve learned. I\u0027ve made a ship capable of reaching all planets, but never one that\u0027s capable of landing on any and returning except the smaller moons. \u003Cp\u003EI\u0027m using MechJeb to check my ships Delta V as last I heard that\u0027s what I should be looking at. I\u0027ve also learned its extremely hard, if not impossible to create a ship that could land on any planet and return, due to the differences of each planet and reaching them. \u003C/p\u003E\u003Cp\u003ESo my question is ultimately, as I\u0027m building each stage of my rocket, and particularly the first stage (the lander), what do I look at to determine how much delta V and or lift my lander needs to land on any given planet and how do I check how much each planet is gonna need? \u003C/p\u003E\u003Cp\u003EI\u0027d really like to start building specialized ships for each planet, and or Moon.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOn the Dv display in the VAB, you can adjust the display per body. For instance, you can have it show the TWR for the Mun, or Minmus or whatever. \u003C/p\u003E\u003Cp\u003EThe Dv is the Dv. It doesn\u0027t matter what planet you\u0027re going to, the Dv you have is what you have. So if you build a landing module for Minmus with 2800 Dv and enough TWR to liftoff, you can land, make a few hops around for more science, and return to Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-06T01:25:16Z","Content":"\n\u003Cp\u003EWell, start off by deciding what you want for a mission profile. Then have a look at a \u003Ca href=\u0022http://i.imgur.com/UUU8yCk.png\u0022 rel=\u0022external nofollow\u0022\u003Edelta-V map\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EThe delta-V map will tell you how much dV you need for each phase of your trip. From this, many people will design their rocket stages to have enough dV for particular parts of the journey.\u003C/p\u003E\u003Cp\u003EFor example, if you want to take a trip to Mun and back. From the dV map...\u003C/p\u003E\u003Cp\u003ELiftoff to LKO: 4500 m/s\u003C/p\u003E\u003Cp\u003EBurn from LKO to Mun: 680 \u002B 180 = 860 m/s\u003C/p\u003E\u003Cp\u003ECapture in Munar orbit: 80 m/s\u003C/p\u003E\u003Cp\u003EDown to Low Mun orbit: 230 m/s\u003C/p\u003E\u003Cp\u003ELand on Mun: 580 m/s\u003C/p\u003E\u003Cp\u003ESo if you add all that up, you need 4500 \u002B 860 \u002B 80 \u002B 230 \u002B 580 = 6250 m/s\u003C/p\u003E\u003Cp\u003ESo your ship needs around 6250 m/s of total dV to land on the Mun. (Doesn\u0027t include the return journey.)\u003C/p\u003E\u003Cp\u003ENow, some people will break that dV requirement into different stages. Here is one example of how to break it down.\u003C/p\u003E\u003Cp\u003ELifter portion (to get to LKO) will have ~4500 m/s, these parts get left behind in LKO or deorbited back into Kerbin.\u003C/p\u003E\u003Cp\u003EMunar Injection portion will have 680 \u002B 180 \u002B 80 \u002B 230 = 1170 m/s. This stage gets you from LKO into Munar low orbit.\u003C/p\u003E\u003Cp\u003ELander portion needs 580 m/s. This allows you to land on the Mun.\u003C/p\u003E\u003Cp\u003EGenerally speaking, you want to add a bit extra to all those numbers to allow for mistakes. An extra 10% is an okay rule of thumb. Add more if you need it, take some away if you have lots of practice. Once you have an idea of how you want to break apart your flight profile, you can use MJ to help sort out how much dV is in each section. It might take a little extra adding up on your part since MJ doesn\u0027t group pieces together.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-06T01:29:32Z\u0022 title=\u002205/06/2014 01:29  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 6, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2014-05-06T02:07:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirine\u0022 data-cite=\u0022Sirine\u0022\u003E\u003Cdiv\u003EThis \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Cheat_Sheet\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Cheat_Sheet\u003C/a\u003E tell you all you need to know about how much Dv you need.\u003Cp\u003EMore over, It is recommended that you took that MechJeb \u0022off\u0022 until you fully understand the NavBall, and Yeah the NavBall is more important than the Dv.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI know how to do everything without mechjeb. I use Mechjeb just for ship stats while building, and fine tuning intercepts when trying to match up with another object to dock, sometimes the little buttons don\u0027t give me enough fine tuning I need.\u003C/p\u003E\n"},{"CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2014-05-06T02:10:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xcorps\u0022 data-cite=\u0022xcorps\u0022\u003E\u003Cdiv\u003EOn the Dv display in the VAB, you can adjust the display per body. For instance, you can have it show the TWR for the Mun, or Minmus or whatever. \u003Cp\u003EThe Dv is the Dv. It doesn\u0027t matter what planet you\u0027re going to, the Dv you have is what you have. So if you build a landing module for Minmus with 2800 Dv and enough TWR to liftoff, you can land, make a few hops around for more science, and return to Kerbin.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo I guess I need to redefine my question too, how do I know how much TWR I need?\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-05-06T02:22:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LadyAthena\u0022 data-cite=\u0022LadyAthena\u0022\u003E\u003Cdiv\u003ESo I guess I need to redefine my question too, how do I know how much TWR I need?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI try to have at least 1.3 TWR for ascent, and 2.0 for descent.\u003C/p\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2014-05-06T02:29:24Z","Content":"\n\u003Cp\u003EA TWR of about 1.8-2.2 is about what you want for takeoff. That TWR is relative to the local gravity.\u003C/p\u003E\u003Cp\u003EOptions:\u003C/p\u003E\u003Cp\u003E1) Set MJ or KER or whatever mod you use for info to display TWR for your vehicle relative to some other planet or moon.\u003C/p\u003E\u003Cp\u003E2) Find the TWR relative to Kerbin and multiply it by the surface gravity from the wiki and divide by 10 (Kerbin\u0027s approx. surface gravity.)\u003C/p\u003E\u003Cp\u003EOnce in a stable orbit, TWR is less important. Low TWR in space just means longer burn times.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-05-06T03:17:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LadyAthena\u0022 data-cite=\u0022LadyAthena\u0022\u003E\u003Cdiv\u003ESo I guess I need to redefine my question too, how do I know how much TWR I need?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELaunching from Kerbin I like to have around 2 until the middle atmosphere, then I like to have around 4. But all you NEED is about 1.2. If I\u0027m landing somewhere, I like to have a really high Dv, like 5 or 6 whenever possible.\u003C/p\u003E\u003Cp\u003EToo much TWR in an atmosphere and you start to run afoul of Terminal Velocity. Any speed over terminal velocity costs you additional Dv in drag/gravity loss. You want your vertical speed to be as close to terminal velocity as possible. I make a custom ascent window for Mechjeb that shows stage Dv, TWR, vertical speed, AP, heading, roll, and pitch.\u003C/p\u003E\n"},{"CreatedByName":"EdFred","CreatedById":108599,"CreatedDateTime":"2014-05-06T03:21:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Yasmy\u0022 data-cite=\u0022Yasmy\u0022\u003E\u003Cdiv\u003EA TWR of about 1.8-2.2 is about what you want for takeoff. That TWR is relative to the local gravity.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf your TWR is that high on an atmospheric body, you end up having to throttle back or you\u0027re wasting burn against terminal velocity - at least that\u0027s what happens when I go that high.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-06T03:41:06Z","Content":"\n\u003Cp\u003EYou need a TWR of 2 to hit terminal velocity in a vertical ascent, since that\u0027s the thrust that will result in a net upwards force equal to the rocket\u0027s weight. However, since the TWR rises as you burn fuel a liftoff TWR of 2 results in needing to throttle back. The \u0022ideal\u0022 launch TWR is going to depend on a lot of factors - the size of the first stage, the engines available, and the staging used.\u003C/p\u003E\n"},{"CreatedByName":"Yasmy","CreatedById":79995,"CreatedDateTime":"2014-05-06T03:50:41Z","Content":"\n\u003Cp\u003ESure, sure. Perfect efficiency is not what I was going for. A little wastage can be just fine.\u003C/p\u003E\u003Cp\u003EWe\u0027re not talking about optimal ascent here. Just making sure we can return from some other surface.\u003C/p\u003E\u003Cp\u003EEdit: If you want to talk about how bad a non-ideal TWR is, \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78985-How-much-does-TWR-in-an-atmosphere-matter-Is-TWR-2-or-TWR-2-better\u0022 rel=\u0022external nofollow\u0022\u003Ecome join me\u003C/a\u003E.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-06T09:10:49Z\u0022 title=\u002205/06/2014 09:10  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 6, 2014\u003C/time\u003E by Yasmy\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LadyAthena","CreatedById":88614,"CreatedDateTime":"2014-05-06T04:36:50Z","Content":"\n\u003Cp\u003EThank you so much for the responses guys ^.^ This has helped me greatly!\u003C/p\u003E\n"}]}