{"TopicId":71644,"ForumId":16,"TopicTitle":"Some clarification on gravity turns","CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-05-07T05:47:02Z","PageNum":1,"Articles":[{"CreatedByName":"G\u0026#039;th","CreatedById":98595,"CreatedDateTime":"2014-05-07T05:47:02Z","Content":"\n\u003Cp\u003ENow, I get the general idea of a gravity turn and how to do it, however, now that I\u0027m starting to move more towards efficiency (IE, removing the overabundant safety margins I used to give myself) I\u0027m finding that the way I do my turns is kind of hit and miss. Sometimes I get to LKO near perfectly, other times I can\u0027t even get my apoapsis above the atmosphere before I\u0027m eating into my transfer stages (even though my lower stages should have had the dV for orbit).\u003C/p\u003E\u003Cp\u003EThe way I\u0027ve been doing it goes as follows:\u003C/p\u003E\u003Cp\u003ELaunch up to somewhere between 7k and 10k. \u003C/p\u003E\u003Cp\u003EThen I start turning east keeping my rocket pointed just on the right side tip of the prograde marker (on those little horizontal lines) until I hit 90 degrees and stop there. \u003C/p\u003E\u003Cp\u003EThen I cut my engines at LKO and go from there. \u003C/p\u003E\u003Cp\u003EWith my safety margins this method usually got me to orbit. But now that I\u0027m cutting them out, this isn\u0027t cutting it. So I need some help clarifying that this is the way to go (and just need to find the right altitude for it) or if I need to change how I\u0027m doing it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-07T06:00:09Z\u0022 title=\u002205/07/2014 06:00  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 7, 2014\u003C/time\u003E by G\u0026#39;th\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-05-07T06:14:43Z","Content":"\n\u003Cp\u003EI do mine like this. It requires a readout of apoapsis like you get in KER or a lot of time in map mode. I do everything based on my APOAPSIS, and ignore most everything else. You want a TWR around 1.6-1.8 though through at least the first 10km of your launch, else you\u0027re going to have issues no matter what you do.\u003C/p\u003E\u003Cp\u003EWhen my Ap gets to 10km, I start my turn. Usually I\u0027m at 7-9km altitude at this point.\u003C/p\u003E\u003Cp\u003EI slowly drag down through the first 45 degrees, with the goal that when my Ap hits 20km, my ship at a 45 degree angle. I ignore the prograde marker.\u003C/p\u003E\u003Cp\u003EI slow down my dragging, this time aiming to hit 30 degrees when my Ap is at 30km (I call this my \u002230 by 30\u0022 launch profile, incidentally).\u003C/p\u003E\u003Cp\u003EWhen my Ap is at 40km, I want to be around 20-15 degrees.\u003C/p\u003E\u003Cp\u003EWhen my Ap is at 50km, I want to be just getting to horizontal.\u003C/p\u003E\u003Cp\u003EWhen my Ap hits 80km, I stop burning. I\u0027m almost always around 40-50km up at this point and when it comes time to circularlize it takes 5-10 seconds total to do so.\u003C/p\u003E\u003Cp\u003EI don\u0027t know how efficient/inefficient it is, but it seems pretty good and nothing else I have tried saves me any worthwhile amount of fuel.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-05-07T06:15:43Z","Content":"\n\u003Cp\u003EIf you\u0027re playing with stock aerodynamics, you don\u0027t have to follow the prograde marker during the turn. It\u0027s better to base your heading on your current altitude instead. That way, you can use the same, reasonably efficient ascent path with different rocket designs, even though they may have significantly different TWRs at different stages of the ascent.\u003C/p\u003E\u003Cp\u003EI usually climb straight up until around 10 km, and then turn to 45 degrees. After 10 km, I lower the heading by 5 degrees for every 5 km, until I get the apoapsis above the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"daniu","CreatedById":74039,"CreatedDateTime":"2014-05-07T06:40:46Z","Content":"\n\u003Cp\u003EI turn to 45Ã‚Â° at 10,000m, then look at the time to apoapsis and try to keep it the same (at about 30-45 seconds) until it reaches 75,000-80,000m, then I stop burning and prepare the circularization maneuver node.\u003C/p\u003E\u003Cp\u003EThat gives a good indication of how to adjust the slope and/or throttle.\u003C/p\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2014-05-07T06:53:14Z","Content":"\n\u003Cp\u003EI usually initiate a very slow turn around 6-8 km, hitting 75ish degrees by 10km and 45 degrees around 16-20 km. From there, I usually try to hit 30 degrees at 30km and 15 degrees at 40km. From there I stop worrying so much about my pitch and focus on my apoapsis, the goal being to hit my target orbit at an altitude of 55 or more km so I can cut the main engines with minimal decay of my apoapsis. If I did it right, I\u0027ll usually need less than 450 m/s to circularize.\u003C/p\u003E\u003Cp\u003EFor ships with lower TWRs, I\u0027ll delay the start of my turn until something like 12km to ensure I have enough vertical speed to avoid going sideways through the thick air under 30 km.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-07T06:56:04Z\u0022 title=\u002205/07/2014 06:56  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 7, 2014\u003C/time\u003E by MockKnizzle\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-05-07T07:20:47Z","Content":"\n\u003Cp\u003ESome time ago there was effort to find optimal gravity turns, resulting in a tool that runs a simulation of the rocket, twiddling with flight parameters (thrust and angle) to maximize amount of payload (remaining fuel) delivered to orbit.\u003C/p\u003E\u003Cp\u003EThe most important find was that the result is different for each rocket and depends a lot on how much fuel and what engines do you have in individual stages. Rockets usually started their gravity turns quite early, almost immediately on launchpad, but kept it well under control\u003C/p\u003E\u003Cp\u003EIt was also found that optimal launches are not exactly like real gravity turns - real rockets always go through atmosphere \u0022straight\u0022, i.e. air flows along the rocket, not from the side. It is very important because otherwise drag forces would damage or even destroy the rocket. In KSP that is not of concern, and optimum gravity turns appear to always thrust slightly above prograde.\u003C/p\u003E\u003Cp\u003EThe main thread is \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58531-Finding-the-best-ascent-path-for-rockets\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EIf you don\u0027t want to go into such technicalities, I just recommend you to stick to one lifter and learn to drive it efficiently. If you\u0027re getting a lot of remaining fuel after circularizing, strip that fuel. If you find yourself unable to circularize, add a bit of fuel.\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2014-05-07T22:13:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EIf you don\u0027t want to go into such technicalities, ...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eand if you do want to go into such technicalities, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I can also recommend these threads:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/46194\u0022 rel=\u0022external nofollow\u0022\u003EI need someone help me do some math for launch optimization\u003C/a\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/39196\u0022 rel=\u0022external nofollow\u0022\u003ELaunch Efficiency Exercise\u003C/a\u003E V0.21.1\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003Eand optimum gravity turns appear to always thrust slightly above prograde.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMost of my simulations suggested to thrust slightly \u003Cem\u003Ebelow\u003C/em\u003E prograde during the majority of the ascent with Kasuha\u0027s example ship being \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58531-Finding-the-best-ascent-path-for-rockets?p=914585\u0026amp;viewfull=1#post914585\u0022 rel=\u0022external nofollow\u0022\u003Ethe only exception\u003C/a\u003E because of it\u0027t low TWR in the last stage.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-05-07T22:43:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mhoram\u0022 data-cite=\u0022mhoram\u0022\u003E\u003Cdiv\u003EMost of my simulations suggested to thrust slightly \u003Cem\u003Ebelow\u003C/em\u003E prograde during the majority of the ascent with Kasuha\u0027s example ship being \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58531-Finding-the-best-ascent-path-for-rockets?p=914585\u0026amp;viewfull=1#post914585\u0022 rel=\u0022external nofollow\u0022\u003Ethe only exception\u003C/a\u003E because of it\u0027t low TWR in the last stage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHmmm okay I don\u0027t remember all your graphs very well but now going through some of them again you\u0027re probably right. The one I was referring to was the one I was remembering the best which was I believe \u003Ca href=\u0022http://i.imgur.com/6XYUrwH.png\u0022 rel=\u0022external nofollow\u0022\u003Ethis one\u003C/a\u003E and that IMO has pitch above velocity vector for the most of the ascent. But the rest seems to start the circularization earlier. But thinking about it, that pitch vs velocity is clearly in absolute coordinates, not in planet\u0027s rotational frame of reference.\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2014-05-07T23:47:49Z","Content":"\n\u003Cp\u003EYes, in that graph the red and green lines are pitch of thrust and prograde (wrt. planet\u0027s rotational frame of reference) respectively. and the red line is below the green line.\u003C/p\u003E\n"},{"CreatedByName":"Tarmenius","CreatedById":16990,"CreatedDateTime":"2014-05-08T00:18:11Z","Content":"\n\u003Cp\u003EI recommend that once you have a good idea of what the gravity turn should look like, you use a test rocket to measure your success. For example, if you can get the rocket pictured below into orbit, you can be pretty sure you\u0027ve got an efficient profile.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/R3hKxnu.png\u0022 alt=\u0022R3hKxnu.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-05-08T00:57:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tarmenius\u0022 data-cite=\u0022Tarmenius\u0022\u003E\u003Cdiv\u003EI recommend that once you have a good idea of what the gravity turn should look like, you use a test rocket to measure your success. For example, if you can get the rocket pictured below into orbit, you can be pretty sure you\u0027ve got an efficient profile.\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/R3hKxnu.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/R3hKxnu.png\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWoot, my plan got me into a 70x84km orbit with a whole 7.17 liters of fuel left over. KER says I have 92m/s to spare \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI had to throttle down to keep it under atmospheric efficiency, and I leveled off a bit low (Around 35km. I think it was due to being at 100% efficiency for so much of the launch. I bet I could do better if I tweaked it, but not much better) but otherwise I did exactly this:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EWhen my Ap gets to 10km, I start my turn. Usually I\u0027m at 7-9km altitude at this point.\u003Cp\u003EI slowly drag down through the first 45 degrees, with the goal that when my Ap hits 20km, my ship at a 45 degree angle. I ignore the prograde marker.\u003C/p\u003E\u003Cp\u003EI slow down my dragging, this time aiming to hit 30 degrees when my Ap is at 30km (I call this my \u002230 by 30\u0022 launch profile, incidentally).\u003C/p\u003E\u003Cp\u003EWhen my Ap is at 40km, I want to be around 20-15 degrees.\u003C/p\u003E\u003Cp\u003EWhen my Ap is at 50km, I want to be just getting to horizontal.\u003C/p\u003E\u003Cp\u003EWhen my Ap hits 80km, I stop burning. I\u0027m almost always around 40-50km up at this point and when it comes time to circularlize it takes 5-10 seconds total to do so.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EFor fun, I tried the \u0022go to 10km, turn 45 degrees. Go to Ap of 75, cut engines. Circularize at Ap.\u0022 and ended up with about the same orbit (76x74) with 71m/s left in the tank. So my plan isn\u0027t much better than what we all learned to do first before we knew any better \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-08T01:03:47Z\u0022 title=\u002205/08/2014 01:03  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 8, 2014\u003C/time\u003E by 5thHorseman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-08T02:31:56Z","Content":"\n\u003Cp\u003EI get the feeling that rocket\u0027s pretty \u0022forgiving\u0022 in terms of ease of reaching orbit, maybe because you\u0027ve got so much TWR for the circularisation burn.\u003C/p\u003E\u003Cp\u003EThe profile I\u0027ve been trying, no idea how good it is:\u003C/p\u003E\u003Cp\u003EAscend vertically to 10 km, keeping an eye on speed and altitude. If I reach one of the \u0022checkpoint\u0022 speeds here, \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Basic_maneuvers#Ascend_to_Orbit\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://wiki.kerbalspaceprogram.com/wiki/Basic_maneuvers#Ascend_to_Orbit\u003C/a\u003E, before I\u0027ve reached the relevant altitude, I throttle back to nearly maintain that speed until I get to the altitude.\u003C/p\u003E\u003Cp\u003EAt 10 km bean it over 45 degrees and floor the throttle.\u003C/p\u003E\u003Cp\u003ESwitch the navball to orbit mode, and at some altitude pitch to follow orbit prograde. Keep tracking orbit prograde until the desired apoapsis is reached. Said \u0022some altitude\u0022 is where I\u0027m unsure, I\u0027ve tried anywhere from 25 to 32 km.\u003C/p\u003E\u003Cp\u003ECut throttle and set up a manouvre node to circularise.\u003C/p\u003E\u003Cp\u003EFor the test rocket here, this ended up very similar to just \u0022straight to 10, 45 degrees to establish apoapsis, circularise\u0022 profile, and I got a 70x80 km orbit with 75 m/s dV left, but for rockets with lower thrust upper stages it can be quite different.\u003C/p\u003E\u003Cp\u003EOf course any of these are a vast improvement on how I was when I started out. My first SSTO barely made orbit, without enough fuel left to \u003Cem\u003Ede\u003C/em\u003Eorbit. It was the same as the test rocket here, except that it used an LV-T45 not a 30, and had \u003Cem\u003Efour\u003C/em\u003E of the long fuel tanks. Which gives it something like 5550-5600 m/s of dV (depending on whether I added a parachute, I can\u0027t tell in my screenshot), but a liftoff TWR of about 1.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-05-08T08:54:31Z","Content":"\n\u003Cp\u003EI used the test rocket with my ascent path.\u003C/p\u003E\u003Cp\u003EWithout throttling down, i reached a 74x73 km orbit with 90 m/s of delta-v remaining. The rocket had a ridiculously high TWR, so I had to cut the engines at 30 km, and do a 1050-1100 m/s circularization burn.\u003C/p\u003E\u003Cp\u003EThen I throttled down during the initial ascent, and kept the throttle setting at whatever level it was after starting the turn. The final orbit was 76x70 km, and the rocket had 115 m/s left.\u003C/p\u003E\u003Cp\u003EThe altitudes are rounded down to the nearest kilometer, and the delta-v figures down to a multiple of 5 m/s.\u003C/p\u003E\n"},{"CreatedByName":"Duranis","CreatedById":101612,"CreatedDateTime":"2014-05-09T06:58:14Z","Content":"\n\u003Cp\u003EI have found the easiest way is to judge it by your time to AP. If you have reasonably high TWR then just keep the time to AP at around 20-30 seconds and that will give you a pretty decent ascent path. For low TWR rockets (i.e. upper stages that might have less thrust) keep the AP out to between 40-50 seconds.\u003C/p\u003E\n"}]}