{"TopicId":71892,"ForumId":16,"TopicTitle":"Landed on the Mun. Now what?","CreatedByName":"The Right Stuff","CreatedById":110433,"CreatedDateTime":"2014-05-10T02:33:00Z","PageNum":1,"Articles":[{"CreatedByName":"The Right Stuff","CreatedById":110433,"CreatedDateTime":"2014-05-10T02:33:00Z","Content":"\n\u003Cp\u003ETook me all night but finally made my first successful Mun landing and returned home. Now what? I have a lot of science from the mission. What is feasible goal for my next mission to generate more science? Thanks.\u003C/p\u003E\n"},{"CreatedByName":"LameLefty","CreatedById":57336,"CreatedDateTime":"2014-05-10T03:33:24Z","Content":"\n\u003Cp\u003ELand somewhere else on the MÃƒÂ¼n - there are multiple biomes (each major crater, the poles, the highlands ...); land at Minmus (easier to land and return, more complicated to get to because of the inclined orbit; also has multiple biomes); do suborbital hops all over Kerbin to hit more biomes there. You can totally max out the stock tech tree without leaving these three bodies.\u003C/p\u003E\u003Cp\u003EMost of all, have fun!\u003C/p\u003E\n"},{"CreatedByName":"Mischief","CreatedById":105311,"CreatedDateTime":"2014-05-10T03:48:10Z","Content":"\n\u003Cp\u003ENext? Minmus. More science, more challenge to hit it. \u003C/p\u003E\u003Cp\u003EAfter that? TRY TO TAKE OVER THE WORLD.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-05-10T03:49:43Z","Content":"\n\u003Cp\u003ENow you have to convince all your Kerbals that it wasn\u0027t a hoax.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-10T04:14:03Z","Content":"\n\u003Cp\u003EGet started on interplanetary travel with flybys or orbits of Duna and Eve. Working out interplanetary transfers will be a whole new ball game and open up the universe beyond Kerbin\u0027s SOI to you.\u003C/p\u003E\n"},{"CreatedByName":"Cerberus738","CreatedById":100744,"CreatedDateTime":"2014-05-10T07:54:20Z","Content":"\n\u003Cp\u003EMinmus has lots of science and is pretty forgiving to land on. Takes a bit more fuel to and from though.\u003C/p\u003E\n"},{"CreatedByName":"SpaceSphereOfDeath","CreatedById":69754,"CreatedDateTime":"2014-05-10T07:58:22Z","Content":"\n\u003Cp\u003EGo to Minmus, it\u0027s easer to land on, has more science and has much prettier views.\u003C/p\u003E\n"},{"CreatedByName":"Madrias","CreatedById":89995,"CreatedDateTime":"2014-05-10T08:22:30Z","Content":"\n\u003Cp\u003EMinmus for more science, get yourself some good interplanetary tech, then set yourself up for a big challenge.\u003C/p\u003E\u003Cp\u003EThe way I tend to do my career mode stuff, I go biome-hopping on Kerbin with suborbitals, get enough for the basic LV-T45, make my Mun run, get probes, cover Minmus in one-shot-wonders designed to get there, take some science, transmit some because at this point I\u0027m not worried about getting every last point, unlock more parts for rovers, planes, and science, and I head for Laythe. Yeah, I know, sounds ambitious, but it\u0027s not too bad in the end. By that point, I\u0027ve started setting up refueling stations, I tend to set up a Jool Refueling Station and Science Base at that time, then I send unmanned, then manned flying rovers into Laythe\u0027s atmosphere. Use atmospheres as an advantage at all times as they\u0027ll help slow your fall.\u003C/p\u003E\n"},{"CreatedByName":"chrise6102","CreatedById":109439,"CreatedDateTime":"2014-05-10T08:22:48Z","Content":"\n\u003Cp\u003EI would say an interplanetary flyby, as long as you have the science to get nuclear engines. If not then you could try escaping Kerbins sphere of influence and coming back, you can do a lot of science outside it\u0027s SoI even without moving to another planet.\u003C/p\u003E\n"},{"CreatedByName":"Linear","CreatedById":26619,"CreatedDateTime":"2014-05-10T09:26:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chrise6102\u0022 data-cite=\u0022chrise6102\u0022\u003E\u003Cdiv\u003EI would say an interplanetary flyby, as long as you have the science to get nuclear engines. If not then you could try escaping Kerbins sphere of influence and coming back, you can do a lot of science outside it\u0027s SoI even without moving to another planet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou can easily do a duna flyby with something only slightly more powerful than a mun rocket.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-05-10T11:23:25Z","Content":"\n\u003Cp\u003EExplore Minmus. Landing is easier even on its highlands. Your rocket can be quite simple, no RCS is needed for a drift free touchdown even though this early example used RCS thrusters for landing.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/FdzWGjm.jpg\u0022 alt=\u0022FdzWGjm.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENo RCS at all. By careful montoring of the Navball and making minor adjustments using the WSAD keys, a drift free landing took place.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/bsOBUav.jpg\u0022 alt=\u0022bsOBUav.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-10T11:25:40Z\u0022 title=\u002205/10/2014 11:25  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 10, 2014\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-05-10T12:44:19Z","Content":"\n\u003Cp\u003EUse the same rocket for minmus\u003C/p\u003E\u003Cp\u003EThen build a space station\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-05-10T15:46:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022chrise6102\u0022 data-cite=\u0022chrise6102\u0022\u003E\u003Cdiv\u003EI would say an interplanetary flyby, as long as you have the science to get nuclear engines. If not then you could try escaping Kerbins sphere of influence and coming back, you can do a lot of science outside it\u0027s SoI even without moving to another planet.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou really don\u0027t need nukes to perform manned interplanetary orbital missions, at least not for Duna, and probably not for a simple Eve fly-by either.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tortoise\u0022 data-cite=\u0022Tortoise\u0022\u003E\u003Cdiv\u003EUse the same rocket for minmus\u003Cp\u003EThen build a space station\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is succinct, but very good, advice. Like the majority of other posters have mentioned, landing on Minmus is probably the best target after a Mun landing if you haven\u0027t done it already (In fact, landing on Minmus is easier than landing on the Mun). \u003C/p\u003E\u003Cp\u003ELaunching a station into LKO (low Kerbin orbit) will provide you with a good target with which to practice rendezvous and docking maneuvers. After figuring out how to land on a planet, I think getting comfortable with rendezvousing/docking is the next big hurdle. When you can dock in orbit, you will be able to refuel, construct more complex craft in orbit, and perform more complicated missions.\u003C/p\u003E\u003Cp\u003EYou don\u0027t \u003Cem\u003Ehave\u003C/em\u003E to be able to dock before you start going interplanetary, but I\u0027d recommend it.\u003C/p\u003E\n"},{"CreatedByName":"linkxsc","CreatedById":67350,"CreatedDateTime":"2014-05-10T16:07:36Z","Content":"\n\u003Cp\u003EPersonally id say make another couple trips to the mun. I like to drop a flag in each of the craters before being done with it. A few shots at minmus and you should be well into tier 5 and 6 parts. \u003C/p\u003E\u003Cp\u003EDocking and nuclear engines are especially helpful for interplanetary stuff. Most people recommend duna. Im more of a fan of jool because then i start building my refueling stations (they can be simple. All you need is a couple solar panels, some batteries, and a fuel tank or 2. Docking port ofcourse, nothing fancy)\u003C/p\u003E\n"},{"CreatedByName":"FREEFALL1984","CreatedById":104993,"CreatedDateTime":"2014-05-10T20:33:59Z","Content":"\n\u003Cp\u003EMinmus, i find it easier than landing on the mun and the science benefits per landing are far higher and there is a lower dv requirement for the actual landing itself, although there are a lot more biomes on the mun meaning extended missions to the mun are far more profitable. But yeah, i always hit minmus first\u003C/p\u003E\n"}]}