{"TopicId":72246,"ForumId":16,"TopicTitle":"Space shuttle","CreatedByName":"Niv200","CreatedById":103280,"CreatedDateTime":"2014-05-13T13:36:42Z","PageNum":1,"Articles":[{"CreatedByName":"Niv200","CreatedById":103280,"CreatedDateTime":"2014-05-13T13:36:42Z","Content":"\n\u003Cp\u003EIm trying to build a space shuttle like Discovery one... All working fine, but when its come to reentery... the shuttle become un-controlable and start spinning like crazy, do you guys have any ideas of how to make a good shuttle? where the center of mass should be in reentery? any tips? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-15T00:34:07Z\u0022 title=\u002205/15/2014 12:34  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 15, 2014\u003C/time\u003E by Niv200\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-13T14:03:00Z","Content":"\n\u003Cp\u003ECenter of Mass should always be in front of the Center of Lift. I\u0027m guessing that after you use up fuel and RCS, you CoM is behind the CoL.\u003C/p\u003E\u003Cp\u003EIn the VAB/SPH, you can right-click on the fuel tanks and set them to their re-entry levels. This will allow you to see where the CoM is.\u003C/p\u003E\u003Cp\u003EJust remember to fill them back up.\u003C/p\u003E\u003Cp\u003EAlso, the landing gear is massless in flight, so it causes the VAB/SPH to lie about the CoM position. So if your CoL/CoM margin is tight, remove the landing gear while in the VAB/SPH, adjust the CoM, then put the gear back on.\u003C/p\u003E\u003Cp\u003EOh yes, and if you have a lot of draggy parts (like intakes) up front, it can also cause your craft to want to flip around.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-13T14:06:05Z\u0022 title=\u002205/13/2014 02:06  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 13, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2014-05-13T14:14:09Z","Content":"\n\u003Cp\u003EDo you have any mods?\u003C/p\u003E\n"},{"CreatedByName":"Niv200","CreatedById":103280,"CreatedDateTime":"2014-05-13T15:30:44Z","Content":"\n\u003Cp\u003EThanks, Il use that, is there any more tips that you know about making space shuttles? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E,\u003C/p\u003E\u003Cp\u003EIm using B9 and Space Shuttle engine\u003C/p\u003E\n"},{"CreatedByName":"Rdivine","CreatedById":66317,"CreatedDateTime":"2014-05-13T15:45:15Z","Content":"\n\u003Cp\u003Ethe center of mass should be BELOW the center of lift, and preferrably the center of lift to be at the same vertical plane as the center of mass. This ensures that the shuttle wont nosedive or tip over due to its immense speed at reentry. the center of lift above the center of mass acts as a balancing effect, allowing the shuttle to return to its original position after being displaced.\u003C/p\u003E\n"},{"CreatedByName":"Wahgineer","CreatedById":59292,"CreatedDateTime":"2014-05-13T15:56:07Z","Content":"\n\u003Cp\u003Eplacing the center of lift inside of the center mass seems to me the best option: the shuttle will be very responsive, have less of a chance of spinning out, and less likely to pitch too far up or down.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-05-13T18:49:19Z","Content":"\n\u003Cp\u003EI would recommend doing some testing with unmanned shuttles. First, launch one into space and re-enter at the speed you expect to re-enter at during a normal mission. Then, reduce the fuel in the tanks of another shuttle to the post-mission levels, and do some atmospheric control testing to determine how best to solve your control problem. Then profit!\u003C/p\u003E\n"},{"CreatedByName":"Niv200","CreatedById":103280,"CreatedDateTime":"2014-05-14T07:36:54Z","Content":"\n\u003Cp\u003EThanks you guys! how can I change the thread to solved?\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-05-14T07:43:44Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003EDon\u0027t\u003C/strong\u003E place your CoM and CoL in the same place. More often than not, it will make the aircraft squirly without excessive control authority devices\u003C/p\u003E\u003Cp\u003EAs someone else said earlier in the thread, place CoL slightly behind CoM. Also, your CoM will likely shift backwards as fuel is expelled, so your CoL should be placed far enough behind the CoM to account for that.\u003C/p\u003E\u003Cp\u003EClever fuel routing or fuel management mods can minimise the CoM shift, but that\u0027s a whole other thread.\u003C/p\u003E\n"},{"CreatedByName":"Niv200","CreatedById":103280,"CreatedDateTime":"2014-05-14T08:43:53Z","Content":"\n\u003Cp\u003EThank you, however, guys - I made over 6 designs in the last few hours, and it still doesnt work... I know the problem is probably cause Im doing something wrong, but in 4 of the 6 designs I made the center of mass and center of lift were the same, the shuttle was still spinning crazy throught the atmosphere reentery and was hard to control afterwards, in 1 design I made the center of mass infront of center of lift, it didnt worked as well, and in the other, I placed center of mass behind center of lift... it didnt worked as well... all of the shuttles I made didnt worked, Im feeling bad... the amout of kerbals I killed haha (jeb wasnt one of them \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E )... I deleted all of them since all didnt worked, do you guys have any pictures that might help me?\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-05-14T09:13:50Z","Content":"\n\u003Cp\u003EIt\u0027s a ganky solution, but sticking a few reaction wheels into the design is usually a viable way of maintaining control authority in an unbalanced ship.\u003C/p\u003E\u003Cp\u003EIt might be easier for you to post a pic of the last shuttle you made (CoM behind CoL) for one of us to diagnose anything obvious.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-14T11:16:34Z","Content":"\n\u003Cp\u003ETry reading through this. It gives a pretty good explanation of aero basics.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/52080-Basic-Aircraft-Design-Explained-Simply-With-Pictures\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/52080-Basic-Aircraft-Design-Explained-Simply-With-Pictures\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter that, you can work through this tutorial. It follows the above thread. You build an airplane and play with the CoM/CoL relationship.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/65638-Basic-Airplane-Space-Plane-Aero-Tutorial\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/65638-Basic-Airplane-Space-Plane-Aero-Tutorial\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThere are lots od other tutorials out there too. Videos and other tutorial articles. Although you mignt need to dig a little.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/forums/54-Tutorials\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/forums/54-Tutorials\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Niv200","CreatedById":103280,"CreatedDateTime":"2014-05-14T15:37:57Z","Content":"\n\u003Cp\u003Ethanks guys, Il update you with the shuttle soon, how do I changed the thread to asnwered?\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-14T15:44:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Niv200\u0022 data-cite=\u0022Niv200\u0022\u003E\u003Cdiv\u003Ethanks guys, Il update you with the shuttle soon, how do I changed the thread to asnwered?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EEdit the first post and click \u0022Go Advanced\u0022 From there you can select \u0022answered\u0022 from the dropdown and save.\u003C/p\u003E\n"},{"CreatedByName":"Raven.","CreatedById":99340,"CreatedDateTime":"2014-05-14T16:12:47Z","Content":"\n\u003Cp\u003ELike multiple people have responded, the CoL should be behind the CoM.\u003C/p\u003E\u003Cp\u003EI do have one question for you, are you running FAR? FAR has got a nifty tool in the VAB/SPH that gives you a rough idea of how well the shuttle will fly; it\u0027s got a graph that you can run that will give you a range of values for different speeds. For shuttles, I do the graph from Mach 1 to Mach 8, which are all speeds that the shuttle will experience upon reentry.\u003C/p\u003E\u003Cp\u003EFAR also gives you realistic drag as well.\u003C/p\u003E\n"},{"CreatedByName":"thescientist","CreatedById":69046,"CreatedDateTime":"2014-05-14T16:19:19Z","Content":"\n\u003Cp\u003EOoops sorry I didn\u0027t see the second page\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-14T16:26:47Z\u0022 title=\u002205/14/2014 04:26  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 14, 2014\u003C/time\u003E by thescientist\u003C/strong\u003E\n\u003C/span\u003E\n"}]}