{"TopicId":72701,"ForumId":16,"TopicTitle":"Is there actually ANY way to speed up ksp?","CreatedByName":"Barney6262","CreatedById":111281,"CreatedDateTime":"2014-05-18T09:29:33Z","PageNum":1,"Articles":[{"CreatedByName":"Barney6262","CreatedById":111281,"CreatedDateTime":"2014-05-18T09:29:33Z","Content":"\n\u003Cp\u003ESo, same as a lot of people, i struggle to get above 5 fps when trying to dock two ships that have over 400 parts each. This is pretty much game breaking as it is unrealistic to dock large items. So my question is, is there any was to reliably increase fps. I have seen lots of suggestions such as editing the maxphysics settings (this is a bad option apparently) but also people saying ksp is only 32bit so cannot use more than 4gb of ram. \u003C/p\u003E\u003Cp\u003EIn practice, when running ksp my cpu doesnt even get halfway loaded, my gpu doesn\u0027t even have about 20% max load. But my ram sits at about 5.25. Suggesting that ksp can only use 4gb (the other 1.25 is monitoring and webpages) so is there anyway to force ksp to use more ram? as that may fix the issue.... \u003C/p\u003E\u003Cp\u003EThanks for any input \u003C/p\u003E\u003Cp\u003E~Barney6262\u003C/p\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-05-18T10:23:18Z","Content":"\n\u003Cp\u003EYou are correct about KSP being 32 bit and therefor limited in memory use. Nothing anybody (including SQUAD) can do about that until a stable 64bit version of unity is released.\u003C/p\u003E\u003Cp\u003EWhat you can do yourself is to install reduced texture packs and/or run memory compression mods to free up some memory. Besides that the only thing there is to do is have patience. KSP is still alpha software and poorly optimized.\u003C/p\u003E\n"},{"CreatedByName":"Mipe","CreatedById":109421,"CreatedDateTime":"2014-05-18T10:29:51Z","Content":"\n\u003Cp\u003E1. Use less parts.\u003C/p\u003E\u003Cp\u003E2. Use less mods.\u003C/p\u003E\u003Cp\u003E3. Use reduced texture packs / texture optimization addons.\u003C/p\u003E\u003Cp\u003E4. Buy a monster rig (i7/killer graphics/SSD)\u003C/p\u003E\u003Cp\u003E5. Wait for SQUAD to optimize the game.\u003C/p\u003E\u003Cp\u003EThose are your options right now.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-05-18T11:05:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mipe\u0022 data-cite=\u0022Mipe\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E4. Buy a monster rig (i7/killer graphics/SSD)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWouldn\u0027t actually help the OP. Because KSP is a 32 bit program it is limited to 4GB of RAM, (if you\u0027re lucky, I run out of memory at 3.5GB because of mods). So the best thing you can do is to build more efficient. (Only reason you should be trying to dock Two 400 part craft together is for an eve ascent)\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-05-18T11:43:26Z","Content":"\n\u003Cp\u003EIt\u0027s not the RAM that\u0027s giving you problems.\u003C/p\u003E\u003Cp\u003EIt\u0027s the fact that your CPU can only use 1 core for the physics calculations. THAT\u0027S the bottleneck.\u003C/p\u003E\u003Cp\u003EAlso a 32bit problem IIRC\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-05-18T11:46:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Barney6262\u0022 data-cite=\u0022Barney6262\u0022\u003E\u003Cdiv\u003ESo, same as a lot of people, i struggle to get above 5 fps when trying to dock two ships that have over 400 parts each.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t think I have such problems but it\u0027s true that I haven\u0027t tried to dock such complex ships. Unless your PC is swapping to disk (which I believe it is not), you can only help it with better CPU. Particularly, as high clock speed as possible. Number of cores - 2 or more, but 2 are plenty for KSP at the moment.\u003C/p\u003E\u003Cp\u003EMemory utilization plays no role in this.\u003C/p\u003E\u003Cp\u003EThe fact that KSP is 32-bit plays no role in this (you might expect something like 5% improvement from getting a 64-bit program, so 5.25 FPS instead of 5 FPS).\u003C/p\u003E\u003Cp\u003EThe problem - probably - lies in physics complexity. To run properly two ships side by side, the game has to evaluate collisions of each two parts every frame.\u003C/p\u003E\u003Cp\u003EFor docking a 10-part ship to a 2000-part ship that means evaluating 10 parts to 2000 parts, i.e. 20,000 collision checks.\u003C/p\u003E\u003Cp\u003EFor docking a 400-part ship to a 400-part ship that means evaluating 160,000 collision checks.\u003C/p\u003E\n"},{"CreatedByName":"Tank Buddy","CreatedById":69635,"CreatedDateTime":"2014-05-18T12:10:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mipe\u0022 data-cite=\u0022Mipe\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E4. Buy a monster rig (i7/killer graphics/SSD)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s exactly what I have, and I don\u0027t get any noticeable lag until \u002B425 parts. Probably because I\u0027m starting at over 100 FPS before you add lots of parts.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-18T12:59:09Z","Content":"\n\u003Cp\u003EDon\u0027t dock two 400 part ships! As you say, that\u0027s going to be sluggish on just about any computer. When designing stuff, try and be mindful of the part count. For example stacking an FL-T400, 200, and 100 might get you a slightly lighter ship but it\u0027s pushing the part count up compared to just using one 800 tank.\u003C/p\u003E\n"},{"CreatedByName":"Barney626","CreatedById":59898,"CreatedDateTime":"2014-05-18T13:57:20Z","Content":"\n\u003Cp\u003EOk so, thanks for all the replies helps see the issues.\u003C/p\u003E\u003Cp\u003EStarting off, a number of you said get a better cpu or the cpu is the limiting factor. I highly doubt that as i run an overclocked I5-4670k at 4.2ghz with all cores unparked and allocated to ksp. I.e. all the cpu is running ksp. This results in less than half the cpu power being used and still lag. It is more likely the ram, as confirmed by another few of you when i see a non fluctuating ram usage of around 5gb in total. This would agree with the 32bit theory i had and is the only thing that (in that situation) would be maxed out.... \u003C/p\u003E\u003Cp\u003EFinally, i would just like to say that in reality, i\u0027m trying to dock two ships, each with over 700 parts. Plus a number of mods \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E this was an unrealistic attempt to say the least and was merely to see what kind of stupidly large stuff i can dock together without it all blowing up (as usual). \u003C/p\u003E\u003Cp\u003ESo pretty much, for me at least it seems to be an issue of ram restriction through a 32bit program. I guess we can only wait for the 64bit version to come out :/\u003C/p\u003E\u003Cp\u003Ethanks anyway guys\u003C/p\u003E\u003Cp\u003E~Barney6262\u003C/p\u003E\u003Cp\u003E(oh btw, i managed to use the wrong account for the op... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\n"},{"CreatedByName":"Xaiier","CreatedById":22833,"CreatedDateTime":"2014-05-18T14:29:24Z","Content":"\n\u003Cp\u003ENo, it doesn\u0027t matter how godly your CPU is, KSP can only utilize so much of it because the physics can only run on one core. If ram was your problem then you would be crashing.\u003C/p\u003E\u003Cp\u003EYour CPU is literally the best possible, so you have it better than a lot of people do.\u003C/p\u003E\u003Cp\u003E(If you want to screw with physics rates n-stuff, try my mod in my sig)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-18T14:32:39Z\u0022 title=\u002205/18/2014 02:32  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 18, 2014\u003C/time\u003E by Xaiier\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-05-18T14:38:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Barney626\u0022 data-cite=\u0022Barney626\u0022\u003E\u003Cdiv\u003EOk so, thanks for all the replies helps see the issues.\u003Cp\u003EStarting off, a number of you said get a better cpu or the cpu is the limiting factor. I highly doubt that as i run an overclocked I5-4670k at 4.2ghz with all cores unparked and allocated to ksp. I.e. all the cpu is running ksp. This results in less than half the cpu power being used and still lag. It is more likely the ram, as confirmed by another few of you when i see a non fluctuating ram usage of around 5gb in total. This would agree with the 32bit theory i had and is the only thing that (in that situation) would be maxed out.... \u003C/p\u003E\u003Cp\u003EFinally, i would just like to say that in reality, i\u0027m trying to dock two ships, each with over 700 parts. Plus a number of mods \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E this was an unrealistic attempt to say the least and was merely to see what kind of stupidly large stuff i can dock together without it all blowing up (as usual). \u003C/p\u003E\u003Cp\u003ESo pretty much, for me at least it seems to be an issue of ram restriction through a 32bit program. I guess we can only wait for the 64bit version to come out :/\u003C/p\u003E\u003Cp\u003Ethanks anyway guys\u003C/p\u003E\u003Cp\u003E~Barney6262\u003C/p\u003E\u003Cp\u003E(oh btw, i managed to use the wrong account for the op... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt doesn\u0027t matter how many CPU cores you allocate to KSP, it can only use 1 core for physics calculation.\u003C/p\u003E\u003Cp\u003ESo even though only a small part of your CPU is actually working, that small part has to do everything alone, and it can\u0027t do it fast enough\u003C/p\u003E\u003Cp\u003ERAM doesn\u0027t make you lag. If you go over the limit, KSP will simply crash\u003C/p\u003E\n"},{"CreatedByName":"blizzy78","CreatedById":68543,"CreatedDateTime":"2014-05-18T15:20:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EFor docking a 10-part ship to a 2000-part ship that means evaluating 10 parts to 2000 parts, i.e. 20,000 collision checks.\u003Cp\u003EFor docking a 400-part ship to a 400-part ship that means evaluating 160,000 collision checks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne would think that KSP uses some sort of bounding box optimization, in that where the bounding boxes of those two ships do not intersect each other, there won\u0027t be any collision checks between those two ships. In the vacuum of space, at least.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-18T15:31:41Z","Content":"\n\u003Cp\u003EIt\u0027s pretty clear that Unity (or maybe it\u0027s PhysX, what do I know), or at least KSP does have that kind of optimization, given the massive slow-downs when you crash a vessel into something. It\u0027s fairly clear that it went from a state of not doing many calculations to suddenly having to do ALL THE CALCULATIONS.\u003C/p\u003E\u003Cp\u003ETo the OP: Given your specs, you only have two, maybe three options to get any improved performance that doesn\u0027t involve removing a lot of parts (which, for the love of god, at 1,400 parts in a scene you really should anyway).\u003C/p\u003E\u003Cp\u003EOne is to wait for Unity 5 to be released and Squad to update KSP to it. Unity 5 will come with the PhysX 3.3 SDK which means multithreaded physics support, which means huge potential performance gains for people using multi-core processors. With Unity 4, physics is stuck on a single thread, and a 32-bit one at that. With KSP being such a physics-heavy game, this bottleneck eclipses everything else that the game is doing. The increase to 64-bit instructions probably won\u0027t give all that much of a performance boost but it will solve some issues.\u003C/p\u003E\u003Cp\u003EThe second is to upgrade your processor. \u003Cstrong\u003EUsually\u003C/strong\u003E an i5 is perfectly fine for gaming. In this case though, getting the absolute maximum performance out of the single CPU core being used is essential. An i7 might increase performance, \u003Cstrong\u003Every slightly\u003C/strong\u003E. Really only an option if you have lots of money to throw away on something that isn\u0027t a sure bet. It\u0027s possible you\u0027d get a lesser performing chip that can\u0027t overclock nearly as much as your current i5. I\u0027m only mentioning this because the i7 series processors are all built for higher clock speeds than the i5 processors. (Also, unparking cores really doesn\u0027t do anything other than waste power. The internal control on Intel\u0027s chips is actually amazing.)\u003C/p\u003E\u003Cp\u003EThe third option, if you haven\u0027t already, is to build an appropriate custom liquid cooling system. Lots of rads, lots of fans, total overkill, and then see if you can eke-out a few more hundred MHz from the CPU. That\u0027s a similarly large undertaking that may have absolutely no payoff in terms of making KSP run any faster.\u003C/p\u003E\u003Cp\u003EEdit: Fourth option is a work-around. You could use \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/69363-0-23-5-Time-Control-4-23-14-v11-1\u0022 rel=\u0022external nofollow\u0022\u003ETime Control\u003C/a\u003E to slow the game clock down so that you can maintain a usable frame rate. Doing so will make movement look kinda choppy, but the point is that you can actually control the game.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-18T15:42:59Z\u0022 title=\u002205/18/2014 03:42  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 18, 2014\u003C/time\u003E by phoenix_ca\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-05-18T15:33:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022blizzy78\u0022 data-cite=\u0022blizzy78\u0022\u003E\u003Cdiv\u003EOne would think that KSP uses some sort of bounding box optimization, in that where the bounding boxes of those two ships do not intersect each other, there won\u0027t be any collision checks between those two ships. In the vacuum of space, at least.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s a sphere with a 2.3km radius. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut I think you\u0027re right. Skipping collision detection until ships are very close should reduce lag. But this still doesn\u0027t solve the problem at the point where it\u0027s needed most: while docking.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-05-18T15:50:48Z","Content":"\n\u003Cp\u003EI\u0027m pritty sure the game also have to do collision detecting between parts of the same ship. Just saying, unless you use the welder mod they are still individual parts\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-18T16:08:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirrobert\u0022 data-cite=\u0022Sirrobert\u0022\u003E\u003Cdiv\u003EI\u0027m pritty sure the game also have to do collision detecting between parts of the same ship. Just saying, unless you use the welder mod they are still individual parts\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but you can safely assume there is a lot of programming awesome going into intelligently determining when and where those calculations need to be done. I highly doubt that the lowest engine of a rocket is doing any collision detection with the top part, unless they actually get in proximity to each other.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-18T16:25:44Z","Content":"\n\u003Cp\u003EI recall the collision detection being hampered by Unity lacking a cylinder primitive. With rockets being LOADS of cylinders, they\u0027re all having to be done as meshes, which are much more CPU intensive.\u003C/p\u003E\u003Cp\u003EThere\u0027s also going to be other aspects of the physics. The game has to handle forces and torques exerted on each part by the parts connected to it, and the forces those parts apply depend on the parts connected to THEM, and so on. It\u0027s easy to see how the calculations could really skyrocket if not well optimised.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-18T16:41:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EI recall the collision detection being hampered by Unity lacking a cylinder primitive.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E*groan*\u003C/p\u003E\u003Cp\u003ELet\u0027s hope Unity 5 has greener pastures this year and Squad embraces it completely.\u003C/p\u003E\n"},{"CreatedByName":"Barney626","CreatedById":59898,"CreatedDateTime":"2014-05-18T17:03:50Z","Content":"\n\u003Cp\u003Einteresting. My question is if only one core is being used for the game, with nothing else intensive running on the system, why are the loads for all 4 cores seemingly equal? note on unparking cores, in OTHER games i saw an fps increase. I haven\u0027t tested it on ksp nor bothered to see if it made a difference so was only noting it as a possible factor \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003Ei do currently have a corsair H100i on the cpu but the overclock is only an automatic one from my motherboard (cba to do a manual one) \u003C/p\u003E\u003Cp\u003Ei guess the best option is simply to wait for new software updates as i don\u0027t (and im sure many players of ksp with fps issues) have a ton of money to throw at new hardware. obviously, an easy fix would be less parts and less mods, but, Where\u0027s the fun in that? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-18T17:40:36Z","Content":"\n\u003Cp\u003EAs a general rule, unparking cores is dubious at best. Usually CPU cores aren\u0027t parked anyway so it\u0027s a non-issue. I highly suspect your \u0022FPS increase\u0022 was caused by other factors. Every rigorous test I\u0027ve seen on the issue has come-out in the \u0022doesn\u0027t do anything useful\u0022 category.\u003C/p\u003E\u003Cp\u003EAs for loads on cores seeming equal, are you sure that\u0027s what you\u0027re seeing? It seems highly unlikely for KSP. It\u0027s possible its simply switching the thread between them very quickly, which is entirely normal.\u003C/p\u003E\u003Cp\u003EAn H100i pales in comparison to the thermal performance of a custom loop that\u0027s properly constructed. Those all-in-one units are good for noise reduction, but not if what you want is good heat dissipation. If that\u0027s what you\u0027re after then money is better spent on a more expensive but complete cooling system (preferably with the highest flow rate you can muster...biiiiiiig pumps are good).\u003C/p\u003E\u003Cp\u003EYes, the best option is to wait. This \u003Cstrong\u003Eshould\u003C/strong\u003E be fixed by this year\u0027s end (finally). That, or you could try cooling with liquid nitrogen or liquid helium. I mean, that\u0027s pretty esoteric, and \u003Cstrong\u003Eextremely\u003C/strong\u003E expensive, but hey, it\u0027s possible. And you could run KSP for a few hours smooth as silk.\u003C/p\u003E\n"},{"CreatedByName":"Clockwork_werewolf","CreatedById":90749,"CreatedDateTime":"2014-05-18T18:25:53Z","Content":"\n\u003Cp\u003EWith 4gb of ram with extra to spare for other processes and the operating system that has been maxed until unity 5 (we hope).\u003C/p\u003E\u003Cp\u003E4.2 ghz cpu with more than one core (the second to run operation system) is almost as good as you can get though the above postings about liquid cooling may up that a little.\u003C/p\u003E\u003Cp\u003EIt is worth noting that although the GPU is not the most important part of a system for KSP it can make a difference. I was running a Geforce 9800 (released February 21, 2008) and upgraded to a geforce 760 ti. This almost \u003Cstrong\u003Edoubled\u003C/strong\u003E the parts I could use and still be at 60fps. This is a fairly extreme upgrade but it may be worth noting. My Cpu is a quad core i7 at 2.67 ghz and I have 6 Gb of ram just to put the GPU upgrade into context.\u003C/p\u003E\n"},{"CreatedByName":"xcorps","CreatedById":96531,"CreatedDateTime":"2014-05-18T18:33:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E4. Buy a monster rig (i7/killer graphics/SSD)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESSD does nothing for FPS. It\u0027s good for load times, but not FPS.\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-05-19T02:45:28Z","Content":"\n\u003Cp\u003EIf you haven\u0027t already, you might try texture reduction. There are three ways to do this: reducing texture size in the game\u0027s graphics settings, the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59005-0-23-5-Release-3-1-Active-Texture-Management-Save-RAM-without-reduction-packs!\u0022 rel=\u0022external nofollow\u0022\u003EActive Texture Management\u003C/a\u003E mod, and texture reduction packs.\u003C/p\u003E\u003Cp\u003EEven though my video card has 1 GB of ram, this was the major limitation for me. I now use Active Texture Management-Aggressive and reduced the textures setting to one half. You probably won\u0027t need to go quite that far, but it\u0027s an easy and free way to see if that\u0027s the issue.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-05-19T09:45:33Z","Content":"\n\u003Cp\u003EOn top of all that has been said, I find that rigidity of structures also is an issue: bending, flapping \u0026amp;c translates directly into lag. In some (few) cases I could actually improve lag by adding MOAR STRUTS. Most pronounced when the dangly bits were big bundles of strapped-on jet engines -- presumably because the constantly-changing direction of thrust had ramifications throughout all parts of the vessel.\u003C/p\u003E\u003Cp\u003EOn my box, 400-part rockets usually give me no lag and even 500 parts may work, depending on design. However, huge planes (lots of wings flapping \u0026amp; bending in the wind) become distinctly laggy at 300 and quite unbearable at 400.\u003C/p\u003E\n"},{"CreatedByName":"phoenix_ca","CreatedById":50380,"CreatedDateTime":"2014-05-19T14:35:21Z","Content":"\n\u003Cp\u003EI\u0027d say that\u0027s where PWings comes in.\u003C/p\u003E\n"}]}