{"TopicId":73256,"ForumId":16,"TopicTitle":"Looking for advice on updating the game","CreatedByName":"Spark Plug","CreatedById":111693,"CreatedDateTime":"2014-05-24T15:09:16Z","PageNum":1,"Articles":[{"CreatedByName":"Spark Plug","CreatedById":111693,"CreatedDateTime":"2014-05-24T15:09:16Z","Content":"\n\u003Cp\u003EHi there\u003C/p\u003E\u003Cp\u003EI started out playing version 0.22 of KSP and have continued for about half a year and only now am I considering an update.\u003C/p\u003E\u003Cp\u003EI\u0027m wondering now whether I should update the files of the mods that I make use of BEFORE updating the game through the launcher, or install the game update patch and update my mod files after that.\u003C/p\u003E\u003Cp\u003EI suppose I\u0027m concerned about what happens to the files in the GameData folder when the patch installs. So which of the two is the \u0022better\u0022 thing to do?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-25T07:39:19Z\u0022 title=\u002205/25/2014 07:39  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 25, 2014\u003C/time\u003E by Spark Plug\u003C/strong\u003E\n\u003Cbr\u003Eoriginal query was answered\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-05-24T15:13:31Z","Content":"\n\u003Cp\u003EThe launcher/patcher does not touch non-KSP files, so all your addons should be fine unless they either change a stock part cfg (FAR) or have been broken by changes between .22 and .23.5\u003C/p\u003E\u003Cp\u003EI guess the best option would be to first backup your saves just in case, then start the update, and while it\u0027s updating check for newer versions of your addons.\u003C/p\u003E\u003Cp\u003EUpdate the addons after the KSP update completes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-05-24T15:25:01Z","Content":"\n\u003Cp\u003EYou should always update the base game first, then update your mods. This way you don\u0027t get any conflicts.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-05-24T15:46:12Z","Content":"\n\u003Cp\u003EKeep both. Make a new install with 0.23.5 then add the (updated) mods you want. If you want to continue a saved game from the old version in the new game (and have all the required mods for it) just copy its folder in saves\\\u0026lt;save name\u0026gt;.\u003C/p\u003E\u003Cp\u003EUntil recently I had demo 0.18, 0.22, 0.23 and 0.23.5 with and without mods installed. Tidied-up a bit now because I just wasn\u0027t using 0.22 and 0.23 any more.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-24T16:25:30Z","Content":"\n\u003Cp\u003EI do as Pecan does and do a fresh install with each update. Mods are hit or miss compatibility-wise when a new update comes out, so I like to keep the install of the previous version that was working with everything until all the mods I use are updated. Once the new version is working satisfactorily, I generally delete the old one after saving .craft files, screenshots and savegames (if they\u0027re compatible).\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-24T16:28:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EKeep both. Make a new install with 0.23.5 then add the (updated) mods you want. If you want to continue a saved game from the old version in the new game (and have all the required mods for it) just copy its folder in saves\\\u0026lt;save name\u0026gt;.\u003Cp\u003EUntil recently I had demo 0.18, 0.22, 0.23 and 0.23.5 with and without mods installed. Tidied-up a bit now because I just wasn\u0027t using 0.22 and 0.23 any more.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I would highly recommend this route. Don\u0027t update your current install but start a new one. Then download and install the updated mods for that version. After that, you can copy your save games from 0.22 into your fresh 0.23.5 install. Doing it this way will prevent a lot of problems with outdated files.\u003C/p\u003E\u003Cp\u003EAt least two examples of why I suggest this is that sometimes the settings.cfg has weird values in it that have caused problems in 0.23.5. Also, a lot of mods changed install location from the \u0022Plugins\u0022 to the \u0022GameData\u0022 folder. So it\u0027s possible that if you update a mod, there could be big conflicts with old files scattered all over.\u003C/p\u003E\u003Cp\u003EYou may also wish to look through this thread (shameless self promotion). There are a few things you can do to reduce crashes and problems with 0.23.5 once you download it. (Specifically the new, large decoupler needs a slight modification to its part.cfg file.)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/77327-20May-0-23-5-Issues-Fix-Crashes-Decoupler-EVA-Career-Save-Won-t-Start-more\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/77327-20May-0-23-5-Issues-Fix-Crashes-Decoupler-EVA-Career-Save-Won-t-Start-more\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBy the way, here\u0027s a link to another thread listing most of the updated mods for 0.23.5\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/74457-ARM-Pack-0-23-5-Mod-Compatibility-Thread\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/74457-ARM-Pack-0-23-5-Mod-Compatibility-Thread\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Spark Plug","CreatedById":111693,"CreatedDateTime":"2014-05-25T07:37:33Z","Content":"\n\u003Cp\u003EAlright! I\u0027ve got my things in working order now.\u003C/p\u003E\u003Cp\u003EThanks to all those who replied with tips and links to further reading!\u003C/p\u003E\n"}]}