{"TopicId":73589,"ForumId":16,"TopicTitle":"Just how many asteroids?!","CreatedByName":"Blargenth","CreatedById":64158,"CreatedDateTime":"2014-05-29T21:11:21Z","PageNum":1,"Articles":[{"CreatedByName":"Blargenth","CreatedById":64158,"CreatedDateTime":"2014-05-29T21:11:21Z","Content":"\n\u003Cp\u003ESo I started up a new campaign due to a hard drive failure an am now presented with the new release of KSP including imminet asteroids. Being that I want to be as efficient as possible I\u0027m tracking every asteroid I find and planning to divert the ones that will impact... \u003C/p\u003E\u003Cp\u003Emy question is this.... JUST HOW MANY ASTEROIDS ARE THERE GONNA BE?!\u003C/p\u003E\u003Cp\u003ERight now I\u0027ve found over 3 dozen in the last five minutes! 3 of which will impact, two of which have Kerbin exit trajectories but no entrance trajectory. And the rest are just fly by\u0027s or none effected by kerbin. But every time I go back to check my tracking station, 3 more question marks appear!\u003C/p\u003E\u003Cp\u003EThis is madness! Will there be an end to the amount of asteroids that appear because I want to do more then dodge giant space rocks!\u003C/p\u003E\u003Cp\u003EPS: In the time it took me to write this post? 6 more appeared! GO AWAY YOU GIANT SPACE ROCKS\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-29T21:50:28Z\u0022 title=\u002205/29/2014 09:50  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 29, 2014\u003C/time\u003E by Blargenth\u003C/strong\u003E\n\u003Cbr\u003EMORE\n\u003C/span\u003E\n"},{"CreatedByName":"TechnicalK3rbal","CreatedById":86903,"CreatedDateTime":"2014-05-29T21:14:42Z","Content":"\n\u003Cp\u003ENope. They just keep spawning, but if you don\u0027t track them, they just go away.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-05-29T21:27:02Z","Content":"\n\u003Cp\u003ERemember: KSP asteroids, however big, are no threat to Kerbin. That\u0027s similar to the planned NASA mission which is also not about saving Earth from asteroid threat, but about capturing an otherwise harmless asteroid for scientific purposes.\u003C/p\u003E\n"},{"CreatedByName":"Blargenth","CreatedById":64158,"CreatedDateTime":"2014-05-29T21:49:52Z","Content":"\n\u003Cp\u003EThanks guys that makes things alot simpler.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-29T21:55:43Z","Content":"\n\u003Cp\u003EI\u0027m not certain (because I\u0027ve been focused on something else recently), but I think the more you track, the more that show up. So you won\u0027t want to necessarily track them all.\u003C/p\u003E\n"},{"CreatedByName":"Shna_na","CreatedById":14950,"CreatedDateTime":"2014-05-29T22:17:38Z","Content":"\n\u003Cp\u003EYou are aware that you can un-track them, yes? Just do this for all of the asteroids that don\u0027t enter the SOI of Kerbin. If this doesn\u0027t de-clutter enough, untrack all that don\u0027t go below a certain altitude (EG: 1000KM) or that are too inclined. That\u0027ll get through a lot of them.\u003C/p\u003E\n"},{"CreatedByName":"SpacedCowboy","CreatedById":92106,"CreatedDateTime":"2014-05-30T00:13:50Z","Content":"\n\u003Cp\u003EO!M!G!, The asteroids are coming! Quickly run around in circles with arms flailing in the air! Sound the Emergency Alarm!,,,(Blaaart, Blaaart, Blaaart! \u0022The asteroids are coming, the asteroids are coming! Chill.,.,., If you\u0027re not up to it, just don\u0027t track them\u003C/p\u003E\n"}]}