{"TopicId":73704,"ForumId":16,"TopicTitle":"Space Stations - Micro to Massive","CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-31T01:24:37Z","PageNum":1,"Articles":[{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-31T01:24:37Z","Content":"\n\u003Cp\u003ESo I\u0027m starting to get into building space stations and was wondering what most people considered a \u0022massive space station.\u0022\u003C/p\u003E\u003Cp\u003EDo you guys think about it in terms of physical size? Mass? Part Count? Elegance of Design?\u003C/p\u003E\u003Cp\u003EI guess this questions is more of an exploration in curiosity.\u003C/p\u003E\u003Cp\u003EI suppose in the same vein, what do you consider to be the \u0022minimum\u0022 elements needed for a space station?\u003C/p\u003E\u003Cp\u003EAnd perhaps what do you consider to be the hardest thing about designing/building a space station?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-03T19:17:02Z\u0022 title=\u002206/03/2014 07:17  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 3, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-05-31T01:51:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003ESo I\u0027m starting to get into building space stations and was wondering what most people considered a \u0022massive space station.\u0022\u003Cp\u003EDo you guys think about it in terms of physical size? Mass? Part Count? Elegance of Design?\u003C/p\u003E\u003Cp\u003EI guess this questions is more of an exploration in curiosity.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPart count is probably the biggest qualifier for a \u0022massive\u0022 station because of the slow down. After that.. /shrug\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EI suppose in the same vein, what do you consider to be the \u0022minimum\u0022 elements needed for a space station?\u003Cp\u003EAnd perhaps what do you consider to be the hardest thing about designing/building a space station?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think the minimum requirement for a space station is that it is independently controllable (probe core or CM), has attitude control (SAS or CM) and regenerates power (solar panels). Docking ports are \u003Cem\u003Ealmost\u003C/em\u003E required, but I suppose not an absolute necessity. RCS is super handy for station keeping and orbital adjustments. Anything beyond that is gravy. Typically, crew housing, multiple docking ports, extra fuel tanks and an MPL are the most common additions. \u003C/p\u003E\u003Cp\u003EI think the hardest part is figuring out the layout of the modules and how to get some of the more oddly shaped stations modules into orbit under my available fairings efficiently.\u003C/p\u003E\u003Cp\u003EI think the most important issue to address when designing a station is the stations purpose. I typically build stations to serve one or more of the following purposes:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EFuel depot\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERendezvous point\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EComm station (with Remotech)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EScience lab\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFuel depots will typically have lots of extra fuel tanks. Rendezvous stations will have extra crew capacity and a relative abundance of docking ports on the equatorial plane of the station. Comm stations have multiple directional antennae. Science labs, obviously, have MPL\u0027s and space for docking a lander.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-05-31T03:25:14Z","Content":"\n\u003Cp\u003EI will answer the second question first. \u003C/p\u003E\u003Cp\u003ETo me a station is a place for kerbals to spend extended periods of time in space, meaning it must have some place for them to live, and some way for them to get home.\u003C/p\u003E\n"},{"CreatedByName":"Heagar","CreatedById":67859,"CreatedDateTime":"2014-05-31T10:40:18Z","Content":"\n\u003Cp\u003EMost of your questions depends of the computer a player have and her/his intentions regarding her/his spacestation.\u003C/p\u003E\u003Cp\u003EIt may be only a station for research/refuelling/cargo hold or can be all. In any case it is important to have a look at the partcount, because you have to have enough computer-power to run the game when your spaceships (you have to add their partcount to your station) are arriving. It can be a pain in the ass when you are running a slideshow while attempting to dock. To make things worse, you will have an additional framedrop to take into account if you try to take a video of that.\u003C/p\u003E\u003Cp\u003EConclusion: The more and the bigger ships you want to dock, the smaller the space-station should be.\u003C/p\u003E\u003Cp\u003EMinimum requirements:\u003C/p\u003E\u003Cp\u003EA pod, an ASAS or some RCS (to kill an unwanted rotation), a battery and an solar cell/RTG. Most important is to have all sorts of docking ports of course (to be able to dock all kinds of ships you have/design in the future). And maybe some docking nodes where you can expand your station in the future when new parts comming out.\u003C/p\u003E\u003Cp\u003EHardest thing:\u003C/p\u003E\u003Cp\u003EThat is not the design. Normally i build a mockup first and test it on the launchpad or parts of it in space (escape pods e.g.).\u003C/p\u003E\u003Cp\u003ETricky it becomes when you have an modular design with a very long structures witch you have to dock going in reverse (because of the wobbeling).\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-05-31T13:32:30Z","Content":"\n\u003Cp\u003EAs above-mentioned, I start with purpose: my stations are invariably the centre of operations for whichever planet they\u0027re orbiting, and its moons, if applicable.\u003C/p\u003E\u003Cp\u003EThat means, first, they have to have docking ports and refuelling capacity (including RCS) for landers. Landers plural as I consider primary/backup a minimum; had I not been planning to land repeatedly it wouldn\u0027t be worth putting a station there and the chances are backup will be needed at some point. It needs another port for a tanker to refuel the station itself.\u003C/p\u003E\u003Cp\u003ESecondly it needs a general-purpose but non-landing tug/transfer/rescue tractor vehicle, and a docking-port for it. That usually makes any orbital adjustment burns for the station as well but I usually put a couple of small, 24-77 engines on the station itself as well, just in case I want to do something with it while the tractor is off doing something else. The station will need more fuel capacity for the tractor too. Although most of my stuff uses large docking-ports the landers will be using standard ones and it\u0027s possible (but unlikely) they\u0027ll be a few juniours around too. The tractor will have symmetrical pairs of each but I\u0027ll also have probe-core equipped adapters docked to the station as well. The probe-cores on these are just so I can orientate them and enable SAS to hold them steady for docking.\u003C/p\u003E\u003Cp\u003EThe minimal crew I assume to be 3; lander pilot, tractor pilot, station commander. As a long-stay station they need 2 x accommodation (6) which I usually count as Hitch-Hiker\u0027s \u002B the \u0027spare\u0027 lander and tractor seats. Crew-rotation and visiting missions add to the requirements for docking-ports and accommodation. I tend to add a lab just because it looks so good from the outside (no internals, of course).\u003C/p\u003E\u003Cp\u003EThen I deck it out with comms and other equipment, tending to make it look busy even if I don\u0027t actually need them. Somewhere I\u0027ll tuck a couple of small Xenon tanks as well, \u0027just in case\u0027.\u003C/p\u003E\u003Cp\u003EThe hardest thing I find is using a cupola - I can\u0027t give them up! The view can be great but I want it looking at the station, not the sky/ground. That means attaching it facing \u0027inwards\u0027, with the obvious problem that that means at least partly blocking the centre window. Whatever you do with it though it\u0027s a pig to launch because of its mass and drag so more or less has to go at the bottom of the payload.\u003C/p\u003E\u003Cp\u003EI have another self-imposed constraint, which is that Kerbals should not need RCS while moving around the station and that movement within the \u0027accommodation section\u0027 should not even need EVA. That, ladders and the logic of Connected Living Spaces slightly restricts the ways in which I can arrange everything. In practice I don\u0027t find that a problem.\u003C/p\u003E\u003Cp\u003EAll that needs solar panels, RTGs, batteries, large SAS and the usual accoutrements.\u003C/p\u003E\u003Cp\u003EFinally, if it\u0027s a station around Kerbin, it\u0027ll be refuelling quite a few ships so it needs extra fuel capacity - which usually means more ports for tankers.\u003C/p\u003E\n"},{"CreatedByName":"Rickenbacker","CreatedById":2349,"CreatedDateTime":"2014-05-31T13:47:45Z","Content":"\n\u003Cp\u003EI tend to build small, specialised stations. i currently have a station with a lab and a mid-sized fuel tank in orbit around the Mun, from which a small lander makes trips to the surface to dig out science. I first used it around Minmus, then moved it to the Mun to do the same thing. Around Kerbin I have a larger station, with some fuel, a (Interstellar mod) science lab and I plan to add a telescope to it for the science. This stations serves as a halfway point for crews rotating to other planets/moons and for science transfer. I generally have ships transfer crews and science to the station, then send up a small shuttle to pick them up and return them home. \u003C/p\u003E\u003Cp\u003E I did mess around with huge stations, with all kinds of living quarters and 8-12 orange tanks of fuel, but it was just too inefficient and the FPS dove through the floor.\u003C/p\u003E\n"},{"CreatedByName":"RockoDyne","CreatedById":106891,"CreatedDateTime":"2014-05-31T14:27:02Z","Content":"\n\u003Cp\u003EI would define a station massive once you go from frames per second to seconds per frame.\u003C/p\u003E\u003Cp\u003EI don\u0027t make stations anymore though. The most I would need them for is an SSTO refueling depot which I never really got to the point of absolutely needing. I\u0027ve gotten much more into interplanetary command ships though.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-31T14:34:38Z","Content":"\n\u003Cp\u003EI consider a ship with at least one docking port, command module/probe core, space for kerbals, power generation, attitude control, and no main propulsion a station.\u003C/p\u003E\u003Cp\u003EOnce you stick rocket engines on it, it becomes a mothership, to my mind.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-05-31T15:16:31Z","Content":"\n\u003Cp\u003ETo me, the minimum definition for a \u0022massive\u0022 station, is one that cannot be launched by a single vehicle. My stations are modular and usually launched in several pieces, and assembled in orbit by an RCS-powered probe tug. This lets me launch reasonable payloads (typically 12-18 tons) with reasonable lifters. I avoid truly \u0022massive\u0022 stations for two reasons: performance, and lack of necessity.\u003C/p\u003E\u003Cp\u003EEssential components for my stations are: bridge (I prefer the cupola for this), habitation (2x crew space for each occupant, so a hitchhiker can accommodate two Kerbals long-term), power generation (a little bit from RTG and mostly from solar), attitude control, communications, and a means for all occupants to evacuate to safety (I designed a very tiny 4-man escape pod using lawn chairs). I generally have a modest amount of fuel to refuel visiting ships (I was able to save an otherwise-doomed mission by making a rendezvous with the station to refuel before going on). Even though the game still doesn\u0027t make orbital science that worthwhile, I like having full scientific capability - as others have said, the lab looks spiffy.\u003C/p\u003E\n"},{"CreatedByName":"Kaezan","CreatedById":108274,"CreatedDateTime":"2014-05-31T15:18:04Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/YeostTK\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/YeostTK.png\u0022 alt=\u0022YeostTK.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EThis is my newly made space station. It will serve as a supply depot and center of operations for planet Duna or Eve (havent decided yet)\u003C/p\u003E\u003Cp\u003EThis is massive. 2 seconds per frame. took me a lot of time to do this but ima proud man \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd yes i needed mechjeb. i just cant figure out the docking \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-05-31T15:46:03Z","Content":"\n\u003Cp\u003EI\u0027ve never really built a space station as such. Oh sure, I\u0027ve built a few things that could be considered space stations, but they\u0027ve usually ended up being part of some monstrous interplanetary vessel, or just \u003Ca href=\u0022http://i.imgur.com/Gf6AS5e.jpg\u0022 rel=\u0022external nofollow\u0022\u003Espace art\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI would say qualifications for a space station would be excessive crew capacity (beyond just the control module), it should be self sufficient in terms of power storage and generation, it should have a bit of RCS or other means of orienting itself, and it should have at least one docking port. Very much like Red Iron Crown\u0027s definition.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-05-31T17:35:26Z","Content":"\n\u003Cp\u003EIncidentally; from the penultimate tutorial chapter, on spacestations (which I haven\u0027t published yet):\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/EJiRo\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E(The final chapter adds the landers and an interplanetary tractor) Note that the station and the tractor are both \u0026lt; 25t so light, if awkward, to launch. At ~40t the fuel module is about the limit of what I single-launch. The tractor can place the complete station in Mun orbit without excessive burn-times, although it\u0027s probably better to assemble it there in the first place if you even \u003Cem\u003Ewant\u003C/em\u003E a station around Mun. I did because I was visiting lots of \u0027anomalies\u0027 on the surface but there\u0027s not much other reason to. The cupola is at the bottom for the reasons given earlier, docking adapters on two of the four ports around the core, there are also two dockable \u0027claws\u0027 on the hitch-hiker because I don\u0027t think there\u0027s such a thing as too much docking versatility ^^. Oh, and notice the ladder running from top to bottom.\u003C/p\u003E\u003Cp\u003EAnd, yes, I know the spaceplane isn\u0027t wonderful - there is a (not very good) reason.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-31T17:39:05Z\u0022 title=\u002205/31/2014 05:39  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 31, 2014\u003C/time\u003E by Pecan\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Tex_NL","CreatedById":58254,"CreatedDateTime":"2014-05-31T18:14:38Z","Content":"\n\u003Cp\u003EWhat can be called \u0027massive\u0027 is all relative. It totally depends on what you and your computer can handle. And of course of what you\u0027re used to.\u003C/p\u003E\u003Cp\u003EKaezan\u0027s station on the previous page can\u0027t be called micro for sure but in my opinion it also isn\u0027t truly massive. For me massive means pushing the boundaries either in weight, resources, part count or sheer size.\u003C/p\u003E\u003Cp\u003EMy current heaviest station weighs in at 690 tons (including the docked vessels). Fully fueled it would weigh at least 100 to 150 tons more.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://tex.texel.com/ksp0235/screenshot11.png\u0022 alt=\u0022screenshot11.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor size my Ring station is #1: Nearly 90 meters in diameter and capable of housing 672 kerbals.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://tex.texel.com/ksp023/screenshot13.2.png\u0022 alt=\u0022screenshot13.2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBoth stations where build in orbit with \u003Cstrong\u003EExtra Planetary Launchpads\u003C/strong\u003E as they would be impossible to launch conventionally.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-05-31T18:30:58Z","Content":"\n\u003Cp\u003E*cough* Tex\u0027s signature *cough*\u003C/p\u003E\u003Cp\u003EYou want to know about stations? Really nice design/building guide.\u003C/p\u003E\n"},{"CreatedByName":"Kaezan","CreatedById":108274,"CreatedDateTime":"2014-05-31T18:37:54Z","Content":"\n\u003Cp\u003EThank you for the appreciation Tex_NL, but following your line of though we can define SS\u0027s as micro, small, medium, large, huge and Ginormous. Besides all of those can be simple or complex, usefull or beautiful. I dont mean to be exaustive, just saying we can get many, many adjectives for the same thing.\u003C/p\u003E\u003Cp\u003EIn my case, that SS isnt massive for sure, but it took me a \u0027massive\u0027 amount of time to figure out how to do it.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-05-31T20:31:29Z","Content":"\n\u003Cp\u003EDespite being opposite to the technical meaning, I\u0027d say a \u0022massive\u0022 space station is one that\u0027s large in size, preferably in two or three dimensions. (Ie a very long stick wouldn\u0027t \u0022feel\u0022 as massive as a cube even if it had the same parts.)\u003C/p\u003E\u003Cp\u003EMine is about a VAB long, so it\u0027s pretty extensive, but I wouldn\u0027t call it \u0022massive\u0022. Maybe \u0022massive\u0022 for me will always mean bigger than mine.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/nHznpC\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022https://farm6.staticflickr.com/5494/14253979174_a87db72368_o.png\u0022 alt=\u002214253979174_a87db72368_o.png\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://flic.kr/p/nHznpC\u0022 rel=\u0022external nofollow\u0022\u003EDocked\u003C/a\u003E by \u003Ca href=\u0022https://www.flickr.com/people/52548818@N05/\u0022 rel=\u0022external nofollow\u0022\u003Ecantab314\u003C/a\u003E, on Flickr\u003C/p\u003E\u003Cp\u003EThe hardest thing, indeed the thing I\u0027ve \u003Cem\u003Efailed\u003C/em\u003E at, is controlling the part count. Using the long SRBs for beams helped, but having each module be autonomous with its own RCS propulsion really pushed the count up. Next time round I might try using a tug for module placement instead, but then I\u0027m not sure how I\u0027d sort RCS balance out and docking with off-balance RCS sucks.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-31T23:17:23Z","Content":"\n\u003Cp\u003EFirst, thanks for all the great replies!\u003C/p\u003E\u003Cp\u003EYeah, it seems part count is a huge part of \u0022massive.\u0022 I suppose that\u0027s because it becomes a limit for just about everything. Although I set my sights on mass most recently.\u003C/p\u003E\u003Cp\u003EI haven\u0027t started to figure out a purpose for my stations yet. I just like building them. Although I tend to include a hab module, power, some level of fuel (or a lot of fuel on my most recent), and a lab. I\u0027ve also been trying to build without RCS anywhere to keep the part count down.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003E...\u003Cp\u003EI think the minimum requirement for a space station is that it is independently controllable (probe core or CM), has attitude control (SAS or CM) and regenerates power (solar panels). Docking ports are \u003Cem\u003Ealmost\u003C/em\u003E required, but I suppose not an absolute necessity. RCS is super handy for station keeping and orbital adjustments. Anything beyond that is gravy. Typically, crew housing, multiple docking ports, extra fuel tanks and an MPL are the most common additions. \u003C/p\u003E\u003Cp\u003EI think the hardest part is figuring out the layout of the modules and how to get some of the more oddly shaped stations modules into orbit under my available fairings efficiently.\u003C/p\u003E\u003Cp\u003EI think the most important issue to address when designing a station is the stations purpose. I typically build stations to serve one or more of the following purposes:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EFuel depot\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ERendezvous point\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EComm station (with Remotech)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EScience lab\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFuel depots will typically have lots of extra fuel tanks. Rendezvous stations will have extra crew capacity and a relative abundance of docking ports on the equatorial plane of the station. Comm stations have multiple directional antennae. Science labs, obviously, have MPL\u0027s and space for docking a lander.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022HeadHunter67\u0022 data-cite=\u0022HeadHunter67\u0022\u003E\u003Cdiv\u003ETo me, the minimum definition for a \u0022massive\u0022 station, is one that cannot be launched by a single vehicle. My stations are modular and usually launched in several pieces, and assembled in orbit by an RCS-powered probe tug. This lets me launch reasonable payloads (typically 12-18 tons) with reasonable lifters. I avoid truly \u0022massive\u0022 stations for two reasons: performance, and lack of necessity.\u003Cp\u003EEssential components for my stations are: bridge (I prefer the cupola for this), habitation (2x crew space for each occupant, so a hitchhiker can accommodate two Kerbals long-term), power generation (a little bit from RTG and mostly from solar), attitude control, communications, and a means for all occupants to evacuate to safety (I designed a very tiny 4-man escape pod using lawn chairs). I generally have a modest amount of fuel to refuel visiting ships (I was able to save an otherwise-doomed mission by making a rendezvous with the station to refuel before going on). Even though the game still doesn\u0027t make orbital science that worthwhile, I like having full scientific capability - as others have said, the lab looks spiffy.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I would tend to agree with most of this. I definitely find that I design a better craft if I have a purpose in mind. However, I haven\u0027t found that \u0022purpose\u0022 yet for my stations.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Taki117\u0022 data-cite=\u0022Taki117\u0022\u003E\u003Cdiv\u003EI will answer the second question first. \u003Cp\u003ETo me a station is a place for kerbals to spend extended periods of time in space, meaning it must have some place for them to live, and some way for them to get home.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I agree with this too. Although I have been remiss in including an escape plan for getting home.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Heagar\u0022 data-cite=\u0022Heagar\u0022\u003E\u003Cdiv\u003EMost of your questions depends of the computer a player have and her/his intentions regarding her/his spacestation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s why I pose the question. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027m mostly interested to know what others think.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Heagar\u0022 data-cite=\u0022Heagar\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EMinimum requirements:\u003C/p\u003E\u003Cp\u003EA pod, an ASAS or some RCS (to kill an unwanted rotation), a battery and an solar cell/RTG. Most important is to have all sorts of docking ports of course (to be able to dock all kinds of ships you have/design in the future). And maybe some docking nodes where you can expand your station in the future when new parts comming out.\u003C/p\u003E\u003Cp\u003EHardest thing:\u003C/p\u003E\u003Cp\u003EThat is not the design. Normally i build a mockup first and test it on the launchpad or parts of it in space (escape pods e.g.).\u003C/p\u003E\u003Cp\u003ETricky it becomes when you have an modular design with a very long structures witch you have to dock going in reverse (because of the wobbeling).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELots of people mention RCS, but I have yet to include much on my stations... Hmm...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003E...\u003Cp\u003ESecondly it needs a general-purpose but non-landing tug/transfer/rescue tractor vehicle, and a docking-port for it. That usually makes any orbital adjustment burns for the station as well but I usually put a couple of small, 24-77 engines on the station itself as well, just in case I want to do something with it while the tractor is off doing something else. The station will need more fuel capacity for the tractor too. Although most of my stuff uses large docking-ports the landers will be using standard ones and it\u0027s possible (but unlikely) they\u0027ll be a few juniours around too. The tractor will have symmetrical pairs of each but I\u0027ll also have probe-core equipped adapters docked to the station as well. The probe-cores on these are just so I can orientate them and enable SAS to hold them steady for docking.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EI have another self-imposed constraint, which is that Kerbals should not need RCS while moving around the station and that movement within the \u0027accommodation section\u0027 should not even need EVA. That, ladders and the logic of Connected Living Spaces slightly restricts the ways in which I can arrange everything. In practice I don\u0027t find that a problem.\u003C/p\u003E\u003Cp\u003E...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I definitely found a tug is very important for my builds. It takes up a huge portion of my part count.\u003C/p\u003E\u003Cp\u003EI didn\u0027t think of including ladders all over. I suppose that\u0027s because I was trying to keep part counts down. Maybe on my smaller stations... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rickenbacker\u0022 data-cite=\u0022Rickenbacker\u0022\u003E\u003Cdiv\u003EI tend to build small, specialised stations. i currently have a station with a lab and a mid-sized fuel tank in orbit around the Mun, from which a small lander makes trips to the surface to dig out science. I first used it around Minmus, then moved it to the Mun to do the same thing. Around Kerbin I have a larger station, with some fuel, a (Interstellar mod) science lab and I plan to add a telescope to it for the science. This stations serves as a halfway point for crews rotating to other planets/moons and for science transfer. I generally have ships transfer crews and science to the station, then send up a small shuttle to pick them up and return them home. \u003Cp\u003E I did mess around with huge stations, with all kinds of living quarters and 8-12 orange tanks of fuel, but it was just too inefficient and the FPS dove through the floor.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RockoDyne\u0022 data-cite=\u0022RockoDyne\u0022\u003E\u003Cdiv\u003EI would define a station massive once you go from frames per second to seconds per frame.\u003Cp\u003EI don\u0027t make stations anymore though. The most I would need them for is an SSTO refueling depot which I never really got to the point of absolutely needing. I\u0027ve gotten much more into interplanetary command ships though.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think if I built any \u0022refueling\u0022 stations, it wouldn\u0027t include much habitation or anything else for what you guys mention. Frame rates and painful docking.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EI consider a ship with at least one docking port, command module/probe core, space for kerbals, power generation, attitude control, and no main propulsion a station.\u003Cp\u003EOnce you stick rocket engines on it, it becomes a mothership, to my mind.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I have engines on my large one but that\u0027s mostly because they are on the tug. But I suppose that\u0027s not what you\u0027re talking about.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-31T23:24:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kaezan\u0022 data-cite=\u0022Kaezan\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://imgur.com/YeostTK\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022http://i.imgur.com/YeostTK.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/YeostTK.png\u003C/a\u003E\u003Cp\u003EThis is my newly made space station. It will serve as a supply depot and center of operations for planet Duna or Eve (havent decided yet)\u003C/p\u003E\u003Cp\u003EThis is massive. 2 seconds per frame. took me a lot of time to do this but ima proud man \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd yes i needed mechjeb. i just cant figure out the docking \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a nice one. I like the asymmetric look of it. Makes it look more kerbal-esque. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022allmhuran\u0022 data-cite=\u0022allmhuran\u0022\u003E\u003Cdiv\u003EI\u0027ve never really built a space station as such. Oh sure, I\u0027ve built a few things that could be considered space stations, but they\u0027ve usually ended up being part of some monstrous interplanetary vessel, or just \u003Ca href=\u0022http://i.imgur.com/Gf6AS5e.jpg\u0022 rel=\u0022external nofollow\u0022\u003Espace art\u003C/a\u003E\u003Cp\u003EI would say qualifications for a space station would be excessive crew capacity (beyond just the control module), it should be self sufficient in terms of power storage and generation, it should have a bit of RCS or other means of orienting itself, and it should have at least one docking port. Very much like Red Iron Crown\u0027s definition.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve seen that picture before. You do make some pretty amazing creations!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EIncidentally; from the penultimate tutorial chapter, on spacestations (which I haven\u0027t published yet):\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/EJiRo\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/EJiRo\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a nice looking tutorial Pecan. Keep it up. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Tex_NL\u0022 data-cite=\u0022Tex_NL\u0022\u003E\u003Cdiv\u003EWhat can be called \u0027massive\u0027 is all relative. It totally depends on what you and your computer can handle. And of course of what you\u0027re used to.\u003Cp\u003EKaezan\u0027s station on the previous page can\u0027t be called micro for sure but in my opinion it also isn\u0027t truly massive. For me massive means pushing the boundaries either in weight, resources, part count or sheer size.\u003C/p\u003E\u003Cp\u003EMy current heaviest station weighs in at 690 tons (including the docked vessels). Fully fueled it would weigh at least 100 to 150 tons more.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://tex.texel.com/ksp0235/screenshot11.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://tex.texel.com/ksp0235/screenshot11.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFor size my Ring station is #1: Nearly 90 meters in diameter and capable of housing 672 kerbals.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://tex.texel.com/ksp023/screenshot13.2.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://tex.texel.com/ksp023/screenshot13.2.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBoth stations where build in orbit with \u003Cstrong\u003EExtra Planetary Launchpads\u003C/strong\u003E as they would be impossible to launch conventionally.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThese are awesome. It inspired mine to some extent, although I\u0027ve been building from the VAB still so I haven\u0027t built any massive (haha) ring stations yet.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003E*cough* Tex\u0027s signature *cough*\u003Cp\u003EYou want to know about stations? Really nice design/building guide.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have seen it. And you\u0027re right, it\u0027s pretty excellent.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kaezan\u0022 data-cite=\u0022Kaezan\u0022\u003E\u003Cdiv\u003EThank you for the appreciation Tex_NL, but following your line of though we can define SS\u0027s as micro, small, medium, large, huge and Ginormous. Besides all of those can be simple or complex, usefull or beautiful. I dont mean to be exaustive, just saying we can get many, many adjectives for the same thing.\u003Cp\u003EIn my case, that SS isnt massive for sure, but it took me a \u0027massive\u0027 amount of time to figure out how to do it.\u003C/p\u003E\u003Cp\u003ECheers\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s sort of why I started this thread. I\u0027m curious what different people think is a \u0022massive\u0022 and what is a \u0022micro\u0022 station.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EDespite being opposite to the technical meaning, I\u0027d say a \u0022massive\u0022 space station is one that\u0027s large in size, preferably in two or three dimensions. (Ie a very long stick wouldn\u0027t \u0022feel\u0022 as massive as a cube even if it had the same parts.)\u003Cp\u003EMine is about a VAB long, so it\u0027s pretty extensive, but I wouldn\u0027t call it \u0022massive\u0022. Maybe \u0022massive\u0022 for me will always mean bigger than mine.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://flic.kr/p/nHznpC\u0022 rel=\u0022external nofollow\u0022\u003E\u003C/a\u003E\u003Ca href=\u0022https://farm6.staticflickr.com/5494/14253979174_a87db72368_o.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://farm6.staticflickr.com/5494/14253979174_a87db72368_o.png\u003C/a\u003E\u003Ca href=\u0022https://flic.kr/p/nHznpC\u0022 rel=\u0022external nofollow\u0022\u003EDocked\u003C/a\u003E by \u003Ca href=\u0022https://www.flickr.com/people/52548818@N05/\u0022 rel=\u0022external nofollow\u0022\u003Ecantab314\u003C/a\u003E, on Flickr\u003C/p\u003E\u003Cp\u003EThe hardest thing, indeed the thing I\u0027ve \u003Cem\u003Efailed\u003C/em\u003E at, is controlling the part count. Using the long SRBs for beams helped, but having each module be autonomous with its own RCS propulsion really pushed the count up. Next time round I might try using a tug for module placement instead, but then I\u0027m not sure how I\u0027d sort RCS balance out and docking with off-balance RCS sucks.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is probably the other thing I would consider as part of \u0022massive.\u0022 In my mind, mass and size more so than part count. Although taken to the extreme you could just launch a bunch of full fuel tanks and it would be pretty heavy, which doesn\u0027t seem to \u0022space station-y\u0022 to me either... (not that you said that.)\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-05-31T23:28:50Z","Content":"\n\u003Cp\u003EWell, I don\u0027t quite mean for this to turn into a \u0022post your space stations\u0022 thread, but to give you guys some idea of where I\u0027m coming from, here is my most recent station. When I was planning this, it seemed massive at the time. Now that I\u0027ve built it, I\u0027m wondering what the next step in \u0022massive\u0022 is...\u003C/p\u003E\u003Cp\u003EPhoenix Station - It\u0027s all stock except a removable MJ stuck on for stat tracking.\u003C/p\u003E\u003Cp\u003ECompleted station took 9 major docking operations not including refueling. Mass is approximately 600t dry and 1300t wet with a part count of just over 600. It has habitation space for 384 kerbals plus a major lab module.\u003C/p\u003E\u003Cp\u003EI can remove the service module and the wet mass would drop by ~20 tons but would save ~60 parts. I only really needed it for the major docking operations, but left it on afterward. (It\u0027s the small piece at the end with the LV-Ns on it, on the tip of the docking hub.) I found the service module was hugely necessary to control part count.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/jKbHx\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-06-01T00:49:00Z","Content":"\n\u003Cp\u003ESorry, I hadn\u0027t realised your main question was \u0027massive\u0027. Yeah, mine are small - the one in the pics being physically small and only 130t including tractor and (2) fuel modules. If anything, other designs I\u0027ve used have been smaller but I just found I was having to send out too many tankers ^^.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-06-01T01:09:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003ELots of people mention RCS, but I have yet to include much on my stations... Hmm...\u003C/div\u003E\u003C/blockquote\u003EI\u0027m not sure it\u0027s essential. Mine has it, but I\u0027m not sure I\u0027ve ever used it. To an extent it depends how often you want to rotate the station. I\u0027m happy to leave mine with the central fuel tank oriented north-south, and dock to ports however they\u0027re oriented, but some people might prefer to be able to orient the station so the target port for a given docking is oriented in a desired direction.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EWell, I have engines on my large one but that\u0027s mostly because they are on the tug. But I suppose that\u0027s not what you\u0027re talking about.\u003C/div\u003E\u003C/blockquote\u003ETo an extent it would depend on size and type of engines compared to the station. One LV-909 isn\u0027t going to make a hundred-ton thing not a space station, but a big cluster of LV-N\u0027s or a KR-2L might. Then again, there\u0027s not a huge amount of reason to put an engine permanently on a station anyway.\u003Cp\u003EAnd seeing it, I think yours qualifies as massive. And a really nice aesthetic design.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-01T02:29:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EI\u0027m not sure it\u0027s essential. Mine has it, but I\u0027m not sure I\u0027ve ever used it. To an extent it depends how often you want to rotate the station. I\u0027m happy to leave mine with the central fuel tank oriented north-south, and dock to ports however they\u0027re oriented, but some people might prefer to be able to orient the station so the target port for a given docking is oriented in a desired direction.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESure, makes sense. My smaller ones have more RCS and reaction wheels so I can turn it around a bit more. I hadn\u0027t thought about the idea of orienting north/south. That\u0027s a good idea, since the approach to a station such as what I posted would almost always look like the same. Instead of coming in at it from the top or bottom or where ever... I\u0027ve learned a lot from my RCS/Tug design. And I think I\u0027ll have to stick with building the massive stations as relatively fixed orientation, mostly due to part count.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ETo an extent it would depend on size and type of engines compared to the station. One LV-909 isn\u0027t going to make a hundred-ton thing not a space station, but a big cluster of LV-N\u0027s or a KR-2L might. Then again, there\u0027s not a huge amount of reason to put an engine permanently on a station anyway.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAgreed on the engines. I mostly kept the tug around (4x LV-Ns) in case I wanted to boost the orbit a bit. Right now it\u0027s in a 150km circular orbit. That was convenient because the 160km and 200km orbits already have stations.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003EAnd seeing it, I think yours qualifies as massive. And a really nice aesthetic design.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E After assembly, I replicated it in the VAB and it basically fills the inside of the VAB. Wall to wall and floor to ceiling. I was curious if anyone had experience beyond that, because I feel like design and building is going to get a bit more tricky. I was also curious if I had already grown past what\u0027s practical.\u003C/p\u003E\u003Cp\u003EAlso, I was a bit reluctant to post a picture of mine because I\u0027m still interested in other people\u0027s thoughts and designs, as I tend to think mine are rather unimaginative.\u003C/p\u003E\n"},{"CreatedByName":"HeadHunter67","CreatedById":74121,"CreatedDateTime":"2014-06-01T04:16:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003ENext time round I might try using a tug for module placement instead, but then I\u0027m not sure how I\u0027d sort RCS balance out and docking with off-balance RCS sucks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWith sufficient RCS and SAS torque on the tug, it\u0027s not much of an issue. My robot tug is an RGU with the most powerful reaction wheel on either side, an RCS fuel tank on either side of those, and two sets of 4 RCS blocks. I can move just about anything into place with little difficulty - and with a 4000 point battery and a set of 4 RTGs for power, it\u0027s only around 21 parts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-01T04:22:02Z\u0022 title=\u002206/01/2014 04:22  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 1, 2014\u003C/time\u003E by HeadHunter67\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kaezan","CreatedById":108274,"CreatedDateTime":"2014-06-01T05:43:41Z","Content":"\n\u003Cp\u003EClaw, my SS is supposed to have a tri-simetry but each block is supposed to be unique, even the center block, so it makes the most usefull SS \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}