{"TopicId":74191,"ForumId":16,"TopicTitle":"Parachuting problems.","CreatedByName":"Maelstrom Vortex","CreatedById":111435,"CreatedDateTime":"2014-06-05T10:42:19Z","PageNum":1,"Articles":[{"CreatedByName":"Maelstrom Vortex","CreatedById":111435,"CreatedDateTime":"2014-06-05T10:42:19Z","Content":"\n\u003Cp\u003EFirst note, all parts stock.\u003C/p\u003E\u003Cp\u003EI\u0027m trying to design a space plane with an interesting feature. It can jettison its low altitude engines at it ascends for data delivery.. they\u0027re held under the wings attached to decoupler. It\u0027s part of a design I have for atmospheric data recovery. Each of the fuel tanks for the engines has a data nosecone. Problem is this. When I jettison them, even traveling slow at high altitude, the parachutes, though they deploy upon decoupling, do not prevent the discarded parts from crashing with the data on board. I\u0027ve tried 2 side mounted chutes.. pondering 3.. because I\u0027ve seen 2 slow a module with added components to well under 5 m/s descent.. which those small engines should easily survive on any terrain. I even thought, \u0022well maybe they\u0027re rolling on terrain\u0022 because they\u0027re cylindrical, so I put a couple of stopping struts on each side.. newp.. still vanishing upon touching the ground. I\u0027ve noticed that when you jettison something with a chute, it seems to follow different physics. Does anyone know if this is true and if there is a work around? To be precise, it\u0027s one stock jet engine, one stock fuel tank usually with about 1/2 fuel left, one data nosecone, and 2 parachutes. Do I just need more chutes? Or is there something wonky with detached craft physics that the debris behaves differently than a piloted vessel on re-entry and descent?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-05T10:45:09Z\u0022 title=\u002206/05/2014 10:45  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 5, 2014\u003C/time\u003E by Maelstrom Vortex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"katateochi","CreatedById":35181,"CreatedDateTime":"2014-06-05T11:00:42Z","Content":"\n\u003Cp\u003EAre you staying within 2.2km of your dropped payload until it reaches the ground? \u003C/p\u003E\u003Cp\u003EThe game only does physics calcs for things within that range, outside of that any craft inside an atmosphere will just wink out of existence. \u003C/p\u003E\u003Cp\u003EWhat your trying to do should be possible, but you might need to circle your plane around to stay within 2.2km until the payload has landed. Once its on the ground you can fly off and it should be fine.\u003C/p\u003E\n"},{"CreatedByName":"Concentric","CreatedById":103320,"CreatedDateTime":"2014-06-05T11:30:49Z","Content":"\n\u003Cp\u003EAlso, because you have to stay within 2.2km of the dropped part, then when it hits the ground you won\u0027t be at a particularly high altitude. As such, dropping your low-altitude engines with the science pod is entirely useless and counterproductive. Because you\u0027re dropping them from a high altitude, they pass into the \u0022out of physics range from the focused object and flying below 20km ASL in atmosphere\u0022 zone and get deleted. Technically, if you\u0027re careful, you should be able to take your readings, then descend alongside a science capsule until it is safely on the ground before ascending again, and everything should work out fine - but I can\u0027t see how it would be in any way efficient or helpful, and you\u0027d want to have your low-altitude engines available to do it.\u003C/p\u003E\u003Cp\u003EIt\u0027s not as though you can\u0027t get orbit and then deorbit the science separately, landing it as the focused object.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-06-05T16:18:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022katateochi\u0022 data-cite=\u0022katateochi\u0022\u003E\u003Cdiv\u003EAre you staying within 2.2km of your dropped payload until it reaches the ground? \u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile it may be impractical for sceine drop pods, it works well for \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/55667-Dropping-in-on-the-KSC-islands\u0022 rel=\u0022external nofollow\u0022\u003Ekerbal deployment\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"possum","CreatedById":84085,"CreatedDateTime":"2014-06-05T17:34:52Z","Content":"\n\u003Cp\u003EAdd a probe core to the discarded engines. This will make it so you do not have to stay within 2.2 km.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-06-05T17:36:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022possum\u0022 data-cite=\u0022possum\u0022\u003E\u003Cdiv\u003EAdd a probe core to the discarded engines. This will make it so you do not have to stay within 2.2 km.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis isn\u0027t actually true. ANYTHING that is below 22km in altitude and more than 2.2km from the actively controlled craft will be deleted.\u003C/p\u003E\n"},{"CreatedByName":"RockoDyne","CreatedById":106891,"CreatedDateTime":"2014-06-05T17:43:52Z","Content":"\n\u003Cp\u003EUnless you are already in orbit (ideally) and follow anything jettisoned on it\u0027s landing, you won\u0027t be doing anything other than dropping dead weight.\u003C/p\u003E\n"},{"CreatedByName":"RenevB","CreatedById":110395,"CreatedDateTime":"2014-06-05T19:51:56Z","Content":"\n\u003Cp\u003EAs said above, anything that is outside your physics bubble (~2.3 km) and moving through \u0027dense\u0027 atmosphere (someone said it\u0027s above 0.01 atm pressure) is deleted. What hasn\u0027t been said is the reason for this behaviour. Full physics is only calculated for your active craft and any and all stuff in the physics bubble around it. It wouldn\u0027t be practical for most computers to calculate every force for every craft everywhere.\u003C/p\u003E\u003Cp\u003ESo your idea doesn\u0027t work for computational game limitations.\u003C/p\u003E\n"},{"CreatedByName":"Killerdude8","CreatedById":73130,"CreatedDateTime":"2014-06-05T20:19:53Z","Content":"\n\u003Cp\u003EIf you are under 22KM in Atmosphere, and the part goes more than 2.5KM away, It will get deleted.\u003C/p\u003E\n"},{"CreatedByName":"Maelstrom Vortex","CreatedById":111435,"CreatedDateTime":"2014-06-06T06:37:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Concentric\u0022 data-cite=\u0022Concentric\u0022\u003E\u003Cdiv\u003EAlso, because you have to stay within 2.2km of the dropped part, then when it hits the ground you won\u0027t be at a particularly high altitude. As such, dropping your low-altitude engines with the science pod is entirely useless and counterproductive. Because you\u0027re dropping them from a high altitude, they pass into the \u0022out of physics range from the focused object and flying below 20km ASL in atmosphere\u0022 zone and get deleted. Technically, if you\u0027re careful, you should be able to take your readings, then descend alongside a science capsule until it is safely on the ground before ascending again, and everything should work out fine - but I can\u0027t see how it would be in any way efficient or helpful, and you\u0027d want to have your low-altitude engines available to do it.\u003Cp\u003EIt\u0027s not as though you can\u0027t get orbit and then deorbit the science separately, landing it as the focused object.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027d be more trouble than worth. However, thank you for phrasing this in a way that makes me feel like more genius than the game can handle \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn the other hand, I\u0027ve set max persistent debris.. and I was REALLY hoping I\u0027d be able to set whether or not I would want to keep items around til they hit the ground as I know my computer (it\u0027s a monster) will handle it. I am already handling like 20 flights. \u003C/p\u003E\u003Cp\u003EAn idea for cpu usage limitation that\u0027s practical and would help players of myself who like career modes and reusable drop pods might be to only let items with parachutes connected be computed once way from the active craft unless it is in an established orbit. That way the reusable can hit ground and the cpu isn\u0027t devoured except for by items the player wants to have devour CPU. Everything else not in a chute.. and not in orbit can just poof like usual. The player can manually delete the rest.\u003C/p\u003E\u003Cp\u003EDoes anyone know if there is a mod that circumvents this.. \u0022feature\u0022?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-06T06:41:26Z\u0022 title=\u002206/06/2014 06:41  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 6, 2014\u003C/time\u003E by Maelstrom Vortex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-06T11:30:15Z","Content":"\n\u003Cp\u003EThere are mods that extend physics range and lower the delete altitude.\u003C/p\u003E\u003Cp\u003EI \u0022think\u0022 one of those types of mods is called TT Never Unload, but I\u0027m not certain.\u003C/p\u003E\n"},{"CreatedByName":"Maelstrom Vortex","CreatedById":111435,"CreatedDateTime":"2014-06-07T06:03:06Z","Content":"\n\u003Cp\u003EYou wouldn\u0027t happen to have a forum or curse link would you? Can\u0027t seem to find it.\u003C/p\u003E\n"}]}