{"TopicId":74521,"ForumId":16,"TopicTitle":"KSP on Linux","CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-08T23:21:38Z","PageNum":1,"Articles":[{"CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-08T23:21:38Z","Content":"\n\u003Cp\u003EHello I have had problems with mods, which has to do with memory, apparently in windows there is an excess of memory for ksp which in linux there is not. So I decided to install linux. But i have read that must be a Debian distribution, or could be an Ubunto maybe?. In case just works for Debian, which distro is the best or more user friendly?\u003C/p\u003E\u003Cp\u003EThanks.\u003C/p\u003E\n"},{"CreatedByName":"KasperVld","CreatedById":40700,"CreatedDateTime":"2014-06-08T23:31:22Z","Content":"\n\u003Cp\u003EUbuntu, Kubuntu, Xubuntu or any other *buntu you\u0027ll find is probably very user friendly. If you\u0027re looking for something that matches the Windows feel it\u0027ll probably be Kubuntu. Linux will always take a lot of getting used to, and probably you\u0027ll need to acquire a lot of technical knowledge too.\u003C/p\u003E\n"},{"CreatedByName":"Gotcha","CreatedById":112127,"CreatedDateTime":"2014-06-08T23:47:33Z","Content":"\n\u003Cp\u003EOk, so with ubuntu KSP will works ? \u003C/p\u003E\u003Cp\u003ECause in ksp web page says \u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003Erecommended systems specifications:\u003C/span\u003E\u003C/strong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E A Debian based Linux distro\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"custume","CreatedById":112591,"CreatedDateTime":"2014-06-09T01:35:12Z","Content":"\n\u003Cp\u003Eubuntu is a sackware dist thas was made from a debian that all came from the 1Ã‚Âº redhat so all simular in specs, but the best one (beter to use and install stuff) is the ubuntu or any buntu dist.\u003C/p\u003E\u003Cp\u003ERegards\u003C/p\u003E\u003Cp\u003ECustume\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-06-09T02:28:33Z","Content":"\n\u003Cp\u003EUbuntu is based on Debian (though it does add a lot of stuff particular to Ubuntu). I\u0027ve been playing KSP on Ubuntu no problem.\u003C/p\u003E\u003Cp\u003EIn terms of variants, regular Ubuntu is a pretty different UI to Windows. You might like it, you might not. Linux Mint (separate, but based on Ubuntu) has a more familiar interface and is well-regarded. If you want something quite streamlined, along the lines of XP interface-wise (but without the fisher price looks), try Lubuntu.\u003C/p\u003E\n"}]}