{"TopicId":74908,"ForumId":16,"TopicTitle":"Can you still land on your head and survive?","CreatedByName":"JstuffJr","CreatedById":99987,"CreatedDateTime":"2014-06-13T04:14:07Z","PageNum":1,"Articles":[{"CreatedByName":"JstuffJr","CreatedById":99987,"CreatedDateTime":"2014-06-13T04:14:07Z","Content":"\n\u003Cp\u003EDisclaimer - I apologize if this has been answered recently, I did do a quick search but I am an imperfect human being \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo I\u0027ve always heard that if worst comes to worst, you can always land on your head with a kerbal and still survive. So there I was, with Jeb in a perma-orbit around Kerbin, when I had the genius (to me) idea of using my jetpack to degrade my orbit. It worked wonderfully.... until i realized I had no parachute. No fear, I looked up on the internet how to rotate your kerbal around (click drag over your kerbal if you didn\u0027t know), put Jeb\u0027s big squishy head right between the rest of him and the ground and then..... splat right into the ocean \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E ;.; \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E\u003C/p\u003E\u003Cp\u003EDoes this wonderful property of a Kerbal\u0027s head simply not apply in water somehow maybe? Or did they just remove this bug coughcoughawesomefeaturecough?\u003C/p\u003E\n"},{"CreatedByName":"RocketPilot573","CreatedById":62803,"CreatedDateTime":"2014-06-13T04:15:31Z","Content":"\n\u003Cp\u003EIt\u0027s still there, Kerbals will only \u003Cem\u003Esometimes\u003C/em\u003E land and be fine. Unless your Danny2462 of course.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"turkwinif","CreatedById":84592,"CreatedDateTime":"2014-06-13T04:23:12Z","Content":"\n\u003Cp\u003EI\u0027m pretty sure that you can still bounce Kerbals off of the ground using their heads - keyword, \u003Cem\u003Eground\u003C/em\u003E. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Fendleton","CreatedById":22867,"CreatedDateTime":"2014-06-13T04:26:07Z","Content":"\n\u003Cp\u003EIt depends on the angle and speed of the impact. But it definitely still works at a pinch to save a kerbal. Kerbals have somewhat buggy collision detection/ragdolling, which can either fully absorb an insane amount of velocity (like landing on your head and surviving stuff), or \u003Cem\u003Egenerate\u003C/em\u003E a large amount of velocity (try jumping out of a plane just as it crashes. Every so often you\u0027ll be flung a few kilometres away by glitch physics).\u003C/p\u003E\n"},{"CreatedByName":"Killerdude8","CreatedById":73130,"CreatedDateTime":"2014-06-13T04:27:32Z","Content":"\n\u003Cp\u003EImpacting Water at a certain speed, will instadeath everything that touches it, Regardless of the Impact Tolerance, It will just sploosh and die.\u003C/p\u003E\u003Cp\u003EHead bouncing only works on solid land.\u003C/p\u003E\n"},{"CreatedByName":"cpast","CreatedById":112846,"CreatedDateTime":"2014-06-13T04:28:08Z","Content":"\n\u003Cp\u003EI have personally used head-bouncing in an abort mode. It can definitely work on solid ground.\u003C/p\u003E\n"},{"CreatedByName":"Werwolf","CreatedById":38001,"CreatedDateTime":"2014-06-13T04:30:43Z","Content":"\n\u003Cp\u003EI can also attest head shots still work on land... water kills pretty much everything at a certain velocity.\u003C/p\u003E\n"},{"CreatedByName":"Javster","CreatedById":74613,"CreatedDateTime":"2014-06-13T10:42:28Z","Content":"\n\u003Cp\u003EI have the texturereplacer mod installed, so they don\u0027t even have helmets on when I crash them into the ground head-first.\u003C/p\u003E\n"},{"CreatedByName":"thescientist","CreatedById":69046,"CreatedDateTime":"2014-06-13T13:04:46Z","Content":"\n\u003Cp\u003ELanding on the jetpack looks to work very well on the ground\u003C/p\u003E\n"},{"CreatedByName":"xtremespino","CreatedById":63473,"CreatedDateTime":"2014-06-15T18:46:45Z","Content":"\n\u003Cp\u003EIt could work if you hit land, but water will just go splash, leaving no trace of your brave astronaut.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-06-15T23:25:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JstuffJr\u0022 data-cite=\u0022JstuffJr\u0022\u003E\u003Cdiv\u003E....you can always land on your head with a kerbal and still survive. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope.\u003C/p\u003E\u003Cp\u003EHere, I corrected it for you:\u003C/p\u003E\u003Cp\u003E....you can \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Ealways\u003C/span\u003E \u003Cspan style=\u0022color:#0000FF;\u0022\u003Esometimes\u003C/span\u003E land \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003Eon your head\u003C/span\u003E \u003Cspan style=\u0022color:#0000FF;\u0022\u003Eon the ground\u003C/span\u003E with a kerbal and still survive, \u003Cspan style=\u0022color:#0000FF;\u0022\u003Eif you are lucky\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIn my experience..\u003C/p\u003E\u003Cp\u003EI have survived \u0022landing\u0022 a parachuteless craft at 142m/s, by jumping off 2 sec before impact \u002B engaging jetpack \u002B hitting the exploding debris at an angle. (my minimum-mass eeloo craft cannot afford \u0027chutes)\u003C/p\u003E\u003Cp\u003EI have survived \u0022landing\u0022 on Mun from orbit, naked. Well, Eva-suited. Landing on a downslope at 95m/s, upright. Many tumbles ensue.\u003C/p\u003E\u003Cp\u003EI have survived \u0022landing\u0022 in water at no more than 25m/s\u003C/p\u003E\u003Cp\u003EI have NOT survived climbing out of my rocket, after a glorious Jool trip soft-landing back on KSP grounds, and tripping because I forgot to extend the ladder. The drop was about 8 meters!\u003C/p\u003E\u003Cp\u003ESo... Kerbal survivability under falling conditions is a bit of a crap shoot. But possible.\u003C/p\u003E\u003Cp\u003EThat 142m/s vertical speed is the best I managed, even after *many* tries.\u003C/p\u003E\u003Cp\u003EI find no difference in survivability head or feet, only head impact seems to result in less spinning rotation after the first bounce.\u003C/p\u003E\n"},{"CreatedByName":"Tex","CreatedById":75164,"CreatedDateTime":"2014-06-15T23:40:41Z","Content":"\n\u003Cp\u003EI\u0027ve used the trick many a time, but it NEVER works in water. Only land.\u003C/p\u003E\n"}]}