{"TopicId":75037,"ForumId":16,"TopicTitle":"Pol to Bop: Has anyone done the math (or experimented with the options?)","CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-14T15:28:37Z","PageNum":1,"Articles":[{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-14T15:28:37Z","Content":"\n\u003Cp\u003EA standard Joolian exploration problem as depicted below. (Ignore the elliptical orbit, that\u0027s just a spent stage).\u003C/p\u003E\u003Cp\u003EIf you are landed on Pol and want to land on Bop, what is the most efficient method you have found?\u003C/p\u003E\u003Cp\u003EThe two basic options are:\u003C/p\u003E\u003Cp\u003E1) Wait until the Pol/Bop ascending/descending node, then leave Pol and burn to drop your periaspsis down to Bop and get the intercept directly at the opposite node.\u003C/p\u003E\u003Cp\u003E2) Drop your periapsis further to Tylo and use Tylo to assist with the inclination change.\u003C/p\u003E\u003Cp\u003EMethod 1 is clearly easier, requiring less planning and takes less time. 2 May be cheaper, but Tylo is a bit \u003Cem\u003Etoo\u003C/em\u003E good at slingshotting and you may end up at the right inclination but with a crazy apoapsis that you then need to bring down with additional bouncing around.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/OxER75q.png\u0022 alt=\u0022OxER75q.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-14T19:08:58Z\u0022 title=\u002206/14/2014 07:08  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 14, 2014\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-06-14T15:30:26Z","Content":"\n\u003Cp\u003EI think 1 is your best option. While the inclination dV may be cheaper with option 2, you run the risk of really screwing up your orbit and actually using \u003Cem\u003Emore\u003C/em\u003E dV to correct.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-06-14T17:27:19Z","Content":"\n\u003Cp\u003EI would choose option 1 if only because I\u0027m so bad at making gravity assists work as intended.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-06-14T17:37:56Z","Content":"\n\u003Cp\u003ECatch it right and you\u0027re only looking at a few hundred m/s of delta-v anyway ... why bother with Tylo unless you want an elegant solution?\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-06-14T17:40:12Z","Content":"\n\u003Cp\u003EI would also choose option 1. Plane changes are relatively cheap far away from Jool, but orbital insertions can be quite expensive. I haven\u0027t checked the numbers, but my intuition is that a transfer from Tylo to Bop requires a bigger insertion burn than a transfer from Pol to Bop.\u003C/p\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-14T17:40:34Z","Content":"\n\u003Cp\u003EYeah, the last two times I did it I went with option 1. But since I\u0027m doing something even more ridiculous than usual, I\u0027m wondering if the savings of option 2 (if any) are worthwhile.\u003C/p\u003E\u003Cp\u003EBroken down, the considerations are these: Assuming a perfect gravity assist (or series of gravity assists) from Tylo to get the Bop inclination and altitude, we have the following cost options:\u003C/p\u003E\u003Cp\u003EOption 1: A=(Cost of getting periapsis from Pol to Bop) \u002B B=(relative tangential velocity at Bop given a Pol apoapsis) \u002B C=(cost of highly inclined approach to Bop)\u003C/p\u003E\u003Cp\u003EOption 2: D=(Cost of getting periapsis from Pol to Tylo) \u002B E=(relative tangential velocity at Bop given a Tylo periapsis) \u002B F=(cost of orbital adjustments for gravity slingshots).\u003C/p\u003E\u003Cp\u003ETrivially, A is smaller than D.\u003C/p\u003E\u003Cp\u003EI do not know which of B or E is smaller (assuming perfect inclination either way, which is cheaper - Bop approach from Tylo\u0027s altitude, or Bop approach from Pol\u0027s altitude), nor what the value of C is when going from Pol to Bop.\u003C/p\u003E\u003Cp\u003EI can easily keep F to less than 50 m/s.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-14T17:54:27Z\u0022 title=\u002206/14/2014 05:54  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 14, 2014\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-06-14T18:46:49Z","Content":"\n\u003Cp\u003EMost efficient method known to me is using \u003Ca href=\u0022http://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003EAlexmoon\u0027s calculator\u003C/a\u003E. It allows you to select moons and calculate transfers between them.\u003C/p\u003E\u003Cp\u003EOr perhaps \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/36476-WIN-KSP-Trajectory-Optimization-Tool-v1-0-0-Multi-Flyby-Maneuver-Sequencer!\u0022 rel=\u0022external nofollow\u0022\u003ETrajectory Optimization Tool\u003C/a\u003E but I have no experience with it.\u003C/p\u003E\u003Cp\u003EOf course since it is just a few m/s I never actually bothered with it and did it this way:\u003C/p\u003E\u003Cp\u003E- eject from Pol at inclination point\u003C/p\u003E\u003Cp\u003E- lower your periapsis to cross Bop\u0027s trajectory\u003C/p\u003E\u003Cp\u003E- at the crossing adjust your orbital periapsis to meet Bop there the next (or second next) time\u003C/p\u003E\u003Cp\u003E- fix the inclination during circularizing burn\u003C/p\u003E\u003Cp\u003ENow, to compare your two methods:\u003C/p\u003E\u003Cp\u003EUsing Alexmoon\u0027s calculator, the transfer from Pol to Bop costs somewhere around 300 m/s (250~350)\u003C/p\u003E\u003Cp\u003ETransfer from Pol to Tylo, ignoring Tylo circularization is about 220 m/s\u003C/p\u003E\u003Cp\u003ETransfer from Bop to Tylo, ignoring Tylo circularization (applies also to optimum ejection from Tylo and circularization on Bop) is about 100 m/s\u003C/p\u003E\u003Cp\u003ETotal for Pol-\u0026gt;Tylo-\u0026gt;Bop is therefore around 320 m/s\u003C/p\u003E\u003Cp\u003EIn my opinion they\u0027re very similar dv-wise but the Tylo transfer is much harder to set up and you\u0027re very likely to set it up suboptimal.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Sm1h6yn.png\u0022 alt=\u0022Sm1h6yn.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-14T19:04:18Z\u0022 title=\u002206/14/2014 07:04  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 14, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"allmhuran","CreatedById":66124,"CreatedDateTime":"2014-06-14T19:07:11Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EGood numbers. Given that, the Tylo slingshot should turn out to be somewhat cheaper, since this inverse of this stage:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E\u0022Transfer from Bop to Tylo, ignoring Tylo circularization (applies also to optimum ejection from Tylo and circularization on Bop) is about 100 m/s\u0022\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EIs nearly free (via slingshot).... unless that\u0027s just insertion delta v.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EScratch that, I misunderstood... I see that is indeed only insertion delta v. So yeah, pretty much the same.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-14T19:12:44Z\u0022 title=\u002206/14/2014 07:12  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 14, 2014\u003C/time\u003E by allmhuran\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2014-06-14T19:24:29Z","Content":"\n\u003Cp\u003EThe last time I went from Pol to Bop I was very low on delta-v so I first transferred from Pol to Bop at the node, and meeting Bop where it\u0027s closest to Pol\u0027s orbit, with a very small inclination change. Then I used about 3 or 4 Bop gravity assists to get my inclination in line and my apoapsis down, and the final Bop insertion took very little delta-v. I think it\u0027s possible to get a Pol-Bop transfer for under 200 m/s that way.\u003C/p\u003E\n"}]}