{"TopicId":75543,"ForumId":16,"TopicTitle":"Most fuel-efficient way to navigate a rocket between two planet surface points","CreatedByName":"mk-fg","CreatedById":98390,"CreatedDateTime":"2014-06-20T09:41:50Z","PageNum":1,"Articles":[{"CreatedByName":"mk-fg","CreatedById":98390,"CreatedDateTime":"2014-06-20T09:41:50Z","Content":"\n\u003Cp\u003EImagine you\u0027ve landed on a planet in one of the biomes.\u003C/p\u003E\u003Cp\u003EWhat will be the most fuel-efficient way to move from there to another (specific) point on the surface?\u003C/p\u003E\u003Cp\u003EAnd - more importantly - what are the important variables there?\u003C/p\u003E\u003Cp\u003EI\u0027m using \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80369-0-23-5-SCANsat-v6-0-Real-Scanning-Real-Science-at-Warp-Speed!-May-17\u0022 rel=\u0022external nofollow\u0022\u003ESCAN\u003C/a\u003E mod which allows to have navigation satellites in orbit to provide in-game map of biomes on the surface.\u003C/p\u003E\u003Cp\u003EAnd naturally, if there\u0027s some extra fuel left, I\u0027d like to lift off and fly to another biome than the one I\u0027ve landed at initially, or go visit some anomaly on the surface.\u003C/p\u003E\u003Cp\u003EImagining that surface is mostly flat (wrt hills and mountains, still curved though), is it always most fuel-efficient for a powered rocket to take-off at 45deg angle from horizontal direction, burn as fast as possible to get the trajectory to the target (with an overshoot adjustment for an atmosphere drag and non-instant deceleration) and then only fire engines to decelerate as late as possible?\u003C/p\u003E\u003Cp\u003EOr would it be more efficient for planets with atmospheres to accelerate straight up to get out of thick layers of it asap, then burn towards target and travel in a thinner layers?\u003C/p\u003E\u003Cp\u003EAnd with no atmosphere and low gravity, can it be more efficient to have near-horizontal burn, not to waste fuel of Y movement?\u003C/p\u003E\u003Cp\u003ECan it be more efficient or easy to accelerate horizontally to some fixed speed and then maintain altitude via thrust towards surface?\u003C/p\u003E\u003Cp\u003E45deg seem to be roughly the figure used for e.g. archery on earth surface, where I think air resistance is not a huge factor (i.e. arrow is massive and aerodynamic enough), but it\u0027s a rough number for just one gravity/pressure combination, for an unpowered projectile, with certain combination of aerodynamic surfaces, which is not expected to exit the atmosphere, don\u0027t need to take earth\u0027s radius into account due to short range, etc.\u003C/p\u003E\u003Cp\u003EICBMs otoh seem to fly very Y-heavy trajectories exiting and re-entering the atmosphere, but this might have totally different reasoning - i.e. to gain as much velocity when approaching surface as to be nearly-uninterceptable.\u003C/p\u003E\u003Cp\u003ECan\u0027t seem to find any threads on the subject, can someone maybe point me to these, if it\u0027s been discussed a lot already?\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-06-20T09:44:34Z","Content":"\n\u003Cp\u003ECheck out this blog for analysis of this topic: \u003Ca href=\u0022http://hopsblog-hop.blogspot.fr/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://hopsblog-hop.blogspot.fr/\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Jesrad","CreatedById":49762,"CreatedDateTime":"2014-06-20T13:17:28Z","Content":"\n\u003Cp\u003EYup, the most efficient arc for a suborbital hop in vacuum is by aiming up at 45Ã‚Â° - angular distance / 4. You can deduce the angular distance from the radius of the planet / moon (i.e. Minmus is 60 km radius, that\u0027s 377 km circumference, so hopping 100 km away is an angular distance of 30.4 degrees). Calculating the departure velocity is a tad more complicated, and you\u0027ll have to take into consideration the altitude difference between start and finish. But then, you can just accelerate until your map plots the trajectory to the right place.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-20T13:20:25Z\u0022 title=\u002206/20/2014 01:20  PM\u0022 data-short=\u002210 yr\u0022\u003EJune 20, 2014\u003C/time\u003E by Jesrad\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mk-fg","CreatedById":98390,"CreatedDateTime":"2014-06-20T14:13:17Z","Content":"\n\u003Cp\u003EThanks for the tips, latest blogpost on the link explains it perfectly, indeed.\u003C/p\u003E\u003Cp\u003ESo without atmosphere, 45deg would only be optimal on a discworld or for a relatively short hops.\u003C/p\u003E\u003Cp\u003EShould these angles change with the atmosphere, given the drag and Isp changes there?\u003C/p\u003E\u003Cp\u003EI imagine they should, as such most-efficient-for-vacuum arcs seem to be very low-altitude, so should it be more efficient to go up and do horizontal burn outside of the thick atmosphere layer at some point?\u003C/p\u003E\n"},{"CreatedByName":"mk-fg","CreatedById":98390,"CreatedDateTime":"2014-06-20T14:31:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022mk-fg\u0022 data-cite=\u0022mk-fg\u0022\u003E\u003Cdiv\u003EShould these angles change with the atmosphere, given the drag and Isp changes there?\u003Cp\u003EI imagine they should, as such most-efficient-for-vacuum arcs seem to be very low-altitude, so should it be more efficient to go up and do horizontal burn outside of the thick atmosphere layer at some point?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThough I guess there might not be an easy answer, given vastly different ship engine configurations - i.e. with several powerful engines and 1 NERVA, guess it should definitely be easy to take-off and use ~800 Isp of the latter for longer trajectories...\u003C/p\u003E\n"},{"CreatedByName":"sojourner","CreatedById":65674,"CreatedDateTime":"2014-06-20T17:51:12Z","Content":"\n\u003Cp\u003EWouldn\u0027t the most fuel efficient method on a planet with atmosphere involve wings?\u003C/p\u003E\n"},{"CreatedByName":"mk-fg","CreatedById":98390,"CreatedDateTime":"2014-06-20T19:07:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sojourner\u0022 data-cite=\u0022sojourner\u0022\u003E\u003Cdiv\u003EWouldn\u0027t the most fuel efficient method on a planet with atmosphere involve wings?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"}]}