{"TopicId":75636,"ForumId":16,"TopicTitle":"Question about aerobraking.","CreatedByName":"TheScareCake!","CreatedById":103641,"CreatedDateTime":"2014-06-21T10:48:18Z","PageNum":1,"Articles":[{"CreatedByName":"TheScareCake!","CreatedById":103641,"CreatedDateTime":"2014-06-21T10:48:18Z","Content":"\n\u003Cp\u003ESo, if i want to get to ike with aerobraking at duna, how should i do it?\u003C/p\u003E\n"},{"CreatedByName":"TMS","CreatedById":57134,"CreatedDateTime":"2014-06-21T14:25:58Z","Content":"\n\u003Cp\u003EUse this: \u003Ca href=\u0022http://alterbaron.github.io/ksp_aerocalc/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://alterbaron.github.io/ksp_aerocalc/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EWait until you enter Duna\u0027s SOI and then enter your \u003Cstrong\u003Ecurrent\u003C/strong\u003E orbital parameters into the appropriate fields. The most important field is your orbital velocity.\u003C/p\u003E\u003Cp\u003EYour desired apoapsis will be something like 3,200,000m to match Ike\u0027s orbit.\u003C/p\u003E\u003Cp\u003EThe calculator will probably suggest an aerobraking periapsis somewhere in the region of 13-14km.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-06-22T04:45:42Z","Content":"\n\u003Cp\u003EYou can figure out what your orbital speed will be at some point on your projected course by placing a manoeuvre node there, dragging the retrograde handle until it starts to switch with the prograde, then reading off the delta-V for the manoeuvre which will be the same as your orbital speed. You may also be able to figure out the altitude as it will be the apoapsis of the post-manoeuvre trajectory, otherwise just guesstimate it.\u003C/p\u003E\u003Cp\u003EYou should probably refine things once you\u0027re in the target\u0027s SOI anyway mind, but this may be a useful general trick.\u003C/p\u003E\n"},{"CreatedByName":"Jimor","CreatedById":97429,"CreatedDateTime":"2014-06-22T05:40:11Z","Content":"\n\u003Cp\u003EAhh, that\u0027s a very good trick, cantab. I really like it when there are ways of getting useful information in vanilla KSP that\u0027s otherwise not directly in front of you.\u003C/p\u003E\n"}]}