{"TopicId":75673,"ForumId":16,"TopicTitle":"Ram usage","CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-21T23:55:27Z","PageNum":1,"Articles":[{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-21T23:55:27Z","Content":"\n\u003Cp\u003EHi.\u003C/p\u003E\u003Cp\u003EI have a question to all mod users. Does your ksp.exe process ram usage rise as you play the game? I don\u0027t know if it\u0027s normal, so i\u0027m asking here. My game start at a 2,6GB of ram, and then it\u0027s slowly rising, until i break the 3,7gb barrier and crash. What could be the cause for such problems? I have B9, KW, and interstellar mods installed, i know it\u0027s quite an overkill, but i also use active texture management, basic version, which should ease things a little.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-06-22T00:06:19Z","Content":"\n\u003Cp\u003EThere are several things that affect the amount of RAM used but one of the major ones is the number of parts which are loaded when the game starts. With B9 and KW particularly there are a lot of extra parts - I don\u0027t know about Interstellar - so a lot of additional RAM required. More than just the (picture) textures used to draw these it is the (polygon) 3d-model that the computer understands that takes the memory so ATM and similar can\u0027t help much. Beyond the number of parts the biggest contributor to RAM usage will be the number of flights in progress - always - and, most obviously - the number of craft/parts within render-distance while in flight.\u003C/p\u003E\n"},{"CreatedByName":"Asmayus","CreatedById":54068,"CreatedDateTime":"2014-06-22T00:07:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DeepOdyssey\u0022 data-cite=\u0022DeepOdyssey\u0022\u003E\u003Cdiv\u003EHi.\u003Cp\u003EI have a question to all mod users. Does your ksp.exe process ram usage rise as you play the game? I don\u0027t know if it\u0027s normal, so i\u0027m asking here. My game start at a 2,6GB of ram, and then it\u0027s slowly rising, until i break the 3,7gb barrier and crash. What could be the cause for such problems? I have B9, KW, and interstellar mods installed, i know it\u0027s quite an overkill, but i also use active texture management, basic version, which should ease things a little.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI had serious trouble running the game before when I had 4gb. I\u0027d never tracked usage figures but I would get crashes after a certain number of launches. It varied depending on my graphics settings and part count. They problem has gone away since I upgraded to 8gb. \u003C/p\u003E\u003Cp\u003ESo yes, it is normal for ksp. I got far fewer crashes on lower settings, so that may be worth trying.\u003C/p\u003E\u003Cp\u003EAsmayus\u003C/p\u003E\n"},{"CreatedByName":"helaeon","CreatedById":101767,"CreatedDateTime":"2014-06-22T00:43:05Z","Content":"\n\u003Cp\u003EYou\u0027ll probably want to use the aggressive version of ATM. Basic version eases things very little.\u003C/p\u003E\u003Cp\u003EAlso need to make sure you have profiles for all the mods you use. If the there\u0027s not a profile telling ATM to compress everything it won\u0027t work.\u003C/p\u003E\u003Cp\u003EThere are also settings in the ATM configs that let you get even more aggressive about compression. \u003C/p\u003E\u003Cp\u003EYou may also want to consider trimming down the parts in KW and B9 if you find there are ones you don\u0027t like and/or never use. Since the NASA pack I dropped KW and haven\u0027t really missed it and it made room for a lot of mods, also got away from B9 and have been using SpacePlane Plus instead. Also using Lack\u0027s SXT parts because they use the squad textures so very very light on the memory usage.\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-22T01:10:12Z","Content":"\n\u003Cp\u003EI know about the things you people have listed. I\u0027m asking about the ram usage rise, is it normal? I thought, when the game load, my ram usage won\u0027t rise much, because every game asset/texture/model was already loaded.\u003C/p\u003E\u003Cp\u003EEven if i use ATM aggressive my game eventually crash. I also have some red errors in debug menu[null reference exception object reference not set to an instance of an object] when i load some spacecrafts. I don\u0027t know maybe this could be causing the issue?\u003C/p\u003E\n"},{"CreatedByName":"Shiv","CreatedById":112596,"CreatedDateTime":"2014-06-22T02:56:54Z","Content":"\n\u003Cp\u003EI have 12 gigs of RAM and it\u0027s still not enough for this game at times. It just devours it unfortunately. But it\u0027s a really unstable game to begin with so it probably has some memory leaks as well.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-22T03:02:29Z\u0022 title=\u002206/22/2014 03:02  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 22, 2014\u003C/time\u003E by Shiv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-06-22T03:00:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Shiv\u0022 data-cite=\u0022Shiv\u0022\u003E\u003Cdiv\u003EI have 12 gigs of RAM and it\u0027s still not enough for this game at times. It just devours it unfortunately.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnless you are using Linux (Or the 64 bit hack) KSP is a 32 bit program that has a hard limit of 4GB of RAM usage, regardless of what your actual RAM is.\u003C/p\u003E\n"},{"CreatedByName":"Shiv","CreatedById":112596,"CreatedDateTime":"2014-06-22T03:05:48Z","Content":"\n\u003Cp\u003EWell I reckon it\u0027s not using it all then. Whenever I play my memory usage jumps from about 20% to 86% so I figured it was using that all. That raises the more interesting question of why it\u0027s increasing by 66% when it should be increasing by 33% at most.\u003C/p\u003E\n"},{"CreatedByName":"Link","CreatedById":74176,"CreatedDateTime":"2014-06-22T13:23:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DeepOdyssey\u0022 data-cite=\u0022DeepOdyssey\u0022\u003E\u003Cdiv\u003EI know about the things you people have listed. I\u0027m asking about the ram usage rise, is it normal? I thought, when the game load, my ram usage won\u0027t rise much, because every game asset/texture/model was already loaded.\u003Cp\u003EEven if i use ATM aggressive my game eventually crash. I also have some red errors in debug menu[null reference exception object reference not set to an instance of an object] when i load some spacecrafts. I don\u0027t know maybe this could be causing the issue?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo address your question, it is a tad normal. BUT, the error in your debug menu could very well be related. Track that error down, eliminate that mod, and try again.\u003C/p\u003E\u003Cp\u003EMy ram usually only ever goes up during the last bit of the loading screen, in between scenes(changing from vab to space center, etc) and of course, approaching other vessels.\u003C/p\u003E\u003Cp\u003ESo first, and foremost, get rid of what\u0027s giving you the NRE\u0027s, and see if that makes a change.\u003C/p\u003E\n"},{"CreatedByName":"QuesoExplosivo","CreatedById":102949,"CreatedDateTime":"2014-06-22T16:14:22Z","Content":"\n\u003Cp\u003ESounds like a memory leak to me.\u003C/p\u003E\n"},{"CreatedByName":"velve","CreatedById":112979,"CreatedDateTime":"2014-06-22T16:20:23Z","Content":"\n\u003Cp\u003EI would definitely use the aggressive active texture management version, I was using it with more than twice the amount of part mods you\u0027re using and I didn\u0027t crash. That said I do not run my game with very high settings which is most likely the cause of me being able to run so many mods. \u003C/p\u003E\u003Cp\u003EI only have 4gb RAM as well.\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-22T16:21:26Z","Content":"\n\u003Cp\u003EI run the game with highest settings and EVE, so that might cause some problems.\u003C/p\u003E\n"},{"CreatedByName":"Excalibur","CreatedById":12839,"CreatedDateTime":"2014-06-22T17:10:21Z","Content":"\n\u003Cp\u003ESomething I\u0027ve noticed that only occurs with KSP;\u003C/p\u003E\u003Cp\u003EOnce I\u0027ve quit the game after a decent session (an hour or so, and especially with part-heavy ships) my PC will run very slowly for a few minutes. Applications like Chrome take an age to load. There have been occasions where the only way to regain my machine\u0027s usual responsiveness is to restart.\u003C/p\u003E\u003Cp\u003EIt\u0027s as though running the game actually \u003Cem\u003Ehurts\u003C/em\u003E my poor PC and it\u0027s reeling from the pain.\u003C/p\u003E\u003Cp\u003ENever seen this with any other game, including modded versions of GTA IV and Battlefield titles.\u003C/p\u003E\u003Cp\u003ECould this be due to the high RAM usage? I only have 4GB by the way and typical game usage is just under 3GB with the few mods I use.\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-22T19:38:38Z","Content":"\n\u003Cp\u003EI have 8GB of ram and I5 4670k, ksp should be bread and butter for this hardware.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2014-06-22T19:46:35Z","Content":"\n\u003Cp\u003EKSP memory management code is one of the shoddiest ones I\u0027ve ever seen. Try Load on Demand mod, it basically does what KSP should be doing from the start - loads and unloads textures as they\u0027re needed, not all at once. You can use ATM basic with that, it gives you little quality loss and makes KSP run a bit better as well. In general, I hope Squad rewrites the texture loader before the first release. Such a piece of crap in a released product would\u0027ve been a huge embarrassment.\u003C/p\u003E\u003Cp\u003EAlso, it\u0027s normal for KSP\u0027s memory usage to increase when running (another sign of bad programming). Sometimes it does so quite fast, someone even crashed KSP just by picking up a single part and putting it back a number of times. Your best bet is to limit the amount of memory needed.\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-23T06:51:18Z","Content":"\n\u003Cp\u003EThank you all, for your answers.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-06-23T07:57:33Z","Content":"\n\u003Cp\u003EB9\u003C/p\u003E\u003Cp\u003EOh, you want more text?\u003C/p\u003E\u003Cp\u003EOk. The B9 mod uses a mountain of ram, and is known to have memory leaks.\u003C/p\u003E\u003Cp\u003EJust pop out \u0026amp; back into KSp every 3-5 vehicle loads, and it will be fine. Unless you build ships like I do. At 2500 parts, KSp will crash no matter what mods you like.\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-23T08:12:23Z","Content":"\n\u003Cp\u003EI don\u0027t know how could you fly a 2500 part ship, i get massive lag at starting sequence, when my ship is barely a 400-500 parts.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-06-23T08:33:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DeepOdyssey\u0022 data-cite=\u0022DeepOdyssey\u0022\u003E\u003Cdiv\u003EI don\u0027t know how could you fly a 2500 part ship, i get massive lag at starting sequence, when my ship is barely a 400-500 parts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWho said anything a \u0022fly\u0022?\u003C/p\u003E\u003Cp\u003EMy 2500-part ship zips from launchpad to orbit in under 4.5 hours.\u003C/p\u003E\u003Cp\u003EWhile the first stage is in sight of KSP, framerate is about 8.\u003C/p\u003E\u003Cp\u003ENo, not frames per second.(if only!)\u003C/p\u003E\u003Cp\u003E*seconds* per frame.\u003C/p\u003E\u003Cp\u003ENeed I mention I am very well acquinted with the many ways in which KSp can run out of memory, crash, or otherwise mangle my existence?\u003C/p\u003E\n"},{"CreatedByName":"Crashy_McSplodey","CreatedById":112664,"CreatedDateTime":"2014-06-23T09:46:46Z","Content":"\n\u003Cp\u003ERight, as stated, B9 loves to eat RAM. If you could imagine a silicon eating monster with a particular penchant for RAM chips, it would be called B9-osaurus.\u003C/p\u003E\u003Cp\u003ESteps you can take to ddrastically reduce your RAM footprint are:Go to the in-game graphics settings and pring your textures to half-resolution, it \u003Cem\u003Eis\u003C/em\u003E noticeable if you crawl all over every build really close, but mostly all you have to put up with is an improved frame rate and barely perceptible pixellation on some textures.\u003C/p\u003E\u003Cp\u003ENext you should upgrade your ATM to the aggresive-stable install. I use this with an install using ~50 mods including KW and B9, Firespitter, IR, and the entire near future parts catalogue, without crashing.I also use the .DLLs maintained by one of the forum celebrities, Green_Skull.\u003C/p\u003E\u003Cp\u003EIt may also be prudent to investigate texture reduction packs if you are still having troubles after the previous three steps, although this may require editing of config files; but hopefully you are going to be too busy watching rockets cartwheel through the skies \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ELinks:\u003C/p\u003E\u003Cp\u003EATM - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59005-0-23-5-Release-3-1-Active-Texture-Management-Save-RAM-without-reduction-packs!?highlight=ATM\u002Bactive\u002Btexture\u002Bmanagement\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/59005-0-23-5-Release-3-1-Active-Texture-Management-Save-RAM-without-reduction-packs!?highlight=ATM\u002Bactive\u002Btexture\u002Bmanagement\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESetting Texture Resolution - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/35296-Unofficial-PSA-A-short-term-fix-for-memory-outage-related-CTD-plages?highlight=half\u002Bres\u002Btexture\u002Bsetting\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/35296-Unofficial-PSA-A-short-term-fix-for-memory-outage-related-CTD-plages?highlight=half\u002Bres\u002Btexture\u002Bsetting\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGreen Skull ATM DLLs - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59005-0-23-5-Release-3-1-Active-Texture-Management-Save-RAM-without-reduction-packs!?p=1196453\u0026amp;viewfull=1#post1196453\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/59005-0-23-5-Release-3-1-Active-Texture-Management-Save-RAM-without-reduction-packs!?p=1196453\u0026amp;viewfull=1#post1196453\u003C/a\u003E (NB! Written on a windows machine for a windows install)\u003C/p\u003E\u003Cp\u003ETexture reduction packs:\u003C/p\u003E\u003Cp\u003ESquad and B9 - \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/51361-0-23-Squad-Texture-Reduction-Pack-B9-and-KW-Packs-also\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/51361-0-23-Squad-Texture-Reduction-Pack-B9-and-KW-Packs-also\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EJust read through the instructions in the posts, and go do some rocket science!\u003C/p\u003E\u003Cp\u003EAnd for those of you flexing your e-peens over the calibre of your hardware, and getting confused when your poor, abused, force-fed KSP install CTDs, please read below...\u003C/p\u003E\u003Cp\u003EWindows and Mac users are limited to an x32 (32 bit) installation (unless you use the x64 \u0027hack\u0027 by moving in the x64 unity engine files). x32 Applications are intrinsically limited in the amount of RAM they can used, regardless of how much/little you have in your machine. This limit is ~3.5-3.7 GB of RAM, which a heavily modded KSP install will devour with great relish. If you have LESS RAM than this then your machine can use \u0027virtual RAM\u0027 by placing these extra files on your HDD and moving files in and out of the RAM as neccesary.There is a trial build of x64 for Windows coming, and Linux users have been able to enjoy the lack of memory restriction an x64 install brings for a while now. Until then, Most of us who do not have the tech-savvy or google-literacy to start derping around in install files and pulling .exe files apart to move Unity Engine parts are going to be facing the x32 limit. \u003C/p\u003E\u003Cp\u003EP.S. Stop bragging about how fast your CPU is, and no one cares how big your RAM is either.\u003C/p\u003E\u003Cp\u003EP.P.S if you are still struggling to keep KSP up and running after checking that all of the above are correct, then it is probably:\u003C/p\u003E\u003Cp\u003E1) A conflict between MODS\u003C/p\u003E\u003Cp\u003E2) An incorrectly updated/installed MOD\u003C/p\u003E\u003Cp\u003E3) Your install has been corrupted, re-install after saving your mods and saves.\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-23T20:31:37Z","Content":"\n\u003Cp\u003EIt\u0027s a shame there is no texture reduction pack for interstellar. Their reactors, or heat radiators cause a lag in VAB, and they are still highly detailed even with ATM.\u003C/p\u003E\u003Cp\u003EAnd i didn\u0027t want to brag.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-06-24T04:18:03Z\u0022 title=\u002206/24/2014 04:18  AM\u0022 data-short=\u002210 yr\u0022\u003EJune 24, 2014\u003C/time\u003E by DeepOdyssey\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Crashy_McSplodey","CreatedById":112664,"CreatedDateTime":"2014-06-24T07:56:26Z","Content":"\n\u003Cp\u003EYou shouldn\u0027t need the reduction packs if you are using ATM, as ATM automagically reduces ALL the textures in your game, to save memory. I only suggested them as a last resort if you were still having problems. ATM compresses all of the textures to a lower resolution as the game loads them, if it gets to the point where you need to use reduction packs as well it can occasionally cause conflicts with the normal maps of the models.\u003C/p\u003E\u003Cp\u003ESorry about the brag comment it\u0027s just that people who spuge on \u0027top gear\u0027 and get butthurt when a program dies tragically need to understand that if the program doesn\u0027t know how to use all of this shiney hardware you\u0027ve emptied your pockets for, it all counts for nothing.\u003C/p\u003E\n"}]}