{"TopicId":75751,"ForumId":16,"TopicTitle":"Adjusting the saved game to trigger multi-port docking","CreatedByName":"sibrit","CreatedById":79841,"CreatedDateTime":"2014-06-23T02:03:27Z","PageNum":1,"Articles":[{"CreatedByName":"sibrit","CreatedById":79841,"CreatedDateTime":"2014-06-23T02:03:27Z","Content":"\n\u003Cp\u003EI\u0027m putting together a large ship with everything needed for an extended mission to Jool and it\u0027s satellites. Each section is essentially a Rockomax sized core with 6 Kerbodyne S3-3600 tanks on the outside connected to the core using the regular sized modular girder segment.\u003C/p\u003E\u003Cp\u003EAt both ends of each tank is an ADTP-2-3 adapter and a Clamp-O-Tron Sr. docking port. The core is sized using a variety of parts so that the Clamp-O-Tron Sr. docking ports for the center align with the outer 6 ports.\u003C/p\u003E\u003Cp\u003ESo far I\u0027ve sent up 5 different sections that either have 7 ports on one end only or 7 ports on each end. I\u0027ve successfully docked the engine section to the fuel section to the science section and am now adding in the habitat section, but for the life of me I cannot get it to dock all 7 ports. it always seems to trigger the docking process from the 2 right-hand ports leaving the other 4 outer ports and the central port undocked.\u003C/p\u003E\u003Cp\u003EI\u0027ve read that there is a docking port state of \u0022Acquire\u0022 which would cause those ports to try and connect with the one next to it. Is this the best way to get all the ports docked?\u003C/p\u003E\u003Cp\u003EI wish there was a right-click option to dock adjacent ports that currently only show as \u0022Control from here\u0022.\u003C/p\u003E\n"},{"CreatedByName":"DeepOdyssey","CreatedById":91001,"CreatedDateTime":"2014-06-23T06:53:34Z","Content":"\n\u003Cp\u003EI have no problem with docking up to 4 ports, but i use quadcoupler. I advise you to use docking port allignment.\u003C/p\u003E\n"},{"CreatedByName":"sibrit","CreatedById":79841,"CreatedDateTime":"2014-06-24T00:34:56Z","Content":"\n\u003Cp\u003EActually, since I had been docking in the shadow of Kerbin I hadn\u0027t seen it, but in the harsh light of Kerbol I noticed that the rotational alignment was off by a little bit. Enough for it not to dock all of the ports. Looking at this picture, the engine section (left side of the pic) is fully docked to the fuel section, which is full docked to the science section, which is partly docked to the habitat section, which is fully docked to the bow section, where each section is using 7 senior docking ports.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://cloud-2.steampowered.com/ugc/433784443160437944/E03E0211ACFF4BEB361B1521B3961B4A2F7BBAE5/\u0022 alt=\u0022E03E0211ACFF4BEB361B1521B3961B4A2F7BBAE5\u0022\u003E\u003C/p\u003E\u003Cp\u003EI read about the Docking Port Alignment mod but I run stock except for the Flight Engineer, which I only use in the VAB to ensure I get the necessary delta-v for my stages and during launch so I don\u0027t have to keep switching to map view to see what my apoapsis is.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-06-24T01:46:42Z","Content":"\n\u003Cp\u003EIf they have grabbed on via the center docking port, you can undock that center port. Then rotate the sections so the ports all line up (keep the whole section close). Quicksave and quickload. That resets the ports and ant the ship will redock. If you get it lined up well enough, it will hopefully multidock.\u003C/p\u003E\n"}]}