{"TopicId":76559,"ForumId":16,"TopicTitle":"Can you build really a city on the mun with only with stock parts ?","CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2014-07-03T02:06:37Z","PageNum":1,"Articles":[{"CreatedByName":"ouion","CreatedById":38531,"CreatedDateTime":"2014-07-03T02:06:37Z","Content":"\n\u003Cp\u003EI thought about this idea. I mean you can start with a colony and as you land more parts and spacecrafts and it accumulates as it goes on. Would it be possible to build a city on the mun with only stock parts. Leave a thought about this guys. It\u0027s it really possible to build a city on the mun ?\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-07-03T02:43:58Z","Content":"\n\u003Cp\u003EYes, but part counts add up and get laggy quickly. I tried it.\u003C/p\u003E\n"},{"CreatedByName":"MonkeyFuzz","CreatedById":32494,"CreatedDateTime":"2014-07-03T02:48:46Z","Content":"\n\u003Cp\u003EWith that restriction: a city, no. A village, yes!\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-07-03T02:49:36Z","Content":"\n\u003Cp\u003EYeah the game becomes unplayable before town status, let alone city. A city would be at least ten thousand Kerbals.\u003C/p\u003E\n"},{"CreatedByName":"PaladinFoster","CreatedById":114164,"CreatedDateTime":"2014-07-03T03:23:14Z","Content":"\n\u003Cp\u003EWell, yes, but I expect it would be a very boring one with only stock parts. I think the most useful thing you could build is a kind of recharge and resupply station for rovers. It would have a lot of large solar panels, a massive battery bank, and a few RTGs for generating lots of electricity to transfer into rovers, which can connect via a ring of small docking ports on the bottom. On top of this is a mobile processing lab and antenna array for processing surface samples gathered by the rovers and transmitting them back to Kerbin. It would actually be a pretty sweet science farm if you had the patience to set it up and then drive rovers all over the Mun to gather the samples and reports. \u003C/p\u003E\u003Cp\u003EHere\u0027s some screenshots of some examples I constructed on Kerbin to better visualize. \u003C/p\u003E\u003Cp\u003EHere we have the whole setup near the shore at KSC.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Um2xgdF.png\u0022 alt=\u0022Um2xgdF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENext is a close-up of the rover design. It\u0027s got a nice futuristic look if I do say so myself. It comes equipt with various scientific instruments for taking readings all over the Mun, as well as some RCS tanks and thruster blocks for jumping over those hills, craters, and canyons that are just impractical to drive through. A few RTGs extend the range, but can\u0027t quite keep up with the demands of the rover wheels forever. That\u0027s why we have a Clampotron Jr on the front. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AX5OKml.png\u0022 alt=\u0022AX5OKml.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs you can see here, the Clampotrons don\u0027t quite link up properly on Kerbin with all it\u0027s powerful gravity pulling the base down. However, in the Mun\u0027s lesser gravity it should link up and allow for fuel transfer from that large RCS tank. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pVo2w2p.png\u0022 alt=\u0022pVo2w2p.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow let\u0027s take a closer look at the base. It has those large solar panel arrays to get all the juice it needs to run the mobile processing lab and communications array at the same time. A ring of RTGs along the top provide backup power during the Munar nights, and the massive battery banks provide plenty of storage for reserve power. The RCS tank should have enough monopropellant for many rover jaunts across the grey landscape, and resupply missions can be made easily with a specially designed rover to link up with the existing docking ports. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MFofxVu.png\u0022 alt=\u0022MFofxVu.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only problem is that this thing is HUGE and HEAVY. I got it out by the shore via some side-mounted SRB\u0027s and 4 big old parachutes, though landing it safely on the Mun will be a whole other ordeal. It would take a skilled pilot and some inventive engineering to build a lander that could lug it there. Have a detail shot on those parachutes for fun.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/MSadT8Y.png\u0022 alt=\u0022MSadT8Y.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Tortoise","CreatedById":68002,"CreatedDateTime":"2014-07-03T03:51:16Z","Content":"\n\u003Cp\u003EYes, many people has. You can even do it on other planets.\u003C/p\u003E\n"},{"CreatedByName":"scul","CreatedById":97252,"CreatedDateTime":"2014-07-03T04:56:18Z","Content":"\n\u003Cp\u003ETemstar did it here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/50685-Modular-Base-Creation-Kit\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/50685-Modular-Base-Creation-Kit\u003C/a\u003E. The first picture appears to be all stock, but the purpose of that base is for Kethane mining\u003C/p\u003E\n"},{"CreatedByName":"lammatt","CreatedById":21777,"CreatedDateTime":"2014-07-03T09:34:11Z","Content":"\n\u003Cp\u003Eunless you have an insane CPU\u003C/p\u003E\u003Cp\u003Ei dont think a midhigh end home CPU manages to output at 60fps in this game when there\u0027re 500\u002Bparts within the 2.5km rendering range\u003C/p\u003E\u003Cp\u003E(you can tweak the physic dt to gain performance marginally tho)\u003C/p\u003E\u003Cp\u003E(mine is a 5yr old phenom2 x5 955 \u003Ca href=\u0022/cdn-cgi/l/email-protection\u0022 class=\u0022__cf_email__\u0022 data-cfemail=\u0022155a5655263b2352\u0022\u003E[email\u0026#160;protected]\u003C/a\u003E, and i start getting into the yellow zone at around 200parts, and is unplayable at 350\u002B parts)\u003C/p\u003E\u003Cp\u003Ebut if your \u0022city\u0022 has a very low part count..(aka a small village instead)\u003C/p\u003E\u003Cp\u003Eyou can, i dont see why not.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-03T09:39:00Z\u0022 title=\u002207/03/2014 09:39  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 3, 2014\u003C/time\u003E by lammatt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jean Deaux","CreatedById":59842,"CreatedDateTime":"2014-07-04T01:56:51Z","Content":"\n\u003Cp\u003EJust depends on how big you want to go? I\u0027m a big (mostly) stock player and this is one of my preferred pre-fab cities I drop as a 1 piece insta-town.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1365.photobucket.com/albums/r747/jdeaux44/MunBase2_zps1c26c97a.png\u0022 alt=\u0022MunBase2_zps1c26c97a.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-04T01:58:59Z\u0022 title=\u002207/04/2014 01:58  AM\u0022 data-short=\u002210 yr\u0022\u003EJuly 4, 2014\u003C/time\u003E by Jean Deaux\u003C/strong\u003E\n\u003C/span\u003E\n"}]}