{"TopicId":77433,"ForumId":16,"TopicTitle":"Space Station wobbling and accelerating???","CreatedByName":"TheGamingVortex","CreatedById":72380,"CreatedDateTime":"2014-07-13T01:01:30Z","PageNum":1,"Articles":[{"CreatedByName":"TheGamingVortex","CreatedById":72380,"CreatedDateTime":"2014-07-13T01:01:30Z","Content":"\n\u003Cp\u003EHope this is in the correct section.....\u003C/p\u003E\u003Cp\u003EI recently learned how to dock ships in orbit (thanks Scott Manley \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ), but now I am having issues with my station wobbling and eventually rabidly deconstructing itself. Here is a video to explain it better.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/tFDmkhR7-sg?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EIn the end I fired up the main engine to try and move since all other attempts where unsuccessful. If I had dont nothing the stations would eventually wobble until it broke apart. Does anyone have any idea what may be causing this? Here is a list of the mods used, \u003C/p\u003E\u003Cp\u003EKSP v.23\u003C/p\u003E\u003Cp\u003EKerbal Alarmclock v2.7.3.0\u003C/p\u003E\u003Cp\u003EEditor Extension v1.1\u003C/p\u003E\u003Cp\u003EProcedural Fairings v2.4.4\u003C/p\u003E\u003Cp\u003EEngineer Redux v0.6.2.3\u003C/p\u003E\u003Cp\u003EDocking Port Alignment v3.01\u003C/p\u003E\u003Cp\u003EQuantum Struts v2.0.3\u003C/p\u003E\u003Cp\u003EKW Release Package v2.5.6B\u003C/p\u003E\u003Cp\u003EThese mods where a suggestion in one of Scott Manley\u0027s videos except for Quantum Struts. I recently added that mod because I was having structural issues with my stations. Rather than redesign the station, I opted out for a mod \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-13T02:00:19Z\u0022 title=\u002207/13/2014 02:00  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 13, 2014\u003C/time\u003E by TheGamingVortex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2014-07-13T01:06:48Z","Content":"\n\u003Cp\u003EYour video there is set to private, so it\u0027s not really possible for anyone to view it right now...\u003C/p\u003E\n"},{"CreatedByName":"timsfitz","CreatedById":104387,"CreatedDateTime":"2014-07-13T01:50:43Z","Content":"\n\u003Cp\u003EJust updating to 23.5 will make the connections stronger and will reduce wobble.\u003C/p\u003E\n"},{"CreatedByName":"TheGamingVortex","CreatedById":72380,"CreatedDateTime":"2014-07-13T02:01:00Z","Content":"\n\u003Cp\u003EI am sooo sorry. I thought I set that thing to public but apparently I was incorrect. Set to public now.\u003C/p\u003E\n"},{"CreatedByName":"TNM","CreatedById":87785,"CreatedDateTime":"2014-07-13T10:11:43Z","Content":"\n\u003Cp\u003EMultiple SAS.....deactivate all but 1, keep the one near the center of mass. On very large/long stations not even that helps, deactivate SAS/RCS alltogether. Reload station (switch to ground station and back) and wobble is gone.\u003C/p\u003E\n"},{"CreatedByName":"TYRT","CreatedById":72285,"CreatedDateTime":"2014-07-13T10:25:17Z","Content":"\n\u003Cp\u003EIs there a mod we can see center of mass in orbit ?\u003C/p\u003E\n"},{"CreatedByName":"RidingTheFlow","CreatedById":111197,"CreatedDateTime":"2014-07-13T10:35:31Z","Content":"\n\u003Cp\u003ECenter of camera rotation = center of mass. If you zoom in, you will see where it is.\u003C/p\u003E\n"},{"CreatedByName":"Epthelyn","CreatedById":57970,"CreatedDateTime":"2014-07-13T10:55:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TNM\u0022 data-cite=\u0022TNM\u0022\u003E\u003Cdiv\u003EMultiple SAS.....deactivate all but 1, keep the one near the center of mass. On very large/long stations not even that helps, deactivate SAS/RCS alltogether. Reload station (switch to ground station and back) and wobble is gone.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe SAS was turned off almost immediately after docking and the oscillations appear get worse without it engaged; reloading would probably just reset the oscillations but they\u0027d start up again; that would have to be checked by TheGamingVortex though.\u003C/p\u003E\u003Cp\u003EEither way, that doesn\u0027t explain the acceleration. I\u0027ve never known a craft with SAS-related oscillations to constantly accelerate in one direction; they usually just slow down and speed up as the pod moves around.\u003C/p\u003E\n"},{"CreatedByName":"Polstar","CreatedById":89598,"CreatedDateTime":"2014-07-13T10:55:48Z","Content":"\n\u003Cp\u003EI had a very similar problem last month. The whole station would start with a minor wobble that would eventually rip everything apart. What I found was one of my modules had two of the observation capsules on either side. Even though they weren\u0027t the parent part they conflicted with each other. In the end I undocked and jettisoned it. \u003C/p\u003E\u003Cp\u003ESince then I\u0027ve had no issues.\u003C/p\u003E\n"},{"CreatedByName":"TheGamingVortex","CreatedById":72380,"CreatedDateTime":"2014-07-13T12:56:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Epthelyn\u0022 data-cite=\u0022Epthelyn\u0022\u003E\u003Cdiv\u003EThe SAS was turned off almost immediately after docking and the oscillations appear get worse without it engaged; reloading would probably just reset the oscillations but they\u0027d start up again; that would have to be checked by TheGamingVortex though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the 5th or 6th time I\u0027ve reloaded and tried re-docking. I thought it was a glitch the first time because I docked rather hard. In the video you can see me throttling backwards away from the station just as the docking coupler starts to pull me in. I did this in an attempt to slow my docking speed and to see if pulling backwards would stop the accelerating...it did not. I\u0027ve left SAS and or RCS on in the past even after I dock and the oscillations get really bad almost immediately, but if I turn them off the start them back up its not too bad. One time, as soon as I docked I went into time warp and I did not accelerate but the wobbling got REALLY bad and I broke up almost instantly. When my station broke apart, most of the parts fell \u0022down\u0022 (in relation to the planet, not towards the planet but parallel and downwards).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI had a very similar problem last month. The whole station would start with a minor wobble that would eventually rip everything apart. What I found was one of my modules had two of the observation capsules on either side. Even though they weren\u0027t the parent part they conflicted with each other. In the end I undocked and jettisoned it. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo maybe I could un-dock all my station parts, the re-dock in a different order? That could prove to be fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I\u0027ll give it a shot and see which part is causing the issue.\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-07-13T13:29:31Z","Content":"\n\u003Cp\u003EIt\u0027s due to the quantum struts. You don\u0027t even need them unless you\u0027re trying to build a 10 kiloton station with so many parts no that no PC will be able to handle it anyway. Quantum struts are good for motherships, for things that move and need that stability. Try it without them and it should be okay.\u003C/p\u003E\n"},{"CreatedByName":"TheGamingVortex","CreatedById":72380,"CreatedDateTime":"2014-07-13T15:36:48Z","Content":"\n\u003Cp\u003EThis station is meant to move. It will eventually go to Minus. I did not initially use the struts, and when I fired uup the main engine the two side capsules would break off. Hence the reason for the struts. The design was not thought very well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, I. Was just making a stsaion at first then I decided to try and move it to Minus.\u003C/p\u003E\u003Cp\u003E But I do think your right, I\u0027ll removen the struts and see what happens. Can I just uninstall the quantum strut mod and try re-docking? Or do I need to \u0022land\u0022 the tanker send another one up without the struts?\u003C/p\u003E\u003Cp\u003ESent from my POS phone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"theend3r","CreatedById":97560,"CreatedDateTime":"2014-07-13T15:47:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheGamingVortex\u0022 data-cite=\u0022TheGamingVortex\u0022\u003E\u003Cdiv\u003EThis station is meant to move. It will eventually go to Minus. I did not initially use the struts, and when I fired uup the main engine the two side capsules would break off. Hence the reason for the struts. The design was not thought very well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E, I. Was just making a stsaion at first then I decided to try and move it to Minus.\u003Cp\u003E But I do think your right, I\u0027ll removen the struts and see what happens. Can I just uninstall the quantum strut mod and try re-docking? Or do I need to \u0022land\u0022 the tanker send another one up without the struts?\u003C/p\u003E\u003Cp\u003ESent from my POS phone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you remove the mod the whole craft will be deleted. I use hyperedit for those situations.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-07-13T16:01:21Z","Content":"\n\u003Cp\u003EIf you turn off SAS and just wait, it will eventually stop, but it may take awhile.\u003C/p\u003E\u003Cp\u003EAnother option is to change the \u0022control from here\u0022 point to something near the center of your craft, like one of the docking ports on your central hub.\u003C/p\u003E\u003Cp\u003EAnd that things going to be a nightmare to move. Instead of moving it all as one piece, I\u0027d recommend building a tug to take it to Minmus on part at a time, and re-assembling it there.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-13T16:03:41Z\u0022 title=\u002207/13/2014 04:03  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 13, 2014\u003C/time\u003E by LethalDose\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheGamingVortex","CreatedById":72380,"CreatedDateTime":"2014-07-13T20:49:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EIf you turn off SAS and just wait, it will eventually stop, but it may take awhile.\u003Cp\u003EAnother option is to change the \u0022control from here\u0022 point to something near the center of your craft, like one of the docking ports on your central hub.\u003C/p\u003E\u003Cp\u003EAnd that things going to be a nightmare to move. Instead of moving it all as one piece, I\u0027d recommend building a tug to take it to Minmus on part at a time, and re-assembling it there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI turned SAS off one time and it still wobbled itself to death. Plus I don\u0027t think that would stop the forward movement. I\u0027m realliny starting to think its a mod causing the problem.\u003C/p\u003E\u003Cp\u003EAs for moving the station, that\u0027s fairly simple. The main engine in the rear does a fine job of moving the station. But I do think I will send each piece out to Minus by itself.\u003C/p\u003E\n"},{"CreatedByName":"TheGamingVortex","CreatedById":72380,"CreatedDateTime":"2014-07-16T23:06:10Z","Content":"\n\u003Cp\u003EI finally got around to crashing the \u0022quantum strut\u0022 tanker, rebuilding a new tanker and getting it into orbit for docking.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/SAUzuVFVvDc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EOn a side note, this is only the fifth or sixth ship I\u0027ve docked. I\u0027m getting better \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MisterFister","CreatedById":85686,"CreatedDateTime":"2014-07-17T05:42:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LethalDose\u0022 data-cite=\u0022LethalDose\u0022\u003E\u003Cdiv\u003EIf you turn off SAS and just wait, it will eventually stop, but it may take awhile.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, I have to admit I was going to say this too (as did a few others, no doubt) but then I watched the video and saw that this was accounted for in the OP\u0027s original troubleshooting attempts \u003Cem\u003Ecaptured on video\u003C/em\u003E. The fact that it \u003Cstrong\u003Eregistered as an acceleration\u003C/strong\u003E on the g-meter AND for purposes of time-acceleration, as well as the truly massive perturbations to your orbital pedigree (large radial changes in perikee and apokee by tens of thousands of meters each) really support the hypothesis that the ghost-forces being applied were parallel to your Center of Thrust, further implicating (but not confirming) that the QS was the problem.\u003C/p\u003E\u003Cp\u003ESecond, I\u0027m glad that the video showing no QS means that your originally reported symptom seems to have been solved. Perhaps post your before / after video links on a QS-centered thread, as it seems like something that might be fixable. (The modder might have incentive to dig for this, given the .24 release.) After seeing the before video, this too would have been a response, and I hark back to a Scott Manley video (I just spent a few minutes looking for the exact one, but he\u0027s been way too damn prolific for me to find it) where he combined Infernal Robotics rotatrons with Quantum Struts and, with well-designed action groups, can literally \u0022walk\u0022 a pair of rotatrons up an invisible staircase because the Quantum Struts leverages some kind of ghost-of-a-bug in the code to \u0022halt\u0022 [my word] movement of parts within the skybox itself. Given how freaky that sounds on a simulated-physics-involved basis, the kind of spontaneous oscillation you described doesn\u0027t seem far-fetched to me.\u003C/p\u003E\u003Cp\u003EThird, had your solution not worked (or alternatively, if you find at some other point that some sort of residue of this issue remains that might not be obvious in your after-video) I\u0027d suggest further tracking it down to see if it may be a problem of competing control wheels or competing probe core problem. Frankly, based on what I\u0027ve seen with your two videos here, it remains technically possible that the Quantum Struts were actually not the cause of your problem -- since you recorded the after-video with a re-launched, re-designed vehicle, it\u0027s possible that you may have inadvertently flipped / eliminated some other subtle cause of the problem.\u003C/p\u003E\u003Cp\u003ETroubleshooting this may be tedious, and in any event would require you re-simulating your problem under the previous doomed conditions (either by recreating it with the original QS-enabled design from launch again, or restoring from a quicksave.) One thing that I\u0027ve always done, even on my savefiles where I don\u0027t use an Action Groups Editor / Extender (I rotate through a few of them and get infatuated with one from time to time, but nothing really strikes my fancy wholeheartedly, and I have no ability to make my own plugin) I always use universal control groups, so that no matter what docked configuration my monstrosities could ever be in, the control group schemes always match up. For some reason that I can only partially articulate, I always assigned all probe-core / capsule / SAS / reaction wheels to control group 0 (zero) to deactivate them, and 9 to reactivate them all at once. I may have developed this habit when I was running .19 prior to my recent computer hardware upgrades and I was trying to dock large-part-count stations with framerates averaging 2-5 frames / sec. I know you were deactivating SAS and RCS globally on your before-video, but my suggestion allows you to turn them off globally and then manually reactivate single ones in order to observe the effects of ONLY using certain ones, possibly in certain combinations of multiple parts working or off. For troubleshooting purposes, you might wanna consider assigned the Quantum Strut emitters to a control group toggle, possibly combined with different docking orientations (maybe the issue wasn\u0027t so much the QS themselves, but the fact that you entered a docked state while the QS were active -- as your craft drifted into maglock range, the QS were blasting empty space, but once the docking node finally engaged and the craft rigidized, THEN they were pressing on those external pods you were trying to reinforce... maybe this caused an initial flex that never resolved structurally, and it was a flight design problem and not a KSP or QS code problem.)\u003C/p\u003E\u003Cp\u003EOn a design level, consider addressing your dynamic flexion problem with KAS struts, or perhaps a three-way docking node setup (lining up docking ports at the ends of your arms to perform the same lateral support function as your QS were designed to.) Hell, even eschewing the end-docks and just putting in girder segments for the modules to rub up against it like pressure points would at least limit the free range of lateral motion you\u0027re trying to arrest when the main engine fires. Another possibility is to either assemble in Minmar orbit entirely, or redesign the whole station to allow for convertible assembly (one docked configuration for transfer such as inline or pendulum style, and then disassemble and re-dock / reassemble at destination -- which would likely necessitate adding some form of a small RCS-powered assembly tug for the purposes of performing and managing such reassembly in destination orbit).\u003C/p\u003E\u003Cp\u003EUltimately, I can rather confidently speculate as to some benefits of doing it the way you\u0027re attempting to, assembling it with outcropping bits in LKO before sending it on a Minmar transfer burn. For one, it\u0027s a pretty good proof-mission for an interplanetary run. For two, admittedly, it \u003Cem\u003Eis\u003C/em\u003E simpler your way. And for three, lateral assembly does allow for more possibilities to control CoM and CoT during transfer (more possibilities to skafooz it, too.)\u003C/p\u003E\u003Cp\u003EAt any rate, stay cool dude. Next time in addition to posting a video, perhaps consider offering the .sav and .craft files, because sometimes just a video recording can fail to capture other possible indicators of trouble. (Posting those files, of course, would require a DETAILED list of the mods you run, and we saw in your video that you at least run Quantum Struts and KWRocketry). Some people don\u0027t keep track of what mods they run (I keep a spreadsheet, a spreadsheet I might have to upgrade with the x64 options in .24, since one of the primary things my spreadsheet currently tracks is what versions to run -- especially with the SpacePort shutting down and everything migrating recently -- and which I leave inactive in order to keep my memory usage below the magic 3.5gb threshold) and making a list on the fly by someone who\u0027s not used to doing so can sometimes be a wasted exercise for both the person disclosing the list as well as the person relying on receiving it so that they can run and test your .sav.\u003C/p\u003E\n"},{"CreatedByName":"Talavar","CreatedById":75264,"CreatedDateTime":"2014-07-17T06:10:36Z","Content":"\n\u003Cp\u003EAs was stated before, You are using .23 .. simply updating to the newest version adds ALOT of stability. and will probably take that shake right out of all your ships/stations.\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-07-17T09:48:09Z","Content":"\n\u003Cp\u003E\u0022Tried to time accelerate to stop osculations\u0022\u003C/p\u003E\u003Cp\u003EIsn\u0027t some movement normal when \u003Cem\u003Ekissing\u003C/em\u003E?\u003C/p\u003E\u003Cp\u003ESeriously though..\u003C/p\u003E\u003Cp\u003EYou have enough quantum struts to tow the Death Star.\u003C/p\u003E\u003Cp\u003EThey are trying to stabilise a contraption that is docked through a large RCS tank(squishy) and **double** stacked docking ports (inherently unstabile!)\u003C/p\u003E\u003Cp\u003E!!note that the main component of yoru wobble comes not from the newly-docked bit, but from the *other side* of your station.\u003C/p\u003E\u003Cp\u003EHow about strutting the 3 existign arms of your station with a single strut each?\u003C/p\u003E\u003Cp\u003EThe puzzle is not why it is wobbly, the puzzle is that you managed to establish positive docking lock in the first place.\u003C/p\u003E\u003Cp\u003ETry the same design, but without the superfluous docking port.\u003C/p\u003E\u003Cp\u003ETry the same design but with docking not running through a large RCS tank.\u003C/p\u003E\u003Cp\u003ETry the same design but with no more than 1 quantum strut per radial direction.\u003C/p\u003E\u003Cp\u003ETry the same design but with struts between the other arms of your station. Quantum struts are handy, here, but only one per direction please.\u003C/p\u003E\n"},{"CreatedByName":"TheGamingVortex","CreatedById":72380,"CreatedDateTime":"2014-07-18T01:45:54Z","Content":"\n\u003Cp\u003EI didn\u0027t mention it in the video, but the second video was posted in 4x normal speed. And all the mods I used are in the description of each video. (I keep all the original downloaded mods in a separate folder in case I have to reload them)\u003C/p\u003E\u003Cp\u003E@MisterFister, thanks for the writeup, you have some interesting points. And just so everyone is clear, I \u0022built\u0022 this station because I learned how to dock ships. I in no way had any vision of it getting this big or even trying to move it (the tanker/main engine was a huge after thought). I was not surprised that at first the station was unstable at first. But thanks anyways for taking time to help me through this problem, it is much appreciated. And now just for fun I\u0027d like to see if I can get this thing to work stably \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E And if anyone wants further details whether is be more video or the .sav files (gota learn how to post those), let me know. \u003C/p\u003E\u003Cp\u003EThe \u0022new\u0022 tanker I sent up was almost exactly the same as the original one minus the QS. Only thing different was I added those out-jutting supports (that I jettisoned) and moved some lights around.\u003C/p\u003E\u003Cp\u003EAnd yah, I know my troubleshooting technique went out the window with this one, but I didn\u0027t take this problem to seriously. I can certainly launch the QS version of the tanker and see if the problem reoccurs. And are you saying that I can set the QS to an action group? I did not know I could do that but I will try that when I launch the tanker. I know the station is not the most stable design (again, I never really intended this station to be built this far), but I will see what other stability options I can get from other parts. \u003C/p\u003E\u003Cp\u003E@MarvinKitFox, I over engineer EVERYTHING \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Maybe 8 QS per support arm was 1 to many, but now I know that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E As for the double stacked docking ports, thats a mess upon my part. I\u0027ll try removing one of them.\u003C/p\u003E\u003Cp\u003EThanks again for the help and support with this seemingly (to me) not important problem.\u003C/p\u003E\n"},{"CreatedByName":"Vanamonde","CreatedById":27914,"CreatedDateTime":"2014-07-18T03:08:48Z","Content":"\n\u003Cp\u003EThis thread has been moved to the how-to section, since it\u0027s more station-building/operating techniques than anything else.\u003C/p\u003E\n"}]}