{"TopicId":77669,"ForumId":16,"TopicTitle":"Burn Planning with LV-N for High-dV Maneuvers","CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-07-15T02:41:35Z","PageNum":1,"Articles":[{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-07-15T02:41:35Z","Content":"\n\u003Cp\u003EMy Kerbals are finally getting ready to go interplanetary in a big way. That obviously means nuclear propulsion. But \u0027interplanetary\u0027 means I\u0027ll be doing larger-dV single burns (\u0026gt;2000 m/s in some cases) ... and with fuel-efficient but low-accel craft? That means long burn times.\u003C/p\u003E\u003Cp\u003EWhere \u0022long\u0022 (by my very rough calculations) is going to mean \u0022a substantial fraction of LKO orbital period\u0022. An 8-minute burn is a quarter of an orbit... and the Maneuver Planner assumes \u0022instant\u0022 dV applied to a specific moment/location. Which in turn adds significant differences between the impulsively-planned maneuver and the actual long-burn-time maneuver. I haven\u0027t ever needed to burn longer than about 5 minutes in any of my trips to date, and even that was starting to noticeably adversely affect the actual trajectory vs the planned trajectory. (And Minmus\u0027s SOI from 46Mm is a huge target compared with, say, targeting Dres\u0027s SOI on the other side of the Kerbolar system.)\u003C/p\u003E\u003Cp\u003EIf I were doing this with my professional hat on, I\u0027d crank up one of the trajectory-optimization packages, integrate the EOM, and get a burn profile that accounted for the time spent in the burn (and associated orbital V-vector change during that time, etc.). But that\u0027s Way Too Much Like Real Work...and I know most of you don\u0027t have those sorts of tools ready to hand (and therefore are doing it--successfully--without such tools.)\u003C/p\u003E\u003Cp\u003ESo I\u0027m casting about for an accessible, low-tech, play-friendly solution. The first thing I thought of was to start by climbing into a much higher orbit with a longer period, so that it\u0027s still a reasonable approximation to model a 10\u002B minute burn as impulsive-dV. But that technique is wasteful of the selfsame fuel that I am using nukes to *conserve* in the first place. And I haven\u0027t seen anyone calling that out as a convenient way to improve the accuracy of interplanetary departure burns, so I assume you folk have hit on something else. \u003C/p\u003E\u003Cp\u003ESo how do you more-experienced Kerbonauts approach the problem of maneuver planning for interplanetary departures with very long burn times?\u003C/p\u003E\n"},{"CreatedByName":"Dangerous_Beans","CreatedById":78059,"CreatedDateTime":"2014-07-15T02:56:03Z","Content":"\n\u003Cp\u003Efrom what i have read, the usual approach is to split the burn over two orbits; burn to establish a high apoapsis eccentric orbit, then do the injection burn at the periapsis of the next orbit. you then probably need to do a correction burn midway there. \u003C/p\u003E\u003Cp\u003Emy approach is to just leave from a high orbit and just use a bit more fuel. however i use mods like Kethane or Interstellar, so if i am doing things with low T/W nuke craft i usually have refuelling stations on Minimus so i don\u0027t really care.\u003C/p\u003E\n"},{"CreatedByName":"Jimbimbibble","CreatedById":77859,"CreatedDateTime":"2014-07-15T03:23:26Z","Content":"\n\u003Cp\u003EA good rule of thumb is to start burning half of your burn time before the node. It\u0027s not perfect but it usually gets you close enough. You will almost always have to make course corrections as it is no it\u0027s not such a big deal. A mod that could really help is protractor, which gives you information about phase angles and when to start you burn. Sometimes it works, sometimes it doesn\u0027t.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-07-15T03:47:00Z","Content":"\n\u003Cp\u003EI\u0027ve heard several people use 4 minutes as a cutoff for splitting up the burn into multiple segments. If it\u0027ll take more than 4 minutes, split the burn into two parts. For each burn, split it in half around the maneuver node like you would for a shorter burn. Start two minutes before and stop two minutes after. Place a new node and do the rest of the burn.\u003C/p\u003E\n"},{"CreatedByName":"Seyvern","CreatedById":1875,"CreatedDateTime":"2014-07-15T03:48:57Z","Content":"\n\u003Cp\u003EThe best answer is Dangerous_Beans, not Jimbims.\u003C/p\u003E\u003Cp\u003EBasically - the idea is - as you point out - you want to burn low where the oberth effect is maximum. Because the orbital period in LKO is very fast (~30 minutes) relative to the inerestion point for a planetary transfer (months to years), you can spread the burn over quite a few Kerbin orbits and not impact your burn trajectory in any noticeable way.\u003C/p\u003E\u003Cp\u003ESo, step 1, make a maneuver plan.\u003C/p\u003E\u003Cp\u003EStep 2, Burn for some short amount of time around hte burn point, this will make your orbit eliptical. \u003C/p\u003E\u003Cp\u003EStep 3: Replan your manuver point for the next orbit. Orbit around back to periapsis and burn again. Orbit becomes more eliptical.\u003C/p\u003E\u003Cp\u003EStep N: keep repeating step 3 until you have finished your burn sequence. \u003C/p\u003E\u003Cp\u003ETwo big things to watch out for. Make sure none of your burns intercept Mun or Minmus. Make sure your next to last burn stays within kerbin\u0027s SOE\u003C/p\u003E\u003Cp\u003E-Seyv\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-07-15T04:16:48Z","Content":"\n\u003Cp\u003EI don\u0027t like to add more than about 800 delta-v on the initial burns, that\u0027s getting you near to the Mun\u0027s orbit ... but at that point you\u0027re much better off than you were in terms of burn length. Now your 10 minute burn is more like a 6 minute burn, and you\u0027re moving faster besides, which will get you clear of the planet (and the area of strongest gravitational attraction) all the sooner, so you\u0027ll probably hold course a BIT better.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-07-15T06:12:34Z","Content":"\n\u003Cp\u003EI\u0027ve done a lot of launches to Jool from a 120 km orbit with initial TWR around 0.2. Just start the burn around 5 minutes before the maneuver node, and be prepared to plan a course correction as soon as the burn is finished. Sometimes you have to manually determine when you have completed the burn, because the game tracks long burns incorrectly on low orbits.\u003C/p\u003E\u003Cp\u003EAnother option is to start from a bit higher orbit. 600 km is about as efficient as lower orbits, assuming that you refuel the ship before launch, but long burns can be made more accurately from there.\u003C/p\u003E\u003Cp\u003EI\u0027ve never liked very much the idea of splitting a long burn in multiple parts. Too much hassle for marginal delta-v savings.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-07-15T07:13:47Z","Content":"\n\u003Cp\u003E^^ This.\u003C/p\u003E\u003Cp\u003EAll of it, especially the last sentence.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-07-15T07:21:19Z","Content":"\n\u003Cp\u003EHow exactly does the game do long burns in low orbits incorrectly? I\u0027m always on the lookout to learn more about how stuff works \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-07-15T08:12:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003EI\u0027ve never liked very much the idea of splitting a long burn in multiple parts. Too much hassle for marginal delta-v savings.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe savings aren\u0027t marginal. Nuclear engines are by far the most efficient interplanetary propulsion, and if you need to move a very large ship, then you\u0027re stuck with a very long burn, even if you use loads of nukes. \u003C/p\u003E\u003Cp\u003EI recently had a 30 minute burn, which clearly needed to be broken down (into 5 burns). With such a big ship, the only way to have made this quicker was with bigger engines (not moar nukes, i already had 24), which would have meant a very significant loss of efficiency. \u003C/p\u003E\u003Cp\u003EThere are a couple of things you need to be careful of with such long burns:\u003C/p\u003E\u003Cp\u003EFirstly, watch your periapsis if you\u0027re moving to a solar orbit outside of Kerbin\u0027s (ie your node is just after dark). If you\u0027re burning from a low orbit, looking to capitalise on Oberth, and you start burning some time before your periapsis, you\u0027ll push it down. The equal burn you make after periapsis pushes it back up, but you just need to make sure that you have room to avoid going into the atmosphere. eg, if you\u0027re making a 6 minute burn from a 75k orbit, the 3 minutes you burn before the node will probably push your periapsis into the atmosphere. So either start from a higher orbit, or split the burn.\u003C/p\u003E\u003Cp\u003ESecondly, if you\u0027re doing a really big burn, split into multiples, then you need to think about starting well in advance of your node. Possibly days in advance. People have talked about getting into an eliptical orbit coming close to that of the Mun, and of getting as much velocity as possible without reaching escape. If you do this, bear in mind how long your orbital period will become. Orbits out there can take days to complete, by which time you may have missed the most efficient transfer window.\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-07-15T14:28:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EHow exactly does the game do long burns in low orbits incorrectly? I\u0027m always on the lookout to learn more about how stuff works \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve never bothered to determine exactly what happens. It has something to do with gravity, and the main effect is that you burn longer than you should, because the counter goes down too slowly towards the end of the burn. In extreme cases, you can\u0027t even finish the burn, because the counter starts going up at some point.\u003C/p\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2014-07-15T14:40:12Z","Content":"\n\u003Cp\u003EIf you want to do a single long burn, keep an eye on your trajectory departing Kerbin. Especially the small circle that shows where you exit the SOI. When you get near the end of your burn, stop relying on the burn counter, and instead just try to match up the actual SOI exit circle with the planned one from the maneuver node. This might take a bit more delta-v than the counter, and might mean you burn a little in a radial direction. If you match up the direction on the two SOI exit circles, and also match the departure time, your resultant solar orbit will be exactly what you planned with the maneuver node.\u003C/p\u003E\n"},{"CreatedByName":"NecroBones","CreatedById":105424,"CreatedDateTime":"2014-07-15T15:41:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Streetwind\u0022 data-cite=\u0022Streetwind\u0022\u003E\u003Cdiv\u003EHow exactly does the game do long burns in low orbits incorrectly? I\u0027m always on the lookout to learn more about how stuff works \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe main thing is that, because you\u0027re in a low orbit, you are going to swing through a significant arc while executing your burn. During a good portion of this, if you\u0027re following the maneuver\u0027s marker on the nav-ball, you\u0027re partially burning radially (not precisely on the prograde/retrograde marker). The longer you\u0027re off the prograde/retrograde mark, the less efficient your maneuver will be.\u003C/p\u003E\u003Cp\u003EThe maneuver node assumes you are going to change your velocity instantly at that point, so the longer you spend arcing through the orbit while burning, the less precise the results will be.\u003C/p\u003E\n"}]}