{"TopicId":77918,"ForumId":16,"TopicTitle":"Loading craft files when not all parts are unlocked","CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-07-17T06:22:39Z","PageNum":1,"Articles":[{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-07-17T06:22:39Z","Content":"\n\u003Cp\u003EI was wondering what would happen if I took a craft file from one save, and copied it to a different save where some of the parts used were not yet unlocked?\u003C/p\u003E\u003Cp\u003EDo I need to make sure I have all the needed parts unlocked before copying the file over? Will it crash the game if I attempt to load it? Or will it just fail to load but cause no big problems?\u003C/p\u003E\u003Cp\u003EThe reason I ask is that I\u0027m planning to start a new save in 0.24, but I\u0027d like to keep the craft designs (or some of them, anyway) from my current career.\u003C/p\u003E\u003Cp\u003EThe reason I ask here instead of trying it out myself is that I\u0027m bored at work and can\u0027t play KSP on my work machine.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-17T07:27:31Z\u0022 title=\u002207/17/2014 07:27  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 17, 2014\u003C/time\u003E by AlexinTokyo\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"biohazard15","CreatedById":91655,"CreatedDateTime":"2014-07-17T06:57:59Z","Content":"\n\u003Cp\u003ENo, you won\u0027t be able to open them in the VAB\\SPH. It will be greyed out in the list and say \u0022Contain locked or invalid parts\u0022 under its name. You will be able to open them once you\u0027ve unlocked all of its parts.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-07-17T07:19:06Z","Content":"\n\u003Cp\u003EBiohazard15 is correct. You will see the files but won\u0027t be able to select them until the parts are unlocked.\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-07-17T07:27:16Z","Content":"\n\u003Cp\u003EAwesome, that answers that.\u003C/p\u003E\u003Cp\u003EI was afraid it might be Kraken bait.\u003C/p\u003E\n"}]}