{"TopicId":78757,"ForumId":16,"TopicTitle":"When should I start to use the Nuclear engine?","CreatedByName":"kizentheslayer","CreatedById":101754,"CreatedDateTime":"2014-07-21T04:19:49Z","PageNum":1,"Articles":[{"CreatedByName":"kizentheslayer","CreatedById":101754,"CreatedDateTime":"2014-07-21T04:19:49Z","Content":"\n\u003Cp\u003EWhen/how should/do I use the nuclear engines? Ive got to Duna and back with Mainsails but can\u0027t make a decent Mun/Min ship with the nuclear engine.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-07-21T04:38:15Z","Content":"\n\u003Cp\u003EI for my part use it for interplanetary distances only ... not for getting to Mun or Minmus.\u003C/p\u003E\u003Cp\u003ETh emopst important thing to remember for the LV-N is its low thrust ... so it is not a bad idea to use 3-4 ... and to always be prepared to have really long burn times\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-07-21T07:53:11Z","Content":"\n\u003Cp\u003EThe LV-N is large and heavy, so it only makes sense on a ship of a certain size and weight. For example, you can build fully return capable Mun lander capsules as small as 3 tons in weight, while the LV-N weighs 2.25 tons by itself. That just won\u0027t work out, even without noting the fact that the engine would be again as tall as the rest of the lander.\u003C/p\u003E\u003Cp\u003ESimilarly, the LV-N has exactly one good stat, and that is Isp. The rest is terrible compared to other options. Isp gives you dV. And if you don\u0027t need dV, then you don\u0027t need the LV-N. For example, a transfer stage going to the Mun usually spends 850 - 860 dV for a standard Hohmann transfer. A ship weighing 15 tons, 8 of which is dry mass, with a Poodle engine (\u002B2t) will give you 1550 dV. That\u0027s more than enough to perform the transfer and brake into orbit. In fact you\u0027ll probably have fuel left to deorbit before decoupling the lander, if your craft is a one-use affair. The same ship with a LV-N (\u002B2,25t) would give you 3120 dV. What are you gonna do with that? If you have no use for it, then all you just did was replace a 220 kN thrust engine with a 60 kN thrust engine for no reason.\u003C/p\u003E\u003Cp\u003EHowever, if you \u003Cem\u003Edo\u003C/em\u003E need those 3120 dV, then a ship using a Poodle would weigh 23 tons, not 15. That gives you a Kerbin-relative TWR of 0.975 for the Poodle versus 0.408 for the LV-N - the Poodle is still better, but not by as much as before. And you need to lift 8 extra tons into Kerbin orbit as well.\u003C/p\u003E\u003Cp\u003EWant 4000 dV? That\u0027s 28.5 tons with the Poodle, and 16,75 tons with the LV-N. 11,25 tons difference for lifting into orbit, and a TWR difference of 0.787 to 0.365. But, what if you used four LV-N\u0027s? A ship weighing 28.5 tons (the same as the Poodle ship) gives you the 4000 dv you want, but the total thrust is 240 kN, not 220 kN. of course, adding 9 tons worth of LV-N engines to 8 tons of dry mass is rather silly, but it shows: the LV-Ns are slowly starting to make sense.\u003C/p\u003E\u003Cp\u003ENow let\u0027s make that a 30 ton dry mass instead. One Poodle pushing 4000 dV would make the ship weigh 91 tons, with a TWR of 0.246. Two LV-Ns doing the same dV would make the ship weigh just 54 tons, with a TWR of 0.227. That\u0027s quite a massive difference, with nearly the same TWR.\u003C/p\u003E\u003Cp\u003EThe TL;DR is - the more your ship weighs, and the higher your dV requirement is, the more sense the LV-N makes. It\u0027s difficult to name an exact break-even point, since there\u0027s so many possible combinations of engines, masses and dV profiles. But if whatever you\u0027re trying to push weighs 20 tons without fuel and doesn\u0027t land, it\u0027s probably not the best idea to use chemical engines anymore.\u003C/p\u003E\n"},{"CreatedByName":"Inchoately","CreatedById":79771,"CreatedDateTime":"2014-07-21T11:36:34Z","Content":"\n\u003Cp\u003Ethanks for the detailed explanation. I\u0027m using 4 LV-N on my skycrane for transporting fuel/kerbals between my kerbin/mun space station. I always thought this engine was the most efficient but I never considered the weight difference. I only look at the TWR for my lifter.\u003C/p\u003E\n"},{"CreatedByName":"SDEngineer","CreatedById":101148,"CreatedDateTime":"2014-07-21T16:06:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Inchoately\u0022 data-cite=\u0022Inchoately\u0022\u003E\u003Cdiv\u003Ethanks for the detailed explanation. I\u0027m using 4 LV-N on my skycrane for transporting fuel/kerbals between my kerbin/mun space station. I always thought this engine was the most efficient but I never considered the weight difference. I only look at the TWR for my lifter.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt depends on what you are using it for. It IS the most efficient, even though it is quite heavy (and in .24, also very expensive). It is, in fact, a very good choice for the purpose you are using it for (a highly reusable refuelling craft).\u003C/p\u003E\u003Cp\u003EI won\u0027t put any LV-N\u0027s into orbit that I am not planning on re-using forever (i.e. wait until you have at least one space station) - after that, I use LV-Ns quite a bit. Of course, they form the core of any interplanetary expedition - the high ISP is just too good for that purpose, but I also use them as Mun/Minmus landers (really anywhere with light gravity and no atmosphere), asteroid tugs, rescue ships, and of course, fuel tankers.\u003C/p\u003E\n"},{"CreatedByName":"kizentheslayer","CreatedById":101754,"CreatedDateTime":"2014-07-21T17:06:05Z","Content":"\n\u003Cp\u003EThanks for the help. Im about to go rip that thing off right now\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-07-21T17:13:16Z","Content":"\n\u003Cp\u003EAre you leaving Kerbin\u0027s SOI? Then use a nuclear engine for efficiency.\u003C/p\u003E\u003Cp\u003EI also use them for hauling large amounts of fuel between Muns and LKO stations, and general orbital tug work because they\u0027re already up there and efficient anyway.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-21T17:21:57Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/45155-Mass-optimal-engine-type-vs-delta-V-payload-and-min-TWR\u0022 rel=\u0022external nofollow\u0022\u003ETavert\u0027s engine charts\u003C/a\u003E are a good place to start when deciding which engine to use. Find the chart that matches your desired TWR and find your desired dV and payload mass, it will give you the mass optimal engine.\n"},{"CreatedByName":"Halaberiel","CreatedById":115985,"CreatedDateTime":"2014-07-21T17:49:48Z","Content":"\n\u003Cp\u003ELV-N is decent if you want to do a lot of biome hopping on the Mun. Just make the craft fairly large \u0026amp; strap 3 LV-N to the outside. Not really needed for Minmus though, that moon requires a lot less d/v to hop around.\u003C/p\u003E\n"},{"CreatedByName":"SelectHalfling0","CreatedById":105051,"CreatedDateTime":"2014-07-21T21:38:40Z","Content":"\n\u003Cp\u003EInterplanetary travel with larger ships (manned missions, bases) are best done with the LV-N\u0027s (or so I think).\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-07-22T01:04:23Z","Content":"\n\u003Cp\u003ESomething you can do to get around the launch weight problem is to make a \u0022hot swappable\u0022 engine bay, with standard docking ports.\u003C/p\u003E\u003Cp\u003ESlap a docking port on the back of the ship, then another one docked to it. Stick the smallest same radius fuel tank on that, then attach the engine to that. I\u0027ve successfully swapped engines in orbit just by decoupling and using RCS to move around, but you can make it a LOT easier with a proper spacedock. Took me a few hours to build one with the robotics addon.\u003C/p\u003E\u003Cp\u003EFirst, the plane (or rocket) pulls up to the spacedock, which has a moving \u0022bed\u0022 with an electromagnet on a piston. The electromagnet grabs the plane, then moves it to the center of the spacedock, where it is rotated so the engines are facing into the spacedock and the nose is facing out.\u003C/p\u003E\u003Cp\u003ENext, an articulating arm removes the existing engine, moves it out of the way, then plucks the desired new engine from a rotating drum. It then sticks the new engine on, picks up the old one, and puts it in the now empty drum slot.\u003C/p\u003E\u003Cp\u003EFinally, the bed extends again, releases the plane, which can fly away with its spiffy new LV-N, having not bothered to carry one to orbit. By doing this, even my tiniest planes can reach pretty much any point in the solar system without much effort, though without another spacedock at your destination to swap off the LV-N again, you probably won\u0027t be able to actually fly around in the atmosphere (presuming you went to Laythe).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-22T01:06:38Z\u0022 title=\u002207/22/2014 01:06  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 22, 2014\u003C/time\u003E by LaytheAerospace\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-07-22T01:13:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LaytheAerospace\u0022 data-cite=\u0022LaytheAerospace\u0022\u003E\u003Cdiv\u003ESomething you can do to get around the launch weight problem is to make a \u0022hot swappable\u0022 engine bay, with standard docking ports.\u003Cp\u003ESlap a docking port on the back of the ship, then another one docked to it. Stick the smallest same radius fuel tank on that, then attach the engine to that. I\u0027ve successfully swapped engines in orbit just by decoupling and using RCS to move around, but you can make it a LOT easier with a proper spacedock. Took me a few hours to build one with the robotics addon.\u003C/p\u003E\u003Cp\u003EFirst, the plane (or rocket) pulls up to the spacedock, which has a moving \u0022bed\u0022 with an electromagnet on a piston. The electromagnet grabs the plane, then moves it to the center of the spacedock, where it is rotated so the engines are facing into the spacedock and the nose is facing out.\u003C/p\u003E\u003Cp\u003ENext, an articulating arm removes the existing engine, moves it out of the way, then plucks the desired new engine from a rotating drum. It then sticks the new engine on, picks up the old one, and puts it in the now empty drum slot.\u003C/p\u003E\u003Cp\u003EFinally, the bed extends again, releases the plane, which can fly away with its spiffy new LV-N, having not bothered to carry one to orbit. By doing this, even my tiniest planes can reach pretty much any point in the solar system without much effort, though without another spacedock at your destination to swap off the LV-N again, you probably won\u0027t be able to actually fly around in the atmosphere (presuming you went to Laythe).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s fascinating, have you got some pics you could share of this operation?\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-07-22T01:18:46Z","Content":"\n\u003Cp\u003ESure. I\u0027m at work now (yeah, I\u0027m bad), but will be home in an hour or so. After tending to the wife and dogs, I\u0027ll get some pictures up.\u003C/p\u003E\u003Cp\u003EIt\u0027s probably my favorite thing I\u0027ve ever built. Goes great with my Space Truck Mk-II, which has its own articulating arm with a \u0022winch cannon\u0022 on the end, and twin hot swap engines. Saw somebody on the forums mention using a probe core and RCS for a steerable winch, which sounds even better. Mk-III, here I come!\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-07-22T04:41:01Z","Content":"\n\u003Cp\u003EPosted a new thread so as not to hijack this one.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/87502-Spacedock-Proof-of-Concept-swap-engines-in-orbit-with-Infernal-Robotics?p=1292476#post1292476\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/87502-Spacedock-Proof-of-Concept-swap-engines-in-orbit-with-Infernal-Robotics?p=1292476#post1292476\u003C/a\u003E\u003C/p\u003E\n"}]}