{"TopicId":79006,"ForumId":16,"TopicTitle":"Grand Tour - most efficient itinerary?","CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-07-22T16:01:48Z","PageNum":1,"Articles":[{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-07-22T16:01:48Z","Content":"\n\u003Cp\u003ESo, I was thinking that it must be possible to plant a flag on every rock in the Kerbol system with a single launch from KSC. I imagine it\u0027s been done, but I couldn\u0027t find any challenges or mission reports during a cursory search. There are plenty of grand tours, but they don\u0027t all start with one launch, and they don\u0027t always visit the surface of every planet/moon.\u003C/p\u003E\u003Cp\u003EBut it got me thinking about the best order in which to visit everywhere. Eve would have to be the first stop, because the Eve ascent vehicle would be the biggest payload. But then there\u0027s a decision to make. Obviously Eve is the best place to access Moho, but the issue there is that you would have to carry everything all the way to Moho (including a lander set up for Tylo, which would be fairly large), slow it down, and then cart everything out to Jool (visiting Eeloo/Duna\u002BIke/Dres/Mun/Minmus on the way back when you\u0027ve ditched most of the mass).\u003C/p\u003E\u003Cp\u003EA different approach could be to leave most of your ship - including a heavy Tylo lander and something with jets for Laythe - at Eve, and tug a little multipurpose lander to Moho. But the delta v between Eve and Moho is not trivial, and you would have to make the inclination corrections both ways. But at least you have the aerobraking option when you get back to Eve. \u003C/p\u003E\u003Cp\u003EHow would people approach this? What is the most efficient route? Does anyone think it\u0027s not possible?!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-28T15:37:39Z\u0022 title=\u002207/28/2014 03:37  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 28, 2014\u003C/time\u003E by Oafman\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"metaphor","CreatedById":57640,"CreatedDateTime":"2014-07-22T18:27:26Z","Content":"\n\u003Cp\u003EI went first to Eve, and then from Eve to Jool to get rid of the heaviest parts. Afterwards it\u0027s not that hard to get to the other places, especially if you use gravity assists. I visited Mun and Minmus last when coming back to Kerbin.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/MIZvl\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-07-22T18:54:59Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/48461-Grand-tour-4-new-attempt-at-an-below-100-ton-grand-tour/page2\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/48461-Grand-tour-4-new-attempt-at-an-below-100-ton-grand-tour/page2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Ethis is an 100 ton from LKO tour. \u003C/p\u003E\u003Cp\u003EI used two steps to save weight, the Eve, Moho and Tylo landers did not have seats to save 40 kg, kerbal jetpac is a 500 m/s upper stage \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI used two other tricks, first is an Ion craft from Eve to Moho and back. \u003C/p\u003E\u003Cp\u003Esecond is that I split the ship in two and only one part visited Ike and Dress, the other part went directly to Laythe, then Val and finally Tylo, as second stage had more fuel left I sent it to Bop while I went to Pol first. \u003C/p\u003E\u003Cp\u003ENow you could take this further at put up depots and even landers at Duna and Jool. \u003C/p\u003E\u003Cp\u003EThe new ion engines also give some opportunities.\u003C/p\u003E\n"},{"CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-07-22T20:23:52Z","Content":"\n\u003Cp\u003EI made a \u003Ca href=\u0022https://www.lucidchart.com/publicSegments/view/53cec2f9-b50c-4148-87db-2ba40a0042a0/image.pdf\u0022 rel=\u0022external nofollow\u0022\u003Eflow chart\u003C/a\u003E to help me plan out an optimal flight plan for my Grand Tours of the Kerbol System (Delta V predictions included for each maneuver). Yeah, as you predicted the best planet to visit first is Eve as you get to dump your heavy Eve lander early on in the mission. Then, Moho because its easiest to get to, ect.\u003C/p\u003E\u003Cp\u003EAlso, if you are only planning on planting a flag on every planet in the Kerbol System, don\u0027t bother using jets on Laythe (Jets are heavy!) or designing specialized landers for any planet other than Eve. Its often a better idea to just have a \u0022universal\u0022 lander that can perform many landings.\u003C/p\u003E\u003Cp\u003EHere are my two Grand Tours for reference:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/81429-Sigma-Mission-Kerbol-System-Grand-Tour%21\u0022 rel=\u0022external nofollow\u0022\u003EThe Sigma Mission\u003C/a\u003E: 36 tons from LKO, planted a flag on every celestial body, used three landers in total (Eve lander, General Purpose Lander, Ion Powered Lander), one launch, no refueling\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/82724-The-Outer-Wilds-Mission-Jool-5-Challenge%28Jebediah-s-Level%29-Grand-Tour%21%28DONE%29\u0022 rel=\u0022external nofollow\u0022\u003EThe Outer Wilds Mission\u003C/a\u003E: 100 tons from LKO, planted a flag on every celestial body (and skimmed into Jool\u0027s lower atmosphere), brought science instruments and a MPL, gathered 42,981 science points, one launch, no refueling\u003C/p\u003E\u003Cp\u003EHope this helps!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-23T20:27:32Z\u0022 title=\u002207/23/2014 08:27  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 23, 2014\u003C/time\u003E by Stratzenblitz75\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"peter1981","CreatedById":23895,"CreatedDateTime":"2014-07-23T00:35:19Z","Content":"\n\u003Cp\u003EHi Oafman -- I think that a single launch grand tour is certainly possible but, are you planning a stock only attempt? \u003C/p\u003E\u003Cp\u003EIf so learn to love the ion and nuke engines.\u003C/p\u003E\u003Cp\u003EAre you limiting yourself to not using infingliders and kracken-drives?\u003C/p\u003E\u003Cp\u003EI\u0027d suggest not worrying about athetics, or science, or anything that adds mass: Use the command chair, then sit a kerbal in it, then land and finally a plant flag repeat for each rock and then return home.\u003C/p\u003E\u003Cp\u003EIf your going to use the kerbanauts jet pack as a 600m/s dV final stage you\u0027ll have to take a command pod so you can refuel as of 0.24 the monopropellant is not decreased on kerbanaught return; so it is a FREE 600m/s dV! This means you can use the jet pack to land and return to orbit on Gilly, Minmus, Ike, Bop, \u0026amp; Pol.\u003C/p\u003E\u003Cp\u003EYou can also return to Orbit with just the jet pack from Mun, Dres, \u0026amp; (Eeloo maybe?)\u003C/p\u003E\u003Cp\u003ELaythe use the rapier make a space plane ~3200m/s dV each way ideally a plane that can land and take off on water.\u003C/p\u003E\u003Cp\u003EMoho ~900m/s dV each way so ~1800m/s dV same as Vall so maybe a refuel?\u003C/p\u003E\u003Cp\u003EEve\u0027s highest point is 7540m high, found near (25Ã‚Â° S, 158.5Ã‚Â° W) and requires ~8,000m/s dV to reach LEvO (95km) (Maximum dV 12000m/s dV)\u003C/p\u003E\u003Cp\u003EDuna highest point is 8264m high to reach LDuO (42km) require ~1500-2000m/s dV including some for landing I\u0027m assuming low numbers of paracutes =\u0026gt; lean \u0026amp; mean duna lander. Min dV required to reach LDuO from sea level (0m) is 1300m/s dV but you\u0027ll need something for the landing the nuclear rocket engine is great in Duna\u0027s rarified atmosphere.\u003C/p\u003E\u003Cp\u003EVall ~900m/s dV each way so ~1800m/s dV (see Moho above.)\u003C/p\u003E\u003Cp\u003ETylo has peaks of more than 11290 meters but 0.8g at the surface you\u0027ll need a dedicated lander for this but finding a high peak could save alot of propellant and therefore weight. ~2300m/s dV each way so ~4600m/s dV\u003C/p\u003E\u003Cp\u003EEeloo highest points are near the equator and are almost 3.9km high with a gravity similar to the Mun (0.172g vs. 0.166g) it may be possible to jetpack most of the way to LEeO (~620m/s dV)\u003C/p\u003E\u003Cp\u003EI\u0027d suggest you look at this map \u003Ca href=\u0022http://i.imgur.com/NKZhU57.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/NKZhU57.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E -\u0026gt; Recieved wisdom is to start with the highest gravity bodies and work backwards.\u003C/p\u003E\u003Cp\u003EGood Luck.\u003C/p\u003E\u003Cp\u003EEDIT: I think a nuclear powerd interplanetary stage with an Ion powered comand pod shuttle to take down to Low orbit for the planets where your using just the jetpack. For the others, Moho \u0026amp; Vall, Eve, Duna, Laythe, and Tylo; I think you\u0027ll get away with refueling the Moho lander and using it on Duna \u0026amp; Vall; a SSTO rapier spaceplane for Laythe, A huge Eve lander and If you can make the upperstage of that reusable as a Tylo lander then just need to plan the route you\u0027ll take.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-23T00:47:01Z\u0022 title=\u002207/23/2014 12:47  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 23, 2014\u003C/time\u003E by peter1981\u003C/strong\u003E\n\u003Cbr\u003EEDIT: more ideas\n\u003C/span\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-07-28T16:09:19Z","Content":"\n\u003Cp\u003EThere are some seriously clever solutions on these tours. I\u0027m in awe at the efficiency of some of these; 36t from LKO?! My Eve ascent vehicles alone tend to mass twice that! Great to see kerbals clinging onto ladders on descents - a very kerbal solution!\u003C/p\u003E\u003Cp\u003EIt makes me realise just how bad I am at minimising mass. I\u0027m often guilty of just adding more and more rockets, which of course compounds itself into stupidly inefficient ships. This needs to change, so when I finally get around to having a go at a grand tour, I\u0027ll try to build as small as I can. I imagine I\u0027ll be sending out a lot more than 36t from Kerbin , but I\u0027ll do my best. \u003C/p\u003E\u003Cp\u003EThank you all for the examples of successful tours, and for your advice and resources.\u003C/p\u003E\n"}]}