{"TopicId":79551,"ForumId":16,"TopicTitle":"Equally space 4 satellites in KEO","CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2014-07-26T00:08:30Z","PageNum":1,"Articles":[{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2014-07-26T00:08:30Z","Content":"\n\u003Cp\u003EHey guys, can someone explain to me the concept of how to get 4 satellites equally spaced in KEO? So the rotational period of Kerbin is 6hours (and 1 second). And means if I want 4 there to be, they need to have a spacing of 1h30m between each other. But how can I accomplish such feat of precise timing? Currently I am launching all 4 of them from a single launcher which travels at an elliptic orbit that intersects the KEO height, at which point the satellite is deployed and uses its own thrust to correct the PE to the correct height. But the launcher has a minimal orbital period of about 2.5 hours. Any less and the PE will dip into the atmosphere . So that\u0027s a spacing of 2.5 hours for each satellite where I need a spacing of 1.5hrs. How should I do this? Should I drop down a satellite into lower orbit and wait for it to speed up and reduce the spacing amount and then correct itself again to KEO? Or is there a more simpler method?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-07-26T16:33:37Z\u0022 title=\u002207/26/2014 04:33  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 26, 2014\u003C/time\u003E by guitarxe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-07-26T00:11:10Z","Content":"\n\u003Cp\u003ECan you put the launcher in an orbit with a 4 1/2 hour period?\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-07-26T00:16:32Z","Content":"\n\u003Cp\u003EStep 1: Put the launcher into a circular KEO orbit. (6h)\u003C/p\u003E\u003Cp\u003EStep 2: Decouple one of the satellites. No engine burn is needed; it\u0027s in its final orbit.\u003C/p\u003E\u003Cp\u003EStep 3: Change the orbit of the launcher (with its three remaining satellites) to have an orbital period of 4.5h.\u003C/p\u003E\u003Cp\u003EStep 4: Once you go around and reach apoapsis again, push your periapsis up so your orbital period is once again 6h.\u003C/p\u003E\u003Cp\u003EStep 5: Repeat steps 2-4 until all four satellites are deployed correctly.\u003C/p\u003E\u003Cp\u003EThat\u0027s all there is to it.\u003C/p\u003E\n"},{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2014-07-26T00:49:30Z","Content":"\n\u003Cp\u003EOh! I feel silly now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E Any way to ensure that I will be more or less above the KSC when I reach my AP?\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-07-26T00:53:51Z","Content":"\n\u003Cp\u003EOnce you\u0027re in an LKO parking orbit, make your Keostationary insertion burn directly opposite KSC.\u003C/p\u003E\u003Cp\u003EAlso note that as of version 0.24, Kerbin\u0027s rotational period was changed. It\u0027s now 5 h 59 m 9.4 s, so you\u0027ll need the KEO period to be this number, not 6 hours.\u003C/p\u003E\n"},{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2014-07-26T01:00:51Z","Content":"\n\u003Cp\u003EHm, well that\u0027s what I thought and when I tried that I ended up with the KSC overshooting me. I guess the real question is actually how do I more accurately eyeball when I am directly opposite the KSC \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-07-26T01:15:12Z","Content":"\n\u003Cp\u003EActually, thinking about it, you want to do the periapsis burn slightly before directly opposite, so the apoapsis is slightly before the KSC. That way, when you do the apoapsis burn, you should get fairly close. How far will depend on the TWR of your ship.\u003C/p\u003E\u003Cp\u003EAnother alternative is to get into an orbit with a period slightly more (if KSC is behind) or less (if ahead) and wait a few orbits until you\u0027re close enough for your liking. Then adjust the period to equal the sidereal day.\u003C/p\u003E\u003Cp\u003EAs for eyeballing it, you can plant a flag at KSC to enable you to locate it easily in map mode, which might help.\u003C/p\u003E\u003Cp\u003EAlternatively, you can use an informational mod (I like KER; others are available) and go off the longitude readout.\u003C/p\u003E\n"},{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2014-07-26T02:22:08Z","Content":"\n\u003Cp\u003EYay, it worked! I got all four of them into nearly perfect KEO. Then my game crashed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E And so for the next try I think I might try sending up individual satellites one by one. Is the timing on that easier or harder?\u003C/p\u003E\n"},{"CreatedByName":"Mitchz95","CreatedById":82292,"CreatedDateTime":"2014-07-26T02:29:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022guitarxe\u0022 data-cite=\u0022guitarxe\u0022\u003E\u003Cdiv\u003EYay, it worked! I got all four of them into nearly perfect KEO. Then my game crashed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E And so for the next try I think I might try sending up individual satellites one by one. Is the timing on that easier or harder?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would guess much harder. You\u0027d have to eyeball it, so it\u0027s very likely the satellites will not be perfectly spaced out.\u003C/p\u003E\n"},{"CreatedByName":"Redjoker","CreatedById":68444,"CreatedDateTime":"2014-07-26T02:30:37Z","Content":"\n\u003Cp\u003EIf you want to be able to follow the same method but launch separately, you would simply launch the first sat. The second sat you would launch to rendezvous, then adjust your orbital period and wait one orbit. For the third and fourt your would do the same but wait two and three orbits respectively.\u003C/p\u003E\n"},{"CreatedByName":"guitarxe","CreatedById":115354,"CreatedDateTime":"2014-07-26T16:33:24Z","Content":"\n\u003Cp\u003EThanks for all the help \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}