{"TopicId":80296,"ForumId":16,"TopicTitle":"Science and probe cores","CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-07-31T19:26:11Z","PageNum":1,"Articles":[{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-07-31T19:26:11Z","Content":"\n\u003Cp\u003ECan a Kerbal extract science from a probe core like he can from a manned capsule?\u003C/p\u003E\u003Cp\u003EOne more \u0022bonus question\u0022 - Pound-for-pound, what is the most efficent power source (I\u0027m looking to power a double ion drive)\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2014-07-31T19:31:26Z","Content":"\n\u003Cp\u003EOn the first, yes ( I assume you mean the experiments parts in a probe, not the core itself, though )\u003C/p\u003E\u003Cp\u003EOn the bonus: It depends of your distance to Sol. I haven\u0027t made the math, but I find that from Jool up it is far better to use RTGs ... and OFC, most of the power parts are actually physicsless ( so they don\u0027t actually have mass in game ).\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-07-31T19:37:58Z","Content":"\n\u003Cp\u003ESorry, I just didn\u0027t realize that no experiment on an unmanned probe would go to the core.\u003C/p\u003E\u003Cp\u003EYou read my mind - my plan is a double-ion-engine Bop/Pol lander. Gigantors are a bit too big. Well, actually, how many tons can two ion engines lift from Bop (the larger of the 2 if I remember correctly.) By the way, I\u0027m definitely bringing at least one RTG to avoid running out of juice. My plan is to make a robo-probe that is capable of carrying a Kerbal.\u003C/p\u003E\u003Cp\u003EBonus question 2 - Can a Kerbal store surface samples and EVA reports in a probe core? What about a command seat?\u003C/p\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2014-07-31T20:08:02Z","Content":"\n\u003Cp\u003EPound for pound, OX-STAT wins until you hit the 0 power point due to that PhysicsSignificance flag. But since that is at almost 3x Jool\u0027s semi-major axis, you\u0027re unlikely to hit that. Even without that flag, OX-STAT \u0026gt; OX-4A/B \u0026gt; Gigantor \u0026gt; RTG. This holds past Eeloo\u0027s apoapsis. (In stock, were you get 50% power at Jool instead of 4%)\u003C/p\u003E\n"},{"CreatedByName":"r_rolo1","CreatedById":26192,"CreatedDateTime":"2014-07-31T20:17:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022UmbralRaptor\u0022 data-cite=\u0022UmbralRaptor\u0022\u003E\u003Cdiv\u003EPound for pound, OX-STAT wins until you hit the 0 power point due to that PhysicsSignificance flag. But since that is at almost 3x Jool\u0027s semi-major axis, you\u0027re unlikely to hit that. Even without that flag, OX-STAT \u0026gt; OX-4A/B \u0026gt; Gigantor \u0026gt; RTG. This holds past Eeloo\u0027s apoapsis. (In stock, were you get 50% power at Jool instead of 4%)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETrue, but I do find that in Jool mini-system, you get a lot of eclipses ( because Jool is big \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E and because the angular size of Sol from there is so little ), so the panels are not as reliable as we would like...\u003C/p\u003E\u003Cp\u003EOn Bonus question 2 : AFAIK you can only store sci experiments in kerbals ( \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E ), capsules and sci labs ...\u003C/p\u003E\n"},{"CreatedByName":"GigaG","CreatedById":8013,"CreatedDateTime":"2014-07-31T20:34:56Z","Content":"\n\u003Cp\u003ECrap.\u003C/p\u003E\u003Cp\u003EI figured to break even I need... wait for it... TWENTY-FOUR RTGs to maintain an indefinite burn with 2 ion engines. Seriously... \u003C/p\u003E\u003Cp\u003EHow many tons can 2 ion engines lift from Bop? Considering the fact that this is a 100,000 kerbollar mini-lander, I plan to use the same lander for both Pol and Bop and carry extra xenon aboard the mother ship.\u003C/p\u003E\u003Cp\u003EHere is a component list if you need it. It\u0027s a pretty big lander, but Pol and Pop and pretty small moons...\u003C/p\u003E\u003Cp\u003E2 \u0022big\u0022 xenon tanks\u003C/p\u003E\u003Cp\u003E2 radial xenon tanks\u003C/p\u003E\u003Cp\u003E1 Okto-2 core\u003C/p\u003E\u003Cp\u003E1 Communotron 16\u003C/p\u003E\u003Cp\u003E8 small battery packs (100 charge per pack)\u003C/p\u003E\u003Cp\u003E10 cubic octagonal struts\u003C/p\u003E\u003Cp\u003E2 ion engines\u003C/p\u003E\u003Cp\u003E2 command seats\u003C/p\u003E\u003Cp\u003E1 Science Jr. (they look heavier than they are, honestly)\u003C/p\u003E\u003Cp\u003E2 Mystery goo\u003C/p\u003E\u003Cp\u003E24 RTGs (I want to be able to indefinitely burn, only limited by my xenon stores.\u003C/p\u003E\n"}]}