{"TopicId":80785,"ForumId":16,"TopicTitle":"Editing the Persistent and \u0026quot;Missing\u0026quot; Kerbals","CreatedByName":"meatballcannon","CreatedById":57514,"CreatedDateTime":"2014-08-05T07:35:19Z","PageNum":1,"Articles":[{"CreatedByName":"meatballcannon","CreatedById":57514,"CreatedDateTime":"2014-08-05T07:35:19Z","Content":"\n\u003Cp\u003ESo Callan Kerman was exploring the Mun, and he took a bit of a tumble. So there he was, sliding down a hill, I\u0027m waiting for him to stop, and when he finally does... The game breaks. It wasn\u0027t really, a crash, but the screen went black, all flight related guis went blank, but I could still use the menu. However, I couldn\u0027t fix it, so I restarted ksp.\u003C/p\u003E\u003Cp\u003ESo now my lander\u0027s empty, Callan is gone, I have no way to get the science back, and I\u0027m pretty annoyed since this mission was needlessly complex and I did a lot of things I don\u0027t want to redo.\u003C/p\u003E\u003Cp\u003EIn the ROSTER section of the persistent, Callan is labeled as \u0022Missing\u0022. I figured to fix it, I\u0027d set him to \u0022Assigned\u0022 and change my lander\u0027s command pod\u0027s code to have \u0022crew = Callan Kerman\u0022 I gleaned the idea from looking at other vessels in the file.\u003C/p\u003E\u003Cp\u003EHowever, when I go to the tracking center, I can\u0027t fly or terminate the lander, I and once I\u0027ve clocked on it, I can\u0027t do anything to the other vessels either.\u003C/p\u003E\u003Cp\u003EIt seems the game is unhappy with that added line. Does anybody know something else I have to do?\u003C/p\u003E\u003Cp\u003EEDIT: changed the Part\u0027s command module\u0027s line to say \u0022controlSrcStatusText = Operational\u0022. Didn\u0027t fix it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-05T07:46:48Z\u0022 title=\u002208/05/2014 07:46  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 5, 2014\u003C/time\u003E by meatballcannon\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"meatballcannon","CreatedById":57514,"CreatedDateTime":"2014-08-05T08:06:40Z","Content":"\n\u003Cp\u003EI got it to work. Kerbals in ROSTER have two values, \u0022Tod\u0022 and \u0022idx\u0022. I don\u0027t know what they do but most live, happy kerbals seem to have both set to zero. I did that, and had my friend back from limbo.\u003C/p\u003E\n"},{"CreatedByName":"Tw1","CreatedById":59717,"CreatedDateTime":"2014-08-05T08:45:43Z","Content":"\n\u003Cp\u003ETod is time of death. I believe that one\u0027s involved in determining how long it is until the Kerbal respawns on their own. \u003C/p\u003E\u003Cp\u003EIdx tells the game which seat position a Kerbal is in, or if they are on Eva, dead or in the roster. \u003C/p\u003E\u003Cp\u003EWhich crew member is in the pod is determine by a line like this:\u003C/p\u003E\u003Cp\u003ECrew = X,\u003C/p\u003E\u003Cp\u003EWhere X equals the position they have in the crew list. Note that this list starts at 0.\u003C/p\u003E\u003Cp\u003ECrew = 0 would give Jebediah.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-05T08:47:49Z\u0022 title=\u002208/05/2014 08:47  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 5, 2014\u003C/time\u003E by Tw1\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-08-05T09:02:52Z","Content":"\n\u003Cp\u003EThis sort of problem, incidentally, is why I still quicksave even in my Ironman games. No handwaving is going to explain how a \u0022mechanical malfunction\u0022 could cause one of my Kerbals to suddenly be landed on Sun or something. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"LaytheAerospace","CreatedById":108355,"CreatedDateTime":"2014-08-05T09:13:37Z","Content":"\n\u003Cp\u003EIn case anyone is wondering, idx is short for \u0022index\u0022, and is a common variable name in most programming languages.\u003C/p\u003E\n"},{"CreatedByName":"meatballcannon","CreatedById":57514,"CreatedDateTime":"2014-08-05T20:19:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LaytheAerospace\u0022 data-cite=\u0022LaytheAerospace\u0022\u003E\u003Cdiv\u003EIn case anyone is wondering, idx is short for \u0022index\u0022, and is a common variable name in most programming languages.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I don\u0027t have to use it much though, (I do Java and FORTH, of all things). Any idea what it means in this context? I\u0027m kind of curious.\u003C/p\u003E\n"}]}