{"TopicId":81002,"ForumId":16,"TopicTitle":"Multiple copies of steam bought/downloaded client?","CreatedByName":"Ruthgar","CreatedById":113799,"CreatedDateTime":"2014-08-07T01:27:48Z","PageNum":1,"Articles":[{"CreatedByName":"Ruthgar","CreatedById":113799,"CreatedDateTime":"2014-08-07T01:27:48Z","Content":"\n\u003Cp\u003EI bought my copy of KSP through steam, and I am thinking of adding a few of the gameplay altering mods such as \u0022Better than Starting Manned\u0022 and \u0022TacLifeSupport\u0022. However, I would like to do this using a separate copy of KSP that way I can keep my current saves usable (until some future patch potentially ruins them by accident \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E ). What I am wondering, is it possible to make a separate copy of the steam downloaded client that is usable without affecting my main copy of KSP?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-07T01:42:23Z\u0022 title=\u002208/07/2014 01:42  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 7, 2014\u003C/time\u003E by Ruthgar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"rabidninjawombat","CreatedById":108889,"CreatedDateTime":"2014-08-07T01:32:47Z","Content":"\n\u003Cp\u003EYup, basicly just copy and paste the entire folder into another location and your all set. (The only drawback is steam wont track hours played when playing the alternate installs)\u003C/p\u003E\n"},{"CreatedByName":"Ruthgar","CreatedById":113799,"CreatedDateTime":"2014-08-07T01:41:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022rabidninjawombat\u0022 data-cite=\u0022rabidninjawombat\u0022\u003E\u003Cdiv\u003EYup, basicly just copy and paste the entire folder into another location and your all set. (The only drawback is steam wont track hours played when playing the alternate installs)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for answering so soon, I don\u0027t really mind if it doesn\u0027t track the copied folder, as I will still be playing the normal gameplay version (I call it normal as the basic gameplay is still the same even if I do have mods added that are just add-ons to the game). My currently used mods are just feature/information adding ones such as \u0022ScienceAlert\u0022 \u0022Kerbal Engineer\u0022 \u0022Mechjeb (Mostly just use the node engagement function of this as I like to plan my nodes myself). I was more concerned about using the ones that radically alter the basic structure of the game such as the \u0022Better than Starting Manned\u0022 mod as I know they would potentially severely damage/break my current saves.\u003C/p\u003E\n"},{"CreatedByName":"Mister Spock","CreatedById":116542,"CreatedDateTime":"2014-08-07T01:48:48Z","Content":"\n\u003Cp\u003EGlad you asked, because I have Steam, and I\u0027m also planning to start a game with \u0022Better than Starting Manned.\u0022 Plus I want to make an install with dozens of mods installed. \u003C/p\u003E\u003Cp\u003EI assume the folder we copy over is ... steam/steamapps/common/Kerbal Space Program.\u003C/p\u003E\n"},{"CreatedByName":"robopilot99","CreatedById":102126,"CreatedDateTime":"2014-08-07T01:56:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mister Spock\u0022 data-cite=\u0022Mister Spock\u0022\u003E\u003Cdiv\u003EGlad you asked, because I have Steam, and I\u0027m also planning to start a game with \u0022Better than Starting Manned.\u0022 Plus I want to make an install with dozens of mods installed. \u003Cp\u003EI assume the folder we copy over is ... steam/steamapps/common/Kerbal Space Program.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep that\u0027s it. KSP will run completely normal.\u003C/p\u003E\n"}]}