{"TopicId":81381,"ForumId":16,"TopicTitle":"How would you get this whackovian sized engine core into orbit.","CreatedByName":"fcdrifter13","CreatedById":79366,"CreatedDateTime":"2014-08-11T03:43:37Z","PageNum":1,"Articles":[{"CreatedByName":"fcdrifter13","CreatedById":79366,"CreatedDateTime":"2014-08-11T03:43:37Z","Content":"\n\u003Cp\u003EI am working on my interplanetary ship to cruise around the system in and i have hit a snag. I wanted to build the ship in sections, a command/science section, a living section, and a propulsion section. Everything is all well and good with the former two. But i am having difficulties with the latter. It is simply too big and too fragile in gravity for me to understand how to lift it. I have put larger things into orbit but they were mainly fueling cores that i could strap a ton of boosters on and call it a day. So I am looking for a lil help. The mods used are FAR, deadly reentry, interstellar mod, infernal robotics and all the supporting mods for that. The unit as a whole weighs in at 1200tons without its RCS retro fitting pods that will be docked in space. Part count is 921. Does anyone have any suggestions on how to go about this?\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/j2i9H\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-08-11T03:51:43Z","Content":"\n\u003Cp\u003EIt\u0027s the stock planet, add some long-burning boosters to get the TWR above 1.0 and launch it. Refuel in orbit. Can\u0027t be that hard, you only need some 3.5km/s to get it to orbit; that\u0027s chump change.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-08-11T04:03:19Z","Content":"\n\u003Cp\u003EWhat exactly is going wrong? Failure to lift, loss of control, breaking up in flight?\u003C/p\u003E\n"},{"CreatedByName":"merendel","CreatedById":97774,"CreatedDateTime":"2014-08-11T08:05:53Z","Content":"\n\u003Cp\u003EI\u0027m trying to fathom what that drive pod is soposed to do. You\u0027ve got a cluster of chemical rockets pointed down(those the methane ones?) some plasmadrives also pointed down attached to fission reactors and I think those are thermal rockets pointed up on the fusion reactors. Is it soposed to unfold once in space or something to point the drives in the same direction? Personaly I wouldnt lug that many fisions along on a ship of any size. I might bring one as a tritium breeder but if I had fusion avalible I\u0027d have main power and primary thrust made with them.\u003C/p\u003E\u003Cp\u003EHonestly if I had to launch something that massive with KSPI I\u0027d probably deploy a huge beamed fusion transmiting station on the runway. get some relays into orbit and send it up on beamed power suplimented by the onboard reactors. You might need to use the attilla thrusters instead of plasmas to lift that much weight unless you want to use argon or xenon as your propellent. Alternatively you can get crazy amounts of thrust off beamed power and a thermal receiver with the right fuel mix. you might consider a rather huge cluster of solid boosters if you can find a way to attach them to get off the ground if you went with a thermal rocket as their thrust is a bit low the first 2km or so. Then agian throw enough power at it and it wouldnt mater anyway.\u003C/p\u003E\u003Cp\u003EAnd you did mention the thing is too fragile in gravity. I can only offer 2 suggestions there. First the logical one would be streamline that baby, it looks like a swiss army engien thats designed to use 20 different fuel sorces and drive styles. It also looks like its designed to reverse without actualy turning around. I\u0027d say trim it down to just the plasma\u0027s with maybe a thermal or two thrown in on the fusion for higher thrust situations and reduce the number of fissions to the minimum needed to maintain tritium stocks. The second option is a more kerbalish solution. This is fitting because its the second most iconic solution behind the mor boosters solution to any problem... More Struts.\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-08-11T08:13:09Z","Content":"\n\u003Cp\u003ESince you install so many mod. Why not \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59545-Extraplanetary-Launchpads-v3-4\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/59545-Extraplanetary-Launchpads-v3-4\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EConstruct your craft at orbit. Logical, and realistic.\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-08-11T11:11:56Z","Content":"\n\u003Cp\u003EI reckon you should check out this\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/oy-boob8xtc?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E. Great advice for lifting big heavy and hard to secure payloads.\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-11T11:23:50Z","Content":"\n\u003Cp\u003EHow much does it weigh empty? That might help.\u003C/p\u003E\n"},{"CreatedByName":"Taki117","CreatedById":89975,"CreatedDateTime":"2014-08-11T12:12:32Z","Content":"\n\u003Cp\u003EIf your using fission and plasma thrusters you\u0027re gonna have a bad time. The fission reactors don\u0027t produce enough thermal power to make the generators produce enough electrical power fast enough for the plasmas.\u003C/p\u003E\n"},{"CreatedByName":"weeble","CreatedById":117348,"CreatedDateTime":"2014-08-15T06:24:11Z","Content":"\n\u003Cp\u003EIf you\u0027re using FAR you might want to try to make it aerodynamic as that thing is full of flat surfaces. That looks like a headache and a half to launch w/ FAR. You\u0027d be better off building it using Extraplanetary Launchpads in LKO or Minmus orbit\u003C/p\u003E\n"}]}