{"TopicId":81545,"ForumId":16,"TopicTitle":"Aerobraking from 7Km/s to 5Km/s?","CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-08-12T21:04:44Z","PageNum":1,"Articles":[{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-08-12T21:04:44Z","Content":"\n\u003Cp\u003EI have BTSM mod installed (which includes Deadly Reentry), and I need to fly to Gilly back and forth quickly (to be within limits of life support and also of delta-v). So make a fast transfer to Eve, in 17 days, and consequently when I enter Eve SOI, velocity relative to Eve is already 5080 m/s. As I calculated, it\u0027s about \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003E13 km/s\u003C/span\u003E 7 km/s at periapsis. KSP aerocalc suggests aerobraking at 55 km.\u003C/p\u003E\u003Cp\u003EI have the biggest heat shield, which if left alone heats up quickly and explodes, exposing the rest of the ship to heat. Then I tried another 2 sacrifice heat shields, but they exploded quickly too and left the main one to still explode.\u003C/p\u003E\u003Cp\u003EI tried doing less deep reentry, and although it saved the ship, it still escaped SOI, flying 3 km/s faster than needed.\u003C/p\u003E\u003Cp\u003EQuestion: how many heat shields you need to aerobrake this much?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-16T21:37:35Z\u0022 title=\u002208/16/2014 09:37  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 16, 2014\u003C/time\u003E by Kulebron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dkmdlb","CreatedById":70275,"CreatedDateTime":"2014-08-12T21:43:31Z","Content":"\n\u003Cp\u003EI would suggest bringing more life support. Getting to Gilly \u003Cem\u003Equickly\u003C/em\u003E isn\u0027t saving you any delta-v. If you are transferring to Eve in 17 days, I would instead recommend leaving some fuel behind and bringing more life support. It will take longer to do a low-energy transfer, but it will also take less delta-v.\u003C/p\u003E\u003Cp\u003EIn addition, spamming heat shields is probably a sign that something is wrong. If you take the slower, lower delta-v transfer, your velocity won\u0027t be so high and you should be fine with one heat shield.\u003C/p\u003E\n"},{"CreatedByName":"1of6Billion","CreatedById":46191,"CreatedDateTime":"2014-08-13T07:53:07Z","Content":"\n\u003Cp\u003EI don\u0027t have Deadly re-entry, so forgive me if I talk nonsense here.\u003C/p\u003E\u003Cp\u003ECan\u0027t you areobrake in 2 or even more sessions? So, dive in deep enough to get your apoapsis just inside Eve\u0027s SOI. Use next pass to lower it etc.\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2014-08-13T08:23:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00221of6Billion\u0022 data-cite=\u00221of6Billion\u0022\u003E\u003Cdiv\u003EI don\u0027t have Deadly re-entry, so forgive me if I talk nonsense here.\u003Cp\u003ECan\u0027t you areobrake in 2 or even more sessions? So, dive in deep enough to get your apoapsis just inside Eve\u0027s SOI. Use next pass to lower it etc.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI believe it is the life support that killing his crew. He only having 1 chance. I presume.\u003C/p\u003E\n"},{"CreatedByName":"StuntMax","CreatedById":109305,"CreatedDateTime":"2014-08-13T09:59:23Z","Content":"\n\u003Cp\u003EMy call with BTSM is: a fair load of life support canisters, an insanely large solar array (my first duna mission had like 40 panels - \u003Cem\u003Emelius abundare quam deficiere\u003C/em\u003E ), and take all the time it needs to. \u003C/p\u003E\u003Cp\u003EAnd carry no unneeded kerbals... one for the mothership and one for the lander, the third seat on the capsule is good to store one more bag of snacks. these guys eat life support like sharks.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-13T10:27:21Z","Content":"\n\u003Cp\u003EEngine nozzles have fair resistance to reentry heat. If you build your ship shielded from the back, you can use your engine as part of the shield and you can even burn during the reentry to slow you down further.\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-08-13T11:10:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003EQuestion: how many heat shields you need to aerobrake this much?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDepends on the heatshield in question. However, bleeding off 6 km/s in Eve\u0027s atmosphere is Not Going To Happen with expendable heatshields - capitalized for emphasis. BTSM further tweaks Deadly Reentry\u0027s settings to be more aggressive, and thus, Eve\u0027s atmosphere is more akin to a spaceship eating shark than a pillow to fall into. Example: After it finished all of its duties, I put an unshielded probe into a 91x91km orbit and then lowered the periapsis to 86km for a super gentle deorbit brake, engine first of course. It did not live to reach 60km.\u003C/p\u003E\u003Cp\u003EMind you, the 6.25m heatshield (yes, that\u0027s six meters) at the end of the tech tree isn\u0027t expendable (has no ablative shielding resource). It should survive almost any aerobraking load, repeatedly, without failing. Of course, by that point the integrity of your spaceship becomes irrelevant, because the g-forces during aerobraking reduce your Kerbals to a thin film of green goo on the floor of their capsule. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Lukaszenko","CreatedById":95776,"CreatedDateTime":"2014-08-13T11:44:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00221of6Billion\u0022 data-cite=\u00221of6Billion\u0022\u003E\u003Cdiv\u003EI don\u0027t have Deadly re-entry, so forgive me if I talk nonsense here.\u003Cp\u003ECan\u0027t you areobrake in 2 or even more sessions? So, \u003Cstrong\u003Edive in deep enough to get your apoapsis just inside Eve\u0027s SOI\u003C/strong\u003E. Use next pass to lower it etc.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is the part that OP is having problems with. I had the same problem as well. When going 5 km/s, diving deep enough not to fly out of the SOI WILL destroy your heat shield. \u003C/p\u003E\u003Cp\u003EOne solution I found was using the inflatable heat shield, as it seems indestructible (although feels cheaty). But even then, it becomes a fine balance between going deep enough and not getting destroyed by the g-forces. \u003Cstrong\u003EStreetwind\u003C/strong\u003E, is that the 6.25 m shield you were talking about?\u003C/p\u003E\u003Cp\u003EI also don\u0027t know, but in real life do they rely only on aerocapture when going into orbit around other planets, or do they combine it with firing the engines? Seems like a highly risky and variable maneuver to pull off with only the air. I understand that when lowering an orbit using aerobraking, they make many many passes over a span of months.\u003C/p\u003E\u003Cp\u003EEDIT: According to Wikipedia, an aerocapture has never been performed in real life. So if it seems difficult in KSP, now you know why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-13T11:50:40Z\u0022 title=\u002208/13/2014 11:50  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 13, 2014\u003C/time\u003E by Lukaszenko\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-13T11:53:19Z","Content":"\n\u003Cp\u003ETry beeing less deep in the atmosphere, and also burning retrograde?\u003C/p\u003E\n"},{"CreatedByName":"Streetwind","CreatedById":98962,"CreatedDateTime":"2014-08-13T11:58:18Z","Content":"\n\u003Cp\u003EYes, that is the one I meant. Mind you, I\u0027ve never tried slamming myself into Eve at 13 km/s to test how sturdy it is, but if I have even the slightest clue about how Deadly Reentry works, then that should be your best bet.\u003C/p\u003E\u003Cp\u003EAs far as real life goes - aerobraking is used very carefully and very sparingly, generally to lower an existing orbit. In the first place, RL spacecraft don\u0027t travel fast enough to really need more than a small burn to capture into orbit, due to the huge amount of dV required to do an accelerated transfer, which drives up the cost of the spacecraft. As such, a Mars probe for example can propulsively capture into a highly elliptical orbit and then use aerobraking over many days to slowly lower its apoapsis to where it needs to be. However, even then it sometimes is not sensible to aerobrake, because the craft may be too fragile, or because the maneuver requires constant human attention - and that means buying a lot of expensive signal time on the DSN. Not to mention having your ground crew at its stations for a pass every couple hours for days on end.\u003C/p\u003E\n"},{"CreatedByName":"Godot","CreatedById":16902,"CreatedDateTime":"2014-08-13T13:17:10Z","Content":"\n\u003Cp\u003EIf you use a crewed vehicle it sounds to me you have a problem no matter what you do ... aerobraking at a too high speed will kill your crew nevertheless, as they are exposed to too high G-Forces\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-13T14:50:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00221of6Billion\u0022 data-cite=\u00221of6Billion\u0022\u003E\u003Cdiv\u003EI don\u0027t have Deadly re-entry, so forgive me if I talk nonsense here.\u003Cp\u003ECan\u0027t you areobrake in 2 or even more sessions? So, dive in deep enough to get your apoapsis just inside Eve\u0027s SOI. Use next pass to lower it etc.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003ECapturing into highly elliptical Eve orbit will require around 1300 m/s less than capturing into low orbit, but when you\u0027re coming in from an \u0022express\u0022 transfer you need to shed a lot of speed either way.\u003Cp\u003EFor the OP, if you\u0027re throwing enough delta-V at the problem to make a 17 day transfer, you may as well throw more to do a power-assisted capture, burning hard retrograde just before entering the atmosphere.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-08-13T16:39:13Z","Content":"\n\u003Cp\u003ETo answer why I tried to do a fast transfer, there\u0027s a relatively small return transfer window, so I planned an early departure, and about 3-5 days for stay (mostly maneuvering to get to Gilly). It was also a convenient travel with _just_ 3 orange tanks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Total DV required was about 1700 \u002B 1700, and about 1000 to get to Gilly orbit. If someone shows me a better transfer combo, will be very grateful.\u003C/p\u003E\u003Cp\u003EI did think BTSM use stock DR settings. What a mistake!\u003C/p\u003E\u003Cp\u003Ethis is the first version, with the heatshield in question. I added another 2 smaller heatshields after this. I guess I\u0027ll need that inflatable one.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://dl.dropboxusercontent.com/u/6721960/2014/08-09-ksp/screenshot4.jpeg\u0022 alt=\u0022screenshot4.jpeg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-08-13T16:53:52Z","Content":"\n\u003Cp\u003EYou are better off spending mass on more life support \u002B recyclers, and less on heatshields.\u003C/p\u003E\u003Cp\u003EAfter a lot of fiddling around, i realised that an engine, with **lots** of small parts behind it, bleeds off heat better than any but the inflatable heatshield.\u003C/p\u003E\u003Cp\u003EIf you are very close to the burning point, rotate! you spread the heat better.\u003C/p\u003E\u003Cp\u003EAlso: Consider *not* jettisoning that empty propulsive stage. Between its engines, and several tanks, couplers \u0026amp; whatnot, an expired lower stage make for *great* ablative armor!\u003C/p\u003E\n"},{"CreatedByName":"AlexisBV","CreatedById":81911,"CreatedDateTime":"2014-08-13T17:28:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lukaszenko\u0022 data-cite=\u0022Lukaszenko\u0022\u003E\u003Cdiv\u003EAccording to Wikipedia, an aerocapture has never been performed in real life. So if it seems difficult in KSP, now you know why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELIES! It has been done, and is documented here:\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/_kC1NgbXMd8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Matokage","CreatedById":35691,"CreatedDateTime":"2014-08-13T17:54:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexisBV\u0022 data-cite=\u0022AlexisBV\u0022\u003E\u003Cdiv\u003ELIES! It has been done, and is documented here:\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/_kC1NgbXMd8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, it didn\u0027t happen, it\u0027s from a BBC program called Space Odyssey: Voyage to the Planets, here is the making of: \u003Ca href=\u0022https://www.youtube.com/watch?v=cl9nxG9C2dg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.youtube.com/watch?v=cl9nxG9C2dg\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-08-13T17:55:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lukaszenko\u0022 data-cite=\u0022Lukaszenko\u0022\u003E\u003Cdiv\u003EEDIT: According to Wikipedia, an aerocapture has never been performed in real life. So if it seems difficult in KSP, now you know why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe Galileo probe did a successful aerocapture, not to orbit, but to a parachute descent into the Jovian atmosphere. It went from 47 km/s Jupiter-relative to subsonic in about 2 minutes, experiencing about 230g and losing more than half of its heat-shield mass during the braking.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2014-08-13T18:57:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022AlexisBV\u0022 data-cite=\u0022AlexisBV\u0022\u003E\u003Cdiv\u003ELIES! It has been done, and is documented here:\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/_kC1NgbXMd8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAaa yes, I remember where I was when humans walked on Jupiter\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-08-14T07:29:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lukaszenko\u0022 data-cite=\u0022Lukaszenko\u0022\u003E\u003Cdiv\u003E an aerocapture has never been performed in real life. So if it seems difficult in KSP, now you know why \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo aerocapture has ever been done, and none is planned that I know of.\u003C/p\u003E\u003Cp\u003E(As in aerobrake from interplanetary transfer speeds to orbit, not simply slamming in and falling in the atmosphere)\u003C/p\u003E\u003Cp\u003EWe have done plenty of aerobrake maneuvers though, almost all of the MARS-something probes employed aerobraking.\u003C/p\u003E\u003Cp\u003Ep.s.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003EAirbreaking by 6Km-s\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Eair BREAKING? That is easy.\u003C/p\u003E\u003Cp\u003Eit\u0027s the aero-braking-but-non-breaking bit that is hard.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-14T07:32:34Z\u0022 title=\u002208/14/2014 07:32  AM\u0022 data-short=\u00229 yr\u0022\u003EAugust 14, 2014\u003C/time\u003E by MarvinKitFox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Lukaszenko","CreatedById":95776,"CreatedDateTime":"2014-08-14T14:11:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003ENo aerocapture has ever been done, and none is planned that I know of.\u003Cp\u003E(As in aerobrake from interplanetary transfer speeds to orbit, not simply slamming in and falling in the atmosphere)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that\u0027s what I gathered. I\u0027m still confused on the term though. Is \u0022aerocapture\u0022 an aerobrake and only an aerobrake to orbit from interplanetary speeds? As in, if you aerobrake while firing an engine, it is no longer an aerocapture?\u003C/p\u003E\u003Cp\u003EI\u0027m asking because of that Mars probe that got destroyed due to the wrong units...I understood it went to deep into the atmosphere while attempting to do some sort of aerocapture maneuver, no? Or was it supposed to avoid the atmosphere altogether?\u003C/p\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-08-14T20:21:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Lukaszenko\u0022 data-cite=\u0022Lukaszenko\u0022\u003E\u003Cdiv\u003E I\u0027m still confused on the term though. Is \u0022aerocapture\u0022 an aerobrake and only an aerobrake to orbit from interplanetary speeds? As in, if you aerobrake while firing an engine, it is no longer an aerocapture?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAerocapture:\u003C/p\u003E\u003Cp\u003EUsing an aerobrake event to transition from hyperbolic orbit to \u0022captured\u0022 orbit around the target body.\u003C/p\u003E\u003Cp\u003EAny amount of aerobraking would qualify, but it is usually understood as \u0022the vastly greater part\u0022 of braking is done by aerobrake.\u003C/p\u003E\u003Cp\u003ESome thrust is always required, of course, to raise periapse out of the atmosphere again. \u003C/p\u003E\u003Cp\u003EAnd given the ridiculous degree of trajectory accuracy required, it is expected that the vessel will be under constant positive control all the way through the maneuver.\u003C/p\u003E\u003Cp\u003EIn KSP we have a nice cheaty universe, with the atmosphere standing still(no wind), and dissipating in an exactly regular way, AND a clean clear cut-off altitude.\u003C/p\u003E\u003Cp\u003EThis makes aerobraking and aerocapture maneuvers predictable.\u003C/p\u003E\u003Cp\u003EIn real world, Mars\u0027s nominal high altitude atmosphere changes in density by !!!two whole orders of magnitude!!! between seasons, solar flares, and comets.\u003C/p\u003E\u003Cp\u003E(this year\u0027s comet C/2013-A1 is expected to increase the orbital drag on the orbiting Mars Reconaisance Orbiter by a factor of 25-30 times normal, simply by very lightly brushing the atmosphere with its cometary coma.....)\u003C/p\u003E\u003Cp\u003EPredicting the drag for an aerocapture under such circumstances is..... problematic.\u003C/p\u003E\n"},{"CreatedByName":"von Ziegendorf","CreatedById":58101,"CreatedDateTime":"2014-08-14T22:57:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003E... when I enter Eve SOI, velocity relative to Eve is already 5080 m/s. As I calculated, it\u0027s about 13 km/s at periapsis.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHow did you get such result? I calculated it would be only 6950m/s\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-08-15T21:33:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022von Ziegendorf\u0022 data-cite=\u0022von Ziegendorf\u0022\u003E\u003Cdiv\u003EHow did you get such result? I calculated it would be only 6950m/s\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI used this formula:\u003C/p\u003E\u003Cp\u003EÃŽÂ¼/r\u003Csub\u003E1\u003C/sub\u003E \u002B v\u003Csub\u003E1\u003C/sub\u003E\u003Csup\u003E2\u003C/sup\u003E/2 = ÃŽÂ¼/r\u003Csub\u003E2\u003C/sub\u003E \u002B v\u003Csub\u003E2\u003C/sub\u003E\u003Csup\u003E2\u003C/sup\u003E/2\u003C/p\u003E\u003Cp\u003EAnd it transfrms into\u003C/p\u003E\u003Cp\u003Ev\u003Csub\u003Ep\u003C/sub\u003E\u003Csup\u003E2\u003C/sup\u003E = ÃŽÂ¼(2/r\u003Csub\u003Ep\u003C/sub\u003E - 1/a) = ÃŽÂ¼(2/r\u003Csub\u003Ep\u003C/sub\u003E - (2ÃŽÂ¼ - rv\u003Csup\u003E2\u003C/sup\u003E)/ÃŽÂ¼r) = v\u003Csup\u003E2\u003C/sup\u003E \u002B ÃŽÂ¼(2/r\u003Csub\u003Ep\u003C/sub\u003E - 2/r)\u003C/p\u003E\u003Cp\u003EThe numbers were:\u003C/p\u003E\u003Cp\u003EÃŽÂ¼ = 8.1717302e12\u003C/p\u003E\u003Cp\u003Er = 8e7 (80Mm, current altitute)\u003C/p\u003E\u003Cp\u003Ev = 5080 (current orbital velocity)\u003C/p\u003E\u003Cp\u003Er\u003Csub\u003Ep\u003C/sub\u003E = 1e5\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EIn [3]: (5080**2 \u002B 8.1717e12 * (2 / 1e5 - 2 / 8e7)) ** .5\u003Cbr\u003EOut[3]: 13749.040239231246\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EVerifying these numbers, I got where the mistake was: I forgot planet\u0027s own radius. I add 7e5 and everything is correct:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003EIn [8]: (5080**2 \u002B 8.1717e12 * (2. / 8e5 - 2. / 8.5e7)) ** .5\u003Cbr\u003EOut[8]: 6785.526855438888\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-15T21:44:51Z\u0022 title=\u002208/15/2014 09:44  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 15, 2014\u003C/time\u003E by Kulebron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-08-15T21:49:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIn real world, Mars\u0027s nominal high altitude atmosphere changes in density by !!!two whole orders of magnitude!!! between seasons, solar flares, and comets.\u003C/p\u003E\u003Cp\u003E(this year\u0027s comet C/2013-A1 is expected to increase the orbital drag on the orbiting Mars Reconaisance Orbiter by a factor of 25-30 times normal, simply by very lightly brushing the atmosphere with its cometary coma.....)\u003C/p\u003E\u003Cp\u003EPredicting the drag for an aerocapture under such circumstances is..... problematic.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBut this has to deal with upper atmosphere, little amount of air and tiny drag, like orbital decay (some metres per second enough to dive very deep), but does this affect interplanetary capture that much?\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-08-15T21:51:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MarvinKitFox\u0022 data-cite=\u0022MarvinKitFox\u0022\u003E\u003Cdiv\u003Eair BREAKING? That is easy.\u003Cp\u003Eit\u0027s the aero-braking-but-non-breaking bit that is hard.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol. When do we start writing Euroenglish to avoid such confusions?\u003C/p\u003E\n"}]}