{"TopicId":81646,"ForumId":16,"TopicTitle":"Having issues balancing RCS on my spaceplane....","CreatedByName":"Bob Jub","CreatedById":12104,"CreatedDateTime":"2014-08-13T21:32:22Z","PageNum":1,"Articles":[{"CreatedByName":"Bob Jub","CreatedById":12104,"CreatedDateTime":"2014-08-13T21:32:22Z","Content":"\n\u003Cp\u003EI have a plane that I can SSTO to my station, though I\u0027m having much difficulty with docking it because when I move the RCS controls, it wobbles as if it were a ship on rough seas- I\u0027ve tried an addon called RCS Build aid, though it seems like as soon as I correct one counter torque problem, that fix causes a new conflict in torque.\u003C/p\u003E\n"},{"CreatedByName":"Master Tao","CreatedById":110410,"CreatedDateTime":"2014-08-13T21:35:59Z","Content":"\n\u003Cp\u003EMostly, it\u0027s just difficult. You can try shifting the center of mass in orbit by pumping fuel around and using precision controls while docking.\u003C/p\u003E\n"},{"CreatedByName":"Murph","CreatedById":90837,"CreatedDateTime":"2014-08-13T21:43:08Z","Content":"\n\u003Cp\u003ETry docking with SAS enabled, to hold the attitude while translating with RCS thrust, if you\u0027re not already doing that. If the problem is severe despite having SAS enabled, you might have insufficient reaction wheel torque. Around 0.5-1.0 torques per ton is usually reasonable for a small spaceplane.\u003C/p\u003E\u003Cp\u003EIt\u0027s near impossible (other than a minority of quite specific designs) to prevent the CoM moving through fuel usage, which essentially means than it\u0027s near impossible to have perfectly balanced RCS, only approximately balanced. It might be worth having a look at the Aeris 4A and how the RCS ports are setup on it, as it\u0027s fairly easy to dock with SAS\u002BRCS combined. Personally, I don\u0027t put much effort into balancing RCS, only very roughly, and find slow docking quite easy. Keep speed relative to target down to 0.5 m/s or less at close range during docking, so that only tiny squirts of RCS are needed, and that also helps to minimise problems.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-08-13T22:50:50Z","Content":"\n\u003Cp\u003ETurn on the precision controls by pressing capslock, it will balance RCS to a degree.\u003C/p\u003E\u003Cp\u003EOtherwise, keep playing with RCS build aid. It\u0027s easier to balance using the linear ports instead of the four way blocks.\u003C/p\u003E\n"},{"CreatedByName":"Bob Jub","CreatedById":12104,"CreatedDateTime":"2014-08-14T04:03:31Z","Content":"\n\u003Cp\u003EYeah guys, I\u0027ve been docking since before .18 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E And I\u0027ve ALWAYS had this same issue with many of my craft- I guess I\u0027ll just continue to twy tweaking.. though the linear port instead of blocks seems rather novel.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-08-14T04:13:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bob Jub\u0022 data-cite=\u0022Bob Jub\u0022\u003E\u003Cdiv\u003EYeah guys, I\u0027ve been docking since before .18 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E And I\u0027ve ALWAYS had this same issue with many of my craft- I guess I\u0027ll just continue to twy tweaking.. though the linear port instead of blocks seems rather novel.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELinear ports plus the RCS balancer mod. With a bit of work you can get them close enough for the torque to cancel any asymmetry. Also handy when building RCS/Vernor Mun VTOLs.\u003C/p\u003E\n"},{"CreatedByName":"impyre","CreatedById":116031,"CreatedDateTime":"2014-08-14T05:56:55Z","Content":"\n\u003Cp\u003EThere are a couple other pieces of advice I can offer that may or may not be immediately obvious. \u003C/p\u003E\u003Cp\u003EFirst, respect the CoM. The CoM will shift during flight, and there\u0027s nothing you can really do about that... (unless you\u0027re flying something really well balanced with fuel located at CoM) but there are a few steps you can take to mitigate it\u0027s effects on your craft. A) Place RCS blocks as far from center of mass as possible, since the torque produced by RCS acts on CoM, any force due to misalignment will be related to the ratio between the two different distances from CoM to the related ends being turned activated... and by maximizing distance between RCS blocks and CoM, you will bring that ratio closer to 1 and decrease the effects of being unbalanced. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E You can also help by configuring RCS while viewing CoM with fuel tanks set at half-used (for a single stack of two tanks, this generally means the top tank will be empty, and the bottom one will be full). You may notice that this relocates the CoM considerably, and will represent the \u0022average\u0022 CoM... This means that however much fuel you\u0027ve used, you\u0027re more likely to be close to the balance point (rather than if you start at it and just get further away as you use more fuel). Depending on how you use this vehicle, you may want to configure RCS to specific fuel profiles (IE: a one-time lander that should return and dock with orbiter with nearly no fuel, etc.) \u003C/p\u003E\u003Cp\u003ESecondly, don\u0027t use more RCS than necessary. Too much thrust from RCS can cause the thing to be jumpy and make it much harder to correct for imbalanced thrust. If you use as little thrust as possible, you can usually manually correct for all but the most unbalanced vessels.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-08-14T06:15:54Z","Content":"\n\u003Cp\u003ESpeaking of fuel balancing...the RCS Build aid mod also gives you CoM with both full and empty tanks (without having to faff about with tweakables) and measures the distance between the two. If it\u0027s more than 1m on a spaceplane, you should think about rearranging your tanks. Spread your fuel load laterally rather than longitudinally and use fuel lines to control the order in which they drain.\u003C/p\u003E\n"},{"CreatedByName":"Bob Jub","CreatedById":12104,"CreatedDateTime":"2014-08-14T06:22:07Z","Content":"\n\u003Cp\u003EThanks a bunch guys, the linear RCS ports really helped \u003Cimg src=\u0022http://i.imgur.com/840GPhj.jpg\u0022 alt=\u0022840GPhj.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"JDCollie","CreatedById":103176,"CreatedDateTime":"2014-08-14T06:55:16Z","Content":"\n\u003Cp\u003ESince you\u0027re down with mods, try TAC Fuel Balancer. Obviously it won\u0027t completely fix your problem as the parts retain weight while the fuel decreases, but at least you\u0027ll be able to restore the fuel balance you had when designing the ship.\u003C/p\u003E\u003Cp\u003EAnother good option is to look at your ship in orbit and examine how much fuel you have left and how it is distributed. Then go to the SPH and tweak your fuel in the craft down to those levels. You will be able to balance the craft using RCS build aid for how the ship will be balanced when trying to dock, rather than how it is fresh on the runway full of fuel. (Just remember to tweak the fuel back up before actually launching!)\u003C/p\u003E\n"},{"CreatedByName":"DocMoriarty","CreatedById":57433,"CreatedDateTime":"2014-08-14T15:29:53Z","Content":"\n\u003Cp\u003EYou don\u0027t need no mods to do that when your space planes are built correctly. A correct RCS setup for any size plane consists of usually 4 rcs thrusters set up more or less precisely around CoM. A correct designed space plane drains fuel without changing CoM Position at any time. Chapter \u00222.6.13. RCS Setup\u0022 in the doc in my signature.\u003C/p\u003E\n"},{"CreatedByName":"Murph","CreatedById":90837,"CreatedDateTime":"2014-08-14T16:35:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DocMoriarty\u0022 data-cite=\u0022DocMoriarty\u0022\u003E\u003Cdiv\u003EYou don\u0027t need no mods to do that when your space planes are built correctly. A correct RCS setup for any size plane consists of usually 4 rcs thrusters set up more or less precisely around CoM. A correct designed space plane drains fuel without changing CoM Position at any time. Chapter \u00222.6.13. RCS Setup\u0022 in the doc in my signature.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhile there\u0027s nothing wrong with producing a design like that, I strongly disagree with the implication that planes which don\u0027t have a static CoM are incorrectly or badly designed. Designing for a static CoM simply isn\u0027t necessary and places a huge artificial restriction on your designs. It is certainly necessary to consider how the CoM moves due to fuel usage, but it\u0027s only necessary to ensure that the CoM vs CoL is sufficient for aerodynamic flight, and that CoM vs RCS is controllable with the help of reaction wheel torque.\u003C/p\u003E\u003Cp\u003EIt\u0027s also wrong to say that 4 RCS thrusters are all that\u0027s needed for \u0022any size\u0022 plane. The thrusters do need to be roughly balanced around CoM, but the correct quantity of them depends strongly on the total mass of the plane. A small 10t plane will probably be fine with just 4 blocks, but a 200-250t heavy fuel/cargo plane will need far more RCS thrust.\u003C/p\u003E\n"},{"CreatedByName":"Bob Jub","CreatedById":12104,"CreatedDateTime":"2014-08-14T21:24:08Z","Content":"\n\u003Cp\u003EBut.. I like my designs- COM COL be damned, as long as it flies. THOUGH DocMoriarty I downloaded your PDF- and I\u0027m very impressed with how in depth and detailed it is, you are definitely a service to the community. Though.... I really do enjoy building planes that have aesthetic qualities that I enjoy, and attempt to build the flight characteristics around that.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-14T21:28:13Z\u0022 title=\u002208/14/2014 09:28  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 14, 2014\u003C/time\u003E by Bob Jub\u003C/strong\u003E\n\u003C/span\u003E\n"}]}