{"TopicId":81817,"ForumId":16,"TopicTitle":"What\u0026#039;s the best way to determine interplanetary launch windows?","CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2014-08-15T19:42:38Z","PageNum":1,"Articles":[{"CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2014-08-15T19:42:38Z","Content":"\n\u003Cp\u003EYeah, yeah, yeah, I know...ksp.olex.biz. But here\u0027s the problem. Olex tells me one thing. MechJeb tells me another. Kerbal Alarm Clock tells me something else. Alex Moon tells me...I think you all know where I\u0027m going with this. Does anyone know if one is better than another, or is it just a matter of preference?\u003C/p\u003E\u003Cp\u003EAlso, a question for all of you that use Kerbal Alarm Clock. Let\u0027s say I\u0027ve just set an alarm for a Kerbin to Jool launch window. Now I want to set an alarm for a return launch window. At the risk of stating the obvious, the departure date for the return needs to be AFTER I get to Jool. The problem is, the alarms tell you how much time UNTIL the alarm goes off, as opposed to the actual time. This makes it very difficult to figure out when I will arrive at Jool, because I\u0027m forced to add the time left on the alarm to the current time to get this figure, which involves finding out how many days in a Kerbin year there are and that is a huge pain in the asteroid. Is there ANY way to change this so that it tells you the ACTUAL TIME? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-27T16:35:35Z\u0022 title=\u002208/27/2014 04:35  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 27, 2014\u003C/time\u003E by MerlinsMaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GamerMitch","CreatedById":83492,"CreatedDateTime":"2014-08-15T19:46:23Z","Content":"\n\u003Cp\u003EAs far as your burn windows go, ksp.olex.biz seemed to give me the best answer on that stuff. I\u0027ve gone to all the planets except for Moho using that site.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-15T20:00:32Z","Content":"\n\u003Cp\u003EAlexmoon\u0027s planner is best as it is not tied with any specific mod. It takes all parameters into account and can even calculate the burn from non-standard orbit. I believe MechJeb should be close second - it should be able to prepare a burn from your current position anf orbit but it is tied to MechJeb and sometimes people get confused by it. AFAIK Alarm Clock windows are approximate and don\u0027t e.g. take planet orbit eccentriccity into account.\u003C/p\u003E\u003Cp\u003EMost importantly, launch windows are in general several days wide and not launchingat the exact optimum point usually does not mean any significant loss of dv - differences are usually in single units if m/s.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-15T20:08:43Z\u0022 title=\u002208/15/2014 08:08  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 15, 2014\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2014-08-15T20:39:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EAlexmoon\u0027s planner is best\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI have a question about that. What are the differences in the three Transfer Types? What does Ballistic mean? What\u0027s the differnce between Mid-Course Plane Change and Optimal? There doesn\u0027t seem to be any information on the page regarding this, so I\u0027ve just been selecting Mid-Course Plane Change every time.\u003C/p\u003E\n"},{"CreatedByName":"Malaugrym","CreatedById":57689,"CreatedDateTime":"2014-08-15T21:10:00Z","Content":"\n\u003Cp\u003EThe True Kerbal Way: Guesstimation.\u003C/p\u003E\n"},{"CreatedByName":"Renegrade","CreatedById":96629,"CreatedDateTime":"2014-08-15T21:17:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MerlinsMaster\u0022 data-cite=\u0022MerlinsMaster\u0022\u003E\u003Cdiv\u003EI have a question about that. What are the differences in the three Transfer Types? What does Ballistic mean? What\u0027s the differnce between Mid-Course Plane Change and Optimal? There doesn\u0027t seem to be any information on the page regarding this, so I\u0027ve just been selecting Mid-Course Plane Change every time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBallistic means that the craft burns once at the source orbit, and floats along until it\u0027s at the destination without any other burns until arrival. The initial burn takes care of any differences in orbital tilts, but will not always be a purely prograde burn.\u003C/p\u003E\u003Cp\u003EMid-course plane change means that you\u0027ll have to make a second burn at the AN or DN to correct for orbital tilt. I mostly use this one myself.\u003C/p\u003E\u003Cp\u003EI believe Optimal will mix and match from both techniques to give the lowest possible delta-v route.\u003C/p\u003E\u003Cp\u003EI haven\u0027t used MechJeb very much at all, so I can\u0027t comment on that, but Olex\u0027s system and KAC\u0027s system don\u0027t compensate for differences in orbital tilt/inclination or eccentricity so are highly inaccurate for things like Eeloo or Moho.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-08-15T21:33:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EAFAIK Alarm Clock windows are approximate and don\u0027t e.g. take planet orbit eccentriccity into account.\u003Cp\u003EMost importantly, launch windows are in general several days wide and not launchingat the exact optimum point usually does not mean any significant loss of dv - differences are usually in single units if m/s.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKerbal Alarm Clock actually has several different settings you can use to for making transfer window alarms. One of them claims to use the same algorithms as Alexmoon\u0027s website. That\u0027s the one I use.\u003C/p\u003E\n"},{"CreatedByName":"TheFloppyFish","CreatedById":119002,"CreatedDateTime":"2014-08-15T22:28:47Z","Content":"\n\u003Ca href=\u0022http://ksp.olex.biz/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://ksp.olex.biz\u003C/a\u003E This is exactly how my friend\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-16T05:32:11Z","Content":"\n\u003Cp\u003EOptimal strategy in alexmoon\u0027s planner is better of the two - ballistic and with plane change. Absolute majority of the time, though, optimum is a ballistic transfer. Likely thanks to Oberth effect. Personally I prefer ballistic transfers for one additional reason: it provides instant verification. I don\u0027t use tools to set up the maneuver and with ballistic transfer I set it up and get an intercept.\u003C/p\u003E\n"},{"CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2014-08-16T06:16:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EOptimal strategy in alexmoon\u0027s planner is better of the two - ballistic and with plane change. Absolute majority of the time, though, optimum is a ballistic transfer. Likely thanks to Oberth effect. Personally I prefer ballistic transfers for one additional reason: it provides instant verification. I don\u0027t use tools to set up the maneuver and with ballistic transfer I set it up and get an intercept.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EForgive me for repaying your kindness with additional questions, but I\u0027m trying to soak up as much info as possible. So when setting up a ballistic transfer, is there any trick to getting the inclination to match up? I understand you use the normal and anti-normal handles, but it seems to be very difficult to achieve the required level of precision when doing interplanetary maneuvers. Is there any way to make it easier, such as viewing the map from a certain angle, etc?\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-08-16T12:29:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MerlinsMaster\u0022 data-cite=\u0022MerlinsMaster\u0022\u003E\u003Cdiv\u003EForgive me for repaying your kindness with additional questions, but I\u0027m trying to soak up as much info as possible. So when setting up a ballistic transfer, is there any trick to getting the inclination to match up? I understand you use the normal and anti-normal handles, but it seems to be very difficult to achieve the required level of precision when doing interplanetary maneuvers. Is there any way to make it easier, such as viewing the map from a certain angle, etc?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, if you\u0027re doing this stock, exact precision is an impossible dream. Alexmoon\u0027s site gives you these wonderfully precise numbers but they\u0027re useless unless you put the maneuver node at the exact ejection angle, and there\u0027s no way to do that with stock. Also, Alexmoon gives you the amount of delta-v for the vertical and horizontal components of the ballistic burn, but stock doesn\u0027t display those, either. So the best you can do with stock is eyeball the placement of the node and then fiddle with its handles until you get an intercept, bearing in mind you need a lot more prograde than you do up or down. And you can help yourself here by setting your conic draw mode to zero so when you get an intercept, it will show up in Duna\u0027s SOI. Then you can double-click Duna to shift your focus there, then use the mouse wheel VERY slowlly on the maneuver node handles to get very small inputs.\u003C/p\u003E\u003Cp\u003EThere are, however, mods that help here. There\u0027s Protractor and Precise Node (and probably others) which let you put the node in the right place. And at least Precise Node and MJ allow you to input exact delta-v numbers for all the components of the burn vector. Using these, you can do exactly what Alexmoon\u0027s site says to do. Without these, Alexmoon\u0027s data is something you can only approach asymptotically.\u003C/p\u003E\u003Cp\u003EEDIT: MJ\u0027s \u0022Transfer to Another Planet\u0022 function will create a maneuver node all by itself, but it\u0027s going to be for a 2-step transfer with a mid-course correction required along the way. AFAIK there\u0027s no way to tell MJ to do a ballistic transfer. And the nodes are in slightly different places for ballistic and 2-step burns. However, what you can do is tell MJ to create a transfer node, then use its Maneuver Node Editor to enter the numbers from Alexmoon\u0027s page, turning it into a ballistic burn. But you\u0027ll have to put in slightly different numbers than shown on the page because the node will be in a slightly different position. Still, it\u0027s pretty easy to do trial and error on this.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-16T12:35:48Z\u0022 title=\u002208/16/2014 12:35  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 16, 2014\u003C/time\u003E by Geschosskopf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-08-16T13:10:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EWell, if you\u0027re doing this stock, exact precision is an impossible dream. Alexmoon\u0027s site gives you these wonderfully precise numbers but they\u0027re useless unless you put the maneuver node at the exact ejection angle, and there\u0027s no way to do that with stock.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not too hard, actually. You can put the two numbers (prograde and normal dV) in stages. Put in prograde first, then add normal until the total matches the total on alexmun\u0027s planner. A long time ago, I wrote up a guide to do this. It\u0027s [thread=33547]here.[/thread] (The note at the top of the guide says it doesn\u0027t work. This isn\u0027t exactly true; it will work pretty well for almost every interplanetary transfer you\u0027ll do in KSP unless you\u0027re doing really high dV transfers.)\u003C/p\u003E\u003Cp\u003EAlex\u0027s window planner is the most general planner; the Hohmann solutions produced by olex\u0027s planner are a (small) subset of the ones produced by alex\u0027s. With alex\u0027s planner, you can decide whether to expend extra dV in order to launch earlier than a particular window or get to the destination faster than a Hohmann transfer would permit. It also takes into account inclination and eccentricity.\u003C/p\u003E\n"},{"CreatedByName":"smart013","CreatedById":106088,"CreatedDateTime":"2014-08-16T14:14:18Z","Content":"\n\u003Cp\u003EQuick question: where in Precise Node, mj or others can i edit the ejection angle? Pro and normal, ok, check. Time? Check. But everything else from alexmoons data provided i still need to find out. Help?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-16T14:47:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MerlinsMaster\u0022 data-cite=\u0022MerlinsMaster\u0022\u003E\u003Cdiv\u003EForgive me for repaying your kindness with additional questions, but I\u0027m trying to soak up as much info as possible. So when setting up a ballistic transfer, is there any trick to getting the inclination to match up? I understand you use the normal and anti-normal handles, but it seems to be very difficult to achieve the required level of precision when doing interplanetary maneuvers. Is there any way to make it easier, such as viewing the map from a certain angle, etc?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe planner tells you how much of the burn is normal/antinormal so I set up that first, exactly to 0.1 m/s (it\u0027s the lower of the two values anyway). Then I pull the prograde handle to achieve the planned total. Most of the case this does not lead to intercept but it displays closest encounter markers. Then I fine-tune that using mouse wheel over maneuver handles (extremely precise, you can get down to 0.01 m/s accuracy but remember that maneuver handles make different steps for wheel up and wheel down). Most of the time it needs a little radial impulse one way or another, compensating for inaccuracy in setting up the exact position of the maneuver.\u003C/p\u003E\u003Cp\u003EIt is possible to set up the maneuver very precisely but just an intercept is usually fine as you\u0027re not going to execute the burn exactly enough anyway (just the time it takes to execute the burn introduces a lot of error) and it is necessary (or a very good idea) to make corrections. First correction should give you the intercept again, you want to make that one as soon as possible, eventually even before you finish the transfer burn. The second correction (after leaving the SOI and/or halfway through the transfer) is good to set up your periapsis low above your target so you spend least dv braking.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-16T23:37:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022smart013\u0022 data-cite=\u0022smart013\u0022\u003E\u003Cdiv\u003EQuick question: where in Precise Node, mj or others can i edit the ejection angle? Pro and normal, ok, check. Time? Check. But everything else from alexmoons data provided i still need to find out. Help?\u003C/div\u003E\u003C/blockquote\u003EThe ejection angle is a consequence of when in your orbit you burn. So to change it you change the time of the manouevre.\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-08-17T03:43:37Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003EIt\u0027s not too hard, actually. You can put the two numbers (prograde and normal dV) in stages. Put in prograde first, then add normal until the total matches the total on alexmun\u0027s planner\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, you can do that for the burn itself, but this presupposes you have the maneuver node for the burn in the exact position for the prescribed burn, which there is no way to do in stock. If you play a bunch of games where you always go to Duna at the 1st opporunity, you can perhaps learn to judge where to place the maneuver node relative to the backgroun skybox features. Or maybe you were an artillery forward observer in another life and so are better than most at judging angles. Or both. But even so, in stock it\u0027s still all eyeball as to where to put the node, which means way fewer significant digits than provided by Alexmoon.\u003C/p\u003E\u003Cp\u003ESo at the bottom line, if you do things stock, all you can take from Alexmoon is the date and time of the burn. And odds are, you won\u0027t get the time right because that requires your ship to hit the transfer node at exactly the right time. Which, while possible, requires a lot of research first and then careful launching and tweaking of parking orbits, which few players understand and fewer actually have the patience for. So for most folks, that just leaves the day to burn, which anybody can hit. So right off the bat, your burn is probably going to be a few hours off Alexmoon\u0027s time, and this is before you plunk down the maneuver node by eye, which alone negates the precision of Alexmoon\u0027s delta-v numbers. There are thus several inescapable sources of error between the stock player and textbook solution. And this is all before actually doing the burn, where screen resolution can easily impede getting the ship pointed in exactly the right direction, and where it\u0027s utterly impossible to do the burn exactly as specified due to the lag in throttling up.\u003C/p\u003E\u003Cp\u003ESo my advice for new players is that if they want to go stock, don\u0027t sweat anything but the date of departure. On that day, put a node down as best you can and fiddle with the handles until you get the encounter you desire. Or get 1 or more mods to let you do things with absolute precision.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-08-17T03:51:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EYeah, you can do that for the burn itself, but this presupposes you have the maneuver node for the burn in the exact position for the prescribed burn, which there is no way to do in stock.\u003C/div\u003E\u003C/blockquote\u003EDo it the other way round. Set a node with about the right amount of delta-V, then drag it round the parking orbit and look for the close approach or encounter with the destination. Refine as needed.\n"},{"CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2014-08-17T06:51:47Z","Content":"\n\u003Cp\u003EHoly schnykies, I never even knew about that mouse-wheel thing! That\u0027s gonna totally revolutionize how I space.\u003C/p\u003E\u003Cp\u003EQuick question about the Oberth effect. Is it less effective at a higher orbit?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-08-17T07:23:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MerlinsMaster\u0022 data-cite=\u0022MerlinsMaster\u0022\u003E\u003Cdiv\u003EQuick question about the Oberth effect. Is it less effective at a higher orbit?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn higher orbit you are moving slower so the Oberth effect is not that strong. It is always most effective to make your transfer/braking burns at as low periapsis as possible. But of course you also need to take your starting/target orbit parameters into account. If you are already in high orbit and want to make transfer burn, it is sometimes better if you lower your periapsis first and burn for transfer from that low periapsis. But the math is not straightforward.\u003C/p\u003E\u003Cp\u003EFor example: in 600 km Kerbin orbit you have a lot more orbital energy than in 70 km orbit. Transfer to Duna takes less dv from 600 km orbit than from 70 km orbit. But transfer to Jool costs about the same from both (the difference is just about 25 m/s) and if you were transferring somewhere further out (or in, e.g. below Moho orbit) then burning from 70 km orbit takes less dv than from 600 km orbit.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2014-08-17T08:44:50Z","Content":"\n\u003Cp\u003EI\u0027d say use the alexmoon thing. Otherwise, learn phase angles.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/5pfpz\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003EAHAHAHA IT WORKS\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"Targa","CreatedById":116596,"CreatedDateTime":"2014-08-17T14:42:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022MerlinsMaster\u0022 data-cite=\u0022MerlinsMaster\u0022\u003E\u003Cdiv\u003EForgive me for repaying your kindness with additional questions, but I\u0027m trying to soak up as much info as possible. So when setting up a ballistic transfer, is there any trick to getting the inclination to match up? I understand you use the normal and anti-normal handles, but it seems to be very difficult to achieve the required level of precision when doing interplanetary maneuvers. Is there any way to make it easier, \u003Cstrong\u003Esuch as viewing the map from a certain angle\u003C/strong\u003E, etc?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not OCD about precision maneuvers, but this ^^^ (bold added for emphasis) is what I do. Go into map mode and zoom way out, tilt the camera down to the horizontal position so planetary orbits appear as a horizontal line. I put my camera at an AN or DN where my ship\u0027s orbit and the planets orbit cross, click the line and select \u0022add maneuver\u0022. Then it\u0027s just a matter of adjusting the tilt angle to visually match the inclination of the planet/moon I\u0027m trying to align with.\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-08-17T15:25:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kasuha\u0022 data-cite=\u0022Kasuha\u0022\u003E\u003Cdiv\u003EFor example: in 600 km Kerbin orbit you have a lot more orbital energy than in 70 km orbit. Transfer to Duna takes less dv from 600 km orbit than from 70 km orbit. But transfer to Jool costs about the same from both (the difference is just about 25 m/s) and if you were transferring somewhere further out (or in, e.g. below Moho orbit) then burning from 70 km orbit takes less dv than from 600 km orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course, if you\u0027re using THAT much delta-v, it starts being worthwhile for you to do the trickier maneuvers (slingshots, for example, or bi-elliptic transfers going down low).\u003C/p\u003E\n"},{"CreatedByName":"Mr Shifty","CreatedById":68146,"CreatedDateTime":"2014-08-17T15:54:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EYeah, you can do that for the burn itself, but this presupposes you have the maneuver node for the burn in the exact position for the prescribed burn, which there is no way to do in stock. If you play a bunch of games where you always go to Duna at the 1st opporunity, you can perhaps learn to judge where to place the maneuver node relative to the backgroun skybox features. Or maybe you were an artillery forward observer in another life and so are better than most at judging angles. Or both. But even so, in stock it\u0027s still all eyeball as to where to put the node, which means way fewer significant digits than provided by Alexmoon.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor most interplanetary departures (except very high delta-V ones), you\u0027re going to be leaving parallel to the origin planet\u0027s orbit so as to take maximum advantage of the origin planet\u0027s orbital speed. This allows a pretty good eyeball estimate of the ejection angle. Set up the maneuver node with the correct pro/retro grade and normal components approximately at the correct ejection angle, then drag it around until your departure trajectory is parallel to your origin planet\u0027s orbit. The ejection angle takes care of itself. I detailed this procedure in [thread=33547]the guide[/thread] I linked earlier.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003ESo right off the bat, your burn is probably going to be a few hours off Alexmoon\u0027s time, and this is before you plunk down the maneuver node by eye, which alone negates the precision of Alexmoon\u0027s delta-v numbers. There are thus several inescapable sources of error between the stock player and textbook solution.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor Kerbin departures, LKO orbits are about 30 minutes long. This means that you can reach alexmun\u0027s specified departure time to within about 15 minutes, which doesn\u0027t have an appreciable effect on the final trajectory. (The length of the burn adds way more imprecision than the departure time.) Players are absolutely going to have to tweak these orbits to get good intercepts, but after the burn as specified by alexmun is done, we\u0027re talking about \u0026lt;10 m/s while en-route.\u003C/p\u003E\n"},{"CreatedByName":"MerlinsMaster","CreatedById":112079,"CreatedDateTime":"2014-08-17T20:47:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr Shifty\u0022 data-cite=\u0022Mr Shifty\u0022\u003E\u003Cdiv\u003E(The length of the burn adds way more imprecision than the departure time.) \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I learned that the hard way last night (\u0022that\u0027s what she said\u0022). Seriously though, I used the Alex Moon site to get a departure time, used Precise node to set up my maneuver, and got a ballistic encounter with Duna for just 600m/s (just half of the estimate calculated on Alex Moon). I was psyched. But then the burn took like a half an hour, and it totally threw off the maneuver. Is there any way to avoid this, besides adding more engines? On that note, what\u0027s generally considered to be the minimum TWR for interplanetary burns?\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-08-17T21:15:01Z","Content":"\n\u003Cp\u003EWith lower TWRs, you start getting into things like multiple orbits, each with a \u0022kick\u0022 near periapsis. It lets you take advantage of the Oberth effect better, and you can generally do things with better precision on your last burn. It\u0027s a bit of a pain judging your initial burn point, though I think the \u0022one orbit forward\u0022 button will help a lot ... about 12 hours beforehand, set up your node to get a burn point and start giving the craft a push every time you get there. The final full orbit, you\u0027ll probably want to time things to arrive at the periapsis about the same time you originally set the node up for, then you just do the final burn (though you\u0027re going to have to redo the node now and then, I\u0027m sure ... I\u0027ve been messing about with BTSM, so I haven\u0027t had to send anything anywhere far YET).\u003C/p\u003E\n"}]}