{"TopicId":82708,"ForumId":16,"TopicTitle":"Dropping Jeb from a plane","CreatedByName":"ceauke","CreatedById":67898,"CreatedDateTime":"2014-08-24T11:25:22Z","PageNum":1,"Articles":[{"CreatedByName":"ceauke","CreatedById":67898,"CreatedDateTime":"2014-08-24T11:25:22Z","Content":"\n\u003Cp\u003EHi guys\u003C/p\u003E\u003Cp\u003EI\u0027m trying to get some science on Kerbin so the plan is to fly an aircraft whereever I need to, and drop a capsule with Jeb in with science attached etc.\u003C/p\u003E\u003Cp\u003EBut the game won\u0027t let me split the aircraft it two... For a short moment it shows to vessels on the map but as soon as the capsule is out of the area of the plane, it vanishes.\u003C/p\u003E\u003Cp\u003EWhile it\u0027s visible, it says it cannot switch while it atmosphere.\u003C/p\u003E\u003Cp\u003EAny tips?\u003C/p\u003E\u003Cp\u003Eit seems that the only way to do this is only have one cockpit/capsule and destroy my plane in the process if I want to land on top of a mountain etc.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-24T12:33:13Z\u0022 title=\u002208/24/2014 12:33  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 24, 2014\u003C/time\u003E by ceauke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-08-24T11:33:46Z","Content":"\n\u003Cp\u003EYou cannot have two \u003Cem\u003Eflying \u003C/em\u003Eobjects at the same time, that do not share the same physics bubble.(2.5km)\u003C/p\u003E\u003Cp\u003EOnly two ways of making this work:\u003C/p\u003E\u003Cp\u003E1) Have the dropping plane so high, that it is not in atmosphere. Works like a charm, but is better know as the mothership\u002Blander method.\u003C/p\u003E\u003Cp\u003Eor\u003C/p\u003E\u003Cp\u003E2) Have your dropped pod reach ground and become non-flying, before it leaves your dropping plane\u0027s physics bubble.\u003C/p\u003E\u003Cp\u003Eit well need to be able to do so without your intervention, as you will not be allowed to swap.\u003C/p\u003E\u003Cp\u003EBut if the dropped pod is on ground, and not moving, it will remain.\u003C/p\u003E\u003Cp\u003ESo its either orbital drop, or very low combat drop.\u003C/p\u003E\u003Cp\u003EHALO parachuting is not supported by the KSP fizzics model.\u003C/p\u003E\n"},{"CreatedByName":"rowns","CreatedById":66524,"CreatedDateTime":"2014-08-24T11:34:57Z","Content":"\n\u003Cp\u003ETry this mod is should help you get those science points: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/86691-0-24-2-DebRefund-v1-0-12\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/86691-0-24-2-DebRefund-v1-0-12\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"M4ck","CreatedById":74138,"CreatedDateTime":"2014-08-24T12:42:15Z","Content":"\n\u003Cp\u003EOr use Flight Manager for Reusable Stages. It takes a while to get how it works, but is very useful for such situations. It kind of lets you reverse time back to separation of any controllable piece detached while in flight(a booster with a probe core, a lander, a twin plane aircraft etc.), do what you want to do with it(get to orbit, land, crash) and then continue your main mission from the moment of separation.\u003C/p\u003E\u003Cp\u003EThe only thing to remember is to \u003Cstrong\u003Ealways\u003C/strong\u003E click Return to Main Vessel(or whatever it is called) after you are done with the current dropped part instead of switching vessels or going straight to the Space Center straight away.\u003C/p\u003E\n"},{"CreatedByName":"mythic_fci","CreatedById":58577,"CreatedDateTime":"2014-08-24T12:59:03Z","Content":"\n\u003Cp\u003ETry getting a capsule with Jeb, the Science!, 3 landing legs, and a few parachutes, go screaming low over the surface like it\u0027s the Reno air races on Kerbin, and once you find flat land, deploy the capsule, it\u0027s landing legs, and the chutes IMMEDIATELY.\u003C/p\u003E\n"},{"CreatedByName":"ceauke","CreatedById":67898,"CreatedDateTime":"2014-08-24T14:06:40Z","Content":"\n\u003Cp\u003Ehi guys, thanks for the suggesions but in the end it seems cheaper just to strap on a few boosters to jeb and his capsule and do a balistic rocket launch to the location rather than flying there. Flying to the north pole is pretty boring and takes long and launching a rocket is more efficient. looking at my plane parts vs rocket parts, it actually works out cheaper to use an expedible rocket than an expendible plane\u003C/p\u003E\n"}]}