{"TopicId":84325,"ForumId":16,"TopicTitle":"Yet Another Obstreperous Docking Port","CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-09-11T01:37:50Z","PageNum":1,"Articles":[{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-09-11T01:37:50Z","Content":"\n\u003Cp\u003EThere seems to have been a rash of docking port issues of late. And I\u0027ve got another.\u003C/p\u003E\u003Cp\u003EI launched a space station core recently. It\u0027s a variation of a design I\u0027ve used before, and I know from prior experience that its Clamp-o-Tron Sr attachment to its booster is too wobbly to survive launch unaided, so I provide launch restraints in the form of struts attached to I-beams which I then discard once it\u0027s safely in orbit.\u003C/p\u003E\u003Cp\u003EOne of the ways in which this was a \u0022variant\u0022 was that I added Clamp-o-Tron Jrs to its fuel-storage tank and attached the launch-support I-beams to those. Idea was that I could then get rid of them by undocking the port, and the I-beam floats away. I\u0027ve done this before in other contexts (though I confess this was the first time I did it with Jrs). Works just fine.\u003C/p\u003E\u003Cp\u003EExcept this time it didn\u0027t. I click on the docking port, and the ONLY option I am given is \u0022control from here\u0022. No \u0022undock\u0022 option. All 4 of these docking ports behave identically; but I also set up a quad of Clamp-o-Tron Srs the same way, and they behaved as expected.\u003C/p\u003E\u003Cp\u003EMy first thought was that maybe the Jr was too small, and the I-beam slopped over onto the tank and was thus irrevocably attached. However, this does not seem to be the case, at least with a visual inspection.\u003C/p\u003E\u003Cp\u003ELooking at the responses to other folks\u0027 docking port issues, I imagine I can edit my persistent.sfs to fix the port...IF I knew what to look for and what to change it to. (Alternately, I could \u0022cheat\u0022 with a more \u0022game-y\u0022 solution and just delete the I-beams from persistent.sfs...but I suspect I\u0027d have to change something about the docking port\u0027s state rather than just delete the I-beam, and I don\u0027t know what changes I\u0027d have to make to the docking port.)\u003C/p\u003E\u003Cp\u003EHelp?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-11T03:03:52Z\u0022 title=\u002209/11/2014 03:03  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 11, 2014\u003C/time\u003E by Srpadget\u003C/strong\u003E\n\u003Cbr\u003EMark back to \u0026#039;Unanswered\u0026#039;, darn it!\n\u003C/span\u003E\n"},{"CreatedByName":"Huzke","CreatedById":31825,"CreatedDateTime":"2014-09-11T01:57:12Z","Content":"\n\u003Cp\u003EHave a read of this: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/35777-Can-t-Undock-Bug-How-To-Fix\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/35777-Can-t-Undock-Bug-How-To-Fix\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt seems to cover what your problem is as well as the persistent file editing. Have fun messing around with the coding, also needless to say, don\u0027t forget to make a backup!\u003C/p\u003E\u003Cp\u003EI have had this issue as well but fortunately I tested my craft on the launchpad and found that it didn\u0027t work haha.\u003C/p\u003E\u003Cp\u003EI found what I had done wrong was placing the attached object on the surface of the docking port, instead of attaching it too the little node available (idk if that makes sense) I tested this a few other time and it\u0027s only a problem for my jr ports. Placing the docking port on the other object however I never had a problem, node or no node.\u003C/p\u003E\u003Cp\u003EIdk if that will help you for future crafts or not but goodluck up there!\u003C/p\u003E\u003Cp\u003EEDIT: Better luck next time claw \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E But I agree with him, his link is better. Roscoe\u0027s post was just the first link I had at the time.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-11T02:40:16Z\u0022 title=\u002209/11/2014 02:40  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 11, 2014\u003C/time\u003E by Huzke\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-09-11T01:58:14Z","Content":"\n\u003Cp\u003EI would recommend against deleting the I-beams from your save file. Your I-beams will be gone, but you probably won\u0027t like the resulting crashes and exploding ships.\u003C/p\u003E\u003Cp\u003EYou can take a look at this thread. You can pick the correct section, depending on exactly how things are broken: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78863-FIX-Dock-Undocking-Bug-in-0-23-5\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/78863-FIX-Dock-Undocking-Bug-in-0-23-5\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELet me know if it\u0027s not making sense. Also, make sure you aren\u0027t connecting the I-beams to the surface of the docking port, instead of the node.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003EClaw\u003C/p\u003E\u003Cp\u003EEDIT: I see I was ninja\u0027d. The above link to Roscoe\u0027s post is similar to the link I posted. I might be a bit biased, but I think my link fills in some of the details missing from Roscoe\u0027s post.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-11T02:00:35Z\u0022 title=\u002209/11/2014 02:00  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 11, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-09-11T02:17:56Z","Content":"\n\u003Cp\u003EThanks, I\u0027ll look into it. (I have a sneaking suspicion that I may have connected the beams to the node surfaces; but I\u0027ll poke at it and see what happens. Worst comes to worst, I evacuate the station and destroy it, then launch again. Huzzah for a healthy bank account!)\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2014-09-11T03:02:31Z","Content":"\n\u003Cp\u003EWell dang. No joy.\u003C/p\u003E\u003Cp\u003ENow that I know what to look for, I can verify that the I-beams are indeed SURFACE ATTACHED to the docking ports.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E On the plus side, I edited the docking ports suggested in Claw\u0027s thread, and when reloading the edited persistent file, Kerbin High Port did NOT explode (yay!). On the minus side, the I-beams remain solidly welded to the edited docking ports (boo!)\u003C/p\u003E\u003Cp\u003EThe next thing to try would presumably be to make a similar edit to the I-beams so that they are node-attached rather than surface-attached. But to do that right, I\u0027d need to know how far the I-beam would have to MOVE to be properly aligned, yes?\u003C/p\u003E\u003Cp\u003EEDIT: Curiouser and curiouser! After loading the edited persistent.sfs, trying to decouple the I-beams from the ports (and failing), then quitting out...KSP re-edited my edits. Now the docking ports are all back to \u0027state = Ready\u0027 (I had edited them to \u0027state = PreAttached\u0027 per instructions) and for some reason KSP decided that the I-beams are attached to the BOTTOM docking port node rather than the top node. (Which would certainly explain why I can\u0027t undock from them...!)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-09-11T03:17:04Z\u0022 title=\u002209/11/2014 03:17  AM\u0022 data-short=\u00229 yr\u0022\u003ESeptember 11, 2014\u003C/time\u003E by Srpadget\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Huzke","CreatedById":31825,"CreatedDateTime":"2014-09-11T03:12:38Z","Content":"\n\u003Cp\u003EHopefully Claw comes back with some information, i\u0027ll try not to steal his thunder this time. But if you are just trying to remove the I-Beams... have you thought of either sending up another ship to just collide with them... although I think they are pretty tough so if you don\u0027t mind a bit of debugging bring up wack-a-kerbal and go to town trying to snipe them off.\u003C/p\u003E\u003Cp\u003EI once landed on a kerbal and he got stuck in the landing gear, no matter how I twisted or turned he was pretty damn happy chilling there, so once I got back into orbit around the moon, I had a good time trying to blow up the landing gear without a) killing him, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E killing the other two in the command module, c) having 700 mini balls orbiting the mun. \u003C/p\u003E\u003Cp\u003EI honestly don\u0027t know where I would be without quicksaves...\u003C/p\u003E\n"},{"CreatedByName":"AlexinTokyo","CreatedById":104401,"CreatedDateTime":"2014-09-11T03:42:58Z","Content":"\n\u003Cp\u003EMight be easier to replace the current ship with a new one.\u003C/p\u003E\u003Cp\u003EEssentially, place the corrected ship on the launch pad, exit the game and then swap the orbital parameters between the old and the new. (Make a backup, always make a backup).\u003C/p\u003E\u003Cp\u003EThe result should be that the corrected ship ends up in orbit and can be flown as normal, and the defective ship can be recovered from the pad (or destroyed, or whatever).\u003C/p\u003E\u003Cp\u003EI\u0027m sure I\u0027ve seen answers like this including the actual lines of the persistence file that need to be copied, but the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/20702-How-to-edit-persistence-file?p=269166\u0026amp;viewfull=1#post269166\u0022 rel=\u0022external nofollow\u0022\u003Eonly one I can find\u003C/a\u003E is kind of old. I\u0027m not immediately sure if there have been any changes.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-09-11T14:31:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Srpadget\u0022 data-cite=\u0022Srpadget\u0022\u003E\u003Cdiv\u003EWell dang. No joy.\u003Cp\u003ENow that I know what to look for, I can verify that the I-beams are indeed SURFACE ATTACHED to the docking ports.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cry.gif\u0022 alt=\u0022;.;\u0022\u003E On the plus side, I edited the docking ports suggested in Claw\u0027s thread, and when reloading the edited persistent file, Kerbin High Port did NOT explode (yay!). On the minus side, the I-beams remain solidly welded to the edited docking ports (boo!)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf they are surface mounted, my fixes will not work as posted. As I\u0027m sitting here thinking about it, you probably aren\u0027t going to get away with a simple edit to convert the surface to node attachment. You\u0027ll need to add lines to the docking ports to attach them, since surface attachments don\u0027t create an anchor point on the parent part. I also don\u0027t know which end is the default node attach, and which end is the surface attach for the I-beam. That can cause problems (as it sounds like you\u0027ve found).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Srpadget\u0022 data-cite=\u0022Srpadget\u0022\u003E\u003Cdiv\u003EEDIT: Curiouser and curiouser! After loading the edited persistent.sfs, trying to decouple the I-beams from the ports (and failing), then quitting out...KSP re-edited my edits. Now the docking ports are all back to \u0027state = Ready\u0027 (I had edited them to \u0027state = PreAttached\u0027 per instructions) and for some reason KSP decided that the I-beams are attached to the BOTTOM docking port node rather than the top node. (Which would certainly explain why I can\u0027t undock from them...!)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s because your I-beams are not nodally attached. The game is trying to \u0022fix\u0022 what it sees as a broken save file since you told the docking port has something PreAttached, but yet there\u0027s nothing attached to its node.\u003C/p\u003E\u003Cp\u003EAt this point, I think it would take less time to build and launch a new ship than to fiddle with the save file (unless you want to learn more about how they are structured).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Huzke\u0022 data-cite=\u0022Huzke\u0022\u003E\u003Cdiv\u003EHopefully Claw comes back with some information, i\u0027ll try not to steal his thunder this time.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou\u0027re not stealing any thunder. We are all here to help out! Roscoe\u0027s post was the basis for mine. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E His is just a bit outdated with recent game changes.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"}]}