{"TopicId":86637,"ForumId":16,"TopicTitle":"how do you do torque in MkII spaceplanes?","CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2014-10-09T12:47:34Z","PageNum":1,"Articles":[{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2014-10-09T12:47:34Z","Content":"\n\u003Cp\u003EHi guys,\u003C/p\u003E\u003Cp\u003Eafter the release of 0.25 (yay!) I was messing around with the new spaceplane parts, trying to make a spaceplane with exclusively MkII parts and I ran into a bit of an annoying problem: I couldn\u0027t put any real torque near the center of mass. I love the fact that we now have LFO MkII tanks, but now I was faced with the fact that we don\u0027t have any MkII-shaped reaction wheels (other than the probe core maybe?).\u003C/p\u003E\u003Cp\u003ESo I was wondering, how do you guys ensure you have enough torque on your spaceplanes to manouver in the vacuum of space? Do you just rely on the cockpit reaction wheels? Do you add the regular 1.25m tanks with their respective reaction wheels? Do you rely purely on RCS thrusters? Do you have another inventive solution? Please share!\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-10-09T12:49:20Z","Content":"\n\u003Cp\u003EThe Mk2 Probe Core has some torque but mostly pitch, not so much yaw and roll. So what I do is put 1 or more 1.25m reaction wheels in the cargo bay, along with the RTGs to power them.\u003C/p\u003E\n"},{"CreatedByName":"Cirocco","CreatedById":100285,"CreatedDateTime":"2014-10-09T14:27:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EThe Mk2 Probe Core has some torque but mostly pitch, not so much yaw and roll. So what I do is put 1 or more 1.25m reaction wheels in the cargo bay, along with the RTGs to power them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Ehuh, that\u0027s a pretty good idea. Might do that in the future.\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-10-09T14:57:45Z","Content":"\n\u003Cp\u003EIf you use the fuel tank which adapts from MKII to MKI placed in front of your cockpit (obviously I mean the cockpit with an attachment node on the front), you can just whack a standard SAS to the front of the plane\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-10-09T15:04:46Z","Content":"\n\u003Cp\u003EBehind an intake or in front of an engine works too.\u003C/p\u003E\u003Cp\u003EBut, usually, you\u0027ll want to include a small cargo bay on all but the smallest spaceplanes just so you have somewhere to stash unaerodynamic bits like solar panels and science instruments and such. An ASAS module and a battery usually make a good mounting point for a couple of solar panels, a mechjeb unit and some TAC-LS containers.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-10-09T15:11:48Z","Content":"\n\u003Cp\u003EYeah, a small cargo bay is the best way to get more SAS, it also works for solar or PB NUKs and monopropellant if your not using the Mk II inline docking port, since the Mk II mono prop tank is pretty much too big for anything unless you plan on using O-10 engines. Also, with all of that, you have just enough room for a KAS toolbox.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-09T15:26:00Z\u0022 title=\u002210/09/2014 03:26  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 9, 2014\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-10-09T15:42:00Z","Content":"\n\u003Cp\u003EAlso, the placement of the reaction wheels doesn\u0027t matter, i.e. you don\u0027t need to place them near the CoM on your plane, so you have some freedom in where you place a cargo bay to sneak them in.\u003C/p\u003E\n"},{"CreatedByName":"Beachernaut","CreatedById":69994,"CreatedDateTime":"2014-10-09T16:34:43Z","Content":"\n\u003Cp\u003ECan\u0027t remember if it\u0027s true in KSP or not, but the further the reaction wheel is from COM, the more effect it\u0027ll have (within reason). I generally put mine behind the air intake.\u003C/p\u003E\n"},{"CreatedByName":"Franklin","CreatedById":89718,"CreatedDateTime":"2014-10-09T17:31:19Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beachernaut\u0022 data-cite=\u0022Beachernaut\u0022\u003E\u003Cdiv\u003ECan\u0027t remember if it\u0027s true in KSP or not, but the further the reaction wheel is from COM, the more effect it\u0027ll have (within reason). I generally put mine behind the air intake.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I always understood that you place them like you would RCS blocks.\u003C/p\u003E\n"},{"CreatedByName":"SlimeCrusher","CreatedById":105427,"CreatedDateTime":"2014-10-09T17:33:54Z","Content":"\n\u003Cp\u003EAs far as i know you can place reaction wheels anywhere and they\u0027ll give you the same torque, it doesn\u0027t matter if its 5cm or 5m away from the COM, it will always give the same torque. So yea.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-10-10T00:21:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Beachernaut\u0022 data-cite=\u0022Beachernaut\u0022\u003E\u003Cdiv\u003ECan\u0027t remember if it\u0027s true in KSP or not, but the further the reaction wheel is from COM, the more effect it\u0027ll have (within reason). I generally put mine behind the air intake.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis is a common misconception that is not true. As Lethal Dose and SlimeCrusher (and others) said above, you can place the torque modules anywhere and the effect the torque has on the ship is the same (regardless of distance to the CoM).\u003C/p\u003E\u003Cp\u003EThe difference will come in if you put a lot of torque out away from the CoM on wobbly parts. Then the ship may have a tendency to tear itself apart. Although this has more to do with wobbly parts than torque.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-10-10T00:33:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe difference will come in if you put a lot of torque out away from the CoM on wobbly parts. Then the ship may have a tendency to tear itself apart. Although this has more to do with wobbly parts than torque.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, it\u0027s all about the torque, not my bad ship design. Stupid torque!\u003C/p\u003E\n"},{"CreatedByName":"MockKnizzle","CreatedById":59616,"CreatedDateTime":"2014-10-10T00:45:18Z","Content":"\n\u003Cp\u003EAs anyone who has taken some basic physics or statics will know, the location of an applied torque on a rigid body doesn\u0027t matter in the slightest. However, as ships in KSP are collections of elastically-connected rigid bodies, putting your reaction wheels on the ends of long, bendy bits can lead to wobbly-spaghetti syndrome.\u003C/p\u003E\u003Cp\u003EAs long as your craft is well-strutted, you cans stick your reaction wheels anywhere.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-10T01:46:28Z","Content":"\n\u003Cp\u003ELocation doesn\u0027t matter for torque wheel effectiveness, so I place them as part of making wet and dry centers of mass as close together as possible on spaceplanes.\u003C/p\u003E\n"}]}