{"TopicId":86736,"ForumId":16,"TopicTitle":"Splitting long burn on maneuver node","CreatedByName":"Thanny","CreatedById":110623,"CreatedDateTime":"2014-10-10T01:27:38Z","PageNum":1,"Articles":[{"CreatedByName":"Thanny","CreatedById":110623,"CreatedDateTime":"2014-10-10T01:27:38Z","Content":"\n\u003Cp\u003ESo the maneuver nodes work on the premise that you\u0027re velocity is changing instantaneously. Hence the advice to straddle the node, doing half the burn before, half after.\u003C/p\u003E\u003Cp\u003EBut half of what? Half of the total burn time, or half of the delta V? For a long burn, those will be two notably different answers, as the acceleration is higher near the end of the burn than near the beginning, on account of fuel mass being reduced.\u003C/p\u003E\u003Cp\u003EAs an example, consider a 350 tonne ship that needs to do a 2500m/s burn using twenty nuclear engines (thrust = 1200kN, Isp = 800s). The total time of that burn will be 624.53 seconds, making the time midpoint 312.27 seconds. However, the delta V will reach the halfway point of 1250m/s at 337.06s into the burn.\u003C/p\u003E\u003Cp\u003ESo which do you think would provide the least deviation from the intended maneuver node result, starting the burn at -05:12 or at -05:37?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-10T19:20:50Z\u0022 title=\u002210/10/2014 07:20  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 10, 2014\u003C/time\u003E by Thanny\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mckamx","CreatedById":116032,"CreatedDateTime":"2014-10-10T01:30:54Z","Content":"\n\u003Cp\u003EMy thinking, which MechJeb seems to agree with, is to split the delta-V.\u003C/p\u003E\n"},{"CreatedByName":"Jimbimbibble","CreatedById":77859,"CreatedDateTime":"2014-10-10T01:35:17Z","Content":"\n\u003Cp\u003EIt would be a better approximation to split the dV, but the analytical solution is pretty complex. Either way, you\u0027re going to be making correction burns.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-10T01:40:53Z","Content":"\n\u003Cp\u003ESplit the delta-V\u002B\u002B.\u003C/p\u003E\u003Cp\u003EFor short burns it doesn\u0027t really matter much, but for long ones like the example given splitting the dV gives a better approximation. A ten minute burn like that might be better split into two or more separate burns depending on the initial orbit, as well.\u003C/p\u003E\n"}]}