{"TopicId":88480,"ForumId":16,"TopicTitle":"Why does my spaceplane pitch up when it nears the ground?","CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-10-25T17:13:13Z","PageNum":1,"Articles":[{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-10-25T17:13:13Z","Content":"\n\u003Cp\u003EThis is my first attempt at making a SSTO spaceplane. It took me a fair few iterations to get the design right in order to achieve a 100km orbit with leftover fuel, but I finally got it working perfectly.\u003C/p\u003E\u003Cp\u003EHowever, the issue now lies in the landing sequence. Bear in mind that it\u0027s designed first and foremost as a shuttle, so I wasn\u0027t expecting fantastic aerodynamics in atmo.\u003C/p\u003E\u003Cp\u003EWhile approaching the runway, which is often powered to compensate for bad estimation of re-entry drag, I constantly have to pitch down slightly, but this is merely a minor annoyance no doubt caused by the center of lift being too far forward without the fuel.\u003C/p\u003E\u003Cp\u003EBut as I\u0027m roughly ten seconds from touchdown, I\u0027m typically going just under 100m/s on a normal glide slope. In normal circumstances I would throttle down or idle the engines to glide to the runway, but as I do this, my plane just lurches upwards. If I didn\u0027t hold pitch down, it would probably just point straight up and stall if not flip over. Then it comes back down, after losing about 50m/s, and typically crash. It\u0027s like it detects a drop in vertical speed below a threshold velocity and goes into panic mode to avoid a crash.\u003C/p\u003E\u003Cp\u003ENo matter how careful I am with my attitude and speed, it always performs this \u0022Oh .... the ground pull up pull up pull up\u0022 maneuver.\u003C/p\u003E\u003Cp\u003EI don\u0027t suppose anything in Mechjeb could be playing with it? I wasn\u0027t using Smart A.S.S. or spaceplane guidance, I even toggled off all utilities just to be sure. Hell I tried landing using Mechjeb and that was sure to crash it before it even reached the runway.\u003C/p\u003E\u003Cp\u003EThis is roughly the configuration during landing, with a bit of fuel left in the aft fuselage:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/kqfolaQ.jpg\u0022 alt=\u0022kqfolaQ.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-25T17:59:42Z\u0022 title=\u002210/25/2014 05:59  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 25, 2014\u003C/time\u003E by Bobe\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-25T17:19:25Z","Content":"\n\u003Cp\u003EWell, beginning with the obvious your CoL is ahead of your CoM, which means your plane will always tend to nose up rather than nose down. Not in itself the fatal problem, but if more fuel is carried in front of the CoM than behind then the problem will be aggravated as you burn it off due to the CoM moving rearwards.\u003C/p\u003E\u003Cp\u003ETry shifting that last bit of fuel to a tank nearer the front of the plane before you begin your final approach.\u003C/p\u003E\u003Cp\u003EAlso, are you familiar with engine gimble? This directs or vectors engine thrust within a range off the indicated CoT, which helps to steer the plane (or rocket). It\u0027s likely that your engines are helping to keep the nose down by thrusting slightly \u0027up\u0027, and when you cut power you\u0027re removing this force.\u003C/p\u003E\u003Cp\u003EEdit: On a second look at your SP, I see you don\u0027t have a huge amount of aerodynamic control surface anywhere except a bit on the trailing edge of the wings. This is also fairly close to the CoM so your pitch control isn\u0027t getting much of a fulcrum effect to hold the nose down. You could try adding canard surfaces (like the Eurofighter Typhoon etc) near the front of your plane, but be careful about shifting your CoL any further forward - you might need to rethink your wingplan.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-25T17:27:26Z\u0022 title=\u002210/25/2014 05:27  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 25, 2014\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-25T17:29:17Z","Content":"\n\u003Cp\u003EHm. Never heard of planes flipping out all of themselves. You\u0027re keeping it on the edge all the way down and I guess one of your last actions before touchdown makes you lose it entirely. Rapiers have a lot of gimbal; it might be this what allows you to keep the plane under control until you power down the engine.\u003C/p\u003E\u003Cp\u003EThe best idea I can come up with would be trimming your plane: Move fuel from the aft tank forward, for example.\u003C/p\u003E\u003Cp\u003ESecond best would be a redesign, with canards up front for example (more control), or making it so that the balance won\u0027t shift in the first place.\u003C/p\u003E\u003Cp\u003EEdit: ninja\u0027d on all counts.\u003C/p\u003E\n"},{"CreatedByName":"Bobe","CreatedById":95803,"CreatedDateTime":"2014-10-25T17:59:25Z","Content":"\n\u003Cp\u003EWelp, looks like it was just the center of lift. I removed those leading strakes such that the CoL and CoM are in the same position when the fuel is almost empty and it glides perfectly to a soft touchdown.\u003C/p\u003E\u003Cp\u003EI did have canards on an earlier version, but it got out of control and I had too many control surfaces working against each other, ultimately only adding more useless weight. I knew only having those four surfaces at the back would make atmospheric flight tricky, but I really don\u0027t need much maneuverability (though it does turn quite well with enough thrust).\u003C/p\u003E\u003Cp\u003EI didn\u0027t expect such a massive aerodynamic effect if the CoL was slightly off the CoM, usually it just means the attitude trim is off.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-25T18:10:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bobe\u0022 data-cite=\u0022Bobe\u0022\u003E\u003Cdiv\u003EI didn\u0027t expect such a massive aerodynamic effect if the CoL was slightly off the CoM, usually it just means the attitude trim is off.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirstly, glad you solved your problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ESecondly, the relationship between the CoL and CoM can be handled by the SAS even if it\u0027s much further out than yours was, but only if the SAS has enough torque to keep the nose from lifting. This torque can either come from the control surfaces, engine gimbal or from reaction wheels. In your case, you just didn\u0027t have enough torque for the SAS to stay in control without the contribution from the engine gimbal.\u003C/p\u003E\u003Cp\u003EThe good news is, removing those strakes is a much better engineering solution than simply adding more sources of pitch-torque. NASA would be proud \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-10-25T18:14:16Z\u0022 title=\u002210/25/2014 06:14  PM\u0022 data-short=\u00229 yr\u0022\u003EOctober 25, 2014\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tsotha","CreatedById":120361,"CreatedDateTime":"2014-10-27T20:38:48Z","Content":"\n\u003Cp\u003EI had a design exhibit this exact behavior. Ultimately the problem was fuel-related CoM changes that made the plane so back-heavy that slowing down would cause the nose to pitch up (and in my case, stay up). At launch it was barely flying. At landing... well, everything can land once.\u003C/p\u003E\n"},{"CreatedByName":"tsotha","CreatedById":120361,"CreatedDateTime":"2014-10-27T21:45:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022The_Rocketeer\u0022 data-cite=\u0022The_Rocketeer\u0022\u003E\u003Cdiv\u003EFirstly, glad you solved your problem \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003ESecondly, the relationship between the CoL and CoM can be handled by the SAS even if it\u0027s much further out than yours was, but only if the SAS has enough torque to keep the nose from lifting. This torque can either come from the control surfaces, engine gimbal or from reaction wheels. In your case, you just didn\u0027t have enough torque for the SAS to stay in control without the contribution from the engine gimbal.\u003C/p\u003E\u003Cp\u003EThe good news is, removing those strakes is a much better engineering solution than simply adding more sources of pitch-torque. NASA would be proud \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDo control surfaces have less influence at lower speeds? Seems like that\u0027s the way it should work to me, but I don\u0027t know if it\u0027s true IRL and even if so whether it\u0027s true in KSP.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-10-27T22:01:04Z","Content":"\n\u003Cp\u003EThe only problem with that craft is your CoL is ahead of your CoM. This is the cause of your issues as you figured out. And in KSP the speed doesn\u0027t have the same affect on the control surfaces as they would in real life. They maintain the same amount of force no matter the speed. Unless you have FAR or NEAR installed then things change drastically from stock and more towards reality.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-10-28T01:19:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022tsotha\u0022 data-cite=\u0022tsotha\u0022\u003E\u003Cdiv\u003EDo control surfaces have less influence at lower speeds? Seems like that\u0027s the way it should work to me, but I don\u0027t know if it\u0027s true IRL and even if so whether it\u0027s true in KSP.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAbsolutely true IRL. Think of a pinwheel/windmill - the faster the wind blows, the faster the wheel turns. The same thing is what happens to the plane.\u003C/p\u003E\u003Cp\u003EHowever, without spending time researching the mathematics, I couldn\u0027t say whether the aero physics of KSP include this feature in any way. For certain, the effect of reaction wheel/cockpit torque means that you tend to get a better steering response than should be physically possible at low airspeeds, but then KSP flight physics are pretty cartoony anyway. It\u0027s also true that above a certain speed you start to lose steering power anyway, due to the plane\u0027s tendency to fly straight on rather than change direction - again, physics...\u003C/p\u003E\u003Cp\u003EThere are doubtless better informed people than me for fuller answers - the creators of the NEAR and FAR mods probably know a lot more about stock physics if you\u0027re keen to know more.\u003C/p\u003E\n"},{"CreatedByName":"herbal space program","CreatedById":112590,"CreatedDateTime":"2014-10-29T21:28:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bobe\u0022 data-cite=\u0022Bobe\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI didn\u0027t expect such a massive aerodynamic effect if the CoL was slightly off the CoM, usually it just means the attitude trim is off.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my experience, is the COL ball is far enough forward that it\u0027s central axis is no longer inside or tangent to the COM ball, I have trouble. I\u0027ve actually had planes with a fair bit more control authority than yours looks like it has flip out with the COL that far in front. Another thing you might try, btw, would be to put an inline cockpit further back, towards the COM. That way its reaction wheel torque will be much more effective in keeping your plane steady.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-10-29T21:44:58Z","Content":"\n\u003Cp\u003EControl surfaces are definitely less effective at lower speeds, even in stock aero.\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-10-29T22:44:22Z","Content":"\n\u003Cp\u003EThe thrust of the engines can keep the plane going in one direction to some degree if the CoM moves back. Also the wings keep the plane going straight unless you slow down and then they have less effect.\u003C/p\u003E\n"},{"CreatedByName":"BagelRabbit","CreatedById":95028,"CreatedDateTime":"2014-10-30T17:44:17Z","Content":"\n\u003Cp\u003EHere\u0027s what\u0027s happening. (I see that this is labelled \u0022Answered!\u0022 but I haven\u0027t seen the [likely] correct answer yet.)\u003C/p\u003E\u003Cp\u003EA plane is unstable when the CoM is in front of the CoL. It\u0027s as simple as that. Imagine trying to throw a paper plane, the wrong end first. As the plane is thrown, it wants to fly nose-first, which causes it to pitch up \u003Cem\u003Eor down\u003C/em\u003E until the plane is pointed correctly, at which point it will fly fine.\u003C/p\u003E\u003Cp\u003EEffectively, placing the CoL in front of the CoM causes a plane to want to fly backwards, like throwing a paper plane with the wrong end forwards. When you\u0027re coming in for a landing, you\u0027re likely pitching up to lessen your vertical velocity. The plane wants to flip upwards... but it doesn\u0027t, yet. This is because of a combination of the capsule torque, control surfaces in the back, and the RAPIER engines\u0027 gimballing.\u003C/p\u003E\u003Cp\u003EOnce the airspeed over those control surfaces drops and you throttle down the engines, though, you\u0027re in deep trouble. The plane decides to try to fly backwards, and so it pitches up. If you were to do nothing at this point, the nose would eventually come to rest by the retrograde marker. The plane is now stable, but sadly, aerodynamics in KSP make the wings lose lift at this point. You would crash.\u003C/p\u003E\u003Cp\u003EHowever, you try to get the nose down. As the plane continues trying to fly with such a high angle-of-attack, the speed drops, the wings lose lift, the plane begins heading down and... bang.\u003C/p\u003E\u003Cp\u003EYou don\u0027t need more control surfaces (especially canards near the front, as that would just make the plane more unstable), you don\u0027t need more gimbal (or less gimbal, for that matter), you just need the CoL behind the CoM at all phases of the flight. If this is so, the plane will do fine.\u003C/p\u003E\u003Cp\u003EBy the way, I\u0027m going to recommend what I always do for new SSTO designers: Create an action group that toggles all of those intakes. It will reduce your drag tremendously in the upper atmosphere and stop any asymmetric flameouts from occurring. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}