{"TopicId":89837,"ForumId":16,"TopicTitle":"Rover reversed controls on the Mun? (0.25 Linux)","CreatedByName":"fommil","CreatedById":112495,"CreatedDateTime":"2014-11-09T15:27:01Z","PageNum":1,"Articles":[{"CreatedByName":"fommil","CreatedById":112495,"CreatedDateTime":"2014-11-09T15:27:01Z","Content":"\n\u003Cp\u003EHi all,\u003C/p\u003E\u003Cp\u003EI built my first rover and tested it out on Kerbin and everything worked great.\u003C/p\u003E\u003Cp\u003EHowever, when I delivered it to the Mun[1], the steering controls were reversed! i.e. rolling left actually rolled right. The weird thing is that the animation showed the parts moving correctly in response to my joystick movements, so it felt like I\u0027d encountered a bug. Has anybody else seen this? Also, the landed navball was the wrong way round, when I was pointing East it was saying West. Increasing the throttle moved the rover in the same direction as it did on Kerbin.\u003C/p\u003E\u003Cp\u003E(The general control of the rover was much lower than on Kerbin, I suspect that is to be expected since the gravity is much lower.)\u003C/p\u003E\u003Cp\u003EAnother thing that bugged me was that when I built my rover for testing on Kerbin, I was able to place the autonomous command module *inside* the rover casing. But when I was building the rover as part of a larger structure, I was only able to place the command module outside (i.e. on top of) the casing. Is that normal? Is there any way to get it to go inside? It gives me more space to place instruments if the command module goes outside.\u003C/p\u003E\u003Cp\u003EI\u0027m happy to share parts files if it helps anybody answer the above.\u003C/p\u003E\u003Cp\u003EIt was a lot of fun driving the rover on the Mun :-D\u003C/p\u003E\u003Cp\u003EBest regards,\u003C/p\u003E\u003Cp\u003ESam\u003C/p\u003E\u003Cp\u003E[1]: I put it on the underside of a very small lander that had radial monopropellant engines, big legs and a junior stack decoupler, allowing a safe delivery on touchdown)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-11T20:31:50Z\u0022 title=\u002211/11/2014 08:31  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 11, 2014\u003C/time\u003E by fommil\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-11-09T17:27:10Z","Content":"\n\u003Cp\u003EA .craft file or some pictures would help out.\u003C/p\u003E\u003Cp\u003EHowever, I\u0027m going to guess that what you\u0027re running into with the reversed controls is due to control part orientation (based on your later complaint about attaching parts). When you separate a smaller vehicle from a larger one, your steering orientation can get transferred to a pod or probe core that you didn\u0027t expect. You can right-click on the correct probe core/pod/docking port and select \u0022control from here.\u0022 That might fix your steering orientation problem. That\u0027s assuming the part was oriented the correct way when you built it.\u003C/p\u003E\u003Cp\u003EAs for when you\u0027re building things, many people will build their rovers as a sub-assembly. Then stick it onto your rocket when you\u0027re all ready to go (that makes it easier to test before hand). To do that, you have to build off of some other root part first such as a cubic strut. The sub assembly tab does not let you drop an entire craft on it. Unfortunately, because of the tree-like nature of KSP\u0027s craft, sometimes when building things this way you are limited in how you can attach things when building \u0022backwards.\u0022 This should be significantly easier in v0.26/0.90 (since they are reworking the editors), but that doesn\u0027t help you much now...\u003C/p\u003E\u003Cp\u003EIt\u0027ll be easier to give specific advice if you can supply at least a picture.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-11-09T17:44:00Z","Content":"\n\u003Cp\u003EControl orientation seconded here. For rovers \u0027forward\u0027 should be towards the horizon so if the navball isn\u0027t pointing that way your control-pod or -probe needs to be turned around. Claw did all the rest anyway.\u003C/p\u003E\n"},{"CreatedByName":"fommil","CreatedById":112495,"CreatedDateTime":"2014-11-09T18:41:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EA .craft file or some pictures would help out.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ve uploaded my craft to here: \u003Ca href=\u0022http://www.filedropper.com/lunar-rover\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/lunar-rover\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ve never used filedropper before, but I was able to download and md5 matched my upload, so I have some trust in it.\u003C/p\u003E\u003Cp\u003EI use quite a few mods, such as deadly reentry, ferram and various science component additions. On my setup, I\u0027m able to fly to the Mun with this design no problem. I go to the radial monopropellant as late as I can to conserve fuel. It\u0027s probably way over specced because everything below the rover was designed to take an Apollo style Kerbal to the Mun, deploy, rendezvous, and back (and succeeded, which was utterly awesome).\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EHowever, I\u0027m going to guess that what you\u0027re running into with the reversed controls is due to control part orientation (based on your later complaint about attaching parts). When you separate a smaller vehicle from a larger one, your steering orientation can get transferred to a pod or probe core that you didn\u0027t expect. You can right-click on the correct probe core/pod/docking port and select \u0022control from here.\u0022 That might fix your steering orientation problem. That\u0027s assuming the part was oriented the correct way when you built it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think I know what you mean --- I\u0027ve encountered a similar problem before when attaching sub-vehicles via docking ports (especially when their control room is upside-down with respect to the main launch vehicle\u0027s controller). It would be a real pain to have to select the correct control room on the launch pad.\u003C/p\u003E\u003Cp\u003EBut in this instance you\u0027ll see I only have the one (autonomous) control room so that is not a problem. If you delete everything below the rover itself and deploy on the launchpad, the controls are as expected.\u003C/p\u003E\u003Cp\u003ERe: placing the octo inside the rover, I look forward to 0.26 as that might allow me to do this!\u003C/p\u003E\u003Cp\u003EThanks for looking at this.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-11-09T19:52:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022fommil\u0022 data-cite=\u0022fommil\u0022\u003E\u003Cdiv\u003EI\u0027ve uploaded my craft to here: \u003Ca href=\u0022http://www.filedropper.com/lunar-rover\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.filedropper.com/lunar-rover\u003C/a\u003E\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EI use quite a few mods, such as deadly reentry, ferram and various science component additions.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for uploading. Unfortunately if we don\u0027t know what all doodads you have attached to that craft, it\u0027s not going to open. If you\u0027re using mods, your next best bet is to load up a few pictures (to some place like imgur.com, which doesn\u0027t require an account). Then post the link here.\u003C/p\u003E\u003Cp\u003EIf you\u0027re unfamiliar with dealing with screenshots in KSP, you can check this post: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92230-Stock-Support-Bug-Reporting-Guide?p=1380977\u0026amp;viewfull=1#post1380977\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/92230-Stock-Support-Bug-Reporting-Guide?p=1380977\u0026amp;viewfull=1#post1380977\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESpecifically look for the spoiler that says \u0022screenshots.\u0022\u003C/p\u003E\u003Cp\u003E(Sorry for the back and forth...)\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"fommil","CreatedById":112495,"CreatedDateTime":"2014-11-09T20:03:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EThanks for uploading. Unfortunately if we don\u0027t know what all doodads you have attached to that craft, it\u0027s not going to open. If you\u0027re using mods, your next best bet is to load up a few pictures (to some place like imgur.com, which doesn\u0027t require an account). Then post the link here.\u003Cp\u003EIf you\u0027re unfamiliar with dealing with screenshots in KSP, you can check this post: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/92230-Stock-Support-Bug-Reporting-Guide?p=1380977\u0026amp;viewfull=1#post1380977\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/92230-Stock-Support-Bug-Reporting-Guide?p=1380977\u0026amp;viewfull=1#post1380977\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESpecifically look for the spoiler that says \u0022screenshots.\u0022\u003C/p\u003E\u003Cp\u003E(Sorry for the back and forth...)\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECan you see this \u003Ca href=\u0022https://lh6.googleusercontent.com/-gEta6iMxIFE/VF6yEelvMoI/AAAAAAAAiWo/TcdzJas9el4/w1565-h879-no/rover-deployment.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://lh6.googleusercontent.com/-gEta6iMxIFE/VF6yEelvMoI/AAAAAAAAiWo/TcdzJas9el4/w1565-h879-no/rover-deployment.jpg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a bit of an early draft of the same design: the one I flew had actual side mounted monopropellant engines and a smaller decoupler.\u003C/p\u003E\n"},{"CreatedByName":"Brainlord Mesomorph","CreatedById":110905,"CreatedDateTime":"2014-11-10T11:20:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pecan\u0022 data-cite=\u0022Pecan\u0022\u003E\u003Cdiv\u003EControl orientation seconded here. For rovers \u0027forward\u0027 should be towards the horizon so if the navball isn\u0027t pointing that way your control-pod or -probe needs to be turned around. Claw did all the rest anyway.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI add a probe core to the front of the rover and use \u0022Control from here\u0022 to fix the NavBall\u003C/p\u003E\u003Cp\u003Eand I just figured this out about my first rover:\u003C/p\u003E\u003Cp\u003EIn low-G the SAS torque was greater than the wheel torque . If the controls are in \u0022staging\u0022 mode, pressing \u0022W\u0022 to move forward also makes the SAS pitch down.\u003C/p\u003E\u003Cp\u003EMake sure you are in Docking mode controls, and even then, not in rotation mode, but translation mode.\u003C/p\u003E\u003Cp\u003EWas that it?\u003C/p\u003E\n"},{"CreatedByName":"Padishar","CreatedById":97386,"CreatedDateTime":"2014-11-10T12:21:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022brainlordmesomorph\u0022 data-cite=\u0022brainlordmesomorph\u0022\u003E\u003Cdiv\u003EIn low-G the SAS torque was greater than the wheel torque . If the controls are in \u0022staging\u0022 mode, pressing \u0022W\u0022 to move forward also makes the SAS pitch down.\u003Cp\u003EMake sure you are in Docking mode controls, and even then, not in rotation mode, but translation mode.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA better way (in my opinion) is to set up the rover driving controls separate to the rotation and RCS translation controls (I use the cursor keys for rover driving). Then you don\u0027t get any unwanted forces from your reaction wheels or RCS while driving and can still use them in an emergency, i.e. when you go flying over the top of a crater rim and need to rotate to ensure, or at least increase the likelihood of, a safe landing...\u003C/p\u003E\n"},{"CreatedByName":"DrMonte","CreatedById":90841,"CreatedDateTime":"2014-11-10T13:06:56Z","Content":"\n\u003Cp\u003EWhat I might suspect related to driving:\u003C/p\u003E\u003Cp\u003EForces of SAS rotation might be much higher than forces of the wheels steering. That is why your wheels rotates to the correct side but the rover to the other.\u003C/p\u003E\u003Cp\u003ELocal solution would be to use tweak-able and invert steering on wheels. Those having inverted steering everywhere.\u003C/p\u003E\u003Cp\u003EOtherwise redesign in SHP is required. Simply placed command module points to the sky, those not very helpful for the rover.\u003C/p\u003E\n"}]}