{"TopicId":90281,"ForumId":16,"TopicTitle":"How do I solve this build issue?","CreatedByName":"Rus-Evo","CreatedById":107004,"CreatedDateTime":"2014-11-14T17:51:22Z","PageNum":1,"Articles":[{"CreatedByName":"Rus-Evo","CreatedById":107004,"CreatedDateTime":"2014-11-14T17:51:22Z","Content":"\n\u003Cp\u003EHi Guys, \u003C/p\u003E\u003Cp\u003EI am currently trying to build a heavy transport jet which is designed to have wheeled cargo pods roll on and roll off (as part of a silly big challenge I set myself).\u003C/p\u003E\u003Cp\u003EThe jet is problematic and will do a redesign but I needed to do a proof of concept of the cargo transportation.\u003C/p\u003E\u003Cp\u003EWhat I did was to build a jet that had a loading ramp that could be driven on to. \u003C/p\u003E\u003Cp\u003EThe cargo pod has a grappler (stock) up front.\u003C/p\u003E\u003Cp\u003EI drive on to it no problems\u003C/p\u003E\u003Cp\u003EIt attaches to the front of the cargo area just like I wanted and THEN!!!!!!\u003C/p\u003E\u003Cp\u003EUpon creating one new craft the cargo literally falls through the floor attached only by the grappler!!!\u003C/p\u003E\u003Cp\u003EIts like the physics change when its one vehicle.\u003C/p\u003E\u003Cp\u003EDoes anyone have some tips on how to make this work? My master plan will have big problems if I cant operate a roll-on roll off system of cargo moving!!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022\u0022 alt=\u0022\u0026lt;a  href=\u0022\u003E\u003Cimg src=\u0022%7Boption%7D\u0022 class=\u0022ipsImage\u0022 alt=\u0022%7Boption%7D\u0022\u003Ehttp://i2.photobucket.com/albums/y32/RusEvo/2014-11-14_00001_zps26ef5085.jpg\u0027 alt=\u00272014-11-14_00001_zps26ef5085.jpg\u0027\u0026gt;\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-11-14T18:08:48Z","Content":"\n\u003Cp\u003EHmm......this is a tough one. May I ask what kind of setup you have for your stock grappler?\u003C/p\u003E\u003Cp\u003EI might suggest a series of docking ports for the plane - one forward, one on each side, and one on the ramp - with corresponding ports on the vehicles. You\u0027d have to drive the vehicle in such a way that all four ports connected simultaneously, and it\u0027d have to be set up so that the vehicle\u0027s mass doesn\u0027t shift the plane\u0027s CoM too far aft (or you\u0027ll wind up with an uncontrollable plane). Best I can come up with for a stock option.\u003C/p\u003E\u003Cp\u003ETo make this idea as realistic as possible, I might suggest you install KAS, if you\u0027re not adverse to mods.\u003C/p\u003E\n"},{"CreatedByName":"Rus-Evo","CreatedById":107004,"CreatedDateTime":"2014-11-14T18:17:28Z","Content":"\n\u003Cp\u003EI am adverse to mods!! But maybe it cant be done without it.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cp\u003EAs I sit here thinking I wonder if I could mount 2 grapplers in a plane, arm them, and then lower the plane by retracting some gear. The issue with that is whether both grapplers would register as attached!!\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-11-14T19:03:29Z","Content":"\n\u003Cp\u003ETo know for sure, I need to re-ask the question: what kind of setup do you have for your stock grappler?\u003C/p\u003E\n"},{"CreatedByName":"Rus-Evo","CreatedById":107004,"CreatedDateTime":"2014-11-14T20:11:59Z","Content":"\n\u003Cp\u003EI am not sure. All I did was arm it. I don\u0027t imagine it would make a difference if I locked the gimbal (though I would have before take off).\u003C/p\u003E\u003Cp\u003EAre there further set up options?\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-11-14T20:32:27Z","Content":"\n\u003Cp\u003ESeriously respect projects like this. After the \u0027rocket-to-the-moon\u0027 side of KSP, making your own challenges and overcoming them is what I think the game is really about.\u003C/p\u003E\u003Cp\u003EYour problem is single crafts do not collide with themselves (hence why clipping parts don\u0027t explode under normal circumstances), and using the grappler changes the two separate objects into one new craft, the same as docking.\u003C/p\u003E\u003Cp\u003EI\u0027m also aware of glitching problems when two grapplers are attached, i.e. deployed, on one ship:\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/videoseries?list=UU8DIKwGU8wFZfk3Xi3-zcrQ\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EWithout using a mod like KAS, your only real option may be using multiple docking ports, as capi suggested.\u003C/p\u003E\u003Cp\u003ESomething worth trying though, would be to have the grappler grab the heaviest part of your rolling vehicle radially, in this case the Jumbo tank from the top, bottom or side. That should reduce the \u0027bendiness\u0027 of the cargo overall and could solve your problem.\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-11-14T20:44:46Z","Content":"\n\u003Cp\u003EA craft in general will not collide with itself. Expecting the floor of your cargo bay to take the weight is thus doomed to fail. The claw isn\u0027t up to the job of holding that big orange tank by the end, it droops down as you see.\u003C/p\u003E\u003Cp\u003EUsing multiple claws is extremely prone to bugs, I don\u0027t advise it.\u003C/p\u003E\u003Cp\u003EYou could try mounting a docking port on the floor of the cargo bay, and another on the belly of the payload well-aligned with its centre of mass. Line them up then retract the payload\u0027s landing gear to allow it to drop and dock in place.\u003C/p\u003E\u003Cp\u003EOr have a look at Overfloater\u0027s AstroLiner range, he does cargo spaceplanes a \u003Cem\u003Elot\u003C/em\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Rus-Evo","CreatedById":107004,"CreatedDateTime":"2014-11-14T20:50:06Z","Content":"\n\u003Cp\u003EI think you guys have confirmed my fears and the direction of solution. \u003C/p\u003E\u003Cp\u003EWith some experimentation the grand airlift to the inland ksc will be feasible!\u003C/p\u003E\u003Cp\u003EThanks\u003C/p\u003E\n"},{"CreatedByName":"Stratzenblitz75","CreatedById":108287,"CreatedDateTime":"2014-11-14T21:14:11Z","Content":"\n\u003Cp\u003EI \u003Ca href=\u0022http://imgur.com/a/cRtj6#0\u0022 rel=\u0022external nofollow\u0022\u003Ebuilt these\u003C/a\u003E a while ago that are designed around the idea of grabbing cargo with a Klaw. The trick is to have the Klaw grab the cargo from above, rather than the side. To do this, set up your landing gear so that when you lower them, the Klaw grabs the cargo.\u003C/p\u003E\u003Cp\u003EAlso, I don\u0027t recommend using regular docking ports. They are way too flimsy for heavy cargo; the Klaw is way stronger and makes a much more rigid connection. Don\u0027t use multiple klaws either, they are buggy and one klaw is enough to lift all the cargo you need anyways.\u003C/p\u003E\u003Cp\u003EIf you\u0027re not against mods, another solution I\u0027ve found to work quite well is to use a KAS winch to raise your cargo after it sinks through the floor. The only disadvantage to this is that you need Kerbal to set it up.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-14T21:19:30Z\u0022 title=\u002211/14/2014 09:19  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 14, 2014\u003C/time\u003E by Stratzenblitz75\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-11-14T21:18:00Z","Content":"\n\u003Cp\u003EThe easiest thing to do is to just attach struts to the rear of the cargo load that you have there so it is supported at the back. Otherwise it will fall through and or wobble everywhere making the craft nearly impossible to control.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-11-14T21:40:18Z","Content":"\n\u003Cp\u003E...so, I feel kinda stupid at the moment. I\u0027d had forgotten about the existence of the Advanced Grabbing Unit and it didn\u0027t register that it was the \u0022grappler\u0022 you were talking about.\u003C/p\u003E\u003Cp\u003EI still stick to my advice about the docking ports; they\u0027re probably going to be your best bet for what you want to do in stock. As far the overall design of the plane itself is concerned, I might suggest you take a look at DocMoriarty\u0027s \u003Ca href=\u0022http://www.curse.com/ksp-mods/kerbal/223333-ksp-space-plane-construction-and-operation\u0022 rel=\u0022external nofollow\u0022\u003EKSP Space Plane Construction and Operation\u003C/a\u003E Guide; it\u0027s a discussion of transporter spaceplanes and VTOLs in the stock game with stock aero. It\u0027s definitely helped me out with my own spaceplane-as-launch-vehicle exploits. Definitely some principles there that could be applied to what you\u0027re wanting to do.\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-11-15T02:57:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rus-Evo\u0022 data-cite=\u0022Rus-Evo\u0022\u003E\u003Cdiv\u003EI am adverse to mods!! But maybe it cant be done without it.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis particular post may not be the most helpful, but I recall that there might be a way to do this. Normally parts on the same ship will clip through each other when bending. However, I believe there is a part (or maybe a couple parts) that will support pieces of the same ship.\u003C/p\u003E\u003Cp\u003EI think it might be in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43086-Open-Source-Construction-Techniques-for-Craft-Aesthetics\u0022 rel=\u0022external nofollow\u0022\u003Estock construction thread somewhere\u003C/a\u003E, but I can\u0027t remember. It might also be in the challenge somewhere that was for a fully reusable space program, where you had to take a returned SSTO, refuel it, reload cargo, and launch it again without using the VAB/SPH.\u003C/p\u003E\u003Cp\u003E I will try to dig around and see where this was from, but I do think it\u0027s possible. I remember it being a piece like a round fuselage section or something like a roller. That being said, your craft will probably be more stable using multiple docking ports as has been suggested.\u003C/p\u003E\u003Cp\u003EGood luck,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-15T03:05:53Z\u0022 title=\u002211/15/2014 03:05  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 15, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"MarvinKitFox","CreatedById":99545,"CreatedDateTime":"2014-11-15T11:30:13Z","Content":"\n\u003Cp\u003EI can think of 4 possibilities:\u003C/p\u003E\u003Cp\u003E1) Mount the grappler pointing up, directly above your cargo\u0027s CoM. Let it *hang*.\u003C/p\u003E\u003Cp\u003E2) Multiple docking ports. If all are aligned, then can all attach. Hint: have the decoupling on an action group.\u003C/p\u003E\u003Cp\u003E3) do NOT join the cargo\u002Bplane into one entity. Physically restrain it with suitable parts. Landing legs work just fine. Caveat: this flies fine, but do *not* timewarp. The cargo will simply phase through its restraints, and then through your plane. Timewarping like this is a very... intriguing way of launching your cargo once on orbit though!\u003C/p\u003E\u003Cp\u003Eor, do it right.\u003C/p\u003E\u003Cp\u003E4) Use KAS\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rus-Evo\u0022 data-cite=\u0022Rus-Evo\u0022\u003E\u003Cdiv\u003EI am adverse to mods!! But maybe it cant be done without it.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cp\u003EAs I sit here thinking I wonder if I could mount 2 grapplers in a plane, arm them, and then lower the plane by retracting some gear. The issue with that is whether both grapplers would register as attached!!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENope, sorry.\u003C/p\u003E\u003Cp\u003EA grappler will only attach to *another* object. As soon as the first one links, the second is trying to join to itself and fails. (it goes through the motions, but no actual link is formed)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-15T11:33:16Z\u0022 title=\u002211/15/2014 11:33  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 15, 2014\u003C/time\u003E by MarvinKitFox\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Yakky","CreatedById":94432,"CreatedDateTime":"2014-11-15T16:46:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022cantab\u0022 data-cite=\u0022cantab\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou could try mounting a docking port on the floor of the cargo bay, and another on the belly of the payload well-aligned with its centre of mass. Line them up then retract the payload\u0027s landing gear to allow it to drop and dock in place.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnother option is to have the docking port overhead near the middle of the cargo and drive under it at close range. Either way, using a single docking port that is positioned to support the payload near its center of mass, rather than cantilevered at one end, is probably your best all-stock solution. Multiple docking ports are very, very tricky to line up simultaneously.\u003C/p\u003E\n"},{"CreatedByName":"Voculus","CreatedById":85437,"CreatedDateTime":"2014-11-15T18:08:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rus-Evo\u0022 data-cite=\u0022Rus-Evo\u0022\u003E\u003Cdiv\u003EI am adverse to mods!! But maybe it cant be done without it.\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003Cp\u003EAs I sit here thinking I wonder if I could mount 2 grapplers in a plane, arm them, and then lower the plane by retracting some gear. The issue with that is whether both grapplers would register as attached!!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my humble opinion, you\u0027re doing yourself a huge disservice, by shunning mods, particularly when there\u0027s one out there that will solve this problem you\u0027re having. \u003C/p\u003E\u003Cp\u003EIt\u0027s called Quantum Struts, and is a very low profile, easy to use mod. Slap two of them onto the free-hanging end of your rover/vehicle, and you\u0027re done. You don\u0027t have to turn them on, assign action groups, or anything. You simply dock your vehicle, and forget about your problems.\u003C/p\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-11-15T18:22:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Voculus\u0022 data-cite=\u0022Voculus\u0022\u003E\u003Cdiv\u003EIn my humble opinion, you\u0027re doing yourself a huge disservice, by shunning mods, particularly when there\u0027s one out there that will solve this problem you\u0027re having.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe stock game is hard partly because of it\u0027s forced limitations. Overcoming those is a game in itself. Using mods that solve problems like this could be viewed as cheating. After all, modifying config files in many games would be an out and out hack, let alone adding \u0027special\u0027 guns in a shooter (remember the Golden PP9?) or supercars in a racer.\u003C/p\u003E\u003Cp\u003EIt\u0027s not that I think all mods are cheating, but I am very selective about which mods I adopt because I don\u0027t want to play in cheatmode.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-15T18:25:11Z\u0022 title=\u002211/15/2014 06:25  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 15, 2014\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BudgetHedgehog﻿","CreatedById":104112,"CreatedDateTime":"2014-11-16T02:10:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003ETI think it might be in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43086-Open-Source-Construction-Techniques-for-Craft-Aesthetics\u0022 rel=\u0022external nofollow\u0022\u003Estock construction thread somewhere\u003C/a\u003E, but I can\u0027t remember.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43086-Open-Source-Construction-Techniques-for-Craft-Aesthetics?p=971974\u0026amp;viewfull=1#post971974\u0022 rel=\u0022external nofollow\u0022\u003EInline docking port.\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Wyre311","CreatedById":125446,"CreatedDateTime":"2014-11-16T02:37:05Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/96406-The-Arcadia-series-and-the-Zeus-Ships?highlight=Arcadia\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/96406-The-Arcadia-series-and-the-Zeus-Ships?highlight=Arcadia\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EMy Zeus can do it.. Tested and verified.. If you wish I can send pictures. PM me your email, download the mods mentioned in my thread and i will send the craft files to you.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-16T02:41:04Z\u0022 title=\u002211/16/2014 02:41  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 16, 2014\u003C/time\u003E by Wyre311\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-11-16T04:39:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022ObsessedWithKSP\u0022 data-cite=\u0022ObsessedWithKSP\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/43086-Open-Source-Construction-Techniques-for-Craft-Aesthetics?p=971974\u0026amp;viewfull=1#post971974\u0022 rel=\u0022external nofollow\u0022\u003EInline docking port.\u003C/a\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere you go. That\u0027s exactly what I was remembering. Thanks Obsessed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}