{"TopicId":90766,"ForumId":16,"TopicTitle":"Newbie Question about missions","CreatedByName":"Daeromont","CreatedById":129688,"CreatedDateTime":"2014-11-20T01:27:41Z","PageNum":1,"Articles":[{"CreatedByName":"Daeromont","CreatedById":129688,"CreatedDateTime":"2014-11-20T01:27:41Z","Content":"\n\u003Cp\u003EFolks;\u003C/p\u003E\u003Cp\u003EI am so sorry for bringing this up again...assuming its been asked a million times....but I am having problems with the search feature on the forum. My question is why I can\u0027t seem to finish many early missions. I\u0027m new to the game, obviously. But, even though I can see that I accomplished the \u0027requirements\u0027 to many missions while en-route, I find that they are \u0027incomplete\u0027 by the time I land. For example, I tested an engine 10,000 meters. It showed green...and in fact, I had gone well beyond that. But, by the time I landed, obviously, I was no longer at 10,000 meters...and it showed \u0027incomplete.\u0027 I\u0027m sure this is an easy answer...but I was unable to figure it out or find anything in my search.\u003C/p\u003E\u003Cp\u003EThanks,\u003C/p\u003E\u003Cp\u003EDaeromont\u003C/p\u003E\n"},{"CreatedByName":"Specialist290","CreatedById":58489,"CreatedDateTime":"2014-11-20T01:48:46Z","Content":"\n\u003Cp\u003EWelcome to the forums! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m assuming you\u0027re having trouble with the \u0022Test [Part]\u0022 contracts specifically? The wording on those can be a little confusing. You have to \u003Cem\u003Eactivate\u003C/em\u003E the part in question when you meet all the conditions listed; if it\u0027s already active, then the game won\u0027t register the contract as completed.\u003C/p\u003E\n"},{"CreatedByName":"Daeromont","CreatedById":129688,"CreatedDateTime":"2014-11-20T01:52:14Z","Content":"\n\u003Cp\u003EThat is exactly what I am asking...and thanks. For clarification: If I am testing an engine at 10,000 meters, but obviously have to launch to get that far, I have to then \u0027start\u0027 (or activate, if I read your post correctly) the engine I am testing while at 10,000 meters? I think I get it now....but had no idea. Since the game was registering that I had tested it properly mid-flight, I got confused. And kept running out of money. I\u0027m playing Career mode.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-11-20T01:54:54Z","Content":"\n\u003Cp\u003ETo expand: you are required to DO xxx under certain conditions. You met the conditions but failed to DO xxx = you failed to fulfill the contract.\u003C/p\u003E\u003Cp\u003ENearly all parts tests either require you to \u0022test part\u0022 (right-click the part and select the \u0022run test\u0022 option) or \u0022activate by staging\u0022 (press spacebar to activate the part\u0027s stage) while the all the conditions are met.\u003C/p\u003E\u003Cp\u003EREAD the contracts to find out what you have to DO, not just what conditions you have to meet. DOING it is a whole other game, of course.\u003C/p\u003E\u003Cp\u003E(\u0022run test\u0022 is pretty easy, there are all sorts of tricks to \u0022staging\u0022 and many threads about them).\u003C/p\u003E\n"},{"CreatedByName":"Friend Bear","CreatedById":123301,"CreatedDateTime":"2014-11-20T02:04:17Z","Content":"\n\u003Cp\u003EThis is really simple to address. I know exactly the problem.\u003C/p\u003E\u003Cp\u003ELets say you want to test a specific engine at 10k altitude at 500mps.\u003C/p\u003E\u003Cp\u003EYou are using that engine to get to the desired alt/speed. Once there, all checks are full. But the problem is that you are using the engine! There are two ways around this...\u003C/p\u003E\u003Cp\u003E1) make it multistage. Once all checks are reached, activate the stage with the fresh engine.\u003C/p\u003E\u003Cp\u003E2) while in flight and at the desired place or immediately before reaching, open a new, empty stage below the already in use engine by clicking the \u0022\u002B\u0022 stage button and dragging as necessary to the bottom. Your stages will all remain the same except there will be the new blank one before the now, already active engine. Press space once you reached all parameters to \u0022activate\u0022 that stage. It will trick the computer into thinking you are now activating that engine, even though it is already working. \u003C/p\u003E\u003Cp\u003E\u0022using\u0022 or \u0022activating\u0022 the part is simply actuating its staging. This is not the same as with landing gear, where you need to right click them and \u0022test\u0022 them.\u003C/p\u003E\n"},{"CreatedByName":"Daeromont","CreatedById":129688,"CreatedDateTime":"2014-11-20T02:12:57Z","Content":"\n\u003Cp\u003EThat helps a lot...and thanks again. And interestingly, I was able to do much more complicated things before having this problem..I\u0027ve enjoyed some of the staging issues. I would only recommend that before going live, the clarification occurs in the text of the game. While it might be apparent to those who have played for awhile, I had absolutely no clue why my missions weren\u0027t working. I\u0027m a relatively intelligent guy. This post is not a complaint...just a suggestion.\u003C/p\u003E\u003Cp\u003Emakes perfect sense now...thanks.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-20T02:17:51Z\u0022 title=\u002211/20/2014 02:17  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 20, 2014\u003C/time\u003E by Specialist290\u003C/strong\u003E\n\u003Cbr\u003EMerging sequential posts\n\u003C/span\u003E\n"},{"CreatedByName":"Nahim","CreatedById":78568,"CreatedDateTime":"2014-11-20T02:55:03Z","Content":"\n\u003Cp\u003EI have the very same problems, both whit the right click \u0022test\u0022 feature and the forum search algoritm... when i need to locate some stuff at the forum i got myself forced to google it in order to find what im looking for...\u003C/p\u003E\n"}]}