{"TopicId":90835,"ForumId":16,"TopicTitle":"Control From Here breaks science? Bug?","CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2014-11-20T19:32:04Z","PageNum":1,"Articles":[{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2014-11-20T19:32:04Z","Content":"\n\u003Cp\u003EI just did a rescue mission with an empty 1 man command pod and an OKTO. While in orbit I ran some goo and science jr experiments. When I collected my kerbal I switched control to the command pod, landed, recovered, but got no science from the goo or science jr experiments. So I loaded up a save and switched control back to the OKTO, still no science. It seems that if you switch control, it loses any science that the former control unit had on board.\u003C/p\u003E\n"},{"CreatedByName":"StrandedonEarth","CreatedById":89439,"CreatedDateTime":"2014-11-20T19:44:10Z","Content":"\n\u003Cp\u003EDid you transmit the data? If so, then you already received the science before you recovered the ship. Did you recover the goo and science jr parts? Then you should have received the science. If you ditched the experiments before landing then you won\u0027t get the science unless you send a Kerbal EVA to collect the data (right-click the experiment and \u0022take data\u0022). The Kerbal can then store the data in the command pod for recovery\u003C/p\u003E\n"},{"CreatedByName":"mdkendall","CreatedById":114550,"CreatedDateTime":"2014-11-21T05:18:17Z","Content":"\n\u003Cp\u003EDid the goo and Science Jr. experiments survive the landing?\u003C/p\u003E\u003Cp\u003EIf your kerbal did not take the data out of the experiments then you should have got the science when you recovered them after landing. If they did not survive landing (or you jettisoned them before landing) the science was lost with them.\u003C/p\u003E\u003Cp\u003EIf your kerbal took the data out of the experiments the data would have been in the pod with him and you should have got the science when you recovered the pod after landing (assuming it survived).\u003C/p\u003E\u003Cp\u003EIf you transmitted the data at any stage you got the science at that point, and should have got no more later.\u003C/p\u003E\u003Cp\u003E\u0022Control from here\u0022 should have no effect on stored data or the science resulting from it.\u003C/p\u003E\n"},{"CreatedByName":"Oddible","CreatedById":74605,"CreatedDateTime":"2014-11-22T17:37:43Z","Content":"\n\u003Cp\u003EThe craft that landed had all of the science parts safely attached after landing. I did not transmit the data. The landed craft included both my OKTO and my pod. After testing, it was the Control From Here that made the science not automatically get picked up after landing (2 control units on the landed craft and changing control after collecting the experiments). Perhaps I could have gotten out and picked up the science manually out of the units.\u003C/p\u003E\n"}]}