{"TopicId":91328,"ForumId":16,"TopicTitle":"What is Optimal Orbit Transfer?","CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-11-26T20:35:58Z","PageNum":1,"Articles":[{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-11-26T20:35:58Z","Content":"\n\u003Cp\u003EI was wondering whether there is a difference in terms of deltaV between getting into circular orbit at altitude, A, above a perfectly spherical, atmosphere-less body by:\u003C/p\u003E\u003Cp\u003E(a) shooting straight up until apoapsis reaches altitude A, and then shooting straight sideways upon arriving at apoapsis with an instantaneous impulse burn\u003C/p\u003E\u003Cp\u003E(\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E blasting off and immediately turning straight sideways, until you end up in circular orbit at altitude A (angle will slowly decrease)\u003C/p\u003E\u003Cp\u003EI imagine they should be the same (assuming impulse burns). If they are the same, why is a \u0022gravity turn\u0022 in atmosphere more optimal than say a burn straight up to altitude, A, and then a sideways burn into orbit (assuming sideways burn is an instantaneous impulse burn)?\u003C/p\u003E\n"},{"CreatedByName":"worir4","CreatedById":75980,"CreatedDateTime":"2014-11-26T20:39:06Z","Content":"\n\u003Cp\u003EB is more efficient as you will be fighting gravity for less time. The negative acceleration of gravity will always pull you down the most if you are moving verticaly from the surface. By going side ways you can build up your horizontal velocity unaffected by gravity and then gain hight by raising appoapsis.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-11-26T20:52:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022worir4\u0022 data-cite=\u0022worir4\u0022\u003E\u003Cdiv\u003EB is more efficient as you will be fighting gravity for less time. The negative acceleration of gravity will always pull you down the most if you are moving verticaly from the surface. By going side ways you can build up your horizontal velocity unaffected by gravity and then gain hight by raising appoapsis.\u003C/div\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-11-26T21:04:30Z","Content":"\n\u003Cp\u003EI\u0027m thinking through this myself, and I think it comes back to the Oberth effect. Let\u0027s assume a constant gravity of 1 m/s^2*, a vehicle with a 1 kg mass, a target orbital altitude of 20 km, and a requisite orbital velocity of 500 m/s. You thus need gravitational potential energy (Eg = mgh) and kinetic energy (KE = 1/2 *mv^2). For this, you need 1kg*1m/s^2*20000m = 20,000 J of gravitational energy, and 1/2*1kg*(500 m/s)^2 = 125,000 J of kinetic energy.\u003C/p\u003E\u003Cp\u003E*Yes, technically it\u0027d decline a bit going from 0-20 km. The math is simpler this way.\u003C/p\u003E\u003Cp\u003ETo go straight up would require a burn such that KEup = Eg: 1/2*mv^2 = 20,000 J. The ascent burn would thus require 200 m/s, and circularization would require 500 m/s, for a total of 700 m/s for the up-then-sideways strategy.\u003C/p\u003E\u003Cp\u003EBut, remember our old friend Oberth. You get more energy the faster you\u0027re going. The total orbital energy we need is 125,000 J \u002B 20,000 J, thus 145,000 J. A perfect burn would thus be 1/2 mv^2 = 145000 J, with a requisite velocity of just 538.5 m/s. I think this would essentially mean an instantaneous burn, mostly sideways but a bit up, designed to put you into a 20km circular orbit. I would presume a horizontal burn designed to put you in a 20km x 0 km orbit, followed by a circularization on the other side, would be almost as efficient.\u003C/p\u003E\u003Cp\u003EEDIT: The Oberth effect would also neatly explain why prograde/retrograde is more efficient than radial burns for changing your orbit: prograde/retrograde are in your velocity vector, thus directly add or subtract to it, while a radial burn would describe a triangle, such that your final velocity change is less than that of (current velocity \u002B/- delta-V expenditure).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-26T21:11:58Z\u0022 title=\u002211/26/2014 09:11  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 26, 2014\u003C/time\u003E by Starman4308\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-11-26T21:07:29Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003Ehmmm. yes, i am doing calculations now. I\u0027ll post results soon.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo the results are in. For a Kerbin-like planet with mu = 3.532e12 m3/s2, R=600 km and A = 100 km:\u003C/p\u003E\u003Cp\u003E(a) Burning straight up requires 1297 m/s deltaV and circularizing requires 2246 m/s deltaV, thus totaling \u003Cstrong\u003E3543 m/s\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E(\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E Burning sideways into orbit at sea level requires 2426 m/s deltaV, raising apoapsis to altitude A by burning at periapsis requires only 91.59 m/s deltaV, and then raising periapsis to altitude A by burning at apoapsis requires only 88.12 m/s deltaV, thus totaling \u003Cstrong\u003E2606 m/s\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003EThe Equations used and solved in EES (Engineering Equation Solver):\u003C/p\u003E\u003Cp\u003E{!Constants \u0026amp; Givens}\u003C/p\u003E\u003Cp\u003ER=600e3 [m]\u003C/p\u003E\u003Cp\u003EA=100e3 [m]\u003C/p\u003E\u003Cp\u003Emu=3.532E\u002B12 [m^3/s^2]\u003C/p\u003E\u003Cp\u003E{!Approach (a)}\u003C/p\u003E\u003Cp\u003E{Orbital Velocity at Altitude A}\u003C/p\u003E\u003Cp\u003EV_orb^2= mu/(R\u002BA)\u003C/p\u003E\u003Cp\u003E{Launched Velocity Required to Reach Altitude A}\u003C/p\u003E\u003Cp\u003E1/2*V_up^2 = - mu/(R\u002BA) - (-mu/R)\u003C/p\u003E\u003Cp\u003E{Sum Total dV from Approach (a)}\u003C/p\u003E\u003Cp\u003EdV_total = V_up \u002B V_orb\u003C/p\u003E\u003Cp\u003E{!Approach (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E}\u003C/p\u003E\u003Cp\u003E{Circular Orbit at Sea Level}\u003C/p\u003E\u003Cp\u003EdV[0] = V[0]\u003C/p\u003E\u003Cp\u003EV[0]^2 = mu/R\u003C/p\u003E\u003Cp\u003E{Thrust at Periapsis to Raise Apoapsis to Altitude A}\u003C/p\u003E\u003Cp\u003EV[1] = V[0] \u002B dV[1]\u003C/p\u003E\u003Cp\u003EV[2]*(R\u002BA) = V[1]*R\u003C/p\u003E\u003Cp\u003E1/2*V[2]^2 - mu/(R\u002BA) = 1/2*V[1]^2 - mu/R\u003C/p\u003E\u003Cp\u003E{Thrust at Apoapsis to Raise Periapsis to Altitude A}\u003C/p\u003E\u003Cp\u003EV[3] = V[2] \u002B dV[2]\u003C/p\u003E\u003Cp\u003EV[3] = V_orb\u003C/p\u003E\u003Cp\u003E{Sum Total dV}\u003C/p\u003E\u003Cp\u003EdV_tot2 = dV[0]\u002BdV[1]\u002BdV[2]\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-11-26T21:23:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022worir4\u0022 data-cite=\u0022worir4\u0022\u003E\u003Cdiv\u003EB is more efficient as you will be fighting gravity for less time. The negative acceleration of gravity will always pull you down the most if you are moving verticaly from the surface. By going side ways you can build up your horizontal velocity unaffected by gravity and then gain hight by raising appoapsis.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI guess the answer boils down to the fact that there are two ways to gain altitude (1) by burning upwards (2) by going so fast horizontally that you get centripetal \u0022lift\u0022. Since the latter approach involves burning pro-grade the entire time, it therefore utilizes the oberth effect more effectively.\u003C/p\u003E\n"},{"CreatedByName":"LethalDose","CreatedById":92657,"CreatedDateTime":"2014-11-26T21:23:45Z","Content":"\n\u003Cp\u003EWhen you\u0027re in orbit, the most efficient way to raise your orbit is to burn prograde. Raising your orbit after launching from the surface isn\u0027t really different than doing the same thing *from* orbit. Any thrust spent using to fight gravity is a waste unless you\u0027re using it to get out of the atmosphere faster.\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2014-11-27T00:36:46Z","Content":"\n\u003Cp\u003EThere is a simple way to \u0022picture\u0022 this, almost literally:\u003C/p\u003E\u003Cp\u003EYou want to end-up in a more or less circular orbit.\u003C/p\u003E\u003Cp\u003EDo you draw a circle as a series of straight lines or as a curve?\u003C/p\u003E\u003Cp\u003EYou need to get from a (theoretical) centre-point to that circle.\u003C/p\u003E\u003Cp\u003EDo you draw a line up, then sideways all the way around, or draw a spiral from the start?\u003C/p\u003E\u003Cp\u003EGravity wants to pull you down/around the centre-point.\u003C/p\u003E\u003Cp\u003EDo you fight it all the way to keep a straight line or let it help you bend that line into the spiral that gives you (almost) the circular result you want?\u003C/p\u003E\u003Cp\u003ERemember - ORBIT is about sideways-speed, not altitude. It ain\u0027t rocket science (except it is).\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-11-27T01:05:24Z","Content":"\n\u003Cp\u003E\u0022B\u0022 would be clearly more efficient every time. \u003C/p\u003E\u003Cp\u003E On an airless body, an orbit is merely falling around the body so quickly that you miss it. Since you have no atmosphere, there are no drag losses. There are only gravity losses. Therefore your most efficient solution is to burn horizontal with only enough vertical component to equalize gravity until your centrifugal force is equal to the centripedal force of gravity.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-11-27T03:53:43Z","Content":"\n\u003Cp\u003EThere\u0027s a reason why the first approximation of a good ascent trajectory is \u0022go up 10 then at a 45 degree angle\u0022, that clears the worst of the atmosphere, then starts building speed sideways to turn it into a real orbit while still getting more height to let drag keep dropping.\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2014-11-27T05:52:32Z","Content":"\n\u003Cp\u003EWhen you launch smth on a low orbit, there\u0027s no much sense to split.\u003C/p\u003E\u003Cp\u003ELV \u0022Soyuz\u0022 stages burn without a pause and the 3rd stage stops right on the needed orbit.\u003C/p\u003E\u003Cp\u003EWhen you launch smth on a high orbit you usually need several trajectory corrections to do this precisely. So, you need a multiple ignitions engine, and have to create a special stage for it.\u003C/p\u003E\u003Cp\u003EAny LV you creating would be multi-purpose: to launch either smth big on a low orbit, or smth small, but requiring additional fuel, to far orbit.\u003C/p\u003E\u003Cp\u003ESo it\u0027s a good idea to design LV only for the first purpose and then to design an additional orbit thug.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2014-11-27T05:56:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kryxal\u0022 data-cite=\u0022Kryxal\u0022\u003E\u003Cdiv\u003EThere\u0027s a reason why the first approximation of a good ascent trajectory is \u0022go up 10 then at a 45 degree angle\u0022, that clears the worst of the atmosphere, then starts building speed sideways to turn it into a real orbit while still getting more height to let drag keep dropping.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESlight correction, that clears the worst of the Kerbin souposphere. If there is an atmosphere, it doesn\u0027t work that way which is why FAR/NEAR users turn almost immediately off the launchpad.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-11-27T05:57:06Z","Content":"\n\u003Cp\u003EI assume \u0022smth\u0022 means \u0022Something\u0022?\u003C/p\u003E\n"},{"CreatedByName":"kerbiloid","CreatedById":129408,"CreatedDateTime":"2014-11-27T05:59:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EI assume \u0022smth\u0022 means \u0022Something\u0022?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOf course. For example, a smith. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Empiro","CreatedById":112072,"CreatedDateTime":"2014-11-27T09:36:19Z","Content":"\n\u003Cp\u003EI think the difference has to do with the Oberth effect. There\u0027s no gravity drag when you have an instant change in velocity.\u003C/p\u003E\u003Cp\u003EArkle87\u0027s great post illustrates this: When accelerating vertically then horizontally, you\u0027re burning around 1300 m/s, waiting until your speed gets to 0, and then burning again. In the second case, you\u0027re burning more than 2500 m/s right away, giving yourself nearly 4 times the kinetic energy (since it\u0027s proportional to the square of the velocity) at just twice the delta-V. In addition, your second burn starts when you\u0027re still moving quickly giving you even more efficiency.\u003C/p\u003E\n"}]}