{"TopicId":91854,"ForumId":16,"TopicTitle":"Clamp-o-tron Sr. won\u0026#039;t dock","CreatedByName":"colin_in_space","CreatedById":118949,"CreatedDateTime":"2014-12-03T03:35:25Z","PageNum":1,"Articles":[{"CreatedByName":"colin_in_space","CreatedById":118949,"CreatedDateTime":"2014-12-03T03:35:25Z","Content":"\n\u003Cp\u003EI have been having intermittent problems with my clap-o-tron Sr.\u0027s. Sometimes they jsut won\u0027t dock, even at a nice, slow, precice approach. I have even tried machjeb autodock, and multiple ports on the target ship. It seems that redoing the launches fixes the problem, but I am not prepared to do that for my 6 part Extraplanatry 2000. \u003C/p\u003E\u003Cp\u003EHere is an example screenshot from an attempt today. No matter how precise I position myself I get no magnetic attachment at all, even with 0.1 m/s approach. And the active ship is not that heavy. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VCUS5fHl.png\u0022 alt=\u0022VCUS5fHl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAny suggests? Help apprecieated! Landing and relaunching this space plain will be a pain in the old posteriori.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-03T06:21:21Z\u0022 title=\u002212/03/2014 06:21  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 3, 2014\u003C/time\u003E by colin_in_space\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Leszek","CreatedById":119053,"CreatedDateTime":"2014-12-03T04:38:36Z","Content":"\n\u003Cp\u003EMake sure they aren\u0027t on backwards, when you first click on the part it is right side up. In the picture the one you can see looks fine, can\u0027t tell about the other one.\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2014-12-03T04:43:25Z","Content":"\n\u003Cp\u003Ecould you please post a screencap with the end faces clearly shown?\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-12-03T04:53:54Z","Content":"\n\u003Cp\u003EGood and bad news.\u003C/p\u003E\u003Cp\u003EAssuming your docking ports are indeed oriented the correct direction (Sr\u0027s are notorious for being backwards), then you\u0027re probably hitting a fairly common bug. Your ports look okay to me from the pictures, and it sounds like you\u0027ve been successfully docking in the past.\u003C/p\u003E\u003Cp\u003ESo the good news, there\u0027s a fix. The bad news, it requires some save file editing. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78863-FIX-Dock-Undocking-Bug-in-0-23-5\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/78863-FIX-Dock-Undocking-Bug-in-0-23-5\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s a daunting post at first, but it\u0027s pretty straight forward. Let me know if you have any questions.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"colin_in_space","CreatedById":118949,"CreatedDateTime":"2014-12-03T05:13:33Z","Content":"\n\u003Cp\u003EI guarantee they are on correctly. Triple checked. \u003C/p\u003E\u003Cp\u003ESpace Plane, in SPH for good lighting:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5UZbtF7.png?1\u0022 alt=\u00225UZbtF7.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003ECould the landing gears be clipping the docking post and causing a problem? \u003C/p\u003E\u003Cp\u003EAnd the port on the main ship\u0027s hydroponics bay (kourtesy of kolonization)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JHpowOt.png?1\u0022 alt=\u0022JHpowOt.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis port looks fine to me. Best guess is maybe the plane\u0027s port is messed by other parts too close. But I have had this docking issue a few times recently and it does not seem to be just bad ports, I think.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThanks Claw, I\u0027ll check into that!\u003C/p\u003E\n"},{"CreatedByName":"rodion","CreatedById":75111,"CreatedDateTime":"2014-12-03T05:17:44Z","Content":"\n\u003Cp\u003Ethe fact that parts are partially clipped into the docking port body of the smaller ship might be giving the game problems, but that\u0027s just a guess based on what i can see.\u003C/p\u003E\n"},{"CreatedByName":"RexKramer","CreatedById":76862,"CreatedDateTime":"2014-12-03T05:57:03Z","Content":"\n\u003Cp\u003EI\u0027ve had issues with docking ports with nearby/clipped parts. So, yes, the landing gear could be the issue.\u003C/p\u003E\n"},{"CreatedByName":"colin_in_space","CreatedById":118949,"CreatedDateTime":"2014-12-03T06:19:03Z","Content":"\n\u003Cp\u003EVictory! \u003C/p\u003E\u003Cp\u003EThank you Claw!! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/w26VdKN.png?1\u0022 alt=\u0022w26VdKN.png?1\u0022\u003E\u003C/p\u003E\u003Cp\u003EThough my space plane is facing the wrong way : p I messed u the RCS a bit and translations are a real pain, so I took what I can get and I will fix it before we set off for Duna... AND BEYOND!\u003C/p\u003E\n"}]}