{"TopicId":91893,"ForumId":16,"TopicTitle":"Delta V of fuel?","CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2014-12-03T19:56:57Z","PageNum":1,"Articles":[{"CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2014-12-03T19:56:57Z","Content":"\n\u003Cp\u003EThis may be an odd question.\u003C/p\u003E\u003Cp\u003EWhat is the delta V of each unit of each fuel?\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-03T20:13:43Z\u0022 title=\u002212/03/2014 08:13  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 3, 2014\u003C/time\u003E by Engineer Of Stuff\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-12-03T20:00:09Z","Content":"\n\u003Cp\u003Edelta-V isn\u0027t a quality of fuel. It depends on the engine you\u0027re using and the weight of your craft. Your question is a bit like asking \u0027how fast is petrol\u0027.\u003C/p\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2014-12-03T20:01:58Z","Content":"\n\u003Cp\u003EIt is, in fact, \u003Cem\u003Eexactly\u003C/em\u003E like asking how fast is petrol.\u003C/p\u003E\u003Cp\u003EDelta V is determined by many, many factors. At the most basic, it\u0027s determined by the mass of the craft - including fuel - and the rocket equation. So, with a given thrust, specific impulse, and craft weight, adding fuel may \u003Cem\u003Ereduce\u003C/em\u003E dV in some cases.\u003C/p\u003E\u003Cp\u003EIt is also determined by your engine\u0027s specific impulse (or I\u003Csub\u003Esp\u003C/sub\u003E, often known as Isp around here) which is a measure of how efficiently your engine uses reaction mass to change your velocity. Specific impulse is a trade-off with thrust and/or weight: the more thrust your engine has, the less I\u003Csub\u003Esp\u003C/sub\u003E all other things being equal, because of the tyranny of the rocket equation.\u003C/p\u003E\u003Cp\u003EFor practical purposes in KSP, if you want to know how much delta V any given design has, there are two options: you can either work it out \u003Ca href=\u0022https://en.wikipedia.org/wiki/Tsiolkovsky_rocket_equation\u0022 rel=\u0022external nofollow\u0022\u003Eby hand\u003C/a\u003E, or you can grab a mod that gives you a dV readout, such as VOID, Kerbal Engineer Redux, or MechJeb.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-03T20:07:34Z\u0022 title=\u002212/03/2014 08:07  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 3, 2014\u003C/time\u003E by Jovus\u003C/strong\u003E\n\u003Cbr\u003ETo avoid being snarky and actually be helpful\n\u003C/span\u003E\n"},{"CreatedByName":"Engineer of Stuff","CreatedById":106757,"CreatedDateTime":"2014-12-03T20:10:48Z","Content":"\n\u003Cp\u003EOh. I didn\u0027t think of it like that. \u003C/p\u003E\u003Cp\u003EThanks for your help.\u003C/p\u003E\u003Cp\u003EPlease close this thread.\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-12-03T20:11:23Z","Content":"\n\u003Cp\u003EThat can only be meaningful for a given rocket at a specific instant. For each unit of fuel, the amount of velocity change you get depends on the current mass of the rocket and the efficiency (Isp) of your engine. As you burn fuel, the mass of your rocket changes. Thus, you can have an instantaneous dV per kg of propellant for any given rocket at any given time in its burn.\u003C/p\u003E\u003Cp\u003EIt\u0027s still a kinda nonsensical question though: what you should be looking into is the \u003Ca href=\u0022https://en.wikipedia.org/wiki/Tsiolkovsky_rocket_equation\u0022 rel=\u0022external nofollow\u0022\u003ETsiolkovsky\u003C/a\u003E rocket equation. Just note that ve (exhaust velocity) is equal to Isp (specific impulse) * g (Earth/Kerbin surface gravity): the use of g * Isp is because engineers got tired of converting between exhaust velocity in m/s and ft/s.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jovus\u0022 data-cite=\u0022Jovus\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003ESpecific impulse is a trade-off with thrust and/or weight: the more thrust your engine has, the less I\u003C/span\u003E\u003Csub\u003Esp\u003C/sub\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E all other things being equal, because of the tyranny of the rocket equation.\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EI\u0027m going to take exception with that one: in theory, specific impulse is completely independent of thrust and engine mass. Specific impulse is mostly a function of propellant chemistry, though other factors like nozzle shape and how complete the combustion is also factor into there in ways I\u0027m not particularly familiar with. It has nothing to do with the tyranny of the rocket equation, and has much more to do with the tyranny of trying to design efficient, high-thrust engines on a ridiculously tiny mass budget.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EIn practice, you can generally get Isp a bit higher with a heavier engine, or with less thrust, because you can devote more of your engineering attention to squeezing out every bit of kinetic energy from your propellant as possible, but most engines are already within a few percent of the theoretical maximum for their propellant chemistry.\u003C/span\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-03T20:17:34Z\u0022 title=\u002212/03/2014 08:17  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 3, 2014\u003C/time\u003E by Starman4308\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jovus","CreatedById":117163,"CreatedDateTime":"2014-12-03T20:12:03Z","Content":"\n\u003Cp\u003EIf you edit your original post so that the title says \u0027answered\u0027 instead of \u0027unanswered\u0027, that\u0027s the standard way of \u0027closing\u0027 these threads.\u003C/p\u003E\n"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2014-12-03T20:12:06Z","Content":"\n\u003Cp\u003EMore accurately it is like asking how far will petrol get me.\u003C/p\u003E\u003Cp\u003EDelta V or Delta Velocity, is basically the ISP of the engine in use vs the type of fuel and location will give you the delta V of the amount of fuel on board. \u003C/p\u003E\u003Cp\u003ESo if you have an engine that has an ISP of 300 it will get less delta V then one that has an ISP of 390. \u003C/p\u003E\u003Cp\u003EThere are other factors that play into this equation, like the mass of the vessel, if it is an engine the requires air or a specific fuel type or even the atmospheric density or lack of atmosphere. \u003C/p\u003E\u003Cp\u003EYou can go to Google and type in Delta V calculator or calculations and it will give you the mathmatical formula for calculating your delta velocity for your vessel or project.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-03T23:32:15Z","Content":"\n\u003Cp\u003EA repost from another, similar \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/100856-So-What-Exactly-Is-Delta-V\u0022 rel=\u0022external nofollow\u0022\u003Ethread\u003C/a\u003E:\u003C/p\u003E\u003Cp\u003EDelta-V is a fuel gauge that is corrected for engine efficiency and ship size.\u003C/p\u003E\u003Cp\u003EIf I may used a dreaded car analogy, dV is roughly equivalent to a distance-to-empty function some vehicles have from their trip computers. It doesn\u0027t matter whether the car\u0027s engine is a miserly four cylinder or a thirsty V8, or whether the car is a 1000kg compact or a 5000kg commercial vehicle, the distance to empty is directly comparable even if the actual amount of fuel consumed is very different.\u003C/p\u003E\u003Cp\u003ESimilarly, delta-V can be directly compared between vessels no matter their mass or engine efficiency. A 1000-ton ship powered by thirsty chemical rockets can reach the same destinations as a 2-ton ship with efficient ion propulsion if their delta-V totals are the same.* This is incredibly useful because it allows analysis of the capabilities of craft while disregarding extraneous factors.\u003C/p\u003E\u003Cp\u003EDelta-V is the currency of spaceflight, the thing we spend to change the size or shape of our orbits to reach our destinations. Ask \u0022How much fuel do I need to get to the Mun from LKO?\u0022 and the answer is \u0022It depends on the mass of the ship, staging, and efficiency of the engines.\u0022 Ask instead \u0022How much delta-V do I need to get to the Mun from LKO?\u0022 and the answer is simply \u0022About 850m/s.\u0022\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E* A small caveat here: Thrust-to-weight ratio also has an effect on reachable destinations, especially when landing on or ascending from celestial bodies.\u003C/span\u003E\u003C/p\u003E\n"}]}