{"TopicId":92255,"ForumId":16,"TopicTitle":"Many Questions needing Answers","CreatedByName":"Darkday560","CreatedById":113686,"CreatedDateTime":"2014-12-08T03:52:22Z","PageNum":1,"Articles":[{"CreatedByName":"Darkday560","CreatedById":113686,"CreatedDateTime":"2014-12-08T03:52:22Z","Content":"\n\u003Cp\u003ESo, I\u0027ve got a list of questions. I\u0027ll read all answers. Please try to answer as many as possible. Please note that all of this needs to be stock. The only mod I use is Hyperedit for stage testing on my testing save.\u003C/p\u003E\u003Cp\u003E1. In my save, there\u0027s been a war between Vectro Association and Kerbal Republic. The recent wars has left the polar and equatorial rings of kerbin, duna, mun, and laythe with tons of trash. I don\u0027t want to delete it, just to have that war effect. But it\u0027s getting to the points where when I maneuver around, i need to use the 1, 2, and 3, maybe 4 custom keys to create a ship that gives small bursts of power to avoid space trash and dead kerbals. Is there some way I can create a giant space trash-truck, to add another company into my war, which cleans up parts and dumps them on a useless planet or into the sun? If so, please tell me how I would be able to make the trash stay inside the trash-bag-compacter-thingy without smashing a hole in the back or some other mechanic and making my ship be less effecient. I\u0027ve already made ships on another save that have a vtol-like jet system where you can fly into the planet extremely fast, with any gravity depending on the ship model, then stop really fast with the front jets (500-0 in 2 seconds) and then hover on the surface w/out veering around at 2/3rds power. I\u0027ll be releasing them soon. Combining the trash truck and this mechanic would make it awesome.\u003C/p\u003E\u003Cp\u003E2. Is there a way to create a gigantic artificial ring around a planet, that is all connected with docking ports? Like, you build a giant ring around a planet or moon with single pieces, and connect them with docking ports? If this IS possible without it crumbling into the planet, I have big ideas: Reloadable missile defenses, tiny deployable fighter drones, etc.\u003C/p\u003E\u003Cp\u003E3. Homing Missiles. So, I have several VA battle cruisers that either launch missiles from the belly of the ship, or change into MK2 cargo bays and release the missiles like that. Is it possible to make it to where you can launch the missile from the ship with a selected target, and without controlling the missile, have it keep targeting the ship until it hits it, 100% w/out player interaction?\u003C/p\u003E\u003Cp\u003EI plan on releasing about 100 amazing projects that I\u0027ve been making and upgrading since .13 in spring.\u003C/p\u003E\u003Cp\u003EPlease answer these questions, and please explain how to do so if you know how.\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-12-08T04:01:32Z","Content":"\n\u003Cp\u003E1. In stock, the general way to clean up trash would either be with a cup constructed from girders, or the use of a claw. So long as it was picked up below either the debris\u0027s crash velocity or the gripper\u0027s crash velocity, it should work. Given the ~6 m/s crash tolerance of most parts, this would be much easier if you wrote a ModuleManager config to boost parts\u0027 crash tolerances.\u003C/p\u003E\u003Cp\u003E2: I suppose maybe if you did some save-game editing to get the parts into orbit. All the parts past physics range (~2.5 km) would go on-rails, and I have no idea if they would remain docked properly. There is also very significant probability of bloating your RAM usage and persistence file to incredible sizes. It would take approximately 290,000 Kerbodyne S3-14400 tanks to circle Kerbin at 80 km. I\u0027m not even sure that would \u003Cem\u003Eload\u003C/em\u003E. My best estimate is 812 MB of just fuel tanks in the save file (assuming ~1400 chars/fuel tank, 2 bytes/character).\u003C/p\u003E\u003Cp\u003E3. Not in stock. A mod could do it easy: for example, with MechJeb (so long as everything stayed inside the physics bubble), you could release a missile, switch to it, target your target, go to Smart ASS and point the missile at the target, fire the engine, and then switch back to your other vessel. If you have the scripting chops for it, a kOS script would be a very good option.\u003C/p\u003E\u003Cp\u003EIn general, though, you\u0027re going quite far past what KSP was designed to handle. #1 is technically possible, although velocities will be boringly slow without modding. #2, I have no idea how KSP will handle that, because KSP was built around the assumption that you wouldn\u0027t have ships so big they extended past the physics bubble. #3 is impossible without mods: you could have a point-and-shoot, but no direction without a mod telling it what to do.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-08T04:21:59Z\u0022 title=\u002212/08/2014 04:21  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 8, 2014\u003C/time\u003E by Starman4308\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"RainDreamer","CreatedById":129077,"CreatedDateTime":"2014-12-08T04:18:00Z","Content":"\n\u003Cp\u003EAssume you are using mods.\u003C/p\u003E\u003Cp\u003E1. You can use the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/59545-0-25-Extraplanetary-Launchpads-v4-4-0\u0022 rel=\u0022external nofollow\u0022\u003EExtraplanetary Launchpad\u003C/a\u003E mod, which has recycle bin part that will eat things and turn them to rocket parts which can be used to build ships. That way there would simply no debris flying around in the trash cargobay and smashing things. If you do want to keep things around that way, maybe you should consider extra structural plating for your cargo bay. Maybe even try \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/37707-0-25-Magic-Smoke-Industries-Infernal-Robotics-0-19-2\u0022 rel=\u0022external nofollow\u0022\u003EInfernal robotic\u003C/a\u003E and build a cargo box made out of structural plating, which can withstand more abuse.\u003C/p\u003E\u003Cp\u003E2. Possible? Yes. Should you do it? No.\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/iNr9c4vUp6s?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E3. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/85209-0-25-BDArmory-v0-6-1-2-Dev-Thread-%28phys-range-fixes-%29-Oct-27\u0022 rel=\u0022external nofollow\u0022\u003EBD Armory\u003C/a\u003E for all your weapon needs\u003C/p\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2014-12-08T15:22:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022RainDreamer\u0022 data-cite=\u0022RainDreamer\u0022\u003E\u003Cdiv\u003E2. Possible? Yes. Should you do it? No.\n\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/iNr9c4vUp6s?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003C/div\u003E\u003C/blockquote\u003EThat\u0027s a really old video and thus a really old bug. In the description Danny himself says it should have been fixed in \u003Cem\u003E0.16\u003C/em\u003E.\n"},{"CreatedByName":"Darkday560","CreatedById":113686,"CreatedDateTime":"2014-12-08T22:58:59Z","Content":"\n\u003Cp\u003EThanks for the replies so far, but I DID say in the beginning:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darkday560\u0022 data-cite=\u0022Darkday560\u0022\u003E\u003Cdiv\u003EPlease note that all of this needs to be stock. The only mod I use is Hyperedit for stage testing on my testing save\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo yeah, for future posts please try to avoid mentioning mods.\u003C/p\u003E\n"},{"CreatedByName":"Starman4308","CreatedById":122674,"CreatedDateTime":"2014-12-08T23:32:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darkday560\u0022 data-cite=\u0022Darkday560\u0022\u003E\u003Cdiv\u003ESo yeah, for future posts please try to avoid mentioning mods.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELet me make this clear. With mods, you can do #1 and #3 to a greater or lesser extent. Without mods, you can do a bit of #1, but in a rather tedious fashion. #3 is completely impossible, because in stock, the only source of control is the player.\u003C/p\u003E\u003Cp\u003E#2 is highly improbable in any scenario: the KSP engine was not in any way, shape, or form, designed to do what you\u0027re asking. It\u0027s designed for rockets of up to ~500-1000 parts, not a 290,000-part ring around Kerbin.\u003C/p\u003E\n"},{"CreatedByName":"SukaiSky","CreatedById":123419,"CreatedDateTime":"2014-12-11T13:51:56Z","Content":"\n\u003Cp\u003EQuestion 3. Use something called BDArmory, it adds in a bunch of cool missiles \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-12-11T17:07:18Z","Content":"\n\u003Cp\u003ESounds like most of your questions have been answered except his one...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Darkday560\u0022 data-cite=\u0022Darkday560\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E2. Is there a way to create a gigantic artificial ring around a planet, that is all connected with docking ports?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStarman4308 said it\u0027s highly improbable, but I\u0027m pretty sure it\u0027s flat out impossible. Most of the high end players have tried making a Dyson ring at some point. There are several game engine limitations to this. The biggest problem is that the ring literally rips itself apart with floating point inaccuracies after the vessel gets big enough. Not to mention running into memory problems. All that aside, the massive phyiscs burden on the CPU would also make it likely impossible to assemble. Eventually it would take minutes (or more) per frame to render, making docking pretty much impossible.\u003C/p\u003E\u003Cp\u003EIf you did somehow overcome all this, you would eventually have to break your \u0022stock only\u0022 rule because once it got big enough, you wouldn\u0027t be able to get to the end of the vessel to dock more parts. The game has a physics bubble of roughly 2.5km. Anything outside that isn\u0027t rendered. That means if the craft\u0027s reference point is more than 2.5 km from the end that needs more parts docked to it, the craft will not load as you approach for docking.\u003C/p\u003E\u003Cp\u003EThe only reason people don\u0027t say that \u0022it\u0027s definitely impossible\u0022 is because we don\u0027t want to give up hope. But practicalities make it highly improbable.\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E-Claw\u003C/p\u003E\n"}]}