{"TopicId":93328,"ForumId":16,"TopicTitle":"Spaceplane Launch Profile","CreatedByName":"Blondai","CreatedById":80004,"CreatedDateTime":"2014-12-17T10:09:52Z","PageNum":1,"Articles":[{"CreatedByName":"Blondai","CreatedById":80004,"CreatedDateTime":"2014-12-17T10:09:52Z","Content":"\n\u003Cp\u003EI\u0027ve been trying to get a mk2 space plane into orbit, with room for a payload. But i keep running out of rocket fuel, i get to approx 23000 feet and around 1400 before switching mode.\u003C/p\u003E\u003Cp\u003EI have got spaceplanes into orbit before(As satellite launchers and got a small one to laythe and back), but was using the MK1, and even then i have always suffered from inefficiency. So can someone give me the most efficient launch profile, I found some video tutorials were hard to follow. I need velocities, Heights and attack angles. \u003C/p\u003E\u003Cp\u003ESave me Jebi-wan, you\u0027re my only hope...\u003C/p\u003E\n"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2014-12-17T10:17:56Z","Content":"\n\u003Cp\u003EUsually ppl want at least 1800 m/s @ 30Km.\u003C/p\u003E\n"},{"CreatedByName":"Wanderfound","CreatedById":112611,"CreatedDateTime":"2014-12-17T10:25:44Z","Content":"\n\u003Cp\u003EStock or FAR?\u003C/p\u003E\u003Cp\u003EEither way, the basic key is to extract as much speed and altitude as possible from your jets before switching to rockets. Climb to just below the jet starvation zone and crank it up to hypersonic before climbing higher.\u003C/p\u003E\n"},{"CreatedByName":"Oafman","CreatedById":110386,"CreatedDateTime":"2014-12-17T10:44:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Signo\u0022 data-cite=\u0022Signo\u0022\u003E\u003Cdiv\u003EUsually ppl want at least 1800 m/s @ 30Km.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, yeah, ideally, but it depends on your plane. I\u0027ve been building a lot of heavy planes of late, and all that mass, combined with the B9 jet nerf, means I often don\u0027t get much past 1600m/s before switching to rockets. But big planes can carry plenty of fuel, so this is enough velocity to convert into an orbit. \u003C/p\u003E\u003Cp\u003ETo the OP, you could do with getting slightly higher before switching, as well as slightly faster. Try to squeeze on a few more intakes (you never have too many), which should enable you to improve both altitude and velocity before you switch. \u003C/p\u003E\u003Cp\u003EAlso, pictures would help. Are you just using a single in-line set of MK2 parts, or are you sticking extra tanks (like MK1 maybe) onto the side? More fuel does not necessarily solve your problem, as it might require you to use more engines, and the whole thing gets exponentially bigger. But it might be an option.\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2014-12-17T11:44:06Z","Content":"\n\u003Cp\u003EI usually climb to that altitude as fast as the plane allows it, in your case 23000 meters, then stop the climb and try to keep it level as I can at full thrust, and then I change mode and pitch up the moment I feel I built enough speed to save rocket fuel for the final stretch to orbit without flipping over the aircraft in the process.\u003C/p\u003E\u003Cp\u003EAs other people suggested, it depends on the plane, the number of engines, the number and type of intakes, the number and position of lift surfaces etc.\u003C/p\u003E\n"},{"CreatedByName":"Keymaster89","CreatedById":100480,"CreatedDateTime":"2014-12-17T13:25:19Z","Content":"\n\u003Cp\u003EI don\u0027t have much experience with spaceplane... i\u0027m learning the art of SSTO too...\u003C/p\u003E\u003Cp\u003EBut maybe i can give u something simple to work around that i figured out...\u003C/p\u003E\u003Cp\u003E1) Before even try to reach orbit, u have to ask yourself: is this plane stable? A spaceplane need to be firmly stable IMO. if u point your nose right at the orizont it must saty pointed in that direction with no to little sas intervention through all your way up into orbit. Play in the SPH with empting and filling your tank and try to reach a good balance at all weight distribution.\u003C/p\u003E\u003Cp\u003E2) U should have enough power in both air breathing and closed cycle section of the fly. By default, try to project your plane with the cargo bay as full as possible, stick in the biggest fuel tank combination u manage to fit, and remember to close crossfeed in order to simulate a full payload. If u project your plane with the the power needed for a very full cargo, u will be able to fly that plane everywhere with any cargo u stick in. \u003C/p\u003E\u003Cp\u003E3) Remember that usually 1 intake air/engine is enough to maintein air flow in low atmo, the more u add, the more height u can reach with your aircraft with jet. BUT as u add more, u also add mass and drag, so u have to carefully manage open/close intake your intakes as u climb.\u003C/p\u003E\u003Cp\u003E4) U have to find a balance for how much big your wings are. With huge wings u will be really stable in the upper atmosphere, but your DeltaV ones in orbit will decrease sightly. Build them in order to don\u0027t overdo their size.\u003C/p\u003E\u003Cp\u003E5) when u load your payload, remember to secure it with struts, at least a couple.\u003C/p\u003E\u003Cp\u003EAscent profile analisis\u003C/p\u003E\u003Cp\u003EWith a good ascent profile, u don\u0027t need tons of jet fuel.\u003C/p\u003E\u003Cp\u003EU switch at 23km at 1400 m/s. \u003C/p\u003E\u003Cp\u003EIMO what you\u0027re doing is trying to cut the atmosphere in half, with an ipersonic plane.\u003C/p\u003E\u003Cp\u003EAt 23km u start to raise up your velocity, but in order to do that u have to climb much more than that! u\u0027re trying to destroy a windwall with your face.\u003C/p\u003E\u003Cp\u003EU\u0027re still in the thick part of the atmosphere, by the time u hit 1400m/s, u should be at least \u0026gt;33km!\u003C/p\u003E\u003Cp\u003EA correct ascent profile:\u003C/p\u003E\u003Cp\u003E1) close all intake until u have 1 intake/engine rateo. Intake have huge drag, in the low atmosphere u have so much air that u don\u0027t really care about.\u003C/p\u003E\u003Cp\u003E2) take off and try to raise your altitude as steep as u could afford until 22-23Km. speed here doesn\u0027t count at all, if u\u0027re subsonic it\u0027s ok. At 22km is where your real ascent profile start.\u003C/p\u003E\u003Cp\u003E3) turn to the orizon, around 10-15Ã‚Â°, build up some initial speed and enter ipersonic at full throttle. in a 10-15 seconds u should have build a massive speed, and u\u0027re now at 1000-1200m/s at an altitude at around 30-35km\u003C/p\u003E\u003Cp\u003E4) by now your velocity start to climb slower, and your engine will start to feel the need of more air. here the things start to become challangeing. Point your nose at the orizont, just as higher as needed to climb costantly between 10 and 100 m/s. u have to keep the eyes at 2 things now: speed and air. Speed: u may not expect that initially, but if u climb, u gain speed, if u fall, u lose speed, keep climb, your speed will increase really slowly, keep going until gain speed, if your speed stop growing than pull up the nose a bit, bring back the plane to climb again until u gain speed ones more. Air: your engine at this point will start to fumble, as u touch 0.5-0.7 air, open up a couple of new intakes, this is important expecially when u run more than one jet engine, flameout one jet means loose simmetry in the trust, then spinning, then stall, than huge fall, and that mean u have to start again from 23km. If u have one jet, u\u0027ll loose power suddendly, but u will glide until u recover trust.\u003C/p\u003E\u003Cp\u003E5) ones u have opened all your intakes, and u think u have squeezed all the speed u can, DON\u0027T switch to close cycle! By this time, u should be around 40-42km at a speed of 1600-1700m/s, near the limit of the thick atmosphere. Air will be rare, but u can use that engines for a bit more longer, just low down your throttle enough to keep your engines push, keep gain altitude, keep gain speed, every m/s count.\u003C/p\u003E\u003Cp\u003E6) when u reach a point that your engines will flameout no matter what, make this operation as fast as possible (an action group dedicated is in order): shut off jet, turn on rockets, close all intakes and go full throttle until your apoapsis hit 73km at the other side of the planet, u want to overshoot a bit because drag on the way there will slow u down. This operation shoudn\u0027t cost u more than 600 DeltaV, if it does, u did something wrong. If u are still couple km deeper then 45km into the atmosphere, try to burn at 30-45Ã‚Â° to raise your altitude to avoid annoing drag bring u down. If the drag logorate your apoapsis under 71, make some little jump burn to keep it up.\u003C/p\u003E\u003Cp\u003E7) coast to apoapsis, burn to circularize, congratulation, have reached orbit.\u003C/p\u003E\u003Cp\u003EIMPORTANT NOTE: If your plane didn\u0027t reached point 5 into this ascent profile, probably your jet configuration isn\u0027t powerful enough to bring your payload into space, redesign it, add 1-2 jets or/and try remove unecessary things.\u003C/p\u003E\u003Cp\u003EIt surely need some practice to figure out yourself, but after a couple of succesfull launch the impossible become possible with large margin of improvement. I saw people with air hoggin spaceplane leave the atmosphere at 2200m/s and reaching orbit leaving the rocket cold, circularizing only with RCS...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T13:28:52Z\u0022 title=\u002212/17/2014 01:28  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by Keymaster89\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Blondai","CreatedById":80004,"CreatedDateTime":"2014-12-17T13:38:54Z","Content":"\n\u003Cp\u003EI left out a picture because I just reset my computer and this is literally the first thing i did, and it was practically prototype 1, so didn\u0027t wanna embaresss myself before i put in my fuel flow system. (To help balance plane on reentry, I had nose dive issues after a suborbital flight, but take off is beautiful), I used Mk2 parts and two Rapier engines, I know they arent best but like i said, prototype. I put loads of intakes, engines still starve at 23000, and I always have trouble keeping altitude steady. I\u0027m gonna watch 24, and have pizza, then work on Prototype two, gonna add scram jets and keep rapiers (May change to aerospike thinking bout it), that worked for me before, i just think people are getting higher speeds and altitude, which s annoying cause i though i was airhogging already. When you switch to rockets, do you still angle prograde or do you aim 30 degrees up.\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2014-12-17T13:50:28Z","Content":"\n\u003Cp\u003EIf you can trim your pitch according to your surface prograde at 20000 meters, where your engines should be still packing some punch, with the new beta you can level up Jeb at level 1 and tell him to maintain the course on the prograde vector.\u003C/p\u003E\u003Cp\u003EKeep full throttle and wait for the right time.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2014-12-17T14:10:36Z","Content":"\n\u003Cp\u003EI was going to say...\u0022switch over\u0022 usually indicates RAPIERs.\u003C/p\u003E\u003Cp\u003EGeneral design principles:\u003C/p\u003E\u003Cp\u003E- Maximum takeoff weight of 13 tonnes per RAPIER. For two RAPIERs, your plane\u0027s mass should be no more than 26 tonnes.\u003C/p\u003E\u003Cp\u003E- No less than .03 intake area per engine. Six RAMs will cover you; with more, you should be able to achieve a higher altitude before switchover. These should be amidships or aft if possible - not forward (high drag when they\u0027re open, see).\u003C/p\u003E\u003Cp\u003E- A lift coefficient to mass ratio of roughly 1:1. If your plane weighs 26 tonnes, the sum of the lift coefficients of all your lift-bearing parts should equal 26. A delta wing/wing connector A or B has a lift coefficient of 2, ergo a 26 tonne plane would need 13 delta wings (6.5 pairs, which you\u0027d round up to seven pairs)\u003C/p\u003E\u003Cp\u003E- If you\u0027re going to use SAS at all, you want a level of control equal to 1.5 times the plane\u0027s mass. For a 26 tonne plane, you want 39 kN of SAS - this corresponds to two Reaction Stabilizers and two Reaction Wheels, or a Large ASAS and a single Reaction Wheel (thereabouts). You still want sufficient control surfaces to fly your craft without SAS, but some SAS can help your plane hold its attitude.\u003C/p\u003E\u003Cp\u003E- About 40 units of liquid fuel and 25 units of oxidizer per tonne of takeoff weight. For 26 tonnes, you want 1040 units of LF total and 650 tonnes of oxidizer.\u003C/p\u003E\u003Cp\u003E- The usual: CoL behind and slightly above the CoM, preferably balanced so the CoM does not shift in flight; CoT aligned with the CoM; sufficient control surfaces to give you good control; wheels set perpendicular and not supporting too much weight.\u003C/p\u003E\u003Cp\u003EIf you\u0027re not adverse to mods, I\u0027d highly recommend RCS Build Aid. Among its features is a \u0022dry center of mass\u0022 indicator, which shows how much the CoM will shift in flight for current designs. The usefulness of this information when designing spaceplanes should be obvious. I don\u0027t know if it\u0027s been updated for 0.90 yet or not, though.\u003C/p\u003E\u003Cp\u003EAscent profile:\u003C/p\u003E\u003Cp\u003EGenerally, you want your rate of ascent to be no greater than 100 m/s. I go with this one -\u003C/p\u003E\u003Cp\u003E- Put your nose to 45-60 degrees on takeoff and ascend to 10,000 meters.\u003C/p\u003E\u003Cp\u003E- At 10,000, drop the nose to 40 degrees.\u003C/p\u003E\u003Cp\u003E- At 15,000, drop the nose to 30 degrees.\u003C/p\u003E\u003Cp\u003E- At 20,000, drop the nose to 20 degrees.\u003C/p\u003E\u003Cp\u003E- At 25,000, drop the nose to 15 degrees. With RAPIER equipped planes, this is usually where I have to start watching the air supply. \u003C/p\u003E\u003Cp\u003E- At 27,500, drop the nose to 10 degrees and watch your rate of ascent; this high up you will be struggling to avoid switchover.\u003C/p\u003E\u003Cp\u003EYour design should include an action group to handle a manual switchover (one that toggles the intakes and RAPIERs to closed-cycle). Should you switch over before reaching 30k/1750 m/s, immediately switch back over and throttle back a bit. If you\u0027re stuggling to get to 1700 before switchover, increase the amount of oxidizer to 30 units per takeoff weight (for 26 tonnes, use 780 units of oxidizer).\u003C/p\u003E\u003Cp\u003EBest of luck.\u003C/p\u003E\n"},{"CreatedByName":"TokiTech","CreatedById":131500,"CreatedDateTime":"2014-12-17T14:48:59Z","Content":"\n\u003Cp\u003EThis is my personal note for sending 30.5t Interplanetary SSTO to orbit with quad TurboJet, one Nuclear. If you are doing LKO with lighter payload then you should able to achieve those numbers easily and guarantees orbit. At 25kM you want an direction angle of 6 up to 30kM it should be around 3-4.\u003C/p\u003E\u003Cp\u003E- Minimum Surface Velocity:\u003C/p\u003E\u003Cp\u003E1000m/s at 20kM\u003C/p\u003E\u003Cp\u003E1500m/s at 25kM\u003C/p\u003E\u003Cp\u003E2000m/s at 34kM\u003C/p\u003E\u003Cp\u003E- Minimum Orbit Entry Velocity:\u003C/p\u003E\u003Cp\u003E2300m/s at 36kM\u003C/p\u003E\u003Cp\u003EFor my 24t LKO cargo SSTO quad TurboJet, one RAPIER, direction angle is always 5-7 up to 30kM, rather easy to brute force into orbit if you have JetEngine with symmetrical throttle down.\u003C/p\u003E\u003Cp\u003EI describe in direction angle because the lift can be different in your design, so each plane can be with different attack angle.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T14:55:38Z\u0022 title=\u002212/17/2014 02:55  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by TokiTech\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"magnemoe","CreatedById":57801,"CreatedDateTime":"2014-12-17T15:05:32Z","Content":"\n\u003Cp\u003EOne tips if you use jets\u002B rockets or like me, jets\u002B rapiers is to turn on the rocket while having two jets running, this extra speed let you run in hybrid mode for some time longer and the ISP in hybrid mode is too good to pass, on some planes I can reach more than 2200 m/s in it, so you just has to adjust and use less than 100 m/s to circulate.\u003C/p\u003E\n"},{"CreatedByName":"Blondai","CreatedById":80004,"CreatedDateTime":"2014-12-17T16:12:47Z","Content":"\n\u003Cp\u003EI shortened the fuselage, which makes a smaller payload sadly. bigger more angled wings, it now glides back to Kerbin Beautifully\u003C/p\u003E\u003Cp\u003EAdded a load of new intakes, there\u0027s more underneath.\u003C/p\u003E\u003Cp\u003EGets to bout 29000, but it starts rolling around and control is difficult, this is before burnout of an engine, but i think lack of oxygen is the cause. Can get into orbit, but with very little fuel left. Will keep trying and keep yall updated, thanks.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/aoapZ\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/aoapZ\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2014-12-17T16:51:44Z","Content":"\n\u003Cp\u003EIt\u0027s because the higher you go, the faster you have to be for your wings to produce any lift or stability.\u003C/p\u003E\u003Cp\u003EAlso, check if your center of thrust (of your LF\u002BO thrusters only!) is aligned with the center of mass.\u003C/p\u003E\u003Cp\u003EIf they are even a bit apart and you don\u0027t have powerful reaction wheels and SAS, the craft will begin spinning around your center of mass as soon as you run out of atmosphere to cut with your wings.\u003C/p\u003E\n"},{"CreatedByName":"TokiTech","CreatedById":131500,"CreatedDateTime":"2014-12-17T19:32:28Z","Content":"\n\u003Cp\u003EYour plane has small LF\u002BO capacity and using 2 RAPIERs in closedcycle consume fuel too fast, unless you are in hurry to orbit. To save LF\u002BO i suggest only use RAPIER in closedcycle after 30kM altitude. My plane is bigger and heavier can get away with one RAPIER, what it need was quad TurboJets and it works.\u003C/p\u003E\u003Cp\u003EJust make sure the engines doesn\u0027t throttle down too fast asymmetrically that can sends you to violent spin, when done right those engines can get you very far. Also this info is essential to SSTO plane builders, incase you need to know: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/84217-Explaining-burnout-asymetry\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/84217-Explaining-burnout-asymetry\u003C/a\u003E\u003C/p\u003E\n"}]}