{"TopicId":93341,"ForumId":16,"TopicTitle":"Avoid Deletion of manned Parts in Atmosphere","CreatedByName":"LoneRider","CreatedById":76103,"CreatedDateTime":"2014-12-17T12:44:05Z","PageNum":1,"Articles":[{"CreatedByName":"LoneRider","CreatedById":76103,"CreatedDateTime":"2014-12-17T12:44:05Z","Content":"\n\u003Cp\u003EHi everyone,\u003C/p\u003E\u003Cp\u003EI just built a carrier plane for a small rocket, intended for simple experiments or personel exchange on stations. The intention is to fly with the plane as high as possible and then launch the rocket for the last meters into space. \u003C/p\u003E\u003Cp\u003EThe Plane itself weights 63 tons and can fly up to 20.000m at 1.100m/s speed. On top of it there is a tiny rocket with two solid boosters (24 tons in total), mounted on a TT-70 decoupler. When the plane reaches 20.000m and the desired speed, the next staging decouples the rocket and starts the solid booster. Since the rocket is mounted in a small angle on top of the plane, it starts going upwards and gets speed rapidly. It would easily reach a suborbital flight route.\u003C/p\u003E\u003Cp\u003EWhen the rocket reaches 2.000m distance from the plane, it disappears, and so does the kerbal inside.\u003C/p\u003E\u003Cp\u003EI know I could build my \u0022plane\u0022 that can get out of atmosphere and decouple there, but thats not the intention. Current real life projects are also building carrier planes that bring small rockets up high, and i would like to build that too. \u003C/p\u003E\u003Cp\u003EIs there a way (a mod or something) to avoid the part deletion in atmosphere at 2.000m distance? If the part that gets decoupled is manned, it should stay alive and be calculated as a new ship, just like in space. The solid boosters in my case are strong enough to get the ship into at least a high suborbital flight so there would be enough time to land the plane and switch to the rocket. Or is there any other way to handle this?\u003C/p\u003E\u003Cp\u003ERegards\u003C/p\u003E\u003Cp\u003ELoneRider\u003C/p\u003E\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2014-12-17T12:52:31Z","Content":"\n\u003Cp\u003EToo bad this still happens.\u003C/p\u003E\u003Cp\u003EIt wouln\u0027t be too hard to just simulate the flight of the object on the map view based on how throttle, heading and amount of fuel left were while it was visible, without having to render it in the normal view.\u003C/p\u003E\u003Cp\u003EThere\u0027s the atmospheric drag and lift to take into account of course, but numbers are numbers, and even if the simulation was a bit off I don\u0027t think anyone would complain.\u003C/p\u003E\u003Cp\u003EI mean, even vessel tracking in orbit is not perfect.\u003C/p\u003E\u003Cp\u003ELike that time when I left 4 comm relay satellites with the same orbital period, inclination and relative velocity from one another (checked with K.E.R.) just to find them offset from each other a few game days later. Come on.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T12:56:06Z\u0022 title=\u002212/17/2014 12:56  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by Janos1986\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"The_Rocketeer","CreatedById":81727,"CreatedDateTime":"2014-12-17T13:36:13Z","Content":"\n\u003Cp\u003EI\u0027m afraid there\u0027s currently no mod to do this. It is something I suggested in the development suggestions thread some time ago.\u003C/p\u003E\u003Cp\u003EThere is a way (I think) to increase the range at which objects disappear - I think it\u0027s something Scott Manley did at one point - but that still doesn\u0027t completely solve the problem, because on orbital scales the distances are still small.\u003C/p\u003E\u003Cp\u003EThe problem is that atmospheric physics are very much more complicated than space (so called on-rails) physics. There is an argument that a simplified \u0027atmo on rails\u0027 could be used, but I suspect this would be wide open for exploits and could be game-breaking.\u003C/p\u003E\u003Cp\u003EWhat you can do is quicksave the game just before you separate. Then you can separate and land the plane (for satisfaction/realism) and then reload to do the rocket half (so you still have it in orbit when you move on). It might even be possible to merge two save files with a bit of notepad editing, though hand on heart I have no idea what I\u0027m talking about here. I\u0027ll start another thread to ask about that.\u003C/p\u003E\u003Cp\u003EEdit: FWIW, I could be wrong but I don\u0027t think any Kerbals you \u0027lose\u0027 this will go MIA. I don\u0027t think the parts count as recovered tho.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T13:38:29Z\u0022 title=\u002212/17/2014 01:38  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by The_Rocketeer\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2014-12-17T15:05:05Z","Content":"\n\u003Cp\u003EIf you were high enough above the ground, it wouldn\u0027t disappear. You have to be above I believe it is 25km. However, once the rocket is 2.2km away from you, it will lose atmospheric drag and engine thrust.\u003C/p\u003E\u003Cp\u003EA mod could be designed to make a selected craft that you are moving away from remain in physics, by making a satellite physics bubble. This may even come in the main release at some point, what with pilot training and all. I\u0027m going to request it in suggestions.\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-17T15:37:00Z","Content":"\n\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80292\u0022 rel=\u0022external nofollow\u0022\u003EFMRS\u003C/a\u003E is the mod you seek. It creates a save point when you separate and allows you to pilot both craft, merging the changes you make in each craft afterwards (basically what The_Rocketeer describes but automatic). Not updated for 0.90 yet, not sure if the current version works there or not.\n"},{"CreatedByName":"Janos1986","CreatedById":132068,"CreatedDateTime":"2014-12-17T15:44:21Z","Content":"\n\u003Cp\u003EYES! Finally.\u003C/p\u003E\u003Cp\u003EI always wanted to do a SpaceShipTwo-kind of launch.\u003C/p\u003E\u003Cp\u003EI\u0027ll patiently wait for the .90 update \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"thereaverofdarkness","CreatedById":75673,"CreatedDateTime":"2014-12-17T15:44:56Z","Content":"\n\u003Cp\u003EThat\u0027s a really cool mod then. I\u0027ll have to check it out at some point.\u003C/p\u003E\n"},{"CreatedByName":"monstah","CreatedById":95210,"CreatedDateTime":"2014-12-17T18:33:56Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/80292-0-25-0-Flight-Manager-for-Reusable-Stages-(FMRS-v0-3-00)\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/80292-0-25-0-Flight-Manager-for-Reusable-Stages-(FMRS-v0-3-00)\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESadly, not for 0.90 yet?\u003C/p\u003E\u003Cp\u003E- ninja\u0027d by... a couple hours. Don\u0027t leave the reply open and go do something else, apprearently.\u003C/p\u003E\n"},{"CreatedByName":"LoneRider","CreatedById":76103,"CreatedDateTime":"2014-12-17T21:05:39Z","Content":"\n\u003Cp\u003E...IT WORKS! Just as it is, with 0.90, tried it a few minutes ago.\u003C/p\u003E\u003Cp\u003Eedit: well, almost. Recovering does not work correctly it seems... pilot is missing in action.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T21:37:57Z\u0022 title=\u002212/17/2014 09:37  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by LoneRider\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"LoneRider","CreatedById":76103,"CreatedDateTime":"2014-12-17T21:53:58Z","Content":"\n\u003Cp\u003EHere are some Pics:\u003C/p\u003E\u003Cp\u003E1st: TakeOff. 82.3 tons total weight, 4 seats for transporter, 1 in shuttle rocket. Park brakes, fire up 10 TurboJet Engines, release Break when engines turn orange. Liftoff at 110m/s.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/bdkhf8vq_png.html\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/bdkhf8vq_png.html\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBring the Plane up to 20.000m at 1.100 m/s and hit Hotkey 1. Solid Booster start, decoupler decouples, and the upper 4 engines of the plane are switched off. Since the rocket is mounted a few degrees up, it immediatelly starts flying upwards away from the plane\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/gulsds7b_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/gulsds7b_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ELand the Plane somewhere safe - note only 6 engines working, 4 offline. And the Plugin mentioned above on the upper left side, showing the decoupled rocket.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/wkkdxinq_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/wkkdxinq_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter landing, click the Button below \u0022Stage 3\u0022 with the ship name. \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/5t7s25jw_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/5t7s25jw_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGame will go back in time to when the ship was decoupled - fly into orbit (the solid boosters are almost enough):\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/dcwb2wbe_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/dcwb2wbe_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/fd3nttic_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/fd3nttic_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EReentry into atmosphere for landing. Unfortunatly the rocket is build really bad and too nose-heavy, so it can\u0027t be landed. Has no landing gear anyway:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/32s2jsdd_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/32s2jsdd_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESo just use the parachutes to land savely\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/t5amj7rl_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/t5amj7rl_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAfter landing, just click Recover on the top of the screen\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/8c7xjfci_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/8c7xjfci_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EGame will go back to Spaceport and immediately switch to the main vessel:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www.directupload.net/file/d/3839/ofj6theg_png.htm\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.directupload.net/file/d/3839/ofj6theg_png.htm\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ERecover main Vessel. Unfortunatly something is wrong with recovering the decoupled part - pilot is \u0022missing in action\u0022 and parts are not recovered. But at least i could fly them both, and besides the recovering it all worked great \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECost: 2 Rocomax BACC solid boosters, 1.2k liquid fuel for the carrier plane, and 300 fuel for the rocket. Quite cheap to get a kerbal into orbit this way... besides he is missing now ^^\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-17T21:56:43Z\u0022 title=\u002212/17/2014 09:56  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 17, 2014\u003C/time\u003E by LoneRider\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-12-17T23:29:43Z","Content":"\n\u003Cp\u003EThanks for being the guinea pig and sharing your results, LoneRider. You should repost them in the FMRS thread so the modder gets the feedback.\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2014-12-17T23:41:54Z","Content":"\n\u003Cp\u003EId love to have multiple craft flying at once. Outside of MP, im wondering if there is a way to say have a AI plane (even if it disables fuel consumption for the vessel) just fly at a preset course (im trying to find a method to do some target practice in atmosphere).\u003C/p\u003E\u003Cp\u003EAnyways, if such a mod is ever released/found (that allows a AI plane to go at say a specific altitude in atmo), please make sure you let me know, what id do for some atmopheric target drones to test missiles, cannons, and lazors on.\u003C/p\u003E\n"}]}