{"TopicId":93459,"ForumId":16,"TopicTitle":"Noob questions on contracts","CreatedByName":"p0rkch0p","CreatedById":132358,"CreatedDateTime":"2014-12-18T02:00:54Z","PageNum":1,"Articles":[{"CreatedByName":"p0rkch0p","CreatedById":132358,"CreatedDateTime":"2014-12-18T02:00:54Z","Content":"\n\u003Cp\u003ESo yeah, the new career mode is hard, I am pretty new to KSP but its a lot of fun. In the interest of getting every penny (for upgrades to the buildings), I took a couple of contracts. However, looking for some advice on how to do them.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOne is to test a SRB while splashed down. I can\u0027t figure out how to get the SRB to survive the splashdown, I used a chute on the control module, and a pair of radials on the SRB, but it still \u0027blows up\u0027 when it hits the water.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EWhats the best strategy for the \u0027fly over landmark\u0027 contracts? I am assuming a plane, but between science and cost, I am way far away from being able to afford anything like that.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThanks!\u003C/p\u003E\n"},{"CreatedByName":"xub313","CreatedById":57408,"CreatedDateTime":"2014-12-18T02:32:35Z","Content":"\n\u003Cp\u003EFor the SRB one, try putting some modular girder segments below the SRB. The have a high crash tolerance so they can absorb most of the impact.\u003C/p\u003E\n"},{"CreatedByName":"WanderingKid","CreatedById":110855,"CreatedDateTime":"2014-12-18T02:56:48Z","Content":"\n\u003Cp\u003ECost on the plan should be recoverable, so that shouldn\u0027t directly stop you. Science will though.\u003C/p\u003E\u003Cp\u003EFor a \u0027one stop shop\u0027, a two tank rocket can usually get to where you need to be. Just throw extra chutes on it for when you get there. They can be a bit of a bear to drive, though. Go parabolic, not like flight.\u003C/p\u003E\n"},{"CreatedByName":"DrD","CreatedById":103953,"CreatedDateTime":"2014-12-18T03:03:05Z","Content":"\n\u003Cp\u003EYou can use throttleable engines and burn before splashdown to slow down. For a radial decoupler test I slowed down to about 5 m/s and nothing broke.\u003C/p\u003E\n"}]}