{"TopicId":93781,"ForumId":16,"TopicTitle":"Reassigning mouse controls for view (VAB/SPH in particular)?","CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-20T01:00:51Z","PageNum":1,"Articles":[{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-20T01:00:51Z","Content":"\n\u003Cp\u003EI wager this must be a trivial question, but I can\u0027t seem to find an answer here or elsewhere:\u003C/p\u003E\u003Cp\u003EKSP lets you freely reassign the key bindings for just about everything in the game, but I don\u0027t see where I can customize the mouse controls much at all. Particularly for the VAB/SPH, I\u0027d really like to change the mouse controls for rotate/pan/zoom. I imagine many are perfectly fine using the default assignments, but for somebody who does mechanical CAD at work all day, it\u0027s really disorienting to come home and have everything switched around when building stuff in KSP (I\u0027ve caught myself at work a couple of times trying to use Kerbal controls in SolidWorks... ahem).\u003C/p\u003E\u003Cp\u003EI\u0027d really love if I could assign combinations of mouse buttons and control keys to these functions (SolidWorks standard is middle-button for rotate, control-middle-button for pan, scroll-wheel for zoom). Is there any way, in-game or otherwise, of doing this?\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-20T01:29:12Z","Content":"\n\u003Cp\u003ESadly I don\u0027t think it\u0027s possible to change the mouse controls like that in KSP, though in my experience KSP\u0027s VAB camera controls are fairly standard in games. I\u0027ve always found the controls in 3D editing programs (blender/autocad/...) very counter-intuitive. There is undoubtedly some tool for windows out there that will let you remap the mouse buttons though, perhaps one of those would fit your needs?\u003C/p\u003E\n"},{"CreatedByName":"sherkaner","CreatedById":130303,"CreatedDateTime":"2014-12-20T01:35:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022armagheddonsgw\u0022 data-cite=\u0022armagheddonsgw\u0022\u003E\u003Cdiv\u003ESadly I don\u0027t think it\u0027s possible to change the mouse controls like that in KSP, though in my experience KSP\u0027s VAB camera controls are fairly standard in games. I\u0027ve always found the controls in 3D editing programs (blender/autocad/...) very counter-intuitive. There is undoubtedly some tool for windows out there that will let you remap the mouse buttons though, perhaps one of those would fit your needs?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHm, so maybe this is ultimately a feature request then.\u003C/p\u003E\u003Cp\u003ECAD controls are only counter-intuitive if you don\u0027t spend much of your life in them. I certainly wouldn\u0027t want to force them on anybody, but the option would be very nice especially since I bet KSP has more than its fair share of engineers playing it.\u003C/p\u003E\u003Cp\u003EI\u0027m on OS X, not Windows. Might be some remapping tool for that as well, although I\u0027d really rather not have to go to that if I don\u0027t have to...\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-20T01:49:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sherkaner\u0022 data-cite=\u0022sherkaner\u0022\u003E\u003Cdiv\u003ECAD controls are only counter-intuitive if you don\u0027t spend much of your life in them.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe same could be said about any control scheme. As for OS X... Apple aren\u0027t exactly known for their customization options, but there might be a user app I guess. Good luck in any case \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"}]}