{"TopicId":93861,"ForumId":16,"TopicTitle":"How to get parts to connect radially? (forcing small fuel tanks onto a spaceplane)","CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-12-20T16:13:03Z","PageNum":1,"Articles":[{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-12-20T16:13:03Z","Content":"\n\u003Cp\u003EI\u0027m trying to build a spaceplane that will be able to land on it\u0027s belly (like a Harrier). Both because it\u0027s cool, and it will be useful for landing on worlds where you can\u0027t slow down or land with the wings.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://i.imgur.com/vtP76w8.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/vtP76w8.png\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EI got it to work with the FL-T100 tanks connected to the body of the plane (those are the larger tanks you can see behind the wing) but they\u0027re still too big... It ruins the plane\u0027s sleek figure. So I went and got the Oscar B tanks (the tiny ones in front of the wing) but for some reason that one won\u0027t connect radially! It would be perfect, but it won\u0027t snap into place. They\u0027re both fuel tanks, why would one connect and the other not?\u003C/p\u003E\u003Cp\u003EThis is what I\u0027m aiming for, only with the ventral engines being less visible. \u003Ca href=\u0022http://i.imgur.com/qfyGKUS.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/qfyGKUS.png\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-20T16:16:20Z\u0022 title=\u002212/20/2014 04:16  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 20, 2014\u003C/time\u003E by PTNLemay\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sal_vager","CreatedById":16426,"CreatedDateTime":"2014-12-20T16:16:00Z","Content":"\n\u003Cp\u003EThe cheaty way is to set radial attach to true in the part.cfg but this is not very good with some parts as they don\u0027t attach collider to collider (but the offset tool fixes that).\u003C/p\u003E\u003Cp\u003EAnother way is to use other parts that do attach radially such as the cubic strut.\u003C/p\u003E\n"},{"CreatedByName":"PTNLemay","CreatedById":30142,"CreatedDateTime":"2014-12-20T16:21:47Z","Content":"\n\u003Cp\u003EYeah... it\u0027s just frustrating that some parts do get to attach but others don\u0027t, even though they are quite similar aside for scale. The trick with the cubic struts does work, but so far all I\u0027ve unlocked is the big one, and that one ruins the smoothness even more than the FL-T100s do. Plus it\u0027s heavy for nothing.\u003C/p\u003E\u003Cp\u003EOn the plus side, the current prototype flies like a dream. \u003Ca href=\u0022http://i.imgur.com/eZqsmgx.png\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/eZqsmgx.png\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-20T16:26:09Z","Content":"\n\u003Cp\u003EAn alternative solution for VTOL craft is to use the Vernor engines and linear RCS controls, though of course you have considerably less control over thrust\u003C/p\u003E\n"},{"CreatedByName":"Vashts","CreatedById":125630,"CreatedDateTime":"2014-12-20T16:38:19Z","Content":"\n\u003Cp\u003Eset them on the ends of beams and then make liberal use of the gizmos\u003C/p\u003E\n"}]}