{"TopicId":94551,"ForumId":16,"TopicTitle":"Effect of TWR, TVR, and DVR on Orbital Launch Efficiency (deltaV)","CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T04:53:00Z","PageNum":1,"Articles":[{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T04:53:00Z","Content":"\n\u003Cp\u003E[tl:dr]\u003Cstrong\u003ETo obtain efficiency greater than or equal to 90%, a thrust-to-weight ratio (TWR) of at least 1.4 at launch on an atmosphereless, Kerbin-sized body (like Tylo) is required with standard ISP engines; but for planets with smaller orbital velocity or more efficient engines (nuclear or Ion), TWR at launch to obtain efficiency greater than 90% increases. \u003C/strong\u003E[/tl:dr]\u003C/p\u003E\u003Cp\u003EI have made a computer model in Matlab (EDIT: Excel version now available! See Below!) to simulate optimal TWR (thrust-to-weight ratio), TVR (thrust-velocity-ratio), and DVR (delta-V-ratio). I provide non-dimensional contour plots to show results which are globally applicable for the same non-dimensional parameters.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/qud778opmyp4fis/OptimalHorizontalLaunch.pdf?dl=0\u0022 rel=\u0022external nofollow\u0022\u003ELink to the Paper\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EResults:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ev0q4HR.jpg\u0022 alt=\u0022ev0q4HR.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis graph shows the independence of efficiency on DVR. The slope of the curve is essentially zero, until efficiency drops to zero instantly when delta-V-ratio no longer provides enough deltaV to get into orbit due to efficiency. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/rG1Uqwc.jpg\u0022 alt=\u0022rG1Uqwc.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESince efficiency is not a function of DVR (i.e. how much extra fuel you carry into orbit), we only need to vary TWR and TVR. The above plot contains all the information a player needs when designing craft. \u003C/p\u003E\u003Cp\u003EFirst, increasing TWR increases efficiency while increasing TVR decreases efficiency. Increasing TWR increases efficiency by allowing the craft to aim more horizontal, thereby, using more of its fuel to accelerate into orbit instead of fighting gravity. Increasing TVR decreases efficiency since, for a given DVR, less fuel is burned. This, in turn, results in a more constant TWR during the flight, and therefore, a longer flight as well as a steeper angle above vertical, causing more fuel to be wasted fighting gravity. \u003C/p\u003E\u003Cp\u003ESecond, for low TVR, lower TWR are needed for a given efficiency; similarly, for a higher TVR, a higher TWR is needed to obtain the same efficiency. This is the direct result of the trends described above, and \u003Cstrong\u003Eis the most important result of the simulation\u003C/strong\u003E: thus, for two crafts with the same ISP engine, the craft on Minmus will require a higher TWR for the same efficiency as a craft on Mun, and so on.\u003C/p\u003E\u003Cp\u003EFinally, this model should be easy to test. Since efficiency is not a function of DVR (i.e. size or scale), two craft with the same TWR can be compared on the same planet with different ISP engines or on different planets with the same engine, and the craft with the larger ISP engine or equivalently on the planet with a smaller orbital velocity should have reduced efficiency.\u003C/p\u003E\u003Cp\u003EAnd in case you dont believe that efficiency is independent of DVR for all TWR and TVR: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4nr9GlL.gif\u0022 alt=\u00224nr9GlL.gif\u0022\u003E\u003C/p\u003E\u003Cp\u003EExcel Versions of the Simulator: \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/sddikc3qzv37zyx/Horizontal%20Orbital%20Insertion%20Simulator%20v1.0.xlsx?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EVersion 1\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/9o3vqf9hlzyzpmf/Horizontal%20Orbital%20Insertion%20Simulator%20v2.0.xlsx?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EVersion 2\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/737gcgkaqobuv7i/Horizontal%20Orbital%20Insertion%20Simulator%20v3.0%20with%20Macros.xlsm?dl=0\u0022 rel=\u0022external nofollow\u0022\u003EVersion 3 with Macros\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-29T22:42:01Z\u0022 title=\u002212/29/2014 10:42  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 29, 2014\u003C/time\u003E by arkie87\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-26T05:07:11Z","Content":"\n\u003Cp\u003EUh, did you not \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/103890-Non-Dimensional-Model-for-Optimal-Horizontal-Launch-Efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ealready post this\u003C/a\u003E in what is really the more appropriate forum? This appears to be almost a copy-paste.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T05:08:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022armagheddonsgw\u0022 data-cite=\u0022armagheddonsgw\u0022\u003E\u003Cdiv\u003EUh, did you not \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/103890-Non-Dimensional-Model-for-Optimal-Horizontal-Launch-Efficiency\u0022 rel=\u0022external nofollow\u0022\u003Ealready post this\u003C/a\u003E in what is really the more appropriate forum? This appears to be almost a copy-paste.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn the science forum, i developed, edited, tested in-game, and refined the paper. \u003C/p\u003E\u003Cp\u003ENow it is fully-refined, and serves merely as information for game play. Maybe tutorials is the more proper forum.\u003C/p\u003E\n"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2014-12-26T05:16:39Z","Content":"\n\u003Cp\u003EThis has GOT to be the most time anybody has ever put into justifying MOAR BOOSTERS.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T05:19:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00225thHorseman\u0022 data-cite=\u00225thHorseman\u0022\u003E\u003Cdiv\u003EThis has GOT to be the most time anybody has ever put into justifying MOAR BOOSTERS.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u002B1\u003C/p\u003E\u003Cp\u003EBut the results show that MOAR BOOSTERS doesnt pay very much... (at least once TWR \u0026gt; 1.6 and for airless bodies)\u003C/p\u003E\u003Cp\u003EBut it is MOAR FUN!\u003C/p\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-12-26T09:51:08Z","Content":"\n\u003Cp\u003ETwo things:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E Define TVR and provide an intuitive description for it. Despite having played KSP for over a year, I\u0027ve never heard of the term before.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E Define efficiency and justify why your definition is useful. Are you using payload fraction, vehicle cost per tonne of payload or something else?\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-12-26T13:45:10Z","Content":"\n\u003Cp\u003EJouni,\u003C/p\u003E\u003Cp\u003E I\u0027ve been volunteering gofer work on this project and can answer these questions.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003E Define TVR and provide an intuitive description for it. Despite having played KSP for over a year, I\u0027ve never heard of the term before. \u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that had me scratching my head as well at first. \u003C/p\u003E\u003Cp\u003E It is the ratio of exhaust velocity to orbital velocity, or 9.82Isp/Vo. \u003C/p\u003E\u003Cp\u003E An intuitive description... As your Isp goes up, TVR goes up proportionally. As your orbital velocity goes up, TVR goes down inversely.\u003C/p\u003E\u003Cp\u003EHere\u0027s a handy table I knocked together:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EName / DVmin / orbit height/ local G/ orbit velocity/ \u003C/p\u003E\u003Cp\u003EMun / 580 / 10 km / 1.63 / 547\u003C/p\u003E\u003Cp\u003EMinmus/ 180 / 6 km / 0.491 / 164\u003C/p\u003E\u003Cp\u003EGilly / 30 / 8 km / 0.049 / 19.9\u003C/p\u003E\u003Cp\u003EMoho / 870 / 30 km / 2.70 / 776\u003C/p\u003E\u003Cp\u003EIke / 390 / 10 km / 1.10 / 364\u003C/p\u003E\u003Cp\u003EDres / 430 / 30 km / 1.13 / 358\u003C/p\u003E\u003Cp\u003EPol / 130 / 5 km / 0.373 / 121\u003C/p\u003E\u003Cp\u003EBop / 220 / 25 km / 0.589 / 166\u003C/p\u003E\u003Cp\u003ETylo / 2,270 / 60 km / 7.85 / 2,070\u003C/p\u003E\u003Cp\u003EVall / 860 / 25 km / 2.31 / 799\u003C/p\u003E\u003Cp\u003EEeloo / 620 / 20 km / 1.69 / 569\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E So as an example, using 48-7S engines (Isp= 350) to launch from the Mun (Vo= 547) would give you a TVR of 350*9.82/547= 6.3\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E 2. Define efficiency and justify why your definition is useful. Are you using payload fraction, vehicle cost per tonne of payload or something else?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E It\u0027s the ratio of \u0022perfect\u0022 Dv expenditure to how much Dv you\u0027d actually expend to achieve orbit. It\u0027s useful because it allows us to define where adding \u0022Moar boosters\u0022 is no longer beneficial due to cost and weight penalty.\u003C/p\u003E\u003Cp\u003EUsing the example above, we can see that using the contour plot at DVR= 6.3, we achieve about 58% efficiency at t/w=1 and about 90% efficiency at t/w=2. If the fuel and tankage costs and weighs less than the engines, it\u0027s not worth it to double the t/w.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-26T14:07:42Z\u0022 title=\u002212/26/2014 02:07  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 26, 2014\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-12-26T14:14:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EIt\u0027s the ratio of \u0022perfect\u0022 Dv expenditure to how much Dv you\u0027d actually expend to achieve orbit. It\u0027s useful because it allows us to define where adding \u0022Moar boosters\u0022 is no longer beneficial due to cost and weight penalty.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo efficiency is essentially (orbital velocity at altitude 0) / (optimal delta-v required to reach that orbit), which depends on the initial TWR and the ratio of Isp to orbital velocity. This is useful for estimating how much delta-v is required for the ascent with a given TWR, but less useful for determining the optimal TWR. After all, a higher TWR usually means more engine mass and more fuel required to get the same amount of delta-v.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-12-26T14:22:11Z","Content":"\n\u003Cp\u003Earkie,\u003C/p\u003E\u003Cp\u003E The above graph is lacking range in the y axis for smaller bodies and higher Isp engines (unless my math is off).\u003C/p\u003E\u003Cp\u003E It doesn\u0027t extend far enough for LV-N launches from any body smaller than Vall and doesn\u0027t accomodate PB-ION engines anywhere.\u003C/p\u003E\u003Cp\u003EIt also can\u0027t accomodate the use of any engines (no matter what the Isp) on tinier planets like Pol.\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-26T14:50:53Z\u0022 title=\u002212/26/2014 02:50  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 26, 2014\u003C/time\u003E by GoSlash27\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2014-12-26T14:33:10Z","Content":"\n\u003Cp\u003EWouldn\u0027t this need to at least be in terms that actually exist within KSP in order to be useful as a KSP gameplay aid? I.e. I\u003Csub\u003Esp\u003C/sub\u003E rather than TVR, at least. And DVR is... payload? As you defined it, it\u0027s literally \u0022ratio of how much fuel you carry to how much fuel you need to actually make orbit\u0022. With TWR and I\u003Csub\u003Esp\u003C/sub\u003E collectively defining the rocket as a whole, of course DVR has no impact - excess fuel reduces TWR instead, but if that is assumed constant then changing DVR mostly just changes the size of the rocket.\u003C/p\u003E\u003Cp\u003EBasically I\u0027m questioning the practical usefulness of the graphs as designed. It\u0027s neat as a theoretical exercise, but I\u0027m seeing no practical applications to gameplay. It\u0027s hardly any help to building a good rocket. More dV being \u0022wasted\u0022 as I\u003Csub\u003Esp\u003C/sub\u003E increases is an interesting effect in principle, however, again, inapplicable - a craft losing less mass in spent fuel with a more efficient engine means that while it \u0022wastes\u0022 dV in principle, it also means that in typical conditions it also carries more dV in the first place. There\u0027s also the theoretical maximum TWR of existing KSP engines, and tankage. Without accounting for all variables, I see little use for this graph in the gameplay tutorials section.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-12-26T14:35:28Z","Content":"\n\u003Cp\u003EJouni,\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo efficiency is essentially (orbital velocity at altitude 0) / (optimal delta-v required to reach that orbit), which depends on the initial TWR and the ratio of Isp to orbital velocity.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Not quite. It would be the \u0022perfect DV to achieve your desired orbit\u0022/ \u0022how much DV you actually expend\u0022.\u003C/p\u003E\u003Cp\u003E As an example, referring to the Mun in my table above, it would theoretically take 580 m/sec DV to achieve a stable 10kM orbit. At 50% efficiency, you would actually expend 1,160 m/sec.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThis is useful for estimating how much delta-v is required for the ascent with a given TWR, but less useful for determining the optimal TWR. After all, a higher TWR usually means more engine mass and more fuel required to get the same amount of delta-v.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E I disagree, although I said essentially the same thing.\u003C/p\u003E\u003Cp\u003E It requires more engine mass, but only marginally more fuel (the only added mass is the engine itself). Were engines massless, you could double the t/w and not require any additional fuel to make the same DV.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T15:23:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EWouldn\u0027t this need to at least be in terms that actually exist within KSP in order to be useful as a KSP gameplay aid? I.e. I\u003Csub\u003Esp\u003C/sub\u003E rather than TVR, at least. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe reason I cannot put it in terms of ISP is because ISP, alone, is not what is important. What is important for estimating efficiency is ISP*g0/v0. So having a certain ISP engine on one planet will perform differently than on others. Thus, i would need to provide a graph of efficiency vs. ISP and TWR \u003Cstrong\u003Efor every body in KSP\u003C/strong\u003E. Defining TVR, on the other hand, allows me to show \u003Cstrong\u003Ejust one graph\u003C/strong\u003E, which can be used for all planets and moons as long as the player can do some basic math to find out what their TVR is. \u003Cstrong\u003EThis is the advantage of non-dimensionalization. \u003C/strong\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EAnd DVR is... payload? As you defined it, it\u0027s literally \u0022ratio of how much fuel you carry to how much fuel you need to actually make orbit\u0022. With TWR and I\u003Csub\u003Esp\u003C/sub\u003E collectively defining the rocket as a whole, of course DVR has no impact - excess fuel reduces TWR instead, but if that is assumed constant then changing DVR mostly just changes the size of the rocket.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dont think that result is necessarily obvious, given the complicated, non-linear nature of the equations.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EBasically I\u0027m questioning the practical usefulness of the graphs as designed. It\u0027s neat as a theoretical exercise, but I\u0027m seeing no practical applications to gameplay. It\u0027s hardly any help to building a good rocket. More dV being \u0022wasted\u0022 as I\u003Csub\u003Esp\u003C/sub\u003E increases is an interesting effect in principle, however, again, inapplicable - a craft losing less mass in spent fuel with a more efficient engine means that while it \u0022wastes\u0022 dV in principle, it also means that in typical conditions it also carries more dV in the first place. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is important to know that if you increase ISP, you efficiency drops, and so while you might gain more deltaV, you will also need more deltaV to get into orbit. If a player didnt know this, they might improve their engine ISP, and reduce FMR (amount of fuel) to compensate to maintain the \u003Cstrong\u003Esame total deltaV they had before\u003C/strong\u003E, without realizing they will need more fuel to get into orbit..\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EThere\u0027s also the theoretical maximum TWR of existing KSP engines, and tankage. Without accounting for all variables, I see little use for this graph in the gameplay tutorials section.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not sure what this has to do with anything. My graphs dont suggest you go to TWR = infinity. They suggest quite the opposite, actually, that TWR \u0026gt; 2.5 are quite pointless (though very fun).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-26T15:37:23Z\u0022 title=\u002212/26/2014 03:37  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 26, 2014\u003C/time\u003E by arkie87\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Jouni","CreatedById":97346,"CreatedDateTime":"2014-12-26T16:28:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EBasically I\u0027m questioning the practical usefulness of the graphs as designed. It\u0027s neat as a theoretical exercise, but I\u0027m seeing no practical applications to gameplay.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI find it quite useful for those playing with RSS. For stock planets, there are many good estimates of the delta-v requirements for landing and taking off. For the different rescalings of the Kerbol System and the real solar system, the estimates are less accurate. This method gives a good way of estimating the delta-v requirements, once you know the velocity at a low orbit.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022GoSlash27\u0022 data-cite=\u0022GoSlash27\u0022\u003E\u003Cdiv\u003EIt requires more engine mass, but only marginally more fuel (the only added mass is the engine itself). Were engines massless, you could double the t/w and not require any additional fuel to make the same DV.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe differences in efficiency are also marginal, as people rarely build landers with TWR less than 1.5. Still, knowing which initial TWR maximizes the payload fraction for a given engine type and a given planet would be interesting.\u003C/p\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2014-12-26T16:35:14Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Jouni\u0022 data-cite=\u0022Jouni\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThe differences in efficiency are also marginal, as people rarely build landers with TWR less than 1.5. Still, knowing which initial TWR maximizes the payload fraction for a given engine type and a given planet would be interesting.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E Actually, I do and I always have (except where I can achieve higher t/w for free) for this very reason. I came to this conclusion but never had hard numbers to go from before.\u003C/p\u003E\u003Cp\u003E Hopefully I can work with all this data and boil it down to a much simpler set of recommendations; like \u0022for this engine, it\u0027s not worth it to add engines beyond such-and-such a t/w\u0022.\u003C/p\u003E\u003Cp\u003E Gonna take me a while to crunch the numbers, tho\u0027.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-12-26T16:35:18Z","Content":"\n\u003Cp\u003EThe paper mentions taking off via a Hohmann transfer. This implies taking off horizontally and giving myself a periapsis on the opposite side of the planet. I would then coast to periapsis and circularise.\u003C/p\u003E\u003Cp\u003EIn practice, to take off from the equivalent of sea level from an airless body, I need to clear any mountains or other terrain that might be in the way. Therefore, I would perform a short burn to go sub-orbital, with a periapsis at a safe altitude. I would then coast to periapsis and circularise there.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-26T16:38:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EThe paper mentions taking off via a Hohmann transfer. This implies taking off horizontally and giving myself a periapsis on the opposite side of the planet. I would then coast to periapsis and circularise.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m pretty sure you meant apoapsis - periapsis is the \u003Cstrong\u003Elow\u003C/strong\u003E point in your orbit.\u003C/p\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-12-26T16:39:56Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022armagheddonsgw\u0022 data-cite=\u0022armagheddonsgw\u0022\u003E\u003Cdiv\u003EI\u0027m pretty sure you meant apoapsis - periapsis is the \u003Cstrong\u003Elow\u003C/strong\u003E point in your orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, I meant to say apoapsis! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T16:43:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EThe paper mentions taking off via a Hohmann transfer. This implies taking off horizontally and giving myself a periapsis on the opposite side of the planet. I would then coast to periapsis and circularise.\u003Cp\u003EIn practice, to take off from the equivalent of sea level from an airless body, I need to clear any mountains or other terrain that might be in the way. Therefore, I would perform a short burn to go sub-orbital, with a periapsis at a safe altitude. I would then coast to periapsis and circularise there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFirst, i think by periapsis, you mean apoapsis? EDIT \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis paper mentions it doesnt include the effects of terrain. However, unless you are right next to a vertical ridge, there is almost always likely a relatively horizontal ascent approach.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure what you mean by a \u0022short burn to go sub-orbital\u0022. If you mean burn vertically to go a few km up, this is a really bad approach (unless you are literally next to a vertical wall) since all deltaV used to jump up will be wasted when you start to burn horizontally. \u003C/p\u003E\u003Cp\u003EYou can do that math assuming infinite TWR (impulse burns) and jumping up even a short distance is much worse than aiming as horizontal as possible.\u003C/p\u003E\u003Cp\u003EI had another thread \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/102947-Vertical-Ascent-vs-To-LXO-First\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/102947-Vertical-Ascent-vs-To-LXO-First\u003C/a\u003E that tried to see if there was a single instance in the Kerbol solar system of this being practical, and the only place i found was Minmus (since there are regions which are surrounded by tall hills).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-26T16:46:52Z\u0022 title=\u002212/26/2014 04:46  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 26, 2014\u003C/time\u003E by arkie87\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-12-26T17:19:17Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EFirst, i think by periapsis, you mean apoapsis? EDIT \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003Cp\u003EThis paper mentions it doesnt include the effects of terrain. However, unless you are right next to a vertical ridge, there is almost always likely a relatively horizontal ascent approach.\u003C/p\u003E\u003Cp\u003EI\u0027m not sure what you mean by a \u0022short burn to go sub-orbital\u0022. If you mean burn vertically to go a few km up, this is a really bad approach (unless you are literally next to a vertical wall) since all deltaV used to jump up will be wasted when you start to burn horizontally. You can do that math assuming infinite TWR (impulse burns) and jumping up even a short distance is much worse than aiming as horizontal as possible.\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI try to make my ascent path as horizontal as possible, but I rarely take off from locations that are completely flat.\u003C/p\u003E\u003Cp\u003ENormally, after take off, I would aim for a near horizontal sub-orbital trajectory that just barely clears any nearby terrain, with an apoapsis \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E at the lowest safe altitude for safe orbital flight. I would then coast to apoapsis \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E and then circularise.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T17:28:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003EI try to make my ascent path as horizontal as possible, but I rarely take off from locations that are completely flat.\u003Cp\u003ENormally, after take off, I would aim for a near horizontal sub-orbital trajectory that just barely clears any nearby terrain, with an apoapsis \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E at the lowest safe altitude for safe orbital flight. I would then coast to apoapsis \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E and then circularise.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI dont think coasting to apoapsis is fuel efficient, particularly for low TWR. You have already spent fuel to get apoapsis up, and bought yourself time to burn horizontally, I would think you should do that...\u003C/p\u003E\n"},{"CreatedByName":"Sean Mirrsen","CreatedById":3873,"CreatedDateTime":"2014-12-26T17:29:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EThe reason I cannot put it in terms of ISP is because ISP, alone, is not what is important. What is important for estimating efficiency is ISP*g0/v0. So having a certain ISP engine on one planet will perform differently than on others. Thus, i would need to provide a graph of efficiency vs. ISP and TWR \u003Cstrong\u003Efor every body in KSP\u003C/strong\u003E. Defining TVR, on the other hand, allows me to show \u003Cstrong\u003Ejust one graph\u003C/strong\u003E, which can be used for all planets and moons as long as the player can do some basic math to find out what their TVR is. \u003Cstrong\u003EThis is the advantage of non-dimensionalization. \u003C/strong\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, but then you have to provide the TVR value for every planet/engine combo you encounter. For which you need to know the mass of fuel (which isn\u0027t necessarily in any real units), the I\u003Csub\u003Esp\u003C/sub\u003E of the block of engines on your craft, and the orbital velocity at the orbit you need around the planet you\u0027re at. Having an I\u003Csub\u003Esp\u003C/sub\u003E/TWR graph per each airless body in KSP, especially since it\u0027s pretty much a matter of plugging numbers into a formula, seems like the more useful method.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI dont think that result is necessarily obvious, given the complicated, non-linear nature of the equations.\u003C/div\u003E\u003C/blockquote\u003EThere is, on the other hand, the plain, simple nature of the definition you use for DVR. Delta-V Ratio, as in \u0022the ratio of delta-V you have versus the delta-V you need\u0022. Given that definition, it\u0027s quite easy to see why its effect on the efficiency is so binary. Either you make it or you don\u0027t.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EIt is important to know that if you increase ISP, you efficiency drops, and so while you might gain more deltaV, you will also need more deltaV to get into orbit. If a player didnt know this, they might improve their engine ISP, and reduce FMR (amount of fuel) to compensate to maintain the \u003Cstrong\u003Esame total deltaV they had before\u003C/strong\u003E, without realizing they will need more fuel to get into orbit..\u003C/div\u003E\u003C/blockquote\u003EEr, no. They\u0027ll need \u003Cem\u003Eless\u003C/em\u003E fuel to get into orbit. More time than ideal perhaps, yes, and thus more dV lost to gravity, but less fuel - that\u0027s what I\u003Csub\u003Esp\u003C/sub\u003E does. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I see how it might be useful in extremely dV-tight situations though, I guess. The concept of dV needed increasing because TWR does not increase as much with less initial fuel mass fraction is rather often overlooked.\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI\u0027m not sure what this has to do with anything. My graphs dont suggest you go to TWR = infinity. They suggest quite the opposite, actually, that TWR \u0026gt; 2.5 are quite pointless (though very fun).\u003C/div\u003E\u003C/blockquote\u003ENot starting TWR. Final TWR. A craft with total mass of 3 tons, a dry mass of 1 ton, and a starting TWR of 2, will have a final TWR of 6 just as its fuel runs out - since its mass decreases threefold. Let\u0027s say .2 tons of that is tankage, .8 tons is the engine. The engine thus has a theoretical maximum TWR of 7.5, in an ideal craft without tankage. An LV-N, however, has high I\u003Csub\u003Esp\u003C/sub\u003E, but awful TWR - around 3.5, IIRC. Whatever the starting TWR and FMR, it can never go beyond that 3.5 TWR because that\u0027s how much the engines themselves weigh, even disregarding tankage.\u003Cp\u003EIf your formula assumes an ideal craft with no tankage \u003Cstrong\u003Eand\u003C/strong\u003E massless engines, with TWR approaching infinity as fuel runs out, it may very well skew your results.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T18:18:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EOkay, but then you have to provide the TVR value for every planet/engine combo you encounter. For which you need to know the mass of fuel (which isn\u0027t necessarily in any real units), the I\u003Csub\u003Esp\u003C/sub\u003E of the block of engines on your craft, and the orbital velocity at the orbit you need around the planet you\u0027re at. Having an I\u003Csub\u003Esp\u003C/sub\u003E/TWR graph per each airless body in KSP, especially since it\u0027s pretty much a matter of plugging numbers into a formula, seems like the more useful method. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhy on earth would i have to provide this? That would defeat the whole point of non-dimensionalization! The player can calculate what their TVR is for the engines they are using and the body they are departing from. \u003C/p\u003E\u003Cp\u003EIt might be more useful to use ISP and then have separate plots for each body in KSP, but it is definitely more \u003Cstrong\u003Econvenient \u003C/strong\u003Eto have one chart, which can be used to \u003Cstrong\u003Egenerate \u003C/strong\u003Eall those graphs for all those bodies in KSP, and in RSS, and for any new planets that are made etc...\u003C/p\u003E\u003Cp\u003EBesides, the definition of TVR \u003Cstrong\u003Eteaches us something about the physics\u003C/strong\u003E: that a craft with ISP=400 on a planet with V_orb = 1000 m/s will have the same efficiency as craft with ISP=800 on a planet with V_orb = 500 m/s.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EThere is, on the other hand, the plain, simple nature of the definition you use for DVR. Delta-V Ratio, as in \u0022the ratio of delta-V you have versus the delta-V you need\u0022. Given that definition, it\u0027s quite easy to see why its effect on the efficiency is so binary. Either you make it or you don\u0027t.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s not the definition of DVR. DVR is the ratio of deltaV your craft carries if it were floating in space in the absence of any gravitational field to the amount of deltaV required to get into orbit using an impulse burn i.e. minimum possible. It \u003Cstrong\u003Ecould \u003C/strong\u003E easily have been the case that carrying more deltaV would effect efficiency and require higher TWR. Regardless, it is good to \u003Cstrong\u003Eknow and show\u003C/strong\u003E it doesnt.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EEr, no. They\u0027ll need \u003Cem\u003Eless\u003C/em\u003E fuel to get into orbit. More time than ideal perhaps, yes, and thus more dV lost to gravity, but less fuel - that\u0027s what I\u003Csub\u003Esp\u003C/sub\u003E does. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I see how it might be useful in extremely dV-tight situations though, I guess. The concept of dV needed increasing because TWR does not increase as much with less initial fuel mass fraction is rather often overlooked.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe are talking past each other. I agree, they will need less mass of fuel-- that is what increasing ISP does. However, knowing this, players are likely to decrease the mass of their fuel accordingly (!) such that they will have the same total deltaV, not realizing that they need more deltaV to get into orbit due to reduced efficiency (assuming they also adjusted their engines to maintain the same TWR)....\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003ENot starting TWR. Final TWR. A craft with total mass of 3 tons, a dry mass of 1 ton, and a starting TWR of 2, will have a final TWR of 6 just as its fuel runs out - since its mass decreases threefold. Let\u0027s say .2 tons of that is tankage, .8 tons is the engine. The engine thus has a theoretical maximum TWR of 7.5, in an ideal craft without tankage. An LV-N, however, has high I\u003Csub\u003Esp\u003C/sub\u003E, but awful TWR - around 3.5, IIRC. Whatever the starting TWR and FMR, it can never go beyond that 3.5 TWR because that\u0027s how much the engines themselves weigh, even disregarding tankage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is true but not relevant at all. My model requires inputs of TWR, TVR, and DVR. The players can get these numbers from their craft and use it to assess whether their design has enough deltaV. \u003C/p\u003E\u003Cp\u003EIt might not be possible to get any arbitrary combination of TWR, TVR, and DVR from the parts available in KSP, as you pointed out. The player either (a) supplies these numbers using current design to assess current design, (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E uses the results to generally guide TWR selection (i.e. keep it 1.4 \u0026lt; TWR \u0026lt; 1.6) or © uses the results to try to improve design, but has to cleverly tradeoff TWR, TVR, and DVR to improve efficiency since adding removing one part might improve TWR, but reduce TVR and/or DVR...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sean Mirrsen\u0022 data-cite=\u0022Sean Mirrsen\u0022\u003E\u003Cdiv\u003EIf your formula assumes an ideal craft with no tankage \u003Cstrong\u003Eand\u003C/strong\u003E massless engines, with TWR approaching infinity as fuel runs out, it may very well skew your results.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EMy formula assumes nothing about the craft, except its TWR, TVR, and DVR. If you can get those values, then the model will predict results accurately. For the case you described above, where the only mass of the ship is fuel, then DVR = infinity since m_wet/m_dry = infinity since m_dry = 0. Thus, in order for my model to \u0022make\u0022 those assumptions, I will have to input DVR = infinity. Otherwise, it assumes realistic values for DVR.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-26T18:21:47Z\u0022 title=\u002212/26/2014 06:21  PM\u0022 data-short=\u00229 yr\u0022\u003EDecember 26, 2014\u003C/time\u003E by arkie87\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Torquemadus","CreatedById":97777,"CreatedDateTime":"2014-12-26T18:59:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022arkie87\u0022 data-cite=\u0022arkie87\u0022\u003E\u003Cdiv\u003EI dont think coasting to apoapsis is fuel efficient, particularly for low TWR. You have already spent fuel to get apoapsis up, and bought yourself time to burn horizontally, I would think you should do that...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo, I\u0027m trying to get into orbit from an airless body using minimum fuel. At take off, I burn as horizontal as I possibly can, taking care not to collide with any nearby mountains or other intervening terrain. This puts me on a sub-orbital trajectory with an apoapsis high enough to avoid crashing, but no higher.\u003C/p\u003E\u003Cp\u003EAs I approach apoapsis, I begin a burn to circularise into orbit. I try to time the burn so that it occurs as close to apoapsis as I can within the limits of the thrust my spacecraft can produce. This puts me in a minimum altitude orbit that only just barely clears the terrain. In practice, flying just barely above the terrain is pretty scary! I usually give myself a small margin of error for the sake of safety.\u003C/p\u003E\n"},{"CreatedByName":"arkie87","CreatedById":103434,"CreatedDateTime":"2014-12-26T19:49:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Torquemadus\u0022 data-cite=\u0022Torquemadus\u0022\u003E\u003Cdiv\u003ESo, I\u0027m trying to get into orbit from an airless body using minimum fuel. At take off, I burn as horizontal as I possibly can, taking care not to collide with any nearby mountains or other intervening terrain. This puts me on a sub-orbital trajectory with an apoapsis high enough to avoid crashing, but no higher.\u003Cp\u003EAs I approach apoapsis, I begin a burn to circularise into orbit. I try to time the burn so that it occurs as close to apoapsis as I can within the limits of the thrust my spacecraft can produce. This puts me in a minimum altitude orbit that only just barely clears the terrain. In practice, flying just barely above the terrain is pretty scary! I usually give myself a small margin of error for the sake of safety.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, but if you have low TWR (which in general, should be cheaper in terms of funds, since it requires fewer engines), you cannot wait until you reach apoapsis to burn horizontal, since you cannot accelerate fast enough. Thus, you probably have to start burning horizontally before, and once you reach apoapsis, then pitch up to the angle necessary to keep \u0022time to apoapsis\u0022 as close to zero seconds as possible \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, yeah it is scary. Sometimes you pass over a hill by only a few meters \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E Gets the blood pumping...\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2014-12-26T20:09:14Z","Content":"\n\u003Cp\u003ENice work.\u003C/p\u003E\u003Cp\u003EI\u0027m curious about a further question: say you\u0027re on the lip of a crater, infinitely deep, and you won\u0027t reach orbital velocity by the time you get to the other side. Should you follow this grazing approach, or should you fall into the crater a bit (thrusting due sideways) and recover later on?\u003C/p\u003E\n"}]}