{"TopicId":94744,"ForumId":16,"TopicTitle":"KSP Glitch/Noob mistake: Triple Cylinder Connector on Both Ends Doesn\u0026#039;t Work","CreatedByName":"Shadowblade","CreatedById":133578,"CreatedDateTime":"2014-12-28T04:15:08Z","PageNum":1,"Articles":[{"CreatedByName":"Shadowblade","CreatedById":133578,"CreatedDateTime":"2014-12-28T04:15:08Z","Content":"\n\u003Cp\u003EHey there fellow KSP players and fans, I seem to have stumbled upon a glitch that I can\u0027t seem to find a work around to. I\u0027m not sure if this is a noob mistake or a glitch, whether or not it is fixable, I have no idea. Basically I have a triple cylinder connector that is attached to three fuel canisters then is connected to another triple cylinder connector that is rotated upside down. What seems to happen is the one I connect it to works, but the other two are not connected and clip into each other. Here\u0027s a screenshot so you know what I\u0027m talking about: \u003Cimg src=\u0022http://i.imgur.com/pvAWDhU.jpg\u0022 alt=\u0022pvAWDhU.jpg\u0022\u003E Any ideas on how to fix? Thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-12-28T04:48:09Z\u0022 title=\u002212/28/2014 04:48  AM\u0022 data-short=\u00229 yr\u0022\u003EDecember 28, 2014\u003C/time\u003E by Claw\u003C/strong\u003E\n\u003Cbr\u003Etags\n\u003C/span\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2014-12-28T04:47:22Z","Content":"\n\u003Cp\u003EYes, this is how KSP works. Craft are built as a tree structure, which means it can continue to branch out but never loops back. So you can split 1-\u0026gt;3 but you can\u0027t join 3-\u0026gt;1 without using either docking ports or other tricks.\u003C/p\u003E\u003Cp\u003EI will move this to Gameplay Questions, and I\u0027m sure you will get lots of good examples of ways to deal with this quirk of ship construction.\u003C/p\u003E\u003Cp\u003EWelcome to the forums!\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"Kryxal","CreatedById":102688,"CreatedDateTime":"2014-12-28T15:22:46Z","Content":"\n\u003Cp\u003EI\u0027ve read about this one, pairs of docking ports should do the trick. Only one will be a \u0022ship\u0022 connection, but once physics loads, the other two will dock and become \u0022structural\u0022 connections.\u003C/p\u003E\n"},{"CreatedByName":"Anquietas314","CreatedById":8761,"CreatedDateTime":"2014-12-28T17:43:43Z","Content":"\n\u003Cp\u003EYou can solve that quite easily using struts and fuel lines from the other two tanks \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Just make sure the fuel lines feed \u003Cstrong\u003Efrom\u003C/strong\u003E the tanks \u003Cstrong\u003Eto\u003C/strong\u003E the stack tricoupler. Obviously the struts don\u0027t matter so much, but you do need them otherwise the tanks will still bend like that. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EPersonally I just never use the tricouplers for anything other than feeding 3 engines from one tank, but each to their own \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"}]}