{"TopicId":97139,"ForumId":16,"TopicTitle":"Lifter-Payload Mass Percentage","CreatedByName":"Solivagant","CreatedById":112623,"CreatedDateTime":"2015-01-19T05:25:58Z","PageNum":1,"Articles":[{"CreatedByName":"Solivagant","CreatedById":112623,"CreatedDateTime":"2015-01-19T05:25:58Z","Content":"\n\u003Cp\u003EI\u0027m wondering, what percent of the total mass should my payloads be? The lifters I\u0027m designing carry between 13 and 15 percent, is that an okay amount? What sort of tips do you guys have for improving this?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-19T17:11:34Z\u0022 title=\u002201/19/2015 05:11  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 19, 2015\u003C/time\u003E by Solivagant\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"UmbralRaptor","CreatedById":2767,"CreatedDateTime":"2015-01-19T07:09:30Z","Content":"\n\u003Cp\u003EDepends on details of the craft design. Given recent part buffs, 13-15% is plausible for 2 stage (and sometimes single stage) liquid fuel rockets. Single stage ones can run anywhere from ~5-15%, depending on choice of engines, tankage, and ascent profile. Mixed solid/liquid designs might well get down to or below 10%. If you go the asparagus route with 3-4 stages, I would aim for 15-20%. Turbojets make a mockery of this, with payload fractions of up to 70%.\u003C/p\u003E\n"},{"CreatedByName":"Mad_Maelstrom","CreatedById":135276,"CreatedDateTime":"2015-01-19T07:11:11Z","Content":"\n\u003Cp\u003EBetween 13 and 15 percent sounds pretty good to me, especially if it is reliable.\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-01-19T07:13:26Z","Content":"\n\u003Cp\u003EWith a well designed 2-stage liquid fuelled rocket I typically get about 16%. You\u0027re not too far off from that so you\u0027re doing pretty good. Regarding tips, you should check out the following thread, in which, by coincidence, we\u0027re having a very similar conversation.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/107763-Designing-Launch-Vehicles\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/107763-Designing-Launch-Vehicles\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E (edited to add)\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EWith an all-solid first stage my payload drops to about 13%. With a combination of a liquid first stage and SRB strap-ons I can still get close to 16%. In all cases these percentages require flying a very precise and efficient ascent profile with little margin for error. A poorly flown ascent will reduce these percentages. This is also assuming a low orbit of about 75 km.\u003C/p\u003E\u003Cp\u003EI also find that my designs using large and extra large parts generally get better payload fractions. When I build rockets from small parts I usually don\u0027t do any better than about 13%.\u003C/p\u003E\u003Cp\u003EAlso note that these percentages are when pushing the launch vehicle to its maximum performance. Sometimes it is necessary to overdesign simply because we\u0027re forced to round up to the next biggest available part. It\u0027s not always possible to construct the most ultra-efficient rocket for a particular payload size.\u003C/p\u003E\u003Cp\u003EI should also note that my comments are based on the stock game without any of the aerodynamic mods.\u003C/p\u003E\u003Cp\u003EAll things considered, your 13-15% sounds about right.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-19T08:09:53Z\u0022 title=\u002201/19/2015 08:09  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 19, 2015\u003C/time\u003E by OhioBob\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-01-19T11:03:07Z","Content":"\n\u003Cp\u003EI agree with the above posts.\u003C/p\u003E\u003Cp\u003E 15% is totally reasonable for rockets. Turbojet spaceplanes can exceed 60% and turbojet VTOL lifters can exceed 100%.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"Pecan","CreatedById":96332,"CreatedDateTime":"2015-01-19T13:53:01Z","Content":"\n\u003Cp\u003EAnd again, agreed 13-15% payload ratio is an entirely respectable range.\u003C/p\u003E\u003Cp\u003EFor liquid-fuelled rockets 10% is just about acceptable, 15% starts to look efficient and anything over 17% good. Best I\u0027ve seen, IIRC, was just over 20%.\u003C/p\u003E\u003Cp\u003EThe four things that dictate payload ratio are structural and fuel mass, TWR and staging so the tips for improving it are:\u003C/p\u003E\u003Cp\u003EStructural mass - On a launch vehicle remove everything apart from the fuel and engines and, if you can\u0027t fly without it, a reaction wheel/SAS unit.\u003C/p\u003E\u003Cp\u003EFuel mass - Use higher-Isp engines, provided they deliver enough thrust, so less fuel. (Some experiment required - heavy LV-Ns usually too low-thrust to be effective launch engines).\u003C/p\u003E\u003Cp\u003ETWR - Doesn\u0027t directly affect payload-ratio, but a high TWR means more engine mass. Beginner recommendations are for launch TWR 1.6 - 2 but good results can be had with a ratio as low as 1.2 or so. A final circularisation stage can also work well with a low TWR, possibly even below 1.\u003C/p\u003E\u003Cp\u003EStaging - More stages, with the appropriate engine(s) for the speeds/altitudes at which they\u0027ll be used, are roughly more efficient but the parts for decouplers, etc. add to structural mass so there are still diminishing returns. A launch vehicle with three (serial) or four (asparagus) stages is about as far as it\u0027s worth going. Checkout esoteric staging strategies like twisted candle too.\u003C/p\u003E\u003Cp\u003EYou\u0027re doing well enough that you probably won\u0027t get much benefit from those though. Jets are probably the only way you\u0027ll get any significant improvement.\u003C/p\u003E\n"},{"CreatedByName":"cicatrix","CreatedById":120831,"CreatedDateTime":"2015-01-19T14:14:01Z","Content":"\n\u003Cp\u003EA well-built rocket can have 18-22%. 15-18% is a good result. \u0026lt;15% is somewhat poor\u003C/p\u003E\u003Cp\u003ECheck out this calculator - it will help you in your designs. There was a time I used it a lot right until the moment I learned to do this myself:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://garycourt.github.io/korc\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EKSP Optimal Rocket Calculator for Kerbal Space Program 0.90\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-19T14:16:03Z\u0022 title=\u002201/19/2015 02:16  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 19, 2015\u003C/time\u003E by cicatrix\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-01-19T14:22:18Z","Content":"\n\u003Cp\u003E13-15% is respectable. I consider a rocket lifter reasonably efficient if it can get one sixth of its mass into orbit (~17% payload fraction), chasing more than that requires overly complex staging for me.\u003C/p\u003E\u003Cp\u003EIf you want better payload fractions, use liquid fueled rocket engines and onion or asparagus staging.\u003C/p\u003E\n"},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2015-01-19T15:37:21Z","Content":"\n\u003Cp\u003EBest I\u0027ve done in FAR \u002B KW with a 140t launchpad limit is about 23-24t payload into LKO. That\u0027s about 17% fraction.\u003C/p\u003E\u003Cp\u003ESRBs with about 1.5k of DV (I use KW\u0027s SRBs)\u003C/p\u003E\u003Cp\u003Emain stage of another 2k DV (Mainsail)\u003C/p\u003E\u003Cp\u003Eorbit stage to push it the final bit into a circular orbit (Poodle)\u003C/p\u003E\n"},{"CreatedByName":"OhioBob","CreatedById":128005,"CreatedDateTime":"2015-01-19T16:37:03Z","Content":"\n\u003Cp\u003EThe best I\u0027ve been able to do in stock using two stages is 17.5%. I like to keep things simple, so 2 stages or 2 stages \u002B SRBs is about all I\u0027ve experimented with. It doesn\u0027t surprise me that more complex staging designs can get to 20% or more.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2015-01-20T00:55:33Z","Content":"\n\u003Cp\u003EIf you are not doing better then 15% with conventional staging, you are pushing too much fuel in your boosters.\u003C/p\u003E\u003Cp\u003E25% on a SSTO is possible.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4uhpWdq.jpg\u0022 alt=\u00224uhpWdq.jpg\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-20T00:57:37Z\u0022 title=\u002201/20/2015 12:57  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 20, 2015\u003C/time\u003E by SRV Ron\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"cantab","CreatedById":104935,"CreatedDateTime":"2015-01-20T01:04:45Z","Content":"\n\u003Cp\u003EThat\u0027s apples and oranges though, since you\u0027re counting the lifter as payload. In some cases that\u0027s relevant, for example if you use the same stage for circularising and for trans-Munar-injection (\u003Cem\u003Ea la\u003C/em\u003E the Saturn V), but it\u0027s not really fair to compare the figures to a \u0022pure\u0022 lifter and payload design.\u003C/p\u003E\n"}]}