{"TopicId":97606,"ForumId":16,"TopicTitle":"Mechjeb (I caved in and got it) - docking question.","CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-01-24T02:26:12Z","PageNum":1,"Articles":[{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-01-24T02:26:12Z","Content":"\n\u003Cp\u003EWell I\u0027m putting together a spacecraft in orbit finally, and I\u0027m using Mechjeb to do it, it\u0027s REALLY simple and easy once you get the hang of it. One problem. While I figured out automated docking fairly quickly...my piece I sent up did not dock with it...since the piece I was docking with somehow ended ON TOP of the new piece I sent up. Not nose to tail like I wanted. wierd. Any tips on preventing this from hapenning in the future?\u003C/p\u003E\n"},{"CreatedByName":"Dazpoet","CreatedById":132380,"CreatedDateTime":"2015-01-24T02:32:48Z","Content":"\n\u003Cp\u003EDid you choose the docking port and click \u0022Control from here\u0022 on it?\u003C/p\u003E\n"},{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-01-24T02:55:53Z","Content":"\n\u003Cp\u003EI did, and I also Set Target on the other one. I\u0027m gonna try it again in a bit. maybe I was JUUUUUST a bit too premature on the maneuver.\u003C/p\u003E\n"},{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-01-24T05:18:03Z","Content":"\n\u003Cp\u003EStill not working, but I think I have a workaround. When the second piece is JUST hugging the first, back up with RCS thrusters, use SAS to point to the target, and give it a \u003Cstrong\u003E\u003Cem\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ELIIIIIIIITLE\u003C/span\u003E\u003C/em\u003E\u003C/strong\u003E bit of thrust. they will collide and hopefully hold on.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:8px;\u0022\u003E\u003Cspan style=\u0022color:#C0C0C0;\u0022\u003E- - - Updated - - -\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ESTILL not working. Okay I have a couple of screenshots for you guys so you could help me out.\u003C/p\u003E\u003Cp\u003EHere I am closing in with RCS to my \u0022cockpit\u0022 for my ship:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i3.photobucket.com/albums/y82/Draconiator/Docking1_zpsfff344d6.jpg\u0022 alt=\u0022Docking1_zpsfff344d6.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m using the Docking Autopilot of Mechjeb, and for some strange reason I always end up similar to this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i3.photobucket.com/albums/y82/Draconiator/Docking2_zps58ff637d.jpg\u0022 alt=\u0022Docking2_zps58ff637d.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhat the heck is going on here?\u003C/p\u003E\n"},{"CreatedByName":"WuphonsReach","CreatedById":130759,"CreatedDateTime":"2015-01-24T05:35:24Z","Content":"\n\u003Cp\u003ETips for manual MechJeb docking (once within 2.5km):\u003C/p\u003E\u003Cp\u003E#1 Switch to vessel B with \u0027[\u0027 or \u0027]\u0027, right click on the docking port that you want to dock on and pick \u0022control from here\u0022\u003C/p\u003E\u003Cp\u003E#2 On vessel B, set target to vessel A\u003C/p\u003E\u003Cp\u003E#3 In SmartASS click \u0022TGT\u0022 then \u0022TGT \u002B\u0022 buttons to point at the target\u003C/p\u003E\u003Cp\u003E#4 Switch back to vessel A, repeat the \u0022control from\u0022 on the correct docking port and setting of target and SmartASS\u003C/p\u003E\u003Cp\u003EStart thrusting towards your target with \u0027H\u0027 RCS thrusters until you have about a 1-2 m/s closing rate and the numbers are ticking down.\u003C/p\u003E\u003Cp\u003EFire up the DPAI addon and use I/J/K/L keys to push the prograde marker into the center of the window. Use Q/E keys to rotate your vessel to match the alignment of the docking port on both vessels.\u003C/p\u003E\u003Cp\u003EInitial closing rate should be 1.5-3.0 m/s until you get within 100m of target. Switch back and forth between vessels every 100m of closing distance or every 30 seconds. Keep adjusting translation with I/J/K/L keys (you don\u0027t have to be exact, just get the prograde marker within the orange circles).\u003C/p\u003E\u003Cp\u003EAt around 100m, drop closing speed to 1.0-1.5 m/s. Drop closing speed again at 50m distance to 0.75-1.0 m/s. Drop closing speed again at 25m distance to just 0.5 m/s. Keep switching between vessels to fine tune things with I/J/K/L keys.\u003C/p\u003E\u003Cp\u003ENote that using SmartASS to assist in keeping the two docking ports pointed at each other only works if both ships have RCS or attitude control. Without it, you\u0027re in for a lot more fun.\u003C/p\u003E\n"},{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-01-24T08:18:39Z","Content":"\n\u003Cp\u003EHmmm, I THINK I know what is going on. I will have to redo the whole thing again to find out though. Stand by.\u003C/p\u003E\n"},{"CreatedByName":"Skorpychan","CreatedById":72052,"CreatedDateTime":"2015-01-24T09:42:55Z","Content":"\n\u003Cp\u003EIf your RCS is balanced, you can just dock yourself after mechjeb has gotten you to a nice close encounter.\u003C/p\u003E\n"},{"CreatedByName":"micr0wave","CreatedById":136352,"CreatedDateTime":"2015-01-24T12:48:58Z","Content":"\n\u003Cp\u003EOn one of my stations i tried for 2 days to dock something and finally gave up. After i went back to a pre-launch save of the station i found out i had the port attached with the wrong side up.\u003C/p\u003E\n"},{"CreatedByName":"moogoob","CreatedById":118251,"CreatedDateTime":"2015-01-24T16:27:47Z","Content":"\n\u003Cp\u003EI use MJ religiously (seriously, it\u0027s a Swiss-army-knife of useful features) and still dock manually 90% of the time. I can\u0027t say the same for ascent, rendezvous or planetary transfer (thank you porkchop plots!) however.\u003C/p\u003E\n"},{"CreatedByName":"Draconiator","CreatedById":133772,"CreatedDateTime":"2015-01-24T17:35:45Z","Content":"\n\u003Cp\u003EMy hunch was correct:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i3.photobucket.com/albums/y82/Draconiator/Draerospace/ProblemSolved_zps4479d350.jpg\u0022 alt=\u0022ProblemSolved_zps4479d350.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EYep, the docking ports were on the wrong way. was under the assumption that it didn\u0027t matter which way they were. Ended up redesigning those two sections too. Now that I know how to do it, next up is the habitation module, the power module (simple 8-way radial solar panels on a fuel tank)...and the main engines.\u003C/p\u003E\n"}]}