{"TopicId":98197,"ForumId":16,"TopicTitle":"Node/Navigation Help Needed","CreatedByName":"KBoy420","CreatedById":136695,"CreatedDateTime":"2015-01-29T20:02:59Z","PageNum":1,"Articles":[{"CreatedByName":"KBoy420","CreatedById":136695,"CreatedDateTime":"2015-01-29T20:02:59Z","Content":"\n\u003Cp\u003EHi Guys,\u003C/p\u003E\u003Cp\u003ESuccessfully landed (and returned) from Mimus last night. Sure was a struggle. Realizing I could wait for a better alignment to not have to mess as much with inclination, I decided against it because I wanted to figure out how to use a node with more than just pro/retrograde. So I launched and made sure I would need to adjust inclination to pick up Minmus. I struggled for a half hour with the nodes and could sure use some practical help understanding navigating and how to use the nodes. I\u0027ve read several tutorials and understand what the various directions do to your orbit, but I can\u0027t put it all together in practice.\u003C/p\u003E\u003Cp\u003ENodes seem impossible to tweak gradually. No matter how hard I try the node adjustments happen to fast and too drastically. Is there a modifier key or some other way to more gradually adjust your nodes? \u003C/p\u003E\u003Cp\u003EHow do you know how to change your orbit accurately? Are you just trying to \u0022match up the lines\u0022 and look at them from different angles to get your inclination? I have Kerbal Engineer, can I be using that to help me with navigating and chancing my orbits?\u003C/p\u003E\u003Cp\u003ESomehow I was able to adjust my node leaving Kerbin and after messing with it for 20 minutes somehow managed to get a Minmus encounter. Honestly I have no idea what I did to get it to happen so I can\u0027t repeat it. \u003C/p\u003E\u003Cp\u003EAny tips or other suggestions would be great. Seems pretty daunting trying to get any further than Minmus at this point.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-29T20:19:39Z","Content":"\n\u003Cp\u003EStep 1: Get to a parking orbit around Kerbin (I\u0027m assuming you can do this so I\u0027m not explaining it.)\u003C/p\u003E\u003Cp\u003EStep 2: Match inclination with Minmus.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EFind minmus on the map and set target. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAN and DN modes will appear on your orbit. Create a maneuver node at the closest one. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdjust the pink triangle markers until hovering over the AN or DN marker shows 0.0 \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBurn. Double check to make sure your AN/DN are 0 after deleting the node \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EStep 3: Find an encounter.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECreate a maneuver node on the opposite side of Kerbin from Minmus and extend it prograde until it crosses a little bit beyond Minmus orbit. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EGrab the center white circle and drag the node around your orbit so the AP is ahead of Minmus current position in Minmus orbit \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EKeep going till you find an encounter. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdjust that encounter until AP is as close as you can to Minmus without getting below \u003Ca href=\u0022https://www.google.com/url?sa=t\u0026amp;rct=j\u0026amp;q=\u0026amp;esrc=s\u0026amp;source=web\u0026amp;cd=1\u0026amp;ved=0CB4QFjAA\u0026amp;url=http%3A%2F%2Fwiki.kerbalspaceprogram.com%2Fwiki%2FMinmus\u0026amp;ei=cpTKVPLqKsaeggTjmoLYCw\u0026amp;usg=AFQjCNGVTkFy4rUkzVYa840YYjnA5YuS-Q\u0026amp;bvm=bv.84607526,d.eXY\u0022 rel=\u0022external nofollow\u0022\u003Ethe highest peak\u003C/a\u003E, make sure your coming in behind Minmus orbit direction so you will orbit correctly (unless you want to go backward, which may be desired for some contracts). \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAdjust using the prograde/retrograde to get closer if you need to, only after you are as close as you can adjusting your burn time (white circle). \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EUse the pink triangles to adjust the inclination you want, you can usually eyeball it pretty close and adjust it like you did Kerbin later, but it\u0027s cheaper fuel wise to get close now \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBurn \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EStep 4: Capture\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOnce you get to your new Pe around Minmus, burn retrograde to capture. \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EStep 5: Return trip.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EWait till your craft is on the side of Minmus facing Kerbin (or create a maneuver node there, right in the middle). This assumes you went in for the 0 degree inclination or close to it. (doesn\u0027t have to be perfect, but not polar). If you are orbiting backward from Minmus rotation (180 degree inclination), create the node furthest from Kerbin on the other side. \u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBurn prograde for a cheap return. In most cases you will be able to go straight into the atmosphere, other times you may have to get close leave Minmus SOI and burn retrograde at you AP around Kerbin. (For the Mun you will always get in the atmosphere) \u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-29T20:26:48Z\u0022 title=\u002201/29/2015 08:26  PM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 29, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"KBoy420","CreatedById":136695,"CreatedDateTime":"2015-01-29T21:18:02Z","Content":"\n\u003Cp\u003EThanks Alshain. I\u0027ll give that a try later on.\u003C/p\u003E\n"},{"CreatedByName":"match","CreatedById":91708,"CreatedDateTime":"2015-01-30T00:04:54Z","Content":"\n\u003Cp\u003EYou can fine tune the nodes by hovering your mouse over the handle you are manipulating and using scroll wheel. The speed you spin the wheel will change the increment of the adjustment.\u003C/p\u003E\n"},{"CreatedByName":"Sirrobert","CreatedById":70591,"CreatedDateTime":"2015-01-30T00:33:56Z","Content":"\n\u003Cp\u003EAlternativley, if you grab the opposite handle (so retrograde if you want to go prograde) and push it IN, you also add prograde speed, but not as fast as when you dragged the prograde out.\u003C/p\u003E\u003Cp\u003EFurther, as a more advanced, but cheaper version of Alshain\u0027s guide to get to Minmus, you could swap step 3 and step 2.\u003C/p\u003E\u003Cp\u003ESo you\u0027d first make a prograde manouver to get your orbit out to Minmus for an encounter. At this point you won\u0027t get an encounter, because the inclination is all wrong. That is the next step.\u003C/p\u003E\u003Cp\u003EAFTER you are on your way to Minmus, you will pass a accending/decending node. At this point, adjust your inclination to match Minmus. If you did it right, you will now have a close encounter with Minmus, if not a full encounter. Because you are moving slower during the inclination change (further away from Kerbin), it will be cheaper to do, and thus you save fuel.\u003C/p\u003E\u003Cp\u003ENOTE: this only works if you already have a feel for when where you should place the first manouver node (to get out to Minmus). This will come with experience. After you\u0027ve been to Minmus a few times, you\u0027ll instinctively know where to start burning (same with Mun. Eventually you won\u0027t even need a manouver node to get to the Mun anymore, you\u0027ll know exactly when to burn)\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-30T00:59:00Z","Content":"\n\u003Cp\u003EYou can also double click on Minmus to shift focus to it, that helps when precision adjusting your maneuver node from a distance where it\u0027s cheaper.\u003C/p\u003E\u003Cp\u003ESometimes the Mun will get in your way. It\u0027s not common because they are on different inclinations, but still possible since minmus crosses the Mun\u0027s inclination twice in it\u0027s orbit..\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-01-30T01:05:15Z\u0022 title=\u002201/30/2015 01:05  AM\u0022 data-short=\u00229 yr\u0022\u003EJanuary 30, 2015\u003C/time\u003E by Alshain\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NASAHireMe","CreatedById":131205,"CreatedDateTime":"2015-01-30T00:59:22Z","Content":"\n\u003Cp\u003EAlshain\u0027s advice is great and will certainly help you get back to Minmus. Some more generalized tips.\u003C/p\u003E\u003Cp\u003EManeuver nodes are finicky. I recommend installing MechJeb or PreciseNode so you spend less time with the frustrating manuever node handles. They let you input precise amounts. You can still hand-fly it, or let the computer burn for you (MechJeb). Kerbal Engineer won\u0027t help you much here-- it\u0027s mostly a construction aid (MechJeb combines the two, so perhaps an upgrade to MechJeb would come in handy).\u003C/p\u003E\u003Cp\u003EAlso, don\u0027t feel too bad about it. Minmus has a very small sphere of influence (SOI) because it has very little mass, so getting an encounter can be frustrating. You should have no problems getting encounters with the Mun. Likewise, if you understand the basics on interplanetary transfers, getting encounters with Eve should not be very difficult either. So don\u0027t let your struggles with Minmus deter you; getting all the way to Eve is actually almost easier than getting to Minmus (no inclination change, not much more dV for the burn, large SoI to aim for, etc.)\u003C/p\u003E\n"},{"CreatedByName":"Srpadget","CreatedById":111267,"CreatedDateTime":"2015-01-30T01:25:27Z","Content":"\n\u003Cp\u003EDunno what you use for an input device when working with maneuver nodes. Advice for a mouse with a scroll wheel is given above. I use a trackpad, and I\u0027ve had good luck with precision node adjustments by *rocking* my finger back and forth rather than dragging it. Leave it in place and just kind of \u0022roll\u0022 your fingertip (if you\u0027ve ever had your fingerprints taken, you know the motion I\u0027m talking about; but for precisely controlling nodes it\u0027s just a TINY rocking motion, barely perceptible.) And the MOMENT you see ANY kind of movement in the node handle, STOP.\u003C/p\u003E\u003Cp\u003EIt\u0027s kind of like the advice given to people who are just learning to dock: \u0022If you think you might be moving, you are. If you KNOW you\u0027re moving, then you\u0027re going too fast.\u0022\u003C/p\u003E\n"},{"CreatedByName":"Claw","CreatedById":100668,"CreatedDateTime":"2015-01-30T02:19:08Z","Content":"\n\u003Cp\u003EAlshain\u0027s advice is pretty solid. Although after I got some experience, I found myself too impatient to wait until the planes were better aligned. When you are practicing Alshain\u0027s advice, try to pay attention to where Minmus is in relation to where your maneuver node is (and where the peak of your planned orbit takes you).\u003C/p\u003E\u003Cp\u003EI found that after figuring out roughly how far ahead to plan my maneuver, I could wait to do the plane change until half way (or three quarters) to Minmus. It can save a lot of dV and time, but does take practice. I also found that after \u0022figuring this out,\u0022 it helped me out with other maneuver planning. You\u0027ll start to get a feel for \u0022about here\u0022 is the right place to put stuff, and the maneuver nodes get a little easier to manipulate with practice.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-01-30T05:41:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Claw\u0022 data-cite=\u0022Claw\u0022\u003E\u003Cdiv\u003EAlshain\u0027s advice is pretty solid. Although after I got some experience, I found myself too impatient to wait until the planes were better aligned. When you are practicing Alshain\u0027s advice, try to pay attention to where Minmus is in relation to where your maneuver node is (and where the peak of your planned orbit takes you).\u003Cp\u003EI found that after figuring out roughly how far ahead to plan my maneuver, I could wait to do the plane change until half way (or three quarters) to Minmus. It can save a lot of dV and time, but does take practice. I also found that after \u0022figuring this out,\u0022 it helped me out with other maneuver planning. You\u0027ll start to get a feel for \u0022about here\u0022 is the right place to put stuff, and the maneuver nodes get a little easier to manipulate with practice.\u003C/p\u003E\u003Cp\u003EGood luck!\u003C/p\u003E\u003Cp\u003ECheers,\u003C/p\u003E\u003Cp\u003E~Claw\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELol, that\u0027s an interesting idea, I never did that one. But now I actually launch straight to Minmus inclination from KSC. I felt that challenge would be a little above a beginner, but something to go for later.\u003C/p\u003E\n"},{"CreatedByName":"fran13kie","CreatedById":70553,"CreatedDateTime":"2015-01-30T17:30:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Srpadget\u0022 data-cite=\u0022Srpadget\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EIt\u0027s kind of like the advice given to people who are just learning to dock: \u0022If you think you might be moving, you are. If you KNOW you\u0027re moving, then you\u0027re going too fast.\u0022\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI find it is easier to tell if you are pulling on the handles by bringing up the Navball in the map screen. You can pay attention to the DV required changing as you play with the handles and this makes precision adjustments more simple.\u003C/p\u003E\n"}]}