{"TopicId":98581,"ForumId":16,"TopicTitle":"Reaction wheels flashing \u0026quot;Not enough electricity\u0026quot;","CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-02-02T19:34:57Z","PageNum":1,"Articles":[{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-02-02T19:34:57Z","Content":"\n\u003Cp\u003ESo im building a telescope with Hullcam VDS that can track targets. I need very high precision so I can track ascending rockets and objects in orbit. ( BHDArmory provides a 500km load distance when edited ) and I\u0027ve almost got it. And what I\u0027ve learned in trying to achieve precision is that balance is the key. When disabling SAS the telescope should remain fixed. And I nearly have that. Another thing I learned. The more reaction wheels the more precise the telescope. For the longest time I thought the opposite, but when you have a good balance SAS works wonders.\u003C/p\u003E\u003Cp\u003ENow I have three sets of reaction wheels on this telescope. a very small set for slewing the telescope around ( all sets activated is to much torque and disturbs the base. ) a medium set and a large set upon which I activate once I fix the scope on the target. At first you can see the target ( Duna in this instance ) is off center in the view. So I activate my \u0022medium\u0022 SAS and it centers the view so I can zoom in even more. So I figure the more SAS the better I can get this tracking. But the problem im having is when ALL SAS is activated the view starts to bob up and down. Couldn\u0027t figure out why until I saw the last set of reaction wheels activated flashing \u0022Not enough electricity\u0022 Just for an instant. On and off. And you can see what its doing when zoomed in. Kill a set of reaction wheels and the view stabilizes again. So im hoping that if I can fix this issue I can get my targets centered in my view. Adding more batteries doesn\u0027t seem to do the trick... its almost as if the SAS is drawing more EC then the batteries can output. Despite my electric charge being pegged I can see the EC input next to it acting funny. So whats going on here?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-02T19:37:14Z\u0022 title=\u002202/02/2015 07:37  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 2, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"monophonic","CreatedById":76902,"CreatedDateTime":"2015-02-02T20:48:57Z","Content":"\n\u003Cp\u003EI just last night saw the same happen with a ship that had three Mk1 crew pods. The RWs of at least one pod (I didn\u0027t think to check the others) flashed that message even though there was 120 units of electric charge in the pods\u0027 batteries. The situation kept going for as long as I was in the shadow of Kerbin, but once in sunlight the batteries started filling and the message stopped.\u003C/p\u003E\u003Cp\u003EI have no idea what the actual cause is, but I would like to know as well.\u003C/p\u003E\n"},{"CreatedByName":"Drew Kerman","CreatedById":103177,"CreatedDateTime":"2015-02-02T20:52:32Z","Content":"\n\u003Cp\u003EI see this as well when I right-click on probe cores with reaction wheels. Batteries are full, EC charge from solar panels is in excess of my drain rate, and yet it\u0027ll flash rapidly between \u0022operational\u0022 and \u0022not enough electric charge\u0022. No idea why\u003C/p\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-02-02T20:57:20Z","Content":"\n\u003Cp\u003Esounds like the power draw and drain are actually in flux...try adding an extra set of batteries! As I like to say, when in doubt...MORE BATTERIES! just a suggestion. Also, I\u0027d check to see what power consumption your telescope is supposed to have, then add more batteries and other electrical generation equipment as necessary!\u003C/p\u003E\n"},{"CreatedByName":"Slam_Jones","CreatedById":125101,"CreatedDateTime":"2015-02-02T21:02:22Z","Content":"\n\u003Cp\u003EI\u0027ve had (frequent) situations when a reaction wheel will show \u0022Not enough electricity,\u0022 but will function perfectly normally.\u003C/p\u003E\n"},{"CreatedByName":"tsotha","CreatedById":120361,"CreatedDateTime":"2015-02-02T21:19:35Z","Content":"\n\u003Cp\u003EI suspect that message is a red herring. I get it on capsules with no other external reaction wheels when the SAS is actually directing it to do something.\u003C/p\u003E\u003Cp\u003EIMO t\u0027s most likely what\u0027s going on here is you\u0027re bobbing because your reaction wheels are fighting each other. This happens a lot when you have a ship that has any \u0022bend\u0022 in it - it\u0027s pretty common to have to disable SAS when you dock to a station to prevent the thing from shaking itself apart. Ideally you want all your reaction wheels in the same spot oriented the same way. Failing that you should think about disabling any that you don\u0027t need.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-02-03T00:21:14Z","Content":"\n\u003Cp\u003Eive tried different placement of my reaction wheel setup. No matter what I try in terms of RW placement the scope still bobs up and down slightly with the last set of SAS turned on. Im pretty convinced its from the RW toggling on and off with that error. At first I though that maybe it \u003Cem\u003Eis\u003C/em\u003E the RW\u0027s fighting eachothger. But if that were the case it\u0027d happen a lot sooner. There are 26 reaction wheels on this telescope. I tend on posting pictures soon as I can. 2 of which are slow, slew control and the rest are strong, precision control for focusing in on a target. And it works. Every set of wheels I turn on gets the view more and more centered. But once I turn the last set on I get that message and the view starts to bob up and down. \u003C/p\u003E\u003Cp\u003EIts strange because this is not a spacecraft. There isn\u0027t any week connections per say that may cause trouble with the RW\u0027s. So.. something is going on. The next thing ill try is activating all of them and one by one turn them off until that error disappears. Lol MORE BATTERIES? I have 24 of the largest KW batteries on the base, a dozen RTG\u0027s and as many solar panels I can fit.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-03T00:24:16Z\u0022 title=\u002202/03/2015 12:24  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 3, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sampa","CreatedById":130079,"CreatedDateTime":"2015-02-03T00:40:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003Eive tried different placement of my reaction wheel setup. No matter what I try in terms of RW placement the scope still bobs up and down slightly with the last set of SAS turned on. Im pretty convinced its from the RW toggling on and off with that error. At first I though that maybe it \u003Cem\u003Eis\u003C/em\u003E the RW\u0027s fighting eachothger. But if that were the case it\u0027d happen a lot sooner. There are 26 reaction wheels on this telescope. I tend on posting pictures soon as I can. 2 of which are slow, slew control and the rest are strong, precision control for focusing in on a target. And it works. Every set of wheels I turn on gets the view more and more centered. But once I turn the last set on I get that message and the view starts to bob up and down. \u003Cp\u003EIts strange because this is not a spacecraft. There isn\u0027t any week connections per say that may cause trouble with the RW\u0027s. So.. something is going on. The next thing ill try is activating all of them and one by one turn them off until that error disappears. Lol MORE BATTERIES? I have 24 of the largest KW batteries on the base, a dozen RTG\u0027s and as many solar panels I can fit.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECould you send me a download link to the craft you are making...I think a few tweaks might be needed to make it work, but I need to see it to better understand what is going one...\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-02-03T01:13:58Z","Content":"\n\u003Cp\u003EYea that\u0027d be great. Once I get on my pc ill get on it. Your gonna need HullcamVDS, Infernal Robotics ( for the swivel washers ), KW for the batteries. Hope that\u0027s not too much. Theres a few others ill trim off before I give it to ya.\u003C/p\u003E\u003Cp\u003EEdit: I can loose the KW batteries if need be. Infact I may do that anyway.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-03T01:51:37Z\u0022 title=\u002202/03/2015 01:51  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 3, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-02-03T04:53:28Z","Content":"\n\u003Cp\u003EOkay here is the telescope. Made a few tweaks. You don\u0027t need KW anymore. Just Hullcam, InfernalRobotics and I forgot to mention MechJeb ( Use SmartAss targeting controls )\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/cjlii2dyee7kvmq/Observatroy%20Stock.craft?dl=0\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www.dropbox.com/s/cjlii2dyee7kvmq/Observatroy%20Stock.craft?dl=0\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EAction Groups - \u003C/p\u003E\u003Cp\u003E1 - Radial SAS\u003C/p\u003E\u003Cp\u003E2 - Inline SAS\u003C/p\u003E\u003Cp\u003E5 - Activate Camera\u003C/p\u003E\u003Cp\u003E6 - Deactivate Camera ( can just hit 5, but just in case )\u003C/p\u003E\u003Cp\u003E9 - Zoom In\u003C/p\u003E\u003Cp\u003E10 - Zoom Out ( can just use scroll wheel. )\u003C/p\u003E\u003Cp\u003EMake sure you disable both the inline and radial reaction wheels when moving the telescope around. When SmartAss fixes on a target turn them on. You\u0027ll see them begin to flash \u0022not enough electricity\u0022 and when zoomed in you will see that the view bobbing which is in sync with that EC error. Now.. having said that I found something out. The accuracy increases greatly when I disable the HUD. ( F2 ) Its bizzare. target goes from off center to center when the HUD is disabled. So this issue is VERY close to being fixed. But it still bobs up and down which makes it hard to track rockets after so long.\u003C/p\u003E\u003Cp\u003EPictures.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/AHiyoAC.jpg\u0022 alt=\u0022AHiyoAC.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe inline reaction wheels you see there were placed with EditorExtensions. Im hoping you don\u0027t need that to load the craft. I originally had just 8 of them clipped inside of the larger RW\u0027s, but I feared clipping could be the issue. It wasn\u0027t. And the radial RW\u0027s work as expected despite being... radial. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/GFckSbx.jpg\u0022 alt=\u0022GFckSbx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDuna and Ike from the ground. Easy shot in space, but when you gotta compensate for Kerbin\u0027s rotation not so much.. don\u0027t even bother trying to fine tune the view the controls are no where near fine enough even with capslock.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/W8gYrYJ.jpg\u0022 alt=\u0022W8gYrYJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy Mun mission waiting to set out in Orbit. I find it strange that this practice isn\u0027t more popular. Again BHDArmory can give you a 500km loading distance. It opens up so many possibilities. Id like to actually make a thread soon to all my ventures ive been having with it. For the past week ive been landing all my stages back at the KSC while the rest goes to orbit on its own. Works almost too good.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-03T04:56:00Z\u0022 title=\u002202/03/2015 04:56  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 3, 2015\u003C/time\u003E by Motokid600\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-02-03T19:55:23Z","Content":"\n\u003Cp\u003EI recently had a similar problem. I\u0027d launch a vessel into orbit, set up an Eve maneuver, and even though I had full electricity I couldn\u0027t control the craft. In the end I suspected a potential bug with using Precise Node to modify the maneuver node. If I used it only for readings, it didn\u0027t have a problem. I don\u0027t know if that is the same issue, but if you use Precise Node you may want try it without using it.\u003C/p\u003E\n"},{"CreatedByName":"Motokid600","CreatedById":66349,"CreatedDateTime":"2015-02-04T03:03:17Z","Content":"\n\u003Cp\u003EWorth a shot Alshain ill try removing that mod, see what it does.\u003C/p\u003E\n"},{"CreatedByName":"Alshain","CreatedById":110959,"CreatedDateTime":"2015-02-04T03:42:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Motokid600\u0022 data-cite=\u0022Motokid600\u0022\u003E\u003Cdiv\u003EWorth a shot Alshain ill try removing that mod, see what it does.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI didn\u0027t have to remove it, I just made sure not to type in any of the number boxes. But it was only one time, I might have just got lucky and the problem didn\u0027t occur and it had nothing to do with Precise Node at all.\u003C/p\u003E\n"},{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2015-02-04T11:19:29Z","Content":"\n\u003Cp\u003EI\u0027m fairly sure this is a confirmed bug with the SAS system reading how much electric charge is available. It\u0027ll still function if it says not enough electricity, as long as you actually have electricity on your ship... otherwise its right in what it says \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SPA","CreatedById":136486,"CreatedDateTime":"2015-02-05T02:05:36Z","Content":"\n\u003Cp\u003Eany solar panels? if you have some, you may want to put at least one one each part of it. I had problem once were 1/2 of the ship had electricity from the panels, and the other didn\u0027t. if it still does it, then it really is a bug.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-05T03:02:57Z\u0022 title=\u002202/05/2015 03:02  AM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 5, 2015\u003C/time\u003E by Master Tao\u003C/strong\u003E\n\u003Cbr\u003Ereaction image\n\u003C/span\u003E\n"}]}