{"TopicId":98728,"ForumId":16,"TopicTitle":"Fuel Consumption Question","CreatedByName":"TwStD","CreatedById":137378,"CreatedDateTime":"2015-02-04T06:56:46Z","PageNum":1,"Articles":[{"CreatedByName":"TwStD","CreatedById":137378,"CreatedDateTime":"2015-02-04T06:56:46Z","Content":"\n\u003Cp\u003EOk, I\u0027m running a stock, unmodded instance of KSP. I am trying to build a decent atmospheric plane to get me to the other side of the planet for a survey mission, and I believe I have built a plane that is capable of that. The only problem I am having is with fuel consumption changing the balance and center of mass on the plane, causing it to become uncontrollable about two thirds of the way through the flight. Is there a way, without modding the game, to tell the engines which tank to pull fuel from so that I can keep it balanced for center of mass? Thanks in advance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-04T15:40:37Z\u0022 title=\u002202/04/2015 03:40  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 4, 2015\u003C/time\u003E by TwStD\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"vexx32","CreatedById":12283,"CreatedDateTime":"2015-02-04T10:56:47Z","Content":"\n\u003Cp\u003EThe only easy way to do this is to find a part that has fuel crossfeed disabled, and attach the engines to your plane using that part to block flow from the tanks to the engines. Then, you can attach a fuel line from the tank you want to be drawing fuel from to each engine.\u003C/p\u003E\u003Cp\u003EYou\u0027ll probably need to experiment a fair bit to get the result you want, though. Fuel flow rules can be a mite tricky to figure out. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Bilfr3d","CreatedById":75448,"CreatedDateTime":"2015-02-04T11:16:35Z","Content":"\n\u003Cp\u003EIf my memory serves me correctly there was a user that posted a huge investigating on fuel flow methods... I cannot remember where it is though.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2015-02-04T11:16:39Z","Content":"\n\u003Cp\u003EFuel flow rules have been researched extensively \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/64362-Fuel-Flow-Rules-%280-24-2%29\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EIts no easy topic though.\u003C/p\u003E\u003Cp\u003EHowever, what you can do to fix it easily, just pump around some fuel from the back to the front of your plane. You can do this in flight. That should help to stabilize it again and you won\u0027t need to rebuild or to change it.\u003C/p\u003E\u003Cp\u003EGoogle tossed me this\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/4kmxeHiv_0E?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E that explains how to do that.\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2015-02-04T12:51:19Z","Content":"\n\u003Cp\u003EAnother option you might consider is disabling the tanks that you want drained last, then reenable them as needed.\u003C/p\u003E\n"},{"CreatedByName":"TwStD","CreatedById":137378,"CreatedDateTime":"2015-02-04T15:38:57Z","Content":"\n\u003Cp\u003EThanks for the help guys. I was unaware of the fuel pumping mechanic. I should be able to pump fuel out of the rear tanks before the forward tanks deplete, giving me balance while maintaining access to fuel per the fuel flow rules.\u003C/p\u003E\n"}]}