{"TopicId":98898,"ForumId":16,"TopicTitle":"Do air intakes need to be closed at high altitude jet engine shutdown?","CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-02-06T07:29:59Z","PageNum":1,"Articles":[{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-02-06T07:29:59Z","Content":"\n\u003Cp\u003EI can understand closing an air intake at low altitude if you have lots of intakes and don\u0027t need the air yet, opening it higher up when the air is thinner. After you\u0027ve reached a really high altitude and your jet engines start to flame out, is there any need to close the intakes then? I would assume that if the air is thin enough to not help your engines, then it would be thin enough to not cause any drag either. Is this true? Or is the drag somehow still magically strong enough that it would help to close my intakes at high altitude?\u003C/p\u003E\u003Cp\u003ENot a particularly big deal, but it would affect how I set up my action groups.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-06T19:08:23Z\u0022 title=\u002202/06/2015 07:08  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 6, 2015\u003C/time\u003E by Kelderek\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"tsotha","CreatedById":120361,"CreatedDateTime":"2015-02-06T07:49:18Z","Content":"\n\u003Cp\u003EI think it depends on where you switch over. If you switch over manually at 25km the air is probably still thick enough that the drag will have some effect on your fuel consumption.\u003C/p\u003E\u003Cp\u003EIf, on the other hand, you\u0027re milking your engines up to 55km then I doubt closing intakes will have any noticeable effect whatsoever. I think at one point if you left the intakes open your engine would use fuel even if it had flamed out, but I haven\u0027t noticed that to be the case.\u003C/p\u003E\n"},{"CreatedByName":"eddiew","CreatedById":127483,"CreatedDateTime":"2015-02-06T11:09:45Z","Content":"\n\u003Cp\u003EI \u003Cem\u003Edo\u003C/em\u003E set my intakes to close in the same action that toggles rapiers, but I\u0027m not entirely sure how much use it is. I\u0027ve never really bothered closing intakes when I have more than enough open - will maybe try that later \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SaturnV","CreatedById":79006,"CreatedDateTime":"2015-02-06T11:31:02Z","Content":"\n\u003Cp\u003ERight click on it then you can check the real-time drag of air intakes. It won\u0027t make a difference under current stock aerodynamic since the true drag is an weighted average number not only related to drag but also the mass of each part. Air intakes are really lightweighted.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2015-02-06T11:32:16Z","Content":"\n\u003Cp\u003EIntakes usually provide air up to roughly 35km, so as long as jets are running, keep them open.\u003C/p\u003E\u003Cp\u003EBetween those 35km up to space, they would just create unnecessary drag if left open. That saves you a bit fuel.\u003C/p\u003E\u003Cp\u003EAnd I\u0027ve also never thought about start intakes closed and open them when I really need them - which might be a good idea to save a bit more fuel in lower atmosphere.\u003C/p\u003E\u003Cp\u003ECould be useful for monstrous SSTOs with lots of intakes.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222015-02-06T12:47:52Z\u0022 title=\u002202/06/2015 12:47  PM\u0022 data-short=\u00229 yr\u0022\u003EFebruary 6, 2015\u003C/time\u003E by LordFjord\u003C/strong\u003E\n\u003Cbr\u003Etypo/wrong wording\n\u003C/span\u003E\n"},{"CreatedByName":"GoSlash27","CreatedById":111526,"CreatedDateTime":"2015-02-06T12:15:36Z","Content":"\n\u003Cp\u003EI don\u0027t bother closing them on single engine spaceplanes. Kicking in the rockets at flameout is often enough to restart the turbojet, saving fuel.\u003C/p\u003E\u003Cp\u003E Multiengine spaceplanes actually require the turbojets to be shut down, so I close the intakes as well.\u003C/p\u003E\u003Cp\u003EBest,\u003C/p\u003E\u003Cp\u003E-Slashy\u003C/p\u003E\n"},{"CreatedByName":"numerobis","CreatedById":62016,"CreatedDateTime":"2015-02-06T13:28:09Z","Content":"\n\u003Cp\u003EIntakes are light (10kg) but their drag coefficient is large when they\u0027re open (10x or 11x as much as normal parts), so treat them as a 100kg part when it comes to drag.\u003C/p\u003E\u003Cp\u003EIf you\u0027re above 40km, drag pretty much doesn\u0027t matter. If you\u0027re below 20km, it matters a lot.\u003C/p\u003E\u003Cp\u003EA minor secondary thing: intakes hold air. When you close the intake, that air remains in the intake, and you\u0027ll be carrying it around with you. For that reason, when I want to switch to some other propulsion, I close the intakes but leave the jets running.\u003C/p\u003E\n"},{"CreatedByName":"Kelderek","CreatedById":131312,"CreatedDateTime":"2015-02-06T19:09:04Z","Content":"\n\u003Cp\u003EI guess it won\u0027t hurt to close the intakes high up, so I\u0027ll keep them as part of my action groups. Thanks all.\u003C/p\u003E\n"},{"CreatedByName":"RexKramer","CreatedById":76862,"CreatedDateTime":"2015-02-07T03:15:38Z","Content":"\n\u003Cp\u003EIt is not necessary to close them- at stages where I do not yet have action groups available I generally don\u0027t bother with closing them, and get to orbit just fine.\u003C/p\u003E\u003Cp\u003EHowever, if you have action groups available, it certainly doesn\u0027t hurt to close them, and depending on your altitude it may provide a great deal of benefit. \u003C/p\u003E\u003Cp\u003EMy spaceplanes generally reach 40km and ~2350m/s on jets alone, all stock, with no intake spam (one intake per engine..). Using two intakes per engine gives the same results, except I reach that speed and altitude faster, so less jet fuel is needed. If you can reach 35-40km on jets, the drag is minimal to begin with, but closing your intakes is like getting FREE energy, so why not?\u003C/p\u003E\n"},{"CreatedByName":"panzer1b","CreatedById":95108,"CreatedDateTime":"2015-02-07T04:18:48Z","Content":"\n\u003Cp\u003EIts a matter of how much you care about 100% efficiency.\u003C/p\u003E\u003Cp\u003EAny open intake that isnt running a jet is wasting more or less dV. Personally, if its above 60km, i really dont care at all. The atmosphere there is so thin, its more or less negligible. And loosing 10dV isnt really important for me (its not like 10dV is going to save a mission that ran outta fuel).\u003C/p\u003E\u003Cp\u003Ebelow 30km (none of my SSTOs actually go that low), id keep them closed if you are using rockets that low. Ive never actually had such a situation, as 90% of my SSTOs have enough intakes to gun it to 70km minimum before they need to switch to rockets. The few that dont make it, can at least make 60km, which is well above what id call thick atmo. never made a SSTO that unable to go above 60km sofar (stock aero, realistic or not, i really prefer FAR to not screw over jets, SSTOs are already hard enough to get to laythe and back, let alone my next endevour, of landing a SSTO on eeloo and returning home without a single bloody refueling using 100% stock parts).\u003C/p\u003E\n"}]}