{"TopicId":99033,"ForumId":16,"TopicTitle":"insufficient docking control","CreatedByName":"DennyC","CreatedById":92723,"CreatedDateTime":"2015-02-07T22:44:03Z","PageNum":1,"Articles":[{"CreatedByName":"DennyC","CreatedById":92723,"CreatedDateTime":"2015-02-07T22:44:03Z","Content":"\n\u003Cp\u003EMy docking control keys seem to be boogered up.\u003C/p\u003E\u003Cp\u003EI have rendevoused with another orbiting craft, and am in postion nearby.\u003C/p\u003E\u003Cp\u003EI have keys ijkl mapped for left - right - up - down translation, and H-N for forward - back.\u003C/p\u003E\u003Cp\u003EHowever, instead of translating left-right, the J \u0026amp; L keys produce exactly the same up-down movement as the K-I keys. I have no left-right control whatever. The WASD keys produce rotation instead of translation.\u003C/p\u003E\u003Cp\u003EWhen in staging mode, the right hand 4-key set again produces only up-down translation.\u003C/p\u003E\u003Cp\u003EI have two RCS thrusters on opposite sides of an upper stage.\u003C/p\u003E\u003Cp\u003EIs there a solution? Other people seem to be docking OK.\u003C/p\u003E\n"},{"CreatedByName":"Randazzo","CreatedById":136468,"CreatedDateTime":"2015-02-07T22:55:05Z","Content":"\n\u003Cp\u003EIf you\u0027re only using two thruster blocks and they are smack in your center of mass, they are probably having a hard time turning the vessel. You also might have the single vector blocks on it, but I\u0027m only guessing. \u003C/p\u003E\u003Cp\u003EGenerally I find I need at least four blocks. Three might work, but I imagine it would be squirrely.\u003C/p\u003E\n"},{"CreatedByName":"Reactordrone","CreatedById":110060,"CreatedDateTime":"2015-02-07T22:58:20Z","Content":"\n\u003Cp\u003EIf you\u0027ve only got two thruster blocks you\u0027ll have to roll your ship 90Ã‚Â° to get the missing direction (up/down of left/right).\u003C/p\u003E\n"},{"CreatedByName":"Scarecrow88","CreatedById":66043,"CreatedDateTime":"2015-02-07T23:32:54Z","Content":"\n\u003Cp\u003EIf you are using the 4 nozzle RCS thrusters, you will need to place at least 4 of them on your craft to achieve the required translation movements. One each on the top and bottom of your craft will give you backwards/forwards as well as left/right translation. One each on the left and right of your craft will also give you backwards/ forwards but will also provide up/down. \u003C/p\u003E\u003Cp\u003EIf you are only using two, that\u0027s your problem.\u003C/p\u003E\n"},{"CreatedByName":"DennyC","CreatedById":92723,"CreatedDateTime":"2015-02-09T16:25:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Reactordrone\u0022 data-cite=\u0022Reactordrone\u0022\u003E\u003Cdiv\u003EIf you\u0027ve only got two thruster blocks you\u0027ll have to roll your ship 90Ã‚Â° to get the missing direction (up/down of left/right).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks. That makes sense. \u003C/p\u003E\u003Cp\u003EI am now synching orbits and will be trying that.\u003C/p\u003E\n"}]}