{"TopicId":101789,"ForumId":25,"TopicTitle":"Gilly suborbital jump with \u0022artificial gravity\u0022 rover","CreatedByName":"noorm","CreatedById":139301,"CreatedDateTime":"2015-03-12T02:56:57Z","PageNum":1,"Articles":[{"CreatedByName":"noorm","CreatedById":139301,"CreatedDateTime":"2015-03-12T02:56:57Z","Content":"Reach the highest suborbital trajectory with a rover on Gilly, with no artificial ramp. Use the best hill you can find!\n\nRules!!!\n\nMain propulsion is done with electric rover wheels only.\n\nFunctional parts must be stock. (Information or cosmetic mods are permitted.)\n\nAny stock form of stability assistance, traction improvement or similar device not contributing to forward or upward velocity is permitted. (I use 2 upward facing Place-Anywhere 7 RCS port to keep me on the ground.)\n\nHyperedit and similar tools that facilitate rapid prototyping and testing are... strongly recommended!\n\nCrewed or uncrewed...\n\nYour rover can explode and any kerbal can die except Jeb! Jeb is not allowed to die, ever... especially not publicly!\n\nRanking will be based on the apoapsis from a screenshot of the map view. Mouse over the apoapsis to be sure the apoapsis height is displayed. If you do something heroic, we would appreciate more screenshots or videos. If you find a real nice hill, coordinates or some other way to recreate your bold feat would be nice too!\n\nI am not a Gilly specialist but I wonder if it would be possible to get into an escape trajectory this way. If this happen, consider my challenge broken unless we can agree on some way to rank escaping trajectory (time to escape right after jump?)\n\nAnd here is some kind of proof it can be done:\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/4OeidR_SNNE?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nThis was a first test starting from latlong 0,0 (according to hyperedit). I didn\u0027t really looked around for a launch site yet!\n\nThanks!"},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-03-12T11:09:36Z","Content":"\u003E \n\u003E ..I am not a Gilly specialist but I wonder if it would be possible to get into an escape trajectory this way...\n\nGilly\u0027s escape velocity is 35.71 m/s - out of reach of just rover wheel propulsion. (Or is it... I would love to be proven wrong on this one)"},{"CreatedByName":"noorm","CreatedById":139301,"CreatedDateTime":"2015-03-13T01:54:24Z","Content":"After some rigorous analysis of high resolution telemetry data (i.e. eyeballing a scansat map), mission control determined that our first honest try should be around the highest elevation on Gilly.\n\nThat is around 29Ã‹Å¡45\u00270.00\u0022S, 123Ã‹Å¡45\u00270.00\u0022W. Following a brief visual search, a maximum elevation of 6400m was found during an EVA by Jeb but no steep slope.\n\nAn initial jump was nevertheless attempted around that location. An apoapsis of 10992m was attained.\n\nThe following scientific findings worth of mention where discovered:\n\nIt is very hard to control a rover on gilly, even with two Place-Anywhere 7 RCS ports. Multiple attempts at reaching a relatively slow speed had to be done.\n\nThe flag marking the highest elevation was displayed floating in the air on the map view. I believe there is a discrepancy between the real terrain model and the map view model.\n\nAnd now ladies and gentlemen... the pictures:\n\n\u003E [Javascript is disabled. View full album](//imgur.com/a/S3Ywa)"},{"CreatedByName":"Mister Dilsby","CreatedById":232743,"CreatedDateTime":"2015-03-13T14:51:01Z","Content":"My Fling-O-Matic from the Minmus thread did manage to get poor Frodo to escape velocity, though I might have bent a rule an eensy bit.\n\nI did not bother to run the wheels (wouldn\u0027t have mattered anyway, have no provision to maintain surface contact) Just flipped it into the air with the gyros and flung Frodo into deep spaaaaaaace.....\n\n![xdmVOiX.png](http://i.imgur.com/xdmVOiX.png)\n\n![TQNlC7Y.png](http://i.imgur.com/TQNlC7Y.png)\n\n![w7OfviR.png](http://i.imgur.com/w7OfviR.png)\n\nDo I win a coconut? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-03-13T14:58:18Z","Content":"It seems that you need to go *down* to go up in this challenge. Need to find a large hill with a small hill at the bottom."},{"CreatedByName":"noorm","CreatedById":139301,"CreatedDateTime":"2015-03-13T21:15:19Z","Content":"\u003E \n\u003E Do I win a coconut? ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nNo, but an \u0022Unlimited class\u0022 honorary mention!!!"},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-03-13T21:32:59Z","Content":"Interesting. If I had time this weekend I\u0027d try a fuel tank with a power-generating engine facing down for both \u0022artificial gravity\u0022 and power for the wheels, then I\u0027d drive it up the highest hill I could find. The trick would be cutting the engine the moment you left the ground because keeping it running would actually lower your apoapsis.\n\nThe other trick would be not flipping over and crashing ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Starwhip","CreatedById":83990,"CreatedDateTime":"2015-03-14T03:10:04Z","Content":"\u003E \n\u003E Gilly\u0027s escape velocity is 35.71 m/s - out of reach of just rover wheel propulsion. (Or is it... I would love to be proven wrong on this one)\n\nNot going downhill..."},{"CreatedByName":"Superfluous J","CreatedById":73725,"CreatedDateTime":"2015-03-14T07:37:14Z","Content":"\u003E \n\u003E Not going downhill...\n\nActually in theory, if you were going down a hill at 36m/s, and that hill curved further downward causing you to leave the ground, and beyond that hill was a valley that was wide enough that nothing was directly in your way... then yes you\u0027d escape ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-03-14T12:41:42Z","Content":"\u003E \n\u003E Actually in theory, if you were going down a hill at 36m/s, and that hill curved further downward causing you to leave the ground, and beyond that hill was a valley that was wide enough that nothing was directly in your way... then yes you\u0027d escape ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)\n\nThe real question is, can you really get those speeds just by using rover wheels and/or Gilly\u0027s gravity? I haven\u0027t done any calculations, but something tells me you\u0027d need a seriously high and seriously smooth mountain... The highest elevation difference I was able to find on Gilly is about 3 km, but the slope is pretty damn bumpy."}]}