{"TopicId":102294,"ForumId":25,"TopicTitle":"Speedrunning Kerbal Space Program","CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-20T00:51:02Z","PageNum":1,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-20T00:51:02Z","Content":"I have a friend, HospiceAntlers, who is really really obsessed with Speedruns, that is, when you try to complete a game as fast as possible. So I decided to create some rules for speedrunning KSP. This isn\u0027t like Munracing or something like that, this is about completing the game.\n\n**Baby McJunior Mode**\n\nPlant a flag on Mun, Minmus, and either Gilly or Ike, and return everyone to Kerbin.\n\n**Easy Mode**\n\nPlant a flag on every planet and moon except for Jool, and return everyone to Kerbin.\n\n**Easy Science Mode**\n\nUnlock the Tech Tree and plant a flag on every planet and moon except for Jool, and return everyone to Kerbin.\n\n**Hard Science Mode**\n\nUnlock the Tech Tree, visit every possible biome/situation (planting a flag on surfaces), and return everyone to Kerbin.\n\n**Super Manley Astronogamer Mode**\n\nUnlock the Tech Tree, visit every possible biome/situation (planting a flag on surfaces), and get every piece of science-data in the game from all the science experiments. And of course, return everyone home.\n\n**Career Mode**\n\nUnlock the Tech Tree, upgrade all buildings, and plant a flag on every planet and moon (except for Jool) and return everyone home.\n\n--Easy Mode (Use easy settings)\n\n--Normal Mode\n\n--Moderate Mode\n\n**Ridiculous Mode**\n\nSeriously, don\u0027t do this. This is Career Mode, except you have to also complete every type of contract. Every type of orbit around any planet (not all of them), Part test in every situation (escape, orbit, suborbit, atmosphere, landed), Asteroid Redirect, visual surveys, etc.\n\n**Rules**\n\nAll spacecraft that gather science or land must have crew in them.\n\nAll crew must return to Kerbin safely.\n\nGetting a science report and getting back from Jool\u0027s atmosphere is possible. For visiting every biome/situation, you must \u0022land\u0022 on Jool, by going below 10 kilometers above the surface level of Jool. (Not below it though).\n\nUnlike most speedruns, this is measured in in-game time instead of real-life time, and as such you will need to pay attention to your Universal Time rather than your Mission Elapsed Time. By the time you finish a speedrun, pause the game and measure your Universal Time and that will be your score. Lowest score is the best. (Obviously)\n\nI encourage you to use Outer Planets Mod for a much greater challenge. Obviously your score will be different \n\nYou must use stock parts, physics, and planets. Visual Enhancements, information mods, etc are fine. FAR is not allowed unless you also use Deadly Re-Entry. (Because otherwise you can go way faster in atmospheres. You will be put in a separate category if you do use FAR/DRE)\n\nNo ALT\u002BF12 whilst in the speedrun save game. (except for checking the debug log if you want)\n\n**Leaderboard**\n\nStock\n\n- NametynameForumuser (Game Mode) (Time)\n\n-\n\n-\n\n-\n\nFAR/DRE\n\n-\n\n-\n\n-\n\nUsing the Outer Planets Mod\n\n-\n\n-\n\n-\n\n-\n\n-\n\n-\n\nSo that\u0027s that. An attempt to make a ruleset for speedrunning an open sandbox game!\n\n**Edited \u003Ctime datetime=\u00222015-03-20T12:03:57Z\u0022 title=\u002203/20/2015 12:03  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 20, 2015\u003C/time\u003E by GregroxMun**\n  \nChanged rules based on Hobbez\u0027s thing."},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2015-03-20T01:50:18Z","Content":"How about a non-career normal mode? Easy is best done in Sandbox, and all of the others require Career.\n\nSomething on the lines of unlocking the whole tech tree and visit all the Planets\u002BMoons, and for hard mode visit all biomes of all objects at least once and return. \n\nMaybe not as crazy as doing all science of all biomes of all planets/moons, that\u0027s way out of my league.\n\nThe current career is way too arbitrarily broken to work well (building upgrades)."},{"CreatedByName":"hobbez","CreatedById":138355,"CreatedDateTime":"2015-03-20T07:39:31Z","Content":"I tend to write long posts when i\u0027m truly interested in a thread, so...\n\n**If this is TLDR for you fellows, just read the parts in bold.**\n\nI understand where you\u0027re coming from with the real life time keeping but, honestly, that\u0027s just going to make things long and complicated. Speedrunners don\u0027t finish a game in one sitting. They repeat levels over and over and chew away at their time. I would know: i used to speedrun Starcraft and F-Zero. [And that\u0027s the same for any game.](http://speeddemosarchive.com/) If your idea was to keep into account the time it takes to build a rocket in the vab, consider that a player could just build a rocket, test it and retest it until he\u0027s satisfied, then just record himself speed-building the rocket and flying it once. After all, most of the youtube missions we see are spliced together from multiple quicksaves.\n\n**I like the speedrun idea, but if i may make a few suggestions:**\n\n**Mode:** **Science**\n\n**Why:** Sandbox would be too easy and boring. All the parts are available from the start, meaning that you don\u0027t have to science. It becomes just a game of \u0022touch and go.\u0022 I\u0027m not too enthused about that.\n\nCareer mode would be too much of a headache for a speedrun. There\u0027s too much to do on the side to focus on touching every planet in a timely manner. In other words: even a fast career speedrun would still be slow.\n\nScience is the best of both worlds.\n\n**Objective:** **Must plant a flag on all planets \u002B moons with the exception of jool and the sun.**\n\n**Why:** Because flag rule!\n\nFrom the couple of times i\u0027ve visited jool, going \u0022below\u0022 surface level just equates to an exploded ship and dead crew: not much fun in that.\n\n**Timekeeping:** **In game time.**\n\n**Why:** It took Nasa less than 10 years to go from getting the first American to space, to sending 3 to the Moon. How many years does it take Kerbals to visit every planet and moon in their solar system?\n\nThe in game clock keeps into account all time spent traveling, docking, fueling, EVAing...basically everything outside of the VAB. The cool thing is that you could send a ship towards eloo or jool, start another mission for duna or eve, and get those done before the first ship even gets to outer planets, since it takes a really long time to get to the outer planets. You might as well put that time to use, instead of staring at your ship for in-game years!\n\nThink of it as a space race and each competitor is a different nation.\n\nFurthermore, KSP\u0027s performance changes drastically from computer to computer. A gajillion ton rocket at take off may run at 60fps on my computer, but will run at 1fps on little Billy\u0027s computer. That will inevitably change how long it takes both of us to get our junk to space.\n\n**These are my humble suggestions.**\n\n**Edited \u003Ctime datetime=\u00222015-03-20T07:47:00Z\u0022 title=\u002203/20/2015 07:47  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 20, 2015\u003C/time\u003E by hobbez**"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-20T12:04:22Z","Content":"Okay, I updated the rules and game modes."},{"CreatedByName":"hobbez","CreatedById":138355,"CreatedDateTime":"2015-03-20T19:10:55Z","Content":"i\u0027m going to do **easy science mode**. No way am i going to visit every biome in the game! =P\n\nhope to generate an update soon."},{"CreatedByName":"bakanando","CreatedById":126310,"CreatedDateTime":"2015-03-20T22:22:27Z","Content":"I wonder if so many flags planted around all the system would make the kraken hungry.\n\nThe easy and hard science runs sound very good, if/when I finally finish visiting everywhere I\u0027ll post my times here ![:)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif)\n\nEdit: A time to tech tree completion would be nice too. Dunno if visiting every planet/moon would preclude it though.\n\n**Edited \u003Ctime datetime=\u00222015-03-20T22:25:35Z\u0022 title=\u002203/20/2015 10:25  PM\u0022 data-short=\u00229 yr\u0022\u003EMarch 20, 2015\u003C/time\u003E by bakanando**"},{"CreatedByName":"Thunderous Echo","CreatedById":120137,"CreatedDateTime":"2015-03-20T22:41:07Z","Content":"Did you get this idea from Abyssal Lurker?\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/R1N7EvvXOD8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E"},{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2015-03-20T22:57:03Z","Content":"\u003E \n\u003E Did you get this idea from Abyssal Lurker?\n\u003E \n\u003E \n\u003E \n\u003E \u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/R1N7EvvXOD8?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\nNo, from my friend who really likes speedruns."},{"CreatedByName":"hobbez","CreatedById":138355,"CreatedDateTime":"2015-03-20T23:05:45Z","Content":"\u003E Edit: A time to tech tree completion would be nice too. Dunno if visiting every planet/moon would preclude it though.\n\nDepending on your hunger for science, you can unlock the entire tech tree just by visiting mun/minmus."},{"CreatedByName":"hobbez","CreatedById":138355,"CreatedDateTime":"2015-03-21T06:16:31Z","Content":"After a small glitch related setback, i managed to recover my game and continue my speed run. I\u0027m taking screenshots on the way.\n\nI\u0027ll wait till i\u0027m finished to post further updates, but here\u0027s a quick one just to give an idea of what i\u0027m doing.\n\n**EASY SCIENCE MODE**\n\nYear 1, Day 27\n\nCompleted return missions from Mun and Minmus, and have 2 ships en route to Dres and Duna.\n\nUnlocked nuclear rockets and the[biggest rocket engine](http://wiki.kerbalspaceprogram.com/wiki/S3_KS-25x4_Engine_Cluster), so i\u0027m ready to push to Jool and eloo (even though i\u0027ve never returned a kerbal from jool before and never been to eloo yet!)\n\nStarted the game by doing some quickie Kerbin science on the launchpad and runway to unlock decoupler, etc.\n\nThen built a single lift stage to carry 2 rockets to orbit, separating them and sending them their separate ways to Mun and Minmus.\n\nBy the time i got to Mun and back, the Minmus landing was still a week away, so, to save time, i used my Mun science (\u002B600) to unlock some tech tree and get a Duna craft on its way. After that, i figured i had enough tech to get a craft to Dres too. Got those 2 ships off the ground and out of Kerbin\u0027s orbit, then completed the Minmus landing and returned the craft home (\u002B900 science). All in a month\u0027s work.\n\n![10xdixf.jpg](http://oi61.tinypic.com/10xdixf.jpg)\n\nHere\u0027s the Minmus craft still waiting to enter the moons sphere of influence. Meanwhile the other 2 crafts are on an escape trajectory from Kerbin (the map shows them as orbits but they were actually escaping).\n\nThis is actually turning out to be a fun challenge, with multiple missions en route, instead of the usual \u00221 mission at a time\u0022 method of playing.\n\nI was going to consider doing the outer planets mod. I downloaded it after reading this challenge to check them out. I like them, but it will take lots of in-game years to get to them. It will take almost 40 years (!!!) to get to the outside most planet, using stock components.\n\n**Edited \u003Ctime datetime=\u00222015-03-21T10:16:15Z\u0022 title=\u002203/21/2015 10:16  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 21, 2015\u003C/time\u003E by hobbez**"},{"CreatedByName":"Astrofox","CreatedById":135785,"CreatedDateTime":"2015-03-21T16:29:06Z","Content":"I\u0027ve seen videos of people shooting Kerbals to Duna in 30 minutes...\n\nJeb didn\u0027t survive\\*\n\n\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/W-ruo2ElR4E?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\n\\*or did he?!!!\\*\n\n(this isn\u0027t mine, but it\u0027s worth watching!)"},{"CreatedByName":"Thunderous Echo","CreatedById":120137,"CreatedDateTime":"2015-03-22T00:57:35Z","Content":"\u003E \n\u003E **Baby McJunior Mode**\n\u003E \n\u003E Plant a flag on Mun, Minmus, and either Gilly or Ike, and return everyone to Kerbin.\n\u003E \n\u003E **Easy Mode**\n\u003E \n\u003E Plant a flag on every planet and moon except for Jool, and return everyone to Kerbin.\n\nLet me get this straight. The **EASY** MODE is a **KERBOL GRAND TOUR**.\n\nK I\u0027m probs in."},{"CreatedByName":"Deutherius","CreatedById":125381,"CreatedDateTime":"2015-03-22T01:55:33Z","Content":"\u003E \n\u003E I\u0027ve seen videos of people shooting Kerbals to Duna in 30 minutes...\n\u003E Jeb didn\u0027t survive\\*\n\u003E \n\u003E \n\u003E \n\u003E \n\u003E \u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/W-ruo2ElR4E?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\n\u003E \n\u003E \\*or did he?!!!\\*\n\u003E \n\u003E (this isn\u0027t mine, but it\u0027s worth watching!)\n\nOh my god, that gave me so many horrible great ideas! Thank you for posting this"},{"CreatedByName":"RAINCRAFTER","CreatedById":127524,"CreatedDateTime":"2015-03-22T02:28:45Z","Content":"\u003E \n\u003E **Super Manley Astronogamer Mode**\n\u003E Unlock the Tech Tree, visit every possible biome/situation (planting a flag on surfaces), and get every piece of science-data in the game from all the science experiments. And of course, return everyone home.\n\nillectro, I choose you!\n\n**Edited \u003Ctime datetime=\u00222015-03-22T02:31:24Z\u0022 title=\u002203/22/2015 02:31  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 22, 2015\u003C/time\u003E by RAINCRAFTER**"},{"CreatedByName":"CG_Kerbin","CreatedById":117777,"CreatedDateTime":"2015-03-23T07:18:10Z","Content":"Oh this is a great idea I\u0027m going to do it right now"},{"CreatedByName":"celem","CreatedById":91132,"CreatedDateTime":"2015-03-23T10:46:15Z","Content":"Traditionally a big fan of speedrunning (dungeon crawler). Might see what I can come up with for this.\n\nIs it just me or is there an epic difficulty leap between your first and second modes? Flag mun/min and Dunas/Eves micromoon is a snooze, flag everything except jool is a real chore what with Eve/Tylo manned returns. Feels like you got room for another category in here; all but Eve, or all moons but no planets, something...\n\nI also suspect its actually impossible to complete \u0027Easy mode\u0027 without getting enough sci in the process for \u0027easy sci mode\u0027\n\nJust not looking forward to Eve Ascent Vehicles in a speedrun scenario. (I want to high-speed ballistic the craft to its destination for speed, yet im not happy hitting that wall of air at appreciable fractions of lightspeed). (I just cant bring myself to uninstall DRE).\n\nFinally, a challenge to finish the tech tree as fast as possible is an entirely differant beastie, you can do that in a few game days using only Mun.\n\nWill see what sort of trajectories I can come up with and maybe i\u0027ll give this one a go later.\n\n**Edited \u003Ctime datetime=\u00222015-03-23T10:48:28Z\u0022 title=\u002203/23/2015 10:48  AM\u0022 data-short=\u00229 yr\u0022\u003EMarch 23, 2015\u003C/time\u003E by celem**"},{"CreatedByName":"sisyphean","CreatedById":136131,"CreatedDateTime":"2015-04-18T19:18:26Z","Content":"well im in on this, really want to use DRE but i cant see an eve return working with only a 6m heat shield...."},{"CreatedByName":"Hotblack Desiato","CreatedById":93895,"CreatedDateTime":"2015-04-18T20:05:13Z","Content":"with 1.0, it should be possible to create one SSTO craft with ISRU-capability which can land on every body, harvest local fuel and launch to the next object.\n\nand especially laythe, eve and tylo would be insanely hard to do (especially a spacecraft capable of all three planets/moons.\n\nas far as I know, only back in 0.18, people did eve spacecrafts capable of landing and launching back to orbit with enough dv to spare to return to kerbin.\n\nand with the ISRU-capabilty, they only need to fly to gilly for refuelling."},{"CreatedByName":"sisyphean","CreatedById":136131,"CreatedDateTime":"2015-04-19T00:05:56Z","Content":"well the dv to and from eve is only an issue of scale and its reasonably simple to do. the issue would be getting enough dv within a 6m cylinder for protection from deadly reentry without it also collapsing due to spaghetti physics."},{"CreatedByName":"Fred Cop","CreatedById":146298,"CreatedDateTime":"2015-09-10T17:10:33Z","Content":"How about one where you have to get to the Mun in career mode as fast as possible?\n\nI\u0027m sorry, but your \u0022easy\u0022 one is too hard, do you seriously expect people to get to orbit, land on the Mun, land on Minimus, land on Ike/Gilly and return them all in less than an hour?\n\nI\u0027m sorry, but that\u0027ll be incredibly boring to watch, even a continuous video with rocket crashes will be boringly predictable."},{"CreatedByName":"Samniss Arandeen","CreatedById":120179,"CreatedDateTime":"2015-09-10T17:54:52Z","Content":"Here\u0027s a speedrun: measured in real-time, unlock the entire tech tree."}]}