{"TopicId":114849,"ForumId":25,"TopicTitle":"UKSAF AWACS Procurement Competition","CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-02T07:36:18Z","PageNum":1,"Articles":[{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-02T07:36:18Z","Content":"Hello all, the UKSAF today has announced that it is officially beginning its second aircraft procurement conpetition due to the incredible success during its F-10 project which resulted in the very capable F-10 Lancer and its upgraded version the F-10A that serve as the UKSAFs primary fighter jet alongside their smaller but capable and more economic F-11 Firefly.\n\nThe aircraft required is an Airborne Warning And Control Systems(AWACS) plane and will be designated as the UKSAF HI-1 \\_\\_\\_\\_\\_. The UKSAF has not stated many stone set requirements saying that they want the industry to be imaginative and creative in their designs and that they will simply choose the best candidates and they want to see what the industry of capable of instead of setting minimum requirements to be met. They did however set the following requirements:\n\n-Must have at least 2 jet engines(can be any kind of jet engine to include the engines in quiztech aero pack and can have more than 2, its up to you guys. Just remember the more engines the more fuel you will need which increases weight and therefore decreases the efficiency so find a happy medium I guess.)\n\n-Must have a countermeasures system(BD Armory)\n\n-Does NOT need to be able to fire any weapon in any offensive or defensive way. It will fly with fighter escorts of hostile forces are expected\n\n-Must be able to house a crew of ten for operation of the planes sensors and flight systems\n\n-Must have wings\n\n-Must be able to fly at altitudes above 10,000 meters so it can stay above cloud cover\n\n-Must have an AWACS style dish on its body. Picture of USAF AWACS: ([http://media-2.web.britannica.com/eb-media/71/130771-004-355D9D6A.jpg](http://media-2.web.britannica.com/eb-media/71/130771-004-355D9D6A.jpg))\n\n-Must be fuel efficient and carry enough fuel so it can stay in the air over a target area for prolonged periods of time.\n\n-Must be able to cruise efficiently at a speed of at least 150 m/s so that it can keep up with fighter aircraft escorts and must be able accelerate to speeds of at least 200 m/s if needed below 8,000 meters\n\n-Must be able to do basic defensive maneuvers so that it can defend itself against radar locks at some level\n\n(I\u0027m not looking for backflips or anything crazy, just basic stuff)\n\n-Must be able to take off and land safely at the KSC runway\n\n-Must not blow up randomly for no reason(except for kracken attacks of course)\n\n-Minor part clipping is allowed but keep it to a minimum\n\n-Be creative with it, if you make it look cool with extra sensors and what not it just might give you an edge, but keep it realistic\n\n-The following Mods are allowed: BD Armoury, Quiztech aero pack, OPT Spaceplane parts, Adjustable landing gear, procedural wings, tweak scale, Kerbpaint. If you feel like any other mods that I missed should be added just comment with them and I will decide if I will allow them or not. Which I most likely will in all honesty\n\n-The aircraft must be built in 1.0.4 or a compatible version(i believe anything past 1.0 should work fine)\n\n-You MUST submit a link to the craft download file in order to be entered in the challenge so that I can test the designs.\n\n-Only one entry per person. You can edit your craft after it is submitted but you must submit a finalized craft by the end time.\n\n-Link to the kerbalX UKSAF hanger where you can see most of the UKSAF\u0027s aircraft and equipment with the exception of experimental and secret aircraft and equipment that are still classified or in experimental testing or never made it to flight(there is quite a few of those in the never made it to flight category......)\n\n - [http://kerbalx.com/hangars/1703](http://kerbalx.com/hangars/1703) \n\nThe initial design phase will be a 4 day long period starting at 0000 Eastern Standard Time on 2JULY and ending at 0000 Eastern Standard Time on 6JULY. ALL designs must be submitted by that time or they will not be counted. After that I will test them all and then I will decide on the three finalists and I will say what I did/did not like about each of their designs. The three finalists will then have 2 days to finalize and tweak their designs. After that a final test will be conducted to determine a winner. Best of luck to all who enter in the contest.\n\n**Edited \u003Ctime datetime=\u00222015-07-03T08:38:59Z\u0022 title=\u002207/03/2015 08:38  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 3, 2015\u003C/time\u003E by TMasterson5**\n  \nNo more FAR requirement"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-07-02T20:22:55Z","Content":"Okay! I\u0027m doing this!"},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-03T07:21:32Z","Content":"Glad to hear it! Hopefully more than just you will do this!"},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-03T08:39:30Z","Content":"\u003E \n\u003E Okay! I\u0027m doing this!\n\nHey just to make sure you know it was changed to no FAR requirement. My computer doesn\u0027t seem to like FAR"},{"CreatedByName":"PCanas","CreatedById":1607,"CreatedDateTime":"2015-07-03T09:21:55Z","Content":"[B9](https://forum.kerbalspaceprogram.com/threads/92630-0-90-B9-Aerospace-Release-5-2-8-%28updated-30-12-14%29) and [KAX](https://forum.kerbalspaceprogram.com/threads/76668-0-90-Kerbal-Aircraft-Expansion-%28KAX%29-v2-3-4) ?\n\nAnd maybe create a leaderbord for FAR and NoFAR?"},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-03T10:20:27Z","Content":"No FAR As it crashes my game so I couldn\u0027t fly any of the planes you guys create sorry. KAX sure\n\n**Edited \u003Ctime datetime=\u00222015-07-03T12:54:19Z\u0022 title=\u002207/03/2015 12:54  PM\u0022 data-short=\u00229 yr\u0022\u003EJuly 3, 2015\u003C/time\u003E by TMasterson5**"},{"CreatedByName":"PCanas","CreatedById":1607,"CreatedDateTime":"2015-07-03T15:35:22Z","Content":"You could fly the no-far and someone else would test the far planes.\n\nWhat about B9?"},{"CreatedByName":"Rainbow-Dashie","CreatedById":76160,"CreatedDateTime":"2015-07-03T15:49:05Z","Content":"Oh I am so doing this ![:D](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif)"},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-03T16:19:49Z","Content":"\u003E \n\u003E You could fly the no-far and someone else would test the far planes.\n\u003E What about B9?\n\nSorry forgot about B9. B9 isn\u0027t updated for 1.0\u002B yet I though? Their forum page says .90 still?"},{"CreatedByName":"Mad Rocket Scientist","CreatedById":139256,"CreatedDateTime":"2015-07-03T18:10:07Z","Content":"\u003E \n\u003E Hey just to make sure you know it was changed to no FAR requirement. My computer doesn\u0027t seem to like FAR\n\nOhh, good, I missed that. Unfortunately, I can\u0027t run FAR, not because of my computer, but because I\u0027m testing that constell pack."},{"CreatedByName":"PCanas","CreatedById":1607,"CreatedDateTime":"2015-07-04T10:20:59Z","Content":"\u003E \n\u003E Sorry forgot about B9. B9 isn\u0027t updated for 1.0\u002B yet I though? Their forum page says .90 still?\n\nThere\u0027s a [dev version](https://bitbucket.org/blowfishpro/b9-aerospace/downloads)\\*. I\u0027ve used it and I think that unless you really want to dig deep into specs and configs the version is pretty stable...\n\n\\* don\u0027t worry about it showing 750Mb, it\u0027s not that ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)"},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-04T15:18:18Z","Content":"\u003E \n\u003E There\u0027s a [dev version](https://bitbucket.org/blowfishpro/b9-aerospace/downloads)\\*. I\u0027ve used it and I think that unless you really want to dig deep into specs and configs the version is pretty stable...\n\u003E \\* don\u0027t worry about it showing 750Mb, it\u0027s not that ![;)](//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif)\n\nOh okay I didn\u0027t know about that. Sure go for it."},{"CreatedByName":"Ya_Boi_Assault","CreatedById":78404,"CreatedDateTime":"2015-07-06T22:40:52Z","Content":"Firespitter and tweak scale?"},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-07T03:56:45Z","Content":"Fire spitter no tweak scale yes"},{"CreatedByName":"Hodo","CreatedById":78218,"CreatedDateTime":"2015-07-07T04:02:44Z","Content":"No FAR, equals NO-GO for me. \n\nBut I look forward to see what interesting contraptions people come up with."},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2015-07-07T08:09:36Z","Content":"suggestion for OP: post a link to a .craft file for the AWACS subsystem, make the challenge about designing around that. It\u0027ll necessarily be stock and structural only - older versions can\u0027t or don\u0027t know how to handle newer version science."},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-07T08:21:57Z","Content":"It\u0027s not about designing an actual AWACS plane. It\u0027s about designing a plane that looks like the real thing.\n\nFor clarification: you can use whatever system you want to to build an AWACS like dish for the top of the plane and whatever else you want to add is totally up to you. The dish doesn\u0027t have to actually do anything.\n\n**Edited \u003Ctime datetime=\u00222015-07-07T08:28:36Z\u0022 title=\u002207/07/2015 08:28  AM\u0022 data-short=\u00229 yr\u0022\u003EJuly 7, 2015\u003C/time\u003E by TMasterson5**\n  \nClarification"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2015-07-07T10:26:45Z","Content":"aha... well, I did build something with a dish which weighs more than the rest of the plane, took six turbojets but I did manage to get it to take off and although it turns like a tank, I can\u0027t stick landings at all but I\u0027m sure it\u0027ll land."},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-07T10:36:59Z","Content":"Jesus what did you build the dish out of?"},{"CreatedByName":"ValCab33","CreatedById":129449,"CreatedDateTime":"2015-07-07T15:13:48Z","Content":"I think I\u0027ll do it. I have a plane that fits most of the requirements, I\u0027ll need to add a big dish and do some tweaking, but I\u0027m sure it\u0027ll do the job."},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-07T16:07:55Z","Content":"Best of luck!"},{"CreatedByName":"TMasterson5","CreatedById":144591,"CreatedDateTime":"2015-07-11T10:32:01Z","Content":"Hey guys I just came here to let you all know that a new facebook group has been created for the more military themed KSP creations. Feel free to join and post and and create. Link to the new group: \n\n[https://www.facebook.com/groups/372011822987779/?fref=ts](https://www.facebook.com/groups/372011822987779/?fref=ts)"}]}