{"TopicId":146741,"ForumId":25,"TopicTitle":"The Interplanetary Docking Hub Challenge","CreatedByName":"Drone_Kerbal","CreatedById":165603,"CreatedDateTime":"2016-08-29T07:06:13Z","PageNum":1,"Articles":[{"CreatedByName":"Drone_Kerbal","CreatedById":165603,"CreatedDateTime":"2016-08-29T07:06:13Z","Content":"\n\u003Cp\u003E\n\u003Cstrong\u003EBriefing:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThe Space Program gone bust. All their benefactors had pulled out, leaving them with no contract work and therefore no way of making a profit or even breaking even. Unfortunately, there was a problem. A big problem. All the long term interplanetary missions were still flying with no chance of return before the Space Center shut down. Lucky for them, Billy-Bobbles Kerman had had a small stake in the Space Program which he had cashed in before it had become completely worthless. He knew that he had to help as many of the stranded crews as possible. So, on the very last possible day, he cobbled together a small rocket that would allow the scattered craft to dock and refuel eachother so that they could all come home safely.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003E \u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EYour mission:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nLaunch a Rockomax HubMax Multi-Point Connector, along with a docking port on all attachment points, to another body for less than 50,000 funds (or roots, money, dollars, Kerbin Standard Monetary Units or whatever you want to call them).\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EScoring:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n(50,000 -(Mission Cost ) * (Direct DeltaV / DeltaV Expended) * (1 \u002B (Planetary Systems Visited * 0.5)\n\u003C/p\u003E\n\u003Cp\u003E\nBonuses (added to score):\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E: 10000\u003Cbr\u003E\nPer Kerbal (No seats): 5000\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMods:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nInformational mods, visual mods and parts mods that aren’t overpowered are allowed. Other mods are banned unless you ask me and I approve them.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003ELeaderboard:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Col\u003E\u003Cli\u003E\n\u003Cp\u003E\n Nobody yet\n\u003C/p\u003E\n\u003C/li\u003E\n\u003C/ol\u003E\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cstrong\u003EMy Attempt:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nThis is by no means a good attempt and should not be interpreted as the best possible.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca href=\u0022http://imgur.com/a/EyOnp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/EyOnp\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nMy score:\n\u003C/p\u003E\n\u003Cp\u003E\nDirect DeltaV: 5076 m/s\u003Cbr\u003E\nActual DeltaV: 5546 m/s\u003Cbr\u003E\nMission Cost: 23330 funds\n\u003C/p\u003E\n\u003Cp\u003E\n(50,000 -(23330) * (5076 / 5546) = 24409.4229035\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n \u003Cstrong\u003ENotes:\u003C/strong\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n Cheats are banned, questions are appreciated and will be answered as soon as possible and any suggestions just PM me or put in this thread.\n\u003C/p\u003E\n\u003Cp\u003E\nThe \u0022Direct DeltaV\u0022 is the optimum DeltaV to perform the transfer(s) that you did, calculated by \u003Ca href=\u0022https://alexmoon.github.io/ksp/\u0022 rel=\u0022external nofollow\u0022\u003EAlexmoon\u0027s Launch Window Planner\u003C/a\u003E in the first 10 years from the start of the Space Program. Use the orbital heights actually used by your mission. \u003Cbr\u003E\nFor example, if you went to Jool using two Eve gravity assists, then went to Duna with help from Tylo, you would enter a Kerbin - Jool transfer (making sure to set the latest departure date to Year 10, Day 1) including circularisation. If you go from an 80km Kerbin orbit to a 210km Jool orbit, this will result in a DeltaV of  4,881 m/s. Repeat this for the Jool - Duna transfer (60km Duna orbit), getting  4,345 m/s of DeltaV for that. Finally, add the two values as well as the 3400 m/s (the DeltaV needed to get into orbit in 1.1.3 according to the DeltaV map) to get 12626 m/s as your Direct DeltaV.\n\u003C/p\u003E\n\u003Cp\u003E\nVisiting the Kerbin System does not count towards your score. At least one other system must be visited to qualify.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222016-08-29T07:06:54Z\u0022 title=\u002208/29/2016 07:06  AM\u0022 data-short=\u00227 yr\u0022\u003EAugust 29, 2016\u003C/time\u003E by Drone_Kerbal\u003C/strong\u003E\n\u003Cbr\u003ELooks\n\u003C/span\u003E\n"}]}