{"TopicId":164979,"ForumId":25,"TopicTitle":"The Go-Anywhere*) Vessel","CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2017-08-30T17:00:32Z","PageNum":1,"Articles":[{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2017-08-30T17:00:32Z","Content":"\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003EHello,\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cspan style=\u0022font-size:16px;\u0022\u003EI\u0027d like to pose you the challenge of designing a vessel that can go anywhere*), over and over again. For the sake of argument, let\u0027s assume that the payload will be tourists (one or many, I don\u0027t care); I want to see your solution for getting them wherever they want*), and return them back to Kerbin. And then to pick up the next tourist(s) on the surface of Kerbin and do it all over again.\u003C/span\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n*) except Eve. Some things are just asking for too much.\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cu\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ERequirements:\u003C/span\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cul\u003E\u003Cli\u003E\nI consider this to be more of an engineering challenge, so I don\u0027t expect you to go out and actually land on every friggin body in the system (\u0027cept Eve). I do expect you, however, to convince me that the vessel is up to the task.\n\u003C/li\u003E\n\u003Cli\u003E\nThe vessel should work. It should be capable, not only of landing only Tylo and coming back again, but also of reaching the more far-flung destinations (and be able to come back, of course).\n\u003C/li\u003E\n\u003Cli\u003E\nYou may \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E as much and as often as you like. Intermediate stops are fine.\n\u003C/li\u003E\n\u003Cli\u003E\nRefueling at \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E will be alright, but  show that it\u0027s feasible. Craft should be able to land safely within a few minute\u0027s drive from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, without much saveloading.\n\u003C/li\u003E\n\u003Cli\u003E\nPlease don\u0027t overdo it with the flybys. I\u0027d rather see you take a refueling stop at some intermediate body than snatch a gravity assist from it. From a reviewer\u0027s perspective, \u0022Refuel on Mun, refuel on Vall, Refuel on Tylo\u0022 is much easier to follow than a gravitational pinball game.\n\u003C/li\u003E\n\u003Cli\u003E\nVery stocky vessels. Reason is that I want to recognize the parts I see. This pretty much requires you to go all stock with the engines, and remain quite stock-like with the tanks.\n\u003C/li\u003E\n\u003Cli\u003E\nYour \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E setup should \u0022just work\u0022. By which I mean that one just needs to turn things on and wait in warp. If it requires frequent toggling, you fail the test. I also want to know how you find the ore deposits to land on (\u0022I pre-scanned the system with Scansat\u0022 will be a perfectly acceptable answer, or even \u0022I tried till I got lucky\u0022 -- really, I just want to know).\n\u003C/li\u003E\n\u003C/ul\u003E\u003Cp\u003E\n\u003Cu\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003ESubmission Guidelines:\u003C/span\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nShow your work. Make sure to have some data displays (at least the resource panel, preferably also a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E readout) open in enough of your pictures for me to ensure that you didn\u0027t just use infinite fuel. If you prefer to make a video submission, please be so kind and provide a few stills with readable data to serve that purpose. Also don\u0027t always show your vessel from the same side: I want to see your design. Ideally one should be able to reconstruct it from the screen.\n\u003C/p\u003E\n\u003Cp\u003E\nIf some things are not immediately obvious from looking at them, a few explaining words will be appreciated.\n\u003C/p\u003E\n\u003Cp\u003E\nPlease don\u0027t spam a forum post with dozens of high-q PNGs. Use an external gallery like Imgur, or at the very least take the time to turn the PNGs into JPEGs.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cbr\u003E\u003Cu\u003E\u003Cspan style=\u0022font-size:16px;\u0022\u003EWhy?\u003C/span\u003E\u003C/u\u003E\n\u003C/p\u003E\n\u003Cp\u003E\nEver since \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E is a thing, I tried to come up with such vessels. For some reason or other, I can\u0027t find many ways of solving the problem. (I also tried to make true go-anywhere vessels and found the results outright ridiculous -- hence the limitation to anything but Eve). Recently, several so-called SSTAs showed up on reddit which were anything but -- basically spaceplanes with nukes that could, of course, provide a shuttle service to Laythe and most smaller moons, but would struggle with reaching Moho, much less could they land on Tylo.\n\u003C/p\u003E\n\u003Cp\u003E\nThat brought me back to that old idea. But once again, my ships are variations on a single theme.\n\u003C/p\u003E\n\u003Cp\u003E\nThat\u0027s where you come in --  I\u0027d like to know if my solutions really are the only ones or if I lack imagination. I hope to attract a few fellow builders who find this interesting enough to come up with and show their designs. Please understand why I don\u0027t show my own ships, at least not right away. Likewise, the \u0022rules\u0022 are as fuzzy as they are because I don\u0027t want to send people down a certain path.\n\u003C/p\u003E\n\u003Cp\u003E\nI don\u0027t have plans for offering a badge. I also won\u0027t keep this challenge going forever (don\u0027t see why it should, actually I\u0027m afraid that it won\u0027t catch on at all). I do, however, promise to pay attention until the end of September and will post short descriptions in the \u003Cabbr title=\u00221. Original Post(er). The first post in a thread, or the person who posted it. 2. Overpowered. A part or mechanic that upsets game balance by being too powerful.\u0022\u003EOP\u003C/abbr\u003E, pointing out neat features, great achievements and the likes.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-01T13:25:58Z\u0022 title=\u002209/01/2017 01:25  PM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 1, 2017\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003Cbr\u003ESome rewriting, though the gist remains the same\n\u003C/span\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2017-09-01T17:03:35Z","Content":"\n\u003Cp\u003E\nBasically, a rocket \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E that can make it to Minmus?  I have tried to make designs like that for a while, with the added cargo of a couple of exploration vehicles (plane, lander, rover, scan sat) and talked about my progress in the Megaship Engineers thread.  Moho would be accomplished with a stop at Gilly, but might not be possible with a chemical-only design.  This is not a submission but I would like to eventually go on a Jool 5 mission with a ship like this.\n\u003C/p\u003E\n\u003Ciframe allowfullscreen=\u0022\u0022 data-controller=\u0022core.front.core.autosizeiframe\u0022 data-embedcontent=\u0022\u0022 data-embedid=\u0022embed638282873\u0022 scrolling=\u0022no\u0022 src=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/162917-search-for-megaship-engineers/\u0026amp;do=embed\u0026amp;comment=3112719\u0026amp;embedComment=3112719\u0026amp;embedDo=findComment\u0022 style=\u0022height:295px;max-width:502px;\u0022\u003E\u003C/iframe\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nSeveral successful designs have been shown in the Jool 5 Challenge as well, which would fit the criteria for your challenge.\n\u003C/p\u003E\n"},{"CreatedByName":"sevenperforce","CreatedById":157695,"CreatedDateTime":"2017-09-01T18:02:39Z","Content":"\n\u003Cp\u003E\nJust one question: Can I assemble this ship in orbit?\n\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2017-09-01T20:17:42Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223162555\u0022 data-ipsquote-contentid=\u0022164979\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221504285415\u0022 data-ipsquote-userid=\u0022100819\u0022 data-ipsquote-username=\u0022sdj64\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n3 hours ago, sdj64 said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nBasically, a rocket \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E that can make it to Minmus? [...] talked about my progress in the Megaship Engineers thread.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nIt doesn\u0027t necessarily need to be a rocket. My working assumption is that a rocket will ultimately be a lot smaller / more reasonable, but then again, I\u0027m not a plane guy.\n\u003C/p\u003E\n\u003Cp\u003E\nThose specimens look good, though from the looks the part count must be scary.\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223162602\u0022 data-ipsquote-contentid=\u0022164979\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221504288959\u0022 data-ipsquote-userid=\u0022157695\u0022 data-ipsquote-username=\u0022sevenperforce\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n2 hours ago, sevenperforce said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nJust one question: Can I assemble this ship in orbit?\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nDo as you wish. It doesn\u0027t need to be an \u003Cabbr title=\u0022Single Stage to Orbit\u0022\u003ESSTO\u003C/abbr\u003E or a \u0022single vessel\u0022 in the stricter sense -- but at some point it should be finished, capable of cruising the system forever without requiring any more parts.\n\u003C/p\u003E\n\u003Cp\u003E\nEdit to add: my own vessel just ended up 100m/s short of a direct Minmus-Moho trip.\n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-01T20:49:14Z\u0022 title=\u002209/01/2017 08:49  PM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 1, 2017\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"sdj64","CreatedById":100819,"CreatedDateTime":"2017-09-02T01:25:04Z","Content":"\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223162703\u0022 data-ipsquote-contentid=\u0022164979\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221504297062\u0022 data-ipsquote-userid=\u0022110461\u0022 data-ipsquote-username=\u0022Laie\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Laie said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nIt doesn\u0027t necessarily need to be a rocket. My working assumption is that a rocket will ultimately be a lot smaller / more reasonable, but then again, I\u0027m not a plane guy.\n\u003C/p\u003E\n\u003Cp\u003E\nThose specimens look good, though from the looks the part count must be scary.\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\nI meant using rocket engines rather than jets, which would not be able to land on Tylo.  Most of my designs are HOTOL in atmospheres and could be considered \u0022planes\u0022 on Kerbin and Laythe.  Part count is not bad, about 150 for the mothership itself, although it carries 200\u002B parts of vehicles.\n\u003C/p\u003E\n\u003Cp\u003E\nMy main issue with vertical rocket designs for this purpose is that it\u0027s hard to deploy vehicles and recover them from vertical cargo bays, and horizontal bays on a vertical design lead to high drag.\n\u003C/p\u003E\n"},{"CreatedByName":"Kergarin","CreatedById":153808,"CreatedDateTime":"2017-09-05T09:05:10Z","Content":"\n\u003Cp\u003E\nLike this?\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/iIuSCWxPZm4?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\nIt\u0027s not exactly what you are asking for, because it \u003Cstrong\u003Eincludes Eve\u003C/strong\u003E. Sorry \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-05T19:23:03Z\u0022 title=\u002209/05/2017 07:23  PM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 5, 2017\u003C/time\u003E by Kergarin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2017-09-05T14:35:18Z","Content":"\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\n\u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100819-sdj64/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022100819\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/100819-sdj64/\u0022 rel=\u0022\u0022\u003E@sdj64\u003C/a\u003E I, too, meant rocket engines. However useful jets may be when you can use them, most of the time you don\u0027t. They may not be much of a burden on the Mun, but once you also toss Moho and Tylo into the mix, I think it\u0027s easier to make a rocket ship work on Kerbin than take jets to all the places.\n\u003C/p\u003E\n\u003Cp\u003E\n(the above was written, but not posted, a few days ago -- I\u0027ve since played with jets a little and found that they\u0027re quite useful)\n\u003C/p\u003E\n\u003Cblockquote class=\u0022ipsQuote\u0022 data-ipsquote=\u0022\u0022 data-ipsquote-contentapp=\u0022forums\u0022 data-ipsquote-contentclass=\u0022forums_Topic\u0022 data-ipsquote-contentcommentid=\u00223165379\u0022 data-ipsquote-contentid=\u0022164979\u0022 data-ipsquote-contenttype=\u0022forums\u0022 data-ipsquote-timestamp=\u00221504602310\u0022 data-ipsquote-userid=\u0022153808\u0022 data-ipsquote-username=\u0022Kergarin\u0022\u003E\n\u003Cdiv class=\u0022ipsQuote_citation\u0022\u003E\n4 hours ago, Kergarin said:\n\u003C/div\u003E\n\u003Cdiv class=\u0022ipsQuote_contents\u0022\u003E\n\u003Cp\u003E\nlike this\n\u003C/p\u003E\n\u003C/div\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cp\u003E\nYes, like this. It\u0027s very much a brute-force approach, but that\u0027s what you get for hitting Eve. For all it\u0027s bulk it\u0027s still quite shapely, I have to admit. Could you add some technical detail?\n\u003C/p\u003E\n\u003Cp\u003E\nOn interplanetary mode, I expect \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E on the order of 6km/s at an initial 3m/s or so? How long does it take to refill, how do you find the ore deposits (do you even bother)? So much inertia and just a single docking port, how do you keep it from dangling like a church bell? I\u0027ve been underwhelemed by autostruts on much less daring contraptions....\n\u003C/p\u003E\n"},{"CreatedByName":"Kergarin","CreatedById":153808,"CreatedDateTime":"2017-09-06T07:41:19Z","Content":"\n\u003Cp\u003E\nThanks \u003Cimg alt=\u0022:D\u0022 data-emoticon=\u0022\u0022 src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 title=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nI\u0027m playing stock an never had a \u003Cabbr title=\u0022Delta-V\u0022\u003EdV\u003C/abbr\u003E display so I can\u0027t tell. I have a large drill and a large converter, so I can drill everywhere and don\u0027t have to care. The refill time varies between a few days or weeks. The lander slides in verry tight, but I think the main stability is coming from the autostruts. When autostruts came out, it felt like cheating to me. But since everybody uses them, I now think it\u0027s ok, if you use it to create realistic things.\n\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2017-09-07T17:07:10Z","Content":"\n\u003Cp\u003E\nFor the time being, sevenperforce has hooked me with his\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/165251-roads-to-duna-no-moar-boosters/\u0022 rel=\u0022\u0022\u003E Duna Mission\u003C/a\u003E. Still, I\u0027d like to show what I\u0027ve been up to. For starters, I\u0027d like to give kudos to \u003Ca contenteditable=\u0022false\u0022 data-ipshover=\u0022\u0022 data-ipshover-target=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/127649-astrobond/\u0026amp;do=hovercard\u0022 data-mentionid=\u0022127649\u0022 href=\u0022https://forum.kerbalspaceprogram.com/index.php?/profile/127649-astrobond/\u0022 rel=\u0022\u0022\u003E@astrobond\u003C/a\u003E for his \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/index.php?/topic/130960-isru-rhino-ssto-explorer-mk1-jool-5-mission/\u0022 rel=\u0022\u0022\u003E\u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E Rhino Explorer\u003C/a\u003E which is my personal benchmark for a great combination of utility and attractiveness. My desire to do (or at least see) something that does one better has spawned this challenge.\n\u003C/p\u003E\n\u003Cp\u003E\nAs for myself, I like to do tailsitter rockets and arguably the best so far has been a asymmetric no-nukes design, which, sadly, still struggles to make it from \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E to Minmus without needing a gravity assist from the Mun. It also lacks the range to make a direct move to Moho, requiring a fuel stop on Gilly -- I\u0027m not so fond of actually flying that I\u0027d have started over, instead I went back into the workshop\n\u003C/p\u003E\n\u003Cp\u003E\nA quick attempt at building a spaceplane around a M3 passenger compartment worked surprisingly well; that vessel can handle most places (\u0027cept Tylo) but lacks \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E; it would still require a mothership. Ultimately it suffers the fate of all my mothership-and-shuttle designs: moving from place to place while only landing the shuttle is the exception, not the rule. If nine times out of ten you need to land the whole shebang for refueling, why bother with a shuttle at all?\n\u003C/p\u003E\n\u003Cp\u003E\nAnyway, after seeing a plane work I tried to scale it up to include \u003Cabbr title=\u0022In-Situ Resource Utilization\u0022\u003EISRU\u003C/abbr\u003E. The result is a 200t frankenplane of a vessel, that can land (and drill) both horizontally and sitting upright. Again, getting to Minmus requires a gravity assist (though maybe I should try offloading more oxidizer rather than packing some ore for refining in orbit) but from then on it has the usual stats: well over 6km/s on nukes alone on 2m/s², with enough combined nuke\u002Brocket capacity to make a trip from Vall to Tylo.  Boring.\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022SSTA.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022768\u0022 src=\u0022http://ksp.schnobs.de/stuff/SSTA.jpg\u0022 width=\u0022817\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\nRemember, they\u0027re that big because I wanted to include a sizeable crew capacity.\n\u003C/p\u003E\n\u003Cp\u003E\nOf all these, the rocket still the design I like the most. I managed to match the offset \u003Cabbr title=\u0022Center of Mass\u0022\u003ECoM\u003C/abbr\u003E and \u003Cabbr title=\u0022Center of Thrust\u0022\u003ECoT\u003C/abbr\u003E so well you don\u0027t notice that it\u0027s there. The gliding properties aren\u0027t anything to write home about, but fully sufficient to make it to \u003Cabbr title=\u0022Kerbal Space Center\u0022\u003EKSC\u003C/abbr\u003E, pull it up into a stall, and then back into the parking lot on rocket power.\n\u003C/p\u003E\n"},{"CreatedByName":"AeroGav","CreatedById":152027,"CreatedDateTime":"2017-09-08T19:24:44Z","Content":"\n\u003Cp\u003E\nI recently built this - \u003Ca href=\u0022https://kerbalx.com/AeroGav/Starsailor\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://kerbalx.com/AeroGav/Starsailor\u003C/a\u003E\n\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022HU4PHmY.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022http://i.imgur.com/HU4PHmY.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cp\u003E\n\u003Cimg alt=\u0022dhB2b55.jpg\u0022 class=\u0022ipsImage\u0022 height=\u0022578\u0022 src=\u0022http://i.imgur.com/dhB2b55.jpg\u0022 width=\u00221024\u0022\u003E\u003C/p\u003E\n\u003Cdiv class=\u0022ipsEmbeddedVideo ipsEmbeddedVideo_limited\u0022\u003E\n\u003Cdiv\u003E\n\u003Ciframe allowfullscreen=\u0022true\u0022 frameborder=\u00220\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/DrqCdu79T50?feature=oembed\u0022 width=\u0022480\u0022\u003E\u003C/iframe\u003E\n\u003C/div\u003E\n\u003C/div\u003E\n\u003Cp\u003E\n5 Seats for 40 tons.    As a liquid fuel only ship, it gets to Kerbin orbit with 2600dv left.     With full tanks (after IRSU somewhere) you have over 4800.    \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E on the twin nukes is fair, 0.3 to 1 or better, enough to do injection burns in one shot.       I made a test flight with it to Laythe via Minmus and Duna.   I\u0027m a better pilot than astronaut so i like having all that delta V that i can get to Jool without fancy gravity assists.       Without chemical rockets however it lacks the \u003Cabbr title=\u0022Thrust-to-weight ratio\u0022\u003ETWR\u003C/abbr\u003E to go everywhere.\n\u003C/p\u003E\n\u003Cp\u003E\nVall is probably doable if you take off with less than full load - just enough fuel to reach Pol or Bop.  But not Tylo.        I need to build a mk2 version which will carry a small Tylo lander in its cargo bay, that should work.      Eve is obviously impossible, stock,   and as for Moho,  I\u0027d surely have thought not,  unless you are much cleverer with gravity assists than i am.    I went there once,  in an  ion ship that had 18000dV in \u003Cabbr title=\u0022Low Kerbin Orbit\u0022\u003ELKO\u003C/abbr\u003E.    The spaceplane that launched it actually gave it a 1000dv kick to start the ejection from Kerbin ,  we got gravity assists from Eve and the capture burn was split over 5 passes to utilize oberth.     Didn\u0027t have enough Xenon left to even land the thing at Moho :-(\n\u003C/p\u003E\n\u003Cp\u003E\n \n\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222017-09-08T19:25:06Z\u0022 title=\u002209/08/2017 07:25  PM\u0022 data-short=\u00226 yr\u0022\u003ESeptember 8, 2017\u003C/time\u003E by AeroGav\u003C/strong\u003E\n\u003C/span\u003E\n"}]}