{"TopicId":18004,"ForumId":25,"TopicTitle":"Recon Drone [EASY] (v0.16)","CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2012-08-28T06:44:37Z","PageNum":1,"Articles":[{"CreatedByName":"pebble_garden","CreatedById":30150,"CreatedDateTime":"2012-08-28T06:44:37Z","Content":"\n\u003Cp\u003EYou are to send a recon drone to look for possible survivors from an aborted space launch. Current intel suggests the crew might have been able to reach the pair of islands approximately 165 km NE of the Space Center. Time is of the essence, and an aircraft is too slow. We need eyes on those islands ASAP, and the drone can get there in five minutes. \u003C/p\u003E\u003Cp\u003EUse the recon drone provided or design your own. Send your unmanned/uncontrolled vehicle to glide over the island at a distance of not more than about 5km lateral distance, and take clear pictures. \u003C/p\u003E\u003Cp\u003ETarget trajectory example: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm9.staticflickr.com/8439/7878517706_9a628edf10_c_d.jpg\u0022 alt=\u00227878517706_9a628edf10_c_d.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ERecon photo example: \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://farm9.staticflickr.com/8440/7878517428_e8e494b9bb_c.jpg\u0022 alt=\u00227878517428_e8e494b9bb_c.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EInstructions\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1. Drop the Recon Drone .craft file in your Ships\\SPH\\ folder. (Or design your own, following the guidelines set out in the Rocket Javelin Challenge: \u003Ca href=\u0022http://kerbalspaceprogram.com/forum/showthread.php/17857-The-Rocket-Javelin-Challenge!\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/forum/showthread.php/17857-The-Rocket-Javelin-Challenge!\u003C/a\u003E) The craft must be unpiloted in any way, and made of stock parts only.\u003C/p\u003E\u003Cp\u003E2. Open it in the spaceplane hangar and adjust the launcher heading and up-angle to get the drone to the island. You can do this by clicking on the crew pod/ launcher and using the Shift-W/S keys for pitch and Shift-A/D for heading adjustments. Save the modified launcher with a new name and fire it off.\u003C/p\u003E\u003Cp\u003E3. Wait for the green ready light to appear in the lower left part of the screen, then hit the space bar once to fire the engine, and a second time to decouple it from the launcher. Then quickly press the right bracket key, \u0022]\u0022 to switch the camera to the unmanned drone.\u003C/p\u003E\u003Cp\u003E4. At this point you\u0027re just along for the ride. The drone will fly to wherever you aimed it, and ultimately crash. \u003C/p\u003E\u003Cp\u003E5. When you get within about 5km of the islands, take a screenshot with F1, and post it.\u003C/p\u003E\u003Cp\u003E6. If you didn\u0027t get close enough to the islands, adjust your launcher angles and try again.\u003C/p\u003E\u003Cp\u003E7. Be aware there\u0027s a little randomness in the direction the drone ends up gliding out. You may have to try more than once to get just the right final heading, even if your ballistic trajectory is perfect.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EScoring\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u003C/em\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cem\u003EBronze\u003C/em\u003E\u003C/div\u003E\u003Cem\u003E\u003C/em\u003E\u003Cdiv\u003E - You got within sight of the islands, but not close enough for a clear picture.\u003C/div\u003E\u003Cp\u003E\u003Cem\u003E\u003C/em\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cem\u003ESilver\u003C/em\u003E\u003C/div\u003E\u003Cem\u003E\u003C/em\u003E\u003Cdiv\u003E - You were able to get clear pictures of the islands.\u003C/div\u003E\u003Cp\u003E\u003Cem\u003E\u003C/em\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cem\u003EGold\u003C/em\u003E\u003C/div\u003E\u003Cem\u003E\u003C/em\u003E\u003Cdiv\u003E - You glided directly over the islands, and have the picture to prove it.\u003C/div\u003E\u003Cp\u003E\u003Cem\u003E\u003C/em\u003E\u003C/p\u003E\u003Cdiv\u003E\u003Cem\u003EPlatinum\u003C/em\u003E\u003C/div\u003E\u003Cem\u003E\u003C/em\u003E\u003Cdiv\u003E - Your drone lands/impacts on one of the two islands.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFinal Notes\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EOf course there\u0027s nothing on the island to see, but getting there is tricky. \u003C/p\u003E\u003Cp\u003ERemember the planet is rotating eastward, so the islands will have moved by the time you reach the end of your trajectory. Lead your target!\u003C/p\u003E\u003Cp\u003EThis challenge grew out of my obsession with the Rocket Javelin challenge. I don\u0027t want to say how much time I\u0027ve spent on it...but it\u0027s a lot. Over time I decided it might be fun to try to hit the two islands NE of the space center. It proved surprisingly tricky because the glider doesn\u0027t always end up gliding in the direction I want. And maybe I was also inspired by my recent nostalgia regarding Lawn Darts and other dangerous toys I had as a child.\u003C/p\u003E\u003Cp\u003EI\u0027m very proud of my Recon Drone craft. There\u0027s not a single extraneous piece on it, it\u0027s all stock parts, and it flies well in both the powered- and terminal-glide phases. Well...it does have one quirk in the ascent phase. As you\u0027ll find out! See if you can figure out how to take advantage of it.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-08-28T14:53:12Z\u0022 title=\u002208/28/2012 02:53  PM\u0022 data-short=\u002211 yr\u0022\u003EAugust 28, 2012\u003C/time\u003E by pebble_garden\u003C/strong\u003E\n\u003C/span\u003E\n"}]}