{"TopicId":20225,"ForumId":25,"TopicTitle":"The Coyote Challenge","CreatedByName":"Railsmith","CreatedById":27174,"CreatedDateTime":"2012-09-24T20:41:27Z","PageNum":1,"Articles":[{"CreatedByName":"Railsmith","CreatedById":27174,"CreatedDateTime":"2012-09-24T20:41:27Z","Content":"\n\u003Cp\u003ESo I was reading the excellent \u003Cem\u003ECoyote\u003C/em\u003E series by Allen Steele earlier, and I had a bit of inspiration. In the first book, a group of space travelers crosses the starry void in a nuclear-powered starship to form a colony on a moon of a gas giant. I would like to post this little challenge, then, based on the URSS \u003Cem\u003EAlabama\u003C/em\u003E\u0027s exploits:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E1.\u003C/strong\u003E Build an interplanetary transfer craft using nuclear engines as propulsion. One engine preferred.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E2.\u003C/strong\u003E Leave the transfer stage in Laythe orbit, ostensibly as a relay satellite, then descend to the surface via spaceplane.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3. \u003C/strong\u003ELand safely. No return necessary!\u003C/p\u003E\u003Cp\u003EBut here\u0027s where things get tricky-the bonus challenges and achievements:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWHU \u003C/strong\u003E\u003Cem\u003E\u003Cstrong\u003ESpirit of Social Collectivism Carried to the Stars\u003C/strong\u003E\u003C/em\u003E\u003Cstrong\u003E (20 pts)\u003C/strong\u003E: Launch a second craft long after the first that gets to Laythe at a very similar time. High-energy transfers will be required, and possibly FTL mods.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDana Monroe (10 pts)\u003C/strong\u003E: Your aircraft can return to \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003ECoyote\u003C/span\u003E Laythe orbit. Aerospikes and turbojets are welcomed here.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERebellion (15 pts)\u003C/strong\u003E: Retake control of your transfer stage after jet landing (probably thanks to Mechjeb) and bring it down from orbit onto a lander from the first achievement.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ERigil Kent (20 pts)\u003C/strong\u003E: Use your lander, other landed equipment, or falling Kerbonauts to kill and destroy landers and crew from the first achievement (or any other landed mission), hopefully without loss of equipment or life on your behalf.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPro Pilot (15 pts)\u003C/strong\u003E: Do a VTOL landing with your jet.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EUltra-Realist (40 pts)\u003C/strong\u003E: Hit solar escape velocity to simulate an interstellar mission before decelerating for Joolian injection.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ECarlos Montero (20 pts)\u003C/strong\u003E: Bring or jerry-rig a boat and go for a sailing trip.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EA True Kerbonaut (10 pts)\u003C/strong\u003E: Don\u0027t use Mechjeb.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat Do You Mean, \u0022Addon Forum?\u0022 (15 pts)\u003C/strong\u003E: Stock only.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EI\u0027ve No Idea How I Did This (20 pts)\u003C/strong\u003E: Land a very large aircraft, using the 3-crew cockpit.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMaverick (15 pts)\u003C/strong\u003E: Land in IVA.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EColonist (20 pts)\u003C/strong\u003E: Land with a full crew capsule of some sort.\u003C/p\u003E\u003Cp\u003EAs always, pictures, videos, and elapsed-time counts are greatly appreciated. Also, try to mention any achievements you think you\u0027ve... well, achieved. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Good luck, everyone!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFinishers:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1.\u003C/p\u003E\u003Cp\u003E2.\u003C/p\u003E\u003Cp\u003E3.\u003C/p\u003E\u003Cp\u003E4.\u003C/p\u003E\u003Cp\u003E5.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETop Scorers:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1.\u003C/p\u003E\u003Cp\u003E2.\u003C/p\u003E\u003Cp\u003E3.\u003C/p\u003E\u003Cp\u003E4.\u003C/p\u003E\u003Cp\u003E5.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222012-09-24T20:44:57Z\u0022 title=\u002209/24/2012 08:44  PM\u0022 data-short=\u002211 yr\u0022\u003ESeptember 24, 2012\u003C/time\u003E by Railsmith\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ZeroTheAstronaut","CreatedById":42366,"CreatedDateTime":"2012-09-24T21:42:17Z","Content":"\n\u003Cp\u003EA fellow coyote enthusiast! Yay!\u003C/p\u003E\u003Cp\u003ENow to get out of kerbin orbit.....\u003C/p\u003E\u003Cp\u003E(And buy a supercomputer)\u003C/p\u003E\n"}]}