{"TopicId":20408,"ForumId":25,"TopicTitle":"land on the oceans world...oh! i mean laythe.","CreatedByName":"ronger97","CreatedById":51122,"CreatedDateTime":"2012-09-26T03:37:26Z","PageNum":1,"Articles":[{"CreatedByName":"ronger97","CreatedById":51122,"CreatedDateTime":"2012-09-26T03:37:26Z","Content":"\n\u003Cp\u003EHi! im relativity new to KSP and just made my first land and return mission to the mun. but there is one target i set my eyes on as soon as i...saw it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E here is my challenge. to create a rocket to go to laythe. there is two sub missions.\u003C/p\u003E\u003Cp\u003E1: make it to laythe, take a screen shot of the surface, and return safely. \u003C/p\u003E\u003Cp\u003EOR! \u003C/p\u003E\u003Cp\u003E2: land on laythe and you dont have to return home. but you must have at least 6 kerbals in the shot and one rocket that will serve as the \u0027base\u0027. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_shocked.gif\u0022 alt=\u0022:0.0:\u0022\u003E\u003C/p\u003E\u003Cp\u003E i will try this myself if i can get things working properly but my computer tends to lag during the initial takeoff up to stage separation. makeing it hard to do gravity turns. but i will get there. my question is...who is gonna enter my space race:)\u003C/p\u003E\n"},{"CreatedByName":"Railsmith","CreatedById":27174,"CreatedDateTime":"2012-09-26T13:30:42Z","Content":"\n\u003Cp\u003EConsider me interested. Laythe is one of my first targets for interplanetary travel, but first I\u0027ve got to do some certification runs to the Mun and back: Haven\u0027t quite got used to .17 yet. Might attempt to bring a spaceplane down onto Laythe, as well. Stay tuned!\u003C/p\u003E\n"},{"CreatedByName":"generalred256","CreatedById":26949,"CreatedDateTime":"2012-09-26T13:43:47Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://www.youtube.com/watch?v=VR6D_kDx1hk\u0026amp;feature=plcp\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www.youtube.com/watch?v=VR6D_kDx1hk\u0026amp;feature=plcp\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ESomewhere in that video of mine I got some pics of Laythe. Still working on an idea on how to \u0022land\u0022 on it, but the idea I keep hearing is a spaceplane.\u003C/p\u003E\n"}]}