{"TopicId":24477,"ForumId":25,"TopicTitle":"Hawkinator\u0026#039;s almost-multiplayer pass along the save file challenge thingy.","CreatedByName":"hawkinator","CreatedById":57569,"CreatedDateTime":"2013-04-28T08:12:13Z","PageNum":5,"Articles":[{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T14:02:08Z","Content":"\n\u003Cp\u003ESorry for late reply, I am looking for enough to maneuver around the general area, I am not looking for it to be able to orbit say IF it was on the mun for example. VTOL is only for adjusting its position but it would be nice having a decent amount of fuel.\u003C/p\u003E\n"},{"CreatedByName":"ThePsuedoMonkey","CreatedById":58589,"CreatedDateTime":"2013-05-01T15:26:11Z","Content":"\n\u003Cp\u003EIt probably falls short of how much VTOL ability you were looking for, but its great at staying on the ground!\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T15:39:34Z","Content":"\n\u003Cp\u003EHey we will work with it XD I was expecting something else but, we can\u0027t always get top dog material! Where were you expecting the Soyuz station to go?\u003C/p\u003E\n"},{"CreatedByName":"ThePsuedoMonkey","CreatedById":58589,"CreatedDateTime":"2013-05-01T16:25:09Z","Content":"\n\u003Cp\u003EI was thinking it should continue its original mission of going to the Jool system now that it has a full tank.\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T16:36:32Z","Content":"\n\u003Cp\u003EPretty sure it is going to Laythe then, who is up for the challenge of setting up a Jool encounter?\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2013-05-01T16:39:34Z","Content":"\n\u003Cp\u003EOh man I\u0027m so up for this type of thing. Can\u0027t wait for next challenge\u003C/p\u003E\u003Cp\u003EEdit: Oh, no one has claimed it yet! Well, I\u0027ll be home around 4, hopefully there\u0027s a new challenge by then, or no one has claimed this one yet. I won\u0027t hold things up though if someone wants to do this one now\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T17:18:28Z","Content":"\n\u003Cp\u003EYdoow, go ahead and do the challenge! Don\u0027t forget to read the last post with the save (page 10 near the bottom).\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2013-05-01T18:25:04Z","Content":"\n\u003Cp\u003EI\u0027m at work now and will be home in 2 hours, someone can do the challenge before me if they want to, I won\u0027t hold this thread up on my behalf\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T18:30:28Z","Content":"\n\u003Cp\u003EMost likely if they see this conversation they won\u0027t, so, be ready to do it when you return home!\u003C/p\u003E\n"},{"CreatedByName":"ZingidyZongxxx","CreatedById":58363,"CreatedDateTime":"2013-05-01T19:07:38Z","Content":"\n\u003Cp\u003ESorry Ydoo, but I\u0027m claiming that challenge. So all I have to do is get it into a Jool orbit?\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EChallenge Accepted\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T19:34:53Z","Content":"\n\u003Cp\u003EYou need to get an encounter with Jool that\u0027s it. We want to keep this challenge short because we can perform side challenges then as the station gets closer to Jool, we can aerobrake it for laythe.\u003C/p\u003E\n"},{"CreatedByName":"ZingidyZongxxx","CreatedById":58363,"CreatedDateTime":"2013-05-01T19:48:45Z","Content":"\n\u003Cp\u003EOkay. This thing is a pain to get to Jool though... Not a lot of fuel and no SAS. Plus, it really doesn\u0027t have that much fuel.\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T19:55:01Z","Content":"\n\u003Cp\u003EDo the aerobrake, 300km orbit around Jool, it will be good enough for now. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E thanks \u0026lt;3\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2013-05-01T20:13:35Z","Content":"\n\u003Cp\u003EBlast it! Ah well, I should study anyway \u0026gt;.\u0026lt;\u003C/p\u003E\u003Cp\u003EI\u0027m confused though, I thought the challenge just said to make a Kerbal escape trajectory, not hit Jool?\u003C/p\u003E\u003Cp\u003EAlso, is there a irc for this challenge?\u003C/p\u003E\n"},{"CreatedByName":"ZingidyZongxxx","CreatedById":58363,"CreatedDateTime":"2013-05-01T20:24:11Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EDone!\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThe encounter isn\u0027t great, but I didn\u0027t want to timewarp too much just yet. There\u0027s still stuff to be done in the time it takes to get to Jool, and we can adjust it later. Perispais is about 2 billion meters.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/5Hqi8Ol.png\u0022 alt=\u00225Hqi8Ol.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is the jet I made for the next challenge. If you have mechjeb, install it on there. Sorry the challenge is kinda boring, but it needs to be done at some point. Feel free to do some other stuff as well.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/baE9s8h.png\u0022 alt=\u0022baE9s8h.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELink:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./?47fhpo7gb2x8u2c\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./?47fhpo7gb2x8u2c\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EChallenge:\u003C/p\u003E\u003Cp\u003ERescue the 4 stranded Kerbals from their landing site after a trip to the Mun using the provided \u0022Kerbin Rescue Jet B.\u0022 I recommend using mechjeb if you have it. The plane should be safe up to around 20-25km. I have it prepared for launch already and on the runway, so just click on it from the tracking station and take off.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKerbals killed: 0\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EOverall Kerbals Killed: 0\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-01T20:37:32Z\u0022 title=\u002205/01/2013 08:37  PM\u0022 data-short=\u002211 yr\u0022\u003EMay 1, 2013\u003C/time\u003E by ZingidyZongxxx\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T20:25:10Z","Content":"\n\u003Cp\u003EWell, we put it into Jool orbit XD or got an encounter not sure.\u003C/p\u003E\u003Cp\u003EAnd actually, its not quite and irc, but if you check out \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/24926-0-19-Kerbal-LiveFeed-Passive-Multiplayer-Plugin-Client-Server-v0-6-1\u0022 rel=\u0022external nofollow\u0022\u003EKerbal Live Feed\u003C/a\u003E by our buddy SodiumEyes, you can join the server we, as in Zingidy and I, and a bunch of others and you can chat there. I would like if others working on this thread to come there as well \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EOur server IP is klf.kerbalsp.com\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2013-05-01T20:25:47Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003EChallenge Accepted\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI should probably go back and read the challenge now\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T20:30:07Z","Content":"\n\u003Cp\u003ERead the challenge Zingidy just posted, he was the last person with the save \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T20:53:50Z","Content":"\n\u003Cp\u003EGood luck friend! Glad to see you joined KLF. Your an awesome fellow! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"ThePsuedoMonkey","CreatedById":58589,"CreatedDateTime":"2013-05-01T22:14:05Z","Content":"\n\u003Cp\u003EWe\u0027re gonna need a lot of gas to refuel all these planes! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"bulletrhli","CreatedById":55960,"CreatedDateTime":"2013-05-01T22:36:10Z","Content":"\n\u003Cp\u003EWell, since we have a probe going to Jool that will need to go to Laythe after, we might as well set up a fueling station at Jool, and we can visit all the moons or something IDK! The possibilities are limitless, I am sure we will end up going to every planet and moon, but, not for a while since there is so much more to do! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2013-05-01T22:44:31Z","Content":"\n\u003Cp\u003EDon\u0027t worry all, I\u0027m almost done with this challenge. Will post within an hour\u003C/p\u003E\n"},{"CreatedByName":"Ydoow","CreatedById":10165,"CreatedDateTime":"2013-05-01T23:49:03Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EChallenge Completed\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETotal challenges completed:\u003C/strong\u003E 21\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETotal kerbals lost:\u003C/strong\u003E 0\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETotal Vehicles lost:\u003C/strong\u003E 2\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i235.photobucket.com/albums/ee190/1ydoow1/screenshot0_zps8627e0da.png\u0022 alt=\u0022screenshot0_zps8627e0da.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EKSC took a loss on its first Rescue Jet B launch. Luckily it\u0027s just a drone, and another RJB was in the budget. Second attempt went swimmingly well (no we didn\u0027t emergency land in the water.)\u003C/p\u003E\u003Cp\u003EAll four Kerbs are safely home waiting in the RJB which is sitting behind the Space Plane Hangar.\u003C/p\u003E\u003Cp\u003EUnfortunately, while taxiing behind the SPH, the Kerbotel suffered a fire and promptly exploded. Origin and cause of fire is unknown, however deep fried chicken was found scattered about. Upon reviewing the specs, Engineers discovered a Class K Fire Extinguisher was not installed as code requires in the kitchen. Nothing more substantial has been found as far as evidence goes.\u003C/p\u003E\u003Cp\u003EWhile the kerbonauts are safely home, debris from their landing module remains. Perhaps future missions will clean it up.\u003C/p\u003E\u003Cp\u003EIn other news, KSC asks me to remind you that Soyuz-117 with commanding Jenlorf Kerman are still enroute for an encounter with Jool in 185 days. Keep this in mind if you choose to Time-Warp.\u003C/p\u003E\u003Cp\u003EEngineers have just finished crafting a new remote vehicle for deployment across the Solar System. It\u0027s Dynamic and Modular. The basic design is listed as \u0022Link Rover - Basic\u0022, this is the core design and can be built upon for greater purposes.\u003C/p\u003E\u003Cp\u003EAnother craft named \u0022Link Rover - Mobile Base\u0022 has also been provided. This acts as a Mobile Base - a hotel of sorts - capable of carrying up to 20 kerbonauts at a time. The engineers even threw in descent engines on it for you. It does not have great capability in storing/generating electricity; it\u0027s designed to thrive when joined with a supporting Link Rover.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENext Challenge from KSC:\u003C/strong\u003E KSC wants either the Link Rover - Basic, or Link Rover - Mobile Base tested before deployment to outer systems. \u003C/p\u003E\u003Cp\u003EKSC wants one of these landed on the Mun as a test, \u003Cstrong\u003Ehowever\u003C/strong\u003E...\u003C/p\u003E\u003Cp\u003EDue to the fragility and unknown properties, you must create a craft that launches the rover into Kerbin Parking orbit, then refuel at the Shiva Station before continuing to land on the Mun.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe volunteer for this challenge must only \u003C/strong\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003Elaunch and refuel\u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003E the rover at the Shiva station.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EIn the future, another mission will be assigned to land on the Mun. Whoever accepts this challenge is \u003Cstrong\u003Enot required\u003C/strong\u003E to make landing this rover on the Mun the next challenge. You are still free to create your own challenge if you wish. (I\u0027m just trying to create some long term goals for the future is all)\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/folderview?id=0B7I3dGFkZoxaUVdOUGV2R0ltZWc\u0026amp;usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://drive.google.com/folderview?id=0B7I3dGFkZoxaUVdOUGV2R0ltZWc\u0026amp;usp=sharing\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"SpaceK531","CreatedById":62535,"CreatedDateTime":"2013-05-01T23:56:39Z","Content":"\n\u003Cp\u003EI\u0027ll try this challenge out,\u003C/p\u003E\u003Cp\u003Eso,\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eno longer pending challenge completion, someone else can!\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-05-02T02:39:29Z\u0022 title=\u002205/02/2013 02:39  AM\u0022 data-short=\u002211 yr\u0022\u003EMay 2, 2013\u003C/time\u003E by SpaceK531\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SpaceK531","CreatedById":62535,"CreatedDateTime":"2013-05-02T00:41:08Z","Content":"\n\u003Cp\u003EYou may want to check the save file, I could not load a vehicle while in the save file, and thus could not launch or create a lifter for the rover.\u003C/p\u003E\n"}]}