{"TopicId":2764,"ForumId":25,"TopicTitle":"Shoot for the sun!","CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2011-10-08T14:40:08Z","PageNum":2,"Articles":[{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2011-10-12T20:07:59Z","Content":"\n\u003Cp\u003ECarolRawley, did you get back to Kerbin OK?\u003C/p\u003E\n"},{"CreatedByName":"DeadlyPear","CreatedById":9606,"CreatedDateTime":"2011-10-12T20:26:10Z","Content":"\n\u003Cp\u003ERight now I am traveling about 2,200 m/s and I have nearly a full tank of fuel.\u003C/p\u003E\u003Cp\u003EHopefully It is enough to eventually get back to Kerbin.\u003C/p\u003E\u003Cp\u003EOk here we are going past the sun. I missed it by about 5 degrees. Which is about 1,178,062,500 meters. Now that may be alot, but I still passed it.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/nloX1.png\u0022 alt=\u0022nloX1.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EEDIT: Ends up I have failed to get back to Kerbin. Third times the charm?\u003C/p\u003E\n"},{"CreatedByName":"Salda007","CreatedById":3432,"CreatedDateTime":"2011-10-12T20:39:21Z","Content":"\n\u003Cp\u003EGood news, everyone!\u003C/p\u003E\u003Cp\u003EBill, Bob, and Jeb returned from their marathon solar-approach mission this morning, touching down at something like 8:45 this morning. A press conference is planned for late tonight, once the Mission Director gets around to getting his slides in order.\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2011-10-12T21:01:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DeadlyPear\u0022 data-cite=\u0022DeadlyPear\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EEDIT: Ends up I have failed to get back to Kerbin. Third times the charm?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EToo bad DeadlyPear, getting back is trixy, nice screenies and log of doom though \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E. Say when you do it and I will make a metagame of it and move your name up to the roll call of star pilot dudes !\u003C/p\u003E\u003Cp\u003EGrats Salda007.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022thorfinn\u0022 data-cite=\u0022thorfinn\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EBooly, a question for you. In your attempts, did you go to escape by flying directly upwards? Suddenly I realized that going to a low parking orbit and then burning to escape from there is more fuel efficient. Should have known that, but I was never interested in straight-up velocity contests so I never thought about it.\u003C/p\u003E\u003Cp\u003EFlown this way, the same rocket I used previously cut the round trip time to a little less than a year. Aiming is quite tricky, for now I settled to going in an elliptical orbit and then finishing the acceleration when I was in the \u0027straight\u0027 section pointing to the Sun. (This is suboptimal). Trimmed a bit by eye with RCS on the outbound leg, final error a little more than 2 degrees (I flew half a million km to the side).\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAt first I used the orbit technique thorfinn but then I tried the straight burn and found that used less! But my orbit skills leave a little to be desired, pointing the apogee the right way takes a little finesse. Will have to experiment, I made a couple of attempts with 11x5 today and missed the space center by a few hundred meters each time :\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E reentry angle is so trixy.\u003C/p\u003E\n"},{"CreatedByName":"nivvydaskrl","CreatedById":6789,"CreatedDateTime":"2011-10-13T01:33:38Z","Content":"\n\u003Cp\u003EWhelp, I did this one in 388 days, with \u003Cem\u003Eall stock\u003C/em\u003E parts: 30 tanks of liquid fuel and 12 boosters. I circularized my orbit with 5 tanks of fuel remaining in my top stage, and shot all but about 2 and 1/3 slingshotting and then boosting sunwards. I wound up with an outbound velocity of about 1,800 m/s, and got there in 88 days.\u003C/p\u003E\u003Cp\u003EThe return trip was a lot slower, as by the time I had about 450 m/s of velocity toward Kerbin, I was down to about 1/2 tank of liquid fuel, which I wanted to hold on to for end phase maneuvering. As KSC is on the sunwards side of Kerbin and re-entry heat and G forces are concerns for creatures which AREN\\\u0027T 99% insane, I decided the \u0027treat Kerbin like a dartboard\u0027 approach was best, and tweaked my trajectory such that the green line intersected Kerbin at the general area of KSC. I landed maybe a couple hundred meters away, if that.\u003C/p\u003E\u003Cp\u003EPics follow:\u003C/p\u003E\n"},{"CreatedByName":"Thirster","CreatedById":1509,"CreatedDateTime":"2011-10-13T05:58:05Z","Content":"\n\u003Cp\u003Ewell, using a rocket with only basic parts (see first picture), I managed to orbit out there past the sun (see second picture),\u003C/p\u003E\u003Cp\u003Ethird and fourth were of the voyage out and passing of the sun, unfortunately I woke this morning with a stack error, so I never got to land. Will attempt again\u003C/p\u003E\u003Cp\u003Eoh an interesting point was I calc\\\u0027ed the speed at apo at about 1.8m/s and a total mission time of 87 or so years.\u003C/p\u003E\u003Cp\u003Ehere ends my first post to these forums. long time lurker tho \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2011-10-13T06:42:32Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dgrNG.jpg\u0022 alt=\u0022dgrNG.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis is pretty close to it, as close as you can get without it taking up the whole screen pretty much. The point is around 13600 M.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sK3LP.jpg\u0022 alt=\u0022sK3LP.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter I passed it, my ship is pointing back at the home planet.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/TDYV3.jpg\u0022 alt=\u0022TDYV3.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EA picture from the map view, after passing it I think.\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2011-10-13T08:27:06Z","Content":"\n\u003Cp\u003Enivvydaskrl what can I say, so close and yet so far?! Definitely a worthy landing and good shot to boot. Might have to consider that technique myself.\u003C/p\u003E\u003Cp\u003EProps to thirster for being insane enough to even think about orbiting Kermin at that range, tell your PC it owes you one fat lady singing!\u003C/p\u003E\u003Cp\u003EJebediah Kerman, good job your ship is not made of wax is all I can say! Excellent stellar screenies. Let the world know when you make touchdown.\u003C/p\u003E\n"},{"CreatedByName":"CarolRawley","CreatedById":4627,"CreatedDateTime":"2011-10-13T08:50:02Z","Content":"\n\u003Cp\u003EIf your still wondering about me getting back, i didn\\\u0027t even use any engines \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, I had no RCS fuel left \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"nivvydaskrl","CreatedById":6789,"CreatedDateTime":"2011-10-13T11:36:49Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022boolybooly\u0022 data-cite=\u0022boolybooly\u0022\u003E\u003Cdiv\u003E\u003Cp\u003Enivvydaskrl what can I say, so close and yet so far?! Definitely a worthy landing and good shot to boot. Might have to consider that technique myself.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe fun part is, I did most of my re-entry adjustment at around 1 billion meters out. If I\\\u0027d taken the time to refine a bit at 10 million meters, plus burned laterally towards KSC before hitting atmo, I probably would have been on the terrain.\u003C/p\u003E\u003Cp\u003EGoing 3,000 m/s at 15,000m altitude, however, tends to make you panic and dump your stages FAST! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_ohmy.png\u0022 alt=\u0022:o\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2011-10-13T18:18:19Z","Content":"\n\u003Cp\u003EDudes I made it... I tried a hybrid of direct drop and aerobraking. One aero braking pass to take the speed off the ship and then tweak apogee to just drop straight down onto the KSC terrain. Not exactly easy but getting better. Went about 1000m/s both directions.\u003C/p\u003E\u003Cp\u003EOut there...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://homepage.ntlworld.com/boolybooly/a01.jpg\u0022 alt=\u0022a01.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAerobraking pass...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://homepage.ntlworld.com/boolybooly/a02.jpg\u0022 alt=\u0022a02.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EApoapsis adjustment...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://homepage.ntlworld.com/boolybooly/a03.jpg\u0022 alt=\u0022a03.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EKerplunk...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://homepage.ntlworld.com/boolybooly/a04.jpg\u0022 alt=\u0022a04.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe ship was a bit simpler than the behemoth I was using. Still needed lots of struts and boosters though. It was 2\u002B4\u002B4 LF stages with a booster section of 12x (SRB\u002B2LFT\u002BLFE) (double 6x radial symmetry) and a bunch of SRBs under it to give it a kick. Also T8 winglets on the lowest LFT. I fired up the two rings of 6xSRB independantly. Went for the vertical burn.\u003C/p\u003E\u003Cp\u003EBeat that!\u003C/p\u003E\n"},{"CreatedByName":"nivvydaskrl","CreatedById":6789,"CreatedDateTime":"2011-10-13T20:06:41Z","Content":"\n\u003Cp\u003EI think my rocket was as follows:\u003C/p\u003E\u003Cp\u003ES0: Command pod, parachute {stack decoupler S1}\u003C/p\u003E\u003Cp\u003ES1: 1x RCS tank, 6x RCS block, 6x LFT, 1xLFE, {1x stack decoupler S2}\u003C/p\u003E\u003Cp\u003ES2: 1x RCS tank, 1x tricoupler, 3x ( 4x LFT, 1x LFE, 1x RCS block, {2x radial decoupler S3} )\u003C/p\u003E\u003Cp\u003ES3: 1x SFB, 1x {stack decoupler S4}\u003C/p\u003E\u003Cp\u003ES4: 2x LFT, 1x LFE, 1x moveable fin, {1x radial decoupler S5}\u003C/p\u003E\u003Cp\u003ES5: solid fuel booster\u003C/p\u003E\u003Cp\u003ENote: When I say something like 3x (------ {2x radial decoupler S3} ) what I mean is everything inside the parenthesis is symmetried, including the 2 stage 3s, so stage 3 is repeated six times.\u003C/p\u003E\u003Cp\u003EIt comes out to 30 liquid fuel tanks, 12 boosters, 6 fins, 9 RCS blocks, 2 RCS tanks, 10 liquid fuel engines, plus decouplers, pod, chute, and struts. It was just under 122.3 units of weight overall -- six engines would barely lift it, but to prevent topple-over and inefficiency, I fired off the 3 S2 LFEs with the S5 boosters and the S4 LFEs. This gave a really nice accelleration curve.\u003C/p\u003E\u003Cp\u003EThe design is expandable -- throw 2 more LFTs in tri-symmetry on the S2 core and the S4 radial boost stacks, a fin in tri-symmetry on the S2 core, and an advanced SAS right before the tricoupler in the S2 core. This will get into a 200m by 200m orbit with fuel still left in the S2 core stage, and a full load of fuel in the six tank S1 stage; plenty for getting to the sun and back. However, the S2 stack hates going in a straight line. The ASAS will keep it on course to establish orbit, but at the expense of about a full tank of RCS fuel. You could probably add another RCS tank in there somewhere -- I\\\u0027m pretty sure there\\\u0027s the lift capacity for it lost in a rounding error somewhere.\u003C/p\u003E\u003Cp\u003EI do establish orbit first, then do successive burns when on the opposite side of the planet from Kerbol until escape velocity. Once I\\\u0027m on an escape vector, I modify my heading on the accelleration burn towards the star to correct for any inaccuracies. I\\\u0027m hoping the correction is costs less than I save by using Kerbin to boost my velocity. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003EI might do another shot soon using the beefed up version of my rocket. Having a full 6 cans of gas will probably cut several months off the journey! Dumping all my RCS fuel before I start my outbound burn would probably help a little, too.\u003C/p\u003E\n"},{"CreatedByName":"DeadlyPear","CreatedById":9606,"CreatedDateTime":"2011-10-14T05:02:46Z","Content":"\n\u003Cp\u003EI say we have more or less mini-challenge where we attempt to get there and back to Kerbin with the least amount of parts.\u003C/p\u003E\u003Cp\u003EMy ship (I believe) had about 23 parts.\u003C/p\u003E\u003Cp\u003ETime to actually get back to kerbin though....any tips? I end up flying past kerbin by about 500 milion meters or so each time.\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2011-10-14T08:55:23Z","Content":"\n\u003Cp\u003EGood idea Deadly.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003ETip, returning to Kerbin.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EIf its a tip you want then I can tell you what I do, which is to drop out of warp about 5000M-1000M out or so and then check periapsis value and try a very short retro burn, as short as I can make it, with the ship oriented with a 5Â° bias* to one of the major axese ie 0Â°-180Â°,90Â°-270Â°, and see if the PE figure increases or decreases. If it decreases I carry on giving short burns until it starts increasing and then stop, if it increases I switch to the opposite direction on the same axis. Then when it is at its minimum I switch to the perpendular axis and try again. When the PE disappears you are heading for Kerbin so then you pick your preferred orbit axis, usually 90Â° for me and make a short burn to bring the PE figure back, which should be below 100,000m.\u003C/p\u003E\u003Cp\u003EThen go to timewarp until you see a green line at Kerbin and slow down again to make burns on the 0Â°-180Â° axese with a larger bias, to flatten that green line so it is on the ecliptic as you see it in map view. That way you will pass over KSC in orbit, though since the KSC is on the sunward side of Kerbin 24/7 at the moment (tidally locked?), frankly any return orbit will take you over it.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAerobraking.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EUse the above technique* to get the PE figure down to something between 35,500m and 40,500m and you will be set for aerobraking. \u003C/p\u003E\u003Cp\u003EWith aerobraking the deeper you go the lower and faster the resulting eccentric AP, so the more you have to burn to hit KSC. If you aerobrake too high though you wont make orbit unless you can do a retro burn...\u003C/p\u003E\u003Cp\u003EEDIT \u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003EAnother tip about escape velocity.\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EAnother thing I have been figuring out is limiting outward bound velocity so I don\\\u0027t have to use too much fuel on the turnaround. Its easy to over burn on the way out. \u003C/p\u003E\u003Cp\u003EI have been using a \u003Ca href=\u0022http://kerbalspaceprogram.com/wiki/index.php?title=Orbit_data_tables\u0022 rel=\u0022external nofollow\u0022\u003Evelocities table\u003C/a\u003E to check escape velocity per altitude and made a few experiments and found I don\\\u0027t need to be much more than 100-200 m/s over escape at 500km to be travelling at 600-700m/s by 1000M and keep that all the way out. I am guessing that its not directly proportional either. The amount of velocity you lose leaving Kerbin should decrease the faster you go, as you take less time to travel out of the gravity well. So if you give it more welly you can end up going a bit quicker than you bargained for... ;D\u003C/p\u003E\n"},{"CreatedByName":"Cannon_Fodder","CreatedById":3443,"CreatedDateTime":"2011-10-14T10:32:13Z","Content":"\n\u003Cp\u003EI have made it to the Kerbol a few times. The problem has been getting BACK to Kerbin. First missed the gravity well and just blew on by. 2nd I managed to get into the gravity well but wasn\\\u0027t able to get back. Just flew off. I am hoping 3rd time is the charm.\u003C/p\u003E\u003Cp\u003E3rd -5th all failed the \u0027Get Home\u0027 part of the challenge. I have also come to the realization that it is NOT the rocket\\\u0027s fault. I am sure with a better operator it will do just fine.\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2011-10-14T15:56:36Z","Content":"\n\u003Cp\u003ESee above tip CF, given much against my own best interests in the space race, you just have to burn semi-perpendicular to flight path on one of four headings and see if the PE goes up or down until it goes down, rinse\u0026gt;repeat etc\u003C/p\u003E\u003Cp\u003EPS my latest round trip with drop to KSC terrain (339.01.08) was using. \u003C/p\u003E\u003Cp\u003E1 P\u003C/p\u003E\u003Cp\u003E1 CM\u003C/p\u003E\u003Cp\u003E1 ASAS\u003C/p\u003E\u003Cp\u003E30 LFT 2\u002B4 \u002B 12x2\u003C/p\u003E\u003Cp\u003E13\u002B1 LFE\u003C/p\u003E\u003Cp\u003E12 SRB\u003C/p\u003E\u003Cp\u003E14 DC\u003C/p\u003E\u003Cp\u003E12 LDC\u003C/p\u003E\u003Cp\u003E37 S\u003C/p\u003E\u003Cp\u003EIt adds up to 144.55 weight if I did my sums right.\u003C/p\u003E\n"},{"CreatedByName":"Cannon_Fodder","CreatedById":3443,"CreatedDateTime":"2011-10-14T16:26:41Z","Content":"\n\u003Cp\u003EI think a big part of my problem is I am too impatient and trying to make those fine adjustments while I am still close to a billion meters out. I might give it another try but try to wait until I am a bit closer.\u003C/p\u003E\n"},{"CreatedByName":"thorfinn","CreatedById":8349,"CreatedDateTime":"2011-10-14T16:31:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cannon_Fodder\u0022 data-cite=\u0022Cannon_Fodder\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI think a big part of my problem is I am too impatient and trying to make those fine adjustments while I am still close to a billion meters out. I might give it another try but try to wait until I am a bit closer.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe farther you are, the \u003Cstrong\u003Eeasier\u003C/strong\u003E it is. If you can see the periapsis marker in the map, you can judge what effect your velocity changes are having.\u003C/p\u003E\u003Cp\u003EI used translational RCS (much more controllable than rotating the whole craft) to get a perigee in the hundreds of km while still in the solar neighborhood (at 13-14 million km).\u003C/p\u003E\n"},{"CreatedByName":"Cannon_Fodder","CreatedById":3443,"CreatedDateTime":"2011-10-14T16:39:07Z","Content":"\n\u003Cp\u003EThen I go back to my original assessment of \u0027I suck at this.\u0027\u003C/p\u003E\u003Cp\u003EMaybe I will try a few more times. [hint to HarveteR]\u003Cspan\u003EIt would be really cool if I could save the game when I was at the sun.\u003C/span\u003E[/hint]\u003C/p\u003E\n"},{"CreatedByName":"thorfinn","CreatedById":8349,"CreatedDateTime":"2011-10-14T16:40:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cannon_Fodder\u0022 data-cite=\u0022Cannon_Fodder\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EThen I go back to my original assessment of \u0027I suck at this.\u0027\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, if you don\\\u0027t use RCS it\\\u0027s really a mess. I don\\\u0027t know how Booly manages that (more patience than I have, I suppose.)\u003C/p\u003E\n"},{"CreatedByName":"boolybooly","CreatedById":6572,"CreatedDateTime":"2011-10-14T16:47:45Z","Content":"\n\u003Cp\u003EEasy peasy, vectored burns, if you are on say a 270Â° heading but at inclination of only 5Â° that is sine of 5Â° times thrust ie only 0.08x total burn goes to lateral thrust, one twelfth. You can do micro burns that tweak PE by 4,000m at 1000M.\u003C/p\u003E\u003Cp\u003EVector addition was one of the few things I learned from open university daytime TV in the summer hols when I was a bored teenager.\u003C/p\u003E\n"},{"CreatedByName":"nivvydaskrl","CreatedById":6789,"CreatedDateTime":"2011-10-14T17:02:26Z","Content":"\n\u003Cp\u003EYeah. I burned off all my RCS before doing my main burn back to Kerbin. The way I modified my vector was doing minimum-thrust burns directly towards Kerbin, with a slight (less than five degrees) offset to modify my vector. At one billion kilometers, this is a good way to get your periapsis on the same screen as Kerbin. At shorter ranges, finer tweaks are possible, until you can get it so your orbital vector puts you smack dab on KSC.\u003C/p\u003E\n"},{"CreatedByName":"killernooby","CreatedById":4966,"CreatedDateTime":"2011-10-14T18:45:05Z","Content":"\n\u003Cp\u003EWell, I made to the sun...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i302.photobucket.com/albums/nn91/killernooby/screenshot11.png\u0022 alt=\u0022screenshot11.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E I burned too a standstill at about 142000K.(I was messing about in orbit)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i302.photobucket.com/albums/nn91/killernooby/screenshot1.png\u0022 alt=\u0022screenshot1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThen decided to go the sun:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i302.photobucket.com/albums/nn91/killernooby/screenshot2.png\u0022 alt=\u0022screenshot2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was a long trip and I think Bill was eaten. I\\\u0027ll have to figure out how to get Jeb home, as Bob will probably be the next to be taken by space madness(and being locked in a capsule with Jeb for 247 days won\\\u0027t help).\u003C/p\u003E\n"},{"CreatedByName":"DeltaBravo","CreatedById":9356,"CreatedDateTime":"2011-10-14T20:16:09Z","Content":"\n\u003Cp\u003ESuccessfully made it to the Sun after 177 days. Unfortunately, I gravity sling shotted around Kerbal at about 26Mm, tossing the crew into deep space.\u003C/p\u003E\n"},{"CreatedByName":"Causeless","CreatedById":5366,"CreatedDateTime":"2011-10-14T23:48:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DeltaBravo\u0022 data-cite=\u0022DeltaBravo\u0022\u003E\u003Cdiv\u003E\u003Cp\u003ESuccessfully made it to the Sun after 177 days. Unfortunately, I gravity sling shotted around Kerbal at about 26Mm, tossing the crew into deep space.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELies, that\\\u0027s impossible. You can\\\u0027t get energy from nothing, you must have used thrust.\u003C/p\u003E\n"}]}