{"TopicId":29003,"ForumId":25,"TopicTitle":"Duna Permanent Outpost Mission Architecture Challenge","CreatedByName":"sturmstiger","CreatedById":60543,"CreatedDateTime":"2013-05-25T07:50:44Z","PageNum":10,"Articles":[{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2013-08-11T14:36:05Z","Content":"\n\u003Cp\u003EI gotta tell ya Death, every time i get frustrated with a design, a series of explosions, or calculating delta v\u0027s, I check out your posts and am really inspired to keep going. You\u0027ve got some great stuff there!\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-11T17:06:19Z","Content":"\n\u003Cp\u003EI don\u0027t want to keep posting tons of pics here so I (as others have) have created a thread to follow Project Archimedes. I\u0027m just starting the initial part of the flight so it\u0027s just a setup at present on this thread.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/45640-Project-Archimedes-for-the-Duna-Permanent-Outpost-Architectural-Challenge%28pic-heavy%29?p=586960#post586960\u0022 rel=\u0022external nofollow\u0022\u003EProject Archimedes\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2013-08-11T18:33:26Z","Content":"\n\u003Cp\u003EPatupi: Yes the heatshields work without the plugin. I was going to use the inflatable one as a hab module once.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-11T18:38:52Z","Content":"\n\u003Cp\u003EHmm, I might try that for the main ITVs. The Odyssey Hab module is a little wide. My current heatshield is fairly wide, but the wheels poke just barely outside it. Talk about burned rubber! I\u0027ll DL it and check it out to compare things.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-11T19:34:57Z","Content":"\n\u003Cp\u003EHmmm. I\u0027ve looked this over multiple times but I think it\u0027s time to give it a go. Question: The HOME mod has an inflatable tank that holds 4000 units of fuel but it starts empty. I\u0027m guessing for it to count as long term supplies, I need to fill it up.\u003C/p\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2013-08-11T20:00:26Z","Content":"\n\u003Cp\u003EI think the module you speak of is the admin module, and those hold fuel once you have the atmo miner and a ton of power hooked up and start the generator. I suppose you could use it for supplies, but I\u0027m not sure you could use the functionality of it regenerating your supplies since it is kinda easily an infinite supply mod with far fewer parts than ioncross. But, that is up to sturmstiger to decide.\u003C/p\u003E\n"},{"CreatedByName":"ThreeMartiniLaunch","CreatedById":62595,"CreatedDateTime":"2013-08-11T20:17:17Z","Content":"\n\u003Cp\u003ELaunch 5 with video and image is posted \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/43135-Destination-Duna?p=587289\u0026amp;viewfull=1#post587289\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-11T20:25:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022KeithStone\u0022 data-cite=\u0022KeithStone\u0022\u003E\u003Cdiv\u003EI think the module you speak of is the admin module, and those hold fuel once you have the atmo miner and a ton of power hooked up and start the generator. I suppose you could use it for supplies, but I\u0027m not sure you could use the functionality of it regenerating your supplies since it is kinda easily an infinite supply mod with far fewer parts than ioncross. But, that is up to sturmstiger to decide.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, there actually is an inflatable fuel tank part that goes in the HOME2 hub. HOME was updated like last week, very recently. It is part of a new HOME2 lineup that is under development and parts of it are already in the release.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-11T22:10:08Z","Content":"\n\u003Cp\u003EI will be creating a mission architecture. Rather than add a new post as I continually add to and refine my plan, I will be editing this one so check back. SSI will be using our Nova series of lifters, more specifically, specialized 100% recoverable versions of our Nova I and Nova II. Both use the same launch stage that can place payloads in excess of 50 tons (actual ammount unknown. Honestly, I\u0027ve never had a payload that the Nova can\u0027t lift \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E) in orbits over 125km (standard SSI refueling station altitude). The only real difference is the Nova II comes complete with a secondary stage for orbital rendezvous and docking. The Nova I-R can be seen below.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.com/scaled/large/59/r1mk.png\u0022 alt=\u0022r1mk.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWe will be ferrying crew as necessary with our Orion SSTO crew shuttle.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.com/a/img29/7882/vu6i.png\u0022 alt=\u0022vu6i.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOur initial outpost design has been tested on the Mun and can carry 1600 units of supplies (LFO tank) and has space for 17 kerbals. For this mission, it will be carrying a total of 4 and will also have onboard greenhouses for food and oxygen. We will be landing a Prometheus rover ahead of time to scout the surface and identify a large landing area (descent will be entirely unpowered). We plan to deliver the rover in the first transfer window. We will deliver the outpost, a Duna Lander capable of evacuating all kerbals to orbit quickly, and a small (unmanned?) orbital station with an ERV that can evac the crew to kerbin in the event things go bad, in the next transfer window.\u003C/p\u003E\u003Cp\u003E(I will be building this stuff, doing some math and testing, and making sure I can get my stuff into orbit in time later. Those updates will be posted in my next edit.)\u003C/p\u003E\u003Cp\u003EQuestion: My lifter is 100% recoverable, well over the minimum (which would have been simple as adding 4 parachutes to the first 2 pairs of boosters on a normal Nova I). Do I get some bonus for doing that?\u003C/p\u003E\u003Cp\u003EQuestion 2: What good will those greenhouses do me? I\u0027m bringing 2 of them. What good does that do?\u003C/p\u003E\n"},{"CreatedByName":"NeilC","CreatedById":57575,"CreatedDateTime":"2013-08-11T23:22:38Z","Content":"\n\u003Cp\u003EIn my original mission plan, I was planning on blending Kethane with the monoprop-tank-for-supply rule to effectively get infinite supplies. Sturmstiger disallowed this, and so I had to switch to IonCross for life support. Check it out, the exchange is in the first few pages of this thread.\u003C/p\u003E\u003Cp\u003EMy interpretation based on what he\u0027s said in this thread is: you can use any tank to hold supplies, and you can transfer supplies between tanks, as long as it\u0027s all \u0022\u003Cem\u003Esupplies\u003C/em\u003E\u0022, which were launched from Kerbin as such in a dedicated tank. For the purposes of this challenge Kethane doesn\u0027t generate supplies, it generates fuel. No tanks may be used for both fuel and supplies at different times, it\u0027s either-or.\u003C/p\u003E\u003Cp\u003ESo I would say yes, you can use the inflatable tank to hold supplies, as long as you fill it up in Kerbin orbit with \u0022supplies\u0022 launched separately, and you\u0027re not planning on using Kethane to fill it up on Duna.\u003C/p\u003E\u003Cp\u003EOf course, sturmstiger will have to confirm this before it\u0027s gospel. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-11T23:25:18Z\u0022 title=\u002208/11/2013 11:25  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 11, 2013\u003C/time\u003E by NeilC\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-12T00:19:28Z","Content":"\n\u003Cp\u003EWell, right now I have a problem. I have successfully built a rocket half the size of the Nova I but with only 10 tons less capacity (~40). Obviously, I\u0027m going to stick with the Nova I since launch spacing is based on payload capacity and not launch vehicle tonnage.\u003C/p\u003E\u003Cp\u003EI\u0027ve been working out how to make stuff work and it won\u0027t be easy. My problem is that I am over-engineering my stuff so that it won\u0027t fail, I have plenty of margin for error, and stuff otherwise just works when I need it to. This is meaning more stuff and more weight, which then means I can\u0027t build some tiny launcher to put stuff up. I got to bring out the big boys. My real problem comes from the fact that even though the Nova I-R is 100% recoverable and I can land about 75% of it within a mile of KSC (with precision parachute landing XD), it takes 75 days to build one and that my 3rd launch window is 11 days past the 500 day primary objective.\u003C/p\u003E\n"},{"CreatedByName":"NeilC","CreatedById":57575,"CreatedDateTime":"2013-08-12T00:49:18Z","Content":"\n\u003Cp\u003EI think you\u0027ve got your problem pretty well nailed down in this post, and in your mission post. IE:\u003C/p\u003E\u003Cp\u003E- You are way over-engineering. Plan your mission for single-redundancy of each type of thing (crew cabin, fuel tank, engine, launch). Anything more is overkill for the rules of this challenge.\u003C/p\u003E\u003Cp\u003E- you have space for 17 kerbals and are taking 4. Why so much space for so few? Why not remove a crew cabin to trim weight, or add kerbals to increase score?\u003C/p\u003E\u003Cp\u003E- as you said, what good are those greenhouses? I mean, of course they would grow you food if KSP or mods had proper models for that. But since they\u0027re cosmetic in terms of this challenge and your payload is over weight.... either axe them or accept that you\u0027re roleplaying restrictions beyond what this challenge requires, and you may just have to miss that second launch window in order to accommodate your RP.\u003C/p\u003E\u003Cp\u003EYou know what you need to do! Shed some weight! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"KeithStone","CreatedById":71277,"CreatedDateTime":"2013-08-12T01:06:46Z","Content":"\n\u003Cp\u003EI see them now, I just got the new HOME pack but havent messed with it much yet. Might have to try to make some use out of em.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-12T01:07:14Z","Content":"\n\u003Cp\u003EWorking out the mission mechanics has given me some ideas. Part of my weight problem was the use of a cruise stage when I don\u0027t need it. The Nova I often has 70% or more fuel left in the center stage even after circularization. With some testing, I should be able to re-rig the launcher to have less fuel remaining on orbital insertion and have a cruise stage (2.5m NERVA) remaining. That will cut launcher weight and make for more efficient launching. I\u0027m also working on my resupply system and based on how much supplies the outpost has, 1 large 2.5m monoprop tank will push 4 kerbals to 2 transfer windows without supply. I will actually be taking 7. The reason I have room for 17 is I have a 2 man command pod, a 5 man hab module and 2 inflatable 5 man hab modules. I am not counting them for in-transit housing because they are locked in by a heat shield. I am adding an inflatable hab module that holds 6 so I can take 7 kerbals interplanetary and still keep my RP within rules and regs and not pack kerbals into un-inflated habitats. Also, greenhouses combined make 1 ton total mass. I\u0027ve completely redone my mission architecture, it just isn\u0027t posted yet. I should actually be able to run the outpost on the first transfer window.\u003C/p\u003E\u003Cp\u003EMy last idea to fix this was, if the math allows me, piggyback some smaller payloads onto others (on top of the obvious solution of just launching a bunch on the same rocket). I think I can piggyback one supply rover on with the crew transfer lander. I also need to test if heat shielding is required on a Duna lander or if an entry not at interplanetary speeds will not require that. If the answer is no, then my landers are re-usable.\u003C/p\u003E\u003Cp\u003EEDIT: Oh wow. 1600 units of supplies for 7 kerbals gets me 228.57 days. Wow, that is unbelievably perfect.\u003C/p\u003E\u003Cp\u003EEDIT II: If I launch 4 supply packages (maybe rovers), I need 400 units of supply on each and I\u0027m good. Time to do more math XD\u003C/p\u003E\u003Cp\u003EEDIT III: With some work on the Launcher, I can now safely get to orbit with built in cruise stage. so now I might have to rework the nominal capacity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T01:45:21Z\u0022 title=\u002208/12/2013 01:45  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by Captain Sierra\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"NeilC","CreatedById":57575,"CreatedDateTime":"2013-08-12T02:03:26Z","Content":"\n\u003Cp\u003EYou\u0027re talking quite a bit about working on your launcher and cruise stage, and you mentioned that you\u0027re not sure how much your Nova I will lift. I didn\u0027t follow all of what you said, but some of it made me think you might be using the final stage of your Nova I as a cruise stage.\u003C/p\u003E\u003Cp\u003EJust want to remind you that for this challenge there is a hard distinction between launcher and payload. you need to pick a nominal payload mass, and all your launcher needs to do is lift that mass to LKO. The payload can\u0027t share stages or fuel with the launcher. If your launcher is oversized for your payload mass (like the Nova I might be), you can just launch exactly the nominal payload mass and see how much fuel is left over after circularizing in LKO. You have to stop burning and stage with at least that amount of fuel left over, no matter the actual weight of the current payload you happen to be launching.\u003C/p\u003E\u003Cp\u003EThe only way to bend the rules a bit and launch a heavier-than-nominal payload is if it has engines: then it can be a bit over the nominal mass as long as you show that it can finish its circularization burn on its own once you\u0027ve detached the launcher at the right time.\u003C/p\u003E\u003Cp\u003EI just mention it because you may be spending time on your launcher that you don\u0027t need to. You can kind of treat it as a black box, and just design payloads to be less than your chosen nominal mass.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T02:44:20Z\u0022 title=\u002208/12/2013 02:44  AM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by NeilC\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Raptor831","CreatedById":68286,"CreatedDateTime":"2013-08-12T16:51:48Z","Content":"\n\u003Cp\u003EAlmost ready to submit my mission plan. I need to do some final testing of all the modules before I commit. Make sure I didn\u0027t forget batteries anywhere... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIn the meantime, I can show off some pics of what I do have.\u003C/p\u003E\u003Cp\u003EHere\u0027s my launcher, the Explorer, rated at 30 tons:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://f.cl.ly/items/1i1o0W1x3w3S2K0I1E23/screenshot54.png\u0022 alt=\u0022screenshot54.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EReusable boosters from Explorer, splashdown was within ~10km from KSC:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://f.cl.ly/items/0B0s2F451a1f19393Y3j/screenshot53.png\u0022 alt=\u0022screenshot53.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EMy rover module in testing:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://f.cl.ly/items/1e372N3o3J0h0M0L0I1p/screenshot49.png\u0022 alt=\u0022screenshot49.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ERover container landed (on the launchpad again) ready to be deployed:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://f.cl.ly/items/2W3Z0D230a26103r1Z2A/screenshot50.png\u0022 alt=\u0022screenshot50.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sturmstiger","CreatedById":60543,"CreatedDateTime":"2013-08-12T19:00:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Captain Sierra\u0022 data-cite=\u0022Captain Sierra\u0022\u003E\u003Cdiv\u003EHmmm. I\u0027ve looked this over multiple times but I think it\u0027s time to give it a go. Question: The HOME mod has an inflatable tank that holds 4000 units of fuel but it starts empty. I\u0027m guessing for it to count as long term supplies, I need to fill it up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIndeed. You\u0027ll need to fill it up in before launching it.\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-12T19:24:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sturmstiger\u0022 data-cite=\u0022sturmstiger\u0022\u003E\u003Cdiv\u003EIndeed. You\u0027ll need to fill it up in before launching it.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo, I see that as cheating. In all fairness, I refuse to load supplies (or kerbals) in inflatable things that are not inflated, which it wouldnt be until after the outpost lands (though it might be good to just have them and land thousands of units of supplies and stock the base for years all at once). That\u0027s the same reason I am only bringing 7 kerbals instead of the 17 I have space for.\u003C/p\u003E\u003Cp\u003EAs for my launcher, it is really overengineered. What I need to do is just say f*** it and make it the bare minimum recoverable rather than the overbuilt 100% recoverable. I also need to chop down on the center stage fuel and do some nominal capacity testing. with the integrated drive stage removed. For the record, the Nova 1 is my standard all purpose launcher and was not designed for this challenge at all (at least the non-re-usable one). It\u0027s heavy lift capacity being so high is why I use it religiously.\u003C/p\u003E\n"},{"CreatedByName":"sturmstiger","CreatedById":60543,"CreatedDateTime":"2013-08-12T19:32:10Z","Content":"\n\u003Cp\u003E1. I remembered somebody asking if 100% reusable LV gets any extra bonus beyond the existing reusable LV bonus, but I couldn\u0027t find who was asking anymore. Well the answer is no - this is not a \u0022reusable LV challenge\u0022, and at this point there will unlikely be any change to the rules anymore.\u003C/p\u003E\u003Cp\u003E2. There were somebody asking if we should separate stock only entries with those using mods. For this challenge many mods bring greater realism to the entries and do not necessarily make it any easier than full-stock, thus I do not wish to discourage use of mods in general in anyway.\u003C/p\u003E\u003Cp\u003E3. I am having a bit trouble keeping track of who has completed the entry requirements. Besides those already on the leaderboard, who else has completed the entry requirement? Patupi? Speeding Mullet? If anyone believes his/her entry is complete but did not see it on the leaderboard please let me know.\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-12T20:48:19Z","Content":"\n\u003Cp\u003EOriginally I asked about 100% reusability a long time ago for my BHL design, but the Catalyst I\u0027m using now is not 100% reusable. I can\u0027t remember if you actually said that a 100% reusable vessel still only gets 1.5xtonnage in days, but that was the impression I got.\u003C/p\u003E\u003Cp\u003EAs far as I can tell my entry as far as the schedule is concerned is complete. I believe I put all the data on that page a while back (Page 20 I think) including number of launches and all the mission scores. Let me know if I missed something. I think I\u0027m actually now at Mission execution 1 or possibly 2, but I\u0027m still in the middle of the full mission play through right now. I may still find something that I haven\u0027t tested but thought I did. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-12T20:53:24Z\u0022 title=\u002208/12/2013 08:53  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 12, 2013\u003C/time\u003E by Patupi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-08-12T23:19:45Z","Content":"\n\u003Cp\u003Esturmstiger what are your thoughts on the HOME Habs?\u003C/p\u003E\n"},{"CreatedByName":"Captain Sierra","CreatedById":74666,"CreatedDateTime":"2013-08-12T23:21:03Z","Content":"\n\u003Cp\u003EI\u0027m using them. I have been operating under the assumption that the same rules apply. 2 crew spaces = 1 kerbal on long term missions.\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-08-13T00:06:15Z","Content":"\n\u003Cp\u003EWell so far im having a hard time keeping my 3.5m rockets in one piece, just spent an hour with a weird problem. I would jettison the outer solid rockets and the damn center tank would explode.....\u003C/p\u003E\n"},{"CreatedByName":"Donziboy2","CreatedById":74984,"CreatedDateTime":"2013-08-13T01:21:15Z","Content":"\n\u003Cp\u003EJeb thought the sun was getting to me so he built an umbrella......\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sRTjhES.jpg\u0022 alt=\u0022sRTjhES.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Patupi","CreatedById":71098,"CreatedDateTime":"2013-08-13T01:38:55Z","Content":"\n\u003Cp\u003EAs long as he doesn\u0027t open it during lightning storms! Oh, the ionic interference during re-entry is continuous isn\u0027t it. Never mind!\u003C/p\u003E\n"}]}