{"TopicId":29003,"ForumId":25,"TopicTitle":"Duna Permanent Outpost Mission Architecture Challenge","CreatedByName":"sturmstiger","CreatedById":60543,"CreatedDateTime":"2013-05-25T07:50:44Z","PageNum":18,"Articles":[{"CreatedByName":"borisperrons","CreatedById":76286,"CreatedDateTime":"2013-11-04T14:35:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Speeding Mullet\u0022 data-cite=\u0022Speeding Mullet\u0022\u003E\u003Cdiv\u003EExcellent work borisperrons, look forward to seeing the mission progress.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you! Hope I won\u0027t disappoint you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Speeding Mullet","CreatedById":62635,"CreatedDateTime":"2013-11-06T02:49:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022borisperrons\u0022 data-cite=\u0022borisperrons\u0022\u003E\u003Cdiv\u003EThank you! Hope I won\u0027t disappoint you \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou won\u0027t, just remember we are here for help if you need clarifications / advice etc as there are a fair few people with this challenge tucked under their belt, or like me stalled at a late stage! The thread itself contains a wealth of information also as most stuff that needs clarification has been previously clarified....\u003C/p\u003E\n"},{"CreatedByName":"borisperrons","CreatedById":76286,"CreatedDateTime":"2013-11-07T20:21:49Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EDUMAS hardware designs\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EOuranos IH-R\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SNbsWAA.png\u0022 alt=\u0022SNbsWAA.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe latest addition to the Ouranos lifter family, this rocket can drive a nominal payload of 30 tons all the way up to LKO. Also, in a move to regain the simpaty of the ambientalist movement after the not-so-succesful NERVA test, the two lateral Ouranos Common Cores are fully reusable.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003ENuclear Universal Transfer Stage\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oxdJQ9D.png\u0022 alt=\u0022oxdJQ9D.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EA can of fuel, a space GPS and a bunch of weapon grade plutonium. Really, rocket science is much easier than the common kerbal thinks.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EInterplanetary Crew Transfer Stage\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7uYMxqF.png\u0022 alt=\u00227uYMxqF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis remarkable flying machine can safely shuttle 4 kerbals between Kerbin and Duna, guaranteeing all the comforts of a 1963 Mini Minor. To ensure crew safety, two chemical rockets are included in the design in addition to the main NERVA engine, and a strict avoid-to-put-psychotic-AI-in-charge policy was implemented.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EHURR\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cwDN0my.png\u0022 alt=\u0022cwDN0my.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAn orbiting docking rig for Duna orbit.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EDURR\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SFODrO4.png\u0022 alt=\u0022SFODrO4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe Duna lander for the DUMAS program. The weight of the vessel was reduced to the maximum kerbally possible, removing unnecessary equipement such as long range communication devices, lavatories, emergency oxygen supplies etc. (a revolt of the kerbonauts stopped KSC from removing extra snack supplies). The downfall of this approach is that the vehicle can sustain the kerbals just for the travel between LDO and surface, living little room for error.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EEmergency Return Vehicle\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Pr7lnwe.png\u0022 alt=\u0022Pr7lnwe.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe liferaft for the stranded kerbals. It can land and bring them back to orbit, take them back home across the infinite void of mind and make an excellent coffee. To accomodate the kerbals in such a small space without paranoid rage otburst, two approaches were considered:\u003C/p\u003E\u003Cp\u003E1- the Gallyfreyan bigger-on-the-inside approach;\u003C/p\u003E\u003Cp\u003E2- the daily-subministrations-of-anhestetics approach.\u003C/p\u003E\u003Cp\u003EBecause we live in the real world and we\u0027re green men, and not two hearted time travelling aliens, the solution was clear. \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003ESelf Propelled Satellite System\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mY9KjQJ.png\u0022 alt=\u0022mY9KjQJ.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThose three satellites have the pivotal role of ensuring all-day communications between Duna and Kerbin from a geostationary orbit, and to monitor the metereological situation of the planet. No more unexpected killer sandstorms on your base!\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EIke Exploration Package\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/viBK6p9.png\u0022 alt=\u0022viBK6p9.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOriginally designed for the Mun, this two kerbals lander was refitted for Ike exploration. To bear the aerobraking heat, the engine bells are built with the toughest material ever invented by kerbality: gold-titanium alloy, with the adding of unobtanium and a touch of chromed zinc, for the shiny effects.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EKerbin Refueling Station\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/vfNNnLV.png\u0022 alt=\u0022vfNNnLV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJust an expanded Aither upper stage with three docking ports and a basic gyroscopical stabilty system. After the chromed zinc, we had to save money from another place.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EDuna Crawler Base\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Fs1Vo4K.png\u0022 alt=\u0022Fs1Vo4K.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe most advanced roving vehicle ever conceived by a kerbal mind. It can easily accomodate a crew of 8, with all the comforts of a fresh and breathable atmosphere, and carry them around Duna in the most comfortable way.\u003C/p\u003E\u003Cp\u003EIt also includes some useful thingyes, like:\u003C/p\u003E\u003Cp\u003E-long range communication antennas;\u003C/p\u003E\u003Cp\u003E-12 all-terrain amortized wheels, for the maximum driving comfort on unpaved roads, wich are the most likely to be found on Duna;\u003C/p\u003E\u003Cp\u003E-an internal laboratory and sample processing facility, for your everyday scientific needs;\u003C/p\u003E\u003Cp\u003E-4 (yes my dear sir, 4!) Two Seat Semiautomatic Surface Transporters (TSSST) for short to medium range explorations, that also double as automatic probes, thanks to the internal autonomous driving computer;\u003C/p\u003E\u003Cp\u003E-3 parachute assemblies, detatchable to keep a clean outline eliminating all unnecessary and eye-hurting equipments,\u003C/p\u003E\u003Cp\u003E-automatic parking system (???)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EDuna airship\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VpxJ7JN.png\u0022 alt=\u0022VpxJ7JN.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe original plan called for a winged craft, and preliminar Kerbin high altitude tests showed a maximum service ceiling for propeller driven crafts of 8500 meters, a result that was initially deemed a great success.\u003C/p\u003E\u003Cp\u003EBut KSC janitor had the necessity to ruin Spaceplane Design Office party by pointing out that to find a comparable air density on Duna, the pilot would likely had to dig for about a kilometer.\u003C/p\u003E\u003Cp\u003EWhile this fact trew SDO engineers in a severe depression state, it was considered the best news ever by the boffins at Balloon Division, Because it made them pass overnight from a \u0022I assure you, an airship can be really useful in space! PLEASE DON\u0027T CUT OUR BUDGET!!!\u0022 situation to a \u0022Take this, spaceplanefags! UP YOURS, SDO!!!\u0022 one.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EDuna Long Range Exploration Rover\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/RB6bSDH.png\u0022 alt=\u0022RB6bSDH.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m pretty sure that the name explains almost everything about this bad boy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-08T00:18:31Z\u0022 title=\u002211/08/2013 12:18  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 8, 2013\u003C/time\u003E by borisperrons\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Speeding Mullet","CreatedById":62635,"CreatedDateTime":"2013-11-08T02:21:14Z","Content":"\n\u003Cp\u003EAwesome Borisperrons great design work - I see a few things there that I wish I\u0027d had the idea for. The sat tree is a really elegant design. I\u0027m progressing again now should be able to finish my report by Saturday - then I can upgrade which is great as I cannot wait for the tech tree to take me back to basics.\u003C/p\u003E\n"},{"CreatedByName":"Weegee","CreatedById":72084,"CreatedDateTime":"2013-11-11T05:43:18Z","Content":"\n\u003Cp\u003EI\u0027ve been tinkering at this for a little while, and I\u0027ve finally got enough to post. Note that this is till very much in progress, as I\u0027ve just send my first ship to Duna. Bonus points for you if you know what the project name (and my launch vehicle) is named after. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EPretty pictures:\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/nRNqJ\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EElements of the Mission:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMulti-Use Labor Element (M.U.L.E.), the main launch vehicle.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EI didn\u0027t take any pictures of it here, but it is visible in some of the pictures above. It\u0027s a simple design, capable of putting 18 tons into a 70-ish km orbit. That\u0027s about all there is to say about it.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EInterplanetary Tug\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EPretty much a bog-standard tug. In the first picture, there is no docking port on the bottom, but I will be using one there for my next ship. There also might be slight modifications between tugs depending on the payload, but they are all about the same.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EShort-Range Rover (for lack of a better name)\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EDoes what it says on the tin (or fairing in this case...). Seats two kerbals for short term land expeditions. Comes with a probe (which I now realize is upside down... I\u0027ll have to fix that for the second one) so it can be controlled remotely. Also features fairing/heat shield, and a maneuverability unit that is attached under the fairing.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EManeuverability unit\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis is a fairly general term, but so far it\u0027s the smallest 2.5m tank with RCS tanks and radial orange engines to perform rendezvous and docking, then to deorbit the attched payload. It also will have different versions based on the payload.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhat\u0027s Next?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ECurrently, the first ship is en-route to Duna, and I\u0027m going to launch the next tug soon (as the required amount of days have passed). I still need to work out my lander, main base, and how they are returning. But it\u0027s starting to get late, and I only get to use this computer every other day, so it might be a while before I update. But still, stay tuned and let me know if you have feedback.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-11-11T05:57:32Z","Content":"\n\u003Cp\u003EM.U.L.E. is one of my favorite games! I still play it, in fact.. emu of course. D. Bunten created a great immersive game. How about Modem Wars? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: \u0022emu\u0022 refers to the C64 \u0022M.U.L.E.\u0022, not the Atari port.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-11T05:59:40Z\u0022 title=\u002211/11/2013 05:59  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 11, 2013\u003C/time\u003E by Death Engineering\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-11-12T04:03:46Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/3rGoYOfl.png\u0022 alt=\u00223rGoYOfl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EBackup-Backup Plan C-3\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAfter the Tri-Hub Lander and 6 kerbals successfully set up camp on Duna, a shift in the Kerbol\u0027s phase from 0.21 to 0.22 caused all deployed landing gear to spontaneously retract. The resulting impact of the sensitive aerospike engines onto Duna\u0027s surface caused the starboard engine on the backup surface-return lander to detach! Since this vehicle relies on two functioning engines, it was rendered inert. \u003C/p\u003E\u003Cp\u003ELuckily, a backup plan was already in place! After discovering that the Tri-Hub Lander did not burn fuel evenly from the outboard tanks, meaning it could not return to orbit, plans were already in place to send a backup to the backup surface-return lander. An Ike landing mission was also accommodated thanks to the cancelled plans to send a second, flawed, Tri-Hub Lander.\u003C/p\u003E\u003Cp\u003ELaunches in this update:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E298: 600 Unit Surface Supplies\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E334: Ike Landing Mission\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E370: Ike Crew module\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E406: Ike IP Stage\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E442: Surface-return lander\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E478: IP Stage/Phase B supplies\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe plan is to use the surface supplies to exhaustion then use the second surface-return lander to return the 6 kerbals to the Phase B orbiting station. Supplies will already have arrived at the station for the return mission. If all goes well, the last day on Duna will be day 713, seven days before the Duna -\u0026gt; Kerbin window. There is no backup-backup-backup plan, so if this revised mission profile fails, Bill will return home in the Phase B alone, leaving 6 frozen kerbals on Duna.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/GmabP\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Weegee","CreatedById":72084,"CreatedDateTime":"2013-11-12T20:47:15Z","Content":"\n\u003Cp\u003EI\u0027ve been at it again! This update, I mostly just got the first payload onto Duna\u0027s surface. Anyway, pretty pictures!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/10oG0\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EAfter that was over, I launched the tug for my next ship. Also, last time I forgot the mission log! So here\u0027s the log for this post and the one before.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EDay 10: Interplanetary Tug 1 launch\u003Cbr\u003EDay 46: Short Range Rover 1 launched, then docked with Interplanetary Tug 1\u003Cbr\u003EDay 55(about?): Project Irata - Ship One (comprising of the first two launches) heads for Duna\u003Cbr\u003EDay 82: Interplanetary Tug 2 Launch\u003Cbr\u003EDay 105-6: Aerobrake and capture of Project Irata - Ship One. Short Range Rover 1 then undocked and then descended to Duna\u0027s surface, losing two sets of wheels.\u003Cbr\u003EDay 118: Next launch (TBD!)\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOh, and the only mods I am using are Procedural Fairings for fairings (oddly enough), and Kerbal Engineer Redux for delta-v calculator and flight info.\u003C/p\u003E\u003Cp\u003EAnd one question: If no rentry effects appear, and heat shields not required? Thanks, and stay tuned for next time! Let me know if you have any feedback.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-11-12T23:17:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Weegee\u0022 data-cite=\u0022Weegee\u0022\u003E\u003Cdiv\u003EAnd one question: If no rentry effects appear, and heat shields not required? Thanks, and stay tuned for next time! Let me know if you have any feedback.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFor heat shielding, I think most people installed shields for anything that uses aerobraking, which is how I did my first entry to this challenge. On the second entry for the challenge, I have shielding for anything that aero\u003Cem\u003Ecaptures\u003C/em\u003E through Duna or Kerbin. However, I have designed my landers with the intent of doing a semi-powered descent with parachute assistance, so they\u0027re never really going through the atmosphere with any dangerous speeds and thus no shielding. No real way to prove it\u0027s safe that way, as I don\u0027t use \u0027deadly re-entry\u0027, but in theory it should be fine.\u003C/p\u003E\u003Cp\u003ELooks like a rough landing! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I\u0027ve not had a lot of success with parachute only landings on Duna. What is the nominal capacity of your lifter for this challenge? Looking forward to seeing your kerbals on Duna! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Weegee","CreatedById":72084,"CreatedDateTime":"2013-11-12T23:47:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Death Engineering\u0022 data-cite=\u0022Death Engineering\u0022\u003E\u003Cdiv\u003EFor heat shielding, I think most people installed shields for anything that uses aerobraking, which is how I did my first entry to this challenge. On the second entry for the challenge, I have shielding for anything that aero\u003Cem\u003Ecaptures\u003C/em\u003E through Duna or Kerbin. However, I have designed my landers with the intent of doing a semi-powered descent with parachute assistance, so they\u0027re never really going through the atmosphere with any dangerous speeds and thus no shielding. No real way to prove it\u0027s safe that way, as I don\u0027t use \u0027deadly re-entry\u0027, but in theory it should be fine.\u003Cp\u003ELooks like a rough landing! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I\u0027ve not had a lot of success with parachute only landings on Duna. What is the nominal capacity of your lifter for this challenge? Looking forward to seeing your kerbals on Duna! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHehe, I already knew via \u003Cspan style=\u0022text-decoration:line-through;\u0022\u003EHyper-Edit\u003C/span\u003E \u003Cem\u003Eadvanced computer simulations\u003C/em\u003E that that would happen. I\u0027ve gotten it to only pop its middle wheels before, leaving it completely drivable, but that didn\u0027t happen and I didn\u0027t want to re-do the descent \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E I\u0027ll add more parachutes to the next one, but I didn\u0027t really have room for more on that one.\u003C/p\u003E\u003Cp\u003EI\u0027m thinking that I won\u0027t be putting heat shields on at least what kerbals need to transfer to, because then I\u0027d need to make one from scratch (not a fairing) and it\u0027s not all that necessary.\u003C/p\u003E\u003Cp\u003EAs for the lifter, in the other post I said it can lift 18 tons into a 70-ish km orbit, though I might be able to manage a little more. I found that I really don\u0027t need that much capacity, and I think I\u0027ll only have one thing over the capacity of my lifter, which is the main base module that lands. If it ends up being too heavy, I might just chop it in half (since its symmetrical) and send it up on two rockets, because I think I have extra launches before the next window.\u003C/p\u003E\n"},{"CreatedByName":"Weegee","CreatedById":72084,"CreatedDateTime":"2013-11-13T05:05:38Z","Content":"\n\u003Cp\u003ESmaller update, after I post this I\u0027m off to bed. Anyways, pretty pictures!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/i2FmD\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003ENext on the list is the Mobile base (which the kerbals will land in) and the return method, as I only have 2 launches before the window.\u003C/p\u003E\u003Cp\u003EStay tuned!\u003C/p\u003E\u003Cp\u003ENew mission log:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EDay 118: Rover 2 launched, and docked with Interplanetary Tug 2. Renamed as Project Irata - Ship 2 when docked.\u003Cbr\u003EDay 154: Supply Pod 1 launched and docked to Project Irata - Ship 2\u003Cbr\u003EDay 190: Interplanetary Tug 3 launched\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Speeding Mullet","CreatedById":62635,"CreatedDateTime":"2013-11-13T09:34:55Z","Content":"\n\u003Cp\u003EWeegee: Very neat operation you got going on there!\u003C/p\u003E\u003Cp\u003EDeath Engineering: This is the second time round for you isn\u0027t it? You sir are brave! I really enjoyed following your first attempt.\u003C/p\u003E\u003Cp\u003EI\u0027ve finally finished my mission up to day 1021 - report link in my signature for anyone that wants to check it out!\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-11-13T20:56:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Speeding Mullet\u0022 data-cite=\u0022Speeding Mullet\u0022\u003E\u003Cdiv\u003EDeath Engineering: This is the second time round for you isn\u0027t it? You sir are brave! I really enjoyed following your first attempt.\u003Cp\u003EI\u0027ve finally finished my mission up to day 1021 - report link in my signature for anyone that wants to check it out!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, I am nearly done a second run at this challenge. Much smaller scale and tried out assembling large space-trains in orbit with multiple launches.. did not work so well on my PC. \u003C/p\u003E\u003Cp\u003EThanks for reading the \u0022Duna Space Program\u0022 mission reports! It is continued \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58070-Vall-Exploration-Challege-Done-with-Duna-we-re-volitant-on-Vall!\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E. Thanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: did you add up your score for this challenge?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-13T21:05:59Z\u0022 title=\u002211/13/2013 09:05  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 13, 2013\u003C/time\u003E by Death Engineering\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"borisperrons","CreatedById":76286,"CreatedDateTime":"2013-11-14T16:29:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Speeding Mullet\u0022 data-cite=\u0022Speeding Mullet\u0022\u003E\u003Cdiv\u003EAwesome Borisperrons great design work - I see a few things there that I wish I\u0027d had the idea for. The sat tree is a really elegant design. I\u0027m progressing again now should be able to finish my report by Saturday - then I can upgrade which is great as I cannot wait for the tech tree to take me back to basics.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThank you! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EYes, the satellite system is a favourite of mine, as it\u0027s really useful for putting equally spaced probes on the same orbit. (Also it\u0027s the only avaible method for me, since i\u0027m a bit crappy at orbital mechanics \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E )\u003C/p\u003E\u003Cp\u003EAfter posting I made a couple of design changes (mostly added a couple of RCS tanks here or a parachute there) and now I\u0027m ready for liftoff, as soon as RL stops bothering me, and after Doctor Who 50th special is released.\u003C/p\u003E\u003Cp\u003EI looked at your mission report and, well, bravo!!! Really elegant, if I can say my opinion on it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Weegee","CreatedById":72084,"CreatedDateTime":"2013-11-15T01:47:13Z","Content":"\n\u003Cp\u003EHmm. I\u0027m still in the planning stages of my next two launches before my fleet of two ships (eventually comprised of 6 launches) has to leave for Duna. The only parts left to design are the habitation the Kerbals will live in on the surface and the return method. I\u0027ll eventually come up with an answer for those, but I have a bigger issue: How do I get the crew up there? I\u0027m very bad at spaceplanes (I haven\u0027t even made an SSTO yet) so this will be problematic.\u003C/p\u003E\u003Cp\u003EMy question is: Can I either use another person\u0027s SSTO and presume that my space program bought it, or can I just ship them up there with the payload? This challenge was created before .21, when it was very hard to put kerbals into a command pod that wasn\u0027t the main control unit, so I don\u0027t know if this would be against the rules or not. I\u0027m thinking of going with the latter, because I\u0027d much prefer it to using someone else\u0027s design.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-11-18T06:14:29Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/9H5gbmQl.png\u0022 alt=\u00229H5gbmQl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDuna Space Program - Second attempt completed\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe final launches which brought supplies to the Duna surface team and to the Duna orbiting station, another surface-return craft, and an Ike landing mission were all successful. The surface team exhausted their surface supplies on day 711 and ascended to the Phase B Kerbin return craft in Duna orbit. During their short stay in Duna orbit while awaiting their Kerbin return window, the Ike landing mission earned no points in the challenge, but was successful all the same. Once the Ike landing crew member (Bob!) made it back to the return vehicle, the crew headed for home.\u003C/p\u003E\u003Cp\u003EAfter a rather long transfer from Duna to Kerbin, the crew landed on Kerbin on day 822. This second attempt at this challenge was intended to have a much higher score for Kerbals on Duna, but issues with how docking-port crossfeed (didn\u0027t) work meant that a second landing team was not feasible. Then, complications with the 0.21 -\u0026gt; 0.22 update caused the loss of the Duna return craft, requiring another one be sent out to Duna as a replacement. These problems caused the \u0027Mission Execution\u0027 score to be just \u00271\u0027, but did earn scores of \u00272\u0027 for both \u0027Crew Safety\u0027 and \u0027Mission Robustness\u0027, since everyone made it back despite losing two spacecraft and one rover. \u003C/p\u003E\u003Cp\u003EIn the end, this was a good rehearsal for the mission profile of returning crews to Kerbin using different spacecraft which got them there and doing precise inter-planetary orbital insertions. It was also a realization how much flexibility comes from using more, smaller launches instead of fewer, larger launches. \u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFinal Scoring to Day 1000\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMods used:\u003C/span\u003E Kerbal Alarm Clock\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EUntil Day 500:\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E14 launches\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E336t NIMLKO\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEarly Mission Value: 888\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEfficiency: 2.64\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EUntil Day 1000:\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E14 launches\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E336t NIMLKO\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESustained Mission Value: 1266\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EEfficiency: 6.41\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EAchievements:\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EMission Execution: 1\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECrew Mobility: 2\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EBase Mobility: 0\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECrew Safety: 2\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMission Robustness: 2\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EScore: 7\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/r5p7v\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Speeding Mullet","CreatedById":62635,"CreatedDateTime":"2013-11-18T12:33:55Z","Content":"\n\u003Cp\u003EGreat work on finishing the challenge a second time. I noticed your second go was less efficient than your first - which do you think was actually more playable though?\u003C/p\u003E\u003Cp\u003E\u002Brep\u003C/p\u003E\n"},{"CreatedByName":"borisperrons","CreatedById":76286,"CreatedDateTime":"2013-11-18T15:10:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Weegee\u0022 data-cite=\u0022Weegee\u0022\u003E\u003Cdiv\u003EMy question is: Can I either use another person\u0027s SSTO and presume that my space program bought it, or can I just ship them up there with the payload? This challenge was created before .21, when it was very hard to put kerbals into a command pod that wasn\u0027t the main control unit, so I don\u0027t know if this would be against the rules or not. I\u0027m thinking of going with the latter, because I\u0027d much prefer it to using someone else\u0027s design.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs I understood the rules, you don\u0027t have to actually fly up your kerbals in a SSTO, but you can just pretend, for example, that your launcher is fully recoverable and that it can be refitted in a few days, \u003Cem\u003Ea lÃƒÂ \u003C/em\u003E Falcon 9 Heavy.\u003C/p\u003E\n"},{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-11-18T15:14:26Z","Content":"\n\u003Cp\u003EWhat\u0027s with the \u0022No firing the Nukes in Duna\u0027s atmosphere? Because I have the perfect Duna-Kerbin-Duna Shuttle, it even can carry a 10 ton payload!\u003C/p\u003E\n"},{"CreatedByName":"meyst","CreatedById":59881,"CreatedDateTime":"2013-11-18T18:35:35Z","Content":"\n\u003Cp\u003ESturmstiger has not posted on the forums since August, I hope he\u0027s okay.\u003C/p\u003E\n"},{"CreatedByName":"Speeding Mullet","CreatedById":62635,"CreatedDateTime":"2013-11-18T21:57:39Z","Content":"\n\u003Cp\u003Ezekes - It\u0027s one of the rules of the challenge. Presumably due to the hilariously radioactive exhaust.\u003C/p\u003E\u003Cp\u003Emeyst - I took a two month break until recently, maybe he\u0027s got something on in RL but also hoping he\u0027s ok.\u003C/p\u003E\n"},{"CreatedByName":"Weegee","CreatedById":72084,"CreatedDateTime":"2013-11-19T01:14:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022borisperrons\u0022 data-cite=\u0022borisperrons\u0022\u003E\u003Cdiv\u003EAs I understood the rules, you don\u0027t have to actually fly up your kerbals in a SSTO, but you can just pretend, for example, that your launcher is fully recoverable and that it can be refitted in a few days, \u003Cem\u003Ea lÃƒÂ \u003C/em\u003E Falcon 9 Heavy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh, alright. I\u0027m just about to launch my hab module up into orbit as I\u0027m typing this, so I kinda needed to know by now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E. I\u0027ll just have to fit some extra supplies on so they can wait the extra time until the window. It annoys me that I could almost launch another payload before the next window, I\u0027m only off by 8 days. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2013-11-19T13:05:28Z","Content":"\n\u003Cp\u003EI finally got to start this mission read the post at \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/46342-Kapricorn-One?highlight=kapricorn\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/46342-Kapricorn-One?highlight=kapricorn\u003C/a\u003E i include details of the mission and a timetable. Any images posted will uploaded at the album and i will post the reports at the topic i made\u003C/p\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2013-11-19T19:20:36Z","Content":"\n\u003Cp\u003EUpdate: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/46342-Kapricorn-One?highlight=kapricorn\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/46342-Kapricorn-One?highlight=kapricorn\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"borisperrons","CreatedById":76286,"CreatedDateTime":"2013-11-19T19:33:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Weegee\u0022 data-cite=\u0022Weegee\u0022\u003E\u003Cdiv\u003EIt annoys me that I could almost launch another payload before the next window, I\u0027m only off by 8 days. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, just do it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E . A launch window to another planet doesn\u0027t open and close in a single day. For example, Maven had a 20 days launch window. It\u0027s a period of time, you can launch on the end of it, and still have and encounter with Duna (although you\u0027ll need a bit more dV, and maybe a midway correction burn).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-19T22:15:24Z\u0022 title=\u002211/19/2013 10:15  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 19, 2013\u003C/time\u003E by borisperrons\u003C/strong\u003E\n\u003C/span\u003E\n"}]}