{"TopicId":33401,"ForumId":25,"TopicTitle":"R-Cup Cupola Challenge!","CreatedByName":"NASI Director","CreatedById":64746,"CreatedDateTime":"2013-06-17T06:49:04Z","PageNum":1,"Articles":[{"CreatedByName":"NASI Director","CreatedById":64746,"CreatedDateTime":"2013-06-17T06:49:04Z","Content":"\n\u003Cp\u003EBob: \u003Cem\u003E\u0022It sure is a great day to be here at KSC, isn\u0027t it Bill?\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EBill: \u003Cem\u003E\u0022Sure is Bob. Today we\u0027re going to observe the R-Cup Cupola Challenge! Let\u0027s go to Jebediah, or own field reporter!\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003E\u0022Thanks guys I\u0027m here-\u0022 \u003C/em\u003E\u003C/p\u003E\u003Cp\u003EAs Jeb was talking, a giant rocket crashed, but fortunately the command module was still intact with the pilot inside. \u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003E\u0022That was probably nothing. Anyway, I\u0027m here at the spaceplane hangar to report on the contestant\u0027s results. The goal is to jump in a Cupola module and try to roll down the runway into the safety of the-\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003EAgain, as Jeb was talking, the module had landed the fall perfectly on the runway and started to roll towards the water, as there were falling debris everywhere.\u003C/p\u003E\u003Cp\u003EJeb: \u003Cem\u003E\u0022Safety of the water. As you can see behind, above, left, right, and in front of me, there is falling debris everywhere!\u0022\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETHE RULES\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E1.) No other parts except the Cupola module. No rocket assisted starts.\u003C/p\u003E\u003Cp\u003E2.) No cheats of anysort.\u003C/p\u003E\u003Cp\u003E3.) No rotating or moving the module in the SPH except as designated.\u003C/p\u003E\u003Cp\u003E4.) No using trim or fine controls to maneuver the module. I can\u0027t allow it to be that easy. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ETHE GOAL\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou must go to the SPH and select the Cupola module. Add a launch clamp to start the timer and only lower the Cupola to avoid it from blowing up upon launch. Without voiding rule no. 3, launch and wait until physics kicks in. After that, good luck. You must turn the Cupola 90 degrees then start rolling down the runway to the sea to avoid being crushed by totally-real-and-not-imaginary rocket debris in the shortest amount of time possible. Sure, it sounds easy, but it definitely isn\u0027t. As you roll, you must continuously correct your self or fall down and be disqualified. When you can\u0027t turn back over and your module is stuck facing the sky, you are out. End the flight and record your score. It is possible, but I\u0027m not very good at it.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IZ4qPtT.png\u0022 alt=\u0022IZ4qPtT.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ELike I said, no rotating or moving the Cupola. It should look like this...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/4sQN6uQ.jpg\u0022 alt=\u00224sQN6uQ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI forgot to add the launch clamp. Silly me.\u003C/p\u003E\u003Cp\u003EGood luck and Godsroll, Kerbals... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_kiss.gif\u0022 alt=\u0022:kiss:\u0022\u003E\u003C/p\u003E\u003Cp\u003ETOP SCORES\u003C/p\u003E\u003Cp\u003E1.)\u003C/p\u003E\u003Cp\u003E2.)\u003C/p\u003E\u003Cp\u003E3.)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-06-17T06:54:28Z\u0022 title=\u002206/17/2013 06:54  AM\u0022 data-short=\u002211 yr\u0022\u003EJune 17, 2013\u003C/time\u003E by NASI Director\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bean","CreatedById":70878,"CreatedDateTime":"2013-06-17T10:49:31Z","Content":"\n\u003Cp\u003EMy Cupola spawns differently, could you post a picture on the launch pad to clarify?\u003C/p\u003E\n"},{"CreatedByName":"Naten","CreatedById":70923,"CreatedDateTime":"2013-06-17T14:41:17Z","Content":"\n\u003Cp\u003ELooks interesting. Maybe I\u0027ll try. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SirJodelstein","CreatedById":62251,"CreatedDateTime":"2013-06-17T19:26:42Z","Content":"\n\u003Cp\u003EI got 383m, with one almost-tipover halfway through. \u003Ca href=\u0022https://www.dropbox.com/s/lgui288batuq5s6/CupolaRacing383m.wmv\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cstrong\u003EVideo Link\u003C/strong\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EInteresting challenge, but I would say the track is too long and straight for me to consider following this challenge through to its end. Might i humbly suggest a different (shorter and curved) track - like turning taking the road that leads to the Space Plane Hangar (Finish line = Hangar Doors)?\u003C/p\u003E\n"}]}