{"TopicId":44290,"ForumId":25,"TopicTitle":"Munar kethane fuel depot challenge","CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-08-29T16:09:02Z","PageNum":1,"Articles":[{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-08-29T16:09:02Z","Content":"\n\u003Cp\u003EI am facsinated by the way in which my progress through playing KSP has mirrored our progress in space in real life: first the struggle into orbit, then trying to rendezvous / dock, then kunging out to the mun with no real plan of what to do when I got there. Then building fuel depots / space stations in LKO, then trying to get people to Mun in a more planned, organised way, and now trying to get resources from the mun (via Kethane). I am interested in getting resources from the mun, as I see that it is the only way that I can make any resonable progress towards the other plannets without having to launch loads of fuel from Kerbin. (I am also role playing only using forms of propulsion that are in use in real life, so do not use nuclear engines, which I consider to be game changing, especially for interplanetary travel.)\u003C/p\u003E\u003Cp\u003ESo I thought I would offer a challenge based on my current endeavour of trying to establish an infrustructure for mining the mum for fuel that will allow onward interplanetary exploration, without the need to constantly lauch fuel from Kerbin.\u003C/p\u003E\u003Cp\u003EGoals:\u003C/p\u003E\u003Cp\u003E* To establish a fuel depot containing at least 10 jumbo tanks of Liquidfuel/LOX and 10 large (2.5m mono propellant tanks) in a 500km lunar orbit\u003C/p\u003E\u003Cp\u003E* To have suffiencent infrustructure in LKO or beyond that will allow for the fuel deopt to be refilled without the need to launch any fuel from kerbin\u003C/p\u003E\u003Cp\u003E* To minimise the wet mass of all hardware lauched from kerbin to establish the depot\u003C/p\u003E\u003Cp\u003E* To establish the depot in the minimum possible time\u003C/p\u003E\u003Cp\u003ERules:\u003C/p\u003E\u003Cp\u003E* Mods allowed: Kethane, KAS, autopilots etc, and parts that are not game changing (ie no over powered engines etc)\u003C/p\u003E\u003Cp\u003E* All fuel lifted from the munar surface must be transported in tanks with no engines attached that are transported as cargo and left on the munar surface (ie the lander/lifter needs to be seperate from the cargo, and needs to be able to detach / reattach on the munar surface.) It is up to you whether or not you have your refinary in orbin, on the surface or built into the lifttanks.\u003C/p\u003E\u003Cp\u003E* No nuclear engines\u003C/p\u003E\u003Cp\u003E* No launching of empty tanks from Kerbin.\u003C/p\u003E\u003Cp\u003E* To prevent loads of hardware being launched ridiculously quickly, to have a delay between launches equivenant to 1 hour per ton of wetmass of the launch vehicle.\u003C/p\u003E\u003Cp\u003EThe idea of the challenge is to find the most efficent way of becoming establishing a sustainable infrustructure. There will be two score boards, one ordered by the time taken to complete the challenge, the second by the total wetmass launched.\u003C/p\u003E\u003Cp\u003EScoreboards:\u003C/p\u003E\u003Cp\u003EMass launched:\u003C/p\u003E\u003Cp\u003E1)\u003C/p\u003E\u003Cp\u003E2)\u003C/p\u003E\u003Cp\u003E3)\u003C/p\u003E\u003Cp\u003ETime taken\u003C/p\u003E\u003Cp\u003E1)\u003C/p\u003E\u003Cp\u003E2)\u003C/p\u003E\u003Cp\u003E3)\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-08-29T16:15:07Z","Content":"\n\u003Cp\u003EFor wanting to get high efficiency out of it, you certainly have introduced a lot of bottlenecks in the rules to counteract efficiency! In fact, you seem to have pretty much eliminated one of the key elements of efficient Kethane operations by banning nuclear rockets, and another by requiring a ridiculously high 500KM orbit for the fuel depot, and yet another by banning the burning of stored-up fuel to get back to orbit. What, exactly, are you trying to accomplish by having an \u0022efficiency\u0022 challenge where three key elements of efficiency are denied?\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-08-29T17:27:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SkyRender\u0022 data-cite=\u0022SkyRender\u0022\u003E\u003Cdiv\u003EFor wanting to get high efficiency out of it, you certainly have introduced a lot of bottlenecks in the rules to counteract efficiency! In fact, you seem to have pretty much eliminated one of the key elements of efficient Kethane operations by banning nuclear rockets, and another by requiring a ridiculously high 500KM orbit for the fuel depot, and yet another by banning the burning of stored-up fuel to get back to orbit. What, exactly, are you trying to accomplish by having an \u0022efficiency\u0022 challenge where three key elements of efficiency are denied?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for your comments. In answer to your question, \u0022what an I trying to acomplish?\u0022, I would say firstly to have fun, but also to simulate the extent to which interplanetary travel becomes more accessable once you are able to create rocket fuel in orbit (or at least outside the kerbin atmosphere) using current rocket technology. In response to your three points:\u003C/p\u003E\u003Cp\u003E1) The 500km orbit for the depot has 2 purposes:\u003C/p\u003E\u003Cp\u003Ea) Because as the fuel is to be used for ongoing travel, I do not want to require the craft that will use the fuel to have to go to too low a munar orbit to refuel. I was going to say 1000km orbit but was worried that would slow down the gameplay too much.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E because it makes the timing of your fuel uplifts more challenging. If the depot was in a low orbit you could hop up and down every 30minutes or so. With a higher orbit you need to consider it it is worth launching more hardware to be able to uplift larger amounts of fuel on each depot orbit.\u003C/p\u003E\u003Cp\u003E2) The no nuclear engines is because I am interested in how this work using rocket types that are currently in use. We all know that nuclear engines are the best choice once you are in orbit, but they do not exist in the real world (or are not in use in the real world) and even hypothetical ones do not burn the same fuel as chemical rockets. Lots of folks play the game with kethane already, and I am sure lots of folks have already found an efficent way of setting up a mining operation. The idea of this challenge is to change the rules a little bit.\u003C/p\u003E\u003Cp\u003E3) I am afraid I am not sure what you mean by \u0022banning the buring of stored up fuel to get back into orbit\u0022 - which bit if the challenge does that refer to, so I can clarify it?\u003C/p\u003E\u003Cp\u003EI am sorry if you this challenge does not encourage you to play the game the way you like to play it. I would love to share trying to perfect this challenge with you, but if it does not float your boat, there are plenty of other things you can do with KSP - enjoy.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-08-29T17:32:30Z\u0022 title=\u002208/29/2013 05:32  PM\u0022 data-short=\u002210 yr\u0022\u003EAugust 29, 2013\u003C/time\u003E by codepoet\u003C/strong\u003E\n\u003Cbr\u003Espelling\n\u003C/span\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-08-29T17:43:59Z","Content":"\n\u003Cp\u003EWell, for efficiency, I\u0027ve allways build kethane-mining facilities around Minmus. Much less dV needed to land, to lift off and to leave kerbin SOI.\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-08-29T18:11:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xeldrak\u0022 data-cite=\u0022Xeldrak\u0022\u003E\u003Cdiv\u003EWell, for efficiency, I\u0027ve allways build kethane-mining facilities around Minmus. Much less dV needed to land, to lift off and to leave kerbin SOI.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo-one said that you have to do the mining on the Mun... However if you mine on Minimus the transfer windows will make it harder to get large amounts of fuel back to munar orbit in a short time without launching lots of hardware.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-08-29T18:16:57Z","Content":"\n\u003Cp\u003EI\u0027m mostly referring to the rather odd policy of requiring detachable fuel tanks. What possible benefit is there to leaving the tanks on the Munar surface as opposed to having a fuel tanker that can lug the fuel into orbit without the additional overhead and failure potential involved in trying to manage a rotating-fuel-tank system? Even with that higher orbit requirement (which, incidentally, is still silly; you would be better off requiring an LKO station instead and let the player decide how to get the fuel all the way down there), it wouldn\u0027t up the operational efficiency at all assuming the player was smart about their mining unit\u0027s design and keeping it busy while waiting for the tanker to return.\u003C/p\u003E\u003Cp\u003E A good challenge provides limits which open up possibilities for the player, not which close off possibilities entirely simply for the sake of forcing the player to meet arbitrary and illogical goals.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-08-29T18:41:43Z","Content":"\n\u003Cp\u003EJust having a look to see what this challenge entails..\u003C/p\u003E\u003Cp\u003E1 Some kind of mobile moonbase that can mine Kethane?\u003C/p\u003E\u003Cp\u003E2 A crane for docking and undocking on the Mun (makes this a lot easier imo) \u003C/p\u003E\u003Cp\u003E3 Transporter from base to space station in 500km orbit\u003C/p\u003E\u003Cp\u003E4 Aforementioned space station around Mun\u003C/p\u003E\u003Cp\u003EThat\u0027s quite a lot there.. have you attempted this yourself?\u003C/p\u003E\n"},{"CreatedByName":"codepoet","CreatedById":73449,"CreatedDateTime":"2013-08-29T21:00:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Richy teh space man\u0022 data-cite=\u0022Richy teh space man\u0022\u003E\u003Cdiv\u003EJust having a look to see what this challenge entails..\u003Cp\u003E1 Some kind of mobile moonbase that can mine Kethane?\u003C/p\u003E\u003Cp\u003E2 A crane for docking and undocking on the Mun (makes this a lot easier imo) \u003C/p\u003E\u003Cp\u003E3 Transporter from base to space station in 500km orbit\u003C/p\u003E\u003Cp\u003E4 Aforementioned space station around Mun\u003C/p\u003E\u003Cp\u003EThat\u0027s quite a lot there.. have you attempted this yourself?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes I have done all of the above, but not in a game scored using the rules I set out, I am doing that now to work out a baseline for the challenge, and consider how it could be improved. Here is my architecture:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s14.postimg.org/howy5r9ox/screenshot0.png\u0022 alt=\u0022screenshot0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo this is the fuel depot. It is made up of individual jumbo tanks each of which is an uplift tank that can all be docked togethed end to end, have power and a control unit, and attitude control. It is designed to be carried by a lifter/lander:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s12.postimg.org/j63sedhl9/screenshot1.png\u0022 alt=\u0022screenshot1.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the lifter/lander with a tank slung underneath it. The tanks can also be re-docked on the top or the lifter/lander, to make then easier to docker together. See below:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s21.postimg.org/z61ou2h87/screenshot21.png\u0022 alt=\u0022screenshot21.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EHere is the kethane refinary. It has accomodation for some kerbals who are needed to operate the KAS parts in order to refull the tanks.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s23.postimg.org/wz3u247tn/screenshot2.png\u0022 alt=\u0022screenshot2.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnce the tank has been lander on the surface, I have a rover that can dock to it from underneath and move it alongside the refinary to be filled. This means I do not need to worry about crashing into the refinary because I have to land alongside it. Here the rover is getting ready to attach to a tank.\u003C/p\u003E\u003Cp\u003EHere is a tank being refilled from the refinary\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s21.postimg.org/ypyuqln07/screenshot16.png\u0022 alt=\u0022screenshot16.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EFinally the tank can be driven back to the lifter/lander to be redocked with it, and lofted into orbit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s24.postimg.org/yvul6sk05/screenshot8.png\u0022 alt=\u0022screenshot8.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ENotice that the tank can be docked to the rover of the lifter/lander without using a crane\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://s11.postimg.org/d2kgzm4zn/screenshot10.png\u0022 alt=\u0022screenshot10.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI will post a score one I have played out the scenerio in full. However There is great scope for improvement:\u003C/p\u003E\u003Cp\u003E1) the refinary does not need its own propulsion - it could be landed by the lifter/lander\u003C/p\u003E\u003Cp\u003E2) I scanned the mun using a seperate kethane probe, but could have just attached the kethane scanner to the refinary, and scanned before landing\u003C/p\u003E\u003Cp\u003E3) The depot could be built of tanks that are not all landable, and then only use one uplift tank.\u003C/p\u003E\u003Cp\u003E4) The refinary has more more accomodation than is needed, and does not need such a large monopropellant tank.\u003C/p\u003E\n"},{"CreatedByName":"Richy teh space man","CreatedById":12511,"CreatedDateTime":"2013-08-29T22:54:53Z","Content":"\n\u003Cp\u003EOk, this makes the challenge a little clearer.\u003C/p\u003E\u003Cp\u003EI do think that Kethane mining this way is a little inefficient, and the rules are a little restrictive as they are, however I may try this challenge over the next day or two if I get time.\u003C/p\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-08-30T02:39:38Z","Content":"\n\u003Cp\u003EThis really more strikes me as a \u0022do my way of Kethane mining, only try to do it better than I do it\u0022 challenge. Not very open-ended, in short, which is a pity since Kethane tends to lend itself to more open-ended challenges. Perhaps I should cook up a variant that does encourage and reward trying things from a myriad of different angles...\u003C/p\u003E\n"}]}