{"TopicId":44413,"ForumId":25,"TopicTitle":"BSC - Two-stage Lander - We have a WINNER!","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-08-30T21:04:10Z","PageNum":6,"Articles":[{"CreatedByName":"Whirligig Girl","CreatedById":36077,"CreatedDateTime":"2013-09-09T11:04:15Z","Content":"\n\u003Cp\u003EI am very disappointed that Mulbin won. If they packaged Mulbin\u0027s lander with the game, do you think anyone could figure out what the heck was going on? I love Mulbin\u0027s ships but they are not by any means intuitive or simple. That\u0027s what the stock ships should be, not ships that are essentially a shell of an Apollo Lunar Module wrapped around some fuel and an engine.\u003C/p\u003E\n"},{"CreatedByName":"Mesklin","CreatedById":73898,"CreatedDateTime":"2013-09-09T13:16:19Z","Content":"\n\u003Cp\u003ECongrats Mulbin. I see, people like more beatifull and puzzle ships, but not effective ))\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-09T13:35:47Z\u0022 title=\u002209/09/2013 01:35  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 9, 2013\u003C/time\u003E by Mesklin\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2013-09-09T13:57:49Z","Content":"\n\u003Cp\u003EI think that the wording of the challenge was a bit ambiguous to be honest. Many people, my self included took \u0022stock lander\u0022 to mean a lander built purely with stock parts (no mods), it\u0027s only when reading the OP more carefully that you realize it actually meant a lander suitable to be included in the game.\u003C/p\u003E\u003Cp\u003ETwo different meanings of \u0022stock\u0022. People voted for my ship because it is 100% stock and they liked it better than the others = \u0022best stock lander\u0022. Not because it is suitable for inclusion in squads official files.\u003C/p\u003E\u003Cp\u003EPerhaps a more rigid structure to fit what squad would actually want would work better as a competition for this purpose? For instance - Stock lander, no excessive part clipping, under 100 parts\u003C/p\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2013-09-09T14:04:26Z","Content":"\n\u003Cp\u003ETo be honest If I\u0027d realised at the start it was for a replacement default lander I\u0027d probably have entered this one...\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i1024.photobucket.com/albums/y302/bloobot/screenshot18_zps277306c2.jpg\u0022 alt=\u0022screenshot18_zps277306c2.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-09-09T14:12:20Z","Content":"\n\u003Cp\u003EWell, I allways thought, that the wording straight to the point. After a two-line preamble, the first thing in the first post was:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs you all should know by now, the stock crafts in KSP are horrible for the most part. So I challenge you to come up with a replacement craft.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI spent a whole paragraph on what you should consider when building your craft. Also, while the word \u0022stock\u0022 has two meanings, \u0022Better Stock Craft\u0022 seems to make sense only with one meaning. I like that the challenge has very few restictions, so that you guys can really show your ideas. \u003C/p\u003E\u003Cp\u003EI try to work a lot with different font sizes and pictures to mark the most importat stuff - but I can\u0027t help it if noone reads more than the first line.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-09T14:21:35Z\u0022 title=\u002209/09/2013 02:21  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 9, 2013\u003C/time\u003E by Xeldrak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Mulbin","CreatedById":55562,"CreatedDateTime":"2013-09-09T14:24:37Z","Content":"\n\u003Cp\u003EHey... don\u0027t shoot the messenger. \u003C/p\u003E\u003Cp\u003ENearly half of the voters voted for me which means either... \u003C/p\u003E\u003Cp\u003EA. They didn\u0027t understand your meaning and just like my craft better than the others. \u003C/p\u003E\u003Cp\u003EB. They think my craft is suitable to be a stock craft to be included in the game.\u003C/p\u003E\u003Cp\u003EEither way I\u0027m very flattered. I think though it\u0027s probably best if I don\u0027t enter any more of these, what should be a fun competition has a bit of a nasty atmosphere when the \u0022wrong person\u0022 wins. Keep up the good work though, at the very least its a great forum for some really great ship design.\u003C/p\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-09-09T14:37:15Z","Content":"\n\u003Cp\u003EI\u0027m not shooting you.....I\u0027m shooting the guys that do not read past the second line. \u003C/p\u003E\u003Cp\u003EI have no problem with you winning, it\u0027s a fun challenge and all there is to win is bragging rights, it\u0027s not like we are actually voting for new stock craft here. \u003C/p\u003E\u003Cp\u003EIt\u0027s not your fault, that people voted for you and you shouldn\u0027t receive any hate for this. The winners are choosen purely by vote and votes sometimes end in strange results - tough luck.\u003C/p\u003E\u003Cp\u003EI put quite a lot of effort into these challenges and if people come in here, do not read past the first line and vote for anything without leaving a line, I get the feeling that neither my work nor the work of the guys, that write 500\u002B words to justify their vote or that considered all the stuff I wrote and built a craft according to it is really appreciated. I think this is simply bad mannered behaviour and has nothing to do with \u0022the wrong person\u0022 winning.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-09T14:52:41Z\u0022 title=\u002209/09/2013 02:52  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 9, 2013\u003C/time\u003E by Xeldrak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-09-09T14:45:47Z","Content":"\n\u003Cp\u003EThere\u0027s some pretty interesting social interactions that go on with picking the winner in competitions of this nature. Often the winner seems to be determined not by what people actually feel is best, but by who they think \u0022will\u0022 win. It\u0027s exacerbated further when everyone casts their votes in turn, as follow-the-leader peer pressure kicks in. I\u0027ve observed this effect many times; it\u0027s a fascinating psychology experiment. Especially when you get a situation where people start \u0022competing\u0022 for who wins and vote-bouncing between two candidates. Often the only qualification that counts in sequential on-the-spot voting of this sort is who\u0027s in the lead and who\u0027s just behind; every other option falls by the wayside as people abandon actual opinions in favor of picking the winner. You get more accurate-to-actual-opinion results in a silent vote, wherein nobody participating in the voting can know what anyone else voting actually chose.\u003C/p\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-09-09T14:49:03Z","Content":"\n\u003Cp\u003EWell, be that as it may, \u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAs you all should know by now, the stock crafts in KSP are horrible for the most part. So I challenge you to come up with a replacement craft.\u003C/div\u003E\u003C/blockquote\u003E is now the first line in the \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/49328-BSC-(Better-Stock-Crafts)-Ravenspear-Mk-1-Building-Phase\u0022 rel=\u0022external nofollow\u0022\u003Enew challenge\u003C/a\u003E and it\u0027s been made bold. So maybe more people will now realize what the challenge is about...\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-09T14:55:08Z\u0022 title=\u002209/09/2013 02:55  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 9, 2013\u003C/time\u003E by Xeldrak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SkyRender","CreatedById":10651,"CreatedDateTime":"2013-09-09T15:06:10Z","Content":"\n\u003Cp\u003EThe problem has never been one of realization, it\u0027s the nature of the vote that trips people up. As I said, public sequential voting has a huge drawback in that it encourages groupthink. Next time you may want to consider only counting votes that get PMed to you. It won\u0027t stop the groupthink effect entirely since some will still post their votes or discuss who they\u0027re picking privately and invoke the peer pressure effect, but it will encourage more people to be brave enough to say what they actually think instead of trying to \u0022pick the winner\u0022.\u003C/p\u003E\n"},{"CreatedByName":"astropapi1","CreatedById":57507,"CreatedDateTime":"2013-09-10T05:00:36Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mulbin\u0022 data-cite=\u0022Mulbin\u0022\u003E\u003Cdiv\u003EHey... don\u0027t shoot the messenger. \u003Cp\u003ENearly half of the voters voted for me which means either... \u003C/p\u003E\u003Cp\u003EA. They didn\u0027t understand your meaning and just like my craft better than the others. \u003C/p\u003E\u003Cp\u003EB. They think my craft is suitable to be a stock craft to be included in the game.\u003C/p\u003E\u003Cp\u003EEither way I\u0027m very flattered. I think though it\u0027s probably best if I don\u0027t enter any more of these, what should be a fun competition has a bit of a nasty atmosphere when the \u0022wrong person\u0022 wins. Keep up the good work though, at the very least its a great forum for some really great ship design.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDon\u0027t take us wrong. I\u0027ve always loved your ships (and have given you lots of rep), but IMO, that lander isn\u0027t the best for a new player. Maybe for us \u0022veterans\u0022, but a newb will find it too complicated for a first-time mission.\u003C/p\u003E\u003Cp\u003EMost voters just said: \u0022Oh, bootiful ship\u0022, and voted for it, without taking in mind what I said above.\u003C/p\u003E\u003Cp\u003EYour lander is still my favorite KSP lander. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Commander Zoom","CreatedById":8333,"CreatedDateTime":"2013-09-11T02:22:31Z","Content":"\n\u003Cp\u003EHere, IMO, is the critical question which I\u0027m not sure has ever been asked:\u003C/p\u003E\u003Cp\u003EHas there been any assurance, or even \u003Cem\u003Eacknowledgement\u003C/em\u003E from the Devs, that the winning craft of this and any other competitions will actually be substituted/added in the game?\u003C/p\u003E\u003Cp\u003EThe OP seems to proceed from two assumptions: \u003C/p\u003E\u003Cp\u003E1. The stock craft are terrible, As Everyone Knows;\u003C/p\u003E\u003Cp\u003E2. SQUAD will accept the results of this and any other competitions as binding and implement them in future builds.\u003C/p\u003E\n"},{"CreatedByName":"MiniMatt","CreatedById":78749,"CreatedDateTime":"2013-09-11T07:14:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Commander Zoom\u0022 data-cite=\u0022Commander Zoom\u0022\u003E\u003Cdiv\u003EHere, IMO, is the critical question which I\u0027m not sure has ever been asked:\u003Cp\u003EHas there been any assurance, or even \u003Cem\u003Eacknowledgement\u003C/em\u003E from the Devs, that the winning craft of this and any other competitions will actually be substituted/added in the game?\u003C/p\u003E\u003Cp\u003EThe OP seems to proceed from two assumptions: \u003C/p\u003E\u003Cp\u003E1. The stock craft are terrible, As Everyone Knows;\u003C/p\u003E\u003Cp\u003E2. SQUAD will accept the results of this and any other competitions as binding and implement them in future builds.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo of course not. I say \u0022of course not\u0022 but I honestly don\u0027t believe for a second that either Xeldrak, any of the competitors, or any of the voters who discussed their thought process considered the results in any way official or binding.\u003C/p\u003E\u003Cp\u003EThe competition was purely one by the community for the enjoyment and benefit of the community. One could argue that the voting process was therefore unnecessary being, as it is, ultimately pointless, but a voting process provides for a logical thread flow and allows a thread to come to a clean close such that we can move on to other interesting things like \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/showthread.php/49328-BSC-(Better-Stock-Crafts)-Aeris-3a-Building-Phase\u0022 rel=\u0022external nofollow\u0022\u003EXeldrak\u0027s Aires-3a challenge\u003C/a\u003E. The true value I, and I believe other competitors and indeed observers, gained from the thread was not a vote count but the detailed discussion on designs, the learning of new tricks, general wonderment at the technical and artistic skills displayed.\u003C/p\u003E\u003Cp\u003EIt was an intellectual and artistic debate formed around a voting framework. The vote was there to structure the debate, not to bind developers to it\u0027s result. Besides, software development rarely benefits from pure democracy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EIF any devs stumbled across the thread then I\u0027ve no doubt they took on board many of the design challenges and ideas discussed and may or may not incorporate some of the concepts discussed when redesigning their stock craft for subsequent KSP versions. But, no, of course they won\u0027t be just lifting the vote winner or any of the entries straight into the next version of KSP. For one thing, the next version of KSP is likely to include new features that none of the entries have considered which will allow us to go through this process all over again for 0.22. And 0.23. And 0.24, etc. etc. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T07:20:08Z\u0022 title=\u002209/11/2013 07:20  AM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by MiniMatt\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-09-11T14:57:09Z","Content":"\n\u003Cp\u003EMiniMatt, the OP completely supports everything you wrote. \u003C/p\u003E\u003Cp\u003EActually, Commander Zoom, if you read what I wrote three posts before your post:\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xeldrak\u0022 data-cite=\u0022Xeldrak\u0022\u003E\u003Cdiv\u003E... it\u0027s a fun challenge and all there is to win is bragging rights, it\u0027s not like we are actually voting for new stock craft here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETo invoke a old, german proverb: \u0022He, who can read has a clear advantage.\u0022 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-09-11T15:04:27Z\u0022 title=\u002209/11/2013 03:04  PM\u0022 data-short=\u002210 yr\u0022\u003ESeptember 11, 2013\u003C/time\u003E by Xeldrak\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"AmpsterMan","CreatedById":32671,"CreatedDateTime":"2013-09-11T16:23:11Z","Content":"\n\u003Cp\u003EMy favorite things about these challenges have been seeing others designs. I wished others discussed the entries with greater depth and critique, but alas, that was a personal wish. \u003C/p\u003E\u003Cp\u003EAs far as the discussion on voting procedure, I think it was just a philosophical discussion, is all. \u003C/p\u003E\u003Cp\u003EI\u0027ll bee posting my latest plane in the new thread tonight. Can\u0027t wait to player other designs when the voting phase begins \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"John FX","CreatedById":59415,"CreatedDateTime":"2013-09-15T12:11:17Z","Content":"\n\u003Cp\u003EI\u0060m gutted I missed this one. I\u0060ve been working on a two stage lande fo a little while now. These things seem to happen between me looking at the forum and looking again! Is it me or have there been like, 3 of these challenges in the last few weeks? (or have I just been that busy?)\u003C/p\u003E\u003Cp\u003EWell, here is my lander, you may as well see it.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/IS4YG\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"}]}