{"TopicId":46541,"ForumId":25,"TopicTitle":"CLOSED -- Flying Duna AGAIN (Thanks for Participating)","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-25T21:21:12Z","PageNum":9,"Articles":[{"CreatedByName":"vosechu","CreatedById":106571,"CreatedDateTime":"2014-03-23T22:01:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EBack in August I posted this challenge and nobody said anything in the thread except me and Bothersome despite it getting over 1000 views. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EPeople love stories. I\u0027ve noticed that all of the most successful challenges not only have great rules, but have a compelling story backing them up. Many people play games to feel a sense of fulfillment, we can give that to them by giving them a story and a reason to do a particular thing!\u003C/p\u003E\u003Cp\u003EWhy would someone want to try to fly on Duna? It\u0027s obviously not the most optimal thing to do there, but maybe there\u0027s something that prevents us from using rockets. Perhaps there is some concern about a type of bird that lives there that is intolerant of liquid fuel? Or perhaps we\u0027ve recently found that ozone is building up and damaging what little atmosphere there is on Duna. Why do you think this is an interesting challenge? What type of knowledge do you hope to glean by seeing other people try your challenge?\u003C/p\u003E\u003Cp\u003ELastly, thank you for setting up the challenge. I know it takes a long time to build them and I believe the community is greatly strengthened by the challenges. I know that the Duna permanent outpost is the single reason I was so drawn in by KSP!\u003C/p\u003E\n"},{"CreatedByName":"Sensi","CreatedById":96840,"CreatedDateTime":"2014-03-24T01:55:12Z","Content":"\n\u003Cp\u003EFlying in what can barely be called an atmosphere makes for a fun challenge.\u003C/p\u003E\u003Cp\u003EI take it on with my Duna K-Plane, all stock except PWings and Kethane. 19 tons, 17 Kerbals, one kethane turbine and 4x Rockomax 24-77 to slow it down to landing speed. \u003C/p\u003E\u003Cp\u003EIt can fly up to 7400 m altitude before the KT flames out. Cruising at 7000 m is achieved with 5% thrust / AOA 20Ã‚Â° / 90 m/s. Its optimal flight speed is between 85 and 95 m/s. Max speed is around 380 m/s at low altitude. I\u0027ve flown it 1/4 of Duna\u0027s circumference with only 1/8 of the kethane gone. So it can circumnavigate without refueling.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/MMSnw\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EFly safe.\u003C/p\u003E\u003Cp\u003ESensi.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-03-24T04:52:22Z","Content":"\n\u003Cp\u003EWelcome to KSP! I\u0027m quite flattered that you chose my challenge as the venue for your 1st post.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022vosechu\u0022 data-cite=\u0022vosechu\u0022\u003E\u003Cdiv\u003EPeople love stories. I\u0027ve noticed that all of the most successful challenges not only have great rules, but have a compelling story backing them up. Many people play games to feel a sense of fulfillment, we can give that to them by giving them a story and a reason to do a particular thing!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI suck at thinking up stories or in fact having any original thoughts at all. At best, the Muses wink at me from across the ballroom while slow-dancing and ultimately going home with somebody else. Thus, I phrased this challenge in the practical terms you see. To truly own Duna, you have to be able to maneuver about the majority of its surface, which is the endless dune fields at 2000-4000m elevation. So, whether you want to visit all the anomalies in 1 mission from a central base, or have multiple colonies scattered about the planet that need linking with commuter flights, or imagine yourself harvesting sandworm spice out in the trackless desert, you have to be able to fly on Duna. Sure, you can get anywhere on Duna eventually with a rover, but that\u0027s boring and attracts sandworms \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. Suborbital rocketry is too expensive in fuel. That leaves aircraft as the only viable means of on-Duna transportation over long distances.\u003C/p\u003E\u003Cp\u003ESo basically, if you\u0027re just going to Duna 1 time to plant a flag, you have no need of aircraft there. But if you want to live there, you can\u0027t do without them. Thus, I view this challenge as mostly for those who have a practical need for long-term, long-range mobility on Duna. That\u0027s definitely a niche market. Inexperienced players are happy enough to plant a flag and leave. Experienced players are more interested in Laythe than boring, inhospitable Duna. But somewhere in between are those who feel that a real, planet-conquering colony on Duna is necessary prior to going further from home.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-03-24T05:03:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022DaMichel\u0022 data-cite=\u0022DaMichel\u0022\u003E\u003Cdiv\u003EAlready had made a fix for myself so the control surfaces would work properly. I hope DYJ will soon have time to look into it. \u003Cp\u003EAnyway, i edited the previous album to have the complete entry for this challenge. (\u003Ca href=\u0022http://imgur.com/a/hEEOj\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/hEEOj\u003C/a\u003E) \u003C/p\u003E\u003Cp\u003EI use a new plane - the K11 \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E - and a new launcher. The launch with this was really easy. Just needs a bit of fuel pumping around.\u003C/p\u003E\u003Cp\u003E* Two Kerbals\u003C/p\u003E\u003Cp\u003E* Intitial Landing was a bit too low altitude. Made a quicksave then took off and flew to a higher altitude just above 2500m.\u003C/p\u003E\u003Cp\u003E* Maximum altitude attained 8000m. Can easily cruise above 7000.\u003C/p\u003E\u003Cp\u003E* Can fly indefinitely on the day side due to beeing solar powered. (Which is strange because on Kerbin i run out of electricity at full power) Can also cuise high enough to get anywhere on Duna.\u003C/p\u003E\u003Cp\u003EThat should be:\u003C/p\u003E\u003Cp\u003E1 (Kerbals inside)\u002B2 (altitude)\u002B1 (FAR)\u003C/p\u003E\u003Cp\u003ENot that it would matter because the plane was not made to break any records.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry for the belated congrats but I\u0027ve been totally snowed under at work the last week or so. But congrats are definitely in order. You have joined the rather exclusive and eccentric club of those who not only think flying on Duna is worthwhile but have actually done it. So go put the patch in your sig even if you think it\u0027s ugly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\u003Cp\u003EI actually score this as \u002B5 because you can circumnavigate. And I believe you\u0027ve set a new altitude record for non-KSPI planes, too. Jolly good! You\u0027ve done much to advance Kerbal exoaeronautics.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-03-24T05:16:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sensi\u0022 data-cite=\u0022Sensi\u0022\u003E\u003Cdiv\u003EFlying in what can barely be called an atmosphere makes for a fun challenge.\u003Cp\u003EI take it on with my Duna K-Plane, all stock except PWings and Kethane. 19 tons, 17 Kerbals, one kethane turbine and 4x Rockomax 24-77 to slow it down to landing speed. \u003C/p\u003E\u003Cp\u003EIt can fly up to 7400 m altitude before the KT flames out. Cruising at 7000 m is achieved with 5% thrust / AOA 20Ã‚Â° / 90 m/s. Its optimal flight speed is between 85 and 95 m/s. Max speed is around 380 m/s at low altitude. I\u0027ve flown it 1/4 of Duna\u0027s circumference with only 1/8 of the kethane gone. So it can circumnavigate without refueling.\u003C/p\u003E\u003Cp\u003EFly safe.\u003C/p\u003E\u003Cp\u003ESensi.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat is a glorious achievement! Take your sig patch and wear it with pride \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E. \u003C/p\u003E\u003Cp\u003EMy only question is how much did the kethane drilling/refining stuff weigh? I count that as useful cargo because it can be used to refuel other things on Duna. I need that to know how many points to give you.\u003C/p\u003E\n"},{"CreatedByName":"DaMichel","CreatedById":93697,"CreatedDateTime":"2014-03-24T18:36:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003ESorry for the belated congrats but I\u0027ve been totally snowed under at work the last week or so. But congrats are definitely in order. You have joined the rather exclusive and eccentric club of those who not only think flying on Duna is worthwhile but have actually done it. So go put the patch in your sig even if you think it\u0027s ugly \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt is totally ugly but i will have it in my sig anyway. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E Thanks.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI actually score this as \u002B5 because you can circumnavigate. And I believe you\u0027ve set a new altitude record for non-KSPI planes, too. Jolly good! You\u0027ve done much to advance Kerbal exoaeronautics.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh nice. I haven\u0027t given circumnavigation much thought. Might become a problem if i get caught at sunset above high terrain from which i cannot take off any more \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think the challenge has sufficient motivation behind it. Not only is it cool, i also agree on the practical side. Duna/Mars is pretty rough terrain. By flying you can get much faster from A to B. Flying on Mars IRL would be cool. I\u0027m envisioning something like Curiosity but as a Quadrocopter UAV. It would make multiple trips to distant sites, bringing stuff back to a hypothetical return vehicle. Just flying over obstacles which rovers cannot overcome would certainly be nice. I remember seeing a documentary where a rover got stuck and they had trouble getting it out of the sand again.\u003C/p\u003E\n"},{"CreatedByName":"Sensi","CreatedById":96840,"CreatedDateTime":"2014-03-24T19:06:55Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EMy only question is how much did the kethane drilling/refining stuff weigh?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E1 converter \u002B 1 reactor \u002B 2 drilling units = 2.8 t\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-03-25T02:38:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sensi\u0022 data-cite=\u0022Sensi\u0022\u003E\u003Cdiv\u003E1 converter \u002B 1 reactor \u002B 2 drilling units = 2.8 t\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, I could only give you 2 points for the cargo because it goes by whole tons, but the .8 will be a tie-breaker if necessary. Anyway, that\u0027s a total of 20 points (15 Kerbals, 2000m extra altitude, 2 tons of cargo, and circumnavigation). That puts you in 1st place. Bravo! Now grab your ugly but lovingly crafted, totally hand-drawn patch \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-03-29T08:53:01Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003ESome of northstars designs have more research put into them than I put into my exams.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m glad you appreciate all the careful design. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EI swear he is going to find a way to fly the VAB to duna eventually.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou read my thoughts!\u003C/p\u003E\u003Cp\u003EActually, that was and is more or less my entire plan with my Duna colonization effort. Rather than deploying a bunch of vehicles which require regular support from Kerbin, and new launches any time I need new equipment, I am deploying the entire infrastructure to build a complex network of orbital fuel depots, orbital power transmitters, surface fuel refineries, rocket construction facilities, and even a landing strip on Duna... Essentially, I am deploying a mobile VAB, \u003Cstrong\u003Eand then some\u003C/strong\u003E (the VAB doesn\u0027t come with microwave power transmitters, does it?) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe only problem at the moment seems to be that I am experiencing difficulties with a mission-critical mod (Orbital Construction Re-Redux. The planes for this challenge weren\u0027t built with it of course.)\u003C/p\u003E\u003Cp\u003EMy 3 planes (the Blackhawk, the Eagle, and the Raven- though the last of those is still orbiting Minmus and not in interplanetary space yet) and 1 helicopter are still all en-route, by the way. The first ships of my Duna armada are already less than a week of game-time away from their destination. The only problem is I haven\u0027t been playing KSP very often lately (I\u0027ve actually spent more time on the forums than in the game), so a week has already dragged out to over a month and a half...\u003C/p\u003E\u003Cp\u003EThe first ship of my Duna armada (not one of the planes for this challenge, but the first two won\u0027t be far behind) makes its SOI transition in just over 4 days. Let\u0027s see if I can\u0027t at least keep up with game-time in real life...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-29T12:48:36Z\u0022 title=\u002203/29/2014 12:48  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 29, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-03-29T10:32:38Z","Content":"\n\u003Cp\u003EOK, so you guys remember the Raven Mk2?\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IT1DQO3.png\u0022 alt=\u0022IT1DQO3.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EWell, it made its refueling stop with the Minmus Spacedock... (which just finished its transfer from Munar orbit)\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/JuzqT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EBut I\u0027m having some trouble plotting a Duna intercept with only the available fuel...\u003C/p\u003E\u003Cp\u003EYou see, the Raven Mk2 has 1125 m/s Delta-V onboard, and Duna is here:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/cLMrgy6.png\u0022 alt=\u0022cLMrgy6.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI was able to plot plenty of intercepts using two-part burns that dived low to Kerbin and then made a 2nd burn there to reach Duna\u0027s orbit- so the Raven Mk2 does hold enough fuel. The only problem is they hit about where Duna would be if it was at an ideal transfer window, and it\u0027s nowhere near one...\u003C/p\u003E\u003Cp\u003ESince I\u0027m doing all this in my Career Mode game, fast-forwarding to the next transfer window and sacrificing all my other missions is NOT an option (some ships of my Duna armada will literally crash into the surface of the planet even when unloaded their trajectories are so precise. Others will fly off lost into deep space).\u003C/p\u003E\u003Cp\u003ESo instead, I\u0027m going to to attempt the horrifically complex- I\u0027m going to perform an IN-FLIGHT refueling of the Raven Mk2 *AFTER* it escapes the Kerbin system and is on its way in the general direction of Duna. To do this, I\u0027ll place another much larger (preferably with enough fuel to both refuel the Raven Mk2 and still make Duna itself) ship parked in a slightly different orbit around Minmus, and will have it burn against the Raven Mk2\u0027s relative velocity immediately after the Raven Mk2 makes its burn to escape the Kerbin system. Of course, this will mean waiting even later to make the transfer burn, as I will need to get this second ship in position...\u003C/p\u003E\u003Cp\u003EI hope this doesn\u0027t count against SSTDABK capability. As I said, attempts at course plotting showed the Raven Mk2 definitely has enough fuel (and then some) to make Duna on an ideal transfer window- it just can\u0027t do it on its own with Duna in such a lousy position... (many players would struggle to make this transfer with a craft of ANY size- it\u0027s not exactly an easy transfer to plot...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-29T12:40:18Z\u0022 title=\u002203/29/2014 12:40  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 29, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-03-30T00:59:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EI hope this doesn\u0027t count against SSTDABK capability. As I said, attempts at course plotting showed the Raven Mk2 definitely has enough fuel (and then some) to make Duna on an ideal transfer window- it just can\u0027t do it on its own with Duna in such a lousy position... (many players would struggle to make this transfer with a craft of ANY size- it\u0027s not exactly an easy transfer to plot...)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m afraid it would count against SSTDABK. You are, in effect, giving it another booster it didn\u0027t have to start with. That being the case, why not just dock a transfer tug to it before it leaves? Or just keep waiting for the proper window. As with all other aspects of this challenge, you actually have to do SSTDABK, you can\u0027t go by calculations.\u003C/p\u003E\u003Cp\u003EYou do, of course, always have the option of starting a new game, copying your Raven to it, and flying just this challenge in that game, using however much fast-forward you need for the proper window without worrying about any other missions in progress.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-03-30T04:15:39Z","Content":"\n\u003Cp\u003EMy transfer of the Raven Mk2 and a fuel tanker for in-flight refueling is going smoothly. Here are some pics on the progress so far (the Kerbin-dive before the main transfer burns to Duna).\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/JYnwk\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027d lump the whole thing into one post, but I\u0027ve got an unrelated rescue mission going on simultaneously that would probably confuse my attempts to keep all the pictures organized for posting...\u003C/p\u003E\u003Cp\u003EI\u0027ll keep you guys posted as things progress on the Raven\u0027s voyage.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-03-30T04:27:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003EI\u0027m afraid it would count against SSTDABK. You are, in effect, giving it another booster it didn\u0027t have to start with. That being the case, why not just dock a transfer tug to it before it leaves? Or just keep waiting for the proper window. As with all other aspects of this challenge, you actually have to do SSTDABK, you can\u0027t go by calculations.\u003Cp\u003EYou do, of course, always have the option of starting a new game, copying your Raven to it, and flying just this challenge in that game, using however much fast-forward you need for the proper window without worrying about any other missions in progress.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s refueling in (transfer) orbit, not using any of the thrust from the tanker. It\u0027s reaching Duna entirely under its own thrust, with no staging, hence \u0022Single Stage to Duna\u0022. And the tanker isn\u0027t disposable either- it will be continuing on to Duna separately as well, to provide additional fuel for the colonists. I could just as easily have set up a couple refueling depots in deep space between Kerbin and Duna, or have fast-forwarded to a good transfer window with the Raven in Minmus orbit if I didn\u0027t have other missions going on. So I would ask you to reconsider that judgment.\u003C/p\u003E\u003Cp\u003EUnfortunately, simply copying the craft alone wouldn\u0027t be a viable option- as it required a refueling in both low Kerbin orbit and Minmus orbit (and would even with a proper transfer window). I simply don\u0027t have the real-life time to design and launch the additional fuel tankers or fuel depots in a separate save, as well as re-perform the ascent to orbit and transfer\u002Bcapture to Minmus in a separate save that would be required to have a good transfer window. If I was going to do it in a separate save, I\u0027d need to have copied the entire save file BEFORE I left Minmus (the save file is now both updated and quicksaved past that point) and terminated all the other flights... This is about roleplaying (not waiting a year for another transfer window, or leaving the Kerbals in orbit for 20 years), not the craft\u0027s capabilities.\u003C/p\u003E\u003Cp\u003EI\u0027m already playing by a lot of rules others aren\u0027t- like working in my Career save game and only utilizing pre-fusion technology, so cut me a little slack OK? I can easily demonstrate that the orbit reaches an apoapsis past Duna with fuel to spare for an aerocapture before performing the in-flight refueling. In fact, even now I could just leave it in that orbit and eventually (after several years or decades orbiting the sun) it would get a Duna intercept without additional refueling as Duna phases into position...\u003C/p\u003E\u003Cp\u003EThe hard part of SSTDABK is escaping Kerbin\u0027s gravity with a ship that can fly on Duna- not getting to Duna. Any ship that can make Kerbin orbit can reach Duna with proper refueling (and I\u0027m not talking about the in-flight kind) on a good transfer window. Even one that utilized jet engines as part of its Kerbin ascent, like this one- the Delta-V required to push out of the atmosphere and circularize is much greater than that to reach Duna (on a good transfer window) from the Mun or Minmus.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-30T05:43:26Z\u0022 title=\u002203/30/2014 05:43  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 30, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"plausse","CreatedById":64331,"CreatedDateTime":"2014-03-31T23:04:26Z","Content":"\n\u003Cp\u003EIf I say I have a candidate for this challenge that scores the following.. \u002B1 for each Kerbal carried above the minimum of 2. (1), \u002B1 for all Kerbals being inside instead of outside in lawn chairs., \u002B1 for each ton of non-Kerbal cargo (1), \u002B1 for every 1000m above 5000m (1), \u002B1 for using FAR, \u002B1 for being able to circumnavigate Duna without refueling (if its ok to land now and then and soak up some sun.. otherwise 0).. -\u0026gt; giving 6 or 7.\u003C/p\u003E\u003Cp\u003ENow the main thing is.. It looks like a junkers ju 52 (but with two engines only unfortunately), its got variable geometry (very variable) wings to accomodate both reentry and low speed Duna cruising, it launches like the space shuttle.. And stall speed with flaps for landing (on Duna) is about 50 m/s. \u003C/p\u003E\u003Cp\u003ENow Im proud of this one.. but I havent yet an Imgur account.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-02T11:53:22Z","Content":"\n\u003Cp\u003EGeschosskopf, I\u0027m afraid the 0.23.5 save has broken a couple of my mods (in particular, MechJeb2) well enough that I\u0027m going to give them some time to update before I attempt to recontinue the save that the Raven Mk2, Blackhawk Mk6, Eagle Mk2, and HORNET helicopter are all in- so it\u0027ll be at least several days and probably several weeks before you hear anything more about any of the missions (I\u0027m taking a break from KSP for a little while).\u003C/p\u003E\u003Cp\u003EBut, rest assured, getting the Raven Mk2 on its Duna intercept (preferably as previously described- first on an intercept with Duna\u0027s orbital rail on its own fuel, and then after an in-flight refueling, an adjustment to compensate for Duna\u0027s greatly suboptimal position), and finally bringing the other aircraft into Duna\u0027s orbit when they arrive and then down into the atmosphere to finally complete the challenge are all on the chopping block for me.\u003C/p\u003E\u003Cp\u003EI would still prefer, as described before, if you\u0027d reconsider the Raven\u0027s SSTDABK capability- as the capability is clearly evident from its 1140\u002B m/s Delta-V capacity in vacuum (more than enough to make Duna from Minmus orbit on a good transfer window) as well as its ability to intercept the rail (but not the planet itself, in a straight transfer) from its current position.\u003C/p\u003E\u003Cp\u003ESeeing how many bugs the version updates have introduced to my now ancient save, at some point after I set up a sustainable Duna colony I am going to wipe the save and start from scratch anyways. So, I\u0027ve decided I am willing to do the roleplaying unthinkable- if you won\u0027t give the Raven Mk2 credit for SSTDABK capability with an in-transfer refueling, I\u0027ll leave the Raven Mk2 in the Duna rail-intercepting solar orbit the Raven Mk2 can achiever without refueling, for however long it takes for Duna to phase into position and intercept it (it could be YEARS of game-universe time), aerocapture, and get the credit anyways.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe only thing you will thus have accomplished is annoying me greatly, as I have to sit for potentially a half-hour, an hour, or possibly even several hours at time-warp (after my other flights are stabilized) doing nothing but looking for when it finally gets an intercept...\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-02T11:56:45Z\u0022 title=\u002204/02/2014 11:56  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 2, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-05T02:47:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022plausse\u0022 data-cite=\u0022plausse\u0022\u003E\u003Cdiv\u003EIf I say I have a candidate for this challenge that scores the following.. \u002B1 for each Kerbal carried above the minimum of 2. (1), \u002B1 for all Kerbals being inside instead of outside in lawn chairs., \u002B1 for each ton of non-Kerbal cargo (1), \u002B1 for every 1000m above 5000m (1), \u002B1 for using FAR, \u002B1 for being able to circumnavigate Duna without refueling (if its ok to land now and then and soak up some sun.. otherwise 0).. -\u0026gt; giving 6 or 7.\u003Cp\u003ENow the main thing is.. It looks like a junkers ju 52 (but with two engines only unfortunately), its got variable geometry (very variable) wings to accomodate both reentry and low speed Duna cruising, it launches like the space shuttle.. And stall speed with flaps for landing (on Duna) is about 50 m/s. \u003C/p\u003E\u003Cp\u003ENow Im proud of this one.. but I havent yet an Imgur account.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESo get an Imgur account. Or Flickr, or something. Ich liebe die Tante Ju, so show us some pics.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-05T02:53:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EGeschosskopf, I\u0027m afraid the 0.23.5 save has broken a couple of my mods (in particular, MechJeb2) well enough that I\u0027m going to give them some time to update before I attempt to recontinue the save that the Raven Mk2, Blackhawk Mk6, Eagle Mk2, and HORNET helicopter are all in- so it\u0027ll be at least several days and probably several weeks before you hear anything more about any of the missions (I\u0027m taking a break from KSP for a little while).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhich is why you should always copy your entire game install to a new folder, along with all applicable mods. That way, you can keep on playing your game as it was before the base game update. And then ease those saves back into your updated install as mod updates make that possible.\u003C/p\u003E\u003Cp\u003EI have seen 2 versions of the Kethane Travelling Circus go down in flames for failure to realize this simple prophylactic measure. I have vowed never again to let that happen.. So now I have 2 installs of the game, 0.23 and 0.23.5. For the time being, never the twain shall meet.\u003C/p\u003E\n"},{"CreatedByName":"1D-1()T","CreatedById":75340,"CreatedDateTime":"2014-04-05T11:16:01Z","Content":"\n\u003Cp\u003EI think I\u0027m gonna have to give this challenge another try. Looking at the other designs it looks like I\u0027m gonna have to step up my game. Oh god, what have I got myself into? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue2.gif\u0022 alt=\u0022:sticktongue:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"1D-1()T","CreatedById":75340,"CreatedDateTime":"2014-04-06T05:41:25Z","Content":"\n\u003Cp\u003EOk, here\u0027s a sneak peak of what I\u0027m working on\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/pS20j3C.png\u0022 alt=\u0022pS20j3C.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt\u0027s early days, but it\u0027s looking promising. It\u0027s VTOL, 150 m/s cruising speed, and is a heck of a lot of fun to fly. But it is rather thirsty, so I\u0027m not quite sure how many solar panels to add. I guess I\u0027ll find out soon...\u003C/p\u003E\u003Cp\u003EUpdate: It\u0027s me again! I sent my craft to Duna with magic to see if it would work, and it did. It performs at about the level of my previous plane, but with VTOL. I\u0027m in the process of beefing it up a bit, and I\u0027ll then be ready to send it for real!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-06T10:07:29Z\u0022 title=\u002204/06/2014 10:07  AM\u0022 data-short=\u002210 yr\u0022\u003EApril 6, 2014\u003C/time\u003E by 1D-1()T\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-06T12:52:20Z","Content":"\n\u003Cp\u003ENice looking plane. What are the yellow things on the wings?\u003C/p\u003E\n"},{"CreatedByName":"1D-1()T","CreatedById":75340,"CreatedDateTime":"2014-04-06T22:11:32Z","Content":"\n\u003Cp\u003EHelicopter rotors! For the VTOL. It can take off with them on Duna, but I\u0027m not sure what their maximum height is. But they make it more interesting.\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-06T23:20:18Z","Content":"\n\u003Cp\u003EDefinitely more interesting. Good luck with it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"1D-1()T","CreatedById":75340,"CreatedDateTime":"2014-04-06T23:55:31Z","Content":"\n\u003Cp\u003EPlease note, this is not an actual entry, as it doesn\u0027t meet all the challenge requirements (namely, it landed below 2500 m and was only carrying one kerbal)\u003C/p\u003E\u003Cp\u003ESo, here\u0027s my VTOL Duna Plane.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/pDGnm\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EOnce again, I\u0027m going to beef it up and send another. Hopefully the next one will meet the requirements. But, I still had a lot of fun making that plane.\u003C/p\u003E\n"},{"CreatedByName":"1D-1()T","CreatedById":75340,"CreatedDateTime":"2014-04-07T08:38:17Z","Content":"\n\u003Cp\u003EIt\u0027s me again! And this time I have an entry. It carries 13 kerbals, cruises at around 7200 metres, can briefly reach heights of about 7700 metres, and can take off and land vertically, as well as fly forwards, backwards, side to side, or just hover. It can do this indefinitely, as it recharges faster than it uses electricity.\u003C/p\u003E\u003Cp\u003EI think it got 15 points (\u002B 11 points for carrying thirteen kerbals, \u002B2 for cruising at 7000 metres, \u002B1 for circumnavigation capable, and \u002B1 for FAR)\u003C/p\u003E\u003Cp\u003EAnd now for the fun bit, the pictures!\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/vxDTs\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EBy the way, as it can hover, fly sideways etc., I\u0027ve decided to call it the Hummingbird (Now the Lobachevsky). Also, the craft in my original entry, back around the start of this thread, shall be known as the Albatross, because of its landing style, and in honour of the long distances it flew.\u003C/p\u003E\u003Cp\u003EEdit: I noticed I didn\u0027t actually mention what I changed. I moved up the original wing, and put another beneath it, and covered the second wing with lawn chairs. The extra wings both gave it more lift, and helped keep the plane point in the direction of travel, which gave it more speed.\u003C/p\u003E\u003Cp\u003EEdit 2: Having found that Northstar already used the name Hummingbird I have re-dubbed it the Lobachevsky.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-15T06:20:15Z\u0022 title=\u002205/15/2014 06:20  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 15, 2014\u003C/time\u003E by 1D-1()T\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2014-04-10T22:53:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00221D-1()T\u0022 data-cite=\u00221D-1()T\u0022\u003E\u003Cdiv\u003EIt\u0027s me again! And this time I have an entry. It carries 13 kerbals, cruises at around 7200 metres, can briefly reach heights of about 7700 metres, and can take off and land vertically, as well as fly forwards, backwards, side to side, or just hover. It can do this indefinitely, as it recharges faster than it uses electricity.\u003Cp\u003EI think it got 15 points (\u002B 11 points for carrying thirteen kerbals, \u002B2 for cruising at 7000 metres, \u002B1 for circumnavigation capable, and \u002B1 for FAR)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBravo! An excellent machine! Congrats on doing better than you did before. I\u0027ll go update the standings.\u003C/p\u003E\u003Cp\u003EAnd sorry to be a bit lagged here. I\u0027ve been extremely busy.\u003C/p\u003E\n"}]}