{"TopicId":46541,"ForumId":25,"TopicTitle":"CLOSED -- Flying Duna AGAIN (Thanks for Participating)","CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-09-25T21:21:12Z","PageNum":5,"Articles":[{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-23T23:02:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EWhat are the rules for adding extra KAS ports for attachment of a specialized skycrane descent craft from orbit? The ports would be coming off again before any actual flying around would occur if I did this- so I wouldn\u0027t be \u0022adding to or subtracting from what will actually fly around on Duna\u0022. Skycraning also clearly falls under what is explicitly allowed under the rule after that- though it doesn\u0027t mention adding or removing temporary connector ports for skycraning.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problem. Even leave the ports on if you want, to refuel the thing. The rule exists to prevent folks from making 1-shot planes. The goal here is to make a plane that can stay on Duna flying back and forth forever, just refueling as needed, without 1-use parts once it\u0027s on the ground.\u003C/p\u003E\u003Cp\u003EBut as to getting the plane to the surface, what always works for me is to just fly it down starting just above the atmosphere. I use the last fuel in the transfer stage for a deorbit burn, jettison the stage, and from there on it\u0027s just like landing a spaceplane. Eventually it gets low enough that the wings and control surfaces start to work, after which I can fly it like an airplane and land it where I want to. MUCH simpler and safer IMHO than skycranes.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-23T23:21:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Geschosskopf\u0022 data-cite=\u0022Geschosskopf\u0022\u003E\u003Cdiv\u003ENo problem. Even leave the ports on if you want, to refuel the thing. The rule exists to prevent folks from making 1-shot planes. The goal here is to make a plane that can stay on Duna flying back and forth forever, just refueling as needed, without 1-use parts once it\u0027s on the ground.\u003Cp\u003EBut as to getting the plane to the surface, what always works for me is to just fly it down starting just above the atmosphere. I use the last fuel in the transfer stage for a deorbit burn, jettison the stage, and from there on it\u0027s just like landing a spaceplane. Eventually it gets low enough that the wings and control surfaces start to work, after which I can fly it like an airplane and land it where I want to. MUCH simpler and safer IMHO than skycranes.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe problems with that approach are:\u003C/p\u003E\u003Cp\u003E(1) I have tons of fuel left in the transfer stage. So I\u0027d be throwing a lot away doing that (although, I believe I put a probe core on the transfer stage- so maybe I\u0027d be able to re-stabilize the orbit remotely after detachment: I\u0027ll have to check)\u003C/p\u003E\u003Cp\u003E(2) I have no experience in safely re-entering spaceplanes in an atmosphere that thin (over 2500 meters on Duna). Generally, on Kerbin, my spaceplanes tend to either (a) enter a tailspin that I don\u0027t completely pull out of until low altitude because I try to keep the nose too close to the horizon (instead of pointing into the dive), or (\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E enter into a dive that I can\u0027t pull them out of until low altitude.\u003C/p\u003E\u003Cp\u003EEither way, the problem is I don\u0027t think I\u0027d be able to pull the Eagle out of its re-entry dive before it hit a mountain (some are over 5000 meters tall) or the ground at that altitude (over 2500 meters). That was why I wanted to land at my sea-level landing site first, and THEN, after quicksaving (which can\u0027t be done while in atmospheric flight), takeoff again and land at 2500 meters. The intention was never to leave the plane at 2500 meters- but rather to simply make its initial landing there where the atmosphere is thicker. This is why I took issue with your restriction of the initial landing being at over 2500 meters. No real space program would take excessive risks at making an initial high-altitude landing if they were worried about a spaceplane\u0027s ability to pull out of its re-entry dive on time.\u003C/p\u003E\u003Cp\u003EI could, of course, just re-enter targeted at the low-altitude site I picked out, and not actually land (just perform a flyby). I should be able to pull out of the dive on time that way, and then go and make my initial touchdown at over 2500 meters... That would waste my time, and risk my having to revert to a pre-reentry quicksave if I botched the landing (you said to expect a couple failed attempts before a successful landing)- but since you insist on my making the first touchdown at over 2500 meters, technically that would meet the requirements (even if my altitude would probably dip below 2500 meters while in-flight)...\u003C/p\u003E\u003Cp\u003EAll that is, of course, if I can\u0027t get a good skycrane design working (KAS attachments have a nasty tendency to spin and wobble wildly when thrust is applied- which is why I would need to use at least 2 attachments, probably 4 to 6- and on top of that I\u0027m also concerned about a skycrane\u0027s thrust damaging the Eagle\u0027s wings...)\u003C/p\u003E\u003Cp\u003EFinally, I should note, I plan to build my main base at the sea-level site I picked out. This is mainly because I need a large enough flat space to build a runway (for my heavier plane designs- which will most likely be built on Duna itself- the Eagle is only going to be my first-generation Duna plane), and also because it\u0027s safer to try and land planes (especially some of the strategic heavy-lifters I plan to build) at that altitude... Finally, there\u0027s also the fact that I can drop heavier cargo-loads for my colony with fewer parachutes if I build at that altitude. My Kethane fields will probably mostly be at higher altitude, however (the solar panels that will power them will work better with less atmosphere overhead- plus, low-altitude Kethane will probably be a rare find). So whether it\u0027s my initial landing, or a later rendezvous with my first landers and cargo-drops, the Eagle *WILL* be landing at that site at some point...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-24T00:21:22Z\u0022 title=\u002211/24/2013 12:21  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 24, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"1D-1()T","CreatedById":75340,"CreatedDateTime":"2013-11-25T05:07:10Z","Content":"\n\u003Cp\u003EOkay, so, @ Geschosskopf\u003C/p\u003E\u003Cp\u003EI know in the rules it says you can\u0027t add or subtract from the plane, but the way I see it this is so you don\u0027t just get some SRBs and a couple of wings and that kind of thing. Now, for my new attempt I\u0027m going to increase the Duna Plane Mk4\u0027s (original name, I know) passenger capacity, but I don\u0027t really want to send a new one out. Do you mind if I send out some seats and (A)ttach them with the KAS thing?\u003C/p\u003E\u003Cp\u003EThe way I see it is that at my eventual bases they will keep a seat for each kerbal, which can be attached to the plane as needed in case of emergency relocation.\u003C/p\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-25T09:47:55Z","Content":"\n\u003Cp\u003ELooked like a fun challenge, and I had never built a duna plane before, so I did! \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/b7VmxJv.jpg\u0022 alt=\u0022b7VmxJv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIts called \u0027Mupyiba\u0027, or \u0027massive nuclear powered flying wing with a bunch of lawnchairs strapped to it\u0027\u003C/p\u003E\u003Cp\u003EIts powered by a single fission reactor from near future, which gives it unlimited flying time and 240 e/s to work with. That powers 6 small electric propellers plus one larger one, giving it decent thrust even on duna. The rest of the plane is just lifting surface.\u003C/p\u003E\u003Cp\u003EGetting this to duna, howerver, was interesting. I originally had all these ideas for assembling it in space, or making it fold up using infernal robotics. Instead, I just strapped a bunch of mainsails to it and blasted it into orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0DIbvqn.jpg\u0022 alt=\u00220DIbvqn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis worked surprisingly well, and ended up in orbit with quite a bit of fuel left in those tanks. Next launch was the crew transport vehicle, with an equally silly ring of boosters. TWR of like 4. The idea was that moving 20 kerbals is way easier in microgravity than, well, I actually dont know how else I would have done it. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KWMmz41.jpg\u0022 alt=\u0022KWMmz41.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow, I had planned for a third launch to send up a transfer stage with NERVAs to get it out to duna, but I ended up with enough fuel from these to launches that I just jettisoned two of the boosters, and used the fuel from the crew transporter to get it to duna. Luckily mainsails have enough thrust vectoring to deal with the offset mass. Other than that, it was a typical transfer to duna. \u003C/p\u003E\u003Cp\u003ENow, landing on duna wasnt so bad. I just skimmed over the atmosphere until I made a landing moving at about 120 meters/sec. It took a few tries before I found a flat enough location, but I did at 4000 meters elevation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xZoL5Hh.jpg\u0022 alt=\u0022xZoL5Hh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETaking off again was a bit more difficult, and eventually I had to leave 6 kerbals behind. Those little guys weigh wayyy more than I realized. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/P2gdK38.jpg\u0022 alt=\u0022P2gdK38.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a few uh, simulated takeoffs, I got it into the air with 10\u002B1 kerbals, and once I get in the air, I can stay there indefinitely. Without any kerbals on board, I could fly at over 8000 meters, but with all 10, I could only maintain 7000.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7JP1Dvp.jpg\u0022 alt=\u00227JP1Dvp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese guys are enjoying the view, and wondering what voodoo is keeping this thing in the air when the sensor reads \u0027VACUUM\u0027.\u003C/p\u003E\u003Cp\u003ESo, lemme try to add this up. 1 for using FAR, 1 for circumnavigation, 2 for 2000 over 5000, and \u002B9 for my 11 kerbals. I think thats everything. \u003C/p\u003E\u003Cp\u003EI may go back and make a larger one with 2 nukes and 14 engines, and see how many kerbals I can fit on it. This one can hold 19, but taking off was almost impossible and I couldnt maintain anything over 5000 altitude. I agree that the fission reactors are very powerful, but they are also very heavy. That one reactor is more that half the mass of the entire structure. More importantly, I could get the same performance out of lots of solar panels mass per e/s wise, but the lag on them would kill me.\u003C/p\u003E\u003Cp\u003EYou can see the rest of the pictures here- \u003Ca href=\u0022http://imgur.com/a/LVSoR\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/LVSoR\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA few shots of the orbital stuff, some explosions, and thats about it.\u003C/p\u003E\u003Cp\u003EThis is the first challenge that I have tried to do so far, and it was great fun, thanks!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-25T10:34:43Z\u0022 title=\u002211/25/2013 10:34  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 25, 2013\u003C/time\u003E by StevenRS11\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-11-25T10:41:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EGetting this to duna, howerver, was interesting. I originally had all these ideas for assembling it in space, or making it fold up using infernal robotics. Instead, I just strapped a bunch of mainsails to it and blasted it into orbit. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour plane lift force, do not turn your mainsails rockets??? I wonder....\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T10:44:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003ELooked like a fun challenge, and I had never built a duna plane before, so I did! \u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/b7VmxJv.jpg\u0022 alt=\u0022b7VmxJv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIts called \u0027Mupyiba\u0027, or \u0027massive nuclear powered flying wing with a bunch of lawnchairs strapped to it\u0027\u003C/p\u003E\u003Cp\u003EIts powered by a single fission reactor from near future, which gives it unlimited flying time and 240 e/s to work with. That powers 6 small electric propellers plus one larger one, giving it decent thrust even on duna. The rest of the plane is just lifting surface.\u003C/p\u003E\u003Cp\u003EGetting this to duna, howerver, was interesting. I originally had all these ideas for assembling it in space, or making it fold up using infernal robotics. Instead, I just strapped a bunch of mainsails to it and blasted it into orbit. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/0DIbvqn.jpg\u0022 alt=\u00220DIbvqn.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThis worked surprisingly well, and ended up in orbit with quite a bit of fuel left in those tanks. Next launch was the crew transport vehicle, with an equally silly ring of boosters. TWR of like 4. The idea was that moving 20 kerbals is way easier in microgravity than, well, I actually dont know how else I would have done it. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/KWMmz41.jpg\u0022 alt=\u0022KWMmz41.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ENow, I had planned for a third launch to send up a transfer stage with NERVAs to get it out to duna, but I ended up with enough fuel from these to launches that I just jettisoned two of the boosters, and used the fuel from the crew transporter to get it to duna. Luckily mainsails have enough thrust vectoring to deal with the offset mass. Other than that, it was a typical transfer to duna. \u003C/p\u003E\u003Cp\u003ENow, landing on duna wasnt so bad. I just skimmed over the atmosphere until I made a landing moving at about 120 meters/sec. It took a few tries before I found a flat enough location, but I did at 4000 meters elevation.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xZoL5Hh.jpg\u0022 alt=\u0022xZoL5Hh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ETaking off again was a bit more difficult, and eventually I had to leave 6 kerbals behind. Those little guys weigh wayyy more than I realized. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/P2gdK38.jpg\u0022 alt=\u0022P2gdK38.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAfter a few uh, simulated takeoffs, I got it into the air with 10\u002B1 kerbals, and once I get in the air, I can stay there indefinitely. Without any kerbals on board, I could fly at over 8000 meters, but with all 10, I could only maintain 7000.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7JP1Dvp.jpg\u0022 alt=\u00227JP1Dvp.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThese guys are enjoying the view, and wondering what voodoo is keeping this thing in the air when the sensor reads \u0027VACUUM\u0027.\u003C/p\u003E\u003Cp\u003ESo, lemme try to add this up. 1 for using FAR, 1 for circumnavigation, 2 for 2000 over 5000, and \u002B9 for my 11 kerbals. I think thats everything. \u003C/p\u003E\u003Cp\u003EI may go back and make a larger one with 2 nukes and 14 engines, and see how many kerbals I can fit on it. This one can hold 19, but taking off was almost impossible and I couldnt maintain anything over 5000 altitude. I agree that the fission reactors are very powerful, but they are also very heavy. That one reactor is more that half the mass of the entire structure. More importantly, I could get the same performance out of lots of solar panels mass per e/s wise, but the lag on them would kill me.\u003C/p\u003E\u003Cp\u003EYou can see the rest of the pictures here- \u003Ca href=\u0022http://imgur.com/a/LVSoR\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/LVSoR\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EA few shots of the orbital stuff, some explosions, and thats about it.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s a NICE ship- though it makes me sad that you\u0027ve probably permanently taken the first-place slot I was vying for permanently out of my reach...\u003C/p\u003E\u003Cp\u003EI realized a long time ago that in challenges like this where you get a point per-Kerbal, you can usually get a lot more points with a bunch of lawnchairs than with enclosed cabins- but discovered (when building a 72-Kerbal Kerbin-Circumnavigating airliner for the Airliner Challenge) that my game absolutely FREAKS when I have so many Kerbals outside (in lawnchairs) at once- and basically dies of lag (it seems to work FINE if the same number are safely indoors, however- especially if they\u0027re in cabin types from mods that don\u0027t show a face pop-up in the corner). Since Duna is all about TWR and wingload- there\u0027s no WAY I could build a 20-Kerbal plane with all the Kerbals inside... (at least, not with the part-count limits my weak computer imposes)\u003C/p\u003E\u003Cp\u003EAnyways, congrats on the challenge!\u003C/p\u003E\u003Cp\u003EI probably shouldn\u0027t be pointing this out to you, considering we\u0027re sort of in competition (though, as I pointed out, I basically no chance at beating you unless a brand new computer showed up on my doorstep tomorrow), but if you use KSP Interstellar mod, you can get at least 1152 EC/second with just one of the upgraded .625 meter nuclear reactors and a un-upgraded .625 meter generator (2880 EC/s if noth are upgraded). If you use TAC Fuel Balancer to reduce the UF6 loadout to a more reasonable level than the default 100% (or just transfer some of the UF6 to another ship that\u0027s been running a reactor a few months and used up enough of its supply if you don\u0027t use TAC...), it\u0027ll also weigh a lot less than a Near-Future reactor too... The cost of this is higher part-count, and the need for a separate radiator part somewhere in the design (which, once again, doesn\u0027t add much weight if it\u0027s upgraded).\u003C/p\u003E\u003Cp\u003EYou can upgrade KSP Interstellar parts one of two ways- with a Science Lab in Sandbox Mode, or by working to discover the appropriate extended tech tree node in Career Mode (trust me, some of the mod\u0027s extra nodes aren\u0027t cheap- I *STILL* haven\u0027t discovered several of the mod\u0027s most advanced tech nodes, and I\u0027ve almost filled out the whole stock part of the tech tree at this point...)\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T10:49:45Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirine\u0022 data-cite=\u0022Sirine\u0022\u003E\u003Cdiv\u003EYour plane lift force, do not turn your mainsails rockets??? I wonder....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA sufficiently big rocket will basically ignore a small plane like that Sirine.\u003C/p\u003E\u003Cp\u003EThat whole thing has about three-quarters to two-thirds the lift of one of my Eagle Mk2\u0027s (it\u0027s a heavier design thanks to its internal cockpits and twin nuclear reactors- though probably capable of much higher altitudes on Duna thanks to its much more powerful thermal turbojet propulsion system), and I strapped TWO of them to a 5-meter rocket (about the same power as the four 2.5 meter stacks he used there) and it just shrugged them off like it was nothing...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T10:58:08Z","Content":"\n\u003Cp\u003EMind if I ask, though, Steven- what are those narrow tubes behind the electric propellers? They seem to make nice wing engine-mounts- but I\u0027ve never seen a part that looked quite like that in the editor, and I\u0027m running a lot of mods (including Firespitter, B9 Aerospace, and Novapunch2). So, I\u0027m guessing its either from a mod I don\u0027t have, or it\u0027s a part I somehow missed when designing my planes... I\u0027ve had a lot of trouble finding good engine-mount parts for my front-mounted propellers...\u003C/p\u003E\u003Cp\u003E(A note- if you reverse the directionality before takeoff using Action Groups, you should be able to actually turn electric \u0022puller\u0022 propellers into \u0022pusher\u0022 propellers- though I\u0027ve never actually done this- or use front-mounted ones to slow down before landing...)\u003C/p\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-25T11:24:35Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sirine\u0022 data-cite=\u0022Sirine\u0022\u003E\u003Cdiv\u003EYour plane lift force, do not turn your mainsails rockets??? I wonder....\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThere was a little pulling, yes. I had to trim it pretty hard, and I didn\u0027t really have any control over my inclination, either. I just pointed it up and only bothered controlling it once it was out of the atmosphere. It made for a nice gravity turn incidentally, if not awkwardly skewed against the planets rotation and almost polar. \u003C/p\u003E\u003Cp\u003EAnd yea, I noticed what you said about the kerbals lagging it really badly. Im ticking orange with a really low part count flyer, its only like 40 parts. Any more kerbals (more than 20) and it would be unplayable for me.\u003C/p\u003E\u003Cp\u003EI\u0027ve used interstellar before, and I remember those reactors, but this computer (at home from college) cant quite deal with the parts. I had to edit lots of parts out of my reduced modpack to just run it on this computer. Its really old, with only 2 gb of ram. Surprisingly, it runs KSP pretty well other wise because its a overclocked dual core with a high clock rate to begin with. All the extra cores in newer CPUs dont help that much with KSP. \u003C/p\u003E\u003Cp\u003EIf I really wanted to be nasty I would set up a microwave transmission network and have infinipower with barely any mass, heh. Though I know the new receiver has a different model, I wonder how heavy it is?\u003C/p\u003E\u003Cp\u003EI did actually use the middle prop as a pusher to slow myself down for landing, just because it was taking so dang long. This thing floats like nuts. The parts are from TV Aerospace, \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-taverios-pizza-and-aerospace/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/0-18-1-taverios-pizza-and-aerospace/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt has lots of cool stock themed aero parts, and some really cool ramjets.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T12:44:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EThere was a little pulling, yes. I had to trim it pretty hard, and I didn\u0027t really have any control over my inclination, either. I just pointed it up and only bothered controlling it once it was out of the atmosphere. It made for a nice gravity turn incidentally, if not awkwardly skewed against the planets rotation and almost polar. \u003Cp\u003EAnd yea, I noticed what you said about the kerbals lagging it really badly. Im ticking orange with a really low part count flyer, its only like 40 parts. Any more kerbals (more than 20) and it would be unplayable for me.\u003C/p\u003E\u003Cp\u003EI\u0027ve used interstellar before, and I remember those reactors, but this computer (at home from college) cant quite deal with the parts. I had to edit lots of parts out of my reduced modpack to just run it on this computer. Its really old, with only 2 gb of ram. Surprisingly, it runs KSP pretty well other wise because its a overclocked dual core with a high clock rate to begin with. All the extra cores in newer CPUs dont help that much with KSP. \u003C/p\u003E\u003Cp\u003EIf I really wanted to be nasty I would set up a microwave transmission network and have infinipower with barely any mass, heh. Though I know the new receiver has a different model, I wonder how heavy it is?\u003C/p\u003E\u003Cp\u003EI did actually use the middle prop as a pusher to slow myself down for landing, just because it was taking so dang long. This thing floats like nuts. The parts are from TV Aerospace, \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-taverios-pizza-and-aerospace/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/0-18-1-taverios-pizza-and-aerospace/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt has lots of cool stock themed aero parts, and some really cool ramjets.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI actually tried the Microwave Transmission with my Advanced Spaceplane design if you look earlier in the thread...\u003C/p\u003E\u003Cp\u003EGeschoss came pretty close to banning/disallowing it when he saw what I was doing, but just barely allowed it for the Kerbin system only. What\u0027s more, it produced VERY little power relative to the size of the station- I set up a station with 8 of the NearFuture Mod\u0027s super-large solar panels (they\u0027re four times as large as the Giagantor XL\u0027s), and it only transmitted about 460 kW (460 EC/s) at closest approach from a Low Kerbin Orbit (128,000 meters)- and was only overhead for a couple of minutes. Most of the time it was active, it was only about 20-100 kW...\u003C/p\u003E\u003Cp\u003ESpeaking of KSP Interstellar, I have a MAJOR problem now... I fell the need to be dramatic- so \u0022Houston, we have a problem...\u0022\u003C/p\u003E\u003Cp\u003EI updated to the latest version 0.8, and it changed the model and collision box (as well as the specs) for the 1.25 meter nuclear reactor. It seems to have retroactively applied the change to my existing designs- so basically, now I have a model with a new COM, a reactor that is floating between two parts instead of connecting (and might break from the plane with the first puff of Duna air as a result), and a new thrust value for the plane (it\u0027s either a lot higher or a lot lower- I haven\u0027t tested the new reactor yet...)\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/84v5xBd.png\u0022 alt=\u002284v5xBd.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, there\u0027s a good chance I\u0027ll need to rebuild and resend my Eagle Mk2 (or a better model) all over again... Just because KSP Interstellar updated the 1.25 meter reactor (and I didn\u0027t make a backup before updating- so there\u0027s no going back now).\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T12:49:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EThere was a little pulling, yes. I had to trim it pretty hard, and I didn\u0027t really have any control over my inclination, either. I just pointed it up and only bothered controlling it once it was out of the atmosphere. It made for a nice gravity turn incidentally, if not awkwardly skewed against the planets rotation and almost polar. \u003Cp\u003EAnd yea, I noticed what you said about the kerbals lagging it really badly. Im ticking orange with a really low part count flyer, its only like 40 parts. Any more kerbals (more than 20) and it would be unplayable for me.\u003C/p\u003E\u003Cp\u003EI\u0027ve used interstellar before, and I remember those reactors, but this computer (at home from college) cant quite deal with the parts. I had to edit lots of parts out of my reduced modpack to just run it on this computer. Its really old, with only 2 gb of ram. Surprisingly, it runs KSP pretty well other wise because its a overclocked dual core with a high clock rate to begin with. All the extra cores in newer CPUs dont help that much with KSP. \u003C/p\u003E\u003Cp\u003EIf I really wanted to be nasty I would set up a microwave transmission network and have infinipower with barely any mass, heh. Though I know the new receiver has a different model, I wonder how heavy it is?\u003C/p\u003E\u003Cp\u003EI did actually use the middle prop as a pusher to slow myself down for landing, just because it was taking so dang long. This thing floats like nuts. The parts are from TV Aerospace, \u003Ca href=\u0022http://kerbalspaceprogram.com/0-18-1-taverios-pizza-and-aerospace/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://kerbalspaceprogram.com/0-18-1-taverios-pizza-and-aerospace/\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt has lots of cool stock themed aero parts, and some really cool ramjets.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUmmmm, took a look at that mod, and you really should have started off by mentioning you used it...\u003C/p\u003E\u003Cp\u003EIt completely re-writes (\u0022re-balances\u0022) a lot of the stock parts- including many of the ones you used in your plane. Now, the author says it makes it \u0022harder\u0022- so I\u0027m assuming it didn\u0027t help you much- but it might have been a nice detail to drop for anyone trying to reproduce a similar design... (yours gave me a couple ideas to work on myself- though Firespitter propellers currently seem to be crashing my game...)\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-25T13:53:24Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00221D-1()T\u0022 data-cite=\u00221D-1()T\u0022\u003E\u003Cdiv\u003EOkay, so, @ Geschosskopf\u003Cp\u003EI know in the rules it says you can\u0027t add or subtract from the plane, but the way I see it this is so you don\u0027t just get some SRBs and a couple of wings and that kind of thing. Now, for my new attempt I\u0027m going to increase the Duna Plane Mk4\u0027s (original name, I know) passenger capacity, but I don\u0027t really want to send a new one out. Do you mind if I send out some seats and (A)ttach them with the KAS thing?\u003C/p\u003E\u003Cp\u003EThe way I see it is that at my eventual bases they will keep a seat for each kerbal, which can be attached to the plane as needed in case of emergency relocation.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, that\u0027s OK. The added parts actually hurt flight performance, not help it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003ELooked like a fun challenge, and I had never built a duna plane before, so I did!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd you did VERY well. That\u0027s a very cool airplane \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E. I suppose the Kerbals board it by walking up the wing that\u0027s on the ground?\u003C/p\u003E\u003Cp\u003EI\u0027m really liking how the bar keeps being raised. Progress in Duna aeronautics is proceeding by leaps and bounds. Already it\u0027s gone from a surplus WW1 bomber to Rutan-esque stuff. The way you all are going, soon flying on Duna will be as common within the community as flying on Laythe. I hope in the future the community remembers the brave aviation pioneers of this thread who made it possible \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EGetting this to duna, howerver, was interesting. I originally had all these ideas for assembling it in space, or making it fold up using infernal robotics. Instead, I just strapped a bunch of mainsails to it and blasted it into orbit.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, using the airplane\u0027s wings as the fins for a cage lifter is definitely a good approach. Glad you could get it to work.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENow, landing on duna wasnt so bad. I just skimmed over the atmosphere until I made a landing moving at about 120 meters/sec. It took a few tries before I found a flat enough location, but I did at 4000 meters elevation.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAs others have suggested, you might want to use action groups to reverse some of the engines so you can land in smaller, less-flat places. That would make the plane more useful by allowing a wider range of base locations.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ETaking off again was a bit more difficult, and eventually I had to leave 6 kerbals behind. Those little guys weigh wayyy more than I realized.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELawnchair = 0.05 tons, EVA Kerbal = 0.95, so Kerbal in chair = 0.1 tons and 10x Kerbals = 1 ton, plus another 0.4 for the 8 empty seats. That\u0027s quite a load. This took me by surprise, too. Even with just 2 Kerbals on the D\u0027OH, I had to dump some of my Kethane to get the performance I wanted, and their weight on the very nose still caused a CoM problem.\u003C/p\u003E\u003Cp\u003ESince then, any time I design a vehicle with lawn chairs, I use other 0.1-ton parts as substitutes so I\u0027ll know better how it will work with the chairs occupied.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ESo, lemme try to add this up. 1 for using FAR, 1 for circumnavigation, 2 for 2000 over 5000, and \u002B9 for my 11 kerbals. I think thats everything.\u003Cp\u003E...\u003C/p\u003E\u003Cp\u003EThis is the first challenge that I have tried to do so far, and it was great fun, thanks!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooks good to me. Congrats on being in 1st place. And thanks for playing. Now go slap the patch in your sig \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T13:56:08Z","Content":"\n\u003Cp\u003EI performed some tests, and it looks like it was worse than I feared.\u003C/p\u003E\u003Cp\u003EThe new version of KSP Interstellar greatly reduces the thrust from level-2 1.25 meter reactor/thermal turboject pairs- from 19.1 kN at Kerbin Sea Level to 14.1 kN at Kerbin Sea Level... (\u003Cstrong\u003Ethe thrust reaches an approximate peak of double KSL thrust at low-pressures, like are found on Duna, whereas propellers fall off exponentially with decreasing pressure- which is why I opted for thermal turbojets originally\u003C/strong\u003E)\u003C/p\u003E\u003Cp\u003EThis is a 26% reduction in the thrust of my thermal turbojets! (slightly less if I use the new Thorium reactor fuel- which can get 14.8 kN- but requires regular EVA maintenance) That means that my existing turbojet designs might not even be able to fly on Duna any more- nevertheless outperform propeller-based aircraft! (which get much higher thrust at high atmospheric pressures, but perform poorly in thin atmospheres such as Duna\u0027s)\u003C/p\u003E\u003Cp\u003EThe mod *DID* add more powerful, fusion-based reactors however- but these require an extremely advanced tech node (Fusion Power) I still haven\u0027t come even close to unlocking yet; and that won\u0027t help my poor existing Eagle Mk2- which is already en-route to Duna with a now-nerfed fission reactor!\u003C/p\u003E\u003Cp\u003EGeschosskopf, this is just a thought- but how do you feel about rocket-powered aircraft on Duna? My planes would still be held up by aerodynamic forces- but would just carry their own Oxidizer due to the lack of any significant amounts of atmospheric diatomic Oxygen (02) on Duna... (There is a *tiny* amount on Duna, like on real-life Mars, but you can only really detect it by examining the code. This tiny amount *is* used by KSP Interstellar to allow Oxidizer production at very low efficiencies on Duna, however...)\u003C/p\u003E\u003Cp\u003EEDIT:\u003C/p\u003E\u003Cp\u003EThe WORST part- the changelog actually states that the revisions to the reactor don\u0027t affect performance at all. I call bull on that... All it took was a few tests of the engines clamped on the runway before (I wrote down the thrust values at the time) and after (I wrote down the new values) to prove that wrong...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-25T14:14:24Z\u0022 title=\u002211/25/2013 02:14  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 25, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-25T14:06:58Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003ESo, there\u0027s a good chance I\u0027ll need to rebuild and resend my Eagle Mk2 (or a better model) all over again... Just because KSP Interstellar updated the 1.25 meter reactor (and I didn\u0027t make a backup before updating- so there\u0027s no going back now).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EDamn. But on the bright side, you can now redesign it with Pwings to save on parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-25T14:12:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EGeschosskopf, this is just a thought- but how do you feel about rocket-powered aircraft on Duna? My planes would still be held up by aerodynamic forces- but would just carry their own Oxidizer due to the lack of any significant amounts of atmospheric diatomic Oxygen (02) on Duna... (There is a *tiny* amount on Duna, like on real-life Mars, but you can only really detect it by examining the code. This tiny amount *is* used by KSP Interstellar to allow Oxidizer production at very low efficiencies on Duna, however...)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ERocket planes are fine, provided they meet all the design requirements. That is, you can refuel them and they never go ballistic. You know, like the Me-163. Long glides after a powered climb are fine.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T14:44:32Z","Content":"\n\u003Cp\u003EI was thinking more along the lines of a thermal rocket nozzle or NERVA. Something that would work better for sustained periods of time...\u003C/p\u003E\u003Cp\u003EThen again, I might just go for a propeller-aircraft. You see, I just discovered a very important trick to their use that might really help me break my previous performance records with them... I\u0027m going to keep it a secret for now, though, to see if I can use it to level the playing field a bit with Steven\u0027s more powerful computer (mine can\u0027t handle 20 Kerbals on lawnchairs- though to be honest, it didn\u0027t quite sound like his could very well either...) I already helped him enough by telling him how to cut his reactor mass in less than half...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-25T20:00:42Z","Content":"\n\u003Cp\u003EThanks guys! Im glad you liked my plane. Though if kerbals are so heavy, I might be justified putting them inside something, and dealing with the extra mass. Hmmm... Ideas....\u003C/p\u003E\u003Cp\u003EAnd Northstar, thats no fun! But seriously, pwings is amazing for stuff like this. You also brought up a good point with TV aerospace, it does rebalance some parts. Namely, it reduces the thrust of stock turbojets and jets to more realistic levels. Its actually a mod that I dont generally use, I installed it just for this challenge. \u003C/p\u003E\u003Cp\u003ESo, mods I am using-\u003C/p\u003E\u003Cp\u003ENearFuture\u003C/p\u003E\u003Cp\u003ETV Aerospace\u003C/p\u003E\u003Cp\u003EFAR\u003C/p\u003E\u003Cp\u003EFirespitter\u003C/p\u003E\u003Cp\u003EInfernal Robotics\u003C/p\u003E\u003Cp\u003EProcedural Wings and Fairings\u003C/p\u003E\u003Cp\u003EAre all of those legal for this challenge?\u003C/p\u003E\u003Cp\u003EOne last thing, have any of yall used the Ubio\u0027s welding mod yet? I havent used it for this challenge, but I have used it before and it can cut part counts down by half easily. \u003C/p\u003E\u003Cp\u003E20 kerbals on lawnchairs was not fun to play, lagwise.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-25T20:05:53Z\u0022 title=\u002211/25/2013 08:05  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 25, 2013\u003C/time\u003E by StevenRS11\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T21:24:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EThanks guys! Im glad you liked my plane. Though if kerbals are so heavy, I might be justified putting them inside something, and dealing with the extra mass. Hmmm... Ideas....\u003Cp\u003EAnd Northstar, thats no fun! But seriously, pwings is amazing for stuff like this. You also brought up a good point with TV aerospace, it does rebalance some parts. Namely, it reduces the thrust of stock turbojets and jets to more realistic levels. Its actually a mod that I dont generally use, I installed it just for this challenge. \u003C/p\u003E\u003Cp\u003ESo, mods I am using-\u003C/p\u003E\u003Cp\u003ENearFuture\u003C/p\u003E\u003Cp\u003ETV Aerospace\u003C/p\u003E\u003Cp\u003EFAR\u003C/p\u003E\u003Cp\u003EFirespitter\u003C/p\u003E\u003Cp\u003EInfernal Robotics\u003C/p\u003E\u003Cp\u003EProcedural Wings and Fairings\u003C/p\u003E\u003Cp\u003EAre all of those legal for this challenge?\u003C/p\u003E\u003Cp\u003EOne last thing, have any of yall used the Ubio\u0027s welding mod yet? I havent used it for this challenge, but I have used it before and it can cut part counts down by half easily. \u003C/p\u003E\u003Cp\u003E20 kerbals on lawnchairs was not fun to play, lagwise.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI can\u0027t imagine the 20 EVA Kerbals were fun to deal with... At least you could still fly it though- my computer would (probably) have been in the red on a design like that...\u003C/p\u003E\u003Cp\u003EI wouldn\u0027t recommend Ubo\u0027s Welding Mod. It doesn\u0027t actually adjust all the config parameters correctly- especially not the drag coefficients, even on stock parts. It doesn\u0027t work hardly at all on most non-stock parts either- which greatly limits its usefulness...\u003C/p\u003E\u003Cp\u003EIf you were thinking of larger wings, you\u0027re better of with Procedural Dyanmics. Larger fuel tanks- StretchyTanks. Larger static solar panels- the Multipanels mod. Longer fuselages- well that\u0027s against the challenge rules (see my discussions with Geschosskopf earlier in the thread).\u003C/p\u003E\u003Cp\u003EAnyways, I wish you the best of fun (but not of performance- I have to beat you somehow!) in your future Duna flying attempts...\u003C/p\u003E\u003Cp\u003E@ Geschosskopf\u003C/p\u003E\u003Cp\u003EBy the way, I was thinking about this- and I think you should split the challenge into two \u0022Categories\u0022.\u003C/p\u003E\u003Cp\u003EThe first category, which would carry over all existing rules and entrants, and would be the \u0022Light Plane\u0022 category.\u003C/p\u003E\u003Cp\u003EAnd a new, second \u0022Heavy Plane\u0022 category.\u003C/p\u003E\u003Cp\u003EThe Heavy Plane category would/should have several rule-changes that are more geared towards heavyweight planes:\u003C/p\u003E\u003Cp\u003E- An increase in minimum capacity: the plane needs to be able to transport EITHER 4 Kerbals, OR 2 Kerbals and at least 2 tons of cargo\u003C/p\u003E\u003Cp\u003E- An adjustment to altitude ceiling- perhaps a bit of lowering to 4750 meters, or conversely, an increase to 5500 or 6000 meters?\u003C/p\u003E\u003Cp\u003E- Most importantly (and the reason for the separate category) the plane doesn\u0027t have to land at over 2500 meters. While it must still be able to fly at reasonably high altitude (see above), so it\u0027s not stuck only flying in the valleys, it only needs to be able to land at, say, 1500 or 1200 meters after takeoff- and anywhere on the initial landing.\u003C/p\u003E\u003Cp\u003EI suggest the heavyweight category because really big planes simply can\u0027t takeoff or land on a dime in rough terrain at high altitude. They can\u0027t on Earth (or Kerbin), and they can\u0027t on Duna either. Their wing-loads are simply too high for it (even if their sometimes higher thrust and total lift from heavier wings allows higher-altitude flight than light planes). However, surely you can see the obvious utility in design of heavyweight strategic lifters? They would be a lot more useful for a long-term Duna colony IMHO than the kind of light scout-planes we\u0027ve seen submitted in this challenge so far...\u003C/p\u003E\u003Cp\u003E(All that said- my latest Duna design is a lot more of a \u0022scout\u0022 plane than all my others: due to the need for a rapid takeoff at high altitude)\u003C/p\u003E\u003Cp\u003EBy the way, part of my reasoning behind the heavyweight category came from examining the configs in the Procedural Dynamics mod. You see, it comes with two wing variants- a lightweight and heavyweight one. At first when I saw the heavier variant, I thought- why would anyone ever use this? Doesn\u0027t it experience more gravity and drag? But then, when I examined the actual code behind the wing modules, it turns out that KSP overwrites the standard code for wing and winglet parts with a different aerodynamic one. In the aerodynamic code, lift is actually PROPORTIONAL to mass- so heavier wings produce more lift, even if they experience more gravity. The \u0022lift\u0022 value is actually the lift-coefficient, much like the \u0022drag\u0022 value is the drag-coefficient. Both affect the scaling- but it is ultimately mass that has the greatest say over total lift and drag.\u003C/p\u003E\u003Cp\u003ESeeing that the aerodynamic model worked in a completely different way than I thought it did has completely changed my perspective towards aircraft design. No longer will I be dividing the \u0022Lift\u0022 value by mass to get an idea of lift-weight ratios: now I know that higher-Lift valued parts always produce more lift relative to their mass- and lift-weight ratio is what the \u0022Lift\u0022 value represents...\u003C/p\u003E\u003Cp\u003EThis also adds up to heavier-winged craft having higher altitude ceilings and cargo-capacity, but needing longer runways to get off the ground (they\u0027re slower to accelerate to their liftoff speed at a given altitude), like in real life. Of course, the longer-runway effect *IS* less substantial on Duna thanks to the reduced gravity.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-25T21:48:23Z\u0022 title=\u002211/25/2013 09:48  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 25, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T21:42:52Z","Content":"\n\u003Cp\u003EOn a similar note, it also turns out that the maximal thrust values weren\u0027t actually reduced in the newest version of the KSP Interstellar mod. What actually WERE reduced were the ISP-ratings of the fission-powered thermal turbojets; and the TWR Limiter code was also made a lot more conservative. What this meant, in practice, was that my clamped-burn tests weren\u0027t producing as much thrust with the revised reactors because they didn\u0027t have enough intake area for stationary use- even though the resource bar showed IntakAtm was nearly full (I can thank the TWR Limiter revisions for that quirk).\u003C/p\u003E\u003Cp\u003EWhat it also means is that, due to the reduced ISP ratings (over 25% less) , I will probably still experience a drastic reduction in the altitude ceiling of the Eagle Mk2- which previously should have been able to escape Duna\u0027s atmosphere altogether solely on turbojet power alone, according to my latest calculations (it turns out, the reduced gravity adds roughly one scale height, 3000 meters, to the altitude ceiling of the craft, after being converted from Kerbin vlaues like in my earlier formula- all other things being equal. That\u0027s still *before* the effects of the reduced minimum orbital velocities- based on effective gravity on Duna when stationary, which is roughly 30% that on Kerbin.)\u003C/p\u003E\u003Cp\u003ETHAT would have been very cool to see- especially since the vessel was equipped with a substantial amount of SAS torque (two Mk2 cockpits are nothing to sneeze at in that regard), which would have enabled it to still be controllable at very-high altitude, if admittedly more in the manner of an SAS-turned spacecraft than due to its control surfaces... Of course NOW, the turbojet engine will start experience thrust-reduction and then eventually, flame-out, long before that point- even with a 2.5 meter Atmospheric Intake on the front...\u003C/p\u003E\u003Cp\u003EI guess I\u0027ll need to load the Eagle Mk2 up with its 3-ton maximum of cargo if I want to get the most points out of it now, since its altitude ceiling will be limited by intakes rather than lift and TWR..\u003C/p\u003E\u003Cp\u003EFinally, one last thing Geschosskopf. This goes back to when we were both still using solar-powered electric propeller-aircraft in our Duna plane designs, and yours was the only one that had managed to fly there yet (I eventually abandoned propellers in favor of turbojets, for their greater thrust in thin atmosphere- though with their latest downgrading in KSP Interstellar, I think I might be going back to electric propellers...) \u003C/p\u003E\u003Cp\u003EBack then, we both noticed that our planes actually could operate on less solar panel mass at higher altitude. I think we both ended up chalking it up to higher efficiency due to less atmospheric interference with the sunlight (especially on Duna- where the atmosphere scale height is less, as I pointed out). But it turns out, from some of my newest tests (this goes to the trick I figured out to improve propeller craft performance I\u0027m still keeping a secret), that actually, there is an additional factor.\u003C/p\u003E\u003Cp\u003EYou see, I\u0027m sure you noticed that the electric propeller craft use ElectricCharge as a \u0022fuel\u0022, and that like reaction-engines, the propellers have an ISP. Well it turns out, and I can\u0027t believe I didn\u0027t notice this before, that the main factor reducing the necessary panel area is actually reduced power DEMANDS. You heard me right- the elctric propellers require less ElectricCharge at higher altitudes, even when at full-throttle.\u003C/p\u003E\u003Cp\u003EThis isn\u0027t due to an increase in the ISP values with height- actually, I think those decline. Rather, it is due to an enormous drop in thrust at high-altitude.\u003C/p\u003E\u003Cp\u003EAs I pointed out before, propellers produce exponentially less thrust in thinner atmospheric pressures- eventually falling well behind thermal turbojets in terms of TWR despite their much lower weight (though, as I mentioned, this scaling is now less important due to a reduction in thermal turbojets\u0027 effective altitude ceiling). However, this reduction in thrust does have a silver lining, so to speak. The less thrust the propellers produce, the less ElectricCharge they use as \u0022fuel\u0022, so to speak. What this effectively means is that they require less and less power as they can only move so quickly, and as the plane climbs, less and less strain is put on the electric engines to keep the propellers spinning at full speed (even if that full speed does produce a lot less thrust). Thus, in effect, a design built for thin-atmosphere flight requires a lot less generator mass, but a lot more weight in propellers, than one built for thick-atmosphere flight. And, as I already mentioned, there\u0027s also the air-deprivation that eventually cuts in as the engines start to run out of \u0022FSCoolant\u0022...\u003C/p\u003E\u003Cp\u003EAlright, I\u0027ve given enough secrets of Duna plane-design for one day. Now to see if I can\u0027t build something that can break a few records!\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-25T23:37:54Z","Content":"\n\u003Cp\u003EI present, the flight of the \u0027Hummingbird\u0027\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/9eVUH\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EShe\u0027s a maneuverable little plane, and has a certain beauty. I\u0027m definitely not done with refinements- but this model can cruise at 15,744 meters on Kerbin (heading East), at over 188 m/s which equates to:\u003C/p\u003E\u003Cp\u003E4614.7 meters on Duna based purely on air pressure (4.3% of Kebin Sea Level)\u003C/p\u003E\u003Cp\u003Eapprox. 7000 meters on Duna when you factor in the 30% gravity (adds about one scale-height of 3000 meters)\u003C/p\u003E\u003Cp\u003Eapprox. 7500-8500 meters on Duna when you factor in the reduced planetary radius as well (and reduced effective gravity at speeds that are a significant fraction of the resultant lower orbital speeds- calculation assumes a slightly increased cruising speed at 7500 meters vs. 4000 meters)\u003C/p\u003E\u003Cp\u003EOf course, that\u0027s just numbers- but I look forward to putting this model, or an improved one, on Duna...\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-25T23:42:42Z\u0022 title=\u002211/25/2013 11:42  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 25, 2013\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-26T00:33:22Z","Content":"\n\u003Cp\u003EOk, so with my new-found knowledge that kerbals are made of lead, I designed this guy-\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/Rae1uNZ.jpg\u0022 alt=\u0022Rae1uNZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EThose passenger compartments hold 2 kerbals each, for a total of 22, all inside. For some reason it doesnt actually show that they are inside, but they definitely are. Its actually lags less than my other design, impossibly. I upgraded two of the electric engines, and added a special spoiler to the back. You can see it better in this picture-\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/7FHv5gZ.jpg\u0022 alt=\u00227FHv5gZ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt has a bearing from robotics, and lets me rotate it to adjust the angle of attack of my plane as a whole. Takeoff is SO much easier, it can gain altitude and speed going at only 50 mps. The addition of small wheels on all the little pods also helps deal with dunes. \u003C/p\u003E\u003Cp\u003EI am fairly confident that I could scale this design indefinitely, either by using the larger nuke reactor and clusters of 4 engines, or by continuing the existing pattern I have here. Think add one more of this on the tail, and one more on each side of the big wings. \u003C/p\u003E\u003Cp\u003EI didnt take the time to see how high its cruising altitude is because it cant survive physwarp at all, but I imagine its higher than my first.\u003C/p\u003E\u003Cp\u003EEDIT-Yea, I couldn\u0027t help myself. So I made it bigger.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/itfjKGv.jpg\u0022 alt=\u0022itfjKGv.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EI dont think I could ever actually get it to Duna, because its pretty flexible. But if the need arises, I can try to strap a bunch of mainsails on it and see. Either way, I hyperedited it duna, and it flies!\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xPLW9VJ.jpg\u0022 alt=\u0022xPLW9VJ.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt climbs very, very slowly. Slower, infact, than that mountain that is approaching.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/lrnCKpx.jpg\u0022 alt=\u0022lrnCKpx.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EIt was one of those crashes where no parts get destroyed really, everything just comes apart.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/oNwc9vS.jpg\u0022 alt=\u0022oNwc9vS.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EOther than its questionable climb rate over 4000, its really pretty nice to fly. Takes off at around 40 meters per second, and is so large and covered in so many little wheels it just flows over whole dunes. It carries 41 kerbals total, and probably could carry a few tons of fuel in all those fuselodges. I emptied them before I tried it this time, but with a few more engines I dont think that would be necessary.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-26T01:54:38Z\u0022 title=\u002211/26/2013 01:54  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 26, 2013\u003C/time\u003E by StevenRS11\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"StevenRS11","CreatedById":83261,"CreatedDateTime":"2013-11-26T02:38:56Z","Content":"\n\u003Cp\u003EOne other thing- it might be a good idea to tweak how you score this challenge, because right now it awards carrying lots of kerbals a bit too much. Maybe something like this-\u003C/p\u003E\u003Cp\u003EAltitude: \u002B1 per 500 over requirement\u003C/p\u003E\u003Cp\u003ESingle stage from Kerbin to duna: \u002B2\u003C/p\u003E\u003Cp\u003ESS from kerbin to duna and back: \u002B 4 more\u003C/p\u003E\u003Cp\u003Eall Kerbals inside: \u002B2\u003C/p\u003E\u003Cp\u003ESpeed: \u002B1 per 100 m/s over 200 (or something like that)\u003C/p\u003E\u003Cp\u003EMaybe change the points you get for carrying kerbals to be like the base 2 log of the number of kerbals you have, or maybe you multiply your final score by 1\u002B0.1*(number of kerbals-2). Something like that, so I can try to either fly really fast and high, or carry a whole bunch of kerbals. If I can combine the two, I may or may not get a better score, but it makes the challenge more nuanced.\u003C/p\u003E\u003Cp\u003EId say that might make scoring the challenge to complicated, but honestly, look at the game we are playing. If we where afraid of math or complexity, we wouldnt be here.\u003C/p\u003E\n"},{"CreatedByName":"Sirine","CreatedById":74830,"CreatedDateTime":"2013-11-26T03:06:53Z","Content":"\n\u003Cp\u003EI have a request... make a leader board for ... 100% stock.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2013-11-26T03:17:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022StevenRS11\u0022 data-cite=\u0022StevenRS11\u0022\u003E\u003Cdiv\u003EOne other thing- it might be a good idea to tweak how you score this challenge, because right now it awards carrying lots of kerbals a bit too much. Maybe something like this-\u003Cp\u003EAltitude: \u002B1 per 500 over requirement\u003C/p\u003E\u003Cp\u003ESingle stage from Kerbin to duna: \u002B2\u003C/p\u003E\u003Cp\u003ESS from kerbin to duna and back: \u002B 4 more\u003C/p\u003E\u003Cp\u003Eall Kerbals inside: \u002B2\u003C/p\u003E\u003Cp\u003ESpeed: \u002B1 per 100 m/s over 200 (or something like that)\u003C/p\u003E\u003Cp\u003EMaybe change the points you get for carrying kerbals to be like the base 2 log of the number of kerbals you have, or maybe you multiply your final score by 1\u002B0.1*(number of kerbals-2). Something like that, so I can try to either fly really fast and high, or carry a whole bunch of kerbals. If I can combine the two, I may or may not get a better score, but it makes the challenge more nuanced.\u003C/p\u003E\u003Cp\u003EId say that might make scoring the challenge to complicated, but honestly, look at the game we are playing. If we where afraid of math or complexity, we wouldnt be here.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI agree on the awarding Kerbal-capacity too much thing, but the rules and scoring guidelines were already set out, and I doubt he\u0027s going to change them. Though maybe, like I suggested, there could be new \u0022categories\u0022- like one for speedsters, one for heavy lifters, etc.\u003C/p\u003E\u003Cp\u003EAnyways, so did you get either of these designs to Duna legit- or did you just hyperedit them all there?\u003C/p\u003E\u003Cp\u003EI ask because I need to know what I\u0027m trying to beat, of course. The Hummingbird (with its 7 propellers) pretty much pushed my CPU to its limits, so I designed this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/sskLwnV.png\u0022 alt=\u0022sskLwnV.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EJust getting her through her initial climb now (MechJeb, in the background- which can barely control her), but she can climb at less than 7 m/s at Kerbin sea level- so it looks like I was right about that whole wing-weight thing... This design pretty much focused on getting the highest wing weights and lift coefficients possible with one engine and a 1.25 meter fuselage...\u003C/p\u003E\u003Cp\u003EOnce again, it looks like you might be ready to pull the more powerful computer trump-card though: my computer would pretty much DIE trying to run that many Firespitter propellers at once- and that\u0027s without even running FAR- which must make your game even more laggy...\u003C/p\u003E\u003Cp\u003EIt does look a LOT like my earlier electric propeller designs though- before I moved to Thermal Turbojets. Which don\u0027t get as high TWR at low-altitude (up to the equivalent of about 5000 meters on Duna), but keep working into much thinner atmosphere...\u003C/p\u003E\u003Cp\u003EI challenge you to build something that will fly HIGHER, rather than carry more Kerbals, actually. *THAT* would be a better show of skill, rather than just computer-strength... (my computer pretty much caps out at 7 engines and 6 control surfaces- any more of either and I\u0027m running in the red/orange...)\u003C/p\u003E\n"},{"CreatedByName":"Geschosskopf","CreatedById":69507,"CreatedDateTime":"2013-11-26T04:06:15Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E@ Everybody:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EI think it\u0027s a bit late to really revise the scoring system. I\u0027m sorry I didn\u0027t realize how ingenious everybody would be when I wrote the rules. However, it seems to me that everybody\u0027s designs so far do something better than everybody else\u0027s, so in a way, everybody is leading by some measure. This is why I went back and edited the 1st post to link everybody\u0027s designs to the leader board. That way, somebody wanting to build a Duna plane can compare them all and see which best fits his needs.\u003C/p\u003E\u003Cp\u003EPersonally, I think anybody who can make a plane that meets the basic requirements has won the challenge and done something few others have ever done. Scoring systems are arbitrary and really don\u0027t mean much in this situation.\u003C/p\u003E\n"}]}