{"TopicId":47724,"ForumId":25,"TopicTitle":"Constellation Space Program - Three Part Challenge","CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-08T13:00:32Z","PageNum":3,"Articles":[{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-18T06:24:12Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003EHow about this: add brownie points for the amount of science a particular mission generates (i.e. extra credit for missions). Say......\u002B1 point for the challenge per 20 units of science returned or transmitted successfully back to KSC.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wonder if the effort for science points in sandbox is saved in the persistent file somewhere.. ?\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-18T06:41:28Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/wrIHIw7l.png\u0022 alt=\u0022wrIHIw7l.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKonstellation Space Program Update\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe first two steps to a Munar Outpost have been made. The Altair Outpost Variant landed in shallow crater near the equator on a robotic launch. Shortly after, an Altair Lander on Ares V/EDS and crew launch on Orion/Ares I performed a crewed landing less than 30m from the Munar outpost.\u003C/p\u003E\u003Cp\u003EAfter having a look about, three of the four landing crew boarded the ascent stage. The fourth kerbal remained at the outpost to watch the temperature gauge. Having completed a Munar docking at 150km with the CM, the crew transferred to the CM and successfully returned to Kerbin.\u003C/p\u003E\u003Cp\u003ELooking towards Duna, another Ares V launched an Orion 5 on an EDS bound for Duna. The Duna burn went well and the mission will fly within 5000 km of Duna in 62 days. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/d3Vzx\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-10-18T16:05:38Z","Content":"\n\u003Cp\u003ELooking at what some folks are reporting for science on missions to Duna, I think my initial 20-point suggestion is going to be a touch low given how the rest of the challenge is scored. Like by an order of magnitude. Possibly two. New suggestion: \u002B1 challenge point per 500 science points collected.\u003C/p\u003E\u003Cp\u003EMore accomplishments today: 12 spacewalks in one night...and I proved the Thanatos could launch a Block I Scorpio without using EDS fuel.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/HQvAU\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPREVIOUS SCORES\u003C/strong\u003E: Design 33, Mission 7\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENEW POINTS CLAIMED\u003C/strong\u003E: Design \u002B1 (34), Mission \u002B3 (10)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ECrew Launch Vehicle (Thanatos 7)\u003C/span\u003E: \u002B0 pts\u003C/p\u003E\u003Cp\u003ECan carry Orion Block 2 to low orbit without using any fuel from the Orion service module (\u002B2) \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EHeavy Cargo Lift Vehicle (Thanatos Heavy 7)\u003C/span\u003E: \u002B1 pts.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003ECan carry the Earth Departure Stage (EDS) and Orion BLock 1 to low orbit without using any fuel from the EDS (\u002B1)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMunar/Dunar Lander (Katapugon 7 Series)\u003C/span\u003E: \u002B0 pts\u003C/p\u003E\u003Cp\u003EHardware designed, building pending, no accomplishments achieved to date.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ECrew Vehicle (Scorpio 7)\u003C/span\u003E \u002B0 pts\u003C/p\u003E\u003Cp\u003EAll accomplishments achieved.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ER\u0026amp;D:\u003C/span\u003E \u002B5 pts\u003C/p\u003E\u003Cp\u003EPerform a LKO test of an Altair Munar lander. With at least one Kerbal on board, fly an Altair Munar lander at least 100km away from the Orion spacecraft. Dispose of the descent stage, then fly the ascent stage back to the Orion. Transfer the crew to the Orion then robotically control the ascent stage into a re-entry orbit (\u002B3)\u003C/p\u003E\u003Cp\u003EPerform the above Altair test in Munar orbit using EOR mission (\u002B1)\u003C/p\u003E\u003Cp\u003EUsing an un-Kerballed Duna lander and an EDS on Ares V, perform a high-speed re-entry from at least 15,000km Ap. (\u002B2)\u003C/p\u003E\u003Cp\u003ELaunch an un-Kerballed Duna lander on Ares V into low orbit. Perform an orbital test and descent of the lander (crewed or uncrewed) (\u002B3)\u003C/p\u003E\u003Cp\u003EUse an Ares I in at least one Munar mission (flyby, orbital or landing) (\u002B1)\u003C/p\u003E\u003Cp\u003EUse an Ares I in at least one Duna mission (flyby or landing) (\u002B1)\u003C/p\u003E\u003Cp\u003EUse an Ares V in at least one Munar mission (orbital or landing) (\u002B2)\u003C/p\u003E\u003Cp\u003EUse an Ares V in at least one Duna mission (flyby or landing) (\u002B2)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESpace Station - Scorpio/Thanatos\u003C/span\u003E: \u002B3 pts\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003ELaunch an Orion to the orbiting space station with at least 4 crew. Perform a crew exchange and return four Kerbals from the space station to Kerbin using the Orion. (\u002B2)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EReturn at least one Kerbal from the space station to Kerbin in an Orion which was docked robotically. This is a \u0022liferaft\u0022 scenario intended to use the Orion left at the space station in \u0022Research and Development\u0022 above. (\u002B1)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMun - Scorpio/Thantatos/Thantatos Heavy/Katapugon\u003C/span\u003E: \u002B0 pts\u003C/p\u003E\u003Cp\u003ELand an un-Kerballed Altair on the Mun without the use of an Orion spacecraft (EDS and Altair only launched from Ares V) (\u002B2)\u003C/p\u003E\u003Cp\u003EDemonstrate that your Altair can, on its own, brake the Orion and Altair into Mun orbit and perform a polar landing (\u002B2)\u003C/p\u003E\u003Cp\u003ELand at least 4 Kerbals in an Altair on the Mun within 1km of either above Altair (\u002B3)\u003C/p\u003E\u003Cp\u003EReturn four Kerbals from a Munar landing to Kerbin (\u002B2)\u003C/p\u003E\u003Cp\u003EMunar Outpost: Using at least one crewed Altair lander, an Outpost Variant and a pressurized rover set up a Munar Outpost. The Outpost Variant can join a crewed Altair already on the Mun or can be part of a separate Altair/Outpost Variant mission to another location. The Altair and Outpost Variant need to be within 100m of each other. (\u002B5)\u003C/p\u003E\u003Cp\u003ENo other mission objectives completed to date.\u003C/p\u003E\n"},{"CreatedByName":"Bioman222","CreatedById":30364,"CreatedDateTime":"2013-10-18T18:34:26Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/X6cGn\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EDid it because I needed to make a new Ares for .22.\u003C/p\u003E\u003Cp\u003EPoints: 9\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-18T18:36:45Z\u0022 title=\u002210/18/2013 06:36  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 18, 2013\u003C/time\u003E by Bioman222\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-18T20:14:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003ELooking at what some folks are reporting for science on missions to Duna, I think my initial 20-point suggestion is going to be a touch low given how the rest of the challenge is scored. Like by an order of magnitude. Possibly two. New suggestion: \u002B1 challenge point per 500 science points collected.\u003Cp\u003EMore accomplishments today: 12 spacewalks in one night...and I proved the Thanatos could launch a Block I Scorpio without using EDS fuel.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI looked briefly at science in sandpit but I did not see any points or ways of reporting what science was done on a mission. If there is, I need to look again. So, for now, I\u0027ll leave the \u0022science\u0022 points in this challenge will remain unchanged.\u003C/p\u003E\u003Cp\u003EThat lifter is a monster.. I bet you could carry my Ares V on it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bioman222\u0022 data-cite=\u0022Bioman222\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EDid it because I needed to make a new Ares for .22.\u003C/p\u003E\u003Cp\u003EPoints: 9\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ELooking good! The pic off the side of the SRB gives a great realistic look.\u003C/p\u003E\n"},{"CreatedByName":"BlazeFallow","CreatedById":83905,"CreatedDateTime":"2013-10-19T18:08:47Z","Content":"\n\u003Cp\u003EGosh darn it Death, stop making challenges that are so good I can\u0027t not do them.\u003C/p\u003E\u003Cp\u003EDon\u0027t actually stop though, you\u0027ve given me more reason to play than even SCIENCE.\u003C/p\u003E\u003Cp\u003ESuffice to say, I will be joining in this challenge. Time to start designing designs....\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-19T19:00:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlazeFallow\u0022 data-cite=\u0022BlazeFallow\u0022\u003E\u003Cdiv\u003EGosh darn it Death, stop making challenges that are so good I can\u0027t not do them.\u003Cp\u003EDon\u0027t actually stop though, you\u0027ve given me more reason to play than even SCIENCE.\u003C/p\u003E\u003Cp\u003ESuffice to say, I will be joining in this challenge. Time to start designing designs....\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWait... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E Cooking up something now, but won\u0027t be ready for at least 2 weeks.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-19T20:13:46Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dG2wB9ol.png\u0022 alt=\u0022dG2wB9ol.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKonstellation Space Program Update\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ENow that a Munar Outpost has been established, proving the Orion spacecraft for deep space missions, a crew of 5 kerbals were launched on a flyby mission to Duna. The crew were launched on an Ares V/EDS with the Orion capsule in a single launch and passed within 5000km of Duna. The crew took a good look at the frozen icecap then ditched the EDS stage before using the Orion SM engine to get into a Kerbin encounter. After their 130 day mission, the crew returned safely to Kerbin. The valuable data acquired on this mission will help finalize the design of the Duna Lander.\u003C/p\u003E\u003Cp\u003EIn other news, the Munar rover design is almost ready for delivery to the Munar Outpost. This last launch to this outpost will complete the first outpost mission objectives. The next outpost will be delivered to the Mun\u0027s large crater at it\u0027s northern pole.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EDuna Orion Flyby\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/jtaXF\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-19T20:49:15Z\u0022 title=\u002210/19/2013 08:49  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 19, 2013\u003C/time\u003E by Death Engineering\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-22T15:24:01Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/zMMcBKKl.png\u0022 alt=\u0022zMMcBKKl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKonstellation Space Program Update\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHaving successfully completed a Duna flyby mission and taking lots of good photos for the design team, the Altair Duna Variant and Duna Return Vehicle were completed then sent on high Kerbin orbital tests. Both landers were sent out past 15000 km before heading towards a high speed re-entry on Kerbin. Both vehicles performed as expected and no changes are needed before beginning the Duna stage of the Konstellation space program.\u003C/p\u003E\u003Cp\u003EIn Munar news, a crew exchange vehicle was launched uncrewed to the first outpost. This variant of the Altair uses the same ascent stage as the main Altair lander but does not have any crew quarters on the descent stage and will be used as a backup ascent vehicle for the next crew coming to the outpost. Also, an Altair Outpost Variant with two rovers was landed on the Mun\u0027s south pole. This will soon be joined by an Altair lander with four crew.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/dS6q9\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-10-22T15:48:30Z","Content":"\n\u003Cp\u003EStill in this - I\u0027ve just been getting over the shininess of 0.22 and will be back to work soon. Munar/Dunar habitat was designed yesterday; due to the mass of the rovers, the habitat will be as massive as the lander despite the lack of an ascent stage.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-22T15:50:41Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003EStill in this - I\u0027ve just been getting over the shininess of 0.22 and will be back to work soon. Munar/Dunar habitat was designed yesterday; due to the mass of the rovers, the habitat will be as massive as the lander despite the lack of an ascent stage.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood to hear! Career mode has not gripped me, for some reason. I\u0027m hoping Squad or a modder will make science relevant in sandbox. Until then, or until science in career makes sense, its sandpit for me. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-10-23T13:09:01Z","Content":"\n\u003Cp\u003ESo.......I need to ask about the notion of a \u0022Cargo Altair\u0022. I was planning on putting the pressurized rovers with the habitat, but had problems finding a good mounting point (the habitat follows the same design as the two-stage lander, which utilizes the same hex symmetry as the Scorpio Crew Module, and its actually fairly compact lengthwise). I did ultimately get them attached, but I\u0027m looking at it and saying to myself \u0022there\u0027s no way in hell that thing is going to survive a launch\u0022. Even if it does, the part count is hellacious at this point.\u003C/p\u003E\u003Cp\u003EMain question: does the Cargo Altair have to at least resemble the other Altair variants? Or could I just re-utilize the Storax Sedan idea from the Mars Challenge (i.e. dangle two rovers off the sides of a fuel canister)? \u003C/p\u003E\u003Cp\u003ESo far the challenge of career mode is to do the stuff with smaller parts that you\u0027re used to doing with the bigger parts. I unlocked enough stuff to recreate my first demo Mun lander just last night. Made about 500 science in the process. Got my eyes on unlocking the Mk1 Lander Can next...\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-23T15:26:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003EMain question: does the Cargo Altair have to at least resemble the other Altair variants? Or could I just re-utilize the Storax Sedan idea from the Mars Challenge (i.e. dangle two rovers off the sides of a fuel canister)? \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t found a lot of data on how the Altair Cargo variant would deliver and deploy a sizable (pressurized) rover, but I suspect it would have taken the form of a top-mounted payload with a deployable ramp to the surface. This is not really doable here. For the intent of the challenge, method of deliver of the rover is open to interpretation. Feel free to deliver the rover(s) with any lander design.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/1/1b/Altair_-_cargo_mode.jpg\u0022 alt=\u0022Altair_-_cargo_mode.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EFor my program, I\u0027ve used the same ascent stage for both 4-crew landers and similar designs for the descent stage on all three versions of the Altair, but to use the same descent/landing stage for all three isn\u0027t really practical since the mass of each is likely to be vastly different. The three versions of the LM I\u0027ve developed are: typical LM style with descent stage that has no other purpose than landing; LM with four pressurized seats in the descent stage that serves as a reusable base after the landing crew has left, outpost version that substitutes more pressurized seats and two rovers for an ascent stage.\u003C/p\u003E\u003Cp\u003EAnother useful reference I\u0027ve come across: \u003Ca href=\u0022http://astronautical.org/sites/default/files/vonbraun/2008/Von_Braun_Symposium_2008-10-21_2d_Dorris.pdf\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://astronautical.org/sites/default/files/vonbraun/2008/Von_Braun_Symposium_2008-10-21_2d_Dorris.pdf\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-10-23T15:53:08Z","Content":"\n\u003Cp\u003EOkay. I was going to ask about the outpost version, if it was going to be okay for it to lack an ascent stage; as that\u0027s what you\u0027re doing and it\u0027s your challenge, I\u0027ll assume I\u0027m good.\u003C/p\u003E\u003Cp\u003ENow to build something for that nine-tonne monstrosity of a rover I\u0027ve built.\u003C/p\u003E\u003Cp\u003ENo, I\u0027m not kidding (and the real kicker is that it only seats two).\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-23T17:50:49Z","Content":"\n\u003Cp\u003ENow that the U.S. government has turned on the NASA web resources, I\u0027ve seen a version of the Outpost Variant that \u003Cem\u003Edoes\u003C/em\u003E include an ascent stage. However, there is this image which clearly does not have an ascent stage:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Entering_a_Lunar_Outpost.jpg/320px-Entering_a_Lunar_Outpost.jpg\u0022 alt=\u0022320px-Entering_a_Lunar_Outpost.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo, I\u0027ve made a very small tweak to the challenge parameters for the outpost version to include option for ascent stage. No points difference for either:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOutpost Variant: Develop a version of the Altair that can land robotically and has enough room for 1.5 times your Altair landing crew size (round up). Eg. If your Altair lander seats 4, the Outpost Variant should have pressurized seats for 6. If your Altair lander seats 5, your Outpost Variant should seat 8. The Outpost Variant can have, \u003Cem\u003Ebut does not require\u003C/em\u003E, the ability to return from Munar surface. (\u002B2)\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-23T18:45:45Z\u0022 title=\u002210/23/2013 06:45  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 23, 2013\u003C/time\u003E by Death Engineering\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-24T19:12:00Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/xxJEPDll.png\u0022 alt=\u0022xxJEPDll.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKonstellation Space Program Update\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAfter doing remote checks of the Altair Oupost Variant and the rovers which were recently delivered to the Mun\u0027s south pole, four crew aboard an Orion 5 docked with an Altair lander in a Kerbin polar orbit. The crew successfully landed their Altair in the crater on the Mun\u0027s south pole, 40m from the Outpost variant. The crew checked out the new pressurized rovers and started looking for places where the crater wall isn\u0027t too steep to climb, commencing the south pole exploration program.\u003C/p\u003E\u003Cp\u003EIn Duna news, the Duna Return Vehicle is ready and will be leaving for Duna soon. The crew will depart several days later using an Orion 5 and Altair Duna Lander and will arrive at Duna several weeks after the return vehicle has landed, giving the crew enough time to decide whether a Duna landing mission will be possible. If the Duna Return Vehicle checks out after landing, the crew will alter their course from a Duna flyby to a landing. \u003C/p\u003E\u003Cp\u003EIn the next update, the Mun program will be expanded in both outpost locations to include backup return vehicles and rovers to the first outpost location. Also, a new space telescope will be launched to Kerbol synchronous orbit. But the biggest news will be the launches of the first crewed Duna landing mission using the Duna Altair Oupost and Duna Return Vehicle.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/zLFp4\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"Bioman222","CreatedById":30364,"CreatedDateTime":"2013-10-27T07:16:28Z","Content":"\n\u003Cp\u003EBSMC got their Ares V tested and running. Expect Mun mission soon. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/CwlCF\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EPoints: 8 (in this mission)\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-27T07:20:35Z\u0022 title=\u002210/27/2013 07:20  AM\u0022 data-short=\u002210 yr\u0022\u003EOctober 27, 2013\u003C/time\u003E by Bioman222\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-27T12:21:57Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bioman222\u0022 data-cite=\u0022Bioman222\u0022\u003E\u003Cdiv\u003EBSMC got their Ares V tested and running. Expect Mun mission soon. \u003Cp\u003EPoints: 8 (in this mission)\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks for the update. Looking forward to seeing more.\u003C/p\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-10-28T16:10:42Z","Content":"\n\u003Cp\u003EAlright - here\u0027s the latest from Crapsack Skunkworks: introducing the Katapugon 7 MÃƒÂ¼nar/Dunar combination lander. Ship\u0027s intended to go both MÃƒÂ¼n and Duna, so I\u0027m claiming points for both here.\u003C/p\u003E\u003Cp\u003EDespite all the screenshots I took, I never did get one of the Gravioli detector on the descent stage, so I won\u0027t claim the science points just yet.\u003C/p\u003E\u003Cp\u003EAnyway, part 4 of my entry in this challenge:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/GAfWA\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe scoring rules have changed for the Duna lander - the one I\u0027ve got highlighted in orange below is in question. Did this set of tests do enough to satisfy at least an orbital test of the lander? I\u0027m assuming it was insufficient to prove a landing, so I\u0027m not claiming the points right now.\u003C/p\u003E\u003Cp\u003EPREVIOUS SCORES: Design 34, Mission 10\u003C/p\u003E\u003Cp\u003ENEW POINTS CLAIMED: Design \u002B25 (59), Mission \u002B5 (15)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAll Points Previously Achieved in the Following Categories\u003C/span\u003E:\u003C/p\u003E\u003Cp\u003EHeavy Cargo Lift Vehicle (Thanatos Heavy 7)\u003C/p\u003E\u003Cp\u003ECrew Vehicle (Scorpio 7)\u003C/p\u003E\u003Cp\u003ESpace Station - Scorpio/Thanatos\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ECrew Launch Vehicle (Thanatos 7)\u003C/span\u003E: \u002B2 pts\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003ECan carry Orion Block 2 to low orbit without using any fuel from the Orion service module (\u002B2)\u003C/span\u003E \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMunar Lander (Katapugon 7 Series)\u003C/span\u003E: \u002B12 pts\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003ESupports 4 crew (\u002B4)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EEach crew over 4, up to 6 crew maximum (\u002B1 each; max \u002B2)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003ECan perform un-Kerballed landings without the use of an Orion spacecraft (Altair and EDS launched on Ares V) (\u002B1)\u003C/p\u003E\u003Cp\u003ECan perform Munar orbit insertion from Kerbin-Mun trajectory for both an Altair and and Orion capsule (either Block I or II) without using any Orion fuel (\u002B2)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003E2 stage lander with separate ascent stage (descent stage stays on Munar surface) (\u002B2)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003ERover bonus: Can deploy at least one rover with seats for at least half (round up) of the lander crew (\u002B3)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EAddition rover: Can deploy a second rover (same or different than first rover) (\u002B1)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EPressurized rover: Develop a rover that can seat at least two crew in a pressurized pod. This rover can be delivered with a crewed or uncrewed Altair lander, an Outpost Variant lander or a specialized Cargo Altair that brings only the rover (\u002B2)\u003C/p\u003E\u003Cp\u003EOutpost Variant: Develop a version of the Altair that can land robotically and has enough room for 1.5 times your Altair landing crew size (round up). Eg. If your Altair lander seats 4, the Outpost Variant should have pressurized seats for 6. If your Altair lander seats 5, your Outpost Variant should seat 8. The Outpost Variant can have, but does not require, the ability to return from Munar surface. (\u002B2)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EDuna Lander (Katapugon 7 Series)\u003C/span\u003E: \u002B11 pts.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003ELander supports 4 crew (\u002B4)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EKerbin Return Vehicle capable of Kerbin return with either direct ascent to Kerbin or Duna Orbit Rendezvous with Kerbin return stage (\u002B3)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003ERover bonus: Bring at least one rover with seats for at least half (round up) of the lander crew (\u002B3)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EAddition rover: Bring a second rover (same or different than first rover) (\u002B1)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EDevelop a rover that can seat at least two crew in a pressurized pod. This rover can be delivered with either the Kerbin Return Vehicle or the Duna lander (\u002B2)\u003C/p\u003E\u003Cp\u003EOutpost Variant: Develop the Duna lander to remain on Duna as a permanent outpost. The Duna landing mission should include pressurized seats for 1.5 times your crew size (round up). Eg. If your Duna lander seats 4, the Outpost Variant should have pressurized seats for 6. If your Duna lander seats 5, your Outpost Variant should seat 8 (\u002B2)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ER\u0026amp;D:\u003C/span\u003E \u002B5 pts (\u002B8?)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EPerform a LKO test of an Altair Munar lander. With at least one Kerbal on board, fly an Altair Munar lander at least 100km away from the Orion spacecraft. Dispose of the descent stage, then fly the ascent stage back to the Orion. Transfer the crew to the Orion then robotically control the ascent stage into a re-entry orbit (\u002B3)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EPerform the above Altair test in Munar orbit using EOR mission (\u002B1)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EUsing an un-Kerballed Duna lander and an EDS on Ares V, perform a high-speed re-entry from at least 15,000km Ap. (\u002B2)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FFA500;\u0022\u003ELaunch an un-Kerballed Duna lander on Ares V into low orbit. Perform an orbital test and descent of the lander (crewed or uncrewed) (\u002B3)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EUse an Ares I in at least one Munar mission (flyby, orbital or landing) (\u002B1)\u003C/p\u003E\u003Cp\u003EUse an Ares I in at least one Duna mission (flyby or landing) (\u002B1)\u003C/p\u003E\u003Cp\u003EUse an Ares V in at least one Munar mission (orbital or landing) (\u002B2)\u003C/p\u003E\u003Cp\u003EUse an Ares V in at least one Duna mission (flyby or landing) (\u002B2)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMun - Scorpio/Thantatos/Thantatos Heavy/Katapugon\u003C/span\u003E: \u002B0 pts\u003C/p\u003E\u003Cp\u003ELand an un-Kerballed Altair on the Mun without the use of an Orion spacecraft (EDS and Altair only launched from Ares V) (\u002B2)\u003C/p\u003E\u003Cp\u003EDemonstrate that your Altair can, on its own, brake the Orion and Altair into Mun orbit and perform a polar landing (\u002B2)\u003C/p\u003E\u003Cp\u003ELand at least 4 Kerbals in an Altair on the Mun within 1km of either above Altair (\u002B3)\u003C/p\u003E\u003Cp\u003EReturn four Kerbals from a Munar landing to Kerbin (\u002B2)\u003C/p\u003E\u003Cp\u003EMunar Outpost: Using at least one crewed Altair lander, an Outpost Variant and a pressurized rover set up a Munar Outpost. The Outpost Variant can join a crewed Altair already on the Mun or can be part of a separate Altair/Outpost Variant mission to another location. The Altair and Outpost Variant need to be within 100m of each other. (\u002B5)\u003C/p\u003E\u003Cp\u003ENo other mission objectives completed to date.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-29T02:27:20Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022capi3101\u0022 data-cite=\u0022capi3101\u0022\u003E\u003Cdiv\u003EThe scoring rules have changed for the Duna lander - the one I\u0027ve got highlighted in orange below is in question. Did this set of tests do enough to satisfy at least an orbital test of the lander? I\u0027m assuming it was insufficient to prove a landing, so I\u0027m not claiming the points right now.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYour test was pretty much how it should go, so points are earned for the lander test. Were those included in your tally? Cool looking lander!\u003C/p\u003E\n"},{"CreatedByName":"Istas","CreatedById":2984,"CreatedDateTime":"2013-10-29T03:08:28Z","Content":"\n\u003Cp\u003EGood Enough Engineering is proud to announce its foray into Kerbaled spaceflight. Its research department for this endeavor, World-class High-tech Interplanetary Sciences, is hard at work researching and planning the first stages of this historical undertaking. GEE has no comment on the rumors of tests involving a gigantic slingshot. Details will be forthcoming in future press releases.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-10-29T06:39:52Z","Content":"\n\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/mprm9XAl.png\u0022 alt=\u0022mprm9XAl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKonstellation Space Program Update\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThe Duna landing mission has been successfully completed! The Duna Surface Return Vehicle and the crew of four were launched to Duna on separate Ares V launches. Once the Surface Return Vehicle was successfully landed on Duna and put into a quiescent mode, the landing crew made their final course correction to commit to Duna aerocapture. The landing crew in the Duna Altair variant made several mid-altitude passes through Duna\u0027s atmosphere to establish a satisfactory orbit to permit a landing. \u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/1eZJuMfl.png\u0022 alt=\u00221eZJuMfl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003ECombining a long, low-thrust deorbit burn and staged parachute deployment, the Duna landing crew set down less then 70m from their return vehicle. With pictures taken and pockets full of Duna dirt, the crew lifted off in the return vehicle and headed back to Kerbin. Sixty-four days later, the crew successfully landed on Kerbin. The Duna outpost will remain powered until the next crew arrives aboard a modified Duna return vehicle.\u003C/p\u003E\u003Cp\u003EIn astronomy news, the space telescope was launched to LKO. Four orbits with short burns have placed the telescope into a Kerbol orbit. The window to use Eve as an aerobrake to Kerbol synchronous orbital altitude comes up in 92 days.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/7XxIO\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-10-29T14:01:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Death Engineering\u0022 data-cite=\u0022Death Engineering\u0022\u003E\u003Cdiv\u003EYour test was pretty much how it should go, so points are earned for the lander test. Were those included in your tally? Cool looking lander!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI did not include those test points in my tally, but I have the next portion of my entry ready to go, so I\u0027ll just add them in there. Speaking of...\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/loJqJ\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EPretty much just did the test flight around MÃƒÂ¼n. I\u0027ve discovered a design flaw with the lander that I will be fixing before the next mission - odd, because I could\u0027ve sworn I added a Gravioli Detector to the descent stage at some point. I\u0027ll also claim the points for an Ares I and Ares V used in a MÃƒÂ¼nar mission at this point, since I sent both a Scorpio and Katapugon to MÃƒÂ¼nar orbit. Not much left to do now with R\u0026amp;D.\u003C/p\u003E\u003Cp\u003EEDIT: Never mind on the science; I remember having some discussion of removing it entirely and I see that it\u0027s not on the scoring chart in the first post anymore. I really need to update my hardcopy, it seems. \u003C/p\u003E\u003Cp\u003EEDIT EDIT: Okay, I see them now; they\u0027ve been pulled out into their own category. So never mind on the never mind. I\u0027ll be quiet now. \u003C/p\u003E\u003Cp\u003EGlad you liked the lander design, BTW. I\u0027m just glad somebody mentioned that I-beam trick to me a couple of weeks ago...\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPREVIOUS SCORES\u003C/strong\u003E: Design 59, Mission 15\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ENEW POINTS CLAIMED\u003C/strong\u003E: Design \u002B0 (59), Mission \u002B7 (22)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EAll Points Previously Achieved in the Following Categories\u003C/span\u003E:\u003C/p\u003E\u003Cp\u003ECrew Launch Vehicle (Thanatos 7)\u003C/p\u003E\u003Cp\u003EHeavy Cargo Lift Vehicle (Thanatos Heavy 7)\u003C/p\u003E\u003Cp\u003ECrew Vehicle (Scorpio 7)\u003C/p\u003E\u003Cp\u003ESpace Station - Scorpio/Thanatos\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMunar Lander (Katapugon 7 Series)\u003C/span\u003E: \u002B0 pts\u003C/p\u003E\u003Cp\u003ECan perform un-Kerballed landings without the use of an Orion spacecraft (Altair and EDS launched on Ares V) (\u002B1)\u003C/p\u003E\u003Cp\u003ECan perform Munar orbit insertion from Kerbin-Mun trajectory for both an Altair and and Orion capsule (either Block I or II) without using any Orion fuel (\u002B2)\u003C/p\u003E\u003Cp\u003EPressurized rover: Develop a rover that can seat at least two crew in a pressurized pod. This rover can be delivered with a crewed or uncrewed Altair lander, an Outpost Variant lander or a specialized Cargo Altair that brings only the rover (\u002B2)\u003C/p\u003E\u003Cp\u003EOutpost Variant: Develop a version of the Altair that can land robotically and has enough room for 1.5 times your Altair landing crew size (round up). Eg. If your Altair lander seats 4, the Outpost Variant should have pressurized seats for 6. If your Altair lander seats 5, your Outpost Variant should seat 8. The Outpost Variant can have, but does not require, the ability to return from Munar surface. (\u002B2)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EDuna Lander (Katapugon 7 Series)\u003C/span\u003E: \u002B0 pts.\u003C/p\u003E\u003Cp\u003EDevelop a rover that can seat at least two crew in a pressurized pod. This rover can be delivered with either the Kerbin Return Vehicle or the Duna lander (\u002B2)\u003C/p\u003E\u003Cp\u003EOutpost Variant: Develop the Duna lander to remain on Duna as a permanent outpost. The Duna landing mission should include pressurized seats for 1.5 times your crew size (round up). Eg. If your Duna lander seats 4, the Outpost Variant should have pressurized seats for 6. If your Duna lander seats 5, your Outpost Variant should seat 8 (\u002B2)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ER\u0026amp;D:\u003C/span\u003E \u002B7 pts \u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EPerform the above Altair test in Munar orbit using EOR mission (\u002B1)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003ELaunch an un-Kerballed Duna lander on Ares V into low orbit. Perform an orbital test and descent of the lander (crewed or uncrewed) (\u002B3)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EUse an Ares I in at least one Munar mission (flyby, orbital or landing) (\u002B1)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EUse an Ares I in at least one Duna mission (flyby or landing) (\u002B1)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#00FF00;\u0022\u003EUse an Ares V in at least one Munar mission (orbital or landing) (\u002B2)\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EUse an Ares V in at least one Duna mission (flyby or landing) (\u002B2)\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EMun - Scorpio/Thantatos/Thantatos Heavy/Katapugon\u003C/span\u003E: \u002B0 pts\u003C/p\u003E\u003Cp\u003ELand an un-Kerballed Altair on the Mun without the use of an Orion spacecraft (EDS and Altair only launched from Ares V) (\u002B2)\u003C/p\u003E\u003Cp\u003EDemonstrate that your Altair can, on its own, brake the Orion and Altair into Mun orbit and perform a polar landing (\u002B2)\u003C/p\u003E\u003Cp\u003ELand at least 4 Kerbals in an Altair on the Mun within 1km of either above Altair (\u002B3)\u003C/p\u003E\u003Cp\u003EReturn four Kerbals from a Munar landing to Kerbin (\u002B2)\u003C/p\u003E\u003Cp\u003EMunar Outpost: Using at least one crewed Altair lander, an Outpost Variant and a pressurized rover set up a Munar Outpost. The Outpost Variant can join a crewed Altair already on the Mun or can be part of a separate Altair/Outpost Variant mission to another location. The Altair and Outpost Variant need to be within 100m of each other. (\u002B5)\u003C/p\u003E\u003Cp\u003ENo other mission objectives completed to date.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T14:35:23Z\u0022 title=\u002210/29/2013 02:35  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"capi3101","CreatedById":59027,"CreatedDateTime":"2013-10-29T16:30:56Z","Content":"\n\u003Cp\u003EPoint of clarification: On this scoring rule - Land at least 4 Kerbals in an Altair on the Mun within 1km of either above Altair - I\u0027m a bit confused. I see that I\u0027m supposed to land an un-Kerballed lander on the Mun by itself. I then see that there\u0027s supposed to be a mission where the Altair brakes itself and an Orion into Mun orbit and performs a polar landing. The way it reads (or at least the way I\u0027m reading that) is that in order to get the points for landing the Kerbals, it\u0027ll be necessary for me to A) land the un-Kerballed Altair somewhere close to the pole and \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E park the other one close by. Is that essentially correct, or can I A) put the un-Kerballed lander where I please, \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_cool.png\u0022 alt=\u0022B)\u0022\u003E brake the Orion into orbit, undock the lander un-kerballed and land it near the pole, and then C) send yet another lander to rendezvous with the Orion in MÃƒÂ¼nar orbit and land it next to either one of the first two?\u003C/p\u003E\u003Cp\u003EMainly just trying to plan out my remaining missions here. I still haven\u0027t figured out how I\u0027m going to get that monster of a rover anywhere (especially since I can use a Cargo Altair to get it to the MÃƒÂ¼n, but it looks like for the Duna mission it\u0027ll have to tag along with one of the other landers with the way the rules are written).\u003C/p\u003E\u003Cp\u003EHow close to the pole do I need to be?\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-10-29T16:32:57Z\u0022 title=\u002210/29/2013 04:32  PM\u0022 data-short=\u002210 yr\u0022\u003EOctober 29, 2013\u003C/time\u003E by capi3101\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Istas","CreatedById":2984,"CreatedDateTime":"2013-10-29T18:51:11Z","Content":"\n\u003Cp\u003EAre the EDS and the second stage of the Ares V identical?\u003C/p\u003E\u003Cp\u003EWhen it says \u0022\u003Cspan style=\u0022color:#333333;\u0022\u003ECan carry the Earth Departure Stage (EDS) and Orion BLock 1 to low orbit without using any fuel from the EDS\u0022, \u0022\u003C/span\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EAltair and EDS launched on Ares V\u0022, and \u0022\u003C/span\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003EUsing an Ares V and EDS\u0022\u003C/span\u003E\u003Cspan style=\u0022color:#333333;\u0022\u003E, does that mean launching a second EDS atop the one already included in the Ares V? (so Ares V boosters, first stage, second stage (EDS), and then another EDS)?\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n"}]}