{"TopicId":5063,"ForumId":25,"TopicTitle":"The Farside Mission: Operation Huge Freaking Permanent Munar Base","CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-02T21:04:05Z","PageNum":1,"Articles":[{"CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-02T21:04:05Z","Content":"\n\u003Cp\u003EBuckle up, folks. I\\\u0027m gonna show you guys how I roll. It\\\u0027s a long ride, so get comfy. Maybe make yourself a snack.\u003C/p\u003E\u003Cp\u003EOriginally, Operaration HFPMB was a modest proposal, intending to launch an unmanned, half-meter ball that beeped over ham radio. However, top KSP engineers soon fixed that. The Beep-Ball Manufacture and Engineering team requested that a manned command module be included, so that the frequency could be manually set before release. This of course required the addition of several other modules, so that the intrepid kerbalnaughts could breathe, stay warm, play regulation-size ping-pong, etc. This of course required ever-greater lift capacity. Of course, whenever the booster engineers built a new rocket, they inevitably added too much thrust, causing the rocket to tear itself apart from acceleration. Rather than forcing a redesign, more payload mass was added, inevitably in excess. This process cycled for several iterations until the road-sides were spotless, all across the nation.\u003C/p\u003E\u003Cp\u003EThe final mission goals were:\u003C/p\u003E\u003Cp\u003E(1) Establish a permanent communications satellite in planetary orbit. The NearEar Communications Relay would act as a radio relay for transmissions from the other modules.\u003C/p\u003E\u003Cp\u003E(2) Establish a permanent space station in low munar orbit. Lowball Station included a space telescope, a solar array, a communications module, and an return/escape vehicle, as well as a large central service/habitation module.\u003C/p\u003E\u003Cp\u003E(3) Establish a massive, permanent base on the munar surface. Nobody was sure exactly what they would do once they got there, but everyone agreed that they were sure to think of something. Thus, they brought along every possible module and tool they could fit on top of the rocket. A radar dish, a huge solar array, a full set of left- and right-handed milspec can-openers, test tubes, various chemicals (many of which were labelled). The list went on. After all, one never knew what sort of brilliant Science(!) they might be able to get up to, on the far side of the moon.\u003C/p\u003E\u003Cp\u003E(4) Send a small command module back home with soil samples, instrument readings, exotic alien servant-girls, and/or whatever else of interest that they might come across.\u003C/p\u003E\u003Cp\u003EMission Log:\u003C/p\u003E\u003Cp\u003E-Launch! The first stage used 8x full-length 3m tanks, and 4x massive rockets. It handled about as well as a tank made of rubber bands. If you touched the sas button or fired the RCS, it instantly tore itself to shreds. A very touchy beast indeed.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/gfw9F.jpg\u0022 alt=\u0022gfw9F.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe first stage cut out at aroung 45km. The burn was a little suboptimal, since the ship would snap in half if I tilted before I released stage 1, so I had to go straight up.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/dJCcK.jpg\u0022 alt=\u0022dJCcK.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe 2nd stage was a set of 4 solid rocket boosters. Jeb enjoyed this part tremendously. I had to focus to keep it from spinning out, so I didn\\\u0027t get a screen shot of the burn. But it didn\\\u0027t last long anyhow. Release:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/gTTTi.jpg\u0022 alt=\u0022gTTTi.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/6aC1b.jpg\u0022 alt=\u00226aC1b.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EStage 3 was a set of 5 high-efficiency, low-thrust liquid engines running off a single full-length 3m tank. Jeb sulked the whole time.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Xq7xc.jpg\u0022 alt=\u0022Xq7xc.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis brought me to stable orbit. 159km/103km apogee/perigee. T\u002B13 minutes.\u003C/p\u003E\u003Cp\u003ELet\\\u0027s take a look at the ship:\u003C/p\u003E\u003Cp\u003EMein gott . . . how the heck did I get this into orbit?\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/0Efoz.jpg\u0022 alt=\u00220Efoz.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u0027How many solar panels do you think we\\\u0027ll need?\u0027 \u0027Dunno. How many ya got?\u0027\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/6vSMM.jpg\u0022 alt=\u00226vSMM.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESunset. Probably should have packed some batteries too . . . \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/E4gGe.jpg\u0022 alt=\u0022E4gGe.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EStage 3 release.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/EhZl1.jpg\u0022 alt=\u0022EhZl1.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/KZbLO.jpg\u0022 alt=\u0022KZbLO.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAll that\\\u0027s left are the three long-term modules: The NearEar Communications Relay, Lowball Space Station, and Farside MunBase.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/LftIR.jpg\u0022 alt=\u0022LftIR.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ENEC Relay has been released.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/sjY6y.jpg\u0022 alt=\u0022sjY6y.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMy luckiest shot of the series: You can see the NEC relay drifting away, the Mun in the background to the left, Kerbal below, and in the distant background, the discarded Stage III booster.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/iM0yv.png\u0022 alt=\u0022iM0yv.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnother shot of the NEC relay, drifting away.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/G83VS.jpg\u0022 alt=\u0022G83VS.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOkay! Now all that\\\u0027s left is Lowball and Farside. Let\\\u0027s take a look at lowball.\u003C/p\u003E\u003Cp\u003EThe Comms module, with a parabolic dish for transmitting messages to the NearEar. While other space programs might claim that a huge dish isn\\\u0027t strictly necessary for communicating over such short distances, the KSP\\\u0027s official best-practices specifications require that all kerbalnauts have access to full-HD television at all times; therefore, such additional equipment is considered vital to mission success.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/oMKBO.jpg\u0022 alt=\u0022oMKBO.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe FWtSHtF C/EEV. Despite rumors to the contrary, a spokeskerbin for the Kerbal Space Program has assured the media at a recent press conference that the official title of this module is the \u0027For When the \u003Cem\u003E\u003Cstrong\u003EStuff\u003C/strong\u003E\u003C/em\u003E Hits the Fan Command / Emergency Escape Vehicle\u0027. After a visit from the FCC concerning a few unfortunate live, on-air comments by Jeb, the kerbalnaughts were sternly ordered to refer to it by it\\\u0027s full official title. Since then, they have begun referring to it as the \u0027R-LAV\u0027, or \u0027Really-Long Acronym Vehicle\u0027.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/bH5Rq.jpg\u0022 alt=\u0022bH5Rq.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EKinda hard to see, but there\\\u0027s a space telescope on there. During the trip to the mun, an inter-module game of Eye-Spy was cut short amid accusations that the commander of the Lowball was cheating by discovering and naming new stars. A subsequent ruling by NESA (national eye spy association) determined that this was \u0027technically legal, but highly unsportsmanlike\u0027.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/yrlMO.jpg\u0022 alt=\u0022yrlMO.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ELowball Station\\\u0027s Solar Array and Utility Module provides power, as well as maintaining various life-support subsystems.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/bcG4v.jpg\u0022 alt=\u0022bcG4v.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESunrise.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/LpuRC.jpg\u0022 alt=\u0022LpuRC.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EScaled to kerbin, Lowball \u002B Farside have more living space than MIR, plus several times that much volume in engines and fuel tanks.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Yb6Wk.jpg\u0022 alt=\u0022Yb6Wk.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EDestination: Mun.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Ac1uV.jpg\u0022 alt=\u0022Ac1uV.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EApogee, after the first perigee burn. Bill heard somewhere that the best way to get into a transfer orbit with a weak but efficient engine was to burn at perigee. So I did that.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/u1zWd.jpg\u0022 alt=\u0022u1zWd.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAfter the 2nd perigee burn, I was in an equatorial transfer orbit. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/rE0bo.jpg\u0022 alt=\u0022rE0bo.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EIt took a few swings round, but eventually got captured by Munar gravity. Then I had to wait until sunrise over my Landing Zone, an equatorial crater on the far side. Sunrise, at last:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/kspww.png\u0022 alt=\u0022kspww.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMade my way into orbit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/grYRV.jpg\u0022 alt=\u0022grYRV.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/1EiUv.png\u0022 alt=\u00221EiUv.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/3UNRJ.jpg\u0022 alt=\u00223UNRJ.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EReleased Lowball Space Station in a low orbit over the mun. (Approx) Apogee: 10km, Perigee: 5km. In hindsight, I should have written the exact numbers down.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/xuTaF.png\u0022 alt=\u0022xuTaF.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESo long, suckers!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/QlFcO.png\u0022 alt=\u0022QlFcO.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFarside MunBase, with Lowball Space Station receding in the background.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/1iDjR.jpg\u0022 alt=\u00221iDjR.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/avkqP.png\u0022 alt=\u0022avkqP.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Q5WqB.png\u0022 alt=\u0022Q5WqB.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ELowball Station, with Farside Base in the background:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/kxqjy.png\u0022 alt=\u0022kxqjy.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/vodZC.png\u0022 alt=\u0022vodZC.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/TRyxG.png\u0022 alt=\u0022TRyxG.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ELet\\\u0027s take a closer look at Farside Base:\u003C/p\u003E\u003Cp\u003EThe central fuel tank is where most of the fuel is stored. Fuel lines link it up to the four engines.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/t5lH7.jpg\u0022 alt=\u0022t5lH7.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/ie5Ox.jpg\u0022 alt=\u0022ie5Ox.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/dyK9i.png\u0022 alt=\u0022dyK9i.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EGoodbye, Kerbal! We\\\u0027ll miss you!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/GyPNb.png\u0022 alt=\u0022GyPNb.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ECrater ho!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/c8myS.jpg\u0022 alt=\u0022c8myS.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EShedding all that nasty orbital velocity. I actually almost got hit by Lowball right after this pic was taken. Didn\\\u0027t react fast enough to get a pic though.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/PNPcL.jpg\u0022 alt=\u0022PNPcL.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EBeginning descent. I was really nervous now. I\\\u0027d already spent 30-60 minutes on this and had had incredible luck, so I was terrified that I\\\u0027d crash, or KSP would crash, or the power would go out, or something . . . \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/tzCug.jpg\u0022 alt=\u0022tzCug.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI always turned off the engines before I took a pic, because it was more stable with the engines off. I was afraid my pic-taking would be the death of me.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/fDgxE.jpg\u0022 alt=\u0022fDgxE.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/6UEot.jpg\u0022 alt=\u00226UEot.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EFarside Base has landed! PIC \u003Cstrong\u003EALL\u003C/strong\u003E OF THE THINGS!!!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/4aVki.jpg\u0022 alt=\u00224aVki.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe Comms module sends and receives radio transmissions and quality HD-TV programming, relayed from Kerbal to the NEC Relay to Lowball Station to (finally) down here on Farside Base.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/cZskC.jpg\u0022 alt=\u0022cZskC.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/XVPpB.jpg\u0022 alt=\u0022XVPpB.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe sunroom has nice big windows so the Kerbinaughts can get some sun. Someone pointed out that the sun is horribly radioactive without miles of protective atmosphere. Thus, they built the solar array on top, to provide the sunroom with nice, non-carcinogenic shade.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/WIYye.jpg\u0022 alt=\u0022WIYye.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe Sensor/Science/Service module has a Big Ol Radar Dish, for potentially detecting hostile UFO\\\u0027s and azure-skinned alien nymphomaniac pleasure barges. \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/EPzMB.jpg\u0022 alt=\u0022EPzMB.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/WPVgm.jpg\u0022 alt=\u0022WPVgm.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ERED ALERT: THERE IS SUN IN THE SUNROOM! THIS IS NOT A DRILL!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/hLYFZ.jpg\u0022 alt=\u0022hLYFZ.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThe auxilery solar tower / utility module performs basic life support functions, as well as containing the Military-Grade Zero-G Poop Disposal Unit.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/L84Kk.jpg\u0022 alt=\u0022L84Kk.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EOther misc shots: By my estimate, there\\\u0027s a kerbal-scale equivalent to around 200 cubic meters of living space. Most of the living quarters are converted fuel tanks with windows installed, or converted command modules stolen from other, less-well-funded projects. The crew complement is somewhere between 6 to 8 kerbonaughts, though it can support a full dozen if people are prepared to double bunk.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/2jRoF.jpg\u0022 alt=\u00222jRoF.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/LhZ0Q.jpg\u0022 alt=\u0022LhZ0Q.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/8EV87.jpg\u0022 alt=\u00228EV87.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/XsPYd.jpg\u0022 alt=\u0022XsPYd.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/ImKl8.jpg\u0022 alt=\u0022ImKl8.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI actually did 2 successful runs of this mission. In both, I tried to calculate the lowball\\\u0027s orbit and get a sight of it from farside base. Both times, I failed to spot it. I dunno if it was too far up (5-7km, approx), or moving too fast, or if I miscalculated the orbit, or if I blinked, or what. The only time I sighted it after losing sight was that one time it almost hit me, and that was while I was still mostly in orbit with it.\u003C/p\u003E\u003Cp\u003EAfter they ran out of sandwiches, Jeb, Bill, and Bob decided to abandon their Mun-Base friends and return home. The Return Vehicle was really touchy, so I didn\\\u0027t get many shots of it in flight. I really wish I had gotten a shot of Farside from above.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/daZ0F.jpg\u0022 alt=\u0022daZ0F.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EMunar orbit. If I did the math right, then lowball should be far enough around the horizon that they can relay Jeb, bill, and Bob their HD-TV from the NEC Relay.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/cUgD7.png\u0022 alt=\u0022cUgD7.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EPretty big return vehicle. I brought a ton of extra fuel, hoping to meet back up with lowball. No such luck, so I just went home with extra fuel.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/Ug19t.jpg\u0022 alt=\u0022Ug19t.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/geZYr.jpg\u0022 alt=\u0022geZYr.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/rjYLP.png\u0022 alt=\u0022rjYLP.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EHello, old friend.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/z6tcO.png\u0022 alt=\u0022z6tcO.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/jVxNN.png\u0022 alt=\u0022jVxNN.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI actually entered atmo twice. The first time was over land, so I rocketed back out and did some corrections from orbit. I didn\\\u0027t want to take any chances, at this point.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/5xMqF.jpg\u0022 alt=\u00225xMqF.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EThis looks like as good a spot as any. Lots of splashy blue goodness, all around. Someone should probably call mission control and see if they can get a boat coming our way.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/lzYbt.png\u0022 alt=\u0022lzYbt.png\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EExtra rocket stage, which might have been necessary if I had burned a bunch of fuel trying to link up with lowball. As it was: pointless.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/2ii7E.jpg\u0022 alt=\u00222ii7E.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/fRzIL.jpg\u0022 alt=\u0022fRzIL.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ECommand Module, coming in hot. My velocity was really high at this point. Was beginning to worry that I had hit the chute too late.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/dfDbt.jpg\u0022 alt=\u0022dfDbt.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EStill moving pretty fast, but decelerating faster . . . . . \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/gYQjP.jpg\u0022 alt=\u0022gYQjP.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ESplash, not boom. MISSION SUCCESSFUL!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote\u003E\u003Cimg src=\u0022http://i.imgur.com/F0Ppf.jpg\u0022 alt=\u0022F0Ppf.jpg\u0022\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EWOO HOO!\u003C/p\u003E\n"},{"CreatedByName":"White Owl","CreatedById":10849,"CreatedDateTime":"2012-01-02T22:56:44Z","Content":"\n\u003Cp\u003EI think you won.\u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2012-01-02T23:37:58Z","Content":"\n\u003Cp\u003EVeto Aerospace is going to have to find a new CEO. Again. Though this time its because he was disheartened by the successes of another space program\\\u0027s work, rather than having messed something up and subsequently being shot from a \u003Cem\u003EPredator\u003C/em\u003E at in incoming missile.\u003C/p\u003E\n"},{"CreatedByName":"Tim_Barrett","CreatedById":3206,"CreatedDateTime":"2012-01-03T01:36:15Z","Content":"\n\u003Cp\u003EI think we have witnessed the birth of the god(dess?) of assymetry...\u003C/p\u003E\n"},{"CreatedByName":"NovaSilisko","CreatedById":3897,"CreatedDateTime":"2012-01-03T02:17:02Z","Content":"\n\u003Cp\u003EUnfortunately, tinypic doesn\\\u0027t work for me, and I can\\\u0027t view any of these pictures :C\u003C/p\u003E\u003Cp\u003EProxy away!\u003C/p\u003E\u003Cp\u003EEdit:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://img405.imageshack.us/img405/9787/ss20120102211958.png\u0022 alt=\u0022ss20120102211958.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-03T03:40:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EI think we have witnessed the birth of the god(dess?) of assymetry...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESymmetry is for people who have downloaded an insufficient number of parts! Death before the symmetry button! Viva la AsimetrÃ­a!\u003C/p\u003E\u003Cp\u003EPS. I am male.\u003C/p\u003E\n"},{"CreatedByName":"Switchblade88","CreatedById":11373,"CreatedDateTime":"2012-01-03T06:51:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022gabyalufix\u0022 data-cite=\u0022gabyalufix\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EViva la AsimetrÃ­a!\u003C/p\u003E\u003Cp\u003EPS. I am male.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, yeah, we can all see that your entire project ran purely on Jeb\\\u0027s TESTOSTERONE instead on rocket fuel:\u003C/p\u003E\u003Cp\u003E\u003Cem\u003E\u0027I also nick named my testes - my left one is James Westfall and my right one is Doctor Kenneth Noisewater.\u0027\u003C/em\u003E 8)\u003C/p\u003E\u003Cp\u003EGlad to see you finally made it without crashing (your PC)! \u003C/p\u003E\u003Cp\u003EAnd where\\\u0027d you get the parts for the \\\u0027non-command\\\u0027 modules - or did you cfg edit yourself?\u003C/p\u003E\n"},{"CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-03T07:01:40Z","Content":"\n\u003Cp\u003EYeah. I just took all the command modules and copy-pasted them up, changed the configs so they\\\u0027re \u0027Struts\u0027. I missed being able to stick command modules wherever I feel like it.\u003C/p\u003E\n"},{"CreatedByName":"Switchblade88","CreatedById":11373,"CreatedDateTime":"2012-01-03T07:41:17Z","Content":"\n\u003Cp\u003EThat\\\u0027s a good idea there, actually; if the need arises I might yet look into that.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-01-03T08:07:44Z","Content":"\n\u003Cp\u003EI am speacheless. So I better get building.\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-01-03T09:43:54Z","Content":"\n\u003Cp\u003ESpeaking of horrendously huge space stations, I got this:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i548.photobucket.com/albums/ii353/eL_pAmBaTo25/KSP2011-10-1212-11-39-62.jpg\u0022 alt=\u0022KSP2011-10-1212-11-39-62.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd it \u003Cstrong\u003E\u003Cem\u003Edid not\u003C/em\u003E\u003C/strong\u003E attained orbit. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso,\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://d37nnnqwv9amwr.cloudfront.net/photos/images/newsfeed/000/210/403/OhCrap.png?1322723607\u0022 alt=\u0022OhCrap.png?1322723607\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"N3X15","CreatedById":12073,"CreatedDateTime":"2012-01-03T11:55:47Z","Content":"\n\u003Cp\u003EAnd a million engineers had nightmares ever after.\u003C/p\u003E\u003Cp\u003ESeriously, though, it looks like you strapped half of Las Vegas to the top of those rockets. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Huojin","CreatedById":12209,"CreatedDateTime":"2012-01-03T15:35:01Z","Content":"\n\u003Cp\u003ESimply amazing :3\u003C/p\u003E\u003Cp\u003EWould\\\u0027ve been nice for you to link up with Lowball, though. Did you time warp at any point between detaching Lowball and returning to Munar orbit? I\\\u0027ve heard that can make parts disappear.\u003C/p\u003E\n"},{"CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-03T17:10:29Z","Content":"\n\u003Cp\u003ENo time warping, once I was below 5km. If you time warp while too close to the mun, sometimes the moon \u0027jumps\u0027 and your orbit changes. And then you die.\u003C/p\u003E\n"},{"CreatedByName":"Gojira","CreatedById":10884,"CreatedDateTime":"2012-01-03T18:37:41Z","Content":"\n\u003Cp\u003EI feel small and too symmetrical all of a sudden\u003C/p\u003E\u003Cp\u003E.craft and required parts, please?\u003C/p\u003E\n"},{"CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-03T19:14:03Z","Content":"\n\u003Cp\u003ERight. Now that I know how to do attachments, i can attach the craft file.\u003C/p\u003E\u003Cp\u003EAs for the part list - much trickier. First I downloaded every part I could find, then I used whichever ones I felt like at the time. Also, there are 2 different kinds of heavy struts used - I accidentally used some heavy strut from two different packs, and can\\\u0027t figure out how to get rid of them without just removing every strut, everywhere. So I just edited the configs so they\\\u0027re identical. One is harvester\\\u0027s strutConnectorHeavy. The other one was named something else--similar but different. Like \u0027heavyStrutConnector\u0027 or something.\u003C/p\u003E\u003Cp\u003EAlso, I manually edited the configs of the extra command pods. I made a new copy and called each one \u0027OriginalCommandPodName_aux\u0027, and declared it a \u0027strut\u0027.\u003C/p\u003E\u003Cp\u003EMaybe if I have time I\\\u0027ll switch over my external to my linux box and do an ls -r of my mods directory. Thank god I switched over to JSGME.\u003C/p\u003E\u003Cp\u003EEdit: it\\\u0027s called NP_Heavystrut, from the novapunch pack. I think I changed heavyStrutConnector (from the kw challenger pack) to match the novapunch version. I suspect it won\\\u0027t fly if you leave it as-is, since the kw version is, like, 20 times heavier.\u003C/p\u003E\u003Cp\u003EI tried fixing it by textreplacing instances of heavyStrutConnector with NP_Heavystrut, but it did not like that at ALL.\u003C/p\u003E\n"},{"CreatedByName":"Gojira","CreatedById":10884,"CreatedDateTime":"2012-01-04T21:27:13Z","Content":"\n\u003Cp\u003Ejust post your parts folder in a zip 8)\u003C/p\u003E\n"},{"CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-04T23:30:48Z","Content":"\n\u003Cp\u003EHalf a gigabyte, compressed. Ouch! I\\\u0027ll see if I can figure out a way to get this hosted somewhere . . . \u003C/p\u003E\n"},{"CreatedByName":"Satellife","CreatedById":726,"CreatedDateTime":"2012-01-04T23:31:13Z","Content":"\n\u003Cp\u003E\u003Cem\u003EJesus Christ. \u003C/em\u003E\u003C/p\u003E\u003Cp\u003EIt\\\u0027s as if every mission from Mercury through A Moon Base was combined into one launch...\u003C/p\u003E\u003Cp\u003ERespect. \u003C/p\u003E\n"},{"CreatedByName":"RedDwarfIV","CreatedById":11716,"CreatedDateTime":"2012-01-04T23:46:25Z","Content":"\n\u003Cp\u003EI noticed when testing missiles that jettisoned stages usually disappear once their engines/SRBs are off, especially if they aren\\\u0027t in your field of view.\u003C/p\u003E\u003Cp\u003EThough I\\\u0027m not entirely sure, as once in a Munar orbit I dropped a large fuel tank and engine. It went down slowly, not fast enough for me to lose sight of it. But after a while it went out of view of my camera, and I never saw it after that.\u003C/p\u003E\n"},{"CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-05T01:20:23Z","Content":"\n\u003Cp\u003EI\\\u0027ve sometimes been in co-orbit with released stages, and I\\\u0027ve had them \u003Cstrong\u003Eseem \u003C/strong\u003Eto go in and out of sight, as our two slightly-different orbits wave past each other. But I\\\u0027m never 100% sure they actually went out of sight, or if I just really tiny and I didn\\\u0027t notice. I\\\u0027ve also gotten log notifications of stages hitting kerbal, long after separation (for example, if I release while technically in orbit, but with a perigee just \u003Cem\u003Ebarely\u003C/em\u003E inside the atmosphere). But then again, I\\\u0027ve also had situations where I expected to see the impact logged and didn\\\u0027t.\u003C/p\u003E\u003Cp\u003EDoes anyone know for sure if stuff stays around even when far away? It can be hard to tell, due to the speeds involved?\u003C/p\u003E\u003Cp\u003EDoes anyone know if there is a \u0027fog plane\u0027 in the KSP graphics engine, beyond which objects are simply not rendered, even if their positions are still being tracked?\u003C/p\u003E\n"},{"CreatedByName":"Lord Strange","CreatedById":12742,"CreatedDateTime":"2012-01-05T13:03:49Z","Content":"\n\u003Cp\u003E ???\u003C/p\u003E\u003Cp\u003EWhoa. That\\\u0027s just incredible. \u003C/p\u003E\u003Cp\u003EQuick Jeb, to the VAB!\u003C/p\u003E\n"},{"CreatedByName":"Guest","CreatedById":-1,"CreatedDateTime":"2012-01-05T13:37:33Z","Content":"\n\u003Cp\u003ECongratulations, you win KSP!\u003C/p\u003E\n"},{"CreatedByName":"nlancaster","CreatedById":10319,"CreatedDateTime":"2012-01-08T04:12:05Z","Content":"\n\u003Cp\u003EWhile not as large as gabyalufix massive undertaking. here is my semi realistic huge mun base and lander system.\u003C/p\u003E\u003Cp\u003EFull size 3m tank as a Mun base.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot39s.png\u0022 alt=\u0022screenshot39s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot40s.png\u0022 alt=\u0022screenshot40s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot43s.png\u0022 alt=\u0022screenshot43s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot27s.png\u0022 alt=\u0022screenshot27s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot29s.png\u0022 alt=\u0022screenshot29s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot31s.png\u0022 alt=\u0022screenshot31s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot34s.png\u0022 alt=\u0022screenshot34s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot35s.png\u0022 alt=\u0022screenshot35s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://lancastercustom.com/upload/KSP/screenshot36s.png\u0022 alt=\u0022screenshot36s.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EUnfortnatly something went wrong when the lander/return stage landed again on the mun, and all 3 kerbals were permantly stuck on the Mun. Good news is they had a HUGE 3m tank to use as a shelter, and a rescue mission is on the way!\u003C/p\u003E\n"},{"CreatedByName":"gabyalufix","CreatedById":8990,"CreatedDateTime":"2012-01-08T07:40:38Z","Content":"\n\u003Cp\u003ENicely done.\u003C/p\u003E\u003Cp\u003EIt\\\u0027s starting to get downright crowded up there . . . \u003C/p\u003E\n"}]}