{"TopicId":52251,"ForumId":25,"TopicTitle":"(OLD) The Ultimate Jool-5 Challenge:land Kerbals on all moons and return in one big mission","CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2013-11-07T16:59:28Z","PageNum":13,"Articles":[{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-01-23T03:05:46Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EAlpheratz: Congratulations, you have finished the JOOL-5 mission at Jebediah\u0027s Level! \u003C/strong\u003E\u003C/span\u003E\u003Cstrong\u003EThis highly modular ship with the \u0022self-moving\u0022 engines is AWESOME!!! You had no unused part, that\u0027s for sure! \u003C/strong\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EI see you were committed to optimization at the maximum. I also love your lander style with the Mk1 at the bottom... and with the nuclear engines. That\u0027s funny you just posted it because there was an ongoing argument about modded parts and their sizes, and a nuclear lander was mentioned for example. \u003C/p\u003E\u003Cp\u003ENice job with Tylo, yeah, that\u0027s the key thing why people usually don\u0027t use nukes for the landers. But with good fuel/weight ratio (and TWR) it is possible (there was already an other mission with these engines).\u003C/p\u003E\u003Cp\u003EYou asked about what is not optional, and what SSSPutnik said was very good, that would make it more optimized! My only idea was that you had to dock the engines perfectly aligned or else the ship will rotate. Did you experience that or the ASAS did its job? But I have no idea how to solve this problem... Secondly maybe your landers were a little bit tall which may be hard to land at the hills of Laythe or when slipping sideway at Tylo touchdown. And maybe you could bring less fuel next time, and smaller fuel tanks for the smaller moons, as an idea, but as refueling is acceptable this is only for the real optimization\u0027s geeks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E So I cannot really say anything, your ship is optimized at a very high level and I also like this approch so enjoyed your entry very much! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMaybe you should try an other level (1-3) next. When I started this challenge I was thinking about launch mass or a point system but my experience is that many people want to make all the points at once and got too stressed somewhere during the planning/flying and give up, and that may destroy the fun of it. And this is already a hard mission to do so I decided to create with 4 levels in a Hall of Fame style, but if it would be a point system then your entry would be somewhere at the top, for sure! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-23T03:08:47Z\u0022 title=\u002201/23/2014 03:08  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 23, 2014\u003C/time\u003E by Ziv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Alpheratz","CreatedById":99633,"CreatedDateTime":"2014-01-23T03:30:41Z","Content":"\n\u003Cp\u003ESSSPutnik, I\u0027m trying to build something like that (asparagus staged) but with slightly more boosters. About 6 more would suffise, but the rocket crumbles on itself on the lauch pad if I add more... I would normally split this into a few launches, but the challenge asks us to try and to it in one shot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EMr.Rocket, that is pretty neat. I\u0027l give it a try\u003C/p\u003E\u003Cp\u003EOh, and on top of the rocket, it\u0027s a dummy payload to simulate the mass of my interplanetary jool station, but without the lagg\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/nebBeMn.png\u0022 alt=\u0022nebBeMn.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-01-23T03:33:14Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Ekookoo_gr:\u003C/strong\u003E welcome in the JOOL-5 Challenge, and good luck! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mr.Rocket\u0022 data-cite=\u0022Mr.Rocket\u0022\u003E\u003Cdiv\u003EFor parts, the jool going ship is almost all stock, will have KAS struts to hold it together. The launchers have some AIES aerospace parts, and some mega struts and larger SRBs from a stock-alike pact, so nothing too cheaty. I just needed to better strut my stuff.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003Elol \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E Mega struts and larger SRBs could count as cheaty! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E Even the giant NovaPunch rockets are cheaty if you think about it: stock parts are just not big enough for huge lifter rockets. But anyway, in this challenge the lifter doesn\u0027t count much as you can send up the stuff in one or in 10 launches too... and for the main ship going big not always mean it\u0027s getting better! Btw I like your JOOL-green painting! Cool stuff!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Ejacobgong:\u003C/strong\u003E Welcome you too in the JOOL-5 Challenge! Yes, your ship looks like optimized and not with a dozen of orange tanks! You can refuel if neccessary but I guess you want to avoid it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Why do you have so much science parts by the way?\u003C/p\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-01-23T03:35:52Z","Content":"\n\u003Cp\u003ERight, so I think I\u0027m \u003Cem\u003Ealmost\u003C/em\u003E ready to start my attempt at this. My first Challenge attempt, and of course it is one of the most ambitious choices. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E I\u0027m going for the Jebediah level.\u003C/p\u003E\u003Cp\u003EMods used: Kerbal Engineer Redux, Kerbal Alarm Clock\u003C/p\u003E\u003Cp\u003EHere she is, in the VAB, since I have yet to actually launch anything yet.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i405.photobucket.com/albums/pp133/zeppelinmage/screenshot123-annotated.png~original\u0022 alt=\u0022screenshot123-annotated.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EOnly the drive section has been strutted so far - I\u0027ll be adding more struts to the landers before launching them. I\u0027m still a n00b at this game; only been playing a month, so any suggestions on how to improve the design would be welcome. (btw, ignore the KER readout and the staging info... most are inaccurate.)\u003C/p\u003E\u003Cp\u003EAnd here are the Landers (including the Science/mini module):\u003C/p\u003E\u003Cp\u003EMini Lander:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i405.photobucket.com/albums/pp133/zeppelinmage/screenshot118.png~original\u0022 alt=\u0022screenshot118.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003ETylo Lander (with science/mini module):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i405.photobucket.com/albums/pp133/zeppelinmage/screenshot120.png~original\u0022 alt=\u0022screenshot120.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003ELaythe Lander (with science/mini module):\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i405.photobucket.com/albums/pp133/zeppelinmage/screenshot122.png~original\u0022 alt=\u0022screenshot122.png~original\u0022\u003E\u003C/p\u003E\u003Cp\u003EI realized after this screenie was taken that I had under-estimated the parachute count. So I had to double it.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003ESome numbers:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EMothership (fully loaded):\u003C/p\u003E\u003Cp\u003EDV: 8300\u003C/p\u003E\u003Cp\u003EMass: 492t\u003C/p\u003E\u003Cp\u003ETMR: 0.3\u003C/p\u003E\u003Cp\u003EPart count: 375\u003C/p\u003E\u003Cp\u003EKerbals: 6 (1x 4-man habitaiton with rotating shifts)\u003C/p\u003E\u003Cp\u003E# of planned launches: 7 (maybe 8)\u003C/p\u003E\u003Cp\u003EMini Lander:\u003C/p\u003E\u003Cp\u003EDV: 3800\u003C/p\u003E\u003Cp\u003EMass: 6.6t\u003C/p\u003E\u003Cp\u003ETWR (Vall): 7.8\u003C/p\u003E\u003Cp\u003ETylo Lander (With mini):\u003C/p\u003E\u003Cp\u003EDV: 5100\u003C/p\u003E\u003Cp\u003EMass: 60t\u003C/p\u003E\u003Cp\u003ETWR (Tylo): 1.25\u003C/p\u003E\u003Cp\u003ELaythe Lander (with mini):\u003C/p\u003E\u003Cp\u003EDV: 3900\u003C/p\u003E\u003Cp\u003EMass: 50t\u003C/p\u003E\u003Cp\u003ETWR (Laythe): 1.2\u003C/p\u003E\u003Cp\u003EThe mothership has a little less DV than I wanted, but I plan to shed empty tanks as I drain them, cutting down on my mass. The mini lander doubles as a modular science laboratory, with all the instruments next to the command seat so my pilot can acquire the data to bring back to the mothership. The mini lander will be used for all landings, with additional booster modules for Laythe (plus parachutes) and Tylo.\u003C/p\u003E\u003Cp\u003EThe \u0022booster\u0022 sections will be discarded as I don\u0027t have secondary docking capabiliy for them. I\u0027m not sure yet if I\u0027ll bring the mini lander back to Kerbin though. Depends on what kind of DV I have for the return burn.\u003C/p\u003E\u003Cp\u003EMy flight plan specifics depend on where my orbit ends up after Joolian aerocapture. I plan to drop off each lander in low moon orbit, but that depends on how much mothership DV I can save, and how economically I can burn the landers.\u003C/p\u003E\u003Cp\u003EI\u0027ll, of course, update this as the mission goes on. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T03:42:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zeppelinmage\u0022 data-cite=\u0022zeppelinmage\u0022\u003E\u003Cdiv\u003ERight, so I think I\u0027m \u003Cem\u003Ealmost\u003C/em\u003E ready to start my attempt at this. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIts very... tall.\u003C/p\u003E\u003Cp\u003E5100 dV for Tylo lander isn\u0027t enough?\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T03:46:38Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alpheratz\u0022 data-cite=\u0022Alpheratz\u0022\u003E\u003Cdiv\u003ESSSPutnik, I\u0027m trying to build something like that (asparagus staged) but with slightly more boosters. About 6 more would suffise, but the rocket crumbles on itself on the lauch pad if I add more... I would normally split this into a few launches, but the challenge asks us to try and to it in one shot \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EFair enough. Are the boosters resting on the launchpad? If not, bury the ship in the VAB so it is when launched.\u003C/p\u003E\u003Cp\u003EI had a similar issue, fixed it with horizontal struts at base and top of each tank, connecting to the tanks next door. (Also use cross braces like I see you have around the middle reason).\u003C/p\u003E\u003Cp\u003EI think it looks like it can be fixed with moar struts!\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T03:47:50Z","Content":"\n\u003Cp\u003EZiv, can you look at my post regarding Kethane scanners \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57197-The-ultimate-Jool-5-challenge-land-Kerbals-on-all-moons-and-return-in-one-big-misson?p=923452\u0026amp;viewfull=1#post923452\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E ?\u003C/p\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-01-23T03:48:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EIts very... tall.\u003Cp\u003E5100 dV for Tylo lander isn\u0027t enough?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah, I was aiming for 6000, but I couldn\u0027t get the mass low enough to work. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E According to the map, I \u003Cem\u003Eshould\u003C/em\u003E have enough to just make LTO -\u0026gt; land -\u0026gt; LTO... I can jettison the booster and use the mini lander to finish circularization if needed, and refuel at the mothership.\u003C/p\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-01-23T03:53:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003ESorry, Ziv, can you reconsider the Kethane scanner rule?\u003Cp\u003E1) It doesn\u0027t make the mission easier, harder in fact.\u003C/p\u003E\u003Cp\u003E2) Given already accomplished the mission, its incentive to go back and do more. (Kerbal scientists discover Kethane and hope the discovery of Kethane in the Jool system will make future missions cheaper etc). I don\u0027t see how it varies from say taking a scansat.\u003C/p\u003E\u003Cp\u003E3) My second mission, already underway, has Kethane scanners \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s not just the Kethane scanner but the smaller modded nuke engines and so. But Kethane is definitely don\u0027t fit into the concept of the Challenge. I renamed the last category to \u0022MIXED SOLUTIONS (they just wanted to go on their way)\u0022 for everybody who wanted to try new ideas and so didn\u0027t really fit into the 4 main category, but their mission is definitely worth sharing. In the next 10 days I won\u0027t have too much time to manage this challenge but after that I will consider creating a Kethane level too, because that mod is pretty cool and game-changing! I still have to think about the rules for it so don\u0027t go too far yet, but if you like Kethane, then be prepared! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-23T03:59:21Z\u0022 title=\u002201/23/2014 03:59  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 23, 2014\u003C/time\u003E by Ziv\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Ziv","CreatedById":91995,"CreatedDateTime":"2014-01-23T04:08:53Z","Content":"\n\u003Cp\u003E\u003Cstrong\u003Ezeppelinmage:\u003C/strong\u003E Welcome here! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI think the basic ideas are okay but my thougts:\u003C/p\u003E\u003Cp\u003E1. don\u0027t make the main ship too long/tall or it will wobble (may even broke) and will turn VERY slow. Go wider! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E2. For Tylo and Laythe I suggest more TWR, 2 at least. That way you will be more fuel efficient and the normal dVs will be enough... if you go with 1.04 - 1.14 TWR then your lander will waste a huge amount of fuel fighting against gravity and so you will need a lot more dV for the same maneuver. I think 5100 m/s won\u0027t be enough. Make it as much as you can... you will need it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E3. When parachuting you can use your engines a little before opening the parachutes to slow down under 90-100 m/s or more, and that way less parachutes will be enough (=less mass to carry).\u003C/p\u003E\n"},{"CreatedByName":"Alpheratz","CreatedById":99633,"CreatedDateTime":"2014-01-23T04:09:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ziv\u0022 data-cite=\u0022Ziv\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EYou asked about what is not optional, and what SSSPutnik said was very good, that would make it more optimized! My only idea was that you had to dock the engines perfectly aligned or else the ship will rotate. Did you experience that or the ASAS did its job? But I have no idea how to solve this problem... Secondly maybe your landers were a little bit tall which may be hard to land at the hills of Laythe or when slipping sideway at Tylo touchdown. And maybe you could bring less fuel next time, and smaller fuel tanks for the smaller moons, as an idea, but as refueling is acceptable this is only for the real optimization\u0027s geeks! \u003C/strong\u003E\u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E So I cannot really say anything, your ship is optimized at a very high level and I also like this approch so enjoyed your entry very much! \u003C/strong\u003E\u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EThanks Ziv \u003C/strong\u003E\u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E Hmmm, for aligning the engines, I used MechJeb, there\u0027s a \u0022Force roll\u0022 option in the docking autopilot \u003C/strong\u003E\u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003E Of course even MechJeb is not precise, but I had five Mk1 and some reaction wheels, so my ship was balanced. I did in fact have some trouble landing on hills. It took more planning than usual. Any ideas on how to get my lander shorter but with the same amount of fuel (I need all of it for Tylo).\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003ETo adapt my lander to smaller moons, I just removed most of the fuel before going there. Hmmm... maybe I could remove the middle fuel core and use a structural core? But I\u0027d have to carry it around all the way... What\u0027s best?\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EAnd yeah, it will be a pleasure to try other levels, this time in a single launch!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EFair enough. Are the boosters resting on the launchpad? If not, bury the ship in the VAB so it is when launched.\u003C/strong\u003E\u003C/span\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EI had a similar issue, fixed it with horizontal struts at base and top of each tank, connecting to the tanks next door. (Also use cross braces like I see you have around the middle reason).\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EI think it looks like it can be fixed with moar struts!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EYou were right, I added struts and I just got that in a 400km orbit:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/osFSUo0.png\u0022 alt=\u0022osFSUo0.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#FF0000;\u0022\u003E\u003Cstrong\u003EProblem solved!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"zeppelinmage","CreatedById":96515,"CreatedDateTime":"2014-01-23T04:19:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ziv\u0022 data-cite=\u0022Ziv\u0022\u003E\u003Cdiv\u003E\u003Cstrong\u003Ezeppelinmage:\u003C/strong\u003E Welcome here! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003Cp\u003EI think the basic ideas are okay but my thougts:\u003C/p\u003E\u003Cp\u003E1. don\u0027t make the main ship too long/tall or it will wobble (may even broke) and will turn VERY slow. Go wider! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E2. For Tylo and Laythe I suggest more TWR, 2 at least. That way you will be more fuel efficient and the normal dVs will be enough... if you go with 1.04 - 1.14 TWR then your lander will waste a huge amount of fuel fighting against gravity and so you will need a lot more dV for the same maneuver. I think 5100 m/s won\u0027t be enough. Make it as much as you can... you will need it! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E3. When parachuting you can use your engines a little before opening the parachutes to slow down under 90-100 m/s or more, and that way less parachutes will be enough (=less mass to carry).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E I won\u0027t be launching until this weekend (at least) anyway, so I may do a little redesigning in the meantime. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E1: Yeah, I\u0027m afraid of potential wobble... I\u0027m just trying to limit my required launches, especially with the massive amount of orange tanks. My heaviest lifter is 150t, but untested, so I\u0027m not sure if I can go any larger on each section. I tried a radial attachment for the lander parts, but the COM went way to the side. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003E2: OK, I was using Kerbin as a guide, aiming for 1 \u0026lt; TWR \u0026lt; 1.7... but if you suggest 2, I\u0027ll change motors. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E3: Well, I wanted to save weight by only taking enough fuel to re-orbit/rendezvous. But I do have a little extra, so I\u0027ll probably burn a little to slow the final descent. Either way, the chutes I have are \u003Cem\u003Ebarely\u003C/em\u003E enough to land it on those light legs... if I drop chutes, I\u0027m afraid I might need heavier legs which would negate the mass savings.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T04:41:40Z","Content":"\n\u003Cp\u003E6740 dV Tylo lander. Stock \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E Still prefer my modded nuke one though, this one looks so... messy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://moc-per.micromine.com/owncloud/public.php?service=files\u0026amp;t=16625aa7e0f550b466361ce6b8cde705\u0026amp;download\u0022 alt=\u0022public.php?service=files\u0026amp;t=16625aa7e0f550b466361ce6b8cde705\u0026amp;download\u0022\u003E\u003C/p\u003E\u003Cp\u003EWhoa 55km orbit land 75 km (circular) ascent with over 1100 dV remaining and that was with me being tardy hitting a stage trigger...\u003C/p\u003E\u003Cp\u003EThis designs a keeper!\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-23T07:03:23Z\u0022 title=\u002201/23/2014 07:03  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 23, 2014\u003C/time\u003E by SSSPutnik\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T04:51:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Ziv\u0022 data-cite=\u0022Ziv\u0022\u003E\u003Cdiv\u003EIt\u0027s not just the Kethane scanner but the smaller modded nuke engines and so. But Kethane is definitely don\u0027t fit into the concept of the Challenge. I renamed the last category to \u0022MIXED SOLUTIONS (they just wanted to go on their way)\u0022 for everybody who wanted to try new ideas and so didn\u0027t really fit into the 4 main category, but their mission is definitely worth sharing. In the next 10 days I won\u0027t have too much time to manage this challenge but after that I will consider creating a Kethane level too, because that mod is pretty cool and game-changing! I still have to think about the rules for it so don\u0027t go too far yet, but if you like Kethane, then be prepared! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe second mission underway uses stock engines, the only iffy bit is the scanners. Tell ya what, I\u0027ll dump the probes, you\u0027ll never know they were there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The one with the modded nukes is my THIRD mission...\u003C/p\u003E\u003Cp\u003ERegarding the challenge overall.\u003C/p\u003E\u003Cp\u003EI love this one, it\u0027s cool. IMHO though, you should keep the 3 levels, plus the Jeb level, I like the idea of \u0022they did it their way\u0022 category too.\u003C/p\u003E\u003Cp\u003EThere should also be a PURE STOCK level, (with or without flight computers?)\u003C/p\u003E\u003Cp\u003EPlus, I consider refuelling cheating, (even though I had to refuel it did really take the shine off the mission for me). Consider a no-refuelling bonus/category/points?\u003C/p\u003E\u003Cp\u003ESome sort of points system would be nice without emphasizing it too much.\u003C/p\u003E\u003Cp\u003EBut you don\u0027t want too many categories/points etc or it gets messy... I dunno.\u003C/p\u003E\u003Cp\u003EI can\u0027t comment on how you do the Kethane mission, never mined a drop in my life, just scanned for it.\u003C/p\u003E\u003Cp\u003ESome sort of points system would be nice without emphasizing it too much.\u003C/p\u003E\u003Cp\u003EMy two cents \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T04:53:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alpheratz\u0022 data-cite=\u0022Alpheratz\u0022\u003E\u003Cdiv\u003EProblem solved!\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAwesome! Glad that worked.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T04:56:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zeppelinmage\u0022 data-cite=\u0022zeppelinmage\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E2: OK, I was using Kerbin as a guide, aiming for 1 \u0026lt; TWR \u0026lt; 1.7... but if you suggest 2, I\u0027ll change motors. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah what Ziv said, minimum dV for Tylo I found was about 5800. And you need a decent TWR or all that fuel will just make your splash bigger \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Norcurion","CreatedById":101467,"CreatedDateTime":"2014-01-23T05:56:16Z","Content":"\n\u003Cp\u003E4 launches later my Spaceship is finally waiting for the launch window. But that will have to wait until tomorrow, after hours of watching various Launcher disintegrate for even more various Reasons and docking a giant Pencil I\u0027ll have to sleep first \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003E \u003Cimg src=\u0022http://i.imgur.com/8JcwezF.jpg\u0022 alt=\u00228JcwezF.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Mobjack","CreatedById":99078,"CreatedDateTime":"2014-01-23T05:56:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alpheratz\u0022 data-cite=\u0022Alpheratz\u0022\u003E\u003Cdiv\u003EPlease do tell me if you find something not optimal in my design! I certainly wish to better myself on my next attempt! (Ok, the 8 nuclear engines at the back of the ship are too much \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_embarrassed.gif\u0022 alt=\u0022:blush:\u0022\u003E )\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really can\u0027t find any flaws with that design even with the 8 engines. I like how everything was modular.\u003C/p\u003E\u003Cp\u003EHow steady did the ship run when everything was attached?\u003C/p\u003E\n"},{"CreatedByName":"Mobjack","CreatedById":99078,"CreatedDateTime":"2014-01-23T06:08:26Z","Content":"\n\u003Cp\u003EI managed to land on every moon at the same time around Jool.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/NUhgxR4.png\u0022 alt=\u0022NUhgxR4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EBut look at the mess I have to put together. Two ships are on empty and two others are going in the wrong direction. I must have made a miscalculation somewhere.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ZFxwQu4.png\u0022 alt=\u0022ZFxwQu4.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EI still have to pick up my lander from Tylo too. It had enough dV to reach Vall on its own, but not enough thrust. I will send a small lander to pick it up.\u003C/p\u003E\n"},{"CreatedByName":"Mobjack","CreatedById":99078,"CreatedDateTime":"2014-01-23T06:36:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022SSSPutnik\u0022 data-cite=\u0022SSSPutnik\u0022\u003E\u003Cdiv\u003EThe second mission underway uses stock engines, the only iffy bit is the scanners. Tell ya what, I\u0027ll dump the probes, you\u0027ll never know they were there \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E The one with the modded nukes is my THIRD mission...\u003Cp\u003ERegarding the challenge overall.\u003C/p\u003E\u003Cp\u003EI love this one, it\u0027s cool. IMHO though, you should keep the 3 levels, plus the Jeb level, I like the idea of \u0022they did it their way\u0022 category too.\u003C/p\u003E\u003Cp\u003EThere should also be a PURE STOCK level, (with or without flight computers?)\u003C/p\u003E\u003Cp\u003EPlus, I consider refuelling cheating, (even though I had to refuel it did really take the shine off the mission for me). Consider a no-refuelling bonus/category/points?\u003C/p\u003E\u003Cp\u003ESome sort of points system would be nice without emphasizing it too much.\u003C/p\u003E\u003Cp\u003EBut you don\u0027t want too many categories/points etc or it gets messy... I dunno.\u003C/p\u003E\u003Cp\u003EI can\u0027t comment on how you do the Kethane mission, never mined a drop in my life, just scanned for it.\u003C/p\u003E\u003Cp\u003ESome sort of points system would be nice without emphasizing it too much.\u003C/p\u003E\u003Cp\u003EMy two cents \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI really don\u0027t think a point system is necessary. I think completing the challenge is an accomplishment in itself and I like seeing how everyone achieved it in different ways.\u003C/p\u003E\u003Cp\u003EI do agree that that the refueling is kind of cheap for warranting a Jebediah level. Maybe it should be a Bob or Bill level, but it is too late to change it now.\u003C/p\u003E\u003Cp\u003EI also see no problems with the Kethane scanner since it will just hurt your performance, but it is Ziv\u0027s call.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T06:47:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mobjack\u0022 data-cite=\u0022Mobjack\u0022\u003E\u003Cdiv\u003EI really don\u0027t think a point system is necessary. I think completing the challenge is an accomplishment in itself and I like seeing how everyone achieved it in different ways.\u003Cp\u003EI do agree that that the refuelling is kind of cheap for warranting a Jebediah level. Maybe it should be a Bob or Bill level, but it is too late to change it now.\u003C/p\u003E\u003Cp\u003EI also see no problems with the Kethane scanner since it will just hurt your performance, but it is Ziv\u0027s call.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah drop the points idea. Agree with your refuelling comment. I ended up needing to and I felt like I had cheated all the time after that. (If the entire premise is based on the fact its a \u0022one shot\u0022 cheap mission, sending a refuelling mission would blow your budget big time. I see this as far worse than using odd shaped engines etc. (I can whip a stock Tylo capable lander up easy, I just use the mod parts mostly for looks).\u003C/p\u003E\u003Cp\u003EAgreed, Ziv\u0027s challenge, his rules. I am getting to point of wanting to try Moho now though...\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T06:50:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Mobjack\u0022 data-cite=\u0022Mobjack\u0022\u003E\u003Cdiv\u003EBut look at the mess I have to put together. Two ships are on empty and two others are going in the wrong direction. I must have made a miscalculation somewhere.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOuch, orbiting in wrong direction eats deltaV to fix... I did this around Tylo by mistake. Ended up easiest was to leave SoI and then dock.\u003C/p\u003E\n"},{"CreatedByName":"SSSPutnik","CreatedById":91745,"CreatedDateTime":"2014-01-23T06:52:09Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Norcurion\u0022 data-cite=\u0022Norcurion\u0022\u003E\u003Cdiv\u003E4 launches later my Spaceship is finally waiting for the launch window. But that will have to wait until tomorrow, after hours of watching various Launcher disintegrate for even more various Reasons and docking a giant Pencil I\u0027ll have to sleep first \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003Cp\u003E \u003Ca href=\u0022http://i.imgur.com/8JcwezF.jpg\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://i.imgur.com/8JcwezF.jpg\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice, very clean design. Does it wobble badly under thrust?\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2014-01-23T06:56:22Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Alpheratz\u0022 data-cite=\u0022Alpheratz\u0022\u003E\u003Cdiv\u003EOh, and if anyone could give me a reliable lifter to put 200t onto orbit, I\u0027d appreciate! I am struggling with structural integrity...\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis wasn\u0027t quite 200 t (160 actually) but with a few more boosters or more efficient engines (these were all mainsails) and a little reorganization on your side and they may fit together nicely.\u003C/p\u003E\u003Cp\u003EThe ship was hanging down from the lifting part in the middle of it, all decouplers were attached at the top and struts were also diagonal towards the top but horizontal in the middle and at the bottom. It worked quite nicely.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/FD7m7\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n"},{"CreatedByName":"kookoo_gr","CreatedById":57720,"CreatedDateTime":"2014-01-23T06:59:05Z","Content":"\n\u003Cp\u003EOne question. The lander can, can it store all the surface samples, EVA reports etc from all the planets or do i need a separate can for each planet?\u003C/p\u003E\u003Cp\u003EAlso a few tips i found during the building of my ship.\u003C/p\u003E\u003Cp\u003E1. If you don\u0027t want excess weight on your ship but it is necessary when sending/docking a module on your ship use radial decouplers. At my Vall lander i don\u0027t want any RCS thrusters in order to save weight but they are necessary for docking.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/SSRDMCF.png\u0022 alt=\u0022SSRDMCF.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E2. For quick docking from launch with very little time to waste, send your parts at 85-87 km. when waiting for launch, time warp until your ship reaches the east desert cape, it\u0027s the last piece of land before the KSC continent. Launch the rocket and aim for a pe of 85-87km and you\u0027ll have an encounter at about 20-40km\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/ReWijAI.png\u0022 alt=\u0022ReWijAI.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso i would like your opinion for the last crew to send at my Joll 5 mothership from the current available Kerbals. I just can\u0027t decide which one i should send\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/IzSCTd2.png\u0022 alt=\u0022IzSCTd2.png\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-23T08:11:34Z\u0022 title=\u002201/23/2014 08:11  AM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 23, 2014\u003C/time\u003E by kookoo_gr\u003C/strong\u003E\n\u003C/span\u003E\n"}]}