{"TopicId":52973,"ForumId":25,"TopicTitle":"BSC: Kerbal X - We have a winner!","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-11-13T15:18:02Z","PageNum":4,"Articles":[{"CreatedByName":"zekes","CreatedById":23840,"CreatedDateTime":"2013-11-15T03:27:16Z","Content":"\n\u003Cp\u003Esoooo has anyone tried mine?\u003C/p\u003E\n"},{"CreatedByName":"Deathsoul097","CreatedById":77396,"CreatedDateTime":"2013-11-15T03:44:35Z","Content":"\n\u003Cp\u003EOr mine? \u003Cspan style=\u0022color:#FFFFFF;\u0022\u003E10CHAR\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"700NitroXpress","CreatedById":90322,"CreatedDateTime":"2013-11-15T03:51:06Z","Content":"\n\u003Cp\u003EYour rockets for the challenge? ^^\u003C/p\u003E\n"},{"CreatedByName":"fireblade42","CreatedById":26149,"CreatedDateTime":"2013-11-15T03:51:31Z","Content":"\n\u003Cp\u003EFrom the Kerbal X\u0027s description of being on of the most successful rockets, I put together my most successful lifter designs with a very Mun capable payload. It also had the ability to scale to the payload by changing the number of outer tank stacks.\u003C/p\u003E\u003Cp\u003EI usually follow a launch profile that I got from one of Scott Manley\u0027s videos, keep it \u0026lt;200m/s while under 10km then full throttle at orbit prograde until apoapsis is ~100km then coast up and circularize. \u003C/p\u003E\u003Cp\u003Ein the VAB\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/in6sgExh.jpg\u0022 alt=\u0022in6sgExh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003Ediagram of the major parts of this setup\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/HGZf0ZNh.jpg\u0022 alt=\u0022HGZf0ZNh.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/MHuev\u0022 rel=\u0022external nofollow\u0022\u003EAlbum\u003C/a\u003E of it on a mission to the Mun\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://dl.dropboxusercontent.com/u/6835368/WorkHorse.craft\u0022 rel=\u0022external nofollow\u0022\u003ECraft file\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"vetrox","CreatedById":69796,"CreatedDateTime":"2013-11-15T03:51:40Z","Content":"\n\u003Cp\u003ERight. I\u0027ve been hard at work testing my attemp. See end of post for a details regarding the various design decisions and explenations for various things.\u003C/p\u003E\u003Cp\u003EI present \u0022The Ambitious\u0022. Function over form. I was tempted to make something more inspiring but thought i would keep it simple as we are aming these at new players\u003C/p\u003E\u003Cp\u003EPlenty of fuel left over, even with sloppy ascent profiles. Enough fuel to get to both mun and minmus and with super duper carefull launch window planning it may even reach and return from duna. No landing legs on this one its purely for visiting and creating debris (I like rings of debris in ksp)\u003C/p\u003E\u003Cp\u003ECraft file \u003Ca href=\u0022https://www.dropbox.com/s/h5qgbttdn3hz5d8/The%20_Ambitious_%20mk%202.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehere\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EPurchased at a used rocket dealership. We were assured by a salesman that \u0022The ambitious\u0022 is able to visit the two nearest celestial bodies and come home.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EOur engineers aren\u0027t quite sure whats under the protective shroud at the top of the rocket but Kerbanaughts enter through a secret hatch under the parachute.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThere was a hastily scrawled note from the previous owner \u0022I didnt purchase the optional \u0022landing\u0022 pack. Land at your own risk\u0022\u003C/em\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ob63h\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EHalfway through that album i made a quick update. Moved solar panels and put the engineer on the final stage for the photo flight. Dont worry the craft file is all stock. I also made a quick change since that album. The orientation of the outer tanks was changed slightly so the craft is more stable during the final asparagus stage (with 2 outer tanks remaining)\u003C/p\u003E\u003Cp\u003EShe went through alot of testing. Initial craft were all mainsails. This proved succesfull however when launching straight up the high g forces at full throttle would tear the ship to pieces. All skipper engines would get her to orbit but it was a bit more difficult so i opted for a central mainsail, with the droptanks using skippers. This provides an excellent TWR all the way up.\u003C/p\u003E\u003Cp\u003ENow I probably wont win this due to lack of landing gear. However i really wanted the whole space module to be covered by a shroud. I made a few designs to incorperate landing legs withing a shroud but the part counts were getting a bit too high so i had to decide between functionality or looks. I went for looks as it wouldnt take much for a new player to take the shroud off and slap some legs on it plus it will inspire them to shroud or get one of the mods that has them.\u003C/p\u003E\u003Cp\u003EEarly tests I tried to put one of the big reaction wheels (these were the \u0022all mainsail\u0022 tests) and those things are weak. With a TWR on the ground of 3.1 the reation wheel would fall off the bottom, taking the central engine with it. Or if it was further up, the kraken would come out and devour the ship!\u003C/p\u003E\u003Cp\u003EIt does have plenty of dv to land and take off from the mun however on its test flight i was reminded how weak the thin stack seperators are (the hastily scribbled note does state about landing at your own risk. However my shroud is seup just as i like it (with the parachute poking through the top)\u003C/p\u003E\u003Cp\u003EI will test everyones craft when the first round of voting starts.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-15T03:59:24Z\u0022 title=\u002211/15/2013 03:59  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 15, 2013\u003C/time\u003E by vetrox\u003C/strong\u003E\n\u003Cbr\u003EPoor Grammar\n\u003C/span\u003E\n"},{"CreatedByName":"Andrew Hansen","CreatedById":82311,"CreatedDateTime":"2013-11-15T04:50:21Z","Content":"\n\u003Cp\u003EFor my entry, I present to you the \u003Cem\u003EKerbal X Revised\u003C/em\u003E!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EFrom the VAB Description:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EThe Kerbal X Revised has plenty of fuel to comfortably take three Kerbals out to either Minmus or the Mun and return them back to Kerbin safely.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EDesigned by Kiphirdington Kerman (although most of the KSC staff just call him Kifton), it is one of the most reliable rockets in the Kerbal Space Center.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cem\u003EAction group 1 toggles solar panels.\u003C/em\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWhy vote for the Kerbal X Revised?\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnough fuel in the transfer stage to go to Duna, and enough in the landing stage to land on the Mun.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E77 parts (one part less than the stock version!).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENo part clipping.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAll stages designed with high TWR for easy maneuvering (every stage has a TWR above one!).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EUses asparagus staging.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EMainsails don\u0027t overheat (EDIT: It\u0027s because 0.22 changed heat production from 500 to 400).\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EVery stable lander with high-placed landing legs and radial engines. A single ladder extends all the way down to the ground.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ELander capable of putting itself right-side up if it falls over on the Mun.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EAble to touch down at 13 m/s without damage.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0By0EbHUAiQ3nWDBDaTBZMHhpNmM/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EDownload link for .craft file\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003ETo the Mun!\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/9IM4Y\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EOff to Minmus!\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/DvJTX\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EEDIT: Minor changes were made to .craft file. Sepatrons are positioned slightly differently and no longer \u0022damage\u0022 anything as they fire. Also, the solar panels were assigned to action group 1.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-18T03:31:09Z\u0022 title=\u002211/18/2013 03:31  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 18, 2013\u003C/time\u003E by Andrew Hansen\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Johnno","CreatedById":67618,"CreatedDateTime":"2013-11-15T07:17:26Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022zekes\u0022 data-cite=\u0022zekes\u0022\u003E\u003Cdiv\u003Esoooo has anyone tried mine?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIn my view you\u0027ve failed to produce a valid entry. The spirit of this challenge was to improve on the Kerbal X, not to design a craft with a separate lander thus forcing rendezvous and/or docking.\u003C/p\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2013-11-15T07:29:55Z","Content":"\n\u003Cp\u003EYou\u0027ve all been added (I hope).\u003C/p\u003E\u003Cp\u003ESorry for the delay, I was rather busy yesterday.\u003C/p\u003E\n"},{"CreatedByName":"mhoram","CreatedById":78756,"CreatedDateTime":"2013-11-15T09:57:40Z","Content":"\n\u003Cp\u003EUpdated my entry.\u003C/p\u003E\u003Cp\u003ENews: can now land on Minmus and return, added Asparagus-stagig\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/58037-BSC-Kerbal-X-Start-building!?p=777665\u0026amp;viewfull=1#post777665\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/58037-BSC-Kerbal-X-Start-building!?p=777665\u0026amp;viewfull=1#post777665\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"mpink","CreatedById":57827,"CreatedDateTime":"2013-11-15T11:01:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022NeilC\u0022 data-cite=\u0022NeilC\u0022\u003E\u003Cdiv\u003EIt\u0027s the \u0022quickly\u0022 part of getting heavy stuff off the planet that makes it less efficient. You don\u0027t really want to get going too fast too soon, or you waste a lot of delta-V to drag.\u003Cp\u003EStandard asparagus staging is the most efficient way to launch because it sheds maximum weight as you go, while maintaining a near-liftoff TWR for the whole burn. If a craft has a decent TWR at launch (I shoot for 1.3-1.5), it will have excessive TWR after staging off a few sets of drop tanks. Anything above 2.5-3 really is overkill, if that kind of TWR is needed at any point then the ascent profile is... shall we say \u0022interesting\u0022? If you\u0027re going for efficiency it\u0027s better to drop the engines with the tanks, decreasing the dry mass and increasing overall delta-V.\u003C/p\u003E\u003Cp\u003ENot saying this method is bad, just that it values launch speed over efficiency. We can afford that in KSP!\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYeah its an odd craft.\u003C/p\u003E\u003Cp\u003EIt starts with a very low TWR (1.1 ish). I am under the impression that we should be trying to maintain terminal velocity for most the most efficient launch so dose this not mean we should be pushing for max G force at around 15K M ?\u003C/p\u003E\u003Cp\u003ELooking at my images it only makes 4.5 G so its not too crazy and at 32K M when it dumps its main drive section it was going 2K M/s so there is no insane drag of aerodynamic effects.\u003C/p\u003E\u003Cp\u003EIts designed for direct ascent so i dont think it dose a very good job as an orbital drive section where you would want lower G over a longer time at a higher altitude.\u003C/p\u003E\u003Cp\u003EI think my main concerns come from useless mass. Adding 0.4 mass to each LV 30 just bugs me.\u003C/p\u003E\u003Cp\u003EI should have used t-400\u0027s with fuel lines and jettison the center LV 45 when it gets lighter (runs out of fuel).\u003C/p\u003E\u003Cp\u003EDoing so results in dropping all the tanks before doing any turning witch is a bonus but i wanted to use the structural fuselage as it demonstrates a different cross fuel feeding method.\u003C/p\u003E\u003Cp\u003EDose anyone know if the craft suffers from more drag as the drive sections are not node connected to the drop tanks ?\u003C/p\u003E\u003Cp\u003EIm guessing that it dose not and that KSP isnt that complex with its drag yet.\u003C/p\u003E\u003Cp\u003EDoing further testing iv decided to change my craft to update the description adding.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EBigger is not better !\u003Cp\u003ETo Convert into a Mun lander replace fuselage\u0027s with t-400\u0027s and the Poodle with an LV-909\u003C/p\u003E\u003Cp\u003E-----May-Require-Additional-Parts------\u003C/p\u003E\u003Cp\u003ELegs, Ladder, solar panels \u0026amp; fuel lines\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI found these changes resulted the drive section reaching around 3K M/s at 45K M.\u003C/p\u003E\u003Cp\u003EAlthough landing 3 kerbals using just an LV-909 is somewhat tricky due to low TWR it had more than enough fuel to get me there and back.\u003C/p\u003E\u003Cp\u003EWith the original craft using 3.25 orange tanks its coming in at one of the lightest 3 kerbal craft so far \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003EIm very much looking forward to test flying all the craft before voting. Theres some very interesting designs out there. Iv not tried any of them yet as entry\u0027s often get changed and i dont want to vote on an old version of a craft. Im most looking forward to reading all the descriptions though.\u003C/p\u003E\n"},{"CreatedByName":"Rhomphaia","CreatedById":2440,"CreatedDateTime":"2013-11-15T15:32:20Z","Content":"\n\u003Cp\u003EFinally got around to taking some pics.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/q2QoR\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003Eentry post has been updated, craft file unchanged.\u003C/p\u003E\n"},{"CreatedByName":"Carl","CreatedById":2645,"CreatedDateTime":"2013-11-15T15:44:04Z","Content":"\n\u003Cp\u003EAchhh forgot my screenshot doesn\u0027t include a proper name when i took it. The actual name in the Craft file is \u0022Kerbal X V1.0\u0022\u003C/p\u003E\n"},{"CreatedByName":"NeilC","CreatedById":57575,"CreatedDateTime":"2013-11-15T15:58:06Z","Content":"\n\u003Cp\u003EYes, for optimal launch under KSP\u0027s drag model you want to maintain terminal velocity - but you want to get to terminal ASAP.\u003C/p\u003E\u003Cp\u003EAt sea level terminal is about 100m/s, and rises exponentially - there\u0027s a \u003Ca href=\u0022http://wiki.kerbalspaceprogram.com/wiki/Kerbin\u0022 rel=\u0022external nofollow\u0022\u003Etable on the wiki\u003C/a\u003E. Because drag causes huge losses while low in the atmosphere, you want to get through that quickly - a good KSP ascent profile is usually straight up until ~6-10km depending on TWR, then pitch over and start your gravity turn.\u003C/p\u003E\u003Cp\u003EWhy pitch over? Because of another kind of loss: gravity. As long as your thrust is straight up, gravity gets subtracted directly from your accel force. When you pitch over, you get to \u0022keep\u0022 the horizontal component of your velocity as orbital speed - gravity doesn\u0027t reduce that. While you\u0027re ascending vertically, 1G\u0027s worht of thrust is wasted just hovering - you only get \u0022credit\u0022 for anything above TWR=1.\u003C/p\u003E\u003Cp\u003EThat means, for your craft\u0027s 1.1 TWR, at launch you are accelerating at 0.1G, or roughly 1m/s per s (1m/s^2, unit of acceleration). At that rate, even with your mass constantly decreasing due to fuel burnage, you won\u0027t reach 100m/s for 60-70s. About 80% of the fuel you burned for that minute is totally wasted - very inefficient. If you had a launch TWR of 2 instead, only 50% of the fuel you burn for 10s would be wasted - much better way to get to terminal velocity.\u003C/p\u003E\u003Cp\u003EAn optimal ascent would be to reach 100m/s instantly (or as close to instantly as possible - think high initial TWR using small SRBs), then maintain terminal velocity (~1.2-1.5 TWR) straight up until about 8km, then start pitching over and give\u0027er all you got while remaining just under terminal. Above 20,000km you should always have your throttle pegged - you\u0027d need a crazy TWR just to keep up with how fast terminal velocity is increasing at that altitude.\u003C/p\u003E\u003Cp\u003EI\u0027ll post soon with my Kerbal X design, its launch is something like that.\u003C/p\u003E\n"},{"CreatedByName":"Death Engineering","CreatedById":68528,"CreatedDateTime":"2013-11-15T18:21:03Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027Palatino Linotype\u0027;\u0022\u003E\u003Cspan style=\u0022color:#006400;\u0022\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EDeath Engineering Presents...\u003C/span\u003E\u003C/span\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe \u0022KB X-11\u0022 with \u0022KB X Command Module\u0022!\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/H5FvpoBl.png\u0022 alt=\u0022H5FvpoBl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EFeatures:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E158 parts, 152t\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENamed for the 11 engines that fire at launch\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETested as a Mun orbiter or one-way Mun lander and a \u003Cspan style=\u0022text-decoration:underline;\u0022\u003Ereturn capable\u003C/span\u003E Minmus lander for three crew\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDocking capable\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ENo debug clipping\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EControl through aerodynamic and thrust vectoring (one of the 11 engines)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EDemonstrates simple clustering, asparagus staging, and structural reinforcement\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ETidy RCS tanks and battery placement\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ESolar panels do not need to be deployed\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EStable, stress tolerant lander\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EKB X Command Module\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/2IH8NqHl.png\u0022 alt=\u00222IH8NqHl.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003EDescription:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EThis craft is very easy to fly and get into orbit. It demonstrates building techniques such as clustering, asparagus staging, internal fuel lines, simple \u0022no debug\u0022 clipping and using action groups. No throttling back during ascent is required, just point-and-shoot. I\u0027ve tried gravity turns at 10km, 14km and 20km and got into orbit easily with all attempts. Munar orbits are easily done, but Munar landings are a little tight on fuel (returns from Mun are not likely). Minmus landings and returns are also easily done.\u003C/p\u003E\u003Cp\u003EAction groups:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EG - Deploy landing gear and ladder\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E2 - Open/close docking port\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E5 - Deploy chutes and jettison service module\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E9 - Toggle CM engine\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003ECraft file: \u003Ca href=\u0022https://www.dropbox.com/s/953esmt3w6f6zok/KB%20X-11.craft\u0022 rel=\u0022external nofollow\u0022\u003EKB X-11 with KB X Command Module\u003C/a\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/w621D\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T01:15:05Z\u0022 title=\u002211/16/2013 01:15  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by Death Engineering\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2013-11-15T18:40:55Z","Content":"\n\u003Cp\u003E@ Xeldrak I finish my entry it\u0027s on page 7\u003C/p\u003E\n"},{"CreatedByName":"timemaster","CreatedById":92852,"CreatedDateTime":"2013-11-15T23:31:43Z","Content":"\n\u003Cp\u003Etimemaster\u003C/p\u003E\u003Cp\u003E The \u0022Kerlington 1000\u0022; it\u0027s very similar to the Kerbal X but with a few additions\u003C/p\u003E\u003Cp\u003E: An engine cluster on the upper stage \u003C/p\u003E\u003Cp\u003E: An escape tower\u003C/p\u003E\u003Cp\u003E: Aerospikes on the lower aspargus staged boosters\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/5LaifOj\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/5LaifOjl.png\u0022 alt=\u00225LaifOjl.png\u0022\u003E\u003C/a\u003E \u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/UlTupM1\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/UlTupM1l.png\u0022 alt=\u0022UlTupM1l.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/kP3GlNG\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/kP3GlNGl.png\u0022 alt=\u0022kP3GlNGl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/wBQ45Xn\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/wBQ45Xnl.png\u0022 alt=\u0022wBQ45Xnl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/EpQZWUb\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/EpQZWUbl.png\u0022 alt=\u0022EpQZWUbl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/mRnMrar\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/mRnMrarl.png\u0022 alt=\u0022mRnMrarl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/pqrOgWt\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/pqrOgWtl.png\u0022 alt=\u0022pqrOgWtl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/tk3ShQz\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/tk3ShQzl.png\u0022 alt=\u0022tk3ShQzl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/twzbMky\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/twzbMkyl.png\u0022 alt=\u0022twzbMkyl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/3Pwrnil\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/3Pwrnill.png\u0022 alt=\u00223Pwrnill.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/Gc3h3j0\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/Gc3h3j0l.png\u0022 alt=\u0022Gc3h3j0l.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/E34j2ng\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/E34j2ngl.png\u0022 alt=\u0022E34j2ngl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003Eand the return\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/XpXicmW\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/XpXicmWl.png\u0022 alt=\u0022XpXicmWl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/GsZ1Voh\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/GsZ1Vohl.png\u0022 alt=\u0022GsZ1Vohl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/BEcV0lE\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/BEcV0lEl.png\u0022 alt=\u0022BEcV0lEl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/20Qfsmv\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://i.imgur.com/20Qfsmvl.png\u0022 alt=\u002220Qfsmvl.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ECraft file: \u003Ca href=\u0022https://www./view/2x9jl9crw91t0gc/Kerlington_1000.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttps://www./view/2x9jl9crw91t0gc/Kerlington_1000.craft\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-17T19:17:11Z\u0022 title=\u002211/17/2013 07:17  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 17, 2013\u003C/time\u003E by timemaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"I_Killed_Jeb","CreatedById":84817,"CreatedDateTime":"2013-11-16T03:35:00Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EIntroducing the\u003C/span\u003E \u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cstrong\u003EMeercurio Alpha!\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://www.dropbox.com/s/d7kvycgljqhmyd1/Meercurio%20Alpha.craft\u0022 rel=\u0022external nofollow\u0022\u003E.craft\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EDescription\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EAfter the spectacular failure of the Rockomax Moho-7 Program, blamed primarily on the fact that the entire rocket was built out of boosters, the KSC-led Meercurio series of liquid-fueled rockets was born. Initially designed to be a really large fireworks display, the Meercurio rockets feature innovative vegetable-y staging and an in-cockpit keyboard that curiously only features two random integers. Be warned, these \u0022spaceships\u0022 have been rumored to have been created to speed up the natural selection of Kerbalkind...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E==Action Groups==\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E6 - Ladder\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003E7 - Legs\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EDesign Principles \u0026amp; Thoughts\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EKerbal-X is kind of a difficult ship to \u0022improve\u0022 on. What\u0027s its purpose? Orbiter? Direct ascent lander? It\u0027s a perfectly capable ship for taking its payload to Kerbin orbit, and it that sense really doesn\u0027t need \u0022betterment.\u0022 So I decided to take a slightly different take on it using the 1-man capsule, an often neglected part, because I feel it\u0027s important for new players to \u0022think small\u0022 once in a while too. I also wanted to use other lesser-used parts like the pylon, which helps demonstrate that widening the landing legs creates a more stable base. Other than this, I\u0027ve maintained the look and feel of the original Kerbal-X including asparagus-staged boosters. As a small addition, I\u0027ve put parachutes on every booster, it makes me feel more NASA-y and if KSP implements debris recovery for inventory/$$ purposes, this should hopefully help with that. But mainly the goal is NASAness.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EThe Meercurio Alpha is a versatile ship designed for manned exploration of the Kerbin system. Its orbital stage and direct-ascent lander should have more than enough juice to travel to the surface of mun or minimus and return home safely. I\u0027ve noticed that recently the trend has been to fully max out the science in every ship, and I consciously tried to move away from that to build a simpler craft (92 total parts, a dozen less than my heavy lander!). Of course, if a person downloading my ship would like, the design is versatile and powerful enough to handle science jr containers and goo pods without significantly changing mission parameters (it has unnecessarily excessive electricity stored for this very purpose). As always, I keep clipping to a minimum (zero in this particular case) so anyone regardless of experience shouldn\u0027t have a problem taking the boat apart and putting it back together again with modifications of their choice. It\u0027s a rock solid rocket so I didn\u0027t add an escape system or action group, though the lander stage should be able to escape a catastrophic launch on its own.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:10px;\u0022\u003EPics!\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E(N.B. The munar mission pictures used a prototype rocket with the only difference being an adapter part which I changed for better aesthetics)\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Z6oWL\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T03:54:50Z\u0022 title=\u002211/16/2013 03:54  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by I_Killed_Jeb\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"mcirish3","CreatedById":50775,"CreatedDateTime":"2013-11-16T03:53:19Z","Content":"\n\u003Cp\u003EOH crud, totally forgot about this challenge. How much time do I have?\u003C/p\u003E\n"},{"CreatedByName":"Blaster","CreatedById":69150,"CreatedDateTime":"2013-11-16T04:28:12Z","Content":"\n\u003Cp\u003EReynard Rockets steps up with another simple yet crazy contraption. This is the Reynard Apex Munar Ship. The RAMS features just enough fuel to make a munar landing and back, but without going overboard on orange tanks! Reynard Rockets successfully landed 5 variations of this ship on the Mun, every one with enough fuel to return to Kerbin with haste. The keen observer will note that the RAMS is comprised of the Reynard Apex Ascent Rocket (RAAR) and the Reynard Orbital Fast Lander (ROFL).\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ow7b0\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EUnlike previous flights, Reynard Rockets has decided to release the flight video in all its unedited glory, showcasing the ability of the RAMS to perform successfully, even when there are piloting errors or technical difficulties.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022459\u0022 height=\u0022344\u0022 src=\u0022https://www.youtube.com/embed/Ws2vfbIpmcQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EGet your RAMS here: \u003Ca href=\u0022https://dl.dropboxusercontent.com/u/55294379/RR/Reynard%20Apex%20Munar%20Ship.craft\u0022 rel=\u0022external nofollow\u0022\u003EDownload\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T06:04:57Z\u0022 title=\u002211/16/2013 06:04  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by Blaster\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"pedorsf","CreatedById":68563,"CreatedDateTime":"2013-11-16T04:41:09Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/StkHv\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EVMT is a manned vehicle able to land on the mun an return without any difficulty and probably go from the mun ground to a minmus landing an return. Please aim for a 75Km orbit\u003C/p\u003E\u003Cp\u003EDownload: \u003Ca href=\u0022http://www./view/6cbs29hifn8uwrb/VMT.craft\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://www./view/6cbs29hifn8uwrb/VMT.craft\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T04:44:38Z\u0022 title=\u002211/16/2013 04:44  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by pedorsf\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Giggleplex777","CreatedById":29829,"CreatedDateTime":"2013-11-16T05:33:21Z","Content":"\n\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022text-decoration:underline;\u0022\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EKerbal G\u003C/span\u003E\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/511pVLC.png\u0022 alt=\u0022511pVLC.png\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:left;\u0022\u003E\u003Cp\u003EThe Kerbal G is designed to be the spiritual successor to the Kerbal X. With its crossfeeding boosters and (totally advanced) fuel flow system, it can go a tiny bit farther than its predecessor. As an added bonus, the Core Booster contains a probe core so you can pilot it after jettisoning it.\u003C/p\u003E\u003Cp\u003EA LES is included just in case a certain Kerbalnaut is piloting the rocket. It is advised to jettison the escape tower right after jettisoning the boosters.\u003C/p\u003E\u003Cp\u003EThe Kerbal G is capable of achieving orbit around the Mun and with its very optimistic parachutes in case you what to bring the Kerbals home! In one piece! It even comes with a docking port and a bit of RCS for those want to wa... I mean spend more time in space.\u003C/p\u003E\u003Cp\u003EFeatures:\u003C/p\u003E\u003Cp\u003E- Autonomous control\u003C/p\u003E\u003Cp\u003E- Fixed and deployable solar panels\u003C/p\u003E\u003Cp\u003E- Working LES\u003C/p\u003E\u003Cp\u003E- RCS and docking port\u003C/p\u003E\u003Cp\u003E- Docking light\u003C/p\u003E\u003Cp\u003E- SCIENCE! (pretty useless in sandbox)\u003C/p\u003E\u003Cp\u003E- Can withstand 4x physicswarp\u003C/p\u003E\u003Cp\u003E- Snacks\u003C/p\u003E\u003Cp\u003EAction Groups:\u003C/p\u003E\u003Cp\u003EBackspace- Abort (only during booster burn)\u003C/p\u003E\u003Cp\u003E1- Toggle anntena\u003C/p\u003E\u003Cp\u003E2- Toggle SCIENCE!\u003C/p\u003E\u003Cp\u003E3- Toggle Solar-collecting -thingies\u003C/p\u003E\u003Cp\u003E9- Deploy parachute\u003C/p\u003E\u003Cp\u003E0- Jettison LES\u003C/p\u003E\u003Cp\u003EWarranty void if:\u003C/p\u003E\u003Cp\u003E- Used to land on the Mun\u003C/p\u003E\u003Cp\u003E- Thrusty-things are pointing the wrong way\u003C/p\u003E\u003Cp\u003E- ...you run out of snacks\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EDownload it here: \u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022http://www./download/hhw6z7cpr53nuha/Kerbal\u002BG.craft\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022color:#0000FF;\u0022\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003E\u003Cstrong\u003EKerbal G\u003C/strong\u003E\u003C/span\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-16T15:24:55Z\u0022 title=\u002211/16/2013 03:24  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 16, 2013\u003C/time\u003E by Giggleplex777\u003C/strong\u003E\n\u003Cbr\u003EFixed spelling mistakes\n\u003C/span\u003E\n"},{"CreatedByName":"XolotlLoki","CreatedById":91037,"CreatedDateTime":"2013-11-16T07:33:30Z","Content":"\n\u003Cp\u003EIntroducing the Delta X, an asparagus-staged heavy lift booster with a direct ascent Mun lander on top. It was inspired by the Delta IV Heavy and Falcon Heavy. The craft is capable of Mun landing and return to Kerbin, all with the CSM still attached (though it can be jettisoned if desired). It includes ladders for easy Munar EVA.\u003C/p\u003E\u003Cp\u003EDelta X defines the following action groups:\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Col style=\u0022list-style-type:decimal;\u0022\u003E\u003Cli\u003EToggle torque\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EToggle ladders\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003EActivate parachute\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003ECut parachute\u003Cbr\u003E\u003C/li\u003E\u003C/ol\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI documented my Direct Ascent Mun mission. I was able to land on the Mun, and return to KSC with my entire CSM intact. I splashed down just north of the beach.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/8Uu4T\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/dc8kx8n18wdycsa/Delta_X.craft\u0022 rel=\u0022external nofollow\u0022\u003ECraft\u003C/a\u003E file.\u003C/p\u003E\n"},{"CreatedByName":"Pulsar","CreatedById":83347,"CreatedDateTime":"2013-11-16T09:04:12Z","Content":"\n\u003Cp\u003EPulsar Aerospace proudly present the \u0022Impulse 3 MMO\u0022 (Manned Mun Orbiter). A simple rocket that capable to orbit around the Mun and return. \u003C/p\u003E\u003Cp\u003EFor extra safety, It also come with Launch Escape System.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/FGBb9\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EPart counts: 95\u003C/p\u003E\u003Cp\u003EDelta-V: Approx 7660\u003C/p\u003E\u003Cp\u003ESurface TWR: 2.2\u003C/p\u003E\u003Cp\u003EAction Groups\u003C/p\u003E\u003Cp\u003E1: Toggle Solar Panel\u003C/p\u003E\u003Cp\u003E2: Run science experiments\u003C/p\u003E\u003Cp\u003EAbort: Escape System\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://drive.google.com/file/d/0BwiLvm3OuMo-Vk1yZjlUVE1oWFE/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003ECRAFT HERE\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-18T12:37:22Z\u0022 title=\u002211/18/2013 12:37  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 18, 2013\u003C/time\u003E by Pulsar\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Nao","CreatedById":23462,"CreatedDateTime":"2013-11-16T10:08:03Z","Content":"\n\u003Cp\u003EOhhh finally i get to design something before thread closes \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003ESince now we have career mode i think Kerbal X should be more of an inspiration and technology showcase craft for the sandbox rather than a learning tool. Thats why i decided on a more complicated craft that is \u0022easy to get into but hard to master\u0022.\u003C/p\u003E\u003Cp\u003EI present you The HexaDragon launch system. (former KEX)\u003C/p\u003E\u003Cp\u003EFeatures!\u003C/p\u003E\u003Cp\u003ETriangular based design\u003C/p\u003E\u003Cp\u003EAround 8000m/s dV to play with\u003C/p\u003E\u003Cp\u003EAdditional 1000m/s with optional 3 kerbal escape pod.\u003C/p\u003E\u003Cp\u003ELanding legs for landing on moons and smaller planets.\u003C/p\u003E\u003Cp\u003EReplayable (flexible) design, allowing the player to reach more distant targets through use of creativity and cleverness. (escape pod as a lander, use of drop tanks, special fuel management and manual decoupling)\u003C/p\u003E\u003Cp\u003ENuclear free!\u003C/p\u003E\u003Cp\u003EDesign:\u003C/p\u003E\u003Cp\u003E- 132 parts (82 for lander) including 12 struts only for launcher that serve mostly educational purpose.\u003C/p\u003E\u003Cp\u003E- Minimal clipping (present mostly in optional escape pod)\u003C/p\u003E\u003Cp\u003E- No asparagus (standard) launch system\u003C/p\u003E\u003Cp\u003E- Includes solid boosters for first stage\u003C/p\u003E\u003Cp\u003E- Drop tank system (lander)\u003C/p\u003E\u003Cp\u003E- Followed by asparagus (lander)\u003C/p\u003E\u003Cp\u003E- Optional use of RCS propulsion on escape pod.\u003C/p\u003E\u003Cp\u003EUsage:\u003C/p\u003E\u003Cp\u003E- Fully stable on launchpad without stability enhancers, no wobble in flight\u003C/p\u003E\u003Cp\u003E- High starting TWR for stunning liftoff\u003C/p\u003E\u003Cp\u003E- No calories, no overheats\u003C/p\u003E\u003Cp\u003E- No pollution! launch debris stay in atmosphere.\u003C/p\u003E\u003Cp\u003E- Design encourages better flight profiles (stable and sluggish at first, nimble at gravity turn, long burn time for changing to horizontal flight)\u003C/p\u003E\u003Cp\u003E- 6 landing legs giving stability and redundancy, 2 level landing area illumination.\u003C/p\u003E\u003Cp\u003E- Emergency \u0022escape pod\u0022 in case of crash, lack of fuel, or other mishaps like loss of control, tipping over during landing etc.\u003C/p\u003E\u003Cp\u003E- Parachute system that gently rotates the ship into right position when deployed\u003C/p\u003E\u003Cp\u003E- Excitement increasing system! Creating harmless explosion at touchdown\u003C/p\u003E\u003Cp\u003E- Possible return in escape pod to Kerbin\u003C/p\u003E\u003Cp\u003E- Enough thrust for powered landings on Kerbin\u003C/p\u003E\u003Cp\u003EEducational/showcase\u003C/p\u003E\u003Cp\u003E- ascent efficiency highly dependent on flight profile, not hard to get to orbit, but allows for lot of improvement over several ascents. (refining bad habits)\u003C/p\u003E\u003Cp\u003E- drop tanks \u002B asparagus staging, shows the difference in a less stressful environment (than ascent)\u003C/p\u003E\u003Cp\u003E- use of angled (rotated) parts, notably landing legs, boosters and fuel tanks.\u003C/p\u003E\u003Cp\u003E- RCS for small craft propulsion, idea of emergency systems.\u003C/p\u003E\u003Cp\u003E- encourages no debris left in orbit.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/vj86U\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Ca href=\u0022http://www./download/e88be6sbw8q83x8/HexaDragon.craft\u0022 rel=\u0022external nofollow\u0022\u003EHexaDragon\u003C/a\u003E craft file.\u003C/p\u003E\u003Cp\u003EMore pictures will be uploaded if i have time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E. Oh and if anybody feels like ascent TWR is too low, i have reasoning for that but that\u0027s for another post/discussion (in short it makes the player think and let\u0027s him learn something).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-17T15:06:01Z\u0022 title=\u002211/17/2013 03:06  PM\u0022 data-short=\u002210 yr\u0022\u003ENovember 17, 2013\u003C/time\u003E by Nao\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"BlazeFallow","CreatedById":83905,"CreatedDateTime":"2013-11-16T11:37:35Z","Content":"\n\u003Cp\u003ELadies and Gentlekerbs, may I present the \u003Ca href=\u0022https://drive.google.com/file/d/0B2fFzIpy3c7NMF83aXdpcHBRSk0/edit?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EKerbal XD\u003C/a\u003E. A re-envisioning of the Kerbal X incorporating the Delta Heavy design.\u003C/p\u003E\u003Cp\u003EWhen Jeb saw the folks out at \u0022that space agency which shall not be named\u0022 developing their Delta series lifters he decided it was pretty sweet that they had really big boosters on their rocket so he stole, er... appropriated their design documents. Upon looking over the designs it quickly became apparent that their Delta system obviously had the same fatal flaw that all of their rockets seem to have: not enough boosters. So here we\u0027ve added more boosters in a modified asparagus design so that even the boosters have boosters.\u003C/p\u003E\u003Cp\u003EDesign Details:\u003C/p\u003E\u003Cp\u003E - 181 Parts in 8 stages.\u003C/p\u003E\u003Cp\u003E - roughly 8000 dV\u003C/p\u003E\u003Cp\u003E - Can be kept at full throttle without worrying about lost efficiency to drag until the gravity turn when the rocket should be throttled back to 2/3 power.\u003C/p\u003E\u003Cp\u003E - Separatrons implemented for clean separation of boosters.\u003C/p\u003E\u003Cp\u003E - Plenty of SAS torque for easy maneuverability.\u003C/p\u003E\u003Cp\u003E - Weight of atmospheric maneuvering devices (wings) drops away with the last set of booster tanks to get rid of useless mass.\u003C/p\u003E\u003Cp\u003E - Capable of Mun and Minmus landings with (mostly*) safe return.\u003C/p\u003E\u003Cp\u003E - 2 RTG\u0027s instead of solar panels for constant flow of power even in darkness.\u003C/p\u003E\u003Cp\u003E - Escape Tower with enough TWR to flee from the burning pile of mistakes and regret your lifter may turn into at any point in flight. (Note: you\u0027d have to be trying to break this rocket for it to be necessary)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E*The escape tower can also provide an extra ~300 dV for extra boost to put you on a free return trajectory from the Mun. Depending on when you attempt your Mun escape (pro/retrograde), you may or may not need the extra dV \u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E - Action groups: \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E1: Toggles ladders\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E0: To be used only during Emergency Abort Sequence. Once Escape Tower has burned out, toggle 0 to cut tower away and deploy chutes.\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/xykTo\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-11-18T04:53:07Z\u0022 title=\u002211/18/2013 04:53  AM\u0022 data-short=\u002210 yr\u0022\u003ENovember 18, 2013\u003C/time\u003E by BlazeFallow\u003C/strong\u003E\n\u003Cbr\u003EUpdated link to craft file\n\u003C/span\u003E\n"}]}