{"TopicId":53001,"ForumId":25,"TopicTitle":"[kOS] The Automated Mission Challenge","CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-11-13T20:00:03Z","PageNum":7,"Articles":[{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-12-12T02:33:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thrfoot\u0022 data-cite=\u0022Thrfoot\u0022\u003E\u003Cdiv\u003EI\u0027d be more than willing to amend the rules when you\u0027ve cleaned up your light delay code as you mentioned. The only reason I used the rules I did was because I wanted to avoid using other mods like RemoteTech while still requiring transmission times to be taken into consideration. Because the only time you can be absolutely certain that your craft will not impact anything before it receives the transmission is when it ls landed or in a stable orbit, I decided this was the best restriction I could impose. It would be much fairer and realistic if an actual light delay calculator was used.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOkay, here it is. I got around the \u0022cant\u0027 query selected volume yet\u0022 problem by just making it be a parameter the caller has to give the program, as in \u0022This is the volume I intend to switch back to to run this thing\u0022.\u003C/p\u003E\u003Cp\u003EI changed its name to \u0022kscCmd\u0022, as in \u0022command from Kerbal Space Center\u0022, because in future I\u0027m contemplating other potential radio delays like the delay between two vessels talking to each other, and I wanted to distinguish this from them.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:\u0027Courier New\u0027;\u0022\u003E\u003Cstrong\u003EkscCmd(cmd,vol,fancyPrint).\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003E//KOS - simulate lightspeed delay between\u003Cbr\u003E// craft and home based on distance craft\u003Cbr\u003E// is from archive. Any time you want to issue a\u003Cbr\u003E// command to the vessel manually you must do so\u003Cbr\u003E// via this script in order to simulate the long\u003Cbr\u003E// delays caused by lightspeed.\u003Cbr\u003E//\u003Cbr\u003E// NOTE: This script assumes the following situation:\u003Cbr\u003E// 1.  To execute a command requires a round-trip transmission,\u003Cbr\u003E//  becuase you need to see the craft returning the result back.\u003Cbr\u003E//  So the time it takes to go twice the distance from craft\u003Cbr\u003E//  to Kerbin is used in the calculation.  \u003Cbr\u003E// 2.  An additional pad of 3 seconds is added on top of that \u003Cbr\u003E//  so the code still has an effect when near Kerbin.\u003Cbr\u003E// 3.  The code only simulates the problem of long lag time,\u003Cbr\u003E//  and does NOT address the issue of having to use low bandwith\u003Cbr\u003E//  due to the noise and weak signal across long distances.\u003Cbr\u003E//  Therefore sending 1k to the craft or sending 5k to the craft\u003Cbr\u003E//  takes just as long.  It\u0027s only the initial lag time to get to\u003Cbr\u003E//  the first byte of the transmission started that\u0027s being accounted\u003Cbr\u003E//  for.\u003Cbr\u003E//\u003Cbr\u003E// You are allowed to keep this script on your home archive and run it\u003Cbr\u003E// from there, as it is meant to simulate something initiated from\u003Cbr\u003E// ground control:\u003Cbr\u003E//\u003Cbr\u003E// To run, you do the following:\u003Cbr\u003E//\u003Cbr\u003E//     RUN kscCmd( \u0022command.\u0022, volume , display ).\u003Cbr\u003E//\u003Cbr\u003E// Where \u0022command.\u0022 is any arbitrary KOS command.  Note you DO NEED to\u003Cbr\u003E// include the period at the end of the command inside the string.  Also,\u003Cbr\u003E// if the command string has a literal string embedded inside then you\u003Cbr\u003E// have make it a string variable because you can\u0027t embed quotes inside\u003Cbr\u003E// literal strings in kOS and there\u0027s no way to protect quotes in quotes.\u003Cbr\u003E// (There\u0027s an example of this below).\u003Cbr\u003E//\u003Cbr\u003E// The second argument is the disk volume of the remote craft to\u003Cbr\u003E// use as your selected volume while running the command.\u003Cbr\u003E//\u003Cbr\u003E// The third argument is a boolean 0 or 1 that enables or disables\u003Cbr\u003E// the printing of the countdown timer box.  The countdown timer\u003Cbr\u003E// box is printed under the assumption you are scrolling along\u003Cbr\u003E// and printing your things at the bottom of the terminal window.\u003Cbr\u003E// If you\u0027ve clearscreened before running the timer will appear outside\u003Cbr\u003E// the box.\u003Cbr\u003E//\u003Cbr\u003E// Examples:\u003Cbr\u003E//\u003Cbr\u003E//    Report what\u0027s on the remote drive volume 1, and don\u0027t show the\u003Cbr\u003E//    timer countdown box:\u003Cbr\u003E//      run kscCmd( \u0022LIST.\u0022,1,0).\u003Cbr\u003E//\u003Cbr\u003E//    Report what\u0027s on the remote drive volume 2, and DO show the\u003Cbr\u003E//    timer countdown box:\u003Cbr\u003E//      run kscCmd( \u0022LIST.\u0022,2,1).\u003Cbr\u003E//\u003Cbr\u003E//    Make the remote drive copy a piece of software called program3\u003Cbr\u003E//    from the archive to its volume 1, and then run it, then remove it:\u003Cbr\u003E//      run kscCmd( \u0022copy program3 from 0. run program 3. delete program3.\u0022,1,1).\u003Cbr\u003E//\u003Cbr\u003E//    Print \u0022hello\u0022 on the remote drive.  Note that because you can\u0027t\u003Cbr\u003E//    put quotes inisde quotes, you have to make it a seperate variable to do it:\u003Cbr\u003E//      set arg to \u0022hello\u0022.\u003Cbr\u003E//      run kscCmd( \u0022PRINT arg.\u0022,1,0).\u003Cbr\u003E//\u003Cbr\u003E\u003Cbr\u003Edeclare parameter rdCmd.     // command the vessel is doing.\u003Cbr\u003Edeclare parameter locVol.    // local Volume the command is meant to run on on the remote disk.\u003Cbr\u003Edeclare parameter doDisplay. // true if you want to show the display box, false if not.\u003Cbr\u003E\u003Cbr\u003Eswitch to 0.\u003Cbr\u003Eset lSpd to 299792458. // light speed in m/s.\u003Cbr\u003Eset extraPad to 3. // Extra seconds to wait on top of lightspeed delay\u003Cbr\u003E\u003Cbr\u003E// BODY:DISTANCE is bugged at the moment and returns\u003Cbr\u003E// a number that isn\u0027t allowed to play maths with \u003Cbr\u003E// other numbers (some sort of cast error).  Therefore\u003Cbr\u003E// I\u0027m faking it with POSITION minus kerbin radius:\u003Cbr\u003Eset kerbDist to KERBIN:POSITION:MAG - 600000.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E// Let\u0027s assume a round-trip transmit is required:\u003Cbr\u003Eset totDelay to ( kerbDist*2 / lSpd ) \u002B extraPad.\u003Cbr\u003Eprint \u0022RADIO DELAY FROM KSC IS: \u0022 \u002B \u003Cbr\u003E\tfloor(totDelay/60) \u002B \u0022 min, \u0022 \u002B\u003Cbr\u003E\tfloor(mod(totDelay,60)) \u002B \u0022 sec.\u0022.\u003Cbr\u003Eif doDisplay {\u003Cbr\u003E  print \u0022\u002B-----------------------------------\u002B----------\u0022.\u003Cbr\u003E  print \u0022| \u0022 \u002B rdCmd.\u003Cbr\u003E  print \u0022\u002B-----------------------\u002B----------------------\u0022.\u003Cbr\u003E  print \u0022| MY DISTANCE TO KERBIN = \u0022 \u002B round(kerbDist,0) \u002B \u0022 m\u0022.\u003Cbr\u003E  print \u0022\u002B-----------------------\u002B---------------------\u002B\u0022.\u003Cbr\u003E  print \u0022| RADIO DELAY REMAINING:|                     |\u0022.\u003Cbr\u003E  print \u0022\u002B---------------------------------------------\u002B\u0022.\u003Cbr\u003E}.\u003Cbr\u003Eset startTime to time:seconds.\u003Cbr\u003Eset dLeft to totDelay.\u003Cbr\u003Euntil dLeft \u0026lt;= 0 {\u003Cbr\u003E  if doDisplay {\u003Cbr\u003E    print \u003Cbr\u003E\tfloor(dLeft/60) \u002B \u0022 min, \u0022 \u002B\u003Cbr\u003E\tfloor(mod(dLeft,60)) \u002B \u0022 sec.   \u0022 at (26,34).\u003Cbr\u003E  }.\u003Cbr\u003E  set dLeft to totDelay - (time:seconds - startTime).\u003Cbr\u003E  wait 1.\u003Cbr\u003E}.\u003Cbr\u003Eif doDisplay { print \u0022Done          \u0022 at (26,34). }.\u003Cbr\u003Eprint \u0022RADIO DELAY OVER.\u0022.\u003Cbr\u003E\u003Cbr\u003E//  ===== Self modifying code to run rdCmd: =====\u003Cbr\u003E// Clear old file, making sure it exists first\u003Cbr\u003E// so delteing it won\u0027t give an error if it doesn\u0027t:\u003Cbr\u003Elog \u0022dummyline\u0022 to delayCmd.\u003Cbr\u003Edelete delayCmd.\u003Cbr\u003E// wrap command with \u0027switch to \u0027locVol  and \u0027switch to archive.\u0027:\u003Cbr\u003Elog \u0022switch t\u0022 \u002B \u0022o \u0022 \u002B locVol \u002B \u0022.\u0022 to delayCmd.\u003Cbr\u003Elog rdCmd to delayCmd.\u003Cbr\u003Elog \u0022switch t\u0022 \u002B \u0022o 0.\u0022 to delayCmd.\u003Cbr\u003E// run it:\u003Cbr\u003Erun delayCmd.\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-12-12T21:14:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EOkay, here it is. I got around the \u0022cant\u0027 query selected volume yet\u0022 problem by just making it be a parameter the caller has to give the program, as in \u0022This is the volume I intend to switch back to to run this thing\u0022.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOne thing it does NOT do is automatically time warp through the delay for you. I probably could add that as an optional parameter for people that want that.\u003C/p\u003E\n"},{"CreatedByName":"JoCRaM","CreatedById":84138,"CreatedDateTime":"2013-12-12T22:16:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EUhm. No. You can\u0027t be seroiusly trying to pretend this is analogous to anything in the real world. First off real world computers can clear RAM without naming each variable individually. Secondly bad software even if that accusstion wasnt bull**** still does not make half the vessel vanish from reality. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry, I was unclear: a well written KerbalScript 0.9.2 prgram clears problematic varibales before it finsihes. in general it\u0027s only a few that you need to worry about - strings, and values that may become very small or large, and vessels\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EStop pretending this is even remotely like a real world problem. I won\u0027t insult your intelligence by pretending you believe what you said.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat one works around problems in the software envirnment \u003Cstrong\u003Eis\u003C/strong\u003E a real world practice, and as an anecdote, back in 1991, I wrote chemical plant control software and the compilers\u0027 optimiser had a glitch whereby it would fail to return the value of a variable it had optimised into a register. To work around this many of my functions ended\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E  return val;\u003Cbr\u003E  stoopid_compiler(*val);\u003Cbr\u003E}\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EAnd, tongue in cheek, it\u0027s just possible that failure to do this, coupled with failure of mechanical saftey systms may well have caused half a (pressure) vessel to (metaphorically) disappear from reality.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003E\u003Cbr\u003EDECLARE PARAMETER att_message.\u003Cbr\u003EDECLARE PARAMETER att_start.\u003Cbr\u003E\u003Cbr\u003ESET att_plus TO \u0022\u002B\u0022. IF TIME:SECONDS\u0026lt;att_start {SET att_plus to \u0022-\u0022.}.\u003Cbr\u003E\u003Cbr\u003EPRINT att_message \u002B \u0022 at t\u0022\u002Batt_plus\u002B ROUND(time:seconds-att_start,1).\u003Cbr\u003ELOG time:seconds \u002B\u0022|\u0022\u002B att_start \u002B\u0022|\u0022\u002B MISSIONTIME\u003Cbr\u003E    \u002B\u0022|\u0022\u002B VESSELNAME\u003Cbr\u003E    \u002B\u0022|\u0022\u002B VELOCITY:ORBIT:VEC \u002B\u0022|\u0022\u002B BODY \u002B\u0022|\u0022\u002B BODY(BODY):POSITION\u003Cbr\u003E    \u002B\u0022|\u0022\u002B att_message\u003Cbr\u003E    TO missionlog.\u003Cbr\u003E\u003Cbr\u003E//load/save bug...\u003Cbr\u003ESET att_plus TO 0. SET att_message TO 0.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-12-13T05:43:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JoCRaM\u0022 data-cite=\u0022JoCRaM\u0022\u003E\u003Cdiv\u003ESorry, I was unclear: a well written KerbalScript 0.9.2 prgram clears problematic varibales before it finsihes. in general it\u0027s only a few that you need to worry about - strings, and values that may become very small or large, and vessels\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYou were clear. I am well aware of your incorrect claim. When you make the claim you did, you are pretending there isn\u0027t anything in need of being fixed about the underlying system because you\u0027ve put the blame on the higher level code instead for a problem that it didn\u0027t cause. You are also pretending that it would be possible in the real world for a software error to edit the laws of physics themselves and cause the impossible to happen when you claim this has any similar analogy to real world situations. No autopilot for a real world airplane, no matter how badly written, can cause the universe to delete the wings from the fabric of reality itself. Break them by abusing the plane? sure. Have them not break but in fact literally vanish from reality? No.\u003C/p\u003E\u003Cp\u003ENo real world program can cause the laws of physics to break. If you *could* you\u0027d have a Nobel prize on your hands. But the software that controls a simulation can cause the fake laws of physics inside the simulation to break. And when that happens, there is no analogy to be made with real world software for that situation. None.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EAnd, tongue in cheek, it\u0027s just possible that failure to do this, coupled with failure of mechanical saftey systms may well have caused half a (pressure) vessel to (metaphorically) disappear from reality.\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EBad analogy. You\u0027re talking about a thing that is possible in reality and then choosing to deliberately describe it incorrectly because if you described it correctly it would undermine your point. Described correctly, a chemical explosion is not causing matter to \u0022disappear from reality\u0022 like what happens when kOS fails to load the vessel because it can\u0027t parse the format that kOS itself used to store the vessel.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-13T05:53:26Z\u0022 title=\u002212/13/2013 05:53  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 13, 2013\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-12-13T16:32:33Z","Content":"\n\u003Cp\u003EOk, ok. Lets stop arguing about whether or not kOS\u0027s bugs are analogous to the real wold in this thread please. If you guys want to continue to debate, please do so through PM. Thanks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAlso, Steven Mading, I\u0027ll probably get around to modifying the rules to allow the delay program in the next few days. My midterms are coming up so I\u0027m a bit pressed for free time right now.\u003C/p\u003E\n"},{"CreatedByName":"Sacred Aardvark","CreatedById":85856,"CreatedDateTime":"2013-12-13T16:42:30Z","Content":"\n\u003Cp\u003E[edit] Sorry Thrfoot, you hadn\u0027t posted when I started typing this \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E I\u0027ll shut up now \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_lipssealed.gif\u0022 alt=\u0022:sealed:\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EYou were clear. I am well aware of your incorrect claim. When you make the claim you did, you are pretending there isn\u0027t anything in need of being fixed about the underlying system because you\u0027ve put the blame on the higher level code instead for a problem that it didn\u0027t cause. You are also pretending that it would be possible in the real world for a software error to edit the laws of physics themselves and cause the impossible to happen when you claim this has any similar analogy to real world situations. No autopilot for a real world airplane, no matter how badly written, can cause the universe to delete the wings from the fabric of reality itself. Break them by abusing the plane? sure. Have them not break but in fact literally vanish from reality? No.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI think you are missing the point, I guess you\u0027re maybe taking this as an assault against your programming skills or something, I thought the comment was intended as a bit humorous with the smiley and all, not a claim that kOS doesn\u0027t have an issue. The argument \u003Cem\u003EI think\u003C/em\u003E JoCRaM was making is that yes there is a problem in kOS, but a coder could take the problem into account and take steps to prevent it from happening with his program. Which is true, a program can be coded to work around and minimize the probability of a kOS variable persistence bug, despite your claims for this being impossible. (okay, a crash at an inopportune moment will still ruin your day if it happens before you\u0027re ready to save) Now, in kOS you can\u0027t just reset all variables easily for saving and random crashes do happen, so \u003Cstrong\u003EI do agree that it is impractical and should not be necessary\u003C/strong\u003E, but stop pretending like it could not be done at all.\u003C/p\u003E\u003Cp\u003EThis whole good/bad code thing is a bit philosophical anyway. If there is nothing wrong in the program per se, it can\u0027t be badly coded, but if it doesn\u0027t take into account the limitations of the environment it is running in and therefore can cause ship breaking bugs, can the program be well coded? Well, yes I guess, but does that turn a program that is well coded and takes into account the limitations of the run environment minimizing the chance of bugs appearing into great coding? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m also not clear on the relevant difference between a part going bye bye because of a kOS-Kraken or because of an explosion. In both cases the end result is the same, a part goes poof, though of course the possibility of it happening IRL, the timeframe of the event and the resulting debris is different, but none of these are that relevant to whether you can or should work around it in code. If the parts exploded on load instead of disappearing(or decouplers fired randomly or whatever realistic thing as opposed to a magical vanish), would you be okay working around the problem in a kOS-program until a fix comes out, since it no longer breaks the laws of physics? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnyway, after all that rambling my take on this matter in the end is in support of you. One should be allowed to edit the persistence file to work around the variable-persistence-kOS-bug-thing for this challenge. Because of the game-breakingness of the bug it\u0027s probably on the top of the fix-list when/if Kevin comes back and then such bug workarounds become redundant bits of code. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_undecided.gif\u0022 alt=\u0022:huh:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027ll tip my proverbial hat for anyone who does work around the bug inside the code, but in my opinion it shouldn\u0027t be a requirement, merely a personal choice on the method of banging your head against the persistence-bug before it\u0027s fixed. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_huh.gif\u0022 alt=\u0022:confused:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-13T16:44:57Z\u0022 title=\u002212/13/2013 04:44  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 13, 2013\u003C/time\u003E by Sacred Aardvark\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Bobnova","CreatedById":75385,"CreatedDateTime":"2013-12-14T04:38:19Z","Content":"\n\u003Cp\u003EOK here\u0027s my NASA style mun mission.\u003C/p\u003E\u003Cp\u003EIt\u0027s entirely scripted, nothing is calculated on the fly (excluding staging). Does hit Mun SOI and get back to kerbin and land on landing legs though! Reliably, even. Sometimes it breaks half the solar panels off on launch, don\u0027t know why, there isn\u0027t anything they can hit. This is one of the runs where it did that.\u003C/p\u003E\u003Cp\u003EMay have gone slightly overboard on the screenshots, I was awfully pleased with myself.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/HwJ1i\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EIt does Science, too!\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv\u003E\u003C/div\u003E\u003Cpre class=\u0022ipsCode\u0022\u003Elock steering to UP \u002B R(0,0,180).\u003Cbr\u003Elock throttle to 1.\u003Cbr\u003Ewait until time \u0026gt; 402627060.\u003Cbr\u003Eprint \u0022launch in ten.\u0022.\u003Cbr\u003Ewait until time \u0026gt; 402627065.\u003Cbr\u003Eprint \u0022launch in five.\u0022.\u003Cbr\u003Ewait until time \u0026gt; 402627070.\u003Cbr\u003Estage.\u003Cbr\u003Eprint \u0022wheeee!  Liftoff at \u0022 \u002B time.\u003Cbr\u003Ewait until altitude \u0026gt; 7500.\u003Cbr\u003Eprint \u00227500m gravity turn.\u0022.\u003Cbr\u003Elock steering to UP \u002B R(0,0,180) \u002B R(0,-50,0).\u003Cbr\u003Ewhen stage:liquidfuel \u0026lt; 1 then stage.\u003Cbr\u003Eprint \u0022Outta fuel, staging.\u0022.\u003Cbr\u003Ewait until altitude \u0026gt; 20000.\u003Cbr\u003Eprint \u0022more gravity turn!\u0022.\u003Cbr\u003Elock steering to UP \u002B R(0,0,180) \u002B R(0,-65,0).\u003Cbr\u003Ewait until apoapsis \u0026gt; 75000.\u003Cbr\u003Eprint \u0022High enough. Coasting.\u0022.\u003Cbr\u003Elock throttle to 0.\u003Cbr\u003Elock steering to prograde.\u003Cbr\u003Ewait until eta:apoapsis \u0026lt; 26.\u003Cbr\u003E\u003Cbr\u003Elock throttle to 1.\u003Cbr\u003Eprint \u0022Making a circle-ish out of it.\u0022.\u003Cbr\u003Ewait until periapsis \u0026gt; 71000.\u003Cbr\u003Elock throttle to 0.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Etoggle AG4.\u003Cbr\u003Eprint \u0022Good enough.\u0022.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Elock steering to heading 270 by 0.\u003Cbr\u003Ewait 30.\u003Cbr\u003Eset warp to 2.\u003Cbr\u003Eset target to mun.\u003Cbr\u003Ewait until time \u0026gt; 402628400.\u003Cbr\u003Eset warp to 1.\u003Cbr\u003Ewait until time \u0026gt; 402628560.\u003Cbr\u003Eset warp to 0.\u003Cbr\u003E\u003Cbr\u003Eprint \u0022Off to Mun.\u0022.\u003Cbr\u003Elock steering to heading 90 by 0.\u003Cbr\u003Ewait until time \u0026gt;402628590.\u003Cbr\u003Elock steering to heading 90 by 0.\u003Cbr\u003Elock throttle to 1.\u003Cbr\u003Ewait 38.\u003Cbr\u003Elock throttle to zero.\u003Cbr\u003E\u003Cbr\u003E\u003Cbr\u003Ewait until altitude \u0026gt; 1900000.\u003Cbr\u003Ewait until altitude \u0026lt; 800000.\u003Cbr\u003Etoggle AG3.\u003Cbr\u003Ewait until altitude \u0026lt; 80000.\u003Cbr\u003Etoggle AG4.\u003Cbr\u003Elock steering to retrograde.\u003Cbr\u003Ewait until alt:radar \u0026lt; 8000.\u003Cbr\u003Etoggle AG1.\u003Cbr\u003E\u003Cbr\u003Ewait until alt:radar \u0026lt; 450.\u003Cbr\u003Etoggle AG2.\u003C/pre\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003EI calculate this as 2 points, as my Mun orbit wasn\u0027t exactly stable. Unless returning from a free-return Mun trip counts as returning from Mun orbit, in which case three. I\u0027m guessing two though.\u003C/p\u003E\u003Cp\u003EThis is a lot of fun \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-14T04:43:44Z\u0022 title=\u002212/14/2013 04:43  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 14, 2013\u003C/time\u003E by Bobnova\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoCRaM","CreatedById":84138,"CreatedDateTime":"2013-12-14T10:23:32Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EYou were clear. I am well aware of your incorrect claim. When you make the claim you did, you are pretending there isn\u0027t anything in need of being fixed \u003C/div\u003E\u003C/blockquote\u003EPoppycock. I\u0027ve already stated my opinion that kOS isn\u0027t ready for this sort of challenge, I\u0027ve expanded the kOS issue tracker for this with further variable types that cause issues. \u003Cp\u003Ethere are actually three bugs here \u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003Ethe kebalscript interpreter can\u0027t parse its state dumps. (that\u0027s an \u0022in game\u0022 bug, and like the unterminated string or brace bugs I\u0027m happy for them to stand)\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ethe seconds is that the kOS game mod allows kerbalscript bugs to break it. unterminated strings, missing closing braces and state dump problems should simply result in a briked kOS computer, that a reboot may or may not fix.\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003Ethe third is a KSP bug, a mod thorwing an exception should not cause the craft to load nor the game to fail.\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003ENo real world program can cause the laws of physics to break. If you *could* you\u0027d have a Nobel prize on your hands. But the software that controls a simulation can cause the fake laws of physics inside the simulation to break. And when that happens, there is no analogy to be made with real world software for that situation. None.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell, in the real world, the KeralScript bug would brick the kOS computer. your mission is still screwed. You work around the probelms in the run-time envrironment. Stop pretending that the fact it breaks \u0022physics\u0022 makes it a special case.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-14T10:39:26Z\u0022 title=\u002212/14/2013 10:39  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 14, 2013\u003C/time\u003E by JoCRaM\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-12-14T11:50:55Z","Content":"\n\u003Cp\u003EI did this a while ago. Alas, I do not think this qualifies according to the rules. However I thought people here might be interested. An honorable mention mebe?\u003C/p\u003E\u003Cp\u003EAnyhows... This is a K-prize qualifying run, all under kOS control. Clicky pic below to play. Video is on Skydrive.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://skydrive.live.com/?cid=49158b6f83f01ff0\u0026amp;id=49158B6F83F01FF0%21105#cid=49158B6F83F01FF0\u0026amp;id=49158B6F83F01FF0%21112\u0026amp;v=3\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cimg src=\u0022http://farm4.staticflickr.com/3684/10771511616_d3cfd4d8bb_o.png\u0022 alt=\u002210771511616_d3cfd4d8bb_o.png\u0022\u003E\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"adammada","CreatedById":29884,"CreatedDateTime":"2013-12-14T19:09:42Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bsalis\u0022 data-cite=\u0022bsalis\u0022\u003E\u003Cdiv\u003EHowever I thought people here might be interested.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EReally nice plane. You had spaceplane autoland program? Can you share?\u003C/p\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-12-14T23:59:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JoCRaM\u0022 data-cite=\u0022JoCRaM\u0022\u003E\u003Cdiv\u003EWell, in the real world, the KeralScript bug would brick the kOS computer. your mission is still screwed. You work around the probelms in the run-time envrironment. Stop pretending that the fact it breaks \u0022physics\u0022 makes it a special case.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJoCRaM, I\u0027m going to give you the benefit of the doubt and assume that you didn\u0027t see my earlier post. I \u003Cem\u003Edo not\u003C/em\u003E want to see any more posting related to this argument in this thread. This tread is for the Automated Mission Challenge, not debating kOS\u0027s bugs, and while I will tolerate the occasional side-conversation, this argument is showing no signs of being resolved any time soon. Hopefully I won\u0027t have to, but if I see another post furthering this argument in this thread, I\u0027ll have no choice but to bring this issue to the moderators. If you absolutely \u003Cem\u003Emust\u003C/em\u003E continue arguing about this, please do so in PM, not here. Thanks. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Bobnova\u0022 data-cite=\u0022Bobnova\u0022\u003E\u003Cdiv\u003EOK here\u0027s my NASA style mun mission.\u003Cp\u003EIt\u0027s entirely scripted, nothing is calculated on the fly (excluding staging). Does hit Mun SOI and get back to kerbin and land on landing legs though! Reliably, even. Sometimes it breaks half the solar panels off on launch, don\u0027t know why, there isn\u0027t anything they can hit. This is one of the runs where it did that.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice work! I\u0027ll add you to the leaderboards as soon as I get a chance. Edit: Done!\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bsalis\u0022 data-cite=\u0022bsalis\u0022\u003E\u003Cdiv\u003EI did this a while ago. Alas, I do not think this qualifies according to the rules. However I thought people here might be interested. An honorable mention mebe?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EActually, I don\u0027t see anything in that video that would disqualify it. Unless I\u0027m missing something, you could consider that an entry if you want. It\u0027d only be worth 2 points though. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-15T00:06:54Z\u0022 title=\u002212/15/2013 12:06  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 15, 2013\u003C/time\u003E by Thrfoot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"JoCRaM","CreatedById":84138,"CreatedDateTime":"2013-12-15T11:33:03Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thrfoot\u0022 data-cite=\u0022Thrfoot\u0022\u003E\u003Cdiv\u003EActually, I don\u0027t see anything in that video that would disqualify it.\u003C/div\u003E\u003C/blockquote\u003E the vessel contains Kerbal(s).\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-12-15T12:14:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022JoCRaM\u0022 data-cite=\u0022JoCRaM\u0022\u003E\u003Cdiv\u003Ethe vessel contains Kerbal(s).\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYup, and MechJeb too (though i did not use it obviously). I actually copy-hacked the MJ part to have both MJ and kOS functionality actually, which is pretty neat.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022adammada\u0022 data-cite=\u0022adammada\u0022\u003E\u003Cdiv\u003EReally nice plane. You had spaceplane autoland program? Can you share?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWell the program flew the whole mission. \u003Ca href=\u0022http://users.on.net/~bsalis/kOsKprize.txt\u0022 rel=\u0022external nofollow\u0022\u003EYou can find it here.\u003C/a\u003E\u003C/p\u003E\u003Cp\u003ENote that the program is specific to the craft, but the algorithms can be tweaked and adapted to another SSTO Spaceplane.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-12-16T07:20:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Thrfoot\u0022 data-cite=\u0022Thrfoot\u0022\u003E\u003Cdiv\u003EJoCRaM, I\u0027m going to give you the benefit of the doubt and assume that you didn\u0027t see my earlier post. I \u003Cem\u003Edo not\u003C/em\u003E want to see any more posting related to this argument in this thread. This tread is for the Automated Mission Challenge, not debating kOS\u0027s bugs, and while I will tolerate the occasional side-conversation, this argument is showing no signs of being resolved any time soon. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EKeep in mind that it was an argument about what to allow FOR THIS CHALLENGE. Had JoCRaM\u0027s argument convinced you it would affect the rules of the challenge.\u003C/p\u003E\u003Cp\u003ESo it mattered to the contest. It wasn\u0027t off topic.\u003C/p\u003E\u003Cp\u003EOn the subject of that ruling, I\u0027d be perfectly fine with making it dependent on kOS version so that assuming progress on kOS does resume at some point and the bug fix does make its way into a working official release, this rules exception about the persistence file goes away at that point.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T13:11:27Z\u0022 title=\u002212/16/2013 01:11  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2013-12-16T07:28:28Z","Content":"\n\u003Cp\u003E@bsalis, Technically the rules only say there can\u0027t be Kerbals on board. It doesn\u0027t say there can\u0027t be crew modules *capable of* holding Kerbals. So if having a Kerbal on board becomes an issue that people use to dispute your entry, you could just run it again with the exact same design of ship, but just make sure the cockpit is empty when you take off.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-16T09:11:24Z\u0022 title=\u002212/16/2013 09:11  AM\u0022 data-short=\u002210 yr\u0022\u003EDecember 16, 2013\u003C/time\u003E by Steven Mading\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-12-16T16:16:16Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003EKeep in mind that it was an argument about what to allow FOR THIS CHALLENGE. Had JoCRaM\u0027s argument convinced you it would affect the rules of the challenge.\u003Cp\u003ESo it mattered to the contest. It wasn\u0027t off topic.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJoCRaM never directly challenged my decision to allow persistence editing, he merely pointed out it was not the only solution, and thus was, in his mind, was unnecessary. It is for this reason that I did not get involved in the argument, as well as because he had not yet provided me with a compulsive reason that persistence editing should \u003Cem\u003Enot\u003C/em\u003E be allowed. However the argument the two of you were having, while it started off because of JoCRaM\u0027s comment, was more about whether or not kOS\u0027s game-crippling bugs were analogous to real world problems and should be handled as such than if persistence editing should be allowed. I decided to pull the plug before it got out of hand and cluttered up the thread. Not to mention I probably would have done the same at some point even it it was about the challenge.\u003C/p\u003E\u003Cp\u003EHowever, all I am asking is that this argument not continue in this thread. If the two of you want to finish it off in PM, I have no problem with that. You can also PM me if you disagree with my decision to allow persistence editing. But for now, my decision remains unchanged.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EOn the subject of that ruling, I\u0027d be perfectly fine with making it dependent on kOS version so that assuming progress on kOS does resume at some point and the bug fix does make its way into a working official release, this rules exception about the persistence file goes away at that point.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYep, that\u0027s the current plan. The challenge will (hopefully) always assume that the user is using the latest version of kOS, so if and when the bugs persistence editing fixes are resolved, I will remove persistence editing from the rules. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003E@bsalis, Technically the rules only say there can\u0027t be Kerbals on board. It doesn\u0027t say there can\u0027t be crew modules *capable of* holding Kerbals. So if having a Kerbal on board becomes an issue that people use to dispute your entry, you could just run it again with the exact same design of ship, but just make sure the cockpit is empty when you take off.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI specifically wrote the rules as I did to allow this, in case people had made similar missions with kerbals on board. This way all they have to do to validate their entry is to dump their \u0022cargo\u0022 before takeoff. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E\u003C/p\u003E\u003Cp\u003ESo bsalis, if you are at all interested in making a valid entry out of that mission, I believe it\u0027ll require extremely few (if any) modifications to your existing design.\u003C/p\u003E\n"},{"CreatedByName":"bsalis","CreatedById":32928,"CreatedDateTime":"2013-12-17T09:36:42Z","Content":"\n\u003Cp\u003EMy kOS K-Prize run was done as a personal challenge before I know of this Challenge. I may give a legit run again sometime, mebe even kick it up a notch and trying a VTOL landing instead of a glide. (i started working on a hover algorithm a while ago but lost interest)\u003C/p\u003E\u003Cp\u003EIn any case - I know the K-prize Challenge has a Gatecrashers list. No reason you can\u0027t have your own.\u003C/p\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2013-12-17T14:03:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022bsalis\u0022 data-cite=\u0022bsalis\u0022\u003E\u003Cdiv\u003EIn any case - I know the K-prize Challenge has a Gatecrashers list. No reason you can\u0027t have your own.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point. I\u0027ll go ahead and make an honorable mentions section. Your mission is definitely impressive enough to earn a spot in it. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EEdit: jpaverly was kind enough to make an extremely awesome mission patch for this challenge. He\u0027s currently taking requests here: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/61589-KSP-Mission-Patches-Requests-accepted\u0022 rel=\u0022external nofollow\u0022\u003Elink\u003C/a\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-17T23:15:06Z\u0022 title=\u002212/17/2013 11:15  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 17, 2013\u003C/time\u003E by Thrfoot\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"TheGreatFez","CreatedById":82922,"CreatedDateTime":"2014-01-03T18:19:08Z","Content":"\n\u003Cp\u003EHello all,\u003C/p\u003E\u003Cp\u003EI was told to try and post my endeavor here on this thread. I created an automated flight to land on Mun and back to Kerbin. The reason I did this was to have something cool to put on my resume that involved orbital mechanics to apply to SpaceX.\u003C/p\u003E\u003Cp\u003EI compiled the flight into a video explaining what I did technically speaking. Here is the link to the video (audio might be a bit bad but its my first video ever \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_tongue.gif\u0022 alt=\u0022:P\u0022\u003E).\u003C/p\u003E\u003Cp\u003E\n\u003C/p\u003E\u003Cdiv class=\u0022ipsEmbeddedVideo\u0022 contenteditable=\u0022false\u0022\u003E\u003Cdiv\u003E\u003Ciframe width=\u0022480\u0022 height=\u0022270\u0022 src=\u0022https://www.youtube.com/embed/ecZQ-Qn1EVQ?feature=oembed\u0022 frameborder=\u00220\u0022 allowfullscreen=\u0022true\u0022\u003E\u003C/iframe\u003E\u003C/div\u003E\u003C/div\u003E\u003Cp\u003EI dont know if this counts as an official post to the challenge but I figured a video would be sufficient instead of screen shots.\u003C/p\u003E\u003Cp\u003EProblems I see: \u003C/p\u003E\u003Cp\u003E-I use Engineer to get data read outs. I know its supposed to be all stock so if this disqualifies me I understand.\u003C/p\u003E\u003Cp\u003E-The video is meant to show just the major technical achievements so its cut in places to shorten the 30 trip to about 10 min. I dont know if that would change the validity of my post.\u003C/p\u003E\u003Cp\u003E-If you need the code/craft files I can give them to you here but in the link to the video there is a link to the craft files and code in the description if you are interested.\u003C/p\u003E\u003Cp\u003EPlease let me know if this is acceptable as a post and if not please let me know how I can make it acceptable! Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-09T20:37:03Z","Content":"\n\u003Cp\u003ESo, for the future of this challengeÃ¢â‚¬Â¦. what are the possible ways to deal with the fact that the official public release of kOS won\u0027t run on KSP 0.23 and we can\u0027t assume Kevin will be coming back any time soon to rectify that?\u003C/p\u003E\u003Cp\u003EI see two possible approaches (if you see another one let me know):\u003C/p\u003E\u003Cp\u003E1 - Keep the use of stock kOS from the spaceport, but then also state that the challenge must be performed on an install of KSP that\u0027s on the old version (0.22) that kOS used to work for. If you don\u0027t have access to a 0.22 installation of KSP then too bad you can\u0027t participate.\u003C/p\u003E\u003Cp\u003E2 - Allow people to start using 0.23 of kOS but then that means picking some sort of semi- official version of kOS that people have been compiling and putting up themselves on cloud hosted public shares as the baseline for the challenge.\u003C/p\u003E\u003Cp\u003EThe problem with allowing privately compiled own-versions of kOS is that there can be lots of slightly different versions with lots of slightly different features and fixes - so you\u0027d have to pick just one of them and keep it the official one for the challenge.\u003C/p\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2014-01-10T14:44:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022TheGreatFez\u0022 data-cite=\u0022TheGreatFez\u0022\u003E\u003Cdiv\u003EHello all,\u003Cp\u003EI was told to try and post my endeavor here on this thread. I created an automated flight to land on Mun and back to Kerbin. The reason I did this was to have something cool to put on my resume that involved orbital mechanics to apply to SpaceX.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI haven\u0027t yet had time to view your video, but good luck making it into SpaceX! I know that\u0027s where I\u0027m going to try to get a job when I get out of college. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDIT 1/13/14:\u003C/strong\u003E Ok I took a look at your video and am sorry to say it does not qualify as an entry. However, it would be very easy to modify it so it does. Here\u0027s what you need to change:\u003C/p\u003E\u003Cp\u003E1. Remove the kerbal from the manned pod prior to launch. The challenge necessitates that the mission be unmanned.\u003C/p\u003E\u003Cp\u003E2. Only execute programs from either stable orbits or when landed on the surface of a body. It would be easiest to just run each of your \u0022phase\u0022 programs from a master program with a time delay between each.\u003C/p\u003E\u003Cp\u003E3. Remove Kerbal Engineer (I wouldn\u0027t have turned down your attempt if this was the only rule violation, but since you have to re-do it anyway you might as well remove it for the challenge run)\u003C/p\u003E\u003Cp\u003EI might have missed something, so it wouldn\u0027t hurt to run through the rules yourself just in case.\u003C/p\u003E\u003Cp\u003EIts also worth noting that you won\u0027t need a video of the mission, just screenshots documenting the process. You\u0027re welcome to make a video if you want to though. Good luck! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Steven Mading\u0022 data-cite=\u0022Steven Mading\u0022\u003E\u003Cdiv\u003ESo, for the future of this challengeÃ¢â‚¬Â¦. what are the possible ways to deal with the fact that the official public release of kOS won\u0027t run on KSP 0.23 and we can\u0027t assume Kevin will be coming back any time soon to rectify that?\u003Cp\u003EI see two possible approaches (if you see another one let me know):\u003C/p\u003E\u003Cp\u003E1 - Keep the use of stock kOS from the spaceport, but then also state that the challenge must be performed on an install of KSP that\u0027s on the old version (0.22) that kOS used to work for. If you don\u0027t have access to a 0.22 installation of KSP then too bad you can\u0027t participate.\u003C/p\u003E\u003Cp\u003E2 - Allow people to start using 0.23 of kOS but then that means picking some sort of semi- official version of kOS that people have been compiling and putting up themselves on cloud hosted public shares as the baseline for the challenge.\u003C/p\u003E\u003Cp\u003EThe problem with allowing privately compiled own-versions of kOS is that there can be lots of slightly different versions with lots of slightly different features and fixes - so you\u0027d have to pick just one of them and keep it the official one for the challenge.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWe\u0027ll probably go with option #2. I know nothing about modding KSP, so if you or someone else would be willing to handle updating it to 0.23 I can put a link up on the main page. We\u0027ll just run with that until Kevin (hopefully) returns and releases an official version.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-01-12T23:15:16Z\u0022 title=\u002201/12/2014 11:15  PM\u0022 data-short=\u002210 yr\u0022\u003EJanuary 12, 2014\u003C/time\u003E by Thrfoot\u003C/strong\u003E\n\u003Cbr\u003EWatched video\n\u003C/span\u003E\n"},{"CreatedByName":"Pds314","CreatedById":70014,"CreatedDateTime":"2014-01-26T00:31:53Z","Content":"\n\u003Cp\u003ERandom question: is there a reasonable way to do the logical equivalent of an if-else in polynomial time or (ppreferably) in linear time?\u003C/p\u003E\n"},{"CreatedByName":"TelluriumCrystal","CreatedById":25647,"CreatedDateTime":"2014-01-27T06:02:28Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pds314\u0022 data-cite=\u0022Pds314\u0022\u003E\u003Cdiv\u003ERandom question: is there a reasonable way to do the logical equivalent of an if-else in polynomial time or (ppreferably) in linear time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI don\u0027t even know what polynomial and linear time are. My programming knowledge only dips into the intermediate levels. You might have better luck asking around in the kOS mod thread.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-01-29T14:42:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Pds314\u0022 data-cite=\u0022Pds314\u0022\u003E\u003Cdiv\u003ERandom question: is there a reasonable way to do the logical equivalent of an if-else in polynomial time or (ppreferably) in linear time?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ETwo problems with this:\u003C/p\u003E\u003Cp\u003E1 - An if/else is not a looping mechanism. As a mechanism that can only branch forward (not backward), discussions of algorithm timings sort of don\u0027t apply. You need some concept of looping and therefore a count of \u0022how many iterations\u0022 of it for that sort of question to be meaningful (to me).\u003C/p\u003E\u003Cp\u003E2 - This is the wrong thread anyway. Questions about the language itself rather than about this challenge *using* the language should go in the mod showcase thread for kOS.\u003C/p\u003E\n"},{"CreatedByName":"Dunbaratu","CreatedById":63481,"CreatedDateTime":"2014-02-06T09:27:06Z","Content":"\n\u003Cp\u003EAny chance of resurrecting the challenge, using this new continuation of the mod:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/68089-0-23-kOS-Scriptable-Autopilot-System-v0-10/\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/68089-0-23-kOS-Scriptable-Autopilot-System-v0-10/\u003C/a\u003E\u003C/p\u003E\n"}]}