{"TopicId":56627,"ForumId":25,"TopicTitle":"The LV-1R Challenge.","CreatedByName":"BadEnoughDudez","CreatedById":96916,"CreatedDateTime":"2013-12-18T04:35:15Z","PageNum":1,"Articles":[{"CreatedByName":"BadEnoughDudez","CreatedById":96916,"CreatedDateTime":"2013-12-18T04:35:15Z","Content":"\n\u003Cp\u003EI\u0027ll keep this short and sweet.\u003C/p\u003E\u003Cp\u003EThe scientific team on Kerbal has decided that the amount of waste products put into the atmosphere by large engines are damaging the environment too heavily.\u003C/p\u003E\u003Cp\u003EThanks to impending global warming, political types have agreed, and have placed a blanket ban on all engines.\u003C/p\u003E\u003Cp\u003EExcept, the LV-1 and LV-1R.\u003C/p\u003E\u003Cp\u003EBut space exploration must continue! We cannot be stopped! As such, the Kerbal Space Program has issued a challenge to it\u0027s best and brightest to see what can be done.\u003C/p\u003E\u003Cp\u003EBuild a rocket that can make it into space with at least one Kerbal using only the LV-1R and/or the LV-1 engines. Remember to take pictures and/or video along the way to prove it!\u003C/p\u003E\u003Cp\u003EThe Kerbal Space Government is NOT interested in cheaters, hacks, or wizards. NO DEBUG MENU.\u003C/p\u003E\u003Cp\u003EPoints!\u003C/p\u003E\u003Cp\u003EBronze: Make it to space! Send a Kerbal on a space walk to prove it!\u003C/p\u003E\u003Cp\u003ESilver: Make it into orbit! Show your periapsis to prove it!\u003C/p\u003E\u003Cp\u003EGold: Land safely on Mun! Show your Kerbal on Mun to prove it!\u003C/p\u003E\u003Cp\u003EPlatinum: Send them beyond Mun! Land safely on Duna!\u003C/p\u003E\u003Cp\u003EIf somebody can do better than Duna, then I think you just win instantly. But I\u0027d definitely like a look at that spacecraft!\u003C/p\u003E\u003Cp\u003EI\u0027d love to see photos and videos of attempts too, cause that\u0027d just be funny! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T23:50:44Z\u0022 title=\u002212/18/2013 11:50  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by BadEnoughDudez\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Hogbobson","CreatedById":95002,"CreatedDateTime":"2013-12-18T19:17:39Z","Content":"\n\u003Cp\u003EGood sir!\u003C/p\u003E\u003Cp\u003EI tried your challenge because it looked cool!\u003C/p\u003E\u003Cp\u003EThen I quickly figured out that you haven\u0027t tested your challenge. It\u0027s nigh-impossible! I\u0027m sure there\u0027s *somebody* out there with a madder mind and machine than I who can pull it off, but it is more than improbably hard. xD\u003C/p\u003E\u003Cp\u003EEdit: I did manage to get into Space (yay! (You ain\u0027t getting pictures. I doth be too lazy for that!)), but it took more than 400 parts, of which at least 380 were engines... \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T19:33:18Z\u0022 title=\u002212/18/2013 07:33  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by Hogbobson\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-18T20:45:00Z","Content":"\n\u003Cp\u003EI like this challenge\u0027s background story. It reflects nicely the rationality of our current intercourse with climate.\u003C/p\u003E\u003Cp\u003EHowever the pointing system is a bit unclear to me. What does \u0022send them beyond Mun\u0022 mean? For instance, landing on Minmus is easier than on Mun. Getting interplanetary is even easier. And to prove orbit, the periapsis is the important one, not the apoapsis.\u003C/p\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-12-18T20:57:58Z","Content":"\n\u003Cp\u003EIt\u0027s not really enviromentally friendly as it might appear. The least polluting engine should be the one which gives the most thrust per its mass, meaning it\u0027s the most efficient engine. Banning a really efficient engine and replacing it with tons of less efficient LV-1R engines requires even more engines to cover for the lost efficiency.\u003C/p\u003E\u003Cp\u003EConsequently, you emit more waste into the environment.\u003C/p\u003E\u003Cp\u003EThis is actually why lots of \u0022eco hype\u0022 stuff is downright crap that just fills someone\u0027s pocket. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"frizzank","CreatedById":57210,"CreatedDateTime":"2013-12-18T21:06:07Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022\u003E\u003Cdiv\u003EThis is actually why lots of \u0022eco hype\u0022 stuff is downright crap that just fills someone\u0027s pocket.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot sure how KSP rocket efficiency proves your point of \u0022eco hype\u0022 in the real world. Sounds more like a troll than an actual critique. \u003C/p\u003E\u003Cp\u003EYou should have left that part out of your comment.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-18T21:18:55Z","Content":"\n\u003Cp\u003EOkay, my first attempt.\u003C/p\u003E\u003Cp\u003EReach space - check\u003C/p\u003E\u003Cp\u003EReach orbit - check\u003C/p\u003E\u003Cp\u003EFuel left enough for:\u003C/p\u003E\u003Cp\u003E- exit to interplanetary space\u003C/p\u003E\u003Cp\u003E- orbit around Mun\u003C/p\u003E\u003Cp\u003E- probably also orbit around Minmus\u003C/p\u003E\u003Cp\u003EEdit: Minmus orbit confirmed\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/LCdPt\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222013-12-18T21:27:30Z\u0022 title=\u002212/18/2013 09:27  PM\u0022 data-short=\u002210 yr\u0022\u003EDecember 18, 2013\u003C/time\u003E by Kasuha\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"lajoswinkler","CreatedById":79159,"CreatedDateTime":"2013-12-18T21:22:53Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022frizzank\u0022 data-cite=\u0022frizzank\u0022\u003E\u003Cdiv\u003ENot sure how KSP rocket efficiency proves your point of \u0022eco hype\u0022 in the real world. Sounds more like a troll than an actual critique. \u003Cp\u003EYou should have left that part out of your comment.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI wasn\u0027t making a proof, I was just presenting an analogy.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-18T21:54:00Z","Content":"\n\u003Cp\u003EOne thing to point out is, debug menu is not mentioned (prohibited) by challenge rules, and making a ship that can get anywhere in the system with infinite fuel is actually pretty simple.\u003C/p\u003E\n"},{"CreatedByName":"BadEnoughDudez","CreatedById":96916,"CreatedDateTime":"2013-12-18T23:48:31Z","Content":"\n\u003Cp\u003EDEBUG MENU NOT ALLOWED!\u003C/p\u003E\u003Cp\u003ECome on people no cheating the system! The Kerbal space government is not interested in cheaters.\u003C/p\u003E\u003Cp\u003ENeither are they interested in your completely rational explanation of engine efficiency. SMALL MEANS BETTER FOR THE ENVIRONMENT!\u003C/p\u003E\u003Cp\u003EOn a less story driven point - \u003C/p\u003E\u003Cp\u003EThe minmus orbit and gold conditions are a good point. I will edit everything. The Platinum level challenge is then Duna!\u003C/p\u003E\u003Cp\u003EAlso Kashua, that\u0027s brilliant! I made an attempt yesterday that I\u0027ll post. I managed to get into space no problem but not orbit. I\u0027ll try again soon.\u003C/p\u003E\n"},{"CreatedByName":"ZenithRising","CreatedById":77506,"CreatedDateTime":"2013-12-18T23:51:35Z","Content":"\n\u003Cp\u003EI love this. Won\u0027t be able to try it until after New Year\u0027s when I go home (at the family\u0027s for the holidays now). Love your design though Kashua. Did you ever manage to land it on Mun or Minmus?\u003C/p\u003E\u003Cp\u003EAlso, I love the idea that in order to protect the environment they banned engines of a certain size, and now Kerbals are using a ton of inneficient smaller engines. Very bureaucratic. In some southern state they banned all full sized liquour bottles, so every drinks out of mini-bottles now, and actually gets \u003Cem\u003Eway\u003C/em\u003E more wasted.\u003C/p\u003E\n"},{"CreatedByName":"Kasuha","CreatedById":81781,"CreatedDateTime":"2013-12-19T06:45:25Z","Content":"\n\u003Cp\u003ECome on people, it\u0027s ka-su-ha, not kashua.\u003C/p\u003E\u003Cp\u003ENo I did not land it, neither on Mun nor on Minmus. But that should be possible with slightly improved construction. The last stage has way too many engines and that reduces its dv.\u003C/p\u003E\u003Cp\u003EDuna might be not too much harder than Mun landing, you just need to pack a chute and bring enough fuel to brake right before impact.\u003C/p\u003E\u003Cp\u003EBTW, Mun landing was already done in \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/41696-Ants-to-the-Mun\u0022 rel=\u0022external nofollow\u0022\u003Eanother challenge\u003C/a\u003E.\u003C/p\u003E\n"},{"CreatedByName":"totalitor","CreatedById":69774,"CreatedDateTime":"2013-12-20T19:31:49Z","Content":"\n\u003Cp\u003EHere is my entry.\u003C/p\u003E\u003Cp\u003EAfter couple of hours of designing my ship I managed to put that to orbit. No landing back becouse I forgot parachute. \u003C/p\u003E\u003Cp\u003ELaunching:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.com/a/img545/3362/rr4f.png\u0022 alt=\u0022rr4f.png\u0022\u003E\u003C/p\u003E\u003Cp\u003EOn orbit:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://imageshack.com/a/img706/7773/vr3t.png\u0022 alt=\u0022vr3t.png\u0022\u003E\u003C/p\u003E\n"}]}