{"TopicId":64449,"ForumId":25,"TopicTitle":"BSC: Aeris 4a - AND THE WINNER IS:","CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2014-02-27T20:42:22Z","PageNum":22,"Articles":[{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-03-26T01:25:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rune\u0022 data-cite=\u0022Rune\u0022\u003E\u003Cdiv\u003EWell, I didn\u0027t make it close enough to the final list in the end. But, I\u0027m still reasonably happy with a lucky 13th place. As Cruzan called, I think the building tricks got a lot of the judges disinterested.\u003Cp\u003EAnd why am I still happy? Well, because dissecting the results a bit more, 7 out of 21 judges put my craft last (or close to it at 51), and that\u0027s a 30% of people that I conclude didn\u0027t think my craft should have competed at all, plus me. Then there are 4 others that put me somewhere in between, and then half the judges put me on the top 20, 8 of them among the top tens (the ones that didn\u0027t mind the replicable building tricks, I guess). So I think the building tricks (undoable on a stock version without changing a few parts, I was very fast to admit) were the \u003Cem\u003Eonly\u003C/em\u003E thing keeping me from the final round. Beware next BSC, since this was my first! \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EAnd huge congrats to the finalists, if I may add!\u003C/p\u003E\u003Cp\u003EEdit: We do have some time to vote again, right? I want to re-fly them before casting my vote and such.\u003C/p\u003E\u003Cp\u003ERune. I think I blew my best building skill, though ^^\u0027\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EUnfortunately, if I was judging you would have gone into the disqualified pile on account of part clipping. When I was flying it the thing tore itself apart which happens on part clipped crafts. However, I like the White Dart enough to have rebuilt my own version using my favourite SSTO engine setup and some modifications to the aerodynamics making the plane very lively. It also gets 6km/s\u002B dV@LKO which is quite useful.\u003C/p\u003E\u003Cp\u003EI find it hilarious that I\u0027ve made the finals considering the Gecko placed dead last 6 times out of 21 and a respectable second last once. There\u0027s no doubt looks is playing the dominant role in some of the judging. Still, I like the quirky style I committed to and I\u0027m at or near the top ten with almost every other judge so it has been recognised for what it is. IE; not the best plane I can build but, a learner to train on.\u003C/p\u003E\u003Cp\u003EMy finalist pick was Filthy because, apart from Giggle he was the only one to design a plane with decent handling(a core capability) and no show-stoppers or disqualifications. Giggle made a great plane but disqualifies in my eyes for advanced construction techniques(using docking port as mounting point) and intake spamming. Even though the craft reminds me of my beloved Condor. \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/BzbmfH0.jpg\u0022 alt=\u0022BzbmfH0.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"oo0Filthy0oo","CreatedById":105629,"CreatedDateTime":"2014-03-26T01:56:21Z","Content":"\n\u003Cp\u003EWow the Wholphin made it to the finalists. Big thank you to all the judges! Going to take the finalists to orbit now and see which one will get my final vote. Congrats to everyone who entered, 53 amazing and different SSTO\u0027s\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2014-03-26T03:15:27Z","Content":"\n\u003Cp\u003ENot dead last... hey not bad for a first SSTO\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-03-26T03:44:05Z","Content":"\n\u003Cp\u003EOK, I\u0027ve had the chance to download the ballots and sort the results. It looks like a last or near last place is likely to indicate a disqualification. I\u0027m going to assume the Gecko was disqualified for flame-outs. It\u0027s a pity because, they\u0027re kinda needed to learn how to build decent SSTOs with multi-turbo stacks.\u003C/p\u003E\u003Cp\u003EAnyway, big congrats to all who took part. It\u0027s going be interesting to see who the final victor is...\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2014-03-26T04:57:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EOK, I\u0027ve had the chance to download the ballots and sort the results. It looks like a last or near last place is likely to indicate a disqualification. I\u0027m going to assume the Gecko was disqualified for flame-outs. It\u0027s a pity because, they\u0027re kinda needed to learn how to build decent SSTOs with multi-turbo stacks.\u003Cp\u003EAnyway, big congrats to all who took part. It\u0027s going be interesting to see who the final victor is...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAll of your 50\u002B votes came from judges who scored using a 1-10 or 1-15 system for ranking, with all entries ranking lower than that receiving a 53. I wouldn\u0027t take it as a hit to your design or that the judge actually thought your submission should be DQed or anything like that \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"BlazeFallow","CreatedById":83905,"CreatedDateTime":"2014-03-26T05:08:48Z","Content":"\n\u003Cp\u003EI\u0027ll take the 50th position and be happy about it. I honestly did not expect my plane to win this round of BSC (especially with 53 contenders). \u003C/p\u003E\u003Cp\u003EI just hope that the folks who flew my Y Wing enjoyed the abort sequence as much as I did.\u003C/p\u003E\u003Cp\u003ECongrats to the finalists, I\u0027ll be flying your planes once more and submitting a vote later on.\u003C/p\u003E\n"},{"CreatedByName":"regex","CreatedById":70807,"CreatedDateTime":"2014-03-26T05:17:04Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003Edecent handling(a core capability)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI might be one of the only people who doesn\u0027t subscribe to that, at least insofar as spaceplanes are concerned. IMO a spaceplane should be able to rocket to 12km at a 70 degree angle, be stable at altitude and physical warp while gaining speed, and be able to make a graceful reentry and bush landing. Anything beyond that is gravy.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022O-Doc\u0022 data-cite=\u0022O-Doc\u0022\u003E\u003Cdiv\u003EOK, I\u0027ve had the chance to download the ballots and sort the results. It looks like a last or near last place is likely to indicate a disqualification. I\u0027m going to assume the Gecko was disqualified for flame-outs. It\u0027s a pity because, they\u0027re kinda needed to learn how to build decent SSTOs with multi-turbo stacks.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI marked the Gecko ninth, it worked pretty well aside from being ugly and the engine management was just fine. I recall not liking the ascent rate, though.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlazeFallow\u0022 data-cite=\u0022BlazeFallow\u0022\u003E\u003Cdiv\u003EI\u0027ll take the 50th position and be happy about it. I honestly did not expect my plane to win this round of BSC (especially with 53 contenders). \u003Cp\u003EI just hope that the folks who flew my Y Wing enjoyed the abort sequence as much as I did.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI marked that one sixth, it was a hoot to fly and the abort allowed me to land when I reentered without knowing how to route all the fuel around. The clipping was a bit excessive, but it didn\u0027t look like you touched the debug menu so no real complaints here.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-26T05:20:07Z\u0022 title=\u002203/26/2014 05:20  AM\u0022 data-short=\u002210 yr\u0022\u003EMarch 26, 2014\u003C/time\u003E by regex\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2014-03-26T05:35:27Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Heagar\u0022 data-cite=\u0022Heagar\u0022\u003E\u003Cdiv\u003EHowever Xeldrak, even with your saftey-first try to let only the peoply vote who had commited to this challenge, it seems to be possible to vote in the final stage when you are logged in.\u003Cp\u003EIn my case i do nothing, as all others should do.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENot entirely sure what you are trying to tell me. I sure hope that it is possible to vote when you are logged in. \u003C/p\u003E\u003Cp\u003EYou can vote if you like - it\u0027s public however, people will see what you voted.\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2014-03-26T05:43:50Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlazeFallow\u0022 data-cite=\u0022BlazeFallow\u0022\u003E\u003Cdiv\u003EI\u0027ll take the 50th position and be happy about it. I honestly did not expect my plane to win this round of BSC (especially with 53 contenders). \u003Cp\u003EI just hope that the folks who flew my Y Wing enjoyed the abort sequence as much as I did.\u003C/p\u003E\u003Cp\u003ECongrats to the finalists, I\u0027ll be flying your planes once more and submitting a vote later on.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat abort stage was outstanding! I think in my notes I even used two explamation marks when talking about it haha\u003C/p\u003E\u003Cp\u003EIn the end I had to rate it lower because it was way too advanced for a stock/beginner craft. Outside of the competition though it is a great SSTO \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-03-26T06:56:08Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI might be one of the only people who doesn\u0027t subscribe to that, at least insofar as spaceplanes are concerned. IMO a spaceplane should be able to rocket to 12km at a 70 degree angle, be stable at altitude and physical warp while gaining speed, and be able to make a graceful reentry and bush landing. Anything beyond that is gravy.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI used to think that and I certainly agree that real world SSTOs would never need to handle well, just be able to get into space. Then again, a real world SSTO would not even have close to the looks that are rating highly among the contenders. There\u0027s no way an SSTO would have a fighter jet\u0027s sleek design and shape. My interpretation with those second canards is about having big air scopes for high altitude flying.\u003C/p\u003E\u003Cp\u003EI realise that at the end of the day this is a computer game and spaceplanes that look like fighter jets are part of the milieu. But also, being a game, having a plane that you can correct once you get into trouble is more fun than feeling like it just got set to auto-crash. This is particularly true for landings.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI marked the Gecko ninth, it worked pretty well aside from being ugly and the engine management was just fine. I recall not liking the ascent rate, though.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe default config is full tanks for range. Ascend quickly by emptying side tanks, then it will go up as fast as anything else without drinking a lick of oxidizer to get there. Cheers for the consideration.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2014-03-26T08:51:23Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022BlazeFallow\u0022 data-cite=\u0022BlazeFallow\u0022\u003E\u003Cdiv\u003EI\u0027ll take the 50th position and be happy about it. I honestly did not expect my plane to win this round of BSC (especially with 53 contenders). \u003Cp\u003EI just hope that the folks who flew my Y Wing enjoyed the abort sequence as much as I did.\u003C/p\u003E\u003Cp\u003ECongrats to the finalists, I\u0027ll be flying your planes once more and submitting a vote later on.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWhen people look at your Y-Wing they first probably think: WTF is that!\u003C/p\u003E\u003Cp\u003EI enjoyed it a lot, had some fun with separating the tiny plane while leaving the base on an ascent path - and try to crash into it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E That was awesome.\u003C/p\u003E\u003Cp\u003EIts a great fun SSTO, just no stock craft.\u003C/p\u003E\u003Cp\u003EFjord\u003C/p\u003E\n"},{"CreatedByName":"BlazeFallow","CreatedById":83905,"CreatedDateTime":"2014-03-26T09:55:05Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Cruzan\u0022 data-cite=\u0022Cruzan\u0022\u003E\u003Cdiv\u003EThat abort stage was outstanding! I think in my notes I even used two explamation marks when talking about it haha\u003Cp\u003EIn the end I had to rate it lower because it was way too advanced for a stock/beginner craft. Outside of the competition though it is a great SSTO \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThanks! And yes, the craft ended up being more advanced than originally intended, but I\u0027m glad that you enjoyed my favorite design feature (the the Emergency Escape Jet - EEJ) as much as I did.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022regex\u0022 data-cite=\u0022regex\u0022\u003E\u003Cdiv\u003EI marked that one sixth, it was a hoot to fly and the abort allowed me to land when I reentered without knowing how to route all the fuel around. The clipping was a bit excessive, but it didn\u0027t look like you touched the debug menu so no real complaints here.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E6th place on someones list makes me really happy \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E. And you are absolutely right, there was a fair amount of clipping used in my design. The forward wings, two RCS tanks clipped inside the forward Y sections, the two batteries and RTG clipped into the EEJ. My main thing though is that I definitely did not ever use the debug menu to clip things (still haven\u0027t in any craft I\u0027ve ever built actually) and none of the items that were clipped were the sort where you had to get the mouse \u003Cem\u003Ejust\u003C/em\u003E right in order to place them. You could pick up the RCS\u0027s, wings, batteries, RTG\u0027s, etc. and move them around and replace them without issue. The one difficult one would be the RCS tanks in betwen the two fuel tanks. You just need to have zoomed the camera in so that your view point was effectively inside one of the tanks, but the RCS tank stays green the entire time \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m glad you enjoyed my EEJ too. I feel that it was my one main thing that made my Y Wing different from the other SSTOs. Not just an escape pod or escape system, but an entire self contained spaceplane (by which I mean that it has oxidizer and RCS so it could operate in space, not that it by itself could make orbit from the KSP runway) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordFjord\u0022 data-cite=\u0022LordFjord\u0022\u003E\u003Cdiv\u003EWhen people look at your Y-Wing they first probably think: WTF is that!\u003Cp\u003EI enjoyed it a lot, had some fun with separating the tiny plane while leaving the base on an ascent path - and try to crash into it \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E That was awesome.\u003C/p\u003E\u003Cp\u003EIts a great fun SSTO, just no stock craft.\u003C/p\u003E\u003Cp\u003EFjord\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EYes, the Y shaped fuselage was unlike anything I had ever previously built. At first I wasn\u0027t even sure it would work as I wanted, but it ended up functioning great! And I agree, the Y Wing is not really a contender for Stock Craft status, but none of my other SSTOs were as good as this one (I\u0027m not terribly great at designing them) so this is what I had for the competition. I\u0027m stilll glad that I could bring this one to the table and get people thinking about different design techniques, and not just another SR-71-like plane. (No offense intended Giggle, your R-2 looks awesome and I look forward to my test flight with it this afternoon.)\u003C/p\u003E\n"},{"CreatedByName":"Silverchain","CreatedById":83000,"CreatedDateTime":"2014-03-26T11:04:17Z","Content":"\n\u003Cp\u003EAbout looks - I was scoring on aesthetics, but as a minor component. However, I was scoring a bit more on clipping and stacking (ab)use, and when there are bits of parts sticking out of other parts (as on the R2\u0027s ram intakes, though the R2 is comparatively clipping free compared to some entries) I find it ugly too. Especially when the graphics engine tries to draw two or more pieces on top of each other and makes that shimmering effect. Yuck; to me a lot of the attempts to \u003Cem\u003Eimprove\u003C/em\u003E the looks of a craft by covering it with clipped panels and so on have the opposite effect.\u003C/p\u003E\u003Cp\u003E(I wasn\u0027t scoring \u003Cem\u003Etoo\u003C/em\u003E highly on either, as the Mallard has clipped-though-inactive control surfaces and has my final vote.)\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Chr\u003E\u003Cp\u003EAbout flight performance - there are so many possible uses for a spaceplane so it\u0027s hard to say definitively \u0022it needs to be able to fly well as well as simply making orbit and returning\u0022, but Laythe - as the only other world where airbreathing engines work - is a prime target for spaceplanes, and being able to fly well is useful there; unless you\u0027re making a pinpoint atmospheric entry directly over an established base on a good flat location then you need to be able to get to an island, potentially requiring a long atmospheric flight or suborbital hop, and find a landing site, which is not always straightforward.\u003C/p\u003E\u003Cp\u003EAs an extended test to discriminate between the top ten or so entries I looked at I flew them on a (harsh) mission profile; a quick flight around KSC followed by a flight at low level to the Island Runway, landing, flight at high level back west to the desert, swoop down to buzz the Pyramids and \u003Cem\u003Ethen\u003C/em\u003E ascend to orbit. I wasn\u0027t looking at whether they could do that (some could) but at how they behaved on a half-hour flight in different conditions with unbalanced, unintended fuel levels - the top entries could all do things the \u003Cem\u003Eright\u003C/em\u003E way, but what about the \u003Cem\u003Ewrong\u003C/em\u003E way? \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Heagar","CreatedById":67859,"CreatedDateTime":"2014-03-26T11:54:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Xeldrak\u0022 data-cite=\u0022Xeldrak\u0022\u003E\u003Cdiv\u003ENot entirely sure what you are trying to tell me. I sure hope that it is possible to vote when you are logged in. \u003Cp\u003EYou can vote if you like - it\u0027s public however, people will see what you voted.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESorry for the misunderstanding. In my opinion your intention was to let only the people vote, who had your link per e-mail.\u003C/p\u003E\n"},{"CreatedByName":"briansun1","CreatedById":67451,"CreatedDateTime":"2014-03-26T12:25:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Heagar\u0022 data-cite=\u0022Heagar\u0022\u003E\u003Cdiv\u003ESorry for the misunderstanding. In my opinion your intention was to let only the people vote, who had your link per e-mail.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat was with only the first round of voting the final round is open to everyone\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2014-03-26T13:17:19Z","Content":"\n\u003Cp\u003EConfession: I\u0027ve been tinkering with my Bolt\u0027s redesign instead of doing more in-depth testing of the finalists\u0027 designs \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ONAoT\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll probably do my testing tonight after classes. Although, Giggleplex may have stolen the show already!\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2014-03-26T17:49:59Z","Content":"\n\u003Cp\u003EI liked the front winglets better. The clipped in control surface looks odd (purely visual aspect). The tail-wing design looks good \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Btw, how did you crate that animated gif?\u003C/p\u003E\u003Cp\u003EEdit: any reason why you didn\u0027t use the shielded docking port?\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2014-03-26T22:46:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022LordFjord\u0022 data-cite=\u0022LordFjord\u0022\u003E\u003Cdiv\u003EI liked the front winglets better. The clipped in control surface looks odd (purely visual aspect). The tail-wing design looks good \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E Btw, how did you crate that animated gif?\u003Cp\u003EEdit: any reason why you didn\u0027t use the shielded docking port?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI would have used those winglets, but in the redesign I slid the main delta wings forward quite a ways which took away the extra room for the fairly big winglets. I couldn\u0027t find any other config that looked decent without putting them under the wings. Since it isn\u0027t for the contest though I said screw it and went with the small control surfaces \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EThe GIF I created in photoshop, but you can make them a lot more easily by using \u003Ca href=\u0022http://blog.bahraniapps.com/?page_id=21\u0022 rel=\u0022external nofollow\u0022\u003EGifCam\u003C/a\u003E.\u003C/p\u003E\u003Cp\u003EAnd I\u0027ve never liked the shielded port on spaceplanes personally. Partly because it is heavier, but mostly because it just feels more like a part design for a shuttle/station. It would make the nose look more aerodynamic though I suppose \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"sploden","CreatedById":54111,"CreatedDateTime":"2014-03-27T06:56:49Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EA note on asymmetrical flameout: The reason this is bad is not just for maximum safety and reliability, but also (and more importantly) for maximum delta-V. If an SSTO has an even number of jet engines, the pilot is unable to safely and dynamically throttle down to just below the operational intake requirement in order to keep the jet engine running as long as possible, right up to the edge of space. I am surprised no one else mentioned this, and I noticed someone even criticized my design decision of not binding my intakes to the jet engine toggle group. The reason I didnÃ¢â‚¬â„¢t bind my intakes to a toggle group is because on the way to space itÃ¢â‚¬â„¢s best to keep the jet on as long as possible even if it is throttled almost all the way down. Further, putting the jets and rockets on the same toggle group is a big no-no in my book. This is also why I dislike rapiers; itÃ¢â‚¬â„¢s impossible to separate the cycle modes and run them simultaneously, and Auto cycle-switching is the worst. If you want a plane that can teach both asymmetrical flameout and maximizing delta-V, I would probably think about building a plane with three jet engines and two rocket engines, but that seems out of scope for this project.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EA few other things I dislike: \u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Extra torque on SSTOs seems like a delta-V wasting shortcut for fixing bad CoM/CoL balance (at least in this weight category)\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Escape systems waste delta-V and seem like a cop-out for maximizing flyability.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Implausible-looking designs, such as intakes covering intakes, intakes that donÃ¢â‚¬â„¢t seem like they could lead to the correct engine, control surfaces that arenÃ¢â‚¬â„¢t aerodynamically placed, lifting surfaces placed in close conjunction with the body of the craft thus making it look like they shouldnÃ¢â‚¬â„¢t have lift even though they still do (such as the boxy midsection of many biplane designs)\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Biplane SSTOs\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Dog bites\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Bee stings\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003ELastly, I didnÃ¢â‚¬â„¢t feel like docking. Generally itÃ¢â‚¬â„¢s easy if you have plenty of delta-V, electric power, monopropellant, RCS ports that surround the CoM in some fashion and allow 6 degrees of translation, and a docking port that doesnÃ¢â‚¬â„¢t require orientation change. The most important aspect of this challenge is getting to space easily and efficiently with lots of delta-V and getting back to KSC in one piece.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003ESo! To the testing and opinions...\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EBSC Bolt\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Fuel tank size/fuel carried ratio seems odd\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Looks okay (except for the unshielded docking port)\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Has added torque\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Flight plan error margin on the way to space is small\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Amount of monopropellant seems low\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Delta-V is pretty low - I had 504m/s upon reaching orbit, 70,319m x 72.287m\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Could do without two of the rockomax engines, thus increasing delta-V again. Replacing entirely with two 48-7SÃ¢â‚¬â„¢s would give even more improvement.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Control surfaces are un-tweaked.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Not the easiest to land.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Big props for the separate action groups controlling the jet engine and the rocket engines\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EGecko v1-0\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E DoesnÃ¢â‚¬â„¢t look very aerodynamic; middle canards especially would cause lots of drag IRL\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E One ladder too many\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Seems big for an Aeris 4a\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Midsection radial intake placement isnÃ¢â‚¬â„¢t symmetrical top to bottom\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Bi-plane isnÃ¢â‚¬â„¢t my favorite design\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Asymmetrical flameout difficult to avoid when using my ascent profile\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Requires turning off rocket engine after starting\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Good amount of delta-V upon reaching orbit; 1931m/s at 73,089m x 74.293m\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Control surfaces are un-tweaked\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Big props for the separate action groups controlling the jet engine and the rocket engines\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EHOTOL II c4\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Odd RCS placement\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Odd intake placement - are the wings supposed to be liquifying the atmosphere and pumping it into the Rapier?\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Has added torque\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Would make more sense if action group 1 toggled the rapierÃ¢â‚¬â„¢s cycle\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Rapiers should be in manual switching mode if they are used\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Has a weird tendency to flip backwards right after takeoff. Could really do without that reaction wheel.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Perhaps I was flying it wrong, but it had 90m/s delta-V left after reaching a 70,544m x 73,769 orbit. Might have been able to add on 100m/s with a better flight.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E After I took it back to the spaceplane hangar and switched the rapierÃ¢â‚¬â„¢s mode to Manual and changed the cycle toggle to action group 1, I was able to achieve an orbit of 70,531m x 84,183m with 745m/s left\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Fuel ratio is off\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Not the easiest to land\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EMallard SSTO\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Unstable - tends to flip out if not handled gently\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Has an escape system\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Jet engine and rocket engines should be on separate toggling action groups. This would allow an increase in delta-V.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Achieved an orbit of 70,454 x 72,517 with 1358m/s of delta-V left.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Could do without some of the extra fuel, which would increase delta-V\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Not the easiest to land\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EPeregrino\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Odd radial intake placement - are the wings supposed to be liquifying the atmosphere and pumping it into the jet engine?\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Narrow wheelbase\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Would prefer a docking port that doesnÃ¢â‚¬â„¢t require an orientation shift\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Would prefer to have the rocket engines on their own action group, the jet engine on another action group, and the intakes on their own action group (if at all)\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Used the 2nd stage to turn on the rocket engines to work at the same time as the jet engine in order to increase delta-V\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Achieved a 75,194m x 76,650m orbit with 1227m/s delta-V left.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Slightly angled back wheels could cause disaster\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003ER-2\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Rapiers should be in manual switching mode if they are used\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Would prefer a docking port that doesnÃ¢â‚¬â„¢t require an orientation shift.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Two intakes mostly in front of two more intakes that lead into RCS tanksÃ¢â‚¬Â¦?\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Looks okay, except it\u0027s a biplane and has intakes coming through the tops and bottoms of the biplane wings\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Has added torque\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Achieved orbit of 71,610m x 73,054m with 1288m/s delta-V left.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EWholfine Hybrid\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Looks okay, except it\u0027s a biplane and has intakes coming through the tops and bottoms of the biplane wings\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Rapiers should be in manual switching mode if they are used\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Would prefer a docking port that doesnÃ¢â‚¬â„¢t require an orientation shift.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Has added torque\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003Cli\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003E Achieved 70,289m x 75,995m orbit with 1016m/s delta-V left.\u003C/span\u003E\u003Cbr\u003E\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-family:Verdana;\u0022\u003EItÃ¢â‚¬â„¢s a tough choice. I am undecided at this point. But good job to the finalists; congratulations!\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"O-Doc","CreatedById":95453,"CreatedDateTime":"2014-03-27T14:11:44Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022sploden\u0022 data-cite=\u0022sploden\u0022\u003E\u003Cdiv\u003EA note on asymmetrical flameout: The reason this is bad is not just for maximum safety and reliability, but also (and more importantly) for maximum delta-V. If an SSTO has an even number of jet engines, the pilot is unable to safely and dynamically throttle down to just below the operational intake requirement in order to keep the jet engine running as long as possible, right up to the edge of space. I am surprised no one else mentioned this, and I noticed someone even criticized my design decision of not binding my intakes to the jet engine toggle group. The reason I didnÃ¢â‚¬â„¢t bind my intakes to a toggle group is because on the way to space itÃ¢â‚¬â„¢s best to keep the jet on as long as possible even if it is throttled almost all the way down. Further, putting the jets and rockets on the same toggle group is a big no-no in my book.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIt\u0027s been interesting to learn how other people approach gameplay and judge designs based on their own preferences. This is why you won\u0027t ever see me put a description on a craft file. Not to tell people how to fly the craft or what action keys to use. I will always assume you\u0027ll \u0027key-bind\u0027 according to your own established system and pilot the way that works best for you. EG; I never realised people staged a plane on the runway to start it, that\u0027s new info.\u003C/p\u003E\u003Cp\u003EEdit: I should mention that I mostly split staging on engine just to have better visibility on what groups are currently running. Not sure I even did this on the Gecko as I only spent about a hour or more on it.\u003C/p\u003E\u003Cp\u003EI can already tell what ascents most builders in this competition use based of the amount of liquid fuel they have put in the craft. Many of which, I\u0027ve taken to space with way too much oxidizer in the luggage compartment. But, I don\u0027t hold that against the designs if I can tweak the levels according to my own preference and not upset the balance.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-03-27T14:15:08Z\u0022 title=\u002203/27/2014 02:15  PM\u0022 data-short=\u002210 yr\u0022\u003EMarch 27, 2014\u003C/time\u003E by O-Doc\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Blaster","CreatedById":69150,"CreatedDateTime":"2014-03-27T14:24:44Z","Content":"\n\u003Cp\u003ETweaking has made it possible to use just one rocket fuel tank, which can have 2 \u0022notches\u0022 of oxidizer removed for optimal balance, saving on parts count and reducing problems with fuel balance.\u003C/p\u003E\n"},{"CreatedByName":"BlazeFallow","CreatedById":83905,"CreatedDateTime":"2014-03-27T18:48:19Z","Content":"\n\u003Cp\u003EI voted for Giggle\u0027s R-2. After flying the finalist planes once again, I just have to give it to the R-2 for having such amazingly smooth controls. Landing the thing is crazy easy, mainly due to its great lift ratio and pitch control.\u003C/p\u003E\n"},{"CreatedByName":"LordFjord","CreatedById":97341,"CreatedDateTime":"2014-03-28T08:30:08Z","Content":"\n\u003Cp\u003EDeadline is coming soon for the vote. I\u0027m just surprised that there are so few voters. After all, it\u0027s open for everyone.\u003C/p\u003E\n"},{"CreatedByName":"Cruzan","CreatedById":79256,"CreatedDateTime":"2014-03-28T09:44:42Z","Content":"\n\u003Cp\u003EThis is a tough call. Ran out of time to breakdown and do an objective spreadsheet so I\u0027ll just go by my gut for this one \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EGiggleplex 777: R-2\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EAs far as what I feel is the best SSTO out of the group, it\u0027s hands down the R-2. For this contest though I think the R-2 is...too refined for a stock craft. It\u0027s like giving someone a brand new Audi R-8 or something when a stock craft should probably be more along the lines of a \u002798 Blazer haha. There\u0027s no room to tinker with the design or even a need to improve anything. The way the side intakes are mounted is also a little beyond the design level of a stock craft.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMiniMatt: Mallard\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EThis is a very \u003Cem\u003Ebusy\u003C/em\u003E design. The core of the design is good, but all the added features might be a little over the top for a stock craft. Outside of the competition the abort stage and everything else are top-notch design elements, but for this contest they aren\u0027t really needed. Pretty close to being a top pick though.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EHeagar: HOTOL \u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWhile I don\u0027t like the aesthetics, the HOTOL is extremely user-friendly as far as construction goes. Rebuilding it or removing pieces and adding new stuff would be very easy to do with this as a base design. Doesn\u0027t have a ton of range, but that\u0027s okay.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EO-Doc: Gecko\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESimilar to the Mallard in that this is a fairly \u003Cem\u003Ebusy \u003C/em\u003Edesign. The middle tanks are also a pain to click on for refueling. The base design is very good and performs well, but I feel like the whole thing needs to be toned down in order to be a stock craft.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003Eoo0Filthy0oo: Wolphine\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ESimilar to the R-2 in aesthetics and overall design. Room for improvement, but pulling it apart and putting it back together might be difficult for a beginner. Using multiple tank sizes is odd and it\u0027d be better to simplify it and combine them in to larger tanks.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EWaRi: Peregrino\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003ENot much in the way of aesthetics, but for a stock craft it is a very good candidate. Easy to reconstruct, take apart and add on to. All of the vital components are easily visible and it doesn\u0027t try to hide anything which is good for a stock design. It is missing some components that I would have liked to see (batteries, slightly more monoprop). The handling is a little too stable, but that could easily be adjusted by the player with this design.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EVERDICT.....\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EWaRi\u0027s Peregrino! On top of what I mentioned, I really think that something that needs to be showcased to newer players with SSTOs is that simplicity is key. You can make it to orbit with very few parts and a small design! Starting players off with a large design might send them down a dark road of adding more fuel and engines, just compounding the complexity. I know when I first started out my SSTOs were way too big. If I had been given a stock craft that was smaller like the Peregrino I might have put 2 and 2 together to figure out that I needed to start much smaller. Small, simple, easy to build and fly. The Peregrino does all that very well. The player can fiddle with the aesthetics and the handling on their own \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cool.gif\u0022 alt=\u0022:cool:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Xeldrak","CreatedById":57228,"CreatedDateTime":"2014-03-28T18:36:32Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EAnd the winner is:\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cdiv style=\u0022text-align:center;\u0022\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cstrong\u003E1st:\u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71015-BSC-Aeris-4a-Yes-it-s-spaceplane-time%21?p=1018771\u0026amp;viewfull=1#post1018771\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:36px;\u0022\u003E\u003Cstrong\u003E Giggleplex777 - R-2 SSTO \u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003E2nd:\u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71015-BSC-Aeris-4a-Yes-it-s-spaceplane-time%21?p=1018826\u0026amp;viewfull=1#post1018826\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:24px;\u0022\u003E\u003Cstrong\u003E oo0Filthy0oo - Wholphine Hybrid \u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003E3rd:\u003C/strong\u003E\u003C/span\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/71015-BSC-Aeris-4a-Yes-it-s-spaceplane-time%21?p=1002205\u0026amp;viewfull=1#post1002205\u0022 rel=\u0022external nofollow\u0022\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003E\u003Cstrong\u003E Cruzan - BSC Bolt \u003C/strong\u003E\u003C/span\u003E\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EGiggleplex has won once again. Can nobody stop this better stock craft building maniac?! It was fun as allways - especially since this was the thread-of-the-month special edition.\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:12px;\u0022\u003EOnce again thanks to all the participants and congratulations to the winner! The challenge would be nothing without you guys\u003C/span\u003E\u003C/p\u003E\n"}]}