{"TopicId":71018,"ForumId":25,"TopicTitle":"Heavy Launch Rocket Finesse Challenge","CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T07:26:46Z","PageNum":1,"Articles":[{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T07:26:46Z","Content":"\n\u003Cp\u003E\u003Cspan style=\u0022font-size:18px;\u0022\u003EThe Heavy Launch Rocket Finesse Challenge\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dArYRBr.jpg\u0022 alt=\u0022dArYRBr.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EKerbal Space Center has put forth a call for bids on design of their next series of heavy launch rocket (or heavy spaceplane). Your mission, should you choose to accept it, is to design and test your submission to this bidding war.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EThe Rules\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E- The following mods are allowed: NovaPunch2, KW Rocketry, NearFuture Propulsion, KSP-Interstellar (see exceptions below), B9 Aerospace, Firespitter, FAR (see rules below), Stock Rebalance Mod, StretchyTanks/StretchySRB\u0027s/ProceduralParts, MegaPanels, Kethane, Kerbal Joint Reinforcement, KAS, Orbital Construction (won\u0027t help you, except as payload- but go ahead and use it if you want), Krag\u0027s Planet Factory (once again, not going to help), Extraplanetary Launchpads, Nyrath\u0027s Orion mod, ProceduralDynamics, ProceduralFairings, TAC Fuel Balanced, MechJeb2, RemoteTech, TAC Life Support, MechJeb/RT For All mod (adds MJ2/RT to all command modules), any graphics (purely aesthetics) or memory/resolution-reduction mods\u003C/p\u003E\u003Cp\u003E- Suggest other mods to me if you think they should be allowed. I will be the judge on what it fair and admissible in all matters (and similarly what is exploitative/cheap)\u003C/p\u003E\u003Cp\u003E- FAR will be allowed (as will ProceduralFairings, which should help with it), however due to the greatly increased performance of many rockets while using this mod, due to the more realistic simulation of drag, you will receive a points-penalty for using it (this is for balance/fairness for those of us whose computers cannot handle FAR\u0027s RAM usage). I have chose a value I think will somewhat balance things, but if I find FAR rockets are dominating the scoreboard, I may increase the penalty (this applies retroactively). You have been warned.\u003C/p\u003E\u003Cp\u003E- Due to the in my opinion unrealistic and overpowered nature of the fusion and antimatter reactors in KSP-Interstellar, these reactors will be totally disallowed FOR ALL PURPOSES. I am a huge fan of some features of the mod myself, but this had to be done. The fission reactors will be limited to current-day (or near-future) technology: Molten-Sodium and Solid-Bed fission reactors only! Also, for those using very old versions of KSP-Interstellar, the Atmospheric Scoop part is banned, as it produces no drag due to an error in the coding acknowledged by FractalUK (the mod creator)\u003C/p\u003E\u003Cp\u003E- If you choose to use microwave beamed power for a KSP-Interstellar rocket, you will be limited to no more than one 3.75 meter (or smaller) fission reactor at/near the KSC, and one 2.5 meter Uranium reactor (no Thorium or Uranium Nitride- these reactors require more maintenance) at/near the island runway. You may use as much beamed solar power as you like, however- sustainability for the win!\u003C/p\u003E\u003Cp\u003E- You may design and launch a rocket to takeoff from an alternate launch site anywhere on Kerbin using Extraplanetary Launchpads. You will receive a points penalty for doing so, but it is is not meant to be balanced (it takes a LOT of effort to build a mountaintop launchpad, for instance). This is meant to be one way to potentially increase your score. On the downside, such launchpads often cannot safely launch the largest of rockets due to the inability to secure a perfectly level launch site.\u003C/p\u003E\u003Cp\u003E- Your rockets (or spaceplanes) may reach a maximum weight of 1.2 KILOTONS (1,200 tons). They may contain no more than 120 parts, but will receive points penalties for higher mass and part-count, not meant to fully balance it out- larger is better. You can even receive a small bonus for launching an enormous rocket, for its shear impressiveness to behold (although this will not outweigh the penalty for its huge mass). It may contain no crew, except for in the payload (so you don\u0027t use suicidal Kerbals to help pilot the boosters).\u003C/p\u003E\u003Cp\u003E- You will receive points for every half-ton of payload to make it to orbit. This is by far the most important source of points. Payload is defined as a detachable portion of the rocket which may be utilized for other purposes. It MAY NOT contain any engines used during ascent (even though use of payload engines in normally a good idea in normal play), air intakes, or parts with lift. It must have an accessible docking port, by which it detaches from all other stages. If the payload is 1.25 meters or more, the docking port must be a standard Clamp-O-Tron or larger. If the payload is 2.5 meters or more, the docking port must be a Clamp-O-Tron Senior or larger. The payload may contain no SAS force, except for a single crewed command module, or probe core.\u003C/p\u003E\u003Cp\u003E- The largest bonus available to you comes from using a \u0022100% reusable Space-X style reusable launch vehicle\u0022. If you don\u0027t know what this is, I highly recommend looking it up. I also demonstrate one on my thread (\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/57509-Kerbin-and-Beyond-a-Maturing-Space-Program/page20\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/57509-Kerbin-and-Beyond-a-Maturing-Space-Program/page20\u003C/a\u003E). Note that using a spaceplane will also qualify for this award- IF you managed to land at again safely back at the KSC, or on an Extraplanetary Launchpads runway elsewhere on Kerbin.\u003C/p\u003E\u003Cp\u003E\u002B The basic idea is that you launch straight up, so that your entire rocket has an apoapsis above the lower atmosphere before clearing your first stage. The next stage then (at least mostly) circularizes the orbit before the lower stage falls low enough to disappear in the atmosphere- and you then switch to the lower stage on its way down. The lower stage, with the aid of a built-in probe core, performs a guidance burn to bring its trajectory back towards the KSC (I am requiring you land it within 50 km of the KSC for this challenge- this is easy if you keep your initial ascent vertical) and a short \u0022suicide\u0022 burn to cancel its velocity shortly before touchdown with the ground (this takes surprisingly little fuel- drag will slow you down to terminal velocity long before you reach the ground). Use landing legs/pegs to protect the engines from exploding on impact with the terrain- your entry will be disqualified if you use parachutes (they are complex and expensive to reuse in real-life, and drastically overpowered in the stock game) or lose any parts on the way down.\u003C/p\u003E\u003Cp\u003E\u002B The upper stage then detaches from the payload, and performs a re-entry maneuver of its own to touch down somewhere on Kerbin (preferably close to the KSC, although not required for this challenge due to its difficulty- I was unable to reach the KSC with the upper stage on my own attempts.) In order to be gentle on the reusable (non-payload) stages, I am also requiring you use mechanical decouplers or docking ports to separate them from the rest of the rocket- no explosive decoupler plates please. Similarly, please do not burn the lower stages by igniting the next stage up with the engines pointed directly at them at point-blank range.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EObjectives\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYou are to launch a rocket (or spaceplane) from on the ground on Kerbin to a stable orbit (the periapsis must be at least 72 km, to provide a small safety margin) around Kerbin. Your objective is to develop a rocket that best meets the standard set for by the KSC, although creativity and realism are also encouraged.\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003EScoring\u003C/span\u003E\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EPlease submit \u003Cstrong\u003EPROOF\u003C/strong\u003E of each scoring category. This means a screenshot of the vessel mass on the launchpad, of the payload mass AFTER detachment from the sustainment stage or spaceplane, of the reusable (non-payload) stages touching back down for a reusable rocket/spaceplane, and of the percentage of fuel remaining (the resources tab must be visible) in the sustainment stage or spaceplane AFTER detachment from the payload, if you are going for any of the leftover fuel bonuses...\u003C/p\u003E\u003Cp\u003EFlying Needle \u003Cstrong\u003E-240 points:\u003C/strong\u003E for using FAR\u003C/p\u003E\u003Cp\u003EAirbreather \u003Cstrong\u003E-180 points\u003C/strong\u003E for using any form of jet engine (this includes Thermal Turbojets)\u003C/p\u003E\u003Cp\u003EReusable Glory \u003Cstrong\u003E\u002B300 points\u003C/strong\u003E for using a Space-X style 100% reusable launch vehicle (the lower stages must be recoverable- no parachutes) or a spaceplane (must land back at the KSC runway, or on an ExPl runway elsewhere on Kerbin)\u003C/p\u003E\u003Cp\u003EEfficient \u003Cstrong\u003E\u002B50 points\u003C/strong\u003E use fewer than 50 parts\u003C/p\u003E\u003Cp\u003EThe Answer \u003Cstrong\u003E\u002B24 points\u003C/strong\u003E use exactly 42 parts\u003C/p\u003E\u003Cp\u003EMoney Talks \u003Cstrong\u003E-5 points for each part in the part-count\u003C/strong\u003E (this does NOT include launch clamps, but does include payload. Note the 120 part limit.)\u003C/p\u003E\u003Cp\u003EFuel Isn\u0027t Free \u003Cstrong\u003E-5 points for every 20 tons of rocket mass on the launchpad\u003C/strong\u003E (this includes payload, for simplicity. Note the maximum weight limit.)\u003C/p\u003E\u003Cp\u003ESize Matters \u003Cstrong\u003E\u002B10 points\u003C/strong\u003E design/launch a rocket that weighs over 1000 tons on the launchpad\u003C/p\u003E\u003Cp\u003ERadioactive Launchpad \u003Cstrong\u003E-12000 points\u003C/strong\u003E for using an Orion Nuclear Pulse Rocket (these entries should be just for kicks)\u003C/p\u003E\u003Cp\u003EMountains Are Steep \u003Cstrong\u003E-30 points\u003C/strong\u003E for utilizing a launchpad at over 3000 meters\u003C/p\u003E\u003Cp\u003ELogistical Costs \u003Cstrong\u003E-12 points\u003C/strong\u003E for utilizing a launchpad other than the KSC (stacks with Mountains Are Steep)\u003C/p\u003E\u003Cp\u003ERoom for Error \u003Cstrong\u003E\u002B40 points\u003C/strong\u003E for making it to orbit with more than 10% fuel remaining OUTSIDE of the payload (this fuel must be able to reach at least one engine outside of the payload. Don\u0027t exploit this by dropping empty tanks at the last minute, or stealing fuel from payload.)\u003C/p\u003E\u003Cp\u003EFuel to Spare \u003Cstrong\u003E\u002B70 points\u003C/strong\u003E for making it to orbit with more than 20% fuel remaining OUTSIDE of the payload (this does NOT stack with Room for Error, and the fuel must be able to reach at least one engine outside of the payload. Please don\u0027t exploit this.)\u003C/p\u003E\u003Cp\u003EKerbals in Space! \u003Cstrong\u003E\u002B10 points\u003C/strong\u003E for having at least one Kerbal crewing the payload (however, the G-forces must stay out of the red at all times)\u003C/p\u003E\u003Cp\u003EAir to Breathe \u003Cstrong\u003E\u002B10 points\u003C/strong\u003E for using TAC Life Support on a crewed vessel (the life-support may be part of the payload, but remember part-count...)\u003C/p\u003E\u003Cp\u003EWhat\u0027s This Oxygen? \u003Cstrong\u003E-10 points\u003C/strong\u003E for running out of any type of life-support provision when using TAC Life Support\u003C/p\u003E\u003Cp\u003EPride and Profit \u003Cstrong\u003E\u002B10 points\u003C/strong\u003E for every half-ton of payload to make it to orbit\u003C/p\u003E\u003Cp\u003EI look forward to seeing what entries you guys can offer! (I reserve the right to make an entry of my own as well)\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThis challenge has been closed to new entries as of May 12th, US Central Time\u003C/strong\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cspan style=\u0022font-size:14px;\u0022\u003E\u003Cstrong\u003EScoreboard:\u003C/strong\u003E\u003C/span\u003E\u003C/p\u003E\u003Cp\u003E1. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78399-Heavy-Launch-Rocket-Finesse-Challenge?p=1138996\u0026amp;viewfull=1#post1138996\u0022 rel=\u0022external nofollow\u0022\u003Exrayfishx - 4990 points\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E2. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78399-Heavy-Launch-Rocket-Finesse-Challenge?p=1131332\u0026amp;viewfull=1#post1131332\u0022 rel=\u0022external nofollow\u0022\u003ESensi - 4200 points\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E3. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78399-Heavy-Launch-Rocket-Finesse-Challenge?p=1135470\u0026amp;viewfull=1#post1135470\u0022 rel=\u0022external nofollow\u0022\u003ERed Iron Crown - 3475 points\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E4. \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78399-Heavy-Launch-Rocket-Finesse-Challenge?p=1128855\u0026amp;viewfull=1#post1128855\u0022 rel=\u0022external nofollow\u0022\u003ERakaydos - 2005 points\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E5.\u003C/p\u003E\u003Cp\u003E6.\u003C/p\u003E\u003Cp\u003E7.\u003C/p\u003E\u003Cp\u003E8.\u003C/p\u003E\u003Cp\u003E9.\u003C/p\u003E\u003Cp\u003E10.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-08-10T22:54:33Z\u0022 title=\u002208/10/2014 10:54  PM\u0022 data-short=\u00229 yr\u0022\u003EAugust 10, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-30T09:12:16Z","Content":"\n\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/WiOR0\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EMods are FAR and Stock Rebalance. 150 tons to orbit with Fuel to Spare. (this was my Apollo to Dres and back mission) (3000 points for payload \u002B70 for fuel -200 for FAR)\u003C/p\u003E\u003Cp\u003ELauncher is 88 parts (payload is part bloated, however) -440 points\u003C/p\u003E\u003Cp\u003E1422 tons on the pad 71x5=-355 points\u003C/p\u003E\u003Cp\u003ESize matters, Kerbals in space. \u002B20\u003C/p\u003E\u003Cp\u003ETotals: 3090-995\u003C/p\u003E\u003Cp\u003E= 2095 points\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-30T15:50:22Z\u0022 title=\u002204/30/2014 03:50  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 30, 2014\u003C/time\u003E by Rakaydos\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sensi","CreatedById":96840,"CreatedDateTime":"2014-04-30T09:36:55Z","Content":"\n\u003Cp\u003ERakaydos, your payload score looks a bit deflated, at 1/10 of its correct value. The rule is \u0022Pride and Profit \u003Cstrong\u003E\u002B10 points\u003C/strong\u003E for every half-ton of payload to make it to orbit\u0022. Your total score should be 2095 points.\u003C/p\u003E\n"},{"CreatedByName":"SRV Ron","CreatedById":69806,"CreatedDateTime":"2014-04-30T12:04:49Z","Content":"\n\u003Cp\u003ENot sure how this would stack up. It was done for a challenge to launch orange fuel cans to orbit. All stock. Payload is five full of fuel orange fuel cans with docking port, control pod, SAS, two sets of RCS, and RCS fuel can. Photo shows the last boost stage still connected to the payload with over 1/2 of its fuel remaining.\u003C/p\u003E\u003Cp\u003EA lot of braces were needed to hold that thing together during launch.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/UgECGod.jpg\u0022 alt=\u0022UgECGod.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/JspCvuz.jpg\u0022 alt=\u0022JspCvuz.jpg\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-30T12:23:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E1.2 MEGATONS (1,200 tons)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E[nitpick]Those are kilotons[/nitpick]\u003C/p\u003E\u003Cp\u003EAre you interested in stock entries? I\u0027d like to give this a go, but I think part count for stock entries will not be competitive with ones that use procedural parts.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T17:10:11Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003E[nitpick]Those are kilotons[/nitpick]\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EGood point. My bad. I wrote that while laid up with a cold late at night, unable to get to sleep. Fixing it now...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003EAre you interested in stock entries? I\u0027d like to give this a go, but I think part count for stock entries will not be competitive with ones that use procedural parts.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EStock entries are fine- though for simplicity, they\u0027re not in their own category, and might not be as competitive. The big thing is actually the amount of payload you can get to orbit. And, as for points- you can pick up a LOT by launching from a mountaintop (although I was thinking of EXPl Launchpads, this is actually possible with Stock- just set up a jet-powered skycrane to carry large segments of the rocket to the new launchpad, and connect them with docking ports...)\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T17:17:31Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022http://imgur.com/a/WiOR0\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/WiOR0\u003C/a\u003E\u003Cp\u003EMods are FAR and Stock Rebalance. 150 tons to orbit with Fuel to Spare. (this was my Apollo to Dres and back mission) (3000 points for payload \u002B70 for fuel -200 for FAR)\u003C/p\u003E\u003Cp\u003ELauncher is 88 parts (payload is part bloated, however) -440 points\u003C/p\u003E\u003Cp\u003E1422 tons on the pad 71x5=-355 points\u003C/p\u003E\u003Cp\u003ESize matters, Kerbals in space. \u002B20\u003C/p\u003E\u003Cp\u003ETotals: 3090-995\u003C/p\u003E\u003Cp\u003E= 2095 points\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m afraid it\u0027s actually disqualified. The rules clearly stated:\u003C/p\u003E\u003Cp\u003E(1) \u003Cstrong\u003E\u0022Your rockets may reach a maximum weight of 1.2 MEGATONS (1,200 tons)\u0022\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E(2) \u003Cstrong\u003E\u0022The following mods are allowed...\u0022\u003C/strong\u003E nowhere on the list including Stock Rebalance- which I\u0027m unfamiliar with. Though, if you could describe it to me and make good case for it- I might decide to allow it.\u003C/p\u003E\u003Cp\u003E(3) \u003Cstrong\u003E \u0022Payload is defined as a detachable portion of the rocket which may be utilized for other purposes. It MAY NOT contain any engines used during ascent (even though use of payload engines in normally a good idea in normal play), air intakes, or parts with lift. It must have an accessible docking port, by which it detaches from all other stages.\u0022\u003C/strong\u003E You\u0027re missing a docking port on your payload, which I specifically direct you to use to allow it to detach from the lower stages (this was to keep the part-counts down, actually, so more people can use craft posted here if you decide to share the craft file. The docking port allows the attachment of an \u0022orbital tug\u0022 to move the payload to wherever it is needed...)\u003C/p\u003E\u003Cp\u003EI apologize for mixing megatons and kilotons- but the point is clear (1,200,000 tons would be unimaginably large, so the intent was obvious...) Submit something a bit lighter. I recommend trying to trim down the part-count (for points) while you\u0027re at it.\u003C/p\u003E\u003Cp\u003EBy the way, I recommend using a dummy-payload to minimize its part count. Just a giant fuel tank with a command module slapped on (and a couple solar panels for the life support, if you\u0027re running TAC Life Support), and a docking port.\u003C/p\u003E\u003Cp\u003EAlso, since I haven\u0027t seen any entries that meet all the requirements yet (the orange tank bit was also overweight, *AND* over maximum part count- as one of the screenshots during ascent revealed), I\u0027m going to add one more bonus category I meant to add before, but forgot, for a Space-X style or spaceplane launch... This one will be worth BIG points.\u003C/p\u003E\u003Cp\u003EI also increased the FAR and Airbreather penalties a bit, after seeing the magnitude of the score you would have had for your rocket, had it not been DQ\u0027d... (honestly, I didn\u0027t expect players to submit rockets that could lift 150 tons... Then again, these are Kerbal Space Program players we are talking about...) \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-30T18:11:46Z\u0022 title=\u002204/30/2014 06:11  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 30, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-30T17:32:59Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/75272\u0022 rel=\u0022external nofollow\u0022\u003EStock Rebalance\u003C/a\u003E would seem to be within the spirit of the challenge, it nerfs the 48-7S and the new SLS parts a bit and boosts some of the more useless engines. If anything, it makes the challenge more difficult than stock.\u003C/p\u003E\u003Cp\u003EChallenge writer\u0027s choice, of course.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-30T17:33:08Z","Content":"\n\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/76653-Modding-Mondays-Stock-Rebalance-Project\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/76653-Modding-Mondays-Stock-Rebalance-Project\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EBasically, it\u0027s a mod for people who think the ARM engines are too efficent for their thrust, and fixes a few of the weaker engines while they\u0027re at it. I use the fueled nosecones and adapters and the nerfed engines.\u003C/p\u003E\u003Cp\u003EHmm, taking 220 tons off the launcher\u002Bpayload, and giving up extra fuel...\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-30T17:38:02Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E(I don\u0027t know if the orange tank bit is over the maximum tonnage, since the poster did not give its weight on the launchpad- but I suspect it is, as it\u0027s a lot bigger than your entry which was already overweight)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027m not so sure about that... the orange tank lifter is only about 2 orange tanks tall, not countng the payload. My lifter (up to the stack separater that I\u0027m calling \u0022payload starts here\u0022 is about 4 orange tanks tall. His might be wider, but I do think mine is heavier.\u003C/p\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-04-30T18:35:51Z","Content":"\n\u003Cp\u003ERevised version: 150 tons to orbit, 1157 tons on the pad, 105 parts including payload, FAR and Stock Rebalance.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/BY74O\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EFAR penalty: -240\u003C/p\u003E\u003Cp\u003EPart Count: -525\u003C/p\u003E\u003Cp\u003ELaunchpad mass: -290 \u002B10 for over 1000 tons\u003C/p\u003E\u003Cp\u003EPayload: \u002B3000 \u003C/p\u003E\u003Cp\u003EKerbals: \u002B10\u003C/p\u003E\u003Cp\u003ERoom for Error: \u002B40\u003C/p\u003E\u003Cp\u003E=2005 points\u003C/p\u003E\u003Cp\u003EEdit: there IS a docking ring Sr on the back.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T18:45:06Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003EI\u0027m not so sure about that... the orange tank lifter is only about 2 orange tanks tall, not countng the payload. My lifter (up to the stack separater that I\u0027m calling \u0022payload starts here\u0022 is about 4 orange tanks tall. His might be wider, but I do think mine is heavier.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ECheck the screenshots. They reveal it has 482 parts and weighs 1452.37 tons, AFTER it has already lifted off and burned some of its fuel. Definitely overweight.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T18:47:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/76653-Modding-Mondays-Stock-Rebalance-Project\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/76653-Modding-Mondays-Stock-Rebalance-Project\u003C/a\u003E\u003Cp\u003EBasically, it\u0027s a mod for people who think the ARM engines are too efficent for their thrust, and fixes a few of the weaker engines while they\u0027re at it. I use the fueled nosecones and adapters and the nerfed engines.\u003C/p\u003E\u003Cp\u003EHmm, taking 220 tons off the launcher\u002Bpayload, and giving up extra fuel...\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOK, looks good. \u0022Stock Rebalance\u0022 will be added to the list of allowed mods.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-04-30T18:54:16Z","Content":"\n\u003Cp\u003ERakaydos, pressing the F1 key in game will give you a screenshot of just the game saved in ksp_win\\screenshots, rather than a screenshot of your whole desktop.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-04-30T19:19:54Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003ERevised version: 150 tons to orbit, 1157 tons on the pad, 105 parts including payload, FAR and Stock Rebalance.\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/BY74O\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/BY74O\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFAR penalty: -240\u003C/p\u003E\u003Cp\u003EPart Count: -525\u003C/p\u003E\u003Cp\u003ELaunchpad mass: -290 \u002B10 for over 1000 tons\u003C/p\u003E\u003Cp\u003EPayload: \u002B3000 \u003C/p\u003E\u003Cp\u003EKerbals: \u002B10\u003C/p\u003E\u003Cp\u003ERoom for Error: \u002B40\u003C/p\u003E\u003Cp\u003E=2005 points\u003C/p\u003E\u003Cp\u003EEdit: there IS a docking ring Sr on the back.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI\u0027ll add your entry to the Scoreboard. Congratulations on being the first player on the Scoreboard!\u003C/p\u003E\u003Cp\u003EBy the way, take note of what Red Iron Crown said- you\u0027re wasting space on the image window, as well as compromising your own privacy, by showing part of your desktop.\u003C/p\u003E\u003Cp\u003EEDIT: By the way, although I don\u0027t doubt the part-count you give, please add in a screenshot from the VAB or Orbital Map listing part-count.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-30T19:23:56Z\u0022 title=\u002204/30/2014 07:23  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 30, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sensi","CreatedById":96840,"CreatedDateTime":"2014-05-01T23:35:49Z","Content":"\n\u003Cp\u003EHere is my entry :\u003C/p\u003E\u003Cp\u003ETotal mass : 1185 tons\u003C/p\u003E\u003Cp\u003EPayload mass : 243 tons\u003C/p\u003E\u003Cp\u003E77 parts, one dual docking port (2.5m - 3.75m)\u003C/p\u003E\u003Cp\u003EMods used : KW Rocketry and Mechjeb\u003C/p\u003E\u003Cp\u003EScores :\u003C/p\u003E\u003Cp\u003EMoney talks : -385 points\u003C/p\u003E\u003Cp\u003EFuel isn\u0027t free : -295 points\u003C/p\u003E\u003Cp\u003ESize matters : \u002B10 points\u003C/p\u003E\u003Cp\u003EKerbals in space : \u002B10 points\u003C/p\u003E\u003Cp\u003EPride and profit : \u002B 4860 points\u003C/p\u003E\u003Cp\u003ETotal : 4200 points\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/ug5Ck\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EFly safe.\u003C/p\u003E\u003Cp\u003ESensi.\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-02T19:34:00Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sensi\u0022 data-cite=\u0022Sensi\u0022\u003E\u003Cdiv\u003EHere is my entry :\u003Cp\u003ETotal mass : 1185 tons\u003C/p\u003E\u003Cp\u003EPayload mass : 243 tons\u003C/p\u003E\u003Cp\u003E77 parts, one dual docking port (2.5m - 3.75m)\u003C/p\u003E\u003Cp\u003EMods used : KW Rocketry and Mechjeb\u003C/p\u003E\u003Cp\u003EScores :\u003C/p\u003E\u003Cp\u003EMoney talks : -385 points\u003C/p\u003E\u003Cp\u003EFuel isn\u0027t free : -295 points\u003C/p\u003E\u003Cp\u003ESize matters : \u002B10 points\u003C/p\u003E\u003Cp\u003EKerbals in space : \u002B10 points\u003C/p\u003E\u003Cp\u003EPride and profit : \u002B 4860 points\u003C/p\u003E\u003Cp\u003ETotal : 4200 points\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/ug5Ck\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/ug5Ck\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFly safe.\u003C/p\u003E\u003Cp\u003ESensi.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice showing, but see the definition of payload:\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E- You will receive points for every half-ton of payload to make it to orbit. This is by far the most important source of points. Payload is defined as a detachable portion of the rocket which may be utilized for other purposes. It MAY NOT contain any engines used during ascent (even though use of payload engines in normally a good idea in normal play), air intakes, or parts with lift. It must have an accessible docking port, by which it detaches from all other stages. If the payload is 1.25 meters or more, the docking port must be a standard Clamp-O-Tron or larger. If the payload is 2.5 meters or more, the docking port must be a Clamp-O-Tron Senior or larger. The payload may contain no SAS force, except for a single crewed command module, or probe core.\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EYour payload has to be *detachable* via a docking port. Think of the contract parameters requiring this as being to allow for multi-modular assembly of large interplanetary ships...\u003C/p\u003E\u003Cp\u003ERe-do it with a payload detachable from the sustainment engine- which still appears to be attached in the final screenshot (this will lower your score a little bit, as it will require at least one additional part, will increase your rocket\u0027s mass and drag- and the sustainment engine may not count towards the payload), and submit. Make sure to take a screenshot showing payload mass AFTER its detachment from all other stages.\u003C/p\u003E\u003Cp\u003EAlso, please include a screenshot showing mass before takeoff.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-02T19:37:17Z\u0022 title=\u002205/02/2014 07:37  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 2, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Rakaydos","CreatedById":101988,"CreatedDateTime":"2014-05-02T21:19:20Z","Content":"\n\u003Cp\u003EThe problem with the docking port requirement is that it\u0027s a dummy payload anyway, and you have to take special care that you dont let the docking ports leak fuel from the payload to the lift stage. I used a stack separater-\u0026gt;Docking port connection to block fuel flow, but when counting parts for a dummy payload, the docking port is just an extra part you have to add.\u003C/p\u003E\n"},{"CreatedByName":"Sensi","CreatedById":96840,"CreatedDateTime":"2014-05-02T22:56:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003E Your payload has to be *detachable* via a docking port [...] the sustainment engine- which still appears to be attached in the final screenshot [...] Also, please include a screenshot showing mass before takeoff\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E The first screenshot shows the vessel mass before takeoff in the vessel info window to the right of the navball. And there is no engine attached to the payload. On the final screenshot, you can see the pointy end to the left, and the docking port to the right, from which the ascent stage has been detached. Take a look at the screenshots again, I\u0027ve put some red ink where you should look... \u003C/p\u003E\u003Cp\u003EThat said, I could possibly have misunderstood what you\u0027ve meant in your rules as I\u0027m not blessed with an English tongue... oh well...\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Rakaydos\u0022 data-cite=\u0022Rakaydos\u0022\u003E\u003Cdiv\u003Eyou have to take special care that you dont let the docking ports leak fuel from the payload to the lift stage. I used a stack separater-\u0026gt;Docking port connection to block fuel flow\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust disable crossfeed on your docking port before launch et voilÃƒÂ , no fuel leaks anymore and no need for a stack separator.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-02T23:15:45Z\u0022 title=\u002205/02/2014 11:15  PM\u0022 data-short=\u002210 yr\u0022\u003EMay 2, 2014\u003C/time\u003E by Sensi\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"xrayfishx","CreatedById":76147,"CreatedDateTime":"2014-05-02T23:46:48Z","Content":"\n\u003Cp\u003EI would try this, but I don\u0027t get why there are so many rules about what the payload must be. I mean, isn\u0027t this challenge about building lifters?\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-03T08:20:39Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sensi\u0022 data-cite=\u0022Sensi\u0022\u003E\u003Cdiv\u003EThe first screenshot shows the vessel mass before takeoff in the vessel info window to the right of the navball. And there is no engine attached to the payload. On the final screenshot, you can see the pointy end to the left, and the docking port to the right, from which the ascent stage has been detached. Take a look at the screenshots again, I\u0027ve put some red ink where you should look... \u003Cp\u003EThat said, I could possibly have misunderstood what you\u0027ve meant in your rules as I\u0027m not blessed with an English tongue... oh well...\u003C/p\u003E\u003Cp\u003EJust disable crossfeed on your docking port before launch et voilÃƒÂ , no fuel leaks anymore and no need for a stack separator.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhhh, I see- not sure how I missed those details before...\u003C/p\u003E\u003Cp\u003EI thought those were the engines, not docking ports, in the last screenshot- since it looks so similar to the 2nd-last screenshot. But now that you point out there are no engines on the staging tab... Where did the engines go from the 2nd-last screenshot though? (I don\u0027t see them floating nearby as debris- and without thrust or having used RCS, the rocket couldn\u0027t have moved far away from them...)\u003C/p\u003E\u003Cp\u003ESorry about all that. I\u0027ve been sick with first a cold and then a upper respiratory infection and cough most of this week (which has made it hard to sleep- thus making me tired and sleep-deprived), so I haven\u0027t been quite as keen on the details as usual...\u003C/p\u003E\u003Cp\u003EYou\u0027re good, no changes needed. I\u0027ll enter you on the Scoreboard shortly...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-03T08:30:51Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022xrayfishx\u0022 data-cite=\u0022xrayfishx\u0022\u003E\u003Cdiv\u003EI would try this, but I don\u0027t get why there are so many rules about what the payload must be. I mean, isn\u0027t this challenge about building lifters?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EI encourage you to submit an entry!\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EThe payload rules aren\u0027t complex actually.\u003C/strong\u003E Basically, just use an appropriate-sized docking port for the size of the payload (now that I see how heavy some of the payload here are, maybe I should have given rules for 3.75 and 5-meter payloads as well- I guess I\u0027ll just tell you guys to practice common sense and build something that won\u0027t wobble like a wet noodle when docked at this point...), keep the payload separate from the stages used to ascend and circularize the orbit, and don\u0027t use things that are only of utility in-atmosphere as part of the payload (such as air intakes or wings).\u003C/p\u003E\u003Cp\u003EOther than that you\u0027ve got pretty free-reign as to what is in your payload: you can even include solar panels or nuclear reactors (conventional fission only, please) in the payload if you want, and use the electricity to help drive KSP-Interstellar plasma engines in an upper stage to circularize the orbit, and maximize payload fraction... I would only ask that you throw a Microwave Beamed Power Transmitter onto the payload if you do this, so hauling the electrical equipment to orbit would at least have some conceivable justification...\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-03T08:37:10Z\u0022 title=\u002205/03/2014 08:37  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 3, 2014\u003C/time\u003E by Northstar1989\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Sensi","CreatedById":96840,"CreatedDateTime":"2014-05-03T12:33:10Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Northstar1989\u0022 data-cite=\u0022Northstar1989\u0022\u003E\u003Cdiv\u003EWhere did the engines go from the 2nd-last screenshot though? (I don\u0027t see them floating nearby as debris- and without thrust or having used RCS, the rocket couldn\u0027t have moved far away from them...)\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThe ascent stage was detached in Kerbin\u0027s shadow. I used time warp until the payload was in sun light before taking the last screenshot. The ascent stage had time to drift (not far) away. \u003C/p\u003E\u003Cp\u003ENow, take your medicine and go to bed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Northstar1989","CreatedById":91005,"CreatedDateTime":"2014-05-03T19:18:43Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Sensi\u0022 data-cite=\u0022Sensi\u0022\u003E\u003Cdiv\u003EThe ascent stage was detached in Kerbin\u0027s shadow. I used time warp until the payload was in sun light before taking the last screenshot. The ascent stage had time to drift (not far) away. \u003Cp\u003ENow, take your medicine and go to bed \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022:wink:\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAhhh... OK.\u003C/p\u003E\u003Cp\u003EI hope you enjoyed the challenge! I was hoping to see a few more entries than this, but oh well... I might spice things up with an entry of my own, and give it another week.\u003C/p\u003E\u003Cp\u003ERegards,\u003C/p\u003E\u003Cp\u003ENorthstar\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-05-04T02:08:25Z","Content":"\n\u003Cp\u003EA stock \u002B Mechjeb entry.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/Jl9QM\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003EScore:\u003C/p\u003E\u003Cp\u003E4140 Pride \u0026amp; Profit\u003C/p\u003E\u003Cp\u003E10 Size Matters\u003C/p\u003E\u003Cp\u003E10 Kerbals in Space!\u003C/p\u003E\u003Cp\u003E-295 Fuel Isn\u0027t Free\u003C/p\u003E\u003Cp\u003E-390 Money Counts\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003E3475 Total\u003C/strong\u003E\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-04T02:38:07Z\u0022 title=\u002205/04/2014 02:38  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 4, 2014\u003C/time\u003E by Red Iron Crown\u003C/strong\u003E\n\u003C/span\u003E\n"}]}