{"TopicId":71064,"ForumId":25,"TopicTitle":"Kerbal Dynamics: Tour de Kerbin","CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-04-30T19:54:22Z","PageNum":1,"Articles":[{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-04-30T19:54:22Z","Content":"\n\u003Cp\u003EAs part of our sporting series, the Boffs have decided on a test event: the Tour de Kerbin.\u003C/p\u003E\u003Cp\u003ETHE CHALLENGE:\u003C/p\u003E\u003Cp\u003EBuild a tandem-wheeled vehicle (one wheel behind the other), AKA bicycle, or in this case, it would be a motorcycle) and take it on a test ride on the following course:\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022https://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-prn2/t1.0-9/10171793_440489899420346_9123204679358674286_n.jpg\u0022 alt=\u002210171793_440489899420346_9123204679358674286_n.jpg\u0022\u003E\u003C/p\u003E\u003Cp\u003EDescription:\u003C/p\u003E\u003Cp\u003EFrom the West end of the runway, past the hanger and the VAB, around the launch pad, antenna array and building complex, enter the complex around the astronaut complex and back under the bridge, past the research building reactor, take a left and follow the building round, behind the VAB and slip between the VAB and mission control, and finish at the East end of the runway.\u003C/p\u003E\u003Cp\u003ETHE RULES:\u003C/p\u003E\u003Cp\u003E- Any structural mod valid, HOWEVER:\u003C/p\u003E\u003Cp\u003E- The ONLY parts that are allowed to touch the ground at any point* are TWO WHEELS. Nothing else may touch the ground, and the vehicle may not LEAVE the ground - except for fleeting moments of \u0022sweet air\u0022.\u003C/p\u003E\u003Cp\u003E- The wheels MUST be arranged on a single track line (ie one follows the other) as in a bicycle, not twin-track as in a barrow.\u003C/p\u003E\u003Cp\u003E- Any form of propulsion valid.\u003C/p\u003E\u003Cp\u003E- No violating the laws of physics with exploits or cheats or any of that stuff.\u003C/p\u003E\u003Cp\u003E- From the point where you leave the runway to the point where you reenter the complex at the astronaut complex, your wheels may NOT meet concrete.\u003C/p\u003E\u003Cp\u003E- Your vehicle must be manned by a Kerbal.\u003C/p\u003E\u003Cp\u003E- Your vehicle and Kerbal must survive.\u003C/p\u003E\u003Cp\u003E- *You may use a launch clamp at launch to hold your vehicle upright, however this will be the only point where you will be allowed to jettison parts.\u003C/p\u003E\u003Cp\u003ESCORING:\u003C/p\u003E\u003Cp\u003EThe most Kerbal design. To get an in-game MET time from a vehicle that doesn\u0027t leave the ground, rock your vehicle back and forth until both wheels leave the ground, then when the mission clock starts, start rolling.\u003C/p\u003E\u003Cp\u003E(\u003Cem\u003EChallenger\u0027s Note: Bikes are possible, I\u0027ve seen them done. Manley on Duna, for one.\u003C/em\u003E)\u003C/p\u003E\u003Cp\u003ELEADERBOARD:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78451-Kerbal-Dynamics-Tour-de-Kerbin?p=1129247\u0026amp;viewfull=1#post1129247\u0022 rel=\u0022external nofollow\u0022\u003EKanil\u003C/a\u003E in his minimalist design, for a pacesetting 3:42 and reports that the course is bumpy and challenging with fast straights and heavy-braking corners.\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-05-01T07:39:00Z\u0022 title=\u002205/01/2014 07:39  AM\u0022 data-short=\u002210 yr\u0022\u003EMay 1, 2014\u003C/time\u003E by ihtoit\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Kanil","CreatedById":377,"CreatedDateTime":"2014-04-30T21:55:06Z","Content":"\n\u003Cp\u003EAre short jumps acceptable? The course has some steep drops, and a few ramps in it...\u003C/p\u003E\u003Cp\u003EEdit: Well, I went ahead and attempted it. Here\u0027s my first complete run.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/K5KF5\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-04-30T23:19:13Z\u0022 title=\u002204/30/2014 11:19  PM\u0022 data-short=\u002210 yr\u0022\u003EApril 30, 2014\u003C/time\u003E by Kanil\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-05-01T07:35:45Z","Content":"\n\u003Cp\u003Esweet run \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E And you\u0027re right, those bumps do cause air, slight rule adjustment.\u003C/p\u003E\n"}]}