{"TopicId":74289,"ForumId":25,"TopicTitle":"Kerbal Dynamics: William Tell","CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-06-06T09:33:52Z","PageNum":1,"Articles":[{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-06-06T09:33:52Z","Content":"\n\u003Cp\u003EThe Kerbania State Circus is in need of a new Kerbal Cannonball act since the previous one... still hasn\u0027t landed yet.\u003C/p\u003E\u003Cp\u003ETHE CHALLENGE:\u003C/p\u003E\u003Cp\u003EFire a Kerbal from one end of the runway (ie behind the \u002209\u0022 marker where you start) to hit a target at the other end of the runway (ie behind the \u002227\u0022 end marker)\u003C/p\u003E\u003Cp\u003ETHE RULES:\u003C/p\u003E\u003Cp\u003E - Target shall consist of a probe core, a horizontal panel 4x4m in dimension and utilising electric wheels to move it to its parking spot. All parts should be available in stock inventory.\u003C/p\u003E\u003Cp\u003E - Distance between the Kerbal launch point and the centre of the target shall be exactly 2.5km. Essentially, this puts the target centre 13m from the East end of the runway.\u003C/p\u003E\u003Cp\u003E - Launcher shall be static (no wheels or skids) and fire the Kerbal mass in a manner akin to a cannon or catapult. No running starts.\u003C/p\u003E\u003Cp\u003E - NO CHUTES.\u003C/p\u003E\u003Cp\u003E - Kerbal shall have no propulsion, lift or control surface assistance throughout the ballistic phase of flight. Kerbal may be attached to an inert mass to aid in launch, however this must offer no aid in flight.\u003C/p\u003E\u003Cp\u003E - Any structural part valid.\u003C/p\u003E\u003Cp\u003E - No violating the laws of physics. Et Cetera.\u003C/p\u003E\u003Cp\u003E - No limit to the number of attempts. Easiest way to prove separate attempts on multiple hits is to use Kerbals with different names!\u003C/p\u003E\u003Cp\u003ESCORING:\u003C/p\u003E\u003Cp\u003EKerbal collisions with target vehicle panels shall count as a hit (F3 reporting after impact), else a miss.\u003C/p\u003E\u003Cp\u003EHit=1pt\u003C/p\u003E\u003Cp\u003E(\u003Cem\u003EChallenger\u0027s Note: plenty of close ones here using a trebuchet, nothing closer than 275m tho. Will post pic of my first hit. If I can manage one!\u003C/em\u003E)\u003C/p\u003E\n"}]}