{"TopicId":86265,"ForumId":25,"TopicTitle":"The Eve Rocks Challenge (v0.90 only)","CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-10-06T23:26:12Z","PageNum":8,"Articles":[{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-14T14:21:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022hazard-ish\u0022 data-cite=\u0022hazard-ish\u0022\u003E\u003Cdiv\u003EI do have one question though. I am about to start recording the mission and I\u0027d rather find out now rather than later. I also plan on visiting Gilly with a small ion probe as part of the mission to complete my career mode series on youtube, but it uses an external command seat to make the ion propulsion feasible. Is that okay? My actual Eve lander, as you saw, now includes a command capsule and the additional challenge of Gilly isn\u0027t mentioned on this forum so would my attempt still be accepted even if I visit Gilly with a command seat then Eve with a capsule?\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThis challenge is only about the Eve landing itself. Whatever else you do besides can be done any way you wish.\u003C/p\u003E\n"},{"CreatedByName":"hazard-ish","CreatedById":115844,"CreatedDateTime":"2014-11-14T14:23:59Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EThis challenge is only about the Eve landing itself. Whatever else you do besides can be done any way you wish.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EWonderful!\u003C/p\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2014-11-14T17:32:25Z","Content":"\n\u003Cp\u003EHi All \u003C/p\u003E\u003Cp\u003EHere is my come back for the \u0022BIG\u0022 Eve Rocks Challenge (Jebediah\u0027s Level) try... \u003C/p\u003E\u003Cp\u003EIt\u0027s the lander of Eve Jeb Landing AR 9 with... some added tanks/motors lol !\u003C/p\u003E\u003Cp\u003EJust to say that if you have low weight in last stage, you dont need too much fuel for the ship \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003EI\u0027m always trying to keep that in mind in ksp...\u003C/p\u003E\u003Cp\u003EThe Craft file of \u0022\u003Ca href=\u0022https://drive.google.com/file/d/0B2QsqoF78kPFVXhQVjhRWG15bWM/view?usp=sharing\u0022 rel=\u0022external nofollow\u0022\u003EEve Jeb Landing AR 10\u0022\u003C/a\u003E\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003Cp\u003E1,024,676$ invested, less than 250000$ final cost, 269 Tons at launch from Kerbin, and less than 98 Tons ready to Launch at 5m ASL on Eve.\u003C/p\u003E\u003Cp\u003E897parts (outch) full stock \u002B MechJeb2.\u003C/p\u003E\u003Cp\u003EKSP 0.25.\u003C/p\u003E\u003Cp\u003EI found this flat 5m landing site while trying to land near the equator on a precedent mission \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003E(Eve Jeb Landing AR 10 is the last of a looong loooooong series of ships lol, I see I\u0027m not alone \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E )\u003C/p\u003E\u003Cp\u003EMore easy mission than Eve Jeb Landing AR 9, but for launching the big ship from Kerbin with a SSTO lifter... I tried less than 250Tons, but that was too hard for me, and really slow motion with 900 parts \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_sad.gif\u0022 alt=\u0022:(\u0022\u003E\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/2F4cr\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E BIG album... with all datas.... xD\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-14T20:43:18Z\u0022 title=\u002211/14/2014 08:43  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 14, 2014\u003C/time\u003E by astrobond\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-14T20:36:48Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Signo\u0022 data-cite=\u0022Signo\u0022\u003E\u003Cdiv\u003ELaie asked me some more hints about the asymmetric mothership. Well, the concept comes from the souposphere itself. It behaves like a dense fluid so why not exploiting it with a \u0022boat\u0022? A sailing ship is the best example of unbiased asimmetry I can recall. So here I have a kind of \u0022keel\u0022 (the reentry module - that I CAN redesign if you can not really stand that lonely clipped nuke) that needs a ballast on the other side. A slightly lighter and longer one (leverage ftw). So here you are with your beautiful command bridge. You just need to remember you must keep your ship with the correct attitude. It behaves like a kind of foil ship during aerobrakes. The lift provided by the crew cabin on the tail, even if really small compared to the total overall mass, keeps it en route w/o tailspinning. Moreover you can always count on the 200\u002B available torque force. Obviously it does not work properly if you snap on it really unbalanced loads, but I managed affordable configs with differences in the order of \u002B/- 5t. \u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAnd I was thinking that it was merely looking good -- which it does, by the way. I\u0027m way too utilitaristic and concerned with part count, I\u0027d never consider topping off the nacelles with radial tanks for example. And even if I did, it would probably look silly. I have no words for it, but you\u0027re doing something right. Also, the gentle sweep of your landing gear. Though after what you said about your rover, I\u0027d be not surprised to learn that the sweep serves an actual purpose as well.\u003C/p\u003E\u003Cp\u003EA bit of a shame about that rover, though, betraying it\u0027s sports-car appearance by being unable to go faster than 2x physics warp, because really, that matters a lot in a rover. By the way, I wonder what it has in it\u0027s pocketsess? (the cargo bay -- does it merely hold a few batteries and RTGs or is there something more interesting inside? That circle is a docking port, I presume.)\u003C/p\u003E\u003Cp\u003EThat clipped engine is a real problem, though. I don\u0027t want to fault an otherwise excellent mission for a technicality, but I\u0027m also wary of setting a precedent. In this particular case, I\u0027m inclined to look the other way, none the least because could just as well have returned with the vessel you came in. Front page will be updated shortly. @everyone else: as with launcher width, this doesn\u0027t mean that anything goes.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-14T21:39:18Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astrobond\u0022 data-cite=\u0022astrobond\u0022\u003E\u003Cdiv\u003E\u003Cp\u003E1,024,676$ invested, less than 250000$ final cost, 269 Tons at launch from Kerbin, and less than 98 Tons ready to Launch at 5m ASL on Eve.\u003C/p\u003E\u003Cp\u003E897parts (outch) full stock \u002B MechJeb2.\u003C/p\u003E\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E100t from sea level? That is impressive. Updating front page.\u003C/p\u003E\u003Cp\u003E(I\u0027m sorry: this tiny and clean design really deserves better than that, but I\u0027m out of adjectives for today).\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-14T21:53:58Z\u0022 title=\u002211/14/2014 09:53  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 14, 2014\u003C/time\u003E by Laie\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2014-11-14T22:40:46Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003E100t from sea level? That is impressive. Updating front page.\u003Cp\u003E(I\u0027m sorry: this tiny and clean design really deserves better than that, but I\u0027m out of adjectives for today).\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENo problems Laie and thank\u0027s a lot for the update ! i\u0027m just happy to be on the \u0022big\u0022 side of this challenge too \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E\u003C/p\u003E\u003Cp\u003EFly safe with Jeb !!!\u003C/p\u003E\n"},{"CreatedByName":"Signo","CreatedById":103766,"CreatedDateTime":"2014-11-15T00:46:40Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EAnd I was thinking that it was merely looking good -- which it does, by the way. I\u0027m way too utilitaristic and concerned with part count, I\u0027d never consider topping off the nacelles with radial tanks for example. And even if I did, it would probably look silly. I have no words for it, but you\u0027re doing something right. Also, the gentle sweep of your landing gear. Though after what you said about your rover, I\u0027d be not surprised to learn that the sweep serves an actual purpose as well.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EA large part of the \u0022core\u0022 solutions are inspired by a Jool 5 ship I\u0027ve seen many moons ago (I think it was Ziv\u0027s made, the one with the small 3fold landing chair on top). I just enlarged it using 3.75 parts and moar engines. \u003C/p\u003E\u003Cp\u003EI tried at first with a 90Ã‚Â° oriented gear but during the testing stage I ended up with several broken engines, collapsing legs and funky take offs. They simply did not hold. 5Ã‚Â° was enough to solve the problem. \u003C/p\u003E\u003Cp\u003EThe small circle on top of the rover is indeed a jr. docking port. It is exactly on top of the CoM so it can be used with skycranes or with some other \u0022modules\u0022 I designed to fit in a big cargo bay (extra tanks, science jr. and goo, chutes and whatever you may need). It serves also the \u0022control from here\u0022 purpose during powered VTOL. It is on top of a FLT800 tank that serves as the main body of the rover and that is connected to the rear wheels. Then you have the batteries and RTGs you thought about, a couple of small SAS and the room for the scientific stuff. The bay can hold 50 m/s hits, so it serves as the \u0022armor\u0022 too. And, usually it does not happen so often, but if you find yourself down under you can just open the bay and flip back on your wheels. Below a couple of pics of the rover with its \u0022orbital wing\u0022. \u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/v2rJs\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-15T02:04:49Z\u0022 title=\u002211/15/2014 02:04  AM\u0022 data-short=\u00229 yr\u0022\u003ENovember 15, 2014\u003C/time\u003E by Signo\u003C/strong\u003E\n\u003Cbr\u003EA lot of PS\n\u003C/span\u003E\n"},{"CreatedByName":"Trollsama","CreatedById":54566,"CreatedDateTime":"2014-11-15T06:51:53Z","Content":"\n\u003Cp\u003EWait.... so the rules of the challenge only apply to the landing itself?\u003C/p\u003E\u003Cp\u003EI can use chutes for the return home aspect of the mission and still have it count as \u0022Jeb\u0022 difficulty? \u003C/p\u003E\u003Cp\u003E\u0026gt;.\u0026gt; I have been doing far more work than i needed to lol\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-11-15T10:06:47Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00222001kraft\u0022 data-cite=\u00222001kraft\u0022\u003E\u003Cdiv\u003EHey guys!\u003Cp\u003EI have found out that Eve does support spaceplanes, I recorded a video testing all the main aspects e.g. landing, take offs, stalling, climbing, level flight, descending.\u003C/p\u003E\u003Cp\u003EMain problem: probably due to Squad trying to be realistic, the composition of Eve\u0027s atmosphere may very well affect the way spaceplanes or planes in general fly there. The aerodynamics are mega-strange, you need several vertical stabilizers in order for a gr8-working aircraft on Kerbin to be stable on Eve. To my dismay, I suck at building spaceplanes. Thankfully, I already know the rule #1 for this challenge: the smaller, the better. You actually can get into orbit with a spaceplane, too. But you need a crap load of fuel in order to do so. I\u0027ll think of something, but it will definitely be complicated. Maybe put an extra pair of fuel tanks on the sides? I don\u0027t know. Since Eve does not contain oxygen, you can\u0027t use air intakes and in stock there are no alternative methods of fuels besides ion, which is as useless as a Mk.3 fuselage. Guys, if you have any suggestions, please let me know. I don\u0027t know if I can do this myself, without any of your awesome ideas.\u003C/p\u003E\u003Cp\u003EKudos to all those who completed the challenge \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_cheesy.gif\u0022 alt=\u0022:D\u0022\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EJust an FYI, no-one has made a spaceplane that can escape Eve without using mods, glitches or cheats. In fact most people say it is mathematically impossible.\u003C/p\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-11-15T10:08:16Z","Content":"\n\u003Cp\u003EBTW, I did a 3 man Eve mission once upon a time, although I think the parameters I used fall outside this challenge. You can look at it for inspiration if you wish:\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/78246-3-Men-went-to-Eve-%28Very-Pic-Heavy!%29\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/78246-3-Men-went-to-Eve-%28Very-Pic-Heavy!%29\u003C/a\u003E\u003C/p\u003E\n"},{"CreatedByName":"Red Iron Crown","CreatedById":12858,"CreatedDateTime":"2014-11-15T12:01:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Redshift OTF\u0022 data-cite=\u0022Redshift OTF\u0022\u003E\u003Cdiv\u003EJust an FYI, no-one has made a spaceplane that can escape Eve without using mods, glitches or cheats. In fact most people say it is mathematically impossible.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ESpaceplanes are perfectly plausible for Eve ascent even in stock, it\u0027s single stage planes that are impossible. A plane designed for it would have to drop empty tanks and possibly engines on the way up.\u003C/p\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2014-11-15T13:39:25Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trollsama\u0022 data-cite=\u0022Trollsama\u0022\u003E\u003Cdiv\u003EWait.... so the rules of the challenge only apply to the landing itself?\u003Cp\u003EI can use chutes for the return home aspect of the mission and still have it count as \u0022Jeb\u0022 difficulty? \u003C/p\u003E\u003Cp\u003E\u0026gt;.\u0026gt; I have been doing far more work than i needed to lol\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EOops !\u003C/p\u003E\u003Cp\u003E\u0022Kerbhouston... we have a problem...\u0022\u003C/p\u003E\u003Cp\u003E\u0022I undocked the chutes stage before landing...\u0022\u003C/p\u003E\u003Cp\u003E\u0022Do you think i can try landing without chutes ?\u0022\u003C/p\u003E\u003Cp\u003Escriiitch....\u003C/p\u003E\u003Cp\u003E\u0022Of course you can try Jeb \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E... will see if this is possible that way !\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ok let\u0027s go :)\u0022\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/0DrT2\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\u003Cp\u003E\u0022yeahhh ;)\u0022\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-15T14:41:33Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Trollsama\u0022 data-cite=\u0022Trollsama\u0022\u003E\u003Cdiv\u003EWait.... so the rules of the challenge only apply to the landing itself?\u003Cp\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EHold on a second. \u003C/p\u003E\u003Cp\u003EThe particular \u0022no chutes, wings\u0026amp;c\u0022 achievement is only about the Eve lifter on Eve.\u003C/p\u003E\u003Cp\u003EThe general rules for this challenge (like no part clipping, stockish vessels and so on) apply to the entire mission, from lauch at Kerbin to return. If you do other things besides the core mission (like landing on Gilly), that\u0027s outside of the challenge and not subject to any rules. Actually, there is no rule about what you may or may not do on the surface of Eve. That is not an oversight. You may use kethane jets, balloons, dirigibles, infinigliders, walking robots, whatever you want -- none of that is a problem as long as it doesn\u0027t help you in getting to Eve or returning from there.\u003C/p\u003E\n"},{"CreatedByName":"2001kraft","CreatedById":120475,"CreatedDateTime":"2014-11-15T16:41:30Z","Content":"\n\u003Cp\u003EDirigibles on Eve is complete cheating.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-11-16T21:17:03Z","Content":"\n\u003Cp\u003E^^ Should they be stock, they\u0027d make all sense, just as it makes sense to launch rockets from a boat rather than from ocean bottom.\u003C/p\u003E\n"},{"CreatedByName":"Kulebron","CreatedById":80231,"CreatedDateTime":"2014-11-17T00:56:20Z","Content":"\n\u003Cp\u003E@Laie: please tell me if this clipping is ok? (Intakes slightly touching each other) I\u0027d be pleased to add more beams to have enough clearance, but parts count is already hitting me hard.\u003C/p\u003E\u003Cp\u003EGoing to do 3 launches to get all the assets in orbit. This is kinda reusing the jet booster, and also due to part count limit.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/VR8de3I.png\u0022 alt=\u0022VR8de3I.png\u0022\u003E\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-17T10:53:15Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003E@Laie: please tell me if this clipping is ok? (Intakes slightly touching each other) I\u0027d be pleased to add more beams to have enough clearance, but parts count is already hitting me hard.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EThat\u0027s barely noticable. Not a problem, go ahead. (You\u0027ve seen the example in the 1st post of this thread, have you?)\u003C/p\u003E\u003Cp\u003EIncidentally, if you\u0027re using editor extensions, the engines will surface-attach nicely. Maybe the intakes as well (can\u0027t recall). So you can save quite a few cubic struts. The vessel will still load and work in a stock game, the cubic struts are physicsless anyway... no harm, no foul. Just be sure to mention it in your submission.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-17T10:59:13Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EYou may use kethane jets, balloons, dirigibles, infinigliders, walking robots, whatever you want -- none of that is a problem as long as it doesn\u0027t help you in getting to Eve or returning from there.\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u00222001kraft\u0022 data-cite=\u00222001kraft\u0022\u003E\u003Cdiv\u003EDirigibles on Eve is complete cheating.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EIf you don\u0027t use it for the launch, it\u0027s not cheating for the purposes of this challenge.\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Kulebron\u0022 data-cite=\u0022Kulebron\u0022\u003E\u003Cdiv\u003E^^ Should they be stock, they\u0027d make all sense, just as it makes sense to launch rockets from a boat rather than from ocean bottom.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EShould they ever become stock, this challenge will probably cease to be a challenge.\u003C/p\u003E\n"},{"CreatedByName":"totalitor","CreatedById":69774,"CreatedDateTime":"2014-11-17T15:16:33Z","Content":"\n\u003Cp\u003EI made it. Sea level so this is level 3.\u003C/p\u003E\u003Cp\u003EMy ship is 1607 t on launchpad with delta-v 19314 m/s (vacuum). 394 parts, one launch.\u003C/p\u003E\u003Cp\u003EOn Eve\u0027s surface...I mean ocean...164 t.\u003C/p\u003E\u003Cp\u003EGame version 0.24.2.559.\u003C/p\u003E\u003Cp\u003EMechjeb used. Funds 849561.\u003C/p\u003E\u003Cp\u003EI tried to land on sea as near the shore as possible. It took many times to land right. Distance to land was 651 m and swimming time there was 15 min. I couldn\u0027t use time warp becouse for some reason it would crash the ship. I just pressed the button...\u003C/p\u003E\u003Cp\u003EI had a Eve ship earlier that made it to orbit from sea level but I used seat on it. I just added a command pod, more power to ship and rearrange the upper part of the ship. I still couldn\u0027t get the pod to orbit so I did EVA at the end where a return ship was waiting. (I had two return ships becouse of the balance of the ship).\u003C/p\u003E\u003Cp\u003EStage 5 was unstable, I don\u0027t know why. Steering was difficult.\u003C/p\u003E\u003Cp\u003EAnd stage 1 was ok when launching from Eve, but something happened and my asparagus system didn\u0027t work. I didn\u0027t have time to rearrage decoupling of tanks.\u003C/p\u003E\u003Cp\u003ENice trip. Thank you for this challenge.\u003C/p\u003E\u003Cblockquote lang=\u0022en\u0022\u003E\u003Ca href=\u0022//imgur.com/a/FGogy\u0022 rel=\u0022external nofollow\u0022\u003EJavascript is disabled. View full album\u003C/a\u003E\u003C/blockquote\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-17T15:39:50Z\u0022 title=\u002211/17/2014 03:39  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 17, 2014\u003C/time\u003E by totalitor\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-18T14:11:34Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022totalitor\u0022 data-cite=\u0022totalitor\u0022\u003E\u003Cdiv\u003E\u003Cp\u003EI tried to land on sea as near the shore as possible. It took many times to land right. Distance to land was 651 m and swimming time there was 15 min. I couldn\u0027t use time warp becouse for some reason it would crash the ship. I just pressed the button...\u003C/p\u003E\u003Cp\u003ENice trip. Thank you for this challenge.\u003C/p\u003E\u003Cp\u003E\u003Ca href=\u0022http://imgur.com/a/FGogy\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://imgur.com/a/FGogy\u003C/a\u003E\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003ENice trip, thank you for the submission. And congratulations: you completed the Eve Rocks Challenge on level 3.\u003C/p\u003E\u003Cp\u003EI have experimented with landing in the sea but eventually gave up. Vessels would tip over in the water, disassemble during launch, and whatnot. Making it work is not a small achievement. Also, running out of fuel is and abandoning the vessel isn\u0027t exactly unheard of, but you\u0027re the first who could do it at leisure and had the time to take a few screenshots along the way.\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-18T14:18:47Z","Content":"\n\u003Cp\u003EBy the way, I did it too. Updated my entry: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/95642-The-Eve-Rocks-Challenge?p=1455741\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/95642-The-Eve-Rocks-Challenge?p=1455741\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EIt doesn\u0027t seem right to just slap the badge on myself, so if someone else could please have a look?\u003C/p\u003E\n"},{"CreatedByName":"astrobond","CreatedById":127649,"CreatedDateTime":"2014-11-18T16:20:30Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Laie\u0022 data-cite=\u0022Laie\u0022\u003E\u003Cdiv\u003EBy the way, I did it too. Updated my entry: \u003Ca href=\u0022https://forum.kerbalspaceprogram.com/threads/95642-The-Eve-Rocks-Challenge?p=1455741\u0022 rel=\u0022external nofollow\u0022\u003Ehttp://forum.kerbalspaceprogram.com/threads/95642-The-Eve-Rocks-Challenge?p=1455741\u003C/a\u003E\u003Cp\u003EIt doesn\u0027t seem right to just slap the badge on myself, so if someone else could please have a look?\u003C/p\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EVery Nice Mission Laie !!!\u003C/p\u003E\u003Cp\u003E(3! for 3 Kerbals \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_wink.gif\u0022 alt=\u0022;)\u0022\u003E )\u003C/p\u003E\u003Cp\u003EYou completed the Eve Rocks Challenge on \u003Cspan style=\u0022color:#0000cd;\u0022\u003EJebediah\u0027s \u002BBill\u002BBob Level !\u003C/span\u003E\u003C/p\u003E\u003Cp\u003EYour roverboat is excellent, and the number of science points at the end of the mission is awesome \u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/p\u003E\u003Cp\u003ECongrats !\u003C/p\u003E\n\u003Cspan class=\u0022ipsType_reset ipsType_medium ipsType_light\u0022 data-excludequote=\u0022\u0022\u003E\n\u003Cstrong\u003EEdited \u003Ctime datetime=\u00222014-11-18T16:28:12Z\u0022 title=\u002211/18/2014 04:28  PM\u0022 data-short=\u00229 yr\u0022\u003ENovember 18, 2014\u003C/time\u003E by astrobond\u003C/strong\u003E\n\u003C/span\u003E\n"},{"CreatedByName":"Redshift OTF","CreatedById":78679,"CreatedDateTime":"2014-11-18T20:29:52Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022Red Iron Crown\u0022 data-cite=\u0022Red Iron Crown\u0022\u003E\u003Cdiv\u003ESpaceplanes are perfectly plausible for Eve ascent even in stock, it\u0027s single stage planes that are impossible. A plane designed for it would have to drop empty tanks and possibly engines on the way up.\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003EAh yes, I meant SSTO\u0027s but didn\u0027t state that. Thanks!\u003C/p\u003E\n"},{"CreatedByName":"Laie","CreatedById":110461,"CreatedDateTime":"2014-11-18T21:36:21Z","Content":"\n\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astrobond\u0022 data-cite=\u0022astrobond\u0022\u003E\u003Cdiv\u003EYou completed the Eve Rocks Challenge on \u003Cspan style=\u0022color:#0000cd;\u0022\u003EJebediah\u0027s \u002BBill\u002BBob Level !\u003C/span\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000cd;\u0022\u003ELOL -- thanks for that.\u003C/span\u003E\u003C/p\u003E\u003Cblockquote data-ipsquote=\u0022\u0022 class=\u0022ipsQuote\u0022 data-ipsquote-username=\u0022astrobond\u0022 data-cite=\u0022astrobond\u0022\u003E\u003Cdiv\u003E\u003Cspan style=\u0022color:#0000cd;\u0022\u003Ethe number of science points at the end of the mission is awesome \u003C/span\u003E\u003Cimg src=\u0022//kerbal-forum-uploads.s3.us-west-2.amazonaws.com/emoticons/default_k_smiley.gif\u0022 alt=\u0022:)\u0022\u003E\u003C/div\u003E\u003C/blockquote\u003E\u003Cp\u003E\u003Cspan style=\u0022color:#0000cd;\u0022\u003EThat number is probably only half of it -- I was transmitting all data that didn\u0027t fit into the pods, after all, so there was a lot of science points already collected by the time I recovered my vessel. Going through the science reports, I notice that \u0022flying at\u0022 is mostly complete, but I could have brought more from the surface. Shame, shame.\u003C/span\u003E\u003C/p\u003E\n"},{"CreatedByName":"James_Eh","CreatedById":95163,"CreatedDateTime":"2014-11-25T19:33:13Z","Content":"\n\u003Cp\u003EDarn it darn it darn it.\u003C/p\u003E\u003Cp\u003EHonestly this was just a large-scale test flight that I suddenly realized could actually qualify me for this challenge, and I was so excited about the shiny purple ribbon that I kept the flight going despite thinking of about 20 design improvements during the very laggy adventure.\u003C/p\u003E\u003Cp\u003EI have never used KER before but felt I needed it for this challenge, and have been wondering about the way the dV calcs were playing out. Until I happened to aim the camera just right to catch the following shot of the ship shortly before the final deorbit burn to head down to land. Anybody see the glaring flaw? I\u0027m still going to give it a go but I\u0027ll bet I have trouble in the last part of the ascent.\u003C/p\u003E\u003Cp\u003E\u003Cimg src=\u0022http://i.imgur.com/dXtVUie.jpg\u0022 alt=\u0022dXtVUie.jpg\u0022\u003E\u003C/p\u003E\n"}]}