{"TopicId":94791,"ForumId":25,"TopicTitle":"[STOCK/0.90] Kerbal Dynamics LAPES Demonstrator II (new version, slight rules rewrite)","CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-12-28T17:07:04Z","PageNum":1,"Articles":[{"CreatedByName":"ihtoit","CreatedById":78942,"CreatedDateTime":"2014-12-28T17:07:04Z","Content":"\n\u003Cp\u003EThe United Kerbal Defence Directorate has tasked the Boffs with a design challenge: a viable low altitude parachute ejection system.\u003C/p\u003E\u003Cp\u003ELow Altitude Parachute Extraction System (LAPES) is a tactical military airlift delivery method where a fixed wing cargo aircraft can deposit supplies when landing is not an option in an area that is too small to accurately parachute supplies from a high altitude.\u003C/p\u003E\u003Cp\u003ETHE CHALLENGE:\u003C/p\u003E\u003Cp\u003EBuild a Rover and deploy it using a LAPES from the REAR of a fixed wing aircraft.\u003C/p\u003E\u003Cp\u003ETHE RULES:\u003C/p\u003E\u003Cp\u003E- Stock parts ONLY.\u003C/p\u003E\u003Cp\u003E- Normal \u0027sploits rules apply.\u003C/p\u003E\u003Cp\u003E- Rover is a land vehicle with four electric wheels in two-by-two arrangement.\u003C/p\u003E\u003Cp\u003E- The Rover may be piloted by a Kerbal or by a probe core. The aircraft, however, must be piloted by a Kerbal.\u003C/p\u003E\u003Cp\u003E- The Rover must be loaded onboard the aircraft using a rear loading ramp prior to takeoff. ie, launch the rover first, move it aside, then go back to the SPH and launch your aircraft, load the Rover then do your takeoff roll. Alternatively, build your rover mounted on an improvised pallet (which must also carry a parachute)\u003C/p\u003E\u003Cp\u003E- Flight profile is as follows: Takeoff, fly 5km from the runway, minimum attained altitude MUST exceed 500m, LAPES launch altitude must NOT exceed 10m from terrain; this must occur AFTER minimum profile altitude is attained, and the launch may not occur from a landed profile - the aircraft must be in flight.\u003C/p\u003E\u003Cp\u003E- LAPES launch speed must NOT exceed 67m/s (130kt).\u003C/p\u003E\u003Cp\u003E- Rover MUST survive and roll in a controllable fashion at least 100m from its point of impact.\u003C/p\u003E\n"}]}